{
  "positive": [
    {
      "review": "After 80 something hours and not even getting to the extreme techs yet i can say i am hooked. Simplistic enough not to get overwhelmed, complex enough to keep you on your toes.\r\npros:\r\n interesting graphic style, pleasing to the eyes but not taxing on hardware\r\nactually decent tutorial\r\nenough systems to keep you playing for hours on end\r\nnice calming background music\r\nactually good trading system\r\nreally like the logistics system too\r\nwill probably add more after i experiment with tourism\r\ncons: (small QoL things)\r\ngrid system is kinda annoying but i get it too late to change now\r\nbatch remodel working for all buildings of that type means you gotta stock up resources especially for houses and no batch upgrade again for houses\r\nyou should be able to set up the logistics systems better like a transfer station always transfering to a certain warehouse so you dont need to ban certain items from all warehouses but one\r\npainting farms should go over the compost in the middle so you dont have to break them up into 4\r\n\r\noverall 8/10, easy 9/10 with some QoL updates and more DLC",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not the most intuitive with instructions, gotta watch videos and play around quite a bit before you get the hang of it. Some things aren't explained all that well, like how exactly logistics work and how to properly make use of them. The descriptions for items are/can be vague. But overall there's no game quite like this one, and it's my favorite colony sim/city builder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Settlement Survival is one of those games that once you figure out the logistics of what the citizens need (i.e. food, tools, and water at the beginning) then the game becomes easier. Forget the battling part though. That complicates it a lot more, but aside from the defending the village if you choose that option, the game is pretty fun and addictive. If you start with a bean of any type and hopefully cattle, you're on your way to a successful village.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The base mechanics of Banished with additions in mechanics on top.\r\nThe default map sizes are on the smaller size but still usable as compared to Banished there are lot of efficiency/upgrade approaches that improve things without needing to expand.\r\nSubjectively the world visuals a slight downgrade compared to Banished. And based on GPU usage I think an optimization pass would be useful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the age of the game, it's a great inexpensive addictive game with a free DLC update, if you love town builder games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "starts simple but gets really complicated. esp when your trying to find a good balance of production. either its not enough for you got 6 tailor shops all not producing anything because its at storage cap but 2 year prior everyone was running around with a loin cloth crying about not having any clothes...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "City builder but more for people who enjoy medieval themes. Im not worrying about my underground wiring im worrying about my districts and collecting resources in the trade port which I think is better for those who dont want to do every technical aspect like in skylines\r\nAlso its fun seeing the city progress and get better and you can see your citizens wearing the resources you made for them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apparently I've played this for 111 hours. As a working mother of two, I have very little gaming time these days, so that should give you an idea of what 111 hours means in my world. \r\n\r\nIt has all the things I like in a strategy town-building game - I get the choice whether I want to deal with invasions and disasters, or just build a peaceful town, I can choose to trade or not trade, I get some choice about the aesthetics of my town and there's all the usual stock management stuff (though it took me an embarrassingly long time to realise I could ban citizens from using certain items that I wanted to save to make into things, e.g. grapes for making into wine). \r\n\r\nThe game can be a bit slow at times, but I've worked out some tricks to speed things up, such as building multiple research buildings to get tech points up quickly. I do think the combat mode needs a lot of work though. There's no town to invade, there's just a countdown until the bandits show up and they are easily taken care of with some strategically-placed towers, even as they level-up over time. You can build up armies and go take out the bandit camp, but then they just pop up somewhere else and it's the same thing all over again. I feel like if they built a rival town that you could go and raid it would make combat mode way more fun. But basically as it is right now, I don't bother to play that mode anymore as it's boring and repetitive. I do keep the disasters on though to make things more challenging and interesting. \r\n\r\nOverall, if you liked the old settler games you'll enjoy this game. Definitely worth giving it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game it’s so peaceful and I love building up my town and panning down to the community to see what they’re up to. I also like how you to can create different terrains. This is my cozy game I’ve spent hours on💜",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I haven't quite figured everything out yet but it seems pretty solid.  I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the price, I feel it's a solid game.\n\nIt feels a lot like Timberborn, except it feels much harder to survive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great for group gaming. Turn based fighting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you have ever played Banished, this is just like Banished, but better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very standard i think",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is Banished 2.\n\nMore content and more features.\nA lot more complex and harder to settle, slower pace too.\n\nThe graphic is simple, UI could be better but it works.\nTech tree is a bit confusing but you will get used to it.\n\nIt's an ok game. If you like banished and want more, this is a good choice.\nSale or discount price is basically a steal.",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "Games very good and super fun, got sucked in and played for hours! One minor nitpick, the use of ai portraits doesn't mesh well with the style of the game at all, just looks strange.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "I think Settlement Survival is fun for at least 50-100 hours IF you have played Banished. It borrows some of the best ideas from Banished’s Megamod, though not all of them, so it feels both familiar and fresh.\r\n\r\nPros: \r\n-Progressing in Technology is rewarding\r\n-Trading is more fun\r\n-Who knows what the future holds for this game?\r\n\r\nCons:\r\n-Wonders are quite lame\r\n-Could use one step faster speed option \r\n-I still feel like there is room for more products and supply chains",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I really enjoyed Settlement Survival! It’s such a relaxing and rewarding city-builder — it reminds me of Banished, but with more depth and charm. I love how you can shape your settlement any way you want, balancing resources, happiness, and population growth. The graphics are cozy and detailed, and the gameplay loop of planning, gathering, and expanding never gets old.\n\nWhat really hooked me was how every decision matters — do you focus on farming, trade, or industry first? Each playthrough feels different. It’s easy to lose track of time just watching your little village come to life.\n\nIf you like calm but strategic management games, this one’s definitely worth picking up!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Settlement Survival delivers a genuinely enjoyable city-building experience that nails a cozy, methodical pace which I genuinely enjoy in this genre. \n\nThe core gameplay loop of managing production chains, assigning labour, and gradually expanding your town is satisfying and addictive. The art style is a standout: warm, readable, and charming in a way that turns routine micromanagement into something different if familiar.\n\nBuilding and progression feel rewarding because the production systems are robust without being overwhelming, and each new structure or tech unlock meaningfully changes how you plan your settlement. A few issues here when it's not lcear that an unlock requires other unlocks, but largely well done. Pathfinding and job assignment generally work well, keeping the flow of your town predictable and manageable. \n\nLike Foundation, the soundtrack and ambient effects support the mood perfectly and make long sessions feel calming rather than stressful and I love a bit of this once the kids are in bed.\n\nThere are a few rough edges in the tech tree that interrupt pacing and clarity. Some research branches overlap in purpose, and a couple of tooltips could be clearer about prerequisites and benefits. These are minor annoyances that don’t break the experience but smoothing them out would make progression feel more intuitive and deliberate.\n\nMap design offers interesting variety, but mountain tiles feel underused and wasted in some layouts, downright annoying in others. Allowing players to build on slopes or providing mountain-specific resources or structures would turn dead space into meaningful strategic choices and open up more creative town/defence layouts. Curved roads are another small but impactful improvement that would make towns look less grid-bound and help create more organic settlements.\n\nPopulation management and jobs are the game’s heart, and the balance hits a sweet spot between challenge and fairness.\n\nOccasional AI hiccups happen and workers sometimes take odd routes or stall on tasks but these incidents are infrequent and usually resolved with a quick adjustment to priorities. The core systems remain reliable enough to build complex, efficient towns without constant babysitting.\n\nPerformance is solid on my high end X3D rig as well as the kids older AM4 rigs which is nice.\n\nMod support and active developer engagement would be excellent next steps to extend replayability and I've love to see some of that.\n\nThere's still potential here, game will improve if Devs polish the tech tree, add options for mountains and curved roads, and continue refining AI behaviours. These improvements would elevate a very good game into a great one. The developer’s current direction and player feedback responsiveness make those changes feel more likely and worthwhile.\n\nSettlement Survival is fun for me. A well-crafted colony sim with enough personality and systems depth to keep the kids and I engaged for hours. I'd recommend it for fans of slow-burn city-builders who appreciate a pleasing art style and a steady, thoughtful challenge.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I've restarted my town about 4 times now, and well, each time I find something new about the game. Which should say a lot considering how I am devout to this game genre.\n\nSomeone else in a review likened it to Banished, which I actually find accurate, because it is what Banished could have been so far. Another reviewer mentions the tech tree, and I can also agree with that criticism, however, if you hover over the skill in the tech tree, it does show what you need to be able to build it. But, I do get it. \n\nHonestly, if you love this genre, this is a must in your list.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "An updated Banished, a lot of in game analysis of the various resources, the added combat is a little awkward but does make for a decent narrative to drive the town development towards goals of defense.  Overall I would recommend.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I love a good resource management game, and this one allows a ton of game customization for any challenge level!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "After 80 something hours and not even getting to the extreme techs yet i can say i am hooked. Simplistic enough not to get overwhelmed, complex enough to keep you on your toes.\r\npros:\r\n interesting graphic style, pleasing to the eyes but not taxing on hardware\r\nactually decent tutorial\r\nenough systems to keep you playing for hours on end\r\nnice calming background music\r\nactually good trading system\r\nreally like the logistics system too\r\nwill probably add more after i experiment with tourism\r\ncons: (small QoL things)\r\ngrid system is kinda annoying but i get it too late to change now\r\nbatch remodel working for all buildings of that type means you gotta stock up resources especially for houses and no batch upgrade again for houses\r\nyou should be able to set up the logistics systems better like a transfer station always transfering to a certain warehouse so you dont need to ban certain items from all warehouses but one\r\npainting farms should go over the compost in the middle so you dont have to break them up into 4\r\n\r\noverall 8/10, easy 9/10 with some QoL updates and more DLC",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing this game mainly because im waiting for Pax Romana to come out, it's not a bad game but you can tell there are some details on the pathing/behavior that are a bit annoying, still an enjoyable game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not the most intuitive with instructions, gotta watch videos and play around quite a bit before you get the hang of it. Some things aren't explained all that well, like how exactly logistics work and how to properly make use of them. The descriptions for items are/can be vague. But overall there's no game quite like this one, and it's my favorite colony sim/city builder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Settlement Survival is one of those games that once you figure out the logistics of what the citizens need (i.e. food, tools, and water at the beginning) then the game becomes easier. Forget the battling part though. That complicates it a lot more, but aside from the defending the village if you choose that option, the game is pretty fun and addictive. If you start with a bean of any type and hopefully cattle, you're on your way to a successful village.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The base mechanics of Banished with additions in mechanics on top.\r\nThe default map sizes are on the smaller size but still usable as compared to Banished there are lot of efficiency/upgrade approaches that improve things without needing to expand.\r\nSubjectively the world visuals a slight downgrade compared to Banished. And based on GPU usage I think an optimization pass would be useful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the age of the game, it's a great inexpensive addictive game with a free DLC update, if you love town builder games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "starts simple but gets really complicated. esp when your trying to find a good balance of production. either its not enough for you got 6 tailor shops all not producing anything because its at storage cap but 2 year prior everyone was running around with a loin cloth crying about not having any clothes...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "City builder but more for people who enjoy medieval themes. Im not worrying about my underground wiring im worrying about my districts and collecting resources in the trade port which I think is better for those who dont want to do every technical aspect like in skylines\r\nAlso its fun seeing the city progress and get better and you can see your citizens wearing the resources you made for them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apparently I've played this for 111 hours. As a working mother of two, I have very little gaming time these days, so that should give you an idea of what 111 hours means in my world. \r\n\r\nIt has all the things I like in a strategy town-building game - I get the choice whether I want to deal with invasions and disasters, or just build a peaceful town, I can choose to trade or not trade, I get some choice about the aesthetics of my town and there's all the usual stock management stuff (though it took me an embarrassingly long time to realise I could ban citizens from using certain items that I wanted to save to make into things, e.g. grapes for making into wine). \r\n\r\nThe game can be a bit slow at times, but I've worked out some tricks to speed things up, such as building multiple research buildings to get tech points up quickly. I do think the combat mode needs a lot of work though. There's no town to invade, there's just a countdown until the bandits show up and they are easily taken care of with some strategically-placed towers, even as they level-up over time. You can build up armies and go take out the bandit camp, but then they just pop up somewhere else and it's the same thing all over again. I feel like if they built a rival town that you could go and raid it would make combat mode way more fun. But basically as it is right now, I don't bother to play that mode anymore as it's boring and repetitive. I do keep the disasters on though to make things more challenging and interesting. \r\n\r\nOverall, if you liked the old settler games you'll enjoy this game. Definitely worth giving it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only played on easy mode so far, and it is fantastic. The game flow is great and I love seeing my settlement grow and flourish. I'm excited to start another game on a different difficulty to see how the disasters will affect my villagers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a little hard to get the hang of but overall it is a super fun game. I prefer sandbox mode because I mainly like the building aspect but on standard mode it's much more challenging if that is what you typically look for in a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's ok but you have to get a product to craft another one, to craft another one, and so on... on a chain of 10 products. Way more complex than Banished at least for my taste. Also hard to automate the production later. But nice game overall!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice little game with plenty of long-term playability and good concepts. Lots of scope for expansion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game. It is relaxing to build in and to make the settlement grow. There was one that similar to this one but this  is much better. I like the smooth game play with no hiccups. I would recommend this game to anyone who loves building games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive, it reminds me of age of empires but more involved and advance/ realistic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game So fun \nBut I wanna ask your dev about save game and \nload game I already save game why next day it's lose \ncan you solve it ?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game it’s so peaceful and I love building up my town and panning down to the community to see what they’re up to. I also like how you to can create different terrains. This is my cozy game I’ve spent hours on💜",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I WILL PLAY THIS GAME IF GAME SUPPORT VIETNAMESE!\nTÔI SẼ CHƠI GAME NÀY NẾU NÓ HỖ TRỢ TIẾNG VIỆT",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, it's really rough around the edges in some areas, but it's one of the best indie city builders I've played since Banished (minus Timberborn). I'd like to see some improvements on the combat side of things (it can be a bit poorly balanced there; I'd like more levels of military maybe, or at least to make it more obvious when my troops have picked up supplies and/or weapons), as well as on the UI side (would like a proper Citizen menu for example, to see when I'm getting more students graduated as an example, or when my schools are full).\n\nSome things I'd like to see (I'll edit this as I go):\n\n- More levels of military protection. An Iron tower, for example, would be nice, as by level 26, bandits will just mow down the stone defenses\n- A better menu for citizen management. Take a look at foundation - this one works great. Yes, we don't do upgrades like in Foundation, but I'd like to better see when I'm about to have students graduate, for example, or see when a citizen lives far away from their job.\n- Better worker management. It's hard to tell in a large settlement when we aren't at full capacity for a building, or even to spot a building without workers. Foundation has a great menu for this, too. Timberborn is also great for giving certain jobs higher/lower priority and that could work - sometimes I might lose a lot of citizens at once, and then have a bunch graduate or immigrate. Those just become laborers and ignore what worker slots I have open.\n\nOverall, strong recommend. Few corners that need sanding, but its solid.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Been addicted to this so far. Very in depth game. It's worth buying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I haven't quite figured everything out yet but it seems pretty solid.  I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For the price, I feel it's a solid game.\n\nIt feels a lot like Timberborn, except it feels much harder to survive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still learning to play this game, as I am slow learner and take my time, but once you get a hold of logistics, research enough stuff (use boosting items as much as possible), and take care of food and drinks, you can take your time. On easy mode this is very relaxing experience, there are few in game tricks that need deeper understanding, but finding solutions is part of the fun. Game is not graphical masterpiece, and it is time taking, but that's the thing with these survival type city/industry building games. Would recommend this to people who want laid back gaming, as things take their time, and no development is instant. With right setup you can almost AFK game this, alt tab for 10 minutes to do something else and then check what more you can do. On harder difficulties however there are eh... Surprises, destructive ones, so you can not really do that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Evidently inspired by Banished, despite this in my opinion it is a very underrated title, better than other similar but much more famous games such as Manor Lords. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "made a city but everyone was a nudist. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy to play on super relaxing sand box mode with commercial and city progression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As others have commented. this is essentially what Banished should have been!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing and chilling gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "saw Let's Game It Out play this and then it was on sale. Couldn't resist the 7 buck deal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for group gaming. Turn based fighting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you have ever played Banished, this is just like Banished, but better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game, and it's a good game for killing time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good city-building game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "logistics. number go up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Easy to put hours into it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well done settlement game. Finally!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Banished plus, ~50h of good content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like building games",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very standard i think",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just really love this game. I will get lost in it for hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sooooo good Kooma thx ma man",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun kingdom game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is Banished 2.\n\nMore content and more features.\nA lot more complex and harder to settle, slower pace too.\n\nThe graphic is simple, UI could be better but it works.\nTech tree is a bit confusing but you will get used to it.\n\nIt's an ok game. If you like banished and want more, this is a good choice.\nSale or discount price is basically a steal.",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "Games very good and super fun, got sucked in and played for hours! One minor nitpick, the use of ai portraits doesn't mesh well with the style of the game at all, just looks strange.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "I think Settlement Survival is fun for at least 50-100 hours IF you have played Banished. It borrows some of the best ideas from Banished’s Megamod, though not all of them, so it feels both familiar and fresh.\r\n\r\nPros: \r\n-Progressing in Technology is rewarding\r\n-Trading is more fun\r\n-Who knows what the future holds for this game?\r\n\r\nCons:\r\n-Wonders are quite lame\r\n-Could use one step faster speed option \r\n-I still feel like there is room for more products and supply chains",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I really enjoyed Settlement Survival! It’s such a relaxing and rewarding city-builder — it reminds me of Banished, but with more depth and charm. I love how you can shape your settlement any way you want, balancing resources, happiness, and population growth. The graphics are cozy and detailed, and the gameplay loop of planning, gathering, and expanding never gets old.\n\nWhat really hooked me was how every decision matters — do you focus on farming, trade, or industry first? Each playthrough feels different. It’s easy to lose track of time just watching your little village come to life.\n\nIf you like calm but strategic management games, this one’s definitely worth picking up!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Settlement Survival delivers a genuinely enjoyable city-building experience that nails a cozy, methodical pace which I genuinely enjoy in this genre. \n\nThe core gameplay loop of managing production chains, assigning labour, and gradually expanding your town is satisfying and addictive. The art style is a standout: warm, readable, and charming in a way that turns routine micromanagement into something different if familiar.\n\nBuilding and progression feel rewarding because the production systems are robust without being overwhelming, and each new structure or tech unlock meaningfully changes how you plan your settlement. A few issues here when it's not lcear that an unlock requires other unlocks, but largely well done. Pathfinding and job assignment generally work well, keeping the flow of your town predictable and manageable. \n\nLike Foundation, the soundtrack and ambient effects support the mood perfectly and make long sessions feel calming rather than stressful and I love a bit of this once the kids are in bed.\n\nThere are a few rough edges in the tech tree that interrupt pacing and clarity. Some research branches overlap in purpose, and a couple of tooltips could be clearer about prerequisites and benefits. These are minor annoyances that don’t break the experience but smoothing them out would make progression feel more intuitive and deliberate.\n\nMap design offers interesting variety, but mountain tiles feel underused and wasted in some layouts, downright annoying in others. Allowing players to build on slopes or providing mountain-specific resources or structures would turn dead space into meaningful strategic choices and open up more creative town/defence layouts. Curved roads are another small but impactful improvement that would make towns look less grid-bound and help create more organic settlements.\n\nPopulation management and jobs are the game’s heart, and the balance hits a sweet spot between challenge and fairness.\n\nOccasional AI hiccups happen and workers sometimes take odd routes or stall on tasks but these incidents are infrequent and usually resolved with a quick adjustment to priorities. The core systems remain reliable enough to build complex, efficient towns without constant babysitting.\n\nPerformance is solid on my high end X3D rig as well as the kids older AM4 rigs which is nice.\n\nMod support and active developer engagement would be excellent next steps to extend replayability and I've love to see some of that.\n\nThere's still potential here, game will improve if Devs polish the tech tree, add options for mountains and curved roads, and continue refining AI behaviours. These improvements would elevate a very good game into a great one. The developer’s current direction and player feedback responsiveness make those changes feel more likely and worthwhile.\n\nSettlement Survival is fun for me. A well-crafted colony sim with enough personality and systems depth to keep the kids and I engaged for hours. I'd recommend it for fans of slow-burn city-builders who appreciate a pleasing art style and a steady, thoughtful challenge.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I've restarted my town about 4 times now, and well, each time I find something new about the game. Which should say a lot considering how I am devout to this game genre.\n\nSomeone else in a review likened it to Banished, which I actually find accurate, because it is what Banished could have been so far. Another reviewer mentions the tech tree, and I can also agree with that criticism, however, if you hover over the skill in the tech tree, it does show what you need to be able to build it. But, I do get it. \n\nHonestly, if you love this genre, this is a must in your list.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "An updated Banished, a lot of in game analysis of the various resources, the added combat is a little awkward but does make for a decent narrative to drive the town development towards goals of defense.  Overall I would recommend.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I love a good resource management game, and this one allows a ton of game customization for any challenge level!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "After 80 something hours and not even getting to the extreme techs yet i can say i am hooked. Simplistic enough not to get overwhelmed, complex enough to keep you on your toes.\r\npros:\r\n interesting graphic style, pleasing to the eyes but not taxing on hardware\r\nactually decent tutorial\r\nenough systems to keep you playing for hours on end\r\nnice calming background music\r\nactually good trading system\r\nreally like the logistics system too\r\nwill probably add more after i experiment with tourism\r\ncons: (small QoL things)\r\ngrid system is kinda annoying but i get it too late to change now\r\nbatch remodel working for all buildings of that type means you gotta stock up resources especially for houses and no batch upgrade again for houses\r\nyou should be able to set up the logistics systems better like a transfer station always transfering to a certain warehouse so you dont need to ban certain items from all warehouses but one\r\npainting farms should go over the compost in the middle so you dont have to break them up into 4\r\n\r\noverall 8/10, easy 9/10 with some QoL updates and more DLC",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing this game mainly because im waiting for Pax Romana to come out, it's not a bad game but you can tell there are some details on the pathing/behavior that are a bit annoying, still an enjoyable game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not the most intuitive with instructions, gotta watch videos and play around quite a bit before you get the hang of it. Some things aren't explained all that well, like how exactly logistics work and how to properly make use of them. The descriptions for items are/can be vague. But overall there's no game quite like this one, and it's my favorite colony sim/city builder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Settlement Survival is one of those games that once you figure out the logistics of what the citizens need (i.e. food, tools, and water at the beginning) then the game becomes easier. Forget the battling part though. That complicates it a lot more, but aside from the defending the village if you choose that option, the game is pretty fun and addictive. If you start with a bean of any type and hopefully cattle, you're on your way to a successful village.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The base mechanics of Banished with additions in mechanics on top.\r\nThe default map sizes are on the smaller size but still usable as compared to Banished there are lot of efficiency/upgrade approaches that improve things without needing to expand.\r\nSubjectively the world visuals a slight downgrade compared to Banished. And based on GPU usage I think an optimization pass would be useful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite the age of the game, it's a great inexpensive addictive game with a free DLC update, if you love town builder games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "starts simple but gets really complicated. esp when your trying to find a good balance of production. either its not enough for you got 6 tailor shops all not producing anything because its at storage cap but 2 year prior everyone was running around with a loin cloth crying about not having any clothes...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "City builder but more for people who enjoy medieval themes. Im not worrying about my underground wiring im worrying about my districts and collecting resources in the trade port which I think is better for those who dont want to do every technical aspect like in skylines\r\nAlso its fun seeing the city progress and get better and you can see your citizens wearing the resources you made for them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Apparently I've played this for 111 hours. As a working mother of two, I have very little gaming time these days, so that should give you an idea of what 111 hours means in my world. \r\n\r\nIt has all the things I like in a strategy town-building game - I get the choice whether I want to deal with invasions and disasters, or just build a peaceful town, I can choose to trade or not trade, I get some choice about the aesthetics of my town and there's all the usual stock management stuff (though it took me an embarrassingly long time to realise I could ban citizens from using certain items that I wanted to save to make into things, e.g. grapes for making into wine). \r\n\r\nThe game can be a bit slow at times, but I've worked out some tricks to speed things up, such as building multiple research buildings to get tech points up quickly. I do think the combat mode needs a lot of work though. There's no town to invade, there's just a countdown until the bandits show up and they are easily taken care of with some strategically-placed towers, even as they level-up over time. You can build up armies and go take out the bandit camp, but then they just pop up somewhere else and it's the same thing all over again. I feel like if they built a rival town that you could go and raid it would make combat mode way more fun. But basically as it is right now, I don't bother to play that mode anymore as it's boring and repetitive. I do keep the disasters on though to make things more challenging and interesting. \r\n\r\nOverall, if you liked the old settler games you'll enjoy this game. Definitely worth giving it a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only played on easy mode so far, and it is fantastic. The game flow is great and I love seeing my settlement grow and flourish. I'm excited to start another game on a different difficulty to see how the disasters will affect my villagers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a little hard to get the hang of but overall it is a super fun game. I prefer sandbox mode because I mainly like the building aspect but on standard mode it's much more challenging if that is what you typically look for in a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's ok but you have to get a product to craft another one, to craft another one, and so on... on a chain of 10 products. Way more complex than Banished at least for my taste. Also hard to automate the production later. But nice game overall!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice little game with plenty of long-term playability and good concepts. Lots of scope for expansion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game. It is relaxing to build in and to make the settlement grow. There was one that similar to this one but this  is much better. I like the smooth game play with no hiccups. I would recommend this game to anyone who loves building games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive, it reminds me of age of empires but more involved and advance/ realistic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game So fun \nBut I wanna ask your dev about save game and \nload game I already save game why next day it's lose \ncan you solve it ?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game it’s so peaceful and I love building up my town and panning down to the community to see what they’re up to. I also like how you to can create different terrains. This is my cozy game I’ve spent hours on💜",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I WILL PLAY THIS GAME IF GAME SUPPORT VIETNAMESE!\nTÔI SẼ CHƠI GAME NÀY NẾU NÓ HỖ TRỢ TIẾNG VIỆT",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, it's really rough around the edges in some areas, but it's one of the best indie city builders I've played since Banished (minus Timberborn). I'd like to see some improvements on the combat side of things (it can be a bit poorly balanced there; I'd like more levels of military maybe, or at least to make it more obvious when my troops have picked up supplies and/or weapons), as well as on the UI side (would like a proper Citizen menu for example, to see when I'm getting more students graduated as an example, or when my schools are full).\n\nSome things I'd like to see (I'll edit this as I go):\n\n- More levels of military protection. An Iron tower, for example, would be nice, as by level 26, bandits will just mow down the stone defenses\n- A better menu for citizen management. Take a look at foundation - this one works great. Yes, we don't do upgrades like in Foundation, but I'd like to better see when I'm about to have students graduate, for example, or see when a citizen lives far away from their job.\n- Better worker management. It's hard to tell in a large settlement when we aren't at full capacity for a building, or even to spot a building without workers. Foundation has a great menu for this, too. Timberborn is also great for giving certain jobs higher/lower priority and that could work - sometimes I might lose a lot of citizens at once, and then have a bunch graduate or immigrate. Those just become laborers and ignore what worker slots I have open.\n\nOverall, strong recommend. Few corners that need sanding, but its solid.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Been addicted to this so far. Very in depth game. It's worth buying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I haven't quite figured everything out yet but it seems pretty solid.  I like it.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Too many game-breaking bugs to actually make it worth your time.  It is a good game otherwise, but still needs time for development.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "one single design flaw and game is ruined, theres special resources on the map that dont reappear or appear later in game. very important aspects of your econ will develop around them and for whatever reason they just disappear, your town design may even develop around them and all this takes tons of hours to set up. was a decent town building game until this occured",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Too buggy to progress. in game  The storage management preferences get ignored, so you can't control what gets stored near your manufacturing etc.  Which means storages fill with things you don't need in that location, and the things you do need stop being gathered. You can go from enough food to feed everyone for years to starvation more quickly than you can do anything about it.\r\n\r\nMOD workshop seems abandoned, too, very few seem to be compatible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Game Dont help you to understand what to build first to keep your people  or how to get more people .what the farms are for theres alot it would be a fun game if there was HELP and UNDERSTANDING",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The learning curve is steep in this game due to it not being an intuitive game. The guide in the game is only somewhat helpful when you need to know how to get your citizens to do certain things. I may or may not keep going with my current saves.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Returned the game. I hate the AI portraits.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not Fun at All...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont bother",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love city builders but this one is just not working well for me.  My biggest issues is the tech tree.  It's so confusing.  Why can I unlock Luxury Housing only to find out I need to unlock 2 or 3 other things to be able to actually build Luxury Housing?  That should be locked until the prerequisites are completed.  I'm also not a fan of the random discovery to find animals, seeds, etc.  Year after year my people are freezing because I'm waiting for the game to randomly discover sheep.  I found myself just watching TV and letting the game run, hoping it would discover items I needed to progress.  It really needs some fine tuning and balancing to make this playable.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "As it exists I cant give it a thumbs up. I want to, but I can't because Its terribly imbalanced. I love the concept and the direction its going, especially the vast array of aesthetic additions available for you. But functionally there are problems and I'm still very early into the game which does not bode well for later on. \n\nOne example is how slowly citizens age. Unlike other similar games, it does not seem that building up your town attracts any new citizens outside of the occasional migration of people. This would be fine normally, however when your citizens have kids, it takes what seems like a realistic number of years in game for them to grow up which creates a problem because overall, the needs of your people stack up WAY faster than your number of citizens so you can VERY quickly go from being a successful settlement one year, to a starving one the next. \n\nAnother imbalance is the amount of certain resources you gain from things like felling trees. There is a forester hut that is supposed to provide a steady flow of lumber and replant trees (provided you have enough laborers working there) but again, with how quickly the game makes you try to grow, you would either have to have at least 3-4 people working there to keep up with a small town of maybe 10 homes, or have more than 1 forester. Which isn't feasible when you account for all the other things you need people for early on.\n\nThen other things like tools and iron gathering are imbalanced in the other direction entirely. For example. I put up a forester and a mine for iron. Both were running at the same time. After a couple years, my forester struggles  intensely to keep up with wood demand while the iron is just stacking up like crazy! \n\nNow a lot of this is due to the fact that most construction requires wood, on top of needing it for fuel to keep homes warm, while less things require iron in the beginning but still. I chop down what I would estimate are 20-25 trees and I get maybe 70-80 wood which trust me is NOTHING. The average home costs something like 20 or 25 lumber to build. That's 1/4 of what I got from 20-25 trees. That's insane.\n\nFinally the clinic.... Healing is insanely slow. When people are sick the clinics are decent and fixing that problem fairly quickly if you have the needed items on hand. But a physical injury? Nah.... that person is basically out of commission for a couple years. Which is again way too punishing for something you didnt do wrong and just happens as a form of challenge. \n\nI think this game has a LOT of potential, but again, it just is in terrible need of some balance before I can give it a thumbs up.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "The game is pretty cool and enjoyable for those into these kind of games. \r\nThe problem is that, like so many games of this genre, it gets old and boring pretty quickly, and while after 30 in-game years, I still had plenty of progress to make (science, new production chains, etc), I really had nothing to achieve, or anything that would engage me and make me want to play on. So I quit, and that's that.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Kingdoms Reborn is pretty much the same game, but better, and doesn't have ugly AI generated portraits in it.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Too many game-breaking bugs to actually make it worth your time.  It is a good game otherwise, but still needs time for development.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "At most I'd use this as a sandbox game.\n\nThe symbols of the Interface are tiny so I tried to size them up in the options, but turns out they stay tiny, just the UI gets bigger (so much so it can go off screen!), some of the text gets blurry, oh and the \"helpful\" screenshots have Chinese writing ._.\n\nThen there's too much info on screen which even the tutorial doesn't take the time to explain! I mean I get it, you dont't have to, but if you offer a tutorial (4 actually; for bloody beginners, intermediate and advanced AND when you start a new game file it holds your hand again even if you already did one of the specific tutorials) then at least explain it properly. Also where can I see my free workers? Definitely not in the townspeople tab, even though there is a shitton of useless info like the gender ratio.\n\nAlso the townspeople have like 6 portraits which get repeated even within the starting colony. If you're gonna go the route of portraits at least give them some variation if you're gonna make it so easy on yourself as to use AI generated images..\n\nI got this on sale and still feel scammed somehow.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Saw some people call this game the next Banished, I completely disagree.\nWhile it has the same basic game elements, it doesn't feel the same. Banished was super simple and easy to pick up and expand your town. This on the other hand? \nI found it difficult to see what was going on half the time (at least you have the view without any trees). The UI in general looks so weird, things are haphazardly thrown all over the place and I found it needlessly difficult to figure out certain information. The tutorial is extremely annoying with its near constant pop-ups, not to mention there doesn't seem to be any check in place to see if you already have a certain building built, and it will remind you to build a gatherer despite the fact you already have 3. \n\nThe vibe of the game also feels off. It is obviously going for a different aesthetic than banished, but I just don't like it. Personal preference. The mix of low-poly structures and painted portraits feels wrong. \n\nThere certainly are some good ideas in the game, such as being able to landscape your surroundings, reroute rivers, discover new technologies, etc. But considering that I couldn't even get past the first hour without quitting, I didn't see any of these interesting additions. \n\n\nI think the price of the game is reasonable, so give it a try, but keep an eye on the time so that you can still refund it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game looked fun, but all the citizen and leaders portraits are AI generated without any disclaimer on the store page (and are ugly as hell)",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "one single design flaw and game is ruined, theres special resources on the map that dont reappear or appear later in game. very important aspects of your econ will develop around them and for whatever reason they just disappear, your town design may even develop around them and all this takes tons of hours to set up. was a decent town building game until this occured",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "More polish than Banished, heavily influenced by it; and yet they don't secure the balance Banished had. At this point this game isn't going to be changed so... try elsewhere I'd say or get on sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too buggy to progress. in game  The storage management preferences get ignored, so you can't control what gets stored near your manufacturing etc.  Which means storages fill with things you don't need in that location, and the things you do need stop being gathered. You can go from enough food to feed everyone for years to starvation more quickly than you can do anything about it.\r\n\r\nMOD workshop seems abandoned, too, very few seem to be compatible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Game Dont help you to understand what to build first to keep your people  or how to get more people .what the farms are for theres alot it would be a fun game if there was HELP and UNDERSTANDING",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is something wrong with the goods generation/needs system. Frequently, I will see reports that I have generated N number of goods but my entire colony will be lacking it. Example, water and jackets is a frequent offender. Jacket generation would be 50 for the season, but nobody is wearing clothes....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried it as someone who plays other colony sims & its too hard, no matter what i did could never get enough food/water/fuel, NOTHING. terrible experience. make the output much higher so demand can be met cause its never enough",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The learning curve is steep in this game due to it not being an intuitive game. The guide in the game is only somewhat helpful when you need to know how to get your citizens to do certain things. I may or may not keep going with my current saves.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is what I would like to play. But at some point, and this is a game breaker for me, the thousands of units of food that I have for years, suddenly disappeared. \r\nIt would also be great if there are a bit more of information about situations. One thing I have off the top of my mind is info. about the citizens. Where are they going etc and to be a bit more accurate than in it's current state. I dont remember all comments I thought of during my 24 hours of playing. But I remember that there are things that discourage me from playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Broken Farming mechanics makes surviving impossible. Unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Way too complicated, I just want a nice easy build game; this game requires you to balance out way too many competing priorities so that it just ends up feeling like work. You have to click way too many times to get one thing done. On top of it the population either grows too slow or it does not grow at all, how do you even grow in this game. I have 3+ hours into this game and I still have not been able to establish a basic town. Boring!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Returned the game. I hate the AI portraits.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "sit around doing nothing waiting for another research point",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not Fun at All...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont bother",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love city builders but this one is just not working well for me.  My biggest issues is the tech tree.  It's so confusing.  Why can I unlock Luxury Housing only to find out I need to unlock 2 or 3 other things to be able to actually build Luxury Housing?  That should be locked until the prerequisites are completed.  I'm also not a fan of the random discovery to find animals, seeds, etc.  Year after year my people are freezing because I'm waiting for the game to randomly discover sheep.  I found myself just watching TV and letting the game run, hoping it would discover items I needed to progress.  It really needs some fine tuning and balancing to make this playable.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "As it exists I cant give it a thumbs up. I want to, but I can't because Its terribly imbalanced. I love the concept and the direction its going, especially the vast array of aesthetic additions available for you. But functionally there are problems and I'm still very early into the game which does not bode well for later on. \n\nOne example is how slowly citizens age. Unlike other similar games, it does not seem that building up your town attracts any new citizens outside of the occasional migration of people. This would be fine normally, however when your citizens have kids, it takes what seems like a realistic number of years in game for them to grow up which creates a problem because overall, the needs of your people stack up WAY faster than your number of citizens so you can VERY quickly go from being a successful settlement one year, to a starving one the next. \n\nAnother imbalance is the amount of certain resources you gain from things like felling trees. There is a forester hut that is supposed to provide a steady flow of lumber and replant trees (provided you have enough laborers working there) but again, with how quickly the game makes you try to grow, you would either have to have at least 3-4 people working there to keep up with a small town of maybe 10 homes, or have more than 1 forester. Which isn't feasible when you account for all the other things you need people for early on.\n\nThen other things like tools and iron gathering are imbalanced in the other direction entirely. For example. I put up a forester and a mine for iron. Both were running at the same time. After a couple years, my forester struggles  intensely to keep up with wood demand while the iron is just stacking up like crazy! \n\nNow a lot of this is due to the fact that most construction requires wood, on top of needing it for fuel to keep homes warm, while less things require iron in the beginning but still. I chop down what I would estimate are 20-25 trees and I get maybe 70-80 wood which trust me is NOTHING. The average home costs something like 20 or 25 lumber to build. That's 1/4 of what I got from 20-25 trees. That's insane.\n\nFinally the clinic.... Healing is insanely slow. When people are sick the clinics are decent and fixing that problem fairly quickly if you have the needed items on hand. But a physical injury? Nah.... that person is basically out of commission for a couple years. Which is again way too punishing for something you didnt do wrong and just happens as a form of challenge. \n\nI think this game has a LOT of potential, but again, it just is in terrible need of some balance before I can give it a thumbs up.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "The game is pretty cool and enjoyable for those into these kind of games. \r\nThe problem is that, like so many games of this genre, it gets old and boring pretty quickly, and while after 30 in-game years, I still had plenty of progress to make (science, new production chains, etc), I really had nothing to achieve, or anything that would engage me and make me want to play on. So I quit, and that's that.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Kingdoms Reborn is pretty much the same game, but better, and doesn't have ugly AI generated portraits in it.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Too many game-breaking bugs to actually make it worth your time.  It is a good game otherwise, but still needs time for development.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "At most I'd use this as a sandbox game.\n\nThe symbols of the Interface are tiny so I tried to size them up in the options, but turns out they stay tiny, just the UI gets bigger (so much so it can go off screen!), some of the text gets blurry, oh and the \"helpful\" screenshots have Chinese writing ._.\n\nThen there's too much info on screen which even the tutorial doesn't take the time to explain! I mean I get it, you dont't have to, but if you offer a tutorial (4 actually; for bloody beginners, intermediate and advanced AND when you start a new game file it holds your hand again even if you already did one of the specific tutorials) then at least explain it properly. Also where can I see my free workers? Definitely not in the townspeople tab, even though there is a shitton of useless info like the gender ratio.\n\nAlso the townspeople have like 6 portraits which get repeated even within the starting colony. If you're gonna go the route of portraits at least give them some variation if you're gonna make it so easy on yourself as to use AI generated images..\n\nI got this on sale and still feel scammed somehow.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Saw some people call this game the next Banished, I completely disagree.\nWhile it has the same basic game elements, it doesn't feel the same. Banished was super simple and easy to pick up and expand your town. This on the other hand? \nI found it difficult to see what was going on half the time (at least you have the view without any trees). The UI in general looks so weird, things are haphazardly thrown all over the place and I found it needlessly difficult to figure out certain information. The tutorial is extremely annoying with its near constant pop-ups, not to mention there doesn't seem to be any check in place to see if you already have a certain building built, and it will remind you to build a gatherer despite the fact you already have 3. \n\nThe vibe of the game also feels off. It is obviously going for a different aesthetic than banished, but I just don't like it. Personal preference. The mix of low-poly structures and painted portraits feels wrong. \n\nThere certainly are some good ideas in the game, such as being able to landscape your surroundings, reroute rivers, discover new technologies, etc. But considering that I couldn't even get past the first hour without quitting, I didn't see any of these interesting additions. \n\n\nI think the price of the game is reasonable, so give it a try, but keep an eye on the time so that you can still refund it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game looked fun, but all the citizen and leaders portraits are AI generated without any disclaimer on the store page (and are ugly as hell)",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "one single design flaw and game is ruined, theres special resources on the map that dont reappear or appear later in game. very important aspects of your econ will develop around them and for whatever reason they just disappear, your town design may even develop around them and all this takes tons of hours to set up. was a decent town building game until this occured",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "More polish than Banished, heavily influenced by it; and yet they don't secure the balance Banished had. At this point this game isn't going to be changed so... try elsewhere I'd say or get on sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too buggy to progress. in game  The storage management preferences get ignored, so you can't control what gets stored near your manufacturing etc.  Which means storages fill with things you don't need in that location, and the things you do need stop being gathered. You can go from enough food to feed everyone for years to starvation more quickly than you can do anything about it.\r\n\r\nMOD workshop seems abandoned, too, very few seem to be compatible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Game Dont help you to understand what to build first to keep your people  or how to get more people .what the farms are for theres alot it would be a fun game if there was HELP and UNDERSTANDING",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is something wrong with the goods generation/needs system. Frequently, I will see reports that I have generated N number of goods but my entire colony will be lacking it. Example, water and jackets is a frequent offender. Jacket generation would be 50 for the season, but nobody is wearing clothes....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried it as someone who plays other colony sims & its too hard, no matter what i did could never get enough food/water/fuel, NOTHING. terrible experience. make the output much higher so demand can be met cause its never enough",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The learning curve is steep in this game due to it not being an intuitive game. The guide in the game is only somewhat helpful when you need to know how to get your citizens to do certain things. I may or may not keep going with my current saves.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is what I would like to play. But at some point, and this is a game breaker for me, the thousands of units of food that I have for years, suddenly disappeared. \r\nIt would also be great if there are a bit more of information about situations. One thing I have off the top of my mind is info. about the citizens. Where are they going etc and to be a bit more accurate than in it's current state. I dont remember all comments I thought of during my 24 hours of playing. But I remember that there are things that discourage me from playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Broken Farming mechanics makes surviving impossible. Unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Way too complicated, I just want a nice easy build game; this game requires you to balance out way too many competing priorities so that it just ends up feeling like work. You have to click way too many times to get one thing done. On top of it the population either grows too slow or it does not grow at all, how do you even grow in this game. I have 3+ hours into this game and I still have not been able to establish a basic town. Boring!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Returned the game. I hate the AI portraits.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "sit around doing nothing waiting for another research point",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not Fun at All...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont bother",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love city builders but this one is just not working well for me.  My biggest issues is the tech tree.  It's so confusing.  Why can I unlock Luxury Housing only to find out I need to unlock 2 or 3 other things to be able to actually build Luxury Housing?  That should be locked until the prerequisites are completed.  I'm also not a fan of the random discovery to find animals, seeds, etc.  Year after year my people are freezing because I'm waiting for the game to randomly discover sheep.  I found myself just watching TV and letting the game run, hoping it would discover items I needed to progress.  It really needs some fine tuning and balancing to make this playable.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "As it exists I cant give it a thumbs up. I want to, but I can't because Its terribly imbalanced. I love the concept and the direction its going, especially the vast array of aesthetic additions available for you. But functionally there are problems and I'm still very early into the game which does not bode well for later on. \n\nOne example is how slowly citizens age. Unlike other similar games, it does not seem that building up your town attracts any new citizens outside of the occasional migration of people. This would be fine normally, however when your citizens have kids, it takes what seems like a realistic number of years in game for them to grow up which creates a problem because overall, the needs of your people stack up WAY faster than your number of citizens so you can VERY quickly go from being a successful settlement one year, to a starving one the next. \n\nAnother imbalance is the amount of certain resources you gain from things like felling trees. There is a forester hut that is supposed to provide a steady flow of lumber and replant trees (provided you have enough laborers working there) but again, with how quickly the game makes you try to grow, you would either have to have at least 3-4 people working there to keep up with a small town of maybe 10 homes, or have more than 1 forester. Which isn't feasible when you account for all the other things you need people for early on.\n\nThen other things like tools and iron gathering are imbalanced in the other direction entirely. For example. I put up a forester and a mine for iron. Both were running at the same time. After a couple years, my forester struggles  intensely to keep up with wood demand while the iron is just stacking up like crazy! \n\nNow a lot of this is due to the fact that most construction requires wood, on top of needing it for fuel to keep homes warm, while less things require iron in the beginning but still. I chop down what I would estimate are 20-25 trees and I get maybe 70-80 wood which trust me is NOTHING. The average home costs something like 20 or 25 lumber to build. That's 1/4 of what I got from 20-25 trees. That's insane.\n\nFinally the clinic.... Healing is insanely slow. When people are sick the clinics are decent and fixing that problem fairly quickly if you have the needed items on hand. But a physical injury? Nah.... that person is basically out of commission for a couple years. Which is again way too punishing for something you didnt do wrong and just happens as a form of challenge. \n\nI think this game has a LOT of potential, but again, it just is in terrible need of some balance before I can give it a thumbs up.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "The game is pretty cool and enjoyable for those into these kind of games. \r\nThe problem is that, like so many games of this genre, it gets old and boring pretty quickly, and while after 30 in-game years, I still had plenty of progress to make (science, new production chains, etc), I really had nothing to achieve, or anything that would engage me and make me want to play on. So I quit, and that's that.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Kingdoms Reborn is pretty much the same game, but better, and doesn't have ugly AI generated portraits in it.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Too many game-breaking bugs to actually make it worth your time.  It is a good game otherwise, but still needs time for development.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "At most I'd use this as a sandbox game.\n\nThe symbols of the Interface are tiny so I tried to size them up in the options, but turns out they stay tiny, just the UI gets bigger (so much so it can go off screen!), some of the text gets blurry, oh and the \"helpful\" screenshots have Chinese writing ._.\n\nThen there's too much info on screen which even the tutorial doesn't take the time to explain! I mean I get it, you dont't have to, but if you offer a tutorial (4 actually; for bloody beginners, intermediate and advanced AND when you start a new game file it holds your hand again even if you already did one of the specific tutorials) then at least explain it properly. Also where can I see my free workers? Definitely not in the townspeople tab, even though there is a shitton of useless info like the gender ratio.\n\nAlso the townspeople have like 6 portraits which get repeated even within the starting colony. If you're gonna go the route of portraits at least give them some variation if you're gonna make it so easy on yourself as to use AI generated images..\n\nI got this on sale and still feel scammed somehow.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Saw some people call this game the next Banished, I completely disagree.\nWhile it has the same basic game elements, it doesn't feel the same. Banished was super simple and easy to pick up and expand your town. This on the other hand? \nI found it difficult to see what was going on half the time (at least you have the view without any trees). The UI in general looks so weird, things are haphazardly thrown all over the place and I found it needlessly difficult to figure out certain information. The tutorial is extremely annoying with its near constant pop-ups, not to mention there doesn't seem to be any check in place to see if you already have a certain building built, and it will remind you to build a gatherer despite the fact you already have 3. \n\nThe vibe of the game also feels off. It is obviously going for a different aesthetic than banished, but I just don't like it. Personal preference. The mix of low-poly structures and painted portraits feels wrong. \n\nThere certainly are some good ideas in the game, such as being able to landscape your surroundings, reroute rivers, discover new technologies, etc. But considering that I couldn't even get past the first hour without quitting, I didn't see any of these interesting additions. \n\n\nI think the price of the game is reasonable, so give it a try, but keep an eye on the time so that you can still refund it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game looked fun, but all the citizen and leaders portraits are AI generated without any disclaimer on the store page (and are ugly as hell)",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "one single design flaw and game is ruined, theres special resources on the map that dont reappear or appear later in game. very important aspects of your econ will develop around them and for whatever reason they just disappear, your town design may even develop around them and all this takes tons of hours to set up. was a decent town building game until this occured",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "More polish than Banished, heavily influenced by it; and yet they don't secure the balance Banished had. At this point this game isn't going to be changed so... try elsewhere I'd say or get on sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too buggy to progress. in game  The storage management preferences get ignored, so you can't control what gets stored near your manufacturing etc.  Which means storages fill with things you don't need in that location, and the things you do need stop being gathered. You can go from enough food to feed everyone for years to starvation more quickly than you can do anything about it.\r\n\r\nMOD workshop seems abandoned, too, very few seem to be compatible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Game Dont help you to understand what to build first to keep your people  or how to get more people .what the farms are for theres alot it would be a fun game if there was HELP and UNDERSTANDING",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is something wrong with the goods generation/needs system. Frequently, I will see reports that I have generated N number of goods but my entire colony will be lacking it. Example, water and jackets is a frequent offender. Jacket generation would be 50 for the season, but nobody is wearing clothes....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried it as someone who plays other colony sims & its too hard, no matter what i did could never get enough food/water/fuel, NOTHING. terrible experience. make the output much higher so demand can be met cause its never enough",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The learning curve is steep in this game due to it not being an intuitive game. The guide in the game is only somewhat helpful when you need to know how to get your citizens to do certain things. I may or may not keep going with my current saves.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is what I would like to play. But at some point, and this is a game breaker for me, the thousands of units of food that I have for years, suddenly disappeared. \r\nIt would also be great if there are a bit more of information about situations. One thing I have off the top of my mind is info. about the citizens. Where are they going etc and to be a bit more accurate than in it's current state. I dont remember all comments I thought of during my 24 hours of playing. But I remember that there are things that discourage me from playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Broken Farming mechanics makes surviving impossible. Unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Way too complicated, I just want a nice easy build game; this game requires you to balance out way too many competing priorities so that it just ends up feeling like work. You have to click way too many times to get one thing done. On top of it the population either grows too slow or it does not grow at all, how do you even grow in this game. I have 3+ hours into this game and I still have not been able to establish a basic town. Boring!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Returned the game. I hate the AI portraits.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "sit around doing nothing waiting for another research point",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not Fun at All...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont bother",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nope",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love city builders but this one is just not working well for me.  My biggest issues is the tech tree.  It's so confusing.  Why can I unlock Luxury Housing only to find out I need to unlock 2 or 3 other things to be able to actually build Luxury Housing?  That should be locked until the prerequisites are completed.  I'm also not a fan of the random discovery to find animals, seeds, etc.  Year after year my people are freezing because I'm waiting for the game to randomly discover sheep.  I found myself just watching TV and letting the game run, hoping it would discover items I needed to progress.  It really needs some fine tuning and balancing to make this playable.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "As it exists I cant give it a thumbs up. I want to, but I can't because Its terribly imbalanced. I love the concept and the direction its going, especially the vast array of aesthetic additions available for you. But functionally there are problems and I'm still very early into the game which does not bode well for later on. \n\nOne example is how slowly citizens age. Unlike other similar games, it does not seem that building up your town attracts any new citizens outside of the occasional migration of people. This would be fine normally, however when your citizens have kids, it takes what seems like a realistic number of years in game for them to grow up which creates a problem because overall, the needs of your people stack up WAY faster than your number of citizens so you can VERY quickly go from being a successful settlement one year, to a starving one the next. \n\nAnother imbalance is the amount of certain resources you gain from things like felling trees. There is a forester hut that is supposed to provide a steady flow of lumber and replant trees (provided you have enough laborers working there) but again, with how quickly the game makes you try to grow, you would either have to have at least 3-4 people working there to keep up with a small town of maybe 10 homes, or have more than 1 forester. Which isn't feasible when you account for all the other things you need people for early on.\n\nThen other things like tools and iron gathering are imbalanced in the other direction entirely. For example. I put up a forester and a mine for iron. Both were running at the same time. After a couple years, my forester struggles  intensely to keep up with wood demand while the iron is just stacking up like crazy! \n\nNow a lot of this is due to the fact that most construction requires wood, on top of needing it for fuel to keep homes warm, while less things require iron in the beginning but still. I chop down what I would estimate are 20-25 trees and I get maybe 70-80 wood which trust me is NOTHING. The average home costs something like 20 or 25 lumber to build. That's 1/4 of what I got from 20-25 trees. That's insane.\n\nFinally the clinic.... Healing is insanely slow. When people are sick the clinics are decent and fixing that problem fairly quickly if you have the needed items on hand. But a physical injury? Nah.... that person is basically out of commission for a couple years. Which is again way too punishing for something you didnt do wrong and just happens as a form of challenge. \n\nI think this game has a LOT of potential, but again, it just is in terrible need of some balance before I can give it a thumbs up.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "The game is pretty cool and enjoyable for those into these kind of games. \r\nThe problem is that, like so many games of this genre, it gets old and boring pretty quickly, and while after 30 in-game years, I still had plenty of progress to make (science, new production chains, etc), I really had nothing to achieve, or anything that would engage me and make me want to play on. So I quit, and that's that.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Kingdoms Reborn is pretty much the same game, but better, and doesn't have ugly AI generated portraits in it.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Too many game-breaking bugs to actually make it worth your time.  It is a good game otherwise, but still needs time for development.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "At most I'd use this as a sandbox game.\n\nThe symbols of the Interface are tiny so I tried to size them up in the options, but turns out they stay tiny, just the UI gets bigger (so much so it can go off screen!), some of the text gets blurry, oh and the \"helpful\" screenshots have Chinese writing ._.\n\nThen there's too much info on screen which even the tutorial doesn't take the time to explain! I mean I get it, you dont't have to, but if you offer a tutorial (4 actually; for bloody beginners, intermediate and advanced AND when you start a new game file it holds your hand again even if you already did one of the specific tutorials) then at least explain it properly. Also where can I see my free workers? Definitely not in the townspeople tab, even though there is a shitton of useless info like the gender ratio.\n\nAlso the townspeople have like 6 portraits which get repeated even within the starting colony. If you're gonna go the route of portraits at least give them some variation if you're gonna make it so easy on yourself as to use AI generated images..\n\nI got this on sale and still feel scammed somehow.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Saw some people call this game the next Banished, I completely disagree.\nWhile it has the same basic game elements, it doesn't feel the same. Banished was super simple and easy to pick up and expand your town. This on the other hand? \nI found it difficult to see what was going on half the time (at least you have the view without any trees). The UI in general looks so weird, things are haphazardly thrown all over the place and I found it needlessly difficult to figure out certain information. The tutorial is extremely annoying with its near constant pop-ups, not to mention there doesn't seem to be any check in place to see if you already have a certain building built, and it will remind you to build a gatherer despite the fact you already have 3. \n\nThe vibe of the game also feels off. It is obviously going for a different aesthetic than banished, but I just don't like it. Personal preference. The mix of low-poly structures and painted portraits feels wrong. \n\nThere certainly are some good ideas in the game, such as being able to landscape your surroundings, reroute rivers, discover new technologies, etc. But considering that I couldn't even get past the first hour without quitting, I didn't see any of these interesting additions. \n\n\nI think the price of the game is reasonable, so give it a try, but keep an eye on the time so that you can still refund it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game looked fun, but all the citizen and leaders portraits are AI generated without any disclaimer on the store page (and are ugly as hell)",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "one single design flaw and game is ruined, theres special resources on the map that dont reappear or appear later in game. very important aspects of your econ will develop around them and for whatever reason they just disappear, your town design may even develop around them and all this takes tons of hours to set up. was a decent town building game until this occured",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "More polish than Banished, heavily influenced by it; and yet they don't secure the balance Banished had. At this point this game isn't going to be changed so... try elsewhere I'd say or get on sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too buggy to progress. in game  The storage management preferences get ignored, so you can't control what gets stored near your manufacturing etc.  Which means storages fill with things you don't need in that location, and the things you do need stop being gathered. You can go from enough food to feed everyone for years to starvation more quickly than you can do anything about it.\r\n\r\nMOD workshop seems abandoned, too, very few seem to be compatible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This Game Dont help you to understand what to build first to keep your people  or how to get more people .what the farms are for theres alot it would be a fun game if there was HELP and UNDERSTANDING",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There is something wrong with the goods generation/needs system. Frequently, I will see reports that I have generated N number of goods but my entire colony will be lacking it. Example, water and jackets is a frequent offender. Jacket generation would be 50 for the season, but nobody is wearing clothes....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried it as someone who plays other colony sims & its too hard, no matter what i did could never get enough food/water/fuel, NOTHING. terrible experience. make the output much higher so demand can be met cause its never enough",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The learning curve is steep in this game due to it not being an intuitive game. The guide in the game is only somewhat helpful when you need to know how to get your citizens to do certain things. I may or may not keep going with my current saves.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is what I would like to play. But at some point, and this is a game breaker for me, the thousands of units of food that I have for years, suddenly disappeared. \r\nIt would also be great if there are a bit more of information about situations. One thing I have off the top of my mind is info. about the citizens. Where are they going etc and to be a bit more accurate than in it's current state. I dont remember all comments I thought of during my 24 hours of playing. But I remember that there are things that discourage me from playing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Broken Farming mechanics makes surviving impossible. Unplayable",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Way too complicated, I just want a nice easy build game; this game requires you to balance out way too many competing priorities so that it just ends up feeling like work. You have to click way too many times to get one thing done. On top of it the population either grows too slow or it does not grow at all, how do you even grow in this game. I have 3+ hours into this game and I still have not been able to establish a basic town. Boring!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Returned the game. I hate the AI portraits.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "sit around doing nothing waiting for another research point",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}