{
  "positive": [
    {
      "review": "actually more addicting than heroin. i think i have double the hours i have here on the standalone version of the game. for being free this game is insanely good, and once you take a bit of time to understand signalling and rail network design, the game goes from insanely good to legendary. \r\n\r\nthe core loop is simple: you build transport networks from point a to b to make more money to build more transport networks from point a to b to c to make more money to... you get the idea.\r\n\r\nyou'll have achieved this loop within 10 minutes of playing, yet you'll probably be unable to stop because the itch to expand, develop, grow, and perfect your network will not let you out of it's grasp until your map is a sprawling uncontainable mess of railways, airports, busses, trucks and ships that you can't tell if they're going from point aaaz to bbcd or from point zzzf to ddaa to bbbc (fill these names in with station names).\r\n\r\nit's an incredible game with a tightknit community of (probably) autistic nerds, and i love it. please give it a try, it's free.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I have been playing Chris Sawyer's masterpiece since 1996. The community coming together and keeping it alive for 30 year is a testament to just how influential this title is. It's the Tycoon game that started the genre. It's little wonder that it still holds up today, albeit with some QoL improvements. I will continue to come back to this game over and over again, sinking countless hours into making little pixel trains and trucks haul cargo all over the world.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Building ever larger transportation and logistics networks is extremely satisfying. Any time it starts to feel a little stale, you can try adding or making some mods to shake things up. Or just come back and see what's been added in updates, which continue to this day. My Steam game time does not convey the ridiculous hours I spent with OpenTTD in the years before it was on Steam. This is simply one of my favorite ever digital sandboxes to play in. Thank you, OpenTTD devs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great Game!  A little hard to pick up as the GUI is from '95, but the game itself is still high quality.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]An extremely fun tycoon game that's literally free.[/h1]\n\nOpenTTD is modeled after Transport Tycoon, which is a game made in 1994 by Chris Sawyer, whom you may recognize from RollerCoaster Tycoon 1 and 2.\n\nI didn't actually know that OpenTTD was available on Steam until earlier this year, and I instantly fell in love with it. Just to be clear, Sawyer himself has no involvement with OpenTTD, but the game still has all of the usual \"Sawyer-isms\" that the RCT games had. If you've played them, you'll know exactly what I mean.\n\nOpenTTD is a game that's all about managing your own transport company. You build your own, road and railway infastructure, and deliver goods and passengers via roads, trains, ships, or aircraft, then build vehicles and route them to pick up and cargo and deliver it to its destination. By far the biggest draw of the game is its train system since it's by far the most in-depth system in the game and is probably the most efficient too. The other systems of transportation are mostly just there if you want to build something more immersive than a giant plate of railway spaghetti, but they're still quite fun and to use and add a lot of life to the game.\n\nThis game is quite a bit harder to learn than RollerCoaster Tycoon (or at least it was that way for me). The first few hours will probably see you running out of money while trying to build a long train route and spending a few brain-scratching hours figuring out how train signals works. Building a functional railway system is quite a bit harder than building a functional roller coaster, and it's even harder to build an [i]efficient[/i] functional railway system. Doubly so if you try to play with AI opponents enabled. If you know roughly how railway engineering works in real life already, this game should be quite easy to learn. Otherwise, learning the game will be fairly difficult, but it will also be incredibly satisfying.\n\nUnlike the RCT games, OpenTTD does not come with any of the vanilla TTD scenarios pre-installed. Or any scenarios for that matter. It instead comes with a map generator and a heightmap reader. This works wonderfully by itself, but to play scenario maps, you'll need to either download user creator ones or make your own. This leads me into my next point, which is that the game is extremely moddable as it relies on you modding it to truly make it your own game. This isn't to say that vanilla OpenTTD isn't fun. On the contrary. It's [b][i]very[/i][/b] fun, but the game doesn't give you as much base content to play around with compared to either OpenRCT2 or OpenLoco. For those of you that want to get into modding the game, there's a ton of different vehicle sets and new industries. The vanilla game however is still plenty playable and plenty fun if you want to treat it as a remastered Transport Tycoon Deluxe.\n\nNow, even though OpenTTD is a more modernized version of it with improvements that are still being developed to this day, it is still a PC game from 1994 amidst all of the fancier technical coding. I had to look up how to rotate the camera, only to find out that you can't even do that at all, and the UI shows its age sometimes. As you may have guessed though, the charming pixel art style from the isometric RCT games is also present here (thank you, Simon Foster). If you're a fan of the RCT games, the similarities between those games and this one will be charming to you.\n\nWhile the game is difficult to learn (unless you've played other transporting games before), there is quite a lot to love about it for fan of RollerCoaster Tycoon, or train games in general. The best part is that the game is literally free, so there really is no downside to trying it.\n\n[h2][url=https://store.steampowered.com/curator/42368614-OutOfGames/]Steam Curator Page[/url] | [url=https://outof.games/news/8039-openttd-is-an-entrancing-and-joyful-tycoon-game-that-you-can-play-for-free-right-now-a-timely-review/]Full Review[/url][/h2]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "swag game but id wanna have more city names cause its funny to recognize them. otherwise i enjoy messing with the infrastructure even when some of the mechanics are a bit too complicated for me for now",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a really fun game and im addicted also runs really well on older systems 2",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can be relaxing, can be stressful. Fun to watch the charts and also there is a great modding and dev team behind it still offering support for all your needs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An extremely addictive game and you don't even have to be a train enthusiast. I know absolutely nothing about trains irl but its just so satisfying playing with trains and seeing your network grow. Thats it really I just like how it looks after you build a network. I also like seeing money number go up. \r\n\r\nThe most fun way to play in my opinion is creating some silly scenario. For example I generated a map with loads of hilly islands and finnish town names roleplaying as the Kingdom of Finnish Polynesia.\r\n\r\nPeak gaming tbf",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my first real game after learning the basics, I saved up just enough money to open up two small airports and buy a single plane to make my first ever plane trip and IT CRASHED WHILE LANDING AT THE AIRPORT WHYYYYYYYYYYY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive game, one which enjoyed many years ago. The mods available expand on a top tier vintage game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good mechanics , old graphichs , fantastic community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not the most intuitive right out of the box - one of those games where the wiki or tutorials are very important - but it's challenging and a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! I downloaded it expecting a simple transport game, but it turned out to be quite complex. I had to watch a few tutorials, but I’d recommend it to anyone who loves trains, as you can create some amazing train lines.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great, charming little game that  holds up well and will continue to forever in my eyes.\n\nAlso one of the best games that will run good on a really crappy laptop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "legendary game, still alive and getting updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game in the big 2024 shit so good i went backwards in time to play it once more i only place trucks and gained 20 millions dollars and called my company Ironhide Islamic transportation systems and killed my friends train by ramming it with mine 20 million perish in the unfortunate accident and my company shuts down capitalism at its finest.\n\nMight play again in the big 2023.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS SO FUN...but....you neeeeeed to make a new world to just try things iut and to get a the feel of the game. there is no tutorial. after playing for a bit you get super big dreams to create a giant transit system...and then with a little time...you do! VERY GOOD JOB TO THE DEVS!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a realy fun game but the mouse csn be a littlr bit buggy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite entertaining, it makes you want to play more even after 50 hours invested in a couple of runs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an oldie but a goodie. It's super in depth and gives you every statistic you could possibly want, while also being super fun and playable with all its different modes and four different maps + the NewGRFs as well. I highly recommend OpenTTD for anyone that likes logistics, city planning, and creating lean business that maximize profits and chop expenses, while not getting into the really small scale day to day type things (focus on transport, not grocery stores and malls and crap).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would ABSOLUTLY!!!! recamend this game to other city or transport builders like me.But  if you like adventure or fighting and not city building i would recamend Muck or W,O,T (world of tanks)\r\nbut over all that tyoun  should deffenetly give this game a try!!! (also its free => )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a free transport simulation game. It reminds me of Simcity, but i like this game way more than that game. It's fun and addicting to me. If you liked Simcity or games where you build things, this game is for you. Though it is hard to get the hang of how to make money in the game, but once you do it's even more fun. There is a tutorial that you have to add from the scenario menu. That will help you a lot with understanding how to play the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even in 2025 probably the best transport game, if not the prettiest. Tons of mods to keep things interesting, such as ones that add even more vehicles or a more goal-focused experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game that isn't to involving and helps you formulate strategies in the transport industry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "seems complex at first, but trust me, it's much simpler than it seems\nvery fun, especially as you're connecting everything together",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i’ve been playing OpenTTD for a while, and it’s a fantastic transport simulation game. Building complex networks of roads, railways, docks, and airports is deeply satisfying, especially on the huge procedurally-generated maps. Watching industries grow and managing fleets of vehicles to keep everything running smoothly feels rewarding.\nThe modding community is excellent, giving you endless possibilities to customize vehicles, industries, and scenarios. The learning curve can be steep at first if you’re new to transport sims, and the graphics are simple, but that’s part of the charm. If you enjoy strategic planning and management, OpenTTD is a must-try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is the best free game ever purely cuz its foss (free, open source software)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games ever made, simple yet incredibly engrossing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game about managing your own transport company, alone in the world or rivalizing against other companies led by humans in multiplayer or by AI. Graphics are very pretty in my opinion and the gameplay loop is very cool. Game isn't hard to learn and it's pretty simple to make income in it but there is a lot of nuance that can make the game very interesting in the long run. There is a ton of modding content available inside of the game with a press of a button. The game by default offers trains, trucks, ships and aircraft as means of achieving your objectives. Highly recommended for people who like micro-management games or building huge interconnected infrastructures.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "step 1. download game\nstep 2. dont know what you are doing and quit after 1 minute\nstep 3. Random video on youtube from openTTD pops up\nstep 4. play the game for 30h straight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best logistics simulators ever made, still holds up to this day even though the original Transport Tycoon was released in 1994!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy how good this simulation holds up today. Still super fun, intuitive, and all around a great time! The trains are so much fun to mess around with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a pretty simple game and its quite fun even for an old game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Downloaded this quite a few years ago, got bored after 30 minutes and didn't know how to play,\nI am coming back to see if I can enjoy this game because I am bored again...\n\nMight also waste my time, but... I am bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра OpenTTD – это великолепный ремейк и расширение классической Transport Tycoon Deluxe. Она подкупает своей глубокой стратегией и практически безграничными возможностями в создании транспортной империи. Начиная с маленькой компании, вы строите железнодорожные пути, автомобильные дороги, аэропорты и порты, соединяя города и промышленные объекты для перевозки товаров и пассажиров.\n\nГрафика, конечно, устарела, но для многих это часть очарования. К тому же, OpenTTD имеет огромное количество модов и дополнений, которые улучшают визуальную составляющую и добавляют новый контент.\n\nСамое главное в игре – это сложность и глубина. Вам нужно тщательно планировать маршруты, следить за финансами, учитывать конкуренцию и постоянно развивать свою сеть. Иногда это может быть непросто, но когда ваш транспортный гигант начинает приносить прибыль, появляется невероятное чувство удовлетворения. OpenTTD – это игра, в которую можно играть годами, открывая для себя новые стратегии и возможности. Рекомендую всем любителям градостроительных симуляторов и экономических стратегий.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A modern, open-source reimagining of the classic Transport Tycoon Deluxe, offering deep logistics simulation where you build and manage a vast transportation network.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has trains. So people with that Autism Flavour will love this. Also busses, planes and ships. So yeah, 'Tism collection really.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is confusing as all hell, please someone teach me how to use rail signals i been trying for 4 hours. oh and money i like money a lot",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "2025, my graphics card died and this game from 1994 is perfect for my current rig. Put 50 hours into this like nothing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is Awesome! You build roads and trains and stuff you can even change the landscape!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Open Transport Tycoon Deluxe. Just look at how many hours I've put in. It's worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved Transport Tycoon, and I love OpenTTD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Delivers exactly what it says on the tin. Could play for 5 minutes, or 5 decades, and you will still never do everything that's possible in this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best management game that is simple, intuitive yet deep and complex. It's also free and extremely lightweight.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game was kind of complicated at the start but later when I learnt all of the tools and how to actually build huge railways the game was amazing. The pure dopamine of doing all of the hard work and sitting back as the money rolls in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute classic PC gaming, revitalised by volunteers to be (very) playable in current year. It's got a bit of a clunky interface, but seeing all your trains whizzing around and watching your cities grow never gets old. And it's free!\nIf you like the logistics in Factorio or RCT2 this one is for you.\nThis one is worth watching a few tutorials for.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I sunk an ungodly amount of time into the original TT and TTD when I was a kid.\nIt's nice to know I can go back and relive those carefree days whenever I want to.\nThe modding support is also a nice touch that breathes new life into this already timeless classic.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "a great way to play a classic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool relaxing game unless you go bankrupt 😮😮😮",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can:\r\nchooch in like 3 different ways - beep honk - neeooowww\r\nAND\r\nwhatever sound a boat makes\r\nall for the low price of 'none'",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty good, good idle game if you wanna melt away one day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Money go up and trains thrown in there somewhere. The main menu music is very swanky along with the rest of the default sound track. \n\nChoo-Choo!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice and cozy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "trains are the best and will be the only thing ill use ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is super customizable and great once you make your first industrial line",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I give this game a solid Train/HOW DO I MAKE THE TOWNS LIKE ME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game for autistics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "free transport romanian simulator train bus plane",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played with my friends and they turned it into a RTS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The genius lies in simplicity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game makes my nipples pointy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not so addicting.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a very fun game, its very chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely good time killer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My OG addiction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "simple yet elegant game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tickles my Civil Engineering Brain",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool and good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is absolutly great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game ngl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game\r\nhyvä peli",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ma unustasin sul ronge vaja 😭🙏",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mm yees me likey train game :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Employment for the unemployed",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i like it but it is a bit complex",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Splendid game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it has GREAT potential",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "真上头吧",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i'm autistic and like trains",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "RIGHT IN THE CHILDHOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My legs go numb thinking aboot this geam!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "psychological warfare.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Train goes kaboom. 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "METKA simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like trains.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is toil leam tréanaichean! 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is my original eu4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "trains",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "trains",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trains",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to know how to play this game and I loved it, but... restarting it after years... there seems to be no tutorial. No nothing to get you started. The wiki page the help/manual button links you to doesn't give you help, it gives you history of the game.\n\n[h3]The onboarding of this game is... nonexistant. If you want to learn how to play this game, you have to go looking for it, as it's not in the game.[/h3]\nYou're given tools and absolutely no explanation of how to use them. So I can't really give this a recommendation.\n\nIt sucks to say that because I remember enjoying it back in the day and wanted to get back into it.\nIt's GNU open-source if I remember correctly. I see absolutely no reason not to include a tutorial.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Still better than Ubisfot games. Boring ass gameplay, bald graphics. But still better than Ubislop games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn’t like it, i usually don’t leave bad reviews but i wanna annoy a friend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand how to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boredom Simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}