{
  "positive": [
    {
      "review": "Open world storyline is good upgrades is easy and quick to level up would recommend this game if you are a relaxed survival zombie player",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Plays like a janky online mobile version of state of decay, but with a terribly overpriced cash shop. Example the battlepass is $25 and many other \"passes\" are also $25. A little basic. but still fun a new pve coop mode just got added with the newest update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the graphics and animation and movement of the character is smooth the opem world is emmense and beautiful my only setback if i had to name one would be thats its alot of reading pertaining to the dialogue would be nice if each character had a voiceover of their dialogue for more of a listening experience, oh and also it was very hard for me to figure out a for certain way to switch between the two modes in which you move the character very frustration when youre being swarmed by a horde of zombies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game  have recommended this to several people love the simple controls graphics and game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A open world zombie game with powerful opponents and every areas has different different level experience I don't explain much you should try yourself this multiplayer game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It'a like playing a LITE version of State of Decay on an open-world map... I like it !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it, a lot of grinding but what games arn't these days. not all of it is multiplayer and plenty of microtransactions and spending in game. that said, it is free so still very enjoyable for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great game don't like the micro-transaction heavy part but the gameplay is great still would like to see more features and maybe a multi Co-Op Campaign i don't mind solo but clearing a masked band hideout with friends would be fun overall if you like a state of decay Free to play game this is your genre. The community is really Approachable and noob friendly you'll end up finding a guild to join easily.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has potential looks fun to play but\noptimisation and mechanics Not great \nGraphics not rendering in some cinematic missions \nThe aim and movement needs a fix it feels off \nthe cars movement needs a fix too much delay on acceleration",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра \"Darkest Days\" - это уникальный шутер от первого лица, выделяющийся на фоне других своим необычным сеттингом. Вместо банального сражения с зомби или инопланетянами, мы путешествуем во времени по разным катастрофическим событиям истории, спасая ключевых людей, необходимых для предотвращения еще более ужасного будущего.\n\nГеймплей разнообразен: стелс, перестрелки, спасение гражданских. Это не просто \"беги и стреляй\", часто приходится обдумывать свои действия, использовать окружение и ресурсы с умом.  Оружие и экипировка, хоть и не блещут разнообразием, функциональны и соответствуют эпохе.\n\nСюжет интересен, хотя и кажется немного \"сырым\".   Визуально игра не выглядит современной, но атмосфера отчаяния и безысходности передана хорошо, особенно учитывая год выпуска.\n\nВ целом, \"Darkest Days\" - это игра для тех, кто ищет необычный шутер с интересной концепцией и готов простить ей некоторые недостатки.  Если вас не отпугивает устаревшая графика и вы цените оригинальные идеи - попробуйте, возможно, вам понравится.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game its not bad but i want to be the aim ez but the game cool not bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first time the game looks not good due reviews and graphics, but after few hours of playing and understanding what need to do game being more interesting🔥",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if it weren't for the fact that this is another mobile game ported to steam.....  the UI is bad and the game play needs work but is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the first zombie game I played where you built communities. I love this game because you can play with pets, have different followers follow you with their own backstories, and you have to scavenge to upgrade things — which is AMAZING. It really gives that survival in a zombie apocalypse. Would recommend  to play as you can play on your own, or with your friends around the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's worthwhile your time spent! (ps. don't compare this with Days Gone, it's another mode of gameplay)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked this game as much very well as story based survival so i am so fine satisfied this gameplay explore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tem história principal? Sim, mas nada é mais relaxante que pegar sua katana e sair sem rumo decapitando zumbis",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chill game not fansy but its a nice looking world game handles fine and its free",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. I enjoy the graphics and the zombies not being outrageously disgusting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is easy but so difficult to understand but its still a good play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Please allow residents to be purchased using red diamonds and other products, not just money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its good but pls don't turn this into a p2w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "to many bugs, please fix on next update",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. I hope one day you could accept mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like State of Decay, this game is for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has great potential. I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far it is a decent game that is keeping my attention",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Online coop is super cool",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "interesting adveture",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Niceee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "REMIND ME OF SATE OF DECAY",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOODDDD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "imagine leaving negative reviews for a decent game thats free and in development so many good games tanked because of bad critics thinking everything should run like  AAA title right off the bat and for free....love living in 2025\n\n\ngood game check it out",
      "voted_up": true,
      "votes_helpful": 58
    },
    {
      "review": "Open world storyline is good upgrades is easy and quick to level up would recommend this game if you are a relaxed survival zombie player",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Plays like a janky online mobile version of state of decay, but with a terribly overpriced cash shop. Example the battlepass is $25 and many other \"passes\" are also $25. A little basic. but still fun a new pve coop mode just got added with the newest update.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is super awesome and legit; I highly recommend it. If you don't have a mouse at all, it's still easy to play. I can customize my character, and there's a tutorial on how to shoot, interact, and operate the whole game. its better if you're as young as 13+ to play it because of the maturity. not anything subliminal, but it's age-appropriate. for example, it's harder to teach a 3-year-old what an 8-year-old knows, you know? That's what I mean by age-appropriate. There's soft gore, and the makeup of the whole system is fluid and runs smoothly for many PCs. I played this game for 36 hours accidentally and it was worth every minute. i also noticed that its a 1st POV, so its a storyline like Dying Light. except you read it (as it pauses even if you're attacked, no damages because you're paused reading the story or dialog) like dialog in mobile apps. tbh this game is boss mode and i love it completely. one can even change the difficulty. now i havent finished the game, but i can tell im gonna love the thrill of killing these zombies! they're so easy to kill.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "State of Decay clone with PvP and a long grind for the best gear. Cash shop is aggressive, but f2p is doable by looting and selling rare items that you come across at level 40 on the exchange. Probably one of the better mobile games I've played and feels good on PC. (except for that stupid cash shop)",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Optimization is great, nice gameplay and mechanics.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "well well well very nicely put together the concept is pimped out gameplay is going to be flawlest when updates fix blips and sheet new favorite zombie mmo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honest review... If you have ever played state of decay. this is the version from Wish. it has the same principles but there is more to it like a skill tree. you can assign \"survivors\" to certain areas of the map once they are unlocked, you can upgrade their weapons as well. If you enjoyed State of Decay then give this ago and if your bored and want a chilled game then this is one of them ones that id recommend. \r\n\r\nthe cons to the game are simple, graphics remind me of PS3 Tomb raider, movement is mid and driving is horrible. but over all i give the game a 5/10. take into consideration the game is free. you get what you pay for",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far it has been a really immersive game. Best survival game i have played. And I have been paying since pong!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely alot of fun that has some issues but has an insane amount of potential! I really hope the devs keep making it better and better and don't abandon it! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was a good game for all. So much excited to play this I watch this trailer gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the graphics and animation and movement of the character is smooth the opem world is emmense and beautiful my only setback if i had to name one would be thats its alot of reading pertaining to the dialogue would be nice if each character had a voiceover of their dialogue for more of a listening experience, oh and also it was very hard for me to figure out a for certain way to switch between the two modes in which you move the character very frustration when youre being swarmed by a horde of zombies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game  have recommended this to several people love the simple controls graphics and game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A open world zombie game with powerful opponents and every areas has different different level experience I don't explain much you should try yourself this multiplayer game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It'a like playing a LITE version of State of Decay on an open-world map... I like it !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it, a lot of grinding but what games arn't these days. not all of it is multiplayer and plenty of microtransactions and spending in game. that said, it is free so still very enjoyable for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great game don't like the micro-transaction heavy part but the gameplay is great still would like to see more features and maybe a multi Co-Op Campaign i don't mind solo but clearing a masked band hideout with friends would be fun overall if you like a state of decay Free to play game this is your genre. The community is really Approachable and noob friendly you'll end up finding a guild to join easily.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has potential looks fun to play but\noptimisation and mechanics Not great \nGraphics not rendering in some cinematic missions \nThe aim and movement needs a fix it feels off \nthe cars movement needs a fix too much delay on acceleration",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Игра \"Darkest Days\" - это уникальный шутер от первого лица, выделяющийся на фоне других своим необычным сеттингом. Вместо банального сражения с зомби или инопланетянами, мы путешествуем во времени по разным катастрофическим событиям истории, спасая ключевых людей, необходимых для предотвращения еще более ужасного будущего.\n\nГеймплей разнообразен: стелс, перестрелки, спасение гражданских. Это не просто \"беги и стреляй\", часто приходится обдумывать свои действия, использовать окружение и ресурсы с умом.  Оружие и экипировка, хоть и не блещут разнообразием, функциональны и соответствуют эпохе.\n\nСюжет интересен, хотя и кажется немного \"сырым\".   Визуально игра не выглядит современной, но атмосфера отчаяния и безысходности передана хорошо, особенно учитывая год выпуска.\n\nВ целом, \"Darkest Days\" - это игра для тех, кто ищет необычный шутер с интересной концепцией и готов простить ей некоторые недостатки.  Если вас не отпугивает устаревшая графика и вы цените оригинальные идеи - попробуйте, возможно, вам понравится.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game its not bad but i want to be the aim ez but the game cool not bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first time the game looks not good due reviews and graphics, but after few hours of playing and understanding what need to do game being more interesting🔥",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if it weren't for the fact that this is another mobile game ported to steam.....  the UI is bad and the game play needs work but is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the first zombie game I played where you built communities. I love this game because you can play with pets, have different followers follow you with their own backstories, and you have to scavenge to upgrade things — which is AMAZING. It really gives that survival in a zombie apocalypse. Would recommend  to play as you can play on your own, or with your friends around the world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's worthwhile your time spent! (ps. don't compare this with Days Gone, it's another mode of gameplay)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 would reccomend. best free Zombie game ive ever played, the intro is kinda mid and i was tempted to delete it. but if you just trust the process its fire.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Graphics are outstanding.  \r\nLove the feel of playing in a comtempoary setting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not bad game i'm having fun, stuff is over prices but it's ok",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its not bad, the pay to win seems to be a big thing im barely at level 20 and haven't seen the point of buying anything. I've heard others say its a big part of upper game so who knows\r\n\r\nOver all its a fun little game to play on my streaming channel, reminds me of PubG start up when you farm for weapons and the remaning part of the game like a RPG were your building up things like a farm vile.\r\n\r\nOver all  not bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Zombie Game, but needs hot male skins and better 3rd-person field of view, I want to see my character from head to toe. \nTattoo options would be nice, and voice lines options would be cool if added to this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay so combine all the zombie games you love into 1 and this is it.\n\nWork in progress though so be patient!  \n\nLoving it so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of depth in this game, but overall fairly straight forward. Has been fun thus far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recently played this game and it is very awesome. Those who love open world and zombie fighting and survival must love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am itching for state of decay 3 since I have played 1 and 2 for thousands of hours.. I can say the creator of Darkest days really took notes on what made state of decay great and surprisingly improved on some aspects. Highly recommend this great game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far so good! The game has a good story mode (RPG style) that i love. YOu can enjoy it at your own pace without pressure. If you want multiplayer? There's a map set for it, if you want pvp? there's some there too, want raid? There's one. And the best part? Free. You can support the devs by buing in game stuff but is not pay to win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't understand why this game has so few positive reviews. In my opinion, it's a very cool game worth playing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i liked this game as much very well as story based survival so i am so fine satisfied this gameplay explore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall a good game, but the backpack mechanics is kind of lacking. It would be nice if you could get increased capacity on the backpacks as your backpack increases level. Instead you are stuck with the same wimpy amount of spaces throughout the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am a fan of SOD but this zombie shooter is wider as it gets to open world , character build, armor and guns upgrade...in for 21 hours and love it ! would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, laid back zombie survival game. Had this in my steam library for over a year... Wish i had just played it sooner. 100% Worth a play if you have not played it before.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "after level 40 take  very more time level , I have level 9 time get free 9 skill\r\nwhit out bay any vip 30 days ,\r\n\r\nWean start game  spend 60 days bay 2 vip bonus . , bay  some extra car   one dog collect more stuff wean go out in house \r\nNow it more hard too found blue printer . \r\n\r\nI use  20 hour lotting , Place your crew in maps . It help get  extra get stuff  or found blue printer\r\n\r\nmulti-player camp now is very boring , I play solo on muli-player . Dont see a camp bass .in multiplayer , join a gruop camp .\r\n\r\nmybea i bay 30 days vip agien testing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just spent a few hours in DARKEST DAYS and wow — the open world is surprisingly beautiful for a zombie apocalypse! Driving through deserted towns, scavenging for supplies, and building up my own little sanctuary made for such satisfying moments. The co-op mode with friends added some fun chaos. There are a few rough edges, but overall I’m having a blast and eager to see how it grows. Highly recommended if you love survival plus shooter combos!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I have only played for 5.9 hrs but i really enjoy it. I see alot of people throwing shade but only played 1 or 2 hours. Its not bad at all. I find the keybinds is a little weird and they should have a option to have auto run or not. Other wise its not bad atm. Will do another review once i get to atleast 20hrs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game so far. bring out the good stufff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im stock in this game more improvement and more new world for multiplayer please",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tem história principal? Sim, mas nada é mais relaxante que pegar sua katana e sair sem rumo decapitando zumbis",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chill game not fansy but its a nice looking world game handles fine and its free",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. I enjoy the graphics and the zombies not being outrageously disgusting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is easy but so difficult to understand but its still a good play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "played for just under 30 hours, i LIKE this game, seen 0 issues. no crashes, no bugs, even the community is supportive of new players. will KEEP playing this game,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Please allow residents to be purchased using red diamonds and other products, not just money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its good but pls don't turn this into a p2w game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "to many bugs, please fix on next update",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. I hope one day you could accept mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like State of Decay, this game is for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has great potential. I like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far it is a decent game that is keeping my attention",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Online coop is super cool",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "interesting adveture",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "honestly this game is a piece of crap because it's various problem but \r\nthe most annoying problem is stuck at initial black screen after launching.\r\nthe devs doesn't cared about this issue so don't waste your time on this one!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "the game needs UI polishing and the way to monitor mission progress is messy , you can easily get lost with missions.  not to mention the basic graphic needs for a game to success .",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "One of the Games of All Time. It is aggressively apparent that it's a mobile game, and a mid one at that. I normally try to stay positive but it's super boring. There's no risk, especially when you are gifted a purple tier shotgun 10 minutes in. You don't really take damage, getting shot in the face deals 1-2 damage of your 250+ Health pool. Zombies are slow and get staggered very easily if they survive more than one hit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game makes you play to level 10 to play with friends and sucks. Most mobile game are of better quality.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "like a looter shooter for your phone but on pc. poor graphics. npcs are to easy. tutorial makes you follow a story line when all you want to do is learn how to shoot loot and move. All the tags for this game are not correct. why say open world when its obviously not. Just gonna piss off the people looking for a different style of game then what the developers made and give you more down votes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was going great until all of a sudden  you start losing gear when you die.  No you can't even go back and recover them.  A game breaking mechanic like that ended the game for me.  These weapons can take dozens of hours of farming to just have them disappear completely. Until they fix that the game is unplayable.  Has to be the dumbest game mechanic i have ever seen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is sadly horrific! The dialogues and busts are made of literally AI, gameplay is terrible it feel like a mobile game. Most of the time you 1 shot zombies and do very repetitive main quests... Yes the main quests itself are repetitive, each quest all you do is search this box, then search another box to proceed another \"search box\" quest. I thought its a part of tutorial so i forced myself to finish it but after a hour i couldnt endure this torture anylonger so i gave up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Anyone else having fatal errors shortly after launching the game? There's gotta be a way to fix this or is it just in the devs side?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "when i go to play the game it shows a fatal error. is anyone else having this issue? im on a i7 cpu and 2070 gpu so im at or over recommended specs. ive tried everythinng to get it to work and nothing seems to fix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I with friends going to abandon the game. We always playing as a coop team and in this game you can't help to your teammate, no defibrillator, no weapon or armor drops, can't revive wounded teammate nor his NPC companion with defib unit. No money/resources drop or exchange. For example: I have cloths and weapons for teammate with lower level, but cant give it to him. - the game simply has lack of team spirit as it was planned to be solo marauder play style. It ruins it for us. although overall it could be nice game with potential, but we have what we have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Screw this game, I had to delete my frickin account (the NPCs referred my chacarter as a he when and \"he\" was a she)  and now I can't make a new account.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not as good as i thought  it would be , ig  thatll explain the amount of  time i played",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you've ever wanted to play State of Decay 2 on Mobile, but on your PC? This game is for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty decent on mobile, tried playing through Steam and get \"Fatal Error\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has bad quality when it comes to grapichs, and also there's no way to play multiplayer even if the game is tagged as Co-Op, worst 105 minutes of my life, I DON'T RECOMMAND...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "very very average game, 15 years ago would be fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this shi says its multty player but when i tryed playing with my hb this shi was singleplayer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS SO BORING,YOU HAVE TO PLAY THE TUTORIAL FOR SO MUCH TIME AND ITS NOT EVEN CLEAR IF YOU CAN PLAY THIS CO OP OR NOT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "игра не грузится на моей 2060",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this games so buns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trailer is better than the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mobile trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "what the",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lol no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "f",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "f",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the potential to be a great survival Looter Shooter game however it is highly let down by the sheer greed and lack of care by the development team. \r\n\r\nThe game itself has many great facets and the single player/story line part of the game is quite good and the going from level 1 to 40 is enjoyable.\r\n\r\nHere is where it goes down hill from there and I'll provide examples and feedback.\r\n\r\nI have onver 1700 hours playing this game over the last 4 months and myself and others have provided many suggestions in the discord suggestion channel about how to improve areas of the game. Much of this feedback is responded to by the DD_Team who are quite helpful and pass our direct feedback on to the developers. Unfortunately that's where it stops and the developers have zero interest in listening and catering to their player base and have repeatedly ignored player requests to fix several key issues within the game.\r\n\r\nThe biggest key issue being the upgrade system within the game. For new players thinking of playing this game, look elsewhere because once you hit level 40, there are quite a few roadblocks because of the upgrade system. Your first upgrade os 100% success rate and it then goes downhill from there, level 2 on your weapon becomes 50% success rate and here's the tricky part, it's not fail once and then guaranteed the second time, it's 50% success rate every time. Many players have attempted for over 8 times to upgrade their weapon to +2 or +3 and have failed 8 times straight, every upgrade costs money, ER and an upgrade box and depending on what grade of weapon/armour you are trying to upgrade, the materials required are higher. \r\n\r\nHere's where it gets even worse. When you go from +2 to +3 on your weapon and are successful, every other attempt you have and fail, you'r weapon will downgrade back to a +2 being hte lowest it can go. So if you are lucky enough to get a weapon to +5 and want to attempt a +6 upgrade (which has a 25% success rate) and that upgrade fails, you will go down to a +4, if you again attempt to re upgrade back to +5 and fail again, it becomes a +3 and if you fail again, you are down to a +2.\r\n\r\nBasically you could spend 2 days farming to upgrade your weapon and end up worse off than you were to begin with. The flow on effect of this is, there are numerous daily raids and the higher you rank by doing more damage, the better rewards you receive and when your gear drops damage dramatically, you have very little chance of making the top 10 or within the top 5.\r\n\r\nAlso, within the new area they have released, it drops weapon and armour blueprint fragments which you require 100 to convert to being able to craft that item. Here''s the best part, you require level 9 or level 10 Forge facility to 1, be able to craft the blueprint, and 2. be able to make the item. And to make the item, you require titanium or nano fiber which never drops. Out of the 1700 hours played and constant grinding i've done in the game, I've managed to obtain 5 titanium and 4 nano fiber. 3 of each ot these were obtaned from the final quest line so in essence, out of 1700 hours played and farmed, i've obtained 2 titanium and 1 nano fiber and when you need 66 of each for shelter level 10, it would take years to be able to do, let alone be able to craft an item. They have set the game up to the point where you need to purchase red diamonds with real money and then purchase items off the exchange with red diamonds. You can also use real money to purchase ER and weapon upgrade boxes. Again all set up for pay to win and spend as much as you can to make the developers rich. What's worse for the paid players is they can spend all that money on buying rubbish level 40 SSR weapons to decompose for the weapon upgrade kits and have them constantly fail or downgrade their high level weapon that some have paid over $500 in real money by buying red diamonds to purchase the items.\r\n\r\nThey have also created a new area where the moster levels are vase line lvl 46. Now you can only get to level 40 and your weapon is level 40 so you need a +5 green weapon N grade to be doing full damage or able to kill the lvl 46 mobs. If your weapon has been downgraded to a +2 through trying to upgrade, you are rendered useless in that area and can't farm there.\r\n\r\nThe next biggest issue players have is the extremely low drop rate of titanium and nano fiber which is used to go to shelter level 10. you need 66 of each and even the top level players have not been able to achieve this since playing from launch nearly 6 months ago. \r\n\r\nThey also have facility mods which drop quite often but are basically an ornament in your locker because you require level 10 shelter and lvl 10 facility of each certain facility to use them, Again, due to the extremely low drop rate of higher end blueprints, not one person in the game after 6 months has a level 10 facility to even be able to use a facility mod.\r\n\r\nPlayers have been pleading for well over 3 months to fix these key issues and the developers have constantly ignored the player base requests and feedback to the point where now hundreds of players have stopped playing and therefore trying to fill raids has become quite difficult as the raids are region locked. It's to the point where players are using a vpn to \"server hop\" to find a full server. This in itself is another issue the players have requested be addressed and the raids merge and fill and a new one starts when the first one is full however has also fallen on deaf ears.\r\n\r\nWhat the developers have become really good at in this game is releasing a new pet, new resident, new vehicle, new armour or new weapons for players to purchse (with real money of course) and their only focus is what new item or pet can they release so people spend money in the game. \r\n\r\nThe saddest part is, if they fixed the above key issues, they would have a higher player base and more people would put money into the game but unfortunately they don't see it that way and their sheer greed is slowly ruining what could be quite a great game.\r\n\r\nMy best advice, either avoid this game until they fix these key issues, or just play very casually for the story line and forget about trying to do much after level 40. Don't waste your real money on a game that wants to set you up to fail and suck you in like a gambling machine with their upgrade system.\r\n\r\nIGN: Wokafella",
      "voted_up": false,
      "votes_helpful": 89
    },
    {
      "review": "This game is not worth a look. It has a broken upgrade system, you can sink many hours into grinding to get fail after fail on upgrade attempts. I have over 100 upgrade kits into a sr weapon and it is curently  a plus 2. with six straight failed attempts in a row.The patch they just recently did broke the residents they do very little damage now. There update seems to punish honest players. lontree tuneel  is a main game mode and now it is limited to 3 times a day. sun flowers you kill to get er and reward now spawn zombies to kill and get no reward . that makes it even more of a grind for even less of a reward. then after long sessions of endless grinding you get to go spend the fruits of your labor to watch the downgrades roll in.... this game is in a really bad state. it does not seem to get any better..seems to get worse with every update.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Sure, you can play for free. It is nice mix of State of Decay and MMO. You will get tired quickly tho. It is early access right now and doesn't have much of a content to keep you. Not mention their prices for things in the game. I mean real life money dollars. They don't know that not everyone on this forsaken planet use dollars.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "This is another game that uses [b]AI ART AND DOES NOT DISCLOSE IT.[/b]\r\n\r\nThere's a very low chance you are playing this game anyways, the story is very generic and the mobile like elements such as \"click-here\" tutorialization, daily log-in rewards, cumulative log-in rewards, level-up rewards and so and so forth have put you back already.\r\n\r\nIf they haven't then don't play this game, most of the assets seem AI generated, the definitive proof came from the Taxi vehicle you obtain at Level 8. If the lack of a soul in a game is alright to you then, the shooting is mediocre, the driving is mediocre, the missions are alright, the skins are gooner bait and the jrapics are mobile-esque which means even having an RTX 4060 will not help this game from still looking like ass.\r\n\r\nTLDR; It's a mediocre game with generative AI art.\r\n\r\nP.S. The boys and I will [b][u]NOT[/u][/b] be playing this one.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "The tutorial is just toooooooooooooooo looooooooooooooooooong... Even after clicking through all of the story linenever end even about an hour of playing it never end",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The tutorial takes a good chunk of time and the game play can be kind of glitchy. Tried to play this with others and after an hour we still weren't able to play together. Be prepared to spend some time on this before being able to play with others.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "honestly this game is a piece of crap because it's various problem but \r\nthe most annoying problem is stuck at initial black screen after launching.\r\nthe devs doesn't cared about this issue so don't waste your time on this one!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Would be alright, but the party draw system is probably one of the dumbest ideas in any game. If I pick up an item, there's absolutely zero reason that it should go to my party's inventory. it's downright stupid. It literally got to the point where I don't even want to play anymore. and the similarities to state of decay would make it fun. I also don't like that I can't just do the regular game with my party. my nephew runs with me and I don't want to deal with a bunch of other people while i'm trying to just survive",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "If you ever wanted to know what it would be like to explain what State of Decay is to someone that's never played it, and they used ChatGPT to create a new game but also wanted to make it live service with a battle pass, this is the game for you. \n\nUtter garbage. Somehow worse graphics and gameplay than State of Decay 1 which came out in 2013.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "installed and i go to open the game only to get stuck in a black screen. it must be a launching issue or something. tried resetting my pc and authenticating the files and still black screen. uninstalled and wont return.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "One of the Games of All Time. It is aggressively apparent that it's a mobile game, and a mid one at that. I normally try to stay positive but it's super boring. There's no risk, especially when you are gifted a purple tier shotgun 10 minutes in. You don't really take damage, getting shot in the face deals 1-2 damage of your 250+ Health pool. Zombies are slow and get staggered very easily if they survive more than one hit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game makes you play to level 10 to play with friends and sucks. Most mobile game are of better quality.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game was going great until all of a sudden  you start losing gear when you die.  No you can't even go back and recover them.  A game breaking mechanic like that ended the game for me.  These weapons can take dozens of hours of farming to just have them disappear completely. Until they fix that the game is unplayable.  Has to be the dumbest game mechanic i have ever seen.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game needs UI polishing and the way to monitor mission progress is messy , you can easily get lost with missions.  not to mention the basic graphic needs for a game to success .",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The tutorial is just too long... Even after clicking through all of the story line you only get about half way through after an hour of playing. Maybe its a good game and I'm impatient but I was not impressed whatsoever :(",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not a good game at all. If you are a solo player you will have to spend real money or depend on help from others in the game. Several better end time games for little to nothing that are 100% better then this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Darkest Days by NHN is, without exaggeration, one of the most profoundly boring and painfully uninspired games I have ever subjected myself to. Calling it a “game” feels generous. It’s more like an accidental screensaver that somehow ended up on Steam.\n\nThe core mechanics—if you can call them that—are an absolute disaster. Every system feels like it was duct-taped together during a coffee break, then abandoned without a second thought. Combat is sluggish, progression is meaningless, and every moment spent trying to understand why anything works the way it does feels like a personal attack on your free time. Nothing fits, nothing satisfies, and nothing ever evolves into something worth caring about.\n\nThe boredom is so dense you could bottle it. I’ve had more thrilling experiences watching paint dry, because at least the paint eventually changes.\n\nThis entire experience reeks of a lazily shoveled mobile port smashed onto PC without the smallest attempt at optimization, refinement, or even respect for the platform. Menus feel like they were ripped straight from a phone UI, slapped onto a PC screen, and left there, unapologetic and confused. It’s as if someone said, “Eh, they’ll deal with it,” and called it a day.\n\nEvery minute I spent with Darkest Days is a minute I wish I could reclaim. If time is the most precious resource we have, this game is a vacuum—an all-consuming void where hours go to die.\n\nAnd honestly? Anything would be better than this. Folding laundry. Reorganizing cables. Counting ceiling tiles. Watching grass grow in real time. There is no activity so mundane that it wouldn’t feel like a dazzling thrill ride compared to this dung heap of a title.\n\nDarkest Days has no redeeming qualities—none. Zero. It is the gaming equivalent of a shrug followed by a sigh followed by silence. Its the equivalent of a home where Dad went out to get cigarettes and didn't come home, if Dad called you and said \"Screw this I'm leaving\" And your five year old little self is just sitting there in your crappy diaper wondering wtf just even happened.\n\nIf you value your time, sanity, or pulse rate, play literally anything else. ANYTHING.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is sadly horrific! The dialogues and busts are made of literally AI, gameplay is terrible it feel like a mobile game. Most of the time you 1 shot zombies and do very repetitive main quests... Yes the main quests itself are repetitive, each quest all you do is search this box, then search another box to proceed another \"search box\" quest. I thought its a part of tutorial so i forced myself to finish it but after a hour i couldnt endure this torture anylonger so i gave up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Anyone else having fatal errors shortly after launching the game? There's gotta be a way to fix this or is it just in the devs side?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "when i go to play the game it shows a fatal error. is anyone else having this issue? im on a i7 cpu and 2070 gpu so im at or over recommended specs. ive tried everythinng to get it to work and nothing seems to fix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I with friends going to abandon the game. We always playing as a coop team and in this game you can't help to your teammate, no defibrillator, no weapon or armor drops, can't revive wounded teammate nor his NPC companion with defib unit. No money/resources drop or exchange. For example: I have cloths and weapons for teammate with lower level, but cant give it to him. - the game simply has lack of team spirit as it was planned to be solo marauder play style. It ruins it for us. although overall it could be nice game with potential, but we have what we have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh.Mobile trash, generic, boring,  and probably uses AI art and do not disclose it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun but the shooting sucks. you could have like 5 Z's in front of you and shot them with a shotgun but manage to miss all of them.. I think its called Hit boxes or something? Any way yeah Il come back and recommend it to people once that gets fixed but for now I do not recommend..Ha the other day i was playing and i shot a window point blank with a shot gun and guess what? It missed.. LOL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ok so after 35 hours this game is.. Meh. Love this genre, but this game is lacking in certain areas. Endless fetch and clear quests for these communities that give you a tiny buff if you upgrade them. Also, no visual progression as the communities rebuild them with your help, just the same bland NPC's wandering about. No building to speak of, you can place down crafting/buff stations in your \"base\" but theres no visual progression when you upgrade those either. The whole game it just seems like no point in playing it. Time waster only.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "like a looter shooter for your phone but on pc. poor graphics. npcs are to easy. tutorial makes you follow a story line when all you want to do is learn how to shoot loot and move. All the tags for this game are not correct. why say open world when its obviously not. Just gonna piss off the people looking for a different style of game then what the developers made and give you more down votes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its a pass for me, might boot it up if am that bored but tbh cant bother if there is good games to boot.\n\ncons:\n- mobile design in interface and controls makes the game feel less responsive \n- loot is not that meaningful aside from material  grind at least that is what it felt like as first impressions.\n- there is an idea there with potential but the way the story is delivered and \"dialogue scenes\" does not do the job\n- world design is fine but because of the controls and the mobile game design it feels dull\n\npros:\n- free to download\n- is a zombie game\n- ok graphics\n- if you can stomach the way it is delivered there is apocalyptic fun to be had.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried to get interested, but this game really doesn't have the immersion from the very beginning that I'd like, so I just couldn't honestly like the game. Maybe it's a great game and I didn't give it enough of a shot. I really don't know. I just can't play something that I can't take interest in.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "idk what this game doing here, mobile game, tutorial so fkg long like a prison setting are shit and its not stimulate enough to keep going",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very limited gameplay, potato graphics. I've seen 2009 games with better graphics.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well its free.....\nHas a green line to follow so its like holding your hand the entire time.\nPlays like a mobile game.\nLike an ugly cousin of state of decay.\nSomething to play if your super bored.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Darkest Days = Great Value brand Once Human\n\nClunky controls.\nA tutorial that never ends.\nTypical tropes in the story with generic mmo mechanics.\nVery cheap feeling as if it's a poorly ported mobile game.\n\nIt's buns.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poor attempt at recreation State of Decay. The multiplayer isn't good, the story leave a lot to be desired. Just another trash cookie cutter zombie survival game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Screw this game, I had to delete my frickin account (the NPCs referred my chacarter as a he when and \"he\" was a she)  and now I can't make a new account.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This might be a decent game but it is virtually impossible to play because you cannot invert the Y axis. The ability to invert the Y axis is a basic command feature and the fact that such a simple game mechanic is missing tells me these developers have no clue what they are doing.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Sorry, at this stage, cant recommend, maybe in 6 months i will come back and try again.   Ok have popped back in to give more information due to requests.\n\nCombat mechanics are clunky\n\nUpgrade mechanic where by you lose a level on a dice roll fail has to be the dumbest mechanic in the history of gaming (have not been able to confirm this yet).   Takes for ever to gather the mats.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WTF! Who needs help running? Get rid of the auto run bull crap. Game glitching constantly. I may change my review if it's updated to something better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after 46 minutes of skipping dialogue(that are mostly unrelevent or i simply dont care)i closed the game and uninstalled i dont recommend",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "omg.... no....\nmobile trash game with graphics from 2004",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Direct copy of State of Decay 2, it is a pay to win base game. Buying NPC character cost 25$USD 0_o, and of course BUGs. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Waste of time,devs are only good in destroying this bugged game with low player count. Hit boxes on zombies are broken AF and the core of this game is killing zombies",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Total hours to reach lvl 12 only.\nGame reminds me of Once Human but in low budget.\nRarity barely make any difference.\nFall dmg and recoil goes crazy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The developer added so few hairstyles to the game, and all settings still make my character appear blurry. feel like AI not human work.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ITS GREAT CONSIDERING ITS AN EARLY GAME WITH SO MUCH LESS STORAGE.BUT IT STILL NEEDS A LOT OF WORK ,IT SIMPLY BECOMES BORING AFTER SOMETIME,TOO MANY DISCUSSIONS BETWEEN CHARACTERS.THE GAME IS GOOD BUT IN THIS WORLD OF SO MANY OPTIONS WITH BETTER PERFORMANCES AND CONTENT IT IS NOT WORTH IT.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gets stuck at quest - talk to max. Doesn't let me shoot, aim r interact. Can only move around the map.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not as good as i thought  it would be , ig  thatll explain the amount of  time i played",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is good, but the RNG is bad idk why they getting this to be hard for F2P",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you've ever wanted to play State of Decay 2 on Mobile, but on your PC? This game is for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty decent on mobile, tried playing through Steam and get \"Fatal Error\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth spending money on  maybe if they had private sessions  for coop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cheap AI slop with thirst traps BS and battle passes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has bad quality when it comes to grapichs, and also there's no way to play multiplayer even if the game is tagged as Co-Op, worst 105 minutes of my life, I DON'T RECOMMAND...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS SO BORING,YOU HAVE TO PLAY THE TUTORIAL FOR SO MUCH TIME AND ITS NOT EVEN CLEAR IF YOU CAN PLAY THIS CO OP OR NOT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this games so buns",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trailer is better than the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what the",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lol no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "f",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the potential to be a great survival Looter Shooter game however it is highly let down by the sheer greed and lack of care by the development team. \r\n\r\nThe game itself has many great facets and the single player/story line part of the game is quite good and the going from level 1 to 40 is enjoyable.\r\n\r\nHere is where it goes down hill from there and I'll provide examples and feedback.\r\n\r\nI have onver 1700 hours playing this game over the last 4 months and myself and others have provided many suggestions in the discord suggestion channel about how to improve areas of the game. Much of this feedback is responded to by the DD_Team who are quite helpful and pass our direct feedback on to the developers. Unfortunately that's where it stops and the developers have zero interest in listening and catering to their player base and have repeatedly ignored player requests to fix several key issues within the game.\r\n\r\nThe biggest key issue being the upgrade system within the game. For new players thinking of playing this game, look elsewhere because once you hit level 40, there are quite a few roadblocks because of the upgrade system. Your first upgrade os 100% success rate and it then goes downhill from there, level 2 on your weapon becomes 50% success rate and here's the tricky part, it's not fail once and then guaranteed the second time, it's 50% success rate every time. Many players have attempted for over 8 times to upgrade their weapon to +2 or +3 and have failed 8 times straight, every upgrade costs money, ER and an upgrade box and depending on what grade of weapon/armour you are trying to upgrade, the materials required are higher. \r\n\r\nHere's where it gets even worse. When you go from +2 to +3 on your weapon and are successful, every other attempt you have and fail, you'r weapon will downgrade back to a +2 being hte lowest it can go. So if you are lucky enough to get a weapon to +5 and want to attempt a +6 upgrade (which has a 25% success rate) and that upgrade fails, you will go down to a +4, if you again attempt to re upgrade back to +5 and fail again, it becomes a +3 and if you fail again, you are down to a +2.\r\n\r\nBasically you could spend 2 days farming to upgrade your weapon and end up worse off than you were to begin with. The flow on effect of this is, there are numerous daily raids and the higher you rank by doing more damage, the better rewards you receive and when your gear drops damage dramatically, you have very little chance of making the top 10 or within the top 5.\r\n\r\nAlso, within the new area they have released, it drops weapon and armour blueprint fragments which you require 100 to convert to being able to craft that item. Here''s the best part, you require level 9 or level 10 Forge facility to 1, be able to craft the blueprint, and 2. be able to make the item. And to make the item, you require titanium or nano fiber which never drops. Out of the 1700 hours played and constant grinding i've done in the game, I've managed to obtain 5 titanium and 4 nano fiber. 3 of each ot these were obtaned from the final quest line so in essence, out of 1700 hours played and farmed, i've obtained 2 titanium and 1 nano fiber and when you need 66 of each for shelter level 10, it would take years to be able to do, let alone be able to craft an item. They have set the game up to the point where you need to purchase red diamonds with real money and then purchase items off the exchange with red diamonds. You can also use real money to purchase ER and weapon upgrade boxes. Again all set up for pay to win and spend as much as you can to make the developers rich. What's worse for the paid players is they can spend all that money on buying rubbish level 40 SSR weapons to decompose for the weapon upgrade kits and have them constantly fail or downgrade their high level weapon that some have paid over $500 in real money by buying red diamonds to purchase the items.\r\n\r\nThey have also created a new area where the moster levels are vase line lvl 46. Now you can only get to level 40 and your weapon is level 40 so you need a +5 green weapon N grade to be doing full damage or able to kill the lvl 46 mobs. If your weapon has been downgraded to a +2 through trying to upgrade, you are rendered useless in that area and can't farm there.\r\n\r\nThe next biggest issue players have is the extremely low drop rate of titanium and nano fiber which is used to go to shelter level 10. you need 66 of each and even the top level players have not been able to achieve this since playing from launch nearly 6 months ago. \r\n\r\nThey also have facility mods which drop quite often but are basically an ornament in your locker because you require level 10 shelter and lvl 10 facility of each certain facility to use them, Again, due to the extremely low drop rate of higher end blueprints, not one person in the game after 6 months has a level 10 facility to even be able to use a facility mod.\r\n\r\nPlayers have been pleading for well over 3 months to fix these key issues and the developers have constantly ignored the player base requests and feedback to the point where now hundreds of players have stopped playing and therefore trying to fill raids has become quite difficult as the raids are region locked. It's to the point where players are using a vpn to \"server hop\" to find a full server. This in itself is another issue the players have requested be addressed and the raids merge and fill and a new one starts when the first one is full however has also fallen on deaf ears.\r\n\r\nWhat the developers have become really good at in this game is releasing a new pet, new resident, new vehicle, new armour or new weapons for players to purchse (with real money of course) and their only focus is what new item or pet can they release so people spend money in the game. \r\n\r\nThe saddest part is, if they fixed the above key issues, they would have a higher player base and more people would put money into the game but unfortunately they don't see it that way and their sheer greed is slowly ruining what could be quite a great game.\r\n\r\nMy best advice, either avoid this game until they fix these key issues, or just play very casually for the story line and forget about trying to do much after level 40. Don't waste your real money on a game that wants to set you up to fail and suck you in like a gambling machine with their upgrade system.\r\n\r\nIGN: Wokafella",
      "voted_up": false,
      "votes_helpful": 89
    },
    {
      "review": "This game is not worth a look. It has a broken upgrade system, you can sink many hours into grinding to get fail after fail on upgrade attempts. I have over 100 upgrade kits into a sr weapon and it is curently  a plus 2. with six straight failed attempts in a row.The patch they just recently did broke the residents they do very little damage now. There update seems to punish honest players. lontree tuneel  is a main game mode and now it is limited to 3 times a day. sun flowers you kill to get er and reward now spawn zombies to kill and get no reward . that makes it even more of a grind for even less of a reward. then after long sessions of endless grinding you get to go spend the fruits of your labor to watch the downgrades roll in.... this game is in a really bad state. it does not seem to get any better..seems to get worse with every update.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Sure, you can play for free. It is nice mix of State of Decay and MMO. You will get tired quickly tho. It is early access right now and doesn't have much of a content to keep you. Not mention their prices for things in the game. I mean real life money dollars. They don't know that not everyone on this forsaken planet use dollars.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "This is another game that uses [b]AI ART AND DOES NOT DISCLOSE IT.[/b]\r\n\r\nThere's a very low chance you are playing this game anyways, the story is very generic and the mobile like elements such as \"click-here\" tutorialization, daily log-in rewards, cumulative log-in rewards, level-up rewards and so and so forth have put you back already.\r\n\r\nIf they haven't then don't play this game, most of the assets seem AI generated, the definitive proof came from the Taxi vehicle you obtain at Level 8. If the lack of a soul in a game is alright to you then, the shooting is mediocre, the driving is mediocre, the missions are alright, the skins are gooner bait and the jrapics are mobile-esque which means even having an RTX 4060 will not help this game from still looking like ass.\r\n\r\nTLDR; It's a mediocre game with generative AI art.\r\n\r\nP.S. The boys and I will [b][u]NOT[/u][/b] be playing this one.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "The tutorial is just toooooooooooooooo looooooooooooooooooong... Even after clicking through all of the story linenever end even about an hour of playing it never end",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The tutorial takes a good chunk of time and the game play can be kind of glitchy. Tried to play this with others and after an hour we still weren't able to play together. Be prepared to spend some time on this before being able to play with others.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "honestly this game is a piece of crap because it's various problem but \r\nthe most annoying problem is stuck at initial black screen after launching.\r\nthe devs doesn't cared about this issue so don't waste your time on this one!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Would be alright, but the party draw system is probably one of the dumbest ideas in any game. If I pick up an item, there's absolutely zero reason that it should go to my party's inventory. it's downright stupid. It literally got to the point where I don't even want to play anymore. and the similarities to state of decay would make it fun. I also don't like that I can't just do the regular game with my party. my nephew runs with me and I don't want to deal with a bunch of other people while i'm trying to just survive",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "If you ever wanted to know what it would be like to explain what State of Decay is to someone that's never played it, and they used ChatGPT to create a new game but also wanted to make it live service with a battle pass, this is the game for you. \n\nUtter garbage. Somehow worse graphics and gameplay than State of Decay 1 which came out in 2013.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "installed and i go to open the game only to get stuck in a black screen. it must be a launching issue or something. tried resetting my pc and authenticating the files and still black screen. uninstalled and wont return.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "One of the Games of All Time. It is aggressively apparent that it's a mobile game, and a mid one at that. I normally try to stay positive but it's super boring. There's no risk, especially when you are gifted a purple tier shotgun 10 minutes in. You don't really take damage, getting shot in the face deals 1-2 damage of your 250+ Health pool. Zombies are slow and get staggered very easily if they survive more than one hit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game makes you play to level 10 to play with friends and sucks. Most mobile game are of better quality.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game was going great until all of a sudden  you start losing gear when you die.  No you can't even go back and recover them.  A game breaking mechanic like that ended the game for me.  These weapons can take dozens of hours of farming to just have them disappear completely. Until they fix that the game is unplayable.  Has to be the dumbest game mechanic i have ever seen.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game needs UI polishing and the way to monitor mission progress is messy , you can easily get lost with missions.  not to mention the basic graphic needs for a game to success .",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The tutorial is just too long... Even after clicking through all of the story line you only get about half way through after an hour of playing. Maybe its a good game and I'm impatient but I was not impressed whatsoever :(",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not a good game at all. If you are a solo player you will have to spend real money or depend on help from others in the game. Several better end time games for little to nothing that are 100% better then this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Darkest Days by NHN is, without exaggeration, one of the most profoundly boring and painfully uninspired games I have ever subjected myself to. Calling it a “game” feels generous. It’s more like an accidental screensaver that somehow ended up on Steam.\n\nThe core mechanics—if you can call them that—are an absolute disaster. Every system feels like it was duct-taped together during a coffee break, then abandoned without a second thought. Combat is sluggish, progression is meaningless, and every moment spent trying to understand why anything works the way it does feels like a personal attack on your free time. Nothing fits, nothing satisfies, and nothing ever evolves into something worth caring about.\n\nThe boredom is so dense you could bottle it. I’ve had more thrilling experiences watching paint dry, because at least the paint eventually changes.\n\nThis entire experience reeks of a lazily shoveled mobile port smashed onto PC without the smallest attempt at optimization, refinement, or even respect for the platform. Menus feel like they were ripped straight from a phone UI, slapped onto a PC screen, and left there, unapologetic and confused. It’s as if someone said, “Eh, they’ll deal with it,” and called it a day.\n\nEvery minute I spent with Darkest Days is a minute I wish I could reclaim. If time is the most precious resource we have, this game is a vacuum—an all-consuming void where hours go to die.\n\nAnd honestly? Anything would be better than this. Folding laundry. Reorganizing cables. Counting ceiling tiles. Watching grass grow in real time. There is no activity so mundane that it wouldn’t feel like a dazzling thrill ride compared to this dung heap of a title.\n\nDarkest Days has no redeeming qualities—none. Zero. It is the gaming equivalent of a shrug followed by a sigh followed by silence. Its the equivalent of a home where Dad went out to get cigarettes and didn't come home, if Dad called you and said \"Screw this I'm leaving\" And your five year old little self is just sitting there in your crappy diaper wondering wtf just even happened.\n\nIf you value your time, sanity, or pulse rate, play literally anything else. ANYTHING.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}