{
  "positive": [
    {
      "review": "This game is one of the most rewarding games I've ever played in terms of digging beneath the surface for secrets. 10/10 would do maths in my free time again (this is the highest praise imaginable, I'm so bad at maths)",
      "voted_up": true,
      "votes_helpful": 117
    },
    {
      "review": "This game was gifted to me on my birthday. Thank you, brother!\n\nI cannot put it into words to express my amazement towards this game. Kudos to the developers for creating such a unique game play. The story starts simple: you are the nephew of a famous man who will inherit the estate and everything inside it if... If you can find the 46th room. The estate has only 45 rooms in total. Somewhere in the house must be the 46th room. Your mission for the entire week is to find that room. If you fail, the inheritance goes to someone else. If you succeed, you will become the sole heir of the Sinclair family. \n\nHowever, it's not as simple as it sounds. You must draft rooms in such a way so as to get to the Antechamber. Each time you get towards a door, you think of a way to craft the estate rooms so as not to get stuck, dead ended or going around in circles. There are gemstones, keys and fruits for stamina. Each day you have a default 50 steps. Each time you enter a room, you will lose a move. Oh my God... I did fine the first day. Now I'm stuck. So be careful how you build the layout of the rooms. \n\nOh, and if you want to start all over, the rooms reset. Let's see if you can take up this challenge. Find the mysterious 46th room. If you can get there, that is.\n\nPROS:\n- Simple story, unique gameplay (find the secret room);\n- Good atmospheric music (doesn't bother the player);\n- Puzzles, strategy, coins, fruits, keys, key cards (puts the mind at work);\n- Common achievements + 11 hidden ones;\n- Beautifully crafted rooms (as background images would be cool);\n- Keeps you engaged to play and do your best.\n\nNEUTER:\n- I would recommend the developers to permanently put the layout on the left, so when the player has to select one of the three rooms to draft. I have to click the Tab every time to see how to draft the rooms.\n\nCONS:\n- When you click on a door, you cannot exit to rethink your strategy. Once you click a door, you have to draft a room no matter what;\n- If you want to exit the game, it won't let you. The player will lose that day of exploration. There are two options: Save & Continue and Save & Quit. You cannot quit mid-exploring.\n\nI haven't made it to the end yet. Where could that secret room be? Come on, friends. Let's split up. Maybe you're lucky and find it on the first try.",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "I had a great time playing this game, for the most part. It was a lot of fun mastering the game mechanics, scouring the world for clues, and slowly learning about what's \"really\" going on with the story behind the scenes. That said, past a certain point, [spoiler]my primary motivation to keep pushing onward was a desire to see a resolution to a major story cliffhanger, and if I had known two weeks ago what I know now, I might have stopped earlier than I did.[/spoiler]\n\nOverall 9.5/10, can't recommend it enough. However, this game is much more about the journey than the ultimate destination: if you're expecting some glorious payoff waiting for you at the end of the very, very long and winding road, you may be left feeling unfulfilled after it's over. It's completely OK to leave some stones unturned and to stop playing when you feel like you've had enough.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Blue Prince was one of the most memorable experiences for me.  \n\nThe atmosphere is incredible. \nThe puzzle design is amazing. \nThe world's lore is vast and intriguing. \nThe visuals and music are on point.\n\nI can't put into words just how much this game charmed me. \n\nMy only complaint is that the very late game stuff (well past the main objective of the game) is incredibly hard and grindy, the hardest puzzle in the endgame is borderline impossible to figure out on your own even for a seasoned puzzle gamer. I think most of the community agrees that the optional endgame stuff is ridiculously challenging (and time consuming, specially if you aren't lucky with the RNG) , but then again some people may see that as a plus.\n\nThere are also some loose ends but we are anxiously waiting for the final patch of the game, announced by the developer team.\n\nDefinitely a game I'll remember forever, but wish I didn't so I could go in blind again.",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "The roguelite puzzle game that keeps on giving. At first, you won't even know WHAT the puzzles are, let alone how to solve them. But the game slowly feeds you information, opening itself up to you, until you reach the game's stated goal... and then the game REALLY begins. It's a puzzle-solver's dream. Yes, the RNG can make the game harder, but there are a handful of in-game ways to tweak the RNG, so that's forgiveable If the puzzles weren't enough, the art style in this is gorgeous. Just get it, already.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Blue Prince stands out for how confidently it merges genres and concepts that would usually not fit together. It’s part roguelike, part puzzle game, part exploration game, part mystery, and somehow all sides are handled with equal care. Runs feel varied but never too chaotic, and the game's design keeps you thinking several steps ahead about all of these elements without any single one ever becoming overwhelming.\n\nEach visit through the estate feels distinct. The way rooms connect, the order in which they’re revealed, and the clues you uncover all combine to form a slow, deliberate rhythm. The game's well-balanced pacing is what makes it work so well, as you’re always discovering something new at just the right time to keep you curious and coming back for more. It’s a core loop that rewards attention to detail, as opposed to speed.\n\nThe puzzles themselves are sharp and consistent. Solutions make sense once you see them, and the logic behind each challenge is clear. Clues can appear in the same room or several rooms apart, which encourages careful observation and note-taking instead of simply brute forcing solutions. Even the navigation itself works as a puzzle, as choosing where to place rooms and how to connect paths to reach your end \"goal\", while carefully considering how you spend your resources from room to room, turns exploration into another layer of problem-solving. \n\nAlthough some of the game’s RNG can sometimes cripple or entirely kill runs altogether, the design usually gives you enough strategic flexibility to adapt. Careful planning and smart room placement can often turn bad draws into a manageable challenge.\n\nThe presentation and atmosphere ties everything together. The subdued visuals and sound design reinforce the game's tone without trying to distract from the rest of it. The game's art style also works in that it subtly creates clarity and contrast to help you find items and other interactivity prompts, working for the game's structure not only aesthetically, but also functionally. There’s a sense of mystery that builds naturally, with the story unfolding through implication rather than exposition. I have already achieved the \"main goal\" of the game, yet haven’t finished its full narrative yet, but what I've already discovered feels intentional and cohesive.\n\nBlue Prince is the best puzzle game we've had in years, and arguably the best puzzle game of the decade.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Though not built well for it, Blue Prince is an incredible puzzle game. There's a compelling story hidden behind unbelievably frustrating puzzles and headache inducing poems.\nThe rogue-like elements do more to detract from the game than they help, but it certainly wouldn't be such a unique experience if this game were instead Linear.\nIf you have the patience (and time!) for something Very Unique, I cannot recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Amazing and unique puzzle game with a good soundtrack and amazing attention to detail.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Just got final trophy/achievment and now I can write review. From the very start of the game you can feel how dedicated and smart it was designed and developed. This is a puzzle roguelike game and that mix up I didnt encounter before. But once you start playing - you want to do it more and more. One runs on average takes an hour, but if you encounter some progression/new hard puzzle or something else - rune can take 2-3 hours. Early game is just amazing, just remember, EVERYTHING IS A CLUE! I have tons of notes and screenshots after finishing this game. Middle game is also good, you are starting to be more experinced on what items/rooms do and thinking about some more combos that you can do and further progression puzzles are good. But late game is quite frustrating, it is hard to understand what you need to do and find the hint for it. In early game you have dozens of clues to the same puzzle, in late game you need to find that one particular hint to puzle you need to solve in order to progress further. [spoiler] Especially Blue tents machanic, this is so stupid and feels like unnecessary prolongation of the game.[/spoiler] But in general I can only recommend this game, it is really good and entertainment especially for its price!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game took my brain hostage for several months as I constantly found myself thinking about all things involved in it after turning the game off. It's as perfect as a puzzle game like this can be and I thoroughly recommend you go into this completely blind.\r\n(And please, make sure to have a notebook handy, you'll thank yourself later...)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I can see this game not being for everyone, but I think it is absolutely worth the full price. And I rarely say this about a game.\n\nThis game hits everything I like just right. I'm always up for a good puzzle game, I like a roguelite/deckbuilding game, it has lots of secrets to find, and I prefer games where I can just sit back and play on my own pace, not having to worry too much about timing. The visuals are also pretty nice, and the story is far from boring, though it takes a while to put all the pieces together, which is fitting for this game.\n\nThe concept is pretty straight forward: You inherited a mansion, but under the condition that you have to find room 46 in it. The mansion changes its rooms every day, so you have to stay the night outside in a tent and start over each day in order to find room 46.\nFinishing that part of the game won't take too long, but then there is so much more to find. There are hidden things and clues in pretty much every room you go to, and beyond that. It allows for going through this mansion day after day without it getting too boring. At the time of writing this review, I spent about 70 hours over a course of about 40 in-game days, so roughly 2 hours per in-game day (though I did take my time on a lot of stuff, definitely can go faster). It was only at the last few in-game days that I felt like, yeah, I've seen pretty much all of it and just want to unlock these final secrets for the story. Which I did.\n\nFor completionist sake, I'm only halfway the achievements, but most of what I still need to do are new-game challenges and speedrun stuff. When I pick this game back up (and I will), I definitely will get those done and 100% this game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I love puzzles, but Blue Prince made me feel like the mansion itself was judging me. The rooms are clever, the secrets are fun—theoretically—but did I solve them all? Absolutely not. Some clues felt like they were leaving the country while I was still checking the foyer.\n\nThe RNG didn’t bother me much, but my pride? Devastated. Still, even with my unsolved mysteries mocking me, I had a great time. It’s the perfect game if you enjoy feeling smart… right up until the house reminds you you’re not that smart.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Blue Prince is the toughest puzzle game I have ever attempted. \r\nI'm not very good at it, either. I've learned so many things about the game and puzzles, I honestly don't think everyone has figured them all out yet!\r\nIt is Really a good \"explore and have fun\"- kind of game and its engrossing. I love it that time passes so fast when I play!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a fun game for sure, and I definitely recommend it if you like mystery and puzzle games. \n\nMost of the puzzles are fairly intuitive, though the game does expect you to connect a fair bit of dots without any real hints in that direction sometimes. The main weakness of the game to me was later in my playthrough when I essentially became progress-locked by rng. After a certain point, in order to continue progressing in uncovering the mysteries of the game, you really need specific rooms, combinations of rooms, chains of rooms, items, etc. and while the game gives you some tools to let you stack things in your favor a bit, there's a fairly solid chance you'll spend a LOT of runs and times fishing for certain rooms, items, and layouts that you need to progress, not get them, and be stuck at (sometimes literal) dead end. It can feel very frustrating feeling you've figured out a solution to one of the bigger puzzles of the game and then due to chance, it takes another few hours to confirm/resolve that idea because you just don't get the rooms you need. \n\nOverall, the game works best at the beginning when everything is a mystery and any room or layout presents some form of progression or new hint in the greater mysteries of the game, and starts to spin its wheels a bit later when the only mysteries left to solve are the more elaborate and spread out ones. \n\nThe visuals are also gorgeous and probably my favorite from any game that came out this year.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Крутая головломка с приятным визуалом и музыкой. Рогаликовый гиммик сильно не мешает, потому что в игре очень много \"ключей\" и \"скважин\", поэтому в каждом ране получается в чём-то продвинуться. В поздней игре конечно становится нуднее, с бОльшим числом перезапусков.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h2] Blue Prince will break your brain.[/h2]\nThe atmosphere, the music, the puzzle design, the weird lore hidden in notes all of it is amazing.\n\nAt the start you have no idea where the puzzles are or what you even need for them.\n[b]That’s why everything is important. Everything is a puzzle. [/b]\nOpen Figma and screenshot everything.\n\nThe whole Roguelike puzzle concept  is  interesting. And game is HARD until you unlock some permanent upgrades ( it was like hour 10 for me).\nThe first hours feel like you’re  know everything. But the more you play the more you know how lost you are. \n\nBut after a few hours you start connecting your screenshots, notes, symbols, random clues  and when a puzzle finally clicks, it feels amazing.\n\nHalf of my notes still aren’t used. I still have puzzles I haven’t solved. I still have things to unlock and no idea where.\n\nIf you want the real experience: DO NOT Google anything.\nIt will ruin the magic.\n(I did cheat once for a code… it was in the same room. Pain.)\n\n[b]READ EVERYTHING[/b]\nLook at every photo.\nEvery detail is a clue.\n\n[b] The Problems[/b]\nThe game can feel very luck based.\nYou can play well, plan ahead, and still hit a dead end on a god run or run out of keys/gems.\nAfter about 15 hours I got stuck just going day to day without knowing what to do next.\nAnd things I needed simply wouldn’t drop.\n\nAnd when you click on a door, there’s no going back.\nNo time to rethink your strategy.\nJust commit and pray.\n\n[h3]8/10[/h3]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best puzzle game released in a long while. Recommend it to pretty much any and everyone, but with a warning: \nGet a notebook. You'll want to take notes.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game can be incredibly frustrating.  Offers a really cool concept, but is very heavily RNG based.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Hey, dawg, I heard you like blueprints. So we put a blueprint in your blueprint so you can draft while you draft.\r\nWith all seriousness: the game has more secrets and replayability than most of the modern titles.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Hand-off the best puzzle game EVER.\r\n\r\nEven the first, true completed run takes ages and unlocks new things to do once you replay it again, and again, and again, and again...\r\n\r\nThere comes a time when one can think that Blue Price had showed all of its tricks... BUT NO, there's like 20 more things to do after that point! I kid you not, the sheer amount of after-endgame puzzles is unfathomable! [spoiler] The full completion guide has \"inheritance\" (which is stated as an in-game goal) as 1 out of 25 steps! [/spoiler]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game quickly went from an enjoyable experience to one of my favorite games of all time. This game innovates not just for the sake of creating something new (which it succeeds at) but for the sake of its core theme. This theme runs through the game like an artery spilling its experience into not just the narrative but the gameplay. This is why the game is so incredible, it manages to unite its narrative and gameplay to such an effective degree that the message is not just read, or heard, or watched. It is PLAYED. This is why it is so disheartening to see so many negative reviews of this masterpiece, where many people treat core messages of the game as flaws when it is clear they did not come to this game ready to experience and listen. This is not to say every negative review is undeserved, there were many technical issues that I was largely spared from. There especially was a period of updates about a month after release that introduced some pretty rough bugs regarding saving, Getting burned by one of those, or the brief period that saves could get corrupted, would be experience ruining without a doubt but these issues are largely fixed.\n\nThe game very quickly goes so far as to state the core theme at you: you find the most when you are not focused on looking for one thing specifically, just when you are committed to looking in general. Secrets are secrets because they are good at hiding from those who are looking for them, not necessarily that they are hiding from everyone.\n\n When playing Blue Prince you must remember is that there are many paths to where you need to go, never fixate and take them as they come. If you fish or doggedly chase one solution you will not only undermine your own experience, but also your ability to make progress toward your own solution since you will be missing things you did not even know you are missing. \n\nOf course there are random elements, it is a ROGUELIKE. There are also myriad ways to mitigate the randomness, which you will not find if instead of exploring in the exploration puzzle game you instead decide to bash your head into the wall of trying to find one specific thing over and over again. The fact that it sucks to avoid exploration in favor of obsession is not a FLAW of the game, it is a FEATURE. It is the MESSAGE. The game is telling you, screaming at you, to embrace occasional ambiguity and take a breath. Look around and when the moment arises to actualize and test a theory you will be ready and perhaps more informed and more well-equipped to accomplish it. You may even find a way to make it easier to manipulate probability to your advantage. The only thing in the entire game after 100% and challenge runs that I could think of that could use more ability to manipulate the probability around would be [spoiler] the vault keys, which due to not being tied to the room system require a very specific and limited set of tools to make it more likely they be found [/spoiler].\n\nWith all that said, this game is a 10/10, but I must remind anyone who made it through this review that a 10/10 does not mean that 10 out of 10 people who play it will like it, it means it is extremely effective at being what it is and saying what it needs to say. If you are not prepared to listen then perhaps pass on the game, and come back to it either when you are. With curiosity, patience, and a tolerance for ambiguity this game has more to say than how to beat it, it can have you re-examine how you are behaving in life as well. If you are unable to relax when playing games, not in a good place to accept losses or failures when they come to you, or for some reason morally opposed to using a notebook this game might not be one you enjoy.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Intriguing puzzle game with seemingly no end... What you think is the end, is only the beginning. If you pay attention to *every* detail, then you'll only miss 90% of the clues the first time you see them. My family members are sick of me talking about this game, so now I'm recommending it to all of you! Good luck :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Probably one of the most interesting games I've played in a long time. I was really sucked into the world, and couldn't get out for hours at a time. Lost sleep and weight. Had some migraines and stress. \n\nI had to play Teddy's Haven to relax, and decided I didn't really want to come back.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like Room games, or reasoning games like Lorelli and the Laser Eyes, then you'll love this. Even after \"completing\" the game there is much more to do and explore. I'm about 100 hrs in, and I think will play for another 20 or so. Excellent value for money, production and graphic quality is wonderful and the whole story fits together.  Highly recommended (and I don't praise games too easily).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Buy it. Just buy it. Stop looking at it, stop reading reviews, don't spoil anything - you've already seen too much.\n\nIt's like Outer Wilds with mechanics and strategy, just play it already. Why are you still even reading.\n\nGame of the year 2025 and it's not even close. Once in a lifetime kind of game. Does it never end?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the idea of this game. That's why I spend time playing it. But there are quite a lot of decisions from the dev that I don't think are good. It's still good to try out but just like any rouge-like game, losing your progress is not a nice thing and there's not really a good gain after each run.\n\nDecided to recommend because at least I've played an extra of 8 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant. Absolutely brilliant. The best puzzle game I've ever played. By no means is it a game for everyone, you need to take notes and you need to be patient. But oh man did this game just continually blow me away over the 140 hours I put in on game pass. Even after having thoroughly exhausted the puzzle aspect of this game, I'm still enjoying the rogue-lite aspect of the game with community games like B-quest. I love this game",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Best puzzle game I've played in a long time.  Screenshot every document for your sanity.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i filled a notebook with notes and drawings and diagrams for this game and it looks like the ramblings of an insane person, and it's beautiful. please play blue prince.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A truly incredible puzzle game where even acknowledging the depth of the game might count as a spoiler. Towards the lategame, the RNG roguelike mechanics really started to wear on me however, having already outstayed their welcome for quite a while.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best puzzle game I've played in a while.  Quite dependent on RNG Gods, but also your ability to take notes, strategize under less than ideal circumstances and notice things.  You [b][i]need[/i][/b] to notice things.  Really look, don't just pass through.\n\nLots of story as well.  \n\nA+ would inherit a mansion again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best puzzle game I've 0layed hands down. Easy contender for game of the year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the most innovative games I've played in a long time. Hard to imagine anyone copying it but I'm really excited to see what kind of influence this game has in the space in years to come. I love that it's a game you cannolay for 10 hours and be done with or sonk hundreds of hours into and still feel like there are strands to unravel. \n\nGreat art, great narrative, awesome feeling of exploration, and some of the most intricate puzzles I've ever had the pleasure of solving",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A truly fantastic game, precisely as good as it is hyped up to be.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best puzzle game experiences to hop out of nowhere in years. The fact that 41 percent finish the base ending of the game says a great deal about the experience being engaging and something that people want to come back to.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Haven't yet completed the game, but I've really enjoyed it so far. The puzzles range from very easy to \"I didn't even realize that was a puzzle at all\", but even the more difficult ones I've encountered don't feel unfair.\n\nI understand people complaining about the RNG grind but that's the nature of roguelites sometimes... I don't really mind it.\n\nDefinitely recommend doing what everyone says and taking notes as you go. Also, prioritize drafting new rooms whenever you can even if it kills a decent run. You never know what new information might uncover.\n\nDefinitely recommend this one if you're a fan of puzzle games but with the caveat that you ARE going to be frustrated at first and you will have to play through that frustration. It will click eventually.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing while streaming to my brother to have him help me strategize and solve puzzles. That has probably made me stick with it a lot longer and enjoy it a lot more than if I had played it alone. This is a game for those weird kids who lowkey enjoyed standardized testing. So far (our Day count is in the 90s) there has been enough intriguing stuff for us that we have had at least one goal for every Day, even if that was just gaining another star from the observatory or getting a new book from the library. If you play this you will probably have a lot of Days in a row that are cut short with minimal gains, punctuated by Days that somehow last two hours, where your steps feel unlimited, and you progress by leaps and bounds. Those sessions are so exciting, and almost every cutscene we've reach has given me chills. (Sidenote, they really nailed the atmosphere and aesthetic imo.) On the other hand, there has been a puzzle or two that have made us pretty mad at the devs, as the jumps in logic have seemed too obscure to be expected of the player.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nothing ever came quite close to the experience of playing the Myst series for the first time, but Blue Prince has surpassed that for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Blue Price is one of those games that really makes you slow down and think in the best way. Nothing feels random or filler—every object you click on, every choice you make, and every little detail in the environment ends up mattering later. I love how often I’d have an “ohhh, that’s why that was there” moment hours after first seeing something. It’s smart, satisfying, and rewards paying attention, making each run feel purposeful instead of just going through the motions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredible game. Genuinely don't know how to explain how good it is without spoiling. Go in as blind as possible and be amazed by the depths of the iceberg.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorite puzzle games. Sometimes a little frustrating, but its sheer uniqueness makes more then up for it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I honestly can't say enough good things about this game. If you like exploration, if you like puzzles, if you like META-puzzles, if you like fantastic lore and worldbuilding, if you like the Civilization-esque feeling of \"just one more turn\", if you like the run variety that comes with an RNG, then you will absolutely love this game.\n\nIf you don't like any of those things, stop being weird and starting liking them. This game is a masterpiece.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game would actually be the essential puzzle game must-play, if it were not for its gameplay.\n\n\nBlue Prince's mysteries and secrets to uncover are by far the most impressive I've ever seen in any kind of videogame. It goes ridiculously deep, and it is incredibly satisfying to keep unveiling new things and digging deeper. It's on the level of needing dozens of pages of notes and likely close to a hundred hours to get to the bottom of it all, and it is an incredibly rewarding experience. \n\n\nHowever, its deep puzzles are almost antithetical to the heavily RNG-dependant and grindy roguelite gameplay. The gameplay loop can be very enjoyable and engaging until you reach the first \"ending\", but after that, it only gets increasingly more masochistic, as the secrets have increasingly more difficult steps, where just to figure them out, you'll need a lot of luck just to get the pieces you need in a run to align. It doesn't help that the game really doesn't have that many tools to impactfully mitigate RNG.\n\n\nI'm 100% convinced the ideal way to play this game is to go through it as normal until a bit after the first ending, and when things start getting annoying, download mods to give you infinite resources and items, so you're free to just focus on solving things and testing out your theories. \n\n\nThis game would be great enough on its own even if it featured none of the roguelite gameplay at all, as the puzzles and mysteries are enough to justify playing it. The ideal solution would be more ways to consistently avoid RNG, but as that likely won't happen, mods can do the trick, and I really wish they were there when I played the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Blue Prince is such a fascinating game to me in concept: an exploratory puzzle roguelike? Say less.\r\nIn execution, however? I think this game is as good as the concept can realistically get, but there are some fundamental flaws to the genre combination that can't be overlooked. If you go in completely blind (which I did), there will be a time when you leave the 'everything is new and wonderous' phase, go through the 'I have so many clues with no puzzles and puzzles with no clues' phase, then finally enter the 'I know what I need to do but the game is not letting me do it' phase. There will also be runs in which you don't make any progress towards the end goal of reaching room 46, feeling like you wasted 15-45 minutes without having drafted any new room types to explore, discovered any new multi-room puzzles, or made any connections with clues you do have.\r\nTo compliment the game, however, the first 8-10 hours was some of the most engrossing gameplay I have ever experienced. When everything is so new, taking the time to write down any pattern, set of numbers, or other out-of-place thing you can imagine is super engaging. Some clues will be obvious - they solve puzzles in the room you find the clue in - other clues will show you what they open up but it's elsewhere in the manor, and some clues are just more lore and worldbuilding texts, but you don't know that yet. There's some puzzles for everyone - some puzzles test your logic and reasoning skills, others your math ability, more test your 3D spatial awareness, some to test how well you've learned the world around you, and others how many times like bashing your head against a wall until something works.\r\nI have only beaten one run, to be fair, and was after an extremely lucky two-run sequence where my penultimate run had a nearly perfect setup for my next run, both in terms in what I learned towards reaching room 46 and what little I was allowed to carry over into the following run. I know that there is a lot that I do not know - my notebook has plenty of pages of loose clues, puzzles, and theories - but I'm perfectly happy leaving those mysteries unsolved having enjoyed my time with this game already.\r\nIt also took me way too long, well after knowing the game was about drafting rooms in a building, that the game's title of Blue Prince was a play on words of Blueprints. That's how good of a game this is; the puzzles start before you've bought the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I will be honest with you, even though I had numerous people tell me that this was 'my type of game' I found myself avoiding it for a while because I didn't like the way it looked in pictures, my brain told me at a glance that it was 'probably just okay' and I didn't delve far enough to figure out what kind of game it was. It conjured ideas of walking simulators like Myst that I loathed (sorry to the Myst fans) and I didn't give it a fair shot.\r\n\r\nBut boy was a wrong.\r\n\r\nThis game... it devours you. What begins as mild curiosity and a satisfying game loop that is unique to roguelikes, becomes an obsession of having to know the solution to the next puzzle. Becomes suspicion at every little design element, wondering if its that clue you've been desperate to find. \r\n\r\nI was taking notes for the first time in years. I was writing down things I thought -vaguely- sounded like it was important. The game starts on a Monday. Is that relevant? Not yet but it -could- be and that's enough. \r\n\r\nThe game has depth, the story you uncover is intriguing, the replayability is high and when you think you've found everything... guess what, there's probably -still- about twenty things that you've missed. People still believe they haven't found every puzzle there is and if you think getting all the achievements means the game is over then you are laughably wrong.\r\n\r\nThere's only one negative thing to say about this game, two if I'm very generous with finding faults:\r\n\r\n1. There will be no localisation. It depresses me to say it because I would love for this to be available for everyone, but the vast majority of the overarching big puzzles involve wordplay, sentence structure or hidden messages that only work in the original English. The creator has said that localisation for those reasons is pretty impossible, and I get it. It still sucks though.\r\n\r\n2. The game does not hold your hand in the slightest. Things it presents to you as the rules of puzzles you will later discover are lies fed to you on purpose. You will second guess if that clue you found is relevant, you will wonder what you are missing if you keep doing the same satisfying loop you're used to. Some rooms will -never- show up, if you don't interpret a note and understand its meaning. The game requires patience and a willingness to engage with it on its level to fully enjoy it. The pay off for completing a puzzle you've been thinking about in the back of your mind for hours while you play is amazing if you let it, but I know I have friends for whom the frustration of not knowing what to do right away would be the reason they stop playing. \r\n\r\nI could gush about this game for much longer than this, but I'm struggling to think of more to say without spoilering any solutions to puzzles as to highlight what I love about this game would mean to give specific examples and moments that made me love it in the first place.\r\n\r\nAll I can say is, if you love puzzles, if you want a game to really sink your teeth into and obsess over, this is the game for you.\r\n\r\nAnd if you are just an admirer of good games, play it anyway. There's a wiki that you can use to solve all the puzzles for you and the base gameplay is really enjoyable. At least then you will have experienced the vision of the game and even minorly understand how fantastically well put together it is. It genuinely breaks my heart that this isn't the right genre of game to win a Game of the Year award and that not enough people will give it a chance. \r\n\r\nIt also breaks my heart that I can't play it again right now. Maybe when I'm old and have forgotten it all. I'm rooting for you old age!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a very fun game...at first, but honestly the RNG becomes a huge headache to manage, especially if I've figured out what I need to do but just don't have the right room/tools for it. I ended up installing a mod to give myself a leg up, as many other people have had to do as well, clearly, since such a mod exists. Anyone who actually chooses to play this on cursed mode is, frankly, insane. \n\nI think it would be nice if the game, at a certain point, just let you start the day with all the tools as well. There's already similar bonuses throughout the game. I also wish there were more ways to hold two or three important rooms to the following day. I don't think either change would really break anything about the late game other than speed it up considerably.\n\nI also think it would great if there was just a glossary of everything single thing you've read so far. Please, just say Simon keeps a copy machine in his his hugeass backpack. It's ridiculous how many puzzles rely on library books, and half of those also require the magnifying glass, AND you need to order the book and then wait a day to pick it up, AND it's not like you can just copy down all of the text because half the clues are in visual puns and drawings! I took like 20 pages of notes for this and by the end of it still just went to the wiki because it was too much of a headache to draft the room I needed just to double check something.\n\nI've officially hit a wall after the throne of the blue prince. I am looking at what it takes to solve the atelier puzzle and running through my mind all the backtracking and getting lucky and preparing for the perfect day to come together and it's just not worth it. 70 hours is more than my moneys worth, I wish I could say I was leaving on a high note but the grid has worn me down.\n\nTL;DR get it if you really love puzzles, tap out or install a mod once you hit your limit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, avoid spoilers. Embrace the puzzles and dont feel rushed to complete anything",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game was rough for me at first. I was nearly frustrated to tears in the first 10 hours because I was so incredible bored of roaming the exact same rooms of this stupid mansion for hours and hours waiting for the fun part to start.\n\nI was legitimately on the last run I was willing to give it, I said \"I will do it one more time and if it's not fun then I am giving up.\" Thankfully, I hit some solid luck on that very last run and the game opened up into the mid-game and things became a lot easier to navigate and I was given a lot more freedom to explore in ways that I actually found fun.\n\nI think there's some sort of balance issue here where the early game is such a slog to get through before you get to the good part of the game. I don't know how to fix that, but the fact that it is almost entirely dependent on RNG and luck made it really frustrating to get through.\n\nThat being said, I am glad I did push through, because the rest of the game is quite fun and very unique from a puzzle game perspective, and it has some extremely clever puzzles (and some extremely stupid ones, I stand by that).\n\nIf you're a big fan of puzzle games and love a good challenge and don't mind being stuck for a couple hours on end with no real progress to be made, by all means try this game. If you're not that into puzzle games, you're probably going to hate this. Or maybe you'll get a bit luckier than I did, and you'll love it much quicker than I did.\n\nI do think some of the puzzles were weak and silly at best, but they were outnumbered by other very well constructed puzzles that spanned such a broad part of the game that felt very satisfying to finally link together. The game absolutely does not respect your time for a lot of actions, which is frustrating, and some of the puzzles are pretty stupid and also waste your time, which is frustrating, but the overall experience was positive and the negatives were outweighed by the positives of finally piecing together the million and a half clues you stumbled across in the past 30 hours of gameplay.\n\nAs you can see, I broke past that 8 hour frustration zone and now have almost 70 hours in the game, and I am glad I pushed through. But do be aware that this game is definitely not for everyone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game of 2025 for me. Played the Demo before xmas last year, knew nothing about it. Best place to go into this game is zero knowledge. The discovery and mastery are so deftly interwoven. This is a puzzle game that rewards paying attention to everything, it even tells you to take notes. There is solid worldbuilding too adding to the immerson.  Clear ties to mist and riven third person exploring, but for me that sense of discovery was magically close to Outer Wilds. Cracking game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A highly atmospheric puzzle rougelike which can really hook and pull you in. Each little mystery can put you on this chain of \"one more day\" as you attempt to solve puzzles with clues that could cross over multiple rooms. The discovery of each clue that eventually leads to the culmination of Act 1 is but a heartwrenching tale of its own.\n\nHowever, it is not a game for non-English native speakers nor for the person who skips text. A skipped detail can lead to frustration and unfortunately, most details makes the most sense in English.\nAs well as that, the difficulty of the game really ramps up at certain points, possibly bringing frustration to some people and clues become a whole lot more vague after Act 1. At some point, it becomes a game that might need frequent references to a game wiki to solve.\n\nIf you're just here for Act 1 though, I still recommend this game, especially to be played with minimal online help. It is do-able and bound to bring you on an adventure of curiousity. (took me 27 ingame days, i did not log the time it took me to get to it so, rip)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I've played in the last couple years, easily. However, it is one of those that is best experienced whilst knowing as little as possible about it beforehand, and the game's rather expansive. Therefore, I'll go over just a few bullet points that I'd consider to be actually important to know before getting into the game; otherwise, I risk accidentally creating an entire blog just centered around this game instead of a review.\n\n[list]\n[*] Obviously I'm recommending the game, I'd recommend it to anyone, but I also recognize that it's certainly not for everybody. If puzzle games just aren't your cup of tea, this one's gonna be a hard pass; same goes for any RNG elements (described in more detail in the next paragraph). Don't feel bad for passing on this game if you know you won't like its core elements! It's better than torturing yourself with gameplay you can't find any fun in.\n\n[*] RNG. It's a big factor here and it will be, mostly, always as you play. The best comparison I can make in this regard is Balatro: you can figure out many ways to manipulate the game's inherent randomness to your favor, but in most cases, probability can still just decide to be a pain in the arse and screw you over anyway. IMHO there comes a point where it becomes more of a nuisance rather than the drive to widen the scope of your exploration and I do wish it were at least slightly addressed. Still, it does definitely get better as you keep playing.\n\n[*] Unless your memory is insanely brilliant, you will need to keep notes in one form or another. The earlier the better. Note down everything that seems important, even if just slightly -- you can always erase useless notes later! You don't have to be overly sophisticated about it, the Steam overlay's notekeeping tool does the job perfectly fine, and I see many people getting by just by saving screenshots. My Blue Prince notes may or may not have about 20 organized sections with occassional diegetic-sounding remarks for immersion -- but you definitely don't need to go to such lengths.\n\n[*] [b][u]You can only save and quit in between days.[/u][/b] You won't be able to save your progress on the current day, leave, then return and finish it later, The game will just force you to end the day before allowing you to save. This is one of the few elements in BP that I would consider an outright oversight -- whilst I understand that saving progress mid-day is a technical challenge, I just think it really should be a thing. Days can sometimes last for a couple hours, and many aren't gonna be able to play for that long uninterrupted.\n\n[*] Lastly, something I believe should be made clear: [b][u]there is no time limit for reaching Room 46[/u][/b], despite what the intro may imply. I don't know why they wrote it this way and I don't think that the sense of urgency it instills in a new player is beneficial. Don't be deathly afraid of \"wasted\" days and don't be afraid to finish a day early if you think you need to.\n[/list]\n\nThese, I believe, are the primary aspects you will need to contend with during your playthrough. If any of them sound like a bad time -- you may not really enjoy Blue Prince (though, if it's just one and it's not the RNG, I'd still suggest you give it a go!), but if they all sound fine, then [u]definitely[/u] give it a go! There is a reason this game's getting nominated for and winning awards, and it stands firm in a couple of my Steam Awards nominations. Well done, Dogubomb. Really well bloody done.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm sure you've heard about how good this game is. Some personal anecdotes. My boy and girl (3 and 5 respectively) both love this game. My son chooses the box puzzle room every time. I'm teaching them the basics of deduction, and they can't get enough of it. The green rooms are magical, and every time we're outside in a beautiful area, my daughter stops and admires the wonder of nature, gives me a knowing smile and says \"Green Room papa.\" and we both enjoy it together. Playing this game with them has been an irreplaceable treasure that I hope we all remember for our entire lives.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Big dumb idiot here with the claim that this is an awesome game. I may take a couple of weeks to solve the puzzle, but damn it feels amazing when the puzzle finally clicks.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The wonderful result of mixing roguelike, puzzle, adventure together. Brilliant gameplay with interesting concept.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A truly unique mystery game, kind of a roguelite that mixes in knowledge progression similar to Outer Wilds.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stellar game. Has had me playing and puzzling for hours already and I'm still not done. It's a lot of fun to think of different combinations of rooms to try out and try to get them, though the rng can be a little frustrating at times on that front. There's a lot of lore that runs deep, and I'm having a blast figuring it all out. I definitely recommend this game if you like strategizing, theorizing and puzzling so much that you need some notebooks to keep track of it all :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the gameplay, themeing, art style, story, pretty much everything. Definitely makes you think about your decisions and has a ton of gameplay. I'm not sure if I'm even halfway through with 46 hours, definitely worth the buy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A long while ago I got the chance to help beta test this game. While I can't talk about that experience too much, I can say that the developers, especially Tonda, have put a lot of heart and soul into this game. You can clearly see the love of mystery, puzzles, and adventure within this game. Even with all my time spent helping playtest, there is still a lot for me to discover.\n\nThe love I have for this game runs deep, but I also recognize that it can be unforgiving. It can come down to rotten luck with bad RNG to ruin a run and sometimes feels downright unfair. However, all that does, for me, is makes those \"a-ha!\" moments all the better. The game offers familiar mechanics, combined in a new and fresh way to make them each seem like new. It has been a blast to not only see the game come together, but also an absolute delight to see people experiencing it for the first time.\n\nOverall, if you're a fan of games like the Myst series, and like a good challenge while also able to tolerate the occasional \"unfair\" RNG then I highly recommend picking this up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't recommend this game enough. You expect a normal escape-room like experience, and then once you're done with that you realise you've stumbled upon something way bigger. The feeling of a puzzle finally clicking in your head is so satisfying. Go in blind and enjoy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I did not enjoy this game for the first few hours and something suddenly clicked where it proceeded to blow my mind several times over. It's a slow burn but worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the type of game that you didn't expect that could exist. Pretty sure there is nothing quite like it out there, not at the day it came out. It mixes puzzler, exploration, rogue-lite in a way the reminds me of Myst.\nIt starts chill with you, the screen and maybe a cup of tea next to you. Soon you will get papers to take not, you will be taking screenshots of everything, then the red string comes out, you stop combing your hair and start screaming Pepe Silvia to everyone who walks through the door. \n\nReally, pace yourself with that one. It is a great game. Longer than you expect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[b]\"Blue Prince\" attempts to merge the roguelike genre with the world of puzzles, and for the most part it succeeds. Its concept feels refreshing and unique: you draw floor plans and reshape the manor differently in every run. The visuals are charming, cleverly color‑coded to aid gameplay, and the game is packed with mysteries, tools, and secrets to uncover. The lore is surprisingly deep and well written. There are many nice roguelike elements such as upgrading rooms, gradually acquiring rare floor plans, and unlocking new paths.\nHowever, these strengths are often overshadowed by the currency system. Having large amounts of allowance (money) and stars can make the game significantly easier, to the point where other mechanics lose importance. The inclusion of repetitive puzzles (like the parlor and billiard) and the heavy reliance on strong English skills may also frustrate some players. The plot feels fragmented, and the lack of major events reduces motivation. Still, \"Blue Prince\" remains an authentic, distinctive experience with strong replay value—especially appealing to fans of puzzles and roguelikes.\n\n\nManometer: 7/10[/b]\n\n\nThe good\n- Inspiring concept. A clever blend of roguelike mechanics and puzzle design. The idea of an ever‑shifting manor that you reshape each run is creative and engaging. Architects and design enthusiasts will especially appreciate it.\n- Beautiful 3D graphics. Sketchy yet clean aesthetics strike a nice balance—minimal detail without feeling empty. The color‑coding approach is excellent, allowing players to quickly recognize elements after a few runs.\n- Rogue like elements has problems, but some good ideas too. Building a deck of rooms, upgrading plans, acquiring rarer ones, and unlocking tools and paths adds depth. Room synergies are smartly designed, encouraging experimentation. Each run offers new opportunities, making the game highly replayable. Unfortunately, progress depends too heavily on currency (money and stars), which can overshadow strategic play.\n- Mysteries everywhere. Logs, hidden paths, rare items, and even rooms outside the manor keep exploration exciting. Tools often have unexpected uses, and puzzles require combining elements from different locations, ensuring long‑term discovery\n- Well‑written texts. Logs and books scattered throughout the manor carry a poetic tone and often hide secrets. The in‑game guidebooks are a nice touch, offering new players helpful strategies.\n- Strong atmosphere. From the start, the manor feels eerie and otherworldly, drawing you into its mysteries.\n- Polished control mechanics. Simple, responsive controls and well‑designed menus make repeated play smooth and frustration‑free.\n- Although storytelling is questionable and it's really difficult to uncover the whole plot, the lore is very rich, symbolic and layered, exploring the manor’s history, the region, and the protagonist’s predecessors.\n\nThe bad\n- Although it has a good structure of interconnected puzzles and some nice rogue like elements, the ability to form your own deck is overlooked. The opportunities to upgrade floor plans or draw new ones are rare. Also allowance and observatory are way to important. Progress often comes not from mastering mechanics or building a strong deck, but simply from accumulating money and stars. This undermines strategic depth and makes the game easier over time.\n- Puzzle accessibility. Many puzzles lack universal logic, relying instead on real‑world knowledge. For example, billiards requires mathematical reasoning, while others demand strong English comprehension (like interpreting paintings). I had no problem with billiard, but ss a non‑native English speaker, I found some puzzles tedious (like the annoying gallery one), which limits the game’s audience.\n- Putting in there two, not so creative, puzzles (parlor, billiard) that you have to play hundreds of times is tiring and after a while they lose interest. The parlor, in particular, is dull yet essential for acquiring gems, and it cannot be skipped.\n- Fragmented, questionable storytelling. While the lore is rich, the narrative feels scattered. Connecting plot pieces requires many runs and methodical effort. Early on, players may spend hours without understanding their goals or motivations. The absence of major events further weakens engagement, and many players may abandon the effort to understand the story and simply continue playing it for its interesting gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In the end, I believe this game is going to disappoint you, the real question is whether the journey is going to be worth it.\n\nIt is weird to be using rogue-lite elements for a puzzle game. You’re given a random set of rooms each run and have to hope that what you get includes something that will allow you to progress the game. Early on this works surprisingly well, as the player I didn’t just get the mental challenge of solving a puzzle but also the little dopamine rush of winning a gamble each time a room I needed came up in the draw. Early game there were a lot of clues to follow, a lot of rooms that hadn’t been explored, so every run always felt like it had given me *something* to progress me further. But, as the game progressed and I followed more and more trails of clues to their conclusion, there were fewer useful rooms for me to draw, I started having runs that felt like they were useless and this did not mesh well with the fact that this game does *NOT* respect your time. Unskippable cutscenes, mandatory backtracking, slow animations, if felt atmospheric when I had two or three hypothesis I could test in a run, but when I had to go through two or three runs just to test a single hypothesis it started feeling like a pointless grind without an end in sight.\n\nThat said, I don’t regret buying this game and I would still suggest it to other players because in my opinion the ride was worth the fall. The rooms are intriguingly crafted, the world beyond the mansion fills out piece by piece in interesting ways, forming a picture of the world that is familiar yet novel. Most importantly there are narrative plateaus, where the player has enough information to feel like they’ve got a complete story even if they didn’t reach the final ending, it gives a stopping point where you can set the game aside and still feel like you’ve accomplished something. \n\nWhich is what I did. Maybe I’ll pick it up again later, but for now I’m happy with the milestones that I’ve reached.\n\nPS. This game does lean pretty heavily on some English/American cultural norms for its puzzles, some I might even say that some are specifically upper-middle class English/American norms. If you don’t live in one of these two nations you might have some undue hardships solving some of these puzzles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game to pick up and play a \"day\" and then go to bed or go back to work (about 30-45 minutes).  Warning it is a little bit creepy so if you play before bed maybe have on other music that is happy so you don't have bad dreams?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one of the most innovative game experiences I have come across in some time. I'm not sure why it doesn't publicly advertise itself as a roguelike because that's one of the best aspects of what makes the game so interesting. \n\nCombining puzzle/mystery with roguelike mechanics is such a fun combination and having a roguelike with otherwise very chill gameplay is a breath of fresh air compared to the usual fare. \n\nIt's like Betrayal at House on the Hill had a baby with Obra Dinn and Go Home, and I love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Roguelike Puzzle-solving masterpiece. Great, very ambient soundtrack. Only play if you like solving puzzles, even if it takes multiple days before you solve some of them. Some are very difficult, but totally worth playing if you have the patience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is unlike any game i've ever played before. this tickles my brain in such a perfect way. i LOVE the hunt for information, and there's always more information to find. the moment when you piece something together is unlike anything else, my heart literally drops (in a good way). sometimes this game makes me feel so smart, and othertimes i'm kicking myself for what i've missed. if you enjoy puzzles, logic, deep lore that isn't outright explained to you, and what seems like endless pieces of lore to find, PLAAAYYY THIIIISS GAAAAAAMEEEEE",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"A life without some mystery is a life without imagination.\"\n\nOkay, In short, Blue Prince is a fantastic mix of roguelike and puzzle genre and I absolutely recommend anyone play it and give it a try. However, the game is absolutely not for everyone which is very clear when experiencing it and its mechanics and depth of puzzles. But those who want to see what is over the horizon will get a lot out of it, especially if you play past the initial \"credits\". It is a truly remarkable and unique game. the RNG will get annoying and it will frustrate you, but  its not the end of the world. You can make up for it, the game has plenty of tools to turn things in your favour. Play it as blind as you possibly can. \n\nNow, for the long of it. This will contain some spoilers. \n\nThis first layer of Blue Prince is where your approach to the game is the MOST important part. I had to actually see what other people were saying about this game and what kind of mindset I \"Should\" have after i had started playing it because I was just confused and getting nowhere. I was convinced the roguelike aspect of the game was the major defining mechanic of it, and was just relying on getting a good run to reach the end. I had to shift my approach to the game and was more focused on taking time and finding pieces throughout the rooms, what synergies they have together, what all of these memos, notes, and cryptic paintings mean. I started to take A LOT of notes, at this time of writing I have nearly 700 screenshots of notes. I would plan out more optimal paths, unlock different things to make the game easier, discover things that wouldn't even be addressed until AFTER you see the credits roll. The depth of the puzzles is immense, and when things \"click\" and you figure it out, it feels great. All of this made the game more satisfying, and frustrating to play. I absolutely have a love hate relationship with this game, it has outstandingly high highs, but when I would go several IRL days of a week making absolutely no progress and have to go to bed feeling like i got nowhere. It sucks a lot and is probably Blue Princes biggest flaw. But I will comment on that a bit later, the main part of the first layer was figuring things out that get you to the antechamber (or room 46) more easily, it feels very hard at this stage of the game, to some people its basically the entire game, and ends when they reach it. But the more time you take, the more new rooms you draft and the more puzzles you put together, you will make getting to that room easier and easier, it almost feels [b]Obsessive[/b] with how badly you want to reach it. and eventually, you will find those [spoiler] levers [/spoiler] and you will reach that door, and see the credits roll. \n\nBut there is still so much left unanswered. From this point on is the \"real\" game, throughout the first part of the game you will find notes about the story, the characters, lots of environmental story telling littered throughout the game, you will probably hear about the different realms and cities, about Simon's mother, about Herbert Sinclair and the life he lived, so many things like that. The story itself is its own puzzle, which I find fantastic. Some people have said getting to room 46 was the most fun of the game for them, but for me its everything after it, or the \"mid game\". Reaching room 46 was initially a difficult feat, but during this part of the game I had done it dozens of times, sometimes even ignoring it just so I could find other things instead and reach the next goal I was chasing. Unfortunately this is where the games flaws really begin to set in strongly. there are certain specific conditions you will need to meet at this stage to progress towards what your current \"goals\" are, Some are pretty easy to do, and some are just entirely reliant on \"getting lucky on what you draft\". I swear to god, in all of my time playing this game, I had never ONCE EVER gotten the pump room to spawn immediately next to or relatively close to the boiler room. the only way I solved the [spoiler] resevoir puzzle [/spoiler] was SIGNIFICANTLY later into the game using the [spoiler] data packets [/spoiler]. This game will really feel like its kicking your teeth in sometimes, to get 3-4 ranks into a run, get too many dead ends or lock yourself out and have to restart, not draft the room you wanted that day, run out of steps, again, and again. Yes, this is the point of the game and it will get significantly easier to mitigate this further along (by the end of the game, money was so easy to acquire that I could buy out every single store every single run) but when you are just so absolutely close to finally reaching that thing you wanted to see or try to POTENTIALLY solve something you've been sitting on for ages, just to fall over right before the finish line just really takes it out of you, I would often take breaks from the game during those moments with how bad it could get. This is probably the main reason why i have over 90 hours in this game. But even still, you will persist. The puzzles and depth keeps going and so does your ever expanding list of leads and notes. You will think to yourself, [b]Does it never end?[/b], truly you have no idea, so you keep going, and once you've found a certain amount of \"things\" and unlock some more late game mechanics, you will finally reach the late game, the final layer. \n\nThis was the absolute most difficult part of the game for me, and where I had to rely on hints because the puzzles  and leads are so absurdly cryptic and rely on your knowledge of many different things I felt insanely lost quite a handful of times at this stage of the game, and I don't blame anyone else who does. There are a handful of sections of this game that really feel like you have to be touched by an elder god to truly understand them, or just read more old English literature. (and maybe understand a bit more about chess). I was very taken aback by the idea that there was still more to go, I was convinced the \"mid game\" section I had been playing all this time would lead to the end. but Blue Prince has many things hidden behind its doors. Despite how difficult the remaining puzzles were to solve, some of my favourite moments in the game occur during this section. mainly the [spoiler] throne room [/spoiler] and the process of getting to it which i thought was cool as fuck. The final section of the game is genuinely fascinating and feels like the game testing your knowledge for getting absolutely this far especially those who pay lots of attention to detail, however its still in the same line of incredibly difficult and cryptic puzzles that could take legitimate hours upon hours to solve, involving a lot of days and resets in game, it feels somewhat tedious and I feel like it could've been handled slightly better. \n\nWhat I loved the most was the journey, I played this game with the help of my Partner for a majority of it, we would solve puzzles together and note things down, come up with solutions to the current things we were stuck on. (she did most of the billiard puzzles cause I suck at math) It's a game I'm truly never going to forget. It reminds me a lot of Outer Wilds, which is one of the greatest games I have ever played, it is probably the closest thing to that game ive played. (in terms of them being puzzle games that involve \"repeating\" mechanics and difficult puzzles). Blue Prince is a game about Obsession, the characters and especially the player will show that, I know I was obsessed to see everything this game had to offer, and I do feel left quite satisfied, yet still wanting more. \n\nI hope one day there will be another Blue Prince.\n\n\"But one day,\nthe prince saw something new,\nAnd if you look closely,\nyou might see it too.\"\n\n\"The skies parted\nAnd the clouds withdrew.\nThe prince has a new favorite color...\"\n\n\"the color blue.\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite possibly my favorite puzzle game of all time. It's been an absolute joy working through its many, many secrets with a friend and enjoying its well fleshed out lore. We've been obsessed. When you think it's over, it isn't.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not since my wife and I have played Myst for the first time together, in the mid-90s, have we had so much fun together playing a puzzle game.  Best played together, or solo, or however you wish.  A must have for all puzzle lovers. Can't say more without spoilers!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At first, I thought the game was good but not for me. As I continued pushing through, I finally understood it. Blue Prince is not entirely a game of luck like it appeared to me, but instead a calculated assault that takes more to fully grasp than you'd think at first run. Totally worth checking out when on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the most innovative and intriguing puzzle games I've ever played.  Perfectly blended roguelike elements, and a plethora of puzzles to pursue.  Can't recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the most unique puzzle games I've played. Combines the puzzle solving mindset of Myst with the iterative gameplay of a rouge-like. Some puzzle solutions do come completely out of left field, but a puzzle game without a challenge isn't a puzzle game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An extraordinary puzzle game that makes me feel incredibly stupid, but also incredibly smart once I figure out a solution.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've only played for 4 hours and I haven't played alot of puzzle games, but I absolutely love this game. The roguelike structure is suprisingly well integrated this Myst-like puzzle adventure. Now if I can only figure out what the chess pieces are for... And all the pictures on the walls, what do they refer to?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Sort of a mix of Outer Wilds and Inscryption.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't recommend this if you are not a fan of or hate word play. The harder puzzles are almost exclusively play on words (And sometimes have double meaning!).\n\nIf you like abstract and hail mary connection making, then you'll like this game IF you are OK with RNG deciding how fast you can progress.\n\nI'm recommending even though I'm not a fan of the puzzles...I can appreciate them for what they are though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I thought this would just be a cute little puzzle roguelike game. I've spent nearly 80 hours and I still don't know how deep this game goes. Would recommend if you don't mind hurting your brain a little (a lot).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like puzzles (or more like LOVE puzzles), and especially puzzles within puzzles that lead to even more puzzles, then this is 100% for you. Get out your paper and pencil and get ready to have several pages of notes.\n4 pages here.\n\nIt's a great concept and I had a pretty good time getting to [i]The Main Objective[/i], but the content after that seems too... convoluted for me.\nMy biggest blocker is how the RNG factors in to each run.\nThere were a couple of runs that felt basically wasted since I had figured out some puzzle on paper, but got unlucky with the in game RNG and was not able to get the room(s) I needed.\n\nSolid recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Хорошая игра для новичков или малоопытных игроков этого жанра (puzzle, escape room), но для опытного может показаться слишком репетативной, медлительной и не всегда понятной, когда дело касается загадок/пазлов.\r\nЭлемент случайности повышает перепроходимость игры, но вместе с этим затягивает игровой процесс и может утомлять.\r\nВ целом хорошая игра для отдыха от работы, своих денег стоит.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my GGOTY\n\nwhenever we are submerged in the madness of games gaming we forget it's madness\nthe painstaking efforts to mitigate unfortunate situations, willing a resolution of one more problem to be\nthe desperation to find the next as to not float aimlessly\ntil we resurface and realise the madness is delicious\n\nblue prince is a sea of limitations and experimentations, in which you helplessly struggle to expand your possibilities to fit together the perfect house plan and achieve the perfect day. the day you understand.\n\nwhen searching for origin can one then find their own way, or will origin dictate?\ndo you see the full picture? are you persistence?\n\n(i don't have a single achievement yet but i like glimpsing into infinity in this funny haunted house\nit's an ecosystem of aristocracy boiled down to resource management and logic puzzling detective delectability)\n\noften unfair, alone on a monumental",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game pissed me off so many times but the payoff for the puzzles always feels worth it. This is definitely not a game for most people but for those that are wiling to deal with the obtuse learning curve and take notes as they go, this is a great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I would never have expected a puzzle game built on drafting mechanics to work, but this is a real, and very unique, gem of a game. A couple of endgame puzzles didn't feel particularly rewarding to me, but that really is my only criticism of an otherwise near-perfect game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One day I'll figure out what I'm doing. That day is not today. I am absolutely not the person for this task...\n\n\n\n\nnot that i'm not gonna try tho...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Innovative, different, different every day and every round, captivating, and I've never had so many \"aha!\", \"oh, I see\" moments in a game. And I've never been so excited about the smallest steps forward. The game unfolds pleasantly slowly, in small increments. Bit by bit. It's worth every single penny and this game deserves far more attention!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Blue Prince is a visually striking game. The art style builds the environment around you, with puzzles that match the aesthetic. I will say this game is quite tricky when you first start, but piecing together all of the clues you find along the way is incredibly fun. 100% recommend playing this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a very fun game...at first, but honestly the RNG becomes a huge headache to manage, especially if I've figured out what I need to do but just don't have the right room/tools for it. I ended up installing a mod to give myself a leg up, as many other people have had to do as well, clearly, since such a mod exists. Anyone who actually chooses to play this on cursed mode is, frankly, insane. \n\nI think it would be nice if the game, at a certain point, just let you start the day with all the tools as well. There's already similar bonuses throughout the game. I also wish there were more ways to hold two or three important rooms to the following day. I don't think either change would really break anything about the late game other than speed it up considerably.\n\nI also think it would great if there was just a glossary of everything single thing you've read so far. Please, just say Simon keeps a copy machine in his his hugeass backpack. It's ridiculous how many puzzles rely on library books, and half of those also require the magnifying glass, AND you need to order the book and then wait a day to pick it up, AND it's not like you can just copy down all of the text because half the clues are in visual puns and drawings! I took like 20 pages of notes for this and by the end of it still just went to the wiki because it was too much of a headache to draft the room I needed just to double check something.\n\nI've officially hit a wall after the throne of the blue prince. I am looking at what it takes to solve the atelier puzzle and running through my mind all the backtracking and getting lucky and preparing for the perfect day to come together and it's just not worth it. 70 hours is more than my moneys worth, I wish I could say I was leaving on a high note but the grid has worn me down.\n\nTL;DR get it if you really love puzzles, tap out or install a mod once you hit your limit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It starts slow, and even with the run button on the movement speed is just way too slow. Very RNG dependent, which can be frustrating for a puzzle game. I stuck with it through these issues, and I'm glad I did, as it has some interesting puzzle mechanics. But I would not call this a masterpiece. If you like the genre and can power through the VERY slow movement and not get annoyed by bad RNG, then there is a good game underneath. If you are not a fan of the genre, this will likely cement your opinion on the topic. Above average, and very deep, but the above issues keep it from greatness imho.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this because it reminded me of a board game - being able to \"draft\" the next room was a really cool idea.\n\nThe game itself a bit of a roller coaster. It's hard to really explain: you'll be pushing really hard to reach your goal, and making little progress - and then you'll suddenly make it way farther until you hit even more snags. I think the first \"win\" hits hard (in a good way), especially because of how much you work for it.\n\nIt's a cool game, and I recommend it. That said, just be aware of how much of a roller coaster it is. It's unpredictable, and a real struggle. But each bit of progress feels very rewarding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Going from \"How is it even possible to win on Day One?!\" to learning the tricks to reliably getting almost there to completing it is a top-tier gaming experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For a long time, everytime I was playing a game I needed to have a youtube video or a podcast on the background, this game fixed that and made me renew my passion for videogames. \n\nIf you are reading this to decide If you wanna play this game or not, do yourself a favor and dont research anything about this game, going complitly blind is the best experience ever. \nDon't be scared by the amount of hours you see people have, you can achive the main objective of the game within about 10-15 hours, after that is up to you if you want to keep going. Only that first 15 hours are already worth the price.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have a 17k word document of notes on this game, and I don't think I've even approached the end. This is not how you need to play the game, but I am having such an unbelievably good time doing so.\nI will uncover every puzzle this game has to offer, mark my words.\n10/10 this game is reallllllly good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I didnt really play this on my account but i played this with a friend of mine and it is a really good game with a really good story imo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At first the game is really simple, get to the hidden room. However, the more you play the more you realise just how intricate and complicated it really is. I am not a gamer, but I have been absorbed by Blue Prince, and as much as I want to find the hidden room, I am just enjoying exploring this house/game.  I have the feeling that once I have found the room, there will still be a lot of other stuff to explore.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Blue Prince is a fantastic and brilliant puzzle game that has easily become my GOTY for 2025; its world is captivating, its puzzles are intricate, and the roguelike elements are perfect at keeping things fresh from day-to-day while not feeling overbearing.\r\n\r\nIf you like puzzle games and you want one that sticks with you after you play it, get this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I CANT STOP PLAYING THIS GAME AHHHHHH, ITS SO GOOD! the puzzles are pretty chill and fun but my love for Roguelike games is so heavyily pushed in this game that it makes me not give up until i make progress! i have played one run for around 2 hours because i was reading lore and being nitpicky and deductive on every room i selected, i also love how planning is so huge in this! if you dont plan your run well enough and get rid of rooms that wont benefit you early your gonna get hit with them at the worst times!\r\n\r\nbut that being said PLAY THIS GAME, dont skip out! im an action and fighting game preference with a love for puzzles and this sparks the puzzle love so much!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Intriguing leisurely puzzle game that rewards careful attention and gets more intricate as the game develops. While it is designed as a solo game, it can be very fun as a shared challenge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game pushed so many of my obsessiveness´ butttons. Couldn't put it aside until I was done, which is a good thing, and also a very bad thing if you happen to have a life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In Brian Moriarty's 'The Secret of Psalm 46,' he makes a prediction that has been in my mind since I heard it ten-or-so years ago:\n \n\"Someday soon, perhaps even in our lifetime, a game design will appear which will flash across our culture like lightning. It will be easy to recognize. It will be generous, giddy with exuberant inventiveness. Scholars will pick it apart for decades, perhaps centuries. It will be something wonderful. Something terrifying. Something 'awe-full.'\"\n\nIt is my belief that Blue Prince is that game. No other game has inspired awe in me the way this game has.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Blue Prince is a roguelike puzzle game. You are trying to find the forty sixth room in a forty five room house. You have to place the rooms in a way to allow you to move forward, managing resources and discovering secrets and meta progression.  \r\n\r\nThis game is very fun. It drives you to keep going till the end and even beyond.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I really think I would have enjoyed this. The interesting art style, the atmosphere it evokes in the beginning. Very good first impression... for about ten minutes.\n\nRefunded due to lack of save on quit. I have to control my game time and stop when I need to. Being forced to abandon a run I'm enjoying because there's no save feature is just not something I'm interested in.\n\nSave on quit is an accessibility feature for many of us. I'd love to give this another try if such a feature were implemented, even as an option to toggle on in the accessibility settings.",
      "voted_up": false,
      "votes_helpful": 568
    },
    {
      "review": "The puzzle and lore elements of this game are fantastic. The art direction is beautiful. The basic gameplay mechanics are straightforward enough. I really wish I could give this game a positive review because what is good about this game is fantastic - peerless, even. \r\n\r\nThe puzzles in this game become increasingly obscure and I would even venture out to say that some of the later-game puzzles are contrived. I, however, am a bit of a novice at puzzle games and I fully expect that those with more experience in the genre will love them. In my subjective experience, however, some of the puzzles are not forthcoming in a way that, when solved, do not fill me with feelings of reward. Rather, I am left thinking \"THAT was the solution?\" But, even this would be something I would happily overlook if it were not for the primary issue this game has.\r\n\r\n\r\nThe RNG in this game is AWFUL. So many runs are dashed against the rocks of fate unfavourable. At the beginning of the game there are so many new things and so many options that running out of items or getting dead-ended doesn't feel too painful. There are more mysteries to discover, more things to unravel, more puzzles to solve. You'll just Call It a Day and try again tomorrow. As the hours tick by and the runs increase, the mysteries dwindle. The puzzles narrow. There are a LOT of puzzles in the game, but if you are assiduous you will eventually reach a point where the amount remaining shrink. Now, every puzzle you want to engage with in some way requires several layers of RNG acting favourably for you. It is at this stage when this game begins to drag. The game feels sluggish. There are times where no matter what you do your progress is scuppered by events that are largely outside of your control. There are strategies in play that you can implement that reduce the likelihood of a run ending prematurely, but as the game is not 'skill-based', you can - and you WILL - be presented with room choices that will end your run irrespective of your preparations or considerations. \r\n\r\n\r\nI spoke to a friend about this game and I think they summed up my biggest criticism of this game better than my meandering semi-ramble could ever hope:\r\n\r\nBlue Prince does not respect the player's time.",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "A 15 hour puzzle game and a 30 hour rogue-like mixed together to produce a 100+ hour waste of time. Is there another example of a game that mixes genres like that where the endproduct is SOO much less than the sum of its constituent parts?",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "The praise this game receives baffles me. \n\nIt runs well, it looks nice and the premise is intriguing. Despite what promise it holds, the core gameplay loop seems designed to test player's tolerance for unforeseeable fail states. When entering a door, players choose one of three room blue prints to expand the level and continue exploration, with the goal of discovering the mansions mysterious 46th room. How interesting! Unfortunately, the three choices are rarely all viable, with costs attached to many rooms, alongside dead-end rooms that halt exploration; players first few runs are prone to end early. And that's it.\n\nSupposedly there are cryptic puzzles, and I understand there's a story too. I wouldn't know. What's front loaded in this game is RNG-based trial and error and I cannot imagine any payoff being worth the frustration. While repetitive failure is a staple of Roguelite games, Blue Prince doesn't clearly communicate what the 'right' way to play is. It's surprisingly unforgiving. Maybe I've just been unlucky with my room draws, but luck even being a factor is incredibly off-putting.\n\nI'm too late to ask for a refund, but if you're thinking of buying Blue Prince, do yourself a favour and watch some let's plays first. I don't think the positive reviews reflect the polarizing nature of this game.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I feel incredibly conflicted writing this review having just found Room 46. On the one hand this is an incredibly charming, beautifully realised game with some of the most original level design I've seen in years, and a particularly pretty art style. But the further I got into it, the further my wonder turned to frustration and near agony at how much disdain the game shows you at times as a player. I can't help but feel like it's a game that doesn't really respect your time as the hours tick by.\r\n\r\nYour initial goal of reaching the antechamber drives you forward and you chase down that huge pay off of reaching it like beating a tough boss. When you finally hit that chamber you're presented with a basement key and realise actually it was a false climax, your actual goal lies elsewhere. It was a deflating feeling that should have been a triumphant high but I pressed on and got back into the rhythm. After stumbling upon the foundation room I finally found where the basement key needed to go and after a lot of bumps in the road I managed to get myself down there and was punching the air in satisfaction... only to hit a cog platforming puzzle. I played around with it but gradually my heart sank because I knew there was clearly something else I needed to do in another room to actually reach my goal, and had to end my run fruitless. \r\n\r\nI needed to move a minecart out of the way from the other side of the track which could only be done by draining the fountain. I know it's a puzzle video game but it doesn't help your frustration when you can clearly see how easily your character could squeeze around it in real life. The process of having a second false moment of success merge into another gruelling run of trying to draw the right rooms was really starting to grind me down by this point. I needed a pump room which also required me to draw a swimming pool and once you reach this point in Blue Prince where you've mentally solved the puzzle but are counting on RNG it becomes less compelling and more tedious. Maybe I was unlucky, or my drawing strategy was flawed, but it just took so long to finally get the pump room, with the boiler room adjacent to easily solve the puzzle (I believe there's a way to drain the fountain without the boiler room but I gave up trying to work out the combo). All of this culminated in a joy sapping experience where at times on the run to Room 46 I even questioned if I liked video games any more, it's a crazy thing to even type out but when it was hitting 2am and I'd hit another dead end because of bad draw luck it felt like such a waste of time. You're committing a lot of time to something which isn't making you feel good and you question whether the highs earn the lows.\r\n\r\nWhen I finally got to the last room it couldn't help but feel anti-climatic because twice previously the big teased moment had been a false dawn. The narrative that surrounds the game is very imaginative but also convoluted and abstract; even after looking up the plot I was surprised by how unfamiliar it seemed to me having read pretty much every note and book I could find over 25 hours in game. It meant the cutscene at the end still felt more surreal than definitive and gave me more questions than answers.\r\n\r\nI don't know quite why this game started to rub me up the wrong way so much but it did, and that's why I don't recommend it in the end, as technically impressive a game as it is. I think the crux of it is that lack of respect for time; the question is why do arbitrary extensions of the goal keep being thrown at you just as the prize seems in reach? The only answer I could find was to pad out the game time, which to puzzle fanatics may well be a joy but to me it replaced the sense of accomplishment with frustration. I don't in any way thing the game should end when you first reach the antechamber but I wish there was some kind of lasting pay off that made it feel like more of a success than a fake out.\r\n\r\nIn Hades, which also uses rogue like elements, your first time beating the final boss is such a euphoric and well crafted moment. I don't feel that same release in Blue Prince as marvellous as it can be at its best. The bottom line is unless you're very methodical and happy to embrace a game that moves the goalposts regularly, Blue Prince may well bring you more frustration than joy, as alas, it did I.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "This is a very creative and painstakingly created game, but it left me bailing near the end having realised it had for many hours been keeping me annoyed and just engaged enough.  The puzzles and especially the rogue like element are incredibly grindy after a while because of the RNG reliance and slow pacing.  I subsequently spent some time with a game that respects my time more, which completely validated my decision to bail.  Recommend others don't get started unless you are really into grind.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really WANT to like this game but the more I play it, the less I do.\n\nThe thing I personally like about puzzle games is the feeling after you've put so much energy and thought into solving a puzzle and you finally unravel the mystery. \nIn this game, it feels like luck. You have to just play over and over and over and over again, in the hopes that in this run you'll finally get another clue for that mystery you uncovered last time. But even if you finally do, then you probably need to find the first clue/part you had again, which probably won't appear in this run. Every time the day ends it honestly feels more like random punishment than any kind of achievement. You're also apparently supposed to just know from the start which things to screenshot etc, without any prompt to do so, because otherwise it will be impossible to remember in which room you read that random note that will be super important later to solve a specific puzzle in another random room.\n\nI get that good games can be frustrating and that this is also a rogue-lite, but the \"good\" frustrating games are usually the ones where you keep going until you finally succeed and get reward for it, maybe in the form of progress. After just a bit over 10h I'm already so tired of this that I don't care about the story anymore, I just want the game to let me go further and actually feel like the time I'm putting into this is actually doing something. This is one of the first games in a long time that made me want to just quit and do something else with my time.\n\nI'll probably play it more because I really want to believe it's going to get better and have some really interesting twists, but at this point it feels like I'm grinding just to get to a place where the game will be fun again. \n\nIt's a shame because the game has such a cool style, you can feel the love that's been put into this. But I don't recommend it because if it is a puzzle game, then it should have puzzles that you can solve by your own merit, not random parts of ones that you need to have luck to even assemble.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "RNG and puzzle game really don't fit together. No more than 2 hours into the game I'm already looking for mods/cheats that can deal with this RNG thingy. Even though I'm so far not \"deep\" into the game, after learning the core logic of rooms, I can totally PREDICT what will happen based on how typically rogue-like games annoy players: sometime I'll need a combination of rooms (maybe even a specific positioning of rooms) to solve or get the puzzle work. Since they are all based on RNG I'm expected to repeat part of the game over and over to roll a desired configuration, oh, and to pray that I have enough resources to proceed by that time. This is IMO in contrast with puzzle games which should have deterministic playthroughs, so this RNG design is no more than nonsense which obliterated my experience. Have a look at the nexusmod page, and think about why the top downloads are cheats and what things those players don't like.\n\nThe step count is also something that I don't understand. I totally understand that for a rogue-like design there must be something telling \"nope this is it, time to reset\". However, in this game there is always such a point of dead end even without this step count, for example, when no more puzzles can be solved or no more rooms can be drafted. Adding another layer of complexity for the identical functionality is utterly pointless. The only purpose I can think of it is to limiting the player from checking clues scattered around rooms or collecting resources in remote rooms - that is, annoying the player, if in plain words.\n\nIn addition there is way too much reading. Unlike the room series-like where reading is almost story or lore-oriented, in this game I have to read most of the text unless I'm playing against a walkthrough. There are also tons of puzzles that heavily rely on English, so localization will be next to impossible. In other words, the devs have never thought about non-English audience in the first place. Btw, these are only minor problems compared with the RNG issue.\n\nIn short, this game is not a \"puzzle game\" represented in a rogue-lite manner, but rather a rogue-lite game filled with puzzles. The puzzles by themselves are OK, though. I suggest: add cheating console commands to (1) eliminate resource restrictions; (2) specify which room to spawn next door; and (3) auto-solve minigame puzzles in each room once it was solved in previous playthroughs. Only by then this game can return to the purity of a true \"puzzle game\" (jigsaw-like room arrangement and puzzle-solving focused play style), freeing the player from the hassle and repeated work.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "A rat in a Skinner Box can press a lever. If it receives a food pellet every time it pressed the lever, it will press the lever only when it is hungry. If it never receives a food pellet it will never engage with the lever anymore. If it randomly and infrequently receives a food pellet it will frantically keep pressing the lever.\n\nBlue Prince is a random Skinner Box. It wastes your time away while you keep rerunning the game because \"this time I'll crack it\". I suspect that over time the RNG gets less hostile to keep you engaged. And it feels like you have achieved something. You didn't. You just spent time. \n\nIf you like engaging with a random Skinner Box, this is your game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Suffers from the same issue of many puzzle games. The devs get the solution in their head and work from there to build a puzzle, not considering that they're building an incredibly obtuse and frustrating experience for anyone not in the exact same headspace as the designers.\r\n\r\nThis is the gameplay loop: Run into a puzzle wall, be frustrated for 10 minutes. Google it. See a reddit thread with dozens of comments like \"yeah, that's a bad puzzle. not really any way to intuit that one, you have to brute force it.\" Repeat.\r\n\r\n+That's not how dartboards work\r\n\r\nEnduring RNG and bad puzzle design is not my idea of fun. Don't understand how this was nominated for Indie GOTY. Easy refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I was expecting to solve puzzles but I spent my first two hours trying to open the right rooms and whenever I reached a dead end, I had to start from the beginning again.\n\nThe blueprint mechanic seems interesting at first but gets repetitive and boring very fast.\nIt's a very barebones puzzle game that unnecessarily wastes the players time due to bad RNG and most rooms have nothing inside.\n\nWhat a disappointment.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ultimately this game just doesn’t respect your time & that’s why I can’t recommend it.\n\nThe good: puzzles at every level of detail, they just keep coming!\nThe bad: eventually you’re going to run into a wall where you only have one thing you’re trying to push forwards & the room RNG can spin that process out for hours.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I understand the novelty of it.\r\n\r\nBut ultimately, it's a lacklustre loop of rooms you've already seen, hoping that by any form of luck, you get presented with the sequence rooms you need to do a small step progress towards plot development.\r\n\r\ni'm all up for a puzzle game, but this is really just not... fun. The puzzles are interesting, but spread too thin given the length of the game. Gaming time needed to get any development out of this is disproportionate to what you actually get. \r\n\r\nAs a result, it doesn't do the roguelike genre well, nor does it do puzzle genre well. It's just somewhere in the middle.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The decision to make this game a roguelite was disastrous, and the only thing this achieves is increasing tedium and time consumption tenfold. You finally assembled the items you need to unlock something? Tough luck, you're out of steps! Or you never draw the room you need! Try again next time! Don't forget to watch every animation! Yes, we've put prolonged animation for every thing imaginable, and then made player repeat each step ad nauseam, we are very smart game developers by the way! Enjoy snail's pace walking around spaces you've been in hundreds of times too!\r\n\r\nYou thought there is a motherlode of story underneath and all of this is worth it? Wrong! Each time you inch towards something, your reward is a text log with meandering, useless, flowery text that serves almost no purpose. Maybe at some point it all assembles together, but I'm throwing the towel at this point - the only way I'm completing this game properly is with cheats.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Has a lot going for it, neat concept (at first), pretty to look at, interesting mystery, good soundtrack. But the premise wears thin pretty quick - the idea is that you're exploring this house, and each time you open a door you determine which of three rooms it is, building a floorplan as you go, resetting it each day after a set number of steps, with the goal of reaching a particular room at the other end of the map. \r\n\r\nBut because the rooms you are offered are determined at random, you end up spending a lot of time knowing exactly what to do, but being unable to do it until the dice rolls go your way on 3-5 items at once, and before you've built too much. Most of the puzzles aren't especially hard, you just spend most of your time slowly walking through the same sections over, and over, and over, and over, hoping for the RNG to finally give you what you need. There's nothing to do in the game other than solve puzzles, so slowly meandering about the same dozen or so randomly generated rooms for hours at a time until you win the slot machine and get the rooms you needed in the position you needed makes for a pretty bad game. The positivity around this is mystifying.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Some nice ideas let down by being incredibly tedious to play, with puzzles that hinge on too many random elements to come together",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "First 20-30 hours are amazing, but the sheer irritation and time investment the game asks for very little payoff just wore me down to quitting.\nAnd I can't give it a positive recommendation after that experience, no matter how unique many of its mechanics are and how committed it is to creating puzzles.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I wish I could leave a mixed review.\n\nThe game starts slow, then becomes interesting, then amazing, then terribly frustrating. \nIt is just wasting your time. You're either trying to solve cryptic puzzles for which you still do not have enough clues because RNG didn't deem appropriate to spawn a room that hints how to solve them, or even worse you know EXACTLY what you need to do, but run after a run, after a run you're not getting the right rooms in right combinations or you're not getting the right items, or you have the items but not the rooms to use them in this run. \nI feel like after reaching the room 46, or if not then when uncovering some of the further mysteries there needs to be a system to make sure you can get the rooms that you need or items that you need. Yes there are systems in the game that can nudge your luck a bit, but even with those I am extremely unlucky I guess. \n\nI really wish I could write a more positive review, as the game is so close to being brilliant, but in the end I am left angry.\n\nP.S. I discovered the room 46 on day 16 of my first playthrough, and it was by far my best run, I had bunch of items and over 100 steps left and was aiming to get full house achievement (had 5 dice left and only 4 rooms to open) and had items to solve 2 more things, but foolishly I opened room 46 expecting to actually enter the room. I guess I was stupid because instead I hot the \"ending\" credits and my run was over. I had 14 runs since, and I have never managed to get the same combination of items and rooms like in that run, and still haven't progressed in those areas that I know how to solve. It says something when the moment that should have felt great in the game - achieving the objective that the game sets you out to do left me angry and frustrated.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "i have patience until a certain point. neat game but too tedious for me. I know RNG can be manipulated to a degree... but RNG is still too present for me to fully enjoy this.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game does not respect your time. The RNG just stands in the way of the puzzles. Got old real quick and the loop does not feel good. It feels like a waste of time when you have to call it a day after not progressing the story/puzzles at all. And that happens way more often than a good day. \r\nEnded up adding mods to add luck so I could make progress. Was not willing to play endlessly hoping to find the one item I need. \r\nIf you have a really high tolerance for that stuff then you might like it. Otherwise, it is not worth your time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Getting to Credits is a nice experience but the RNG feels horrible after that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"A brilliant puzzle game, significantly held back by RNG\"\n\nLet me start by saying I love the concept of this game. A roguelite escape room that requires you to explore, interact with every room and piece together a puzzle that spans across the whole mansion is incredible (believe me, you'll want to be writing notes down the entire time to solve a lot of the puzzles). But the reliance on RNG to be able to complete a run is brutal... it doesn't matter if you can conceptually find all the pieces and solve a puzzle, if your run doesn't get the right room or item combinations, then too bad - try your luck with the RNG gods next time. Be prepared to spend literal hours on wasted attempts, all because you couldn't find the right rooms or your path gets cut short.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm getting really tired of getting completely denied of progress becausue of the resource + RNG.\n\nThe game has many interesting mechanics and puzzles, which you can solve only by doing multiple runs. Most likely you cannot decide if you like the game after only 1-2 runs.\n\nBut after playing a while, it feels like actually knowing more mechanics and secrets of the game won't help you progress any further. You keep stumbling into these situations, where you can do everything right with the cards you've been given, but then lose just because of getting bad RNG once or twice.\n\nYes, RNG is one of the core mechanics of roguelikes, but I can't recall any other one, where in multiple (or most runs TBH) I've gotten actually good RNG in the beginning, using this for my benefit, and then suddenly be denied of progress completely mid-run. It doesn't give you the feeling of \"oh, I could've played better\" or \"damn, that obstacle was a bit too difficult, but next time I'll get over it.\"\n\nI'm currently on my 11th run, and still my first run was absolutely the best one (even with being completely blind of the game's mechanics and secrets before playing it myself). I've learned a lot after those other 10 runs, but I just can't progress, because of the RNG stopping me so often.\n\nSo in the end, the game feel like a glorified story game/walking simulator, where the roguelite elements keep you progressing completely, instead of testing your skills and knowledge.\n\nSo play this game, if you want to be led by the game and have the experience it decides. But don't play this game, if you want the feeling of getting over obstacles by yourself (Which in my opinion is one of roguelikes'/-lites' main points).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to enjoy this game. For the first 20 or so hours I had a blast, didn't even notice time passing and was excited every time I found a new room. But too much of getting further in the game relies on too many lucky things happening. Also, the puzzles at first are fun and interesting, but some of them are such a stretch that it was just frustrating. I kept reaching points where I would say \"THAT was the answer?\" and it became too much for me to continue. I had pages of notes and after spending waay too much time working on certain puzzles only to realize they didn't matter, I canned everything. \nI did enjoy the art and the general vibe of the game. I think it's maybe just not my cup of tea.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This was a good game in the technical and concept aspects. Sadly it really falls flat due to how heavily it leans into being a puzzle roguelike. At the start it's an interesting search for new rooms and clues, but once you've gotten a little ways in you end up having to run day after day of no meaningful progress because the RNG didn't allow for it. To beat the game or get any canon progress, you have to roll the correct combination of rooms and items then get to a specified place. It stopped being fun around day 25 and I didn't finish until day 42. \n\nMost of the reveals which I came to naturally were lackluster and rather enigmatic, but not in a way that ever made me really want to find out more. The puzzles I could figure out were usually easy, and the ones I couldn't I can only figure are oddly obscure or require select items, see point above for RNG.\n\nI'd say it's worth your time if you are really in love with roguelikes. The game plays well and looks good. But if you're playing this because it's a puzzle game, definitely understand that it's going to be painful.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is fun, but you need to have a LOT of free time and determination to persevere through wasted days",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1] Causes Intense Motion Sickness [/h1]\n\nI've been playing first person games for decades, and the only time I've experienced anything close to this is when I attempted to play Half Life 2 in VR. I played Blue  Prince for about an hour, and then spent the next three hours lying on the couch with my eyes closed, desperately trying not to vomit. I definitely do not recommend that experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poorly designed puzzle game. The other fully written negative reviews describe this game well. You will play the game until you get stuck and then check the wiki for answers. When you check the wiki you'll realize how stupid all the puzzles in this game were and how much time it would have taken for you to finish those puzzles or how difficult they were to figure out.\n\nIt also takes an incredible amount of RNG to progress and finish puzzles and is mind numbingly boring to grind through the RNG just reaching those secrets. In this game, its possible to start a run, get 30 minutes into it and just get fucked over by RNG. I don't think its good game design or acceptable for a 30 minute run to be ruined by RNG. This is how bad this game is.\n\nI would refund this if I could. What a waste of time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is as infuriating as it is addicting. It took me over 100 attempts (in-game days) to finally reach the antechamber (the objective that seems like \"beating the game\"). My issues are the following:\n\n-Game speed is INSANELY slow. Insultingly slow. The slowest walking simulator you remember playing in the early 2010's walks twice as fast as this game. You need a mod to play the game at 2x speed (at LEAST), or you'll die of old age before you roll credits. Localthunk is a hero for giving a 4x speed in the settings for Balatro.\n-The game is VERY often non-intuitive. I spent the first hour of the game reaching what every other video game would consider a \"soft-lock\" state (where you can't progress the game at all but it hasn't hard crashed), but no. That's how the game is supposed to work. When you lose a run and can't progress the house, the game doesn't tell you, you just have to hit START OVER. Again. and Again. Build 3 rooms, oops RNG says only dead ends, now start over. \n\n-What you need to understand is that this game is basically Tetris. Except instead of rotating pieces and getting to choose where they go, you can't rotate pieces, and you can't choose where they go, but you can choose between 3 pieces. You will spend hours building Winchester mansion-looking houses because RNG screws you over. You have to learn the Tetris pieces in the deck and intentionally use bad pieces to remove them from the pool. Which feels like a meta thing that other rogue-likes don't do. Comparing again to Balatro, which tells you what cards are in your deck. You should be allowed to access a database of all the rooms in-game so you know what's still available. Instead you're checking the wiki I guess.\n\n-Meta progression is scant. Few and inconsistent ways to store tools and items. I can't count how many times I ended a run with a ton of keys, gems, and coins, got a soft-lock run, and was never offered the room that lets me stow those for the next run. All wasted. \n\nI want to love it, but the game really feels like an alpha that's severely lacking tools that would make the game feel better. Other rogue-likes are a lot better at making losing feel like you're still progressing the game (Hades having new dialogue from NPCs, Balatro letting you unlock new Jokers, etc). This game has a fraction of that mostly just left me groaning because a door needs a keycard that never spawned in my run. Way too often you'll feel like you lost for factors beyond your control. Even if that's not true, a well-constructed game communicates the blame owed for your loss.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Too much time is spent walking from point A to B in the house or performing mundane, repetitive tasks (solving basic math problems; moving pipes around; logging into a computer network).  It's tedious and gets in the way of interacting with the puzzles in the game.  It's a game with about 10 hours of content that gets stretched far beyond that due to the constant time wasting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I saw a lot of great reviews for the game and decided to buy it because I love puzzle games and was hoping for something like an escape room. But after an hour in, I didn’t encounter a single puzzle I actually had to solve. The only “task” was to pick one of three rooms and “draw” it on the map. Over four days I couldn’t get past the third row even once, because the RNG kept giving me dead-end rooms. It’s ridiculous—boring gameplay, not recommended.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A masterclass in puzzle gaming on a league of it's own ruined by punishing exploration and endless grinding.\nBacktracking is punished, moving forward is constantly met with obstacles and dead ends. When you figure out how to solve a puzzle it might take you anywhere from 5 to 10 hours to actually draft the combination of things you need to test your theory.\n\nTL;DR: It's tedious",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game clearly desperately wants to seem clever, but it's an endless slog of garbage RNG wrapped around moments where the developer clearly wants to burst out of hiding and shout \"GOTCHA, FUCKER\"\n\nit's more frustrating than fun, in spite of clever mechanics and clearly a lot of love poured into the design.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "There needs to be an accessibility option that gives you a real crosshair. Right now this game is a headache inducing machine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's bad. Oh my god it's bad. It's BEYOND ME how can some many people tell you this sh!t show of a game is a masterpiece... It's one of worst games I have ever played. \n\nListen, I have 10+ years of League Of Legends under my belt, yet this game is more INFURIATING than the worst League game of my life. There is ALWAYS something wrong. Sometimes you lost because you run out of keys, next run no gems, next run only dead ends, last sh!t the game threw at me: 2 Keycard Door block me even tho I setup their chance to appear to low on the Security Room, and what can I do about that ? NOTHING ! The Keycard never appeared in the 36 rooms I opened, straight up unbeatable run. GREAT I've lost 30 F*CK!NG MINUTES to an unbeatable run because I need to get to the Antechamber for the 2nd f*ck!ng time because this sh!t game is toying with me, making me believe the sh!t you find in there is useless only tell me \"Hey, you did all this to reach this place but you don't have the key you had no way to know was gonna be useful again\"...\n\nPerfect bridge for the biggest flaw of this game, the game NEVER rewards you. NEVER. A puzzle game where every puzzle you solve give you sh!t you have no idea how to use, even times straight up something useless, how can a game like that be considered good ???\nThe game recommends you to take notes, but I have a 40 page long book full of useless crap, I have pages upon pages of completely useless informations because half the stuff in this are of no use. So much stuff in there just to spam your face with info and drown into it. It's been soon 30 hours of playtime I still haven't open any safe. NOT EVEN ONE, there is safe with code everywhere but no code to be found anywhere.\n\nThis game is a puzzle game that doesn't reward cleverness, it's mind-blowing, sometimes I have the biggest brain wave of my life finding the most convoluted solution to the most cryptic puzzle and don't get any progress from it. And 10 minutes later I make a giant step towards beating the game just because the game gave me a key item for free WHY DO I ONLY PROGRESS WHEN I GET LUCKY IN A PUZZLE GAME ????????????\n\nI'm forcing myself to finish this game but I already know I absolutely cannot recommend this game. It's beautiful, fascinating at times but way, way, way, WAY too flawed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't get into it, maybe I'm just too dumb or impatient. If you ask me for a memorable puzzle experience I would point to The Witness, Obra Dinn, and Golden Idol.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game requires a lot of patience. Puzzles are either super easy or you have to google. Cut scenes are extremely slooooow and boring. Claiming it as a GOTY contender is ridiculous. This game WILL waste you time and you won't even get much satisfaction from solving puzzles.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Starting out, I really liked this game. The game loop is unique and has a ton of possibilities. The puzzles are well thought out and solving them gives you the \"ah-ha!\" moment we all crave from games like this. However, 10 hours in or so and it just devolves into RNG heck. I was solving all the puzzles, I was unlocking the rather underwhelming permanent upgrades. But I was doing run after run of running out of doors to go through or never rolling the rooms I needed to unlock the doors you need specific keys for. I'd do a run where I make a TON of progress because I RNG'ed the right items and then 10 runs that were effective wastes of time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "While an enjoyable game, I cannot recommend on Steam Deck at all. FPS dips quite often while standing/moving. The fonts are scattered from being totally perfect to pure illegible pixels, which made it a deal breaker. I changed several settings within the game to no avail. I'd love for the developers to prioritize getting this to run as this would be a fantastic game on the go.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm just too stupid for this shit. RNG is a mess sometimes, and after everything I tried to do to solve this damn game, I alt tabbed it and somehow clicked new game, losing all my damn progress.\r\nI give up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The roguelite aspect makes this a frustrating experience. Rather than solving puzzles it becomes very heavily luck-based rather than skill-based. There are enticing aspects to it, it's just that the randomness-factor prevents you from progressing and makes it feel more grindy than it needs to. Almost as if the roguelite components are there to artificially pad the play time...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't justify dedicating 3+ hours a day of frustration and grind to a mid looking cel-shaded puzzle, which rewards you with nothing more than unengaging cutscenes, and perpetually asks you to do the same things over and over again each time in a slightly different way because the game constantly tries to screw you over with RNG. \n\nLuckily my refund request was accepted. \n\nNothing against people who enjoy this, good for you, but this is the very definition of \"overhyped\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was really enjoying this game but about 30 hours in, the game decided to wipe my save data and delete all my backups. Apparently this is a common bug which happens with each update. I wouldn't reccomend the game in it's current state unless you enjoy being frustrated.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The beginning is fun, but once you've played for 40 hours (~80 in-game days) and solved all basic puzzles, the game is dominated by random luck, which wastes your real-life time waiting for rare events to happen all in a row: you can waste days playing and make zero progress. It is unfortunate because the game has so much lore, but it becomes a \"slot machine\" at the end.\r\n\r\nFor example, I knew I needed to build multiple special items and connect rooms in a certain way, so I need enough luck to draw 6~8 rooms in a specific order over multiple in-game days. But after reading the cheat-wiki to see if there was an easier way, there wasn't! The solution is to play over and over and over again until you get the right sequence of events! And that's just for one puzzle, there are dozens of puzzles that are this repetitive (and worse). That extrapolates into WEEKS of repetitive game play, restarting failed games over and over, without making any progress. At least running raids repeatedly in World of Warcraft gets you experience.\r\n\r\nI guess people that rated it highly don't care about finishing games (Gen Z?), but I do. Call me old fashioned.\r\n\r\nSUMMARY: Not recommended. This game wastes your time and you nothing in return (one reward over dozens of hours is effectively \"nothing\").",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "10% puzzles 90% RNG frustration, this is not a well executed blend of genres.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to love this game. It is more \"puzzle\" focused, but similarly atmospheric as inkshade and inscryption are. The issue is that those games are exceptional games with puzzles attached. This is a \"Puzzle\" game attached to a rogue like deck builder. I will give the reason why I personally will never be able to love this game. it made me say out loud \"Did they seriously just go from 'when is christmas' to 'solve the divinci code on your free time?\". All while refusing to meaningfully balance the rng? They could have 44 rooms that you could carefully place from a deck of 44-50, that would make perfect sense in this \"puzzle\" game. Instead there are what seems like roughly 80 card to draw 3 from. Of those roughly 40 cards out of said 80~ can end your run....BALANCE YOUR GAME SO I CAN PRETEND YOUR \"PUZZLES\" ARE FUN. Without giving away too much, there is a puzzle early on in which you see a holiday card showing a safe. Around the same time (RNG) you may have also seen a room with newspaper clippings and dates that could be the combination. In as few as 2 rooms or 30 seconds from there you may find a study, in which an author suggests that the house and it's decorations are a cryptograph using the missing letters from paintings as hints based on their current relative placement and associated place in the alphabet. It has nothing to do with the puzzle. In both cases it is wildly problematic how they approach story telling and \"puzzles\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As someone who loves puzzle games, I found this to be hugely disappointing. I was skeptical of the genre blend between roguelite and puzzle game to begin with, and the two hours I played did nothing to shake those feelings. Typically the fun of roguelites is how replayable they are thanks to random elements and unlockables, but here those qualities actively work against any kind of fun puzzle gameplay. I solved the same arithmetic puzzle four times in an hour, and also encountered a very generic true/false logic puzzle repeatedly. These puzzles are beyond basic and are not satisfying to solve, yet you get to reencounter them everytime you play, and cannot skip them since they reward you with consumables you need in order to progress. In one run I stumbled upon several safes, which were poorly hidden in various rooms (again, very unsatisfying to discover), however I had no way of finding the code. It may have something to do with a series of paintings on the wall, but the paintings may have been placed randomly, as they seem to be in other rooms. The game makes no effort to indicate either way, and ultimately I move on. Shortly after I find a note with a number written on it labeled \"safe code\". I run back to the first safe and input the code, and get no response (no visual or audio feedback at all). I then go back to the other safe and have the same experience. In a later run, I find that the note was written on red paper, which means that it's a lie. This isn't fun. This isn't rewarding. This is time wasting and frustrating.\n\nIn addition to the puzzling being extremely poor, the gameplay loop is also unexciting and boring. The \"choose 1 thing from 3\" roguelite gameplay is on full display here, and it sucks as much as it typically does. You will lose runs due to random chance, and then get to repeat the same generic puzzles all over again, only to be stonewalled once again by bad RNG. The encyclopedia of rooms is also shockingly small, meaning that you can expect to see the same rooms quite often (likely to make sure that the larger puzzle elements work). Trying to draft a path through the house is, to put it bluntly, not interesting or fun.\n\nWhile I am not aware of exactly what it is, I know that at some point there is a larger meta puzzle that comes into play. I found no hints of this in my playtime, and while this element may redeem the game to some players, I don't see why I should have much faith in it when the basic gameplay is so poor. I've played other games with meta puzzles, but the thing that makes them work is that those games are also fun to play if you never find the bigger puzzle. \n\nPlease, if you are thinking about playing this game, look at Fez, The Witness, Rise of the Golden Idol, Return of the Obra Dinn, or Tametsi instead. Any one of these games will offer a stronger hook, better game design, and more interesting gameplay.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to talk about how mechanically creative the game is, how interesting the puzzles are, how cool the environment designs are.\n\nSo many puzzles are based on puns, rhymes, things that don't make any sense to me as an ESL speaker, even if explained.\nI know the solutions to so many puzzles, but the game refuses to give me the right room combos.\nIt took me 60 days of active searching, to get the room combo just to unlock the grotto.\nIt took me 30 days to get the combo for the chess puzzle, and then I learned [spoiler]about castling[/spoiler] and spent another 40 days to never get all the rooms required to solve even half the puzzle.\n150 days in, I still haven't gotten the right combo for the reservoir puzzle. I know exactly what I need to do, but the game just refuses to give it to me.\n\nThis is a game that I love thinking about, but actively makes me depressed playing.\nTo save people's sanity, I must prevent you from buying it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "As another reviewer writes - there is a 15hr puzzle game locked behind 100hrs of sluggish RNG nightmare.  What started as a refreshingly brilliant experience has now become a \"Netflix game\" that I play while watching something else.\r\n\r\nMy biggest complaint is how SLOW the game feels after a time.\r\nThe dig animations - very SLOW.\r\nThe \"camera panning in\" video at the start of a new day - SLOW and unskippable.\r\nThe drafting screen - SLOW.\r\nWalking around - SLOW and the \"run\" toggle keeps on toggling itself off.\r\nActivating your daily \"perk\" from the outdoor building - a laborious 1 or 2 minute walk at the start of EVERY day.  (Just let me choose a building from the Entrance Hall, subtract the steps, and let me crack on).\r\nComputer terminals - unskippable, SLOW text, EVERY time you access them.\r\nRunning an item across the map to the coat check at the end of a doomed run - 10/10 gameplay.\r\nSee some small text but don't have a magnifying glass - tough luck pal!  Try again in 3hrs when you are lucky enough to have both items again (The magnifying glass needs to be a permanent unlock).\r\n\r\nIn many cases I know what the next objective is, but the moons of Jupiter need to align just to have a CHANCE.  \r\n\r\nI have now modded the game, guilt free to reduce RNG:\r\n- Compass\r\n- Map Overlay\r\n- Faster Prince (removes the SLOW animations)\r\n- Resourceful Prince\r\n- Unlimited rerolls (after failing for 6hrs to draft a boiler room next to a laboratory. And it still took 15 re-rolls)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Does not support any resolutions wider than 1920x1080. Incredibly bizarre for a game released in 2025. I will update my review and consider trying it again if this is ever fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Colorblind mode grayed out. Idk how long it will be but I cannot recommend when its been there for so long already. Devs, wtf, how are you not aware that colorblind people exist from the getgo?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not finished... the dev is avoiding ALL question about the end of the game. It is simply not finished. It was released too early and the fact that is is not completed just ruins the whole experience by the end, by far... It has an incredibly potential and it is terrible to see how it is wasted like that. \r\nI just hope the devs will actually finish the game in the future and not just ditch it after picking up the money bags.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "An interesting game that should really have a option to save on quit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is an okay game. And there's wrong with being just okay. Good games exist just as much as bad games do, but there's far more \"just okay\" games in the world. And that's fine.\n\nGoing through however much I managed to was fine. I enjoyed some parts, didn't enjoy some others, and but I'd say there's more good than bad. The loop does get boring after a while and trust me, you'll be going through the loop A LOT. That's the whole idea, so button up. \n\nI think one of my biggest greviences with this game is that it's hard to know what you need to know. It's hard to look at anything in the game, from a pot of flowers, to a curiously placed chess piece and think \"hmm, I wonder if that's a puzzle\". On paper that should intrigue, but when you spend some much time going through room after room after room, doing the same puzzles over and over, any chances at being excited or fascinated get stifled by the fatigue.\n\nI've played 11hrs as of writing, and I think even if I hadn't gone over the refund window, I'd probably have kept this game. It's very good at keeping you just out of reach of something, which for an indie game like this is great. But if it was AAA, I'd be calling bs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game appears to be intriguing, fun, and clever at first. It even seems like you might be gaining some skill in solving maps as you progress. Then you learn that the rooms/objects you need to find to actually progress are completely random. Suddenly, there's no skill or learning involved. You're just randomly picking the least bad option (while trying to collect currency that doesn't persist from map to map) until what you need maybe randomly shows up. A great premise spoiled by a bad mechanic. If you're smart enough for a random, uncontrollable element in a puzzle game to bother you when it stops all progress cold, then don't bother.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It took 4 hours of play to realize that the RNG of this game meant that you could solve a puzzle in your head but not be able to solve it in the game until the dice gods wanted you to.\r\n\r\nPlay any other puzzle game, but before you're allowed to make any kind of move, you must first roll a 20 on a 20 sided die. Force yourself to stop playing the game and wait for a random number to come up before every single input, and you will have had the Blue Prince experience. A couple hours of puzzle solving needlessly extended to dozens and dozens of hours so you can flip coins and hope instead of actually being allowed to solve the puzzles you've already thought of the solution to.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "RNG with puzzles is a very frustrating experience. when something becomes un-winnable because the numbers landed a certain way is not good game design. \n\nMaybe I Didnt give this game enough time, maybe I got unlucky on all my attempts. not something I enjoy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game pushes you into a corner, and whilst i appreciate that is part of the game its not the type of gameplay i personally like - taking control away and just starting from square 1 each time  just ends up being frustrating.  Very little in the way of engaging puzzles.  Not my bag.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I feel it's important that when you lose a game because of choices you made, you should be able to look back and think \"Oh, I should have done that instead\" and figuring those things out informs your future runs.\n\nThis game doesn't do that, it's just RNG kicking you in the nuts.  There are probably some rooms or items that might make that progression possible, eventually, but I haven't seen them and now I don't care to play any more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This was sold to me as a puzzle roguelike. Truly, it is just a puzzle game. I feel I got enough 'time for my money,' but I can't say either were well spent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The RNG in this game is horrendous and turns a cool concept into a tedious waste of time. There are three different currencies along with a limited step counter that essentially becomes a fourth, and all of these alone can just block your progress for hours if the mansion doesn't generate enough ways to get them for you to do what you want to do. \n\nOn top of currencies, it's random whether you'll be able to get the combinations of rooms you need to work on puzzles, and random whether you'll be able to obtain the inventory items needed to solve them. Instead of actually working on those puzzles, gameplay turns into constantly building 90% of the mansion (10+ minutes), getting roadblocked by something, and then restarting over and over. \n\nAnd don't get me started on how obtuse some of the puzzles are. You need to make a lot of giant leaps of logic and assumptions in order to solve some of them. Like you see scratches on a desk in one room, and I guess you're meant to go into every other room you can possibly draft and try to relate what you see to them until you guess that you're supposed to click on something slanted the same way as the scratches. The game often gives you no indication that a puzzle is in front of you or if you've found the full solution, because there are several that continue after you get a first reward from them in a way required for the 2nd ending.\n\nGranted, It's not that hard to find room 46 if you get a run with good RNG where you have the proper rooms and steps needed for it. But going beyond that, you're looking at 80+ hours of monotonous gameplay and searching every corner of the mansion if you want to get the 2nd ending without looking up any answers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not nearly enough puzzle-solving for the amount of praying to the RNGesus it requires.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Good gameplay loop, bad puzzles.\nTried every number on the dart board, online dartboard solver also said original number was correct. Still resetting the puzzle.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not run well on the Steam Deck (frame rate) and the RNG can be very painful. \n\nI should have done more research before jumping on the hype train. \n\nI opted for a refund.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Quit right after finding out the boiler room and lab have to be connected by (*&#$ luck, jfc what a terrible game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is the worst kind of rogue-like but with a puzzles.  You might spend 20 minutes on a run that goes nowhere solely because of bad RNG.  There are maybe half a dozen puzzles, but you'll typically do the same 2 before your run ends.  The steps mechanic is also frustrating because it is disincentivizes exploration which is half the point of the game.  You can get to the one obvious goal only to have to restart from scratch because you ran out of steps.\n\nThe only thing less interesting than the puzzles is the lore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game does not respect your time.  The RNG is a huge, HUGE problem.  Locked/security doors can block your progress making you run out of directions to expand, you can run out of resources due to being forced to spend them, or you can simply not draw anything needed for progress through the entire run.  On top of that, each run can take 30 minutes to an hour to complete where half your time is spent walking through the rooms, and there's no guaranteed meta-progression.  There are a few ways of mitigating the RNG but either they take a lot of effort to unlock or are themselves reliant on rarely seen rooms.\r\nI'm 20 runs in, with two major meta-progression upgrades and one minor one.  There are like a dozen rooms I have not seen even once, and I know some of them need to be paired up with other rooms to allow for certain puzzles to be solved.  I feel like I could easily reach day 50 without seeing all of them, and I already feel like I'm trying to chip away at a brick wall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a boring, pointless, and random generated waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Psychotic billionaire leaves everything he has to his heir the protagonist with the condition he finds a specific room in an estate that changes daily for some reason. This billionaire must've hated his heir so much to subject him to endless trial and error, ludicrous amount of randomization to deal with that almost always feels unfair, and countless unsafe living conditions that for all he knows might get his heir killed or driven insane which could possibly be his goal all along.\n\n\nEverything in Blue Prince is so painfully slow, you have to see the same little cutscene at the start of every run, you have to manually take every resource and item as if there's a reason not to pick them up. You have to see the description of what an item does every time you pick it up, you'd think the game would recognize that by the 100th time I picked a shovel I would know what to do with it but no. You have to sprint pathetically slow to the outer room every run instead of automatically being able to select it. You have to do so much pixel hunting for interactables which just isn't fun or engaging to me. None of these would be big issues if this game wasn't a roguelike, as a result you have to deal with all of this combined with the obnoxious gameplay loop.\n\n\nIf tedium was a video game, Blue prince might just be it or at the very least a strong competitor.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game looks pretty, but it plays like a cardboard prop of a game. First of all, you cannot redefine your games (I usually refund every game that fails to provide basic functionality). Second, it requires you to hold a key to move at a slightly less sluggish pace. This is a fake functionality, as it provides nothing to the game. There is very little substance to the gameplay, it's basically a huge time waster with very little to do, and that very little is padded by repetition and reshuffling. Refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has a cool idea but no respect for the player's time.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Chamber of Mirrors needs fixed. Should not be able to trap you in the corner.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "14 runs in and i have some issues. It's a really novel concept to have a puzzle game roguelike but unfortunately this means all the puzzles in the game are often left without all the pieces because you didn't draft the right combination of rooms to give you all the pieces, or it's a small little puzzle that lasts 1 room and gives you some item or upgrade. Otherwise it's just a lot of walking from room to room until you're dealt a few bad hands in a row and you softlock. I like the visual style but the game is just boring. The single room puzzles are simple and boring and the multiple room ones I can't even be bothered to try and solve because I can't know if I have all the pieces needed to solve it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It would be an incredible game if for just one minute didn't try to waste your time with the most malicious RNG and lack of QOL.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Changes I recommend:\n1. Allow me to back away from the drafting options I'm presented so I can find the required gems or maybe some dice to redo my options, don't force me to pick an option just because \"it's draft time\".\n2. Allow saving inside a day (many are asking for this)\n3. Make the Freezer room's effect only happen if I actually step into the Freezer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Minor puzzle spoilers ahead, be warned!\r\n\r\nThis has the bones of being a fun game, but on the whole just disrespects my time too much. It has a lot of really fun and intriguing puzzles that get bogged down by the sheer RNG factor. The roguelike nature of drafting a new house each day is intriguing, but it doesn't feel like there are enough permanent upgrades. \r\n\r\nIn many cases you need to not only draft a specific room, but be able to find three specific items to combine into another item to actually do what you need to do in that room; it just doesn't feel like the player has enough they can do to mitigate the whims of RNG and more than once I was left having drafted a full house and made no real permanent progress. \r\n\r\nI think a journal or quest 'handholding' system for those of us not clever enough to take well-organized notes along the way could be a big help in the 'respecting the player's time' department also. Too often I was left trying to connect dots with only half the dots present, knowing that I had surely seen what I needed to see before but not having taken a good note on it myself. The sigil puzzles in particular are something I could have pieced together if presented with every interactable all at once in a Journal/Database system, but by the time I came across them it was already obvious that I was missing large pieces of information due to my own poor notetaking. \r\n\r\nI did really most other puzzles in the game, particularly the Parlor Puzzles and Dartboard Puzzles. Anything that didn't require obscure bits of information or rely on RNG to line up tended to be quite fun! As it is, then game just doesn't feel like it respects my time enough for me to be able to recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I did not like the incredible amount of RNG in navigating the mansion. This is less of a puzzle game and more of a dice rolling simulator. You are frequently forced to stop early because you didn't draw the correct card to proceed. \nAnother annoying thing is that you cannot save in the middle of a run, each of which can be 30-90 minutes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is about 10% puzzle and 90% roguelight, wich would be fine if it wasn't for the fact that the random mechanic this game is based upon is frustrating. To advance you need sets of room, wich has a random chance to be in your pool for the day, plus certain items that randomly spawn in some room. There is little things you can do to improve your chances from one run to the next, you need to push through and hope you will get lucky and find what you're looking for.\r\n\r\nThe result is a repetitive game with frustrating mechanics. I dont recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is not a good game.\n\nThroughout the entire game, it draws you further and further in with an intriguing story and beautiful art and sound direction. But all of this is the game writing a check it can't possibly deliver, and indeed, it spectacularly fails to do so. With needlessly punishing RNG towards the second half of the game, poor pacing, glaringly obvious mistakes in puzzle design, plot holes big enough to drive a bus through, and the time-tested \"chekhov's gun\" principle being violated more times than I can count, all the way from your first day to your last. The only reason you will want to keep playing after the first 12-ish hours is to find answers that simply don't exist; the broken promise of a satisfying conclusion, which will sadly be my lasting memory of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What am I missing here? The novelty of the gameplay loops wears off after an hour - or the 5th time that you can't progress because RNG decided all the room exits point the wrong way. Or RNG decides you don't get any more room-opening resources. Or RNG decides the one or two items you get per run aren't the ones that are needed later (e.g. a keycard). The \"puzzles\" are also annoyingly convoluted and tedious.\n\nAnd, perhaps worst of all, you cannot save and quit. Doing so ends your run.\n\nI'm not sure what I'm missing that all these positive reviews see, but I'm bored and refunding.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like playing a big one-armed bandit, but when you win, you don't get money but coins to play again and the chance to do a puzzle instead.\n\nYou might be lucky at first; keep winning and solving puzzles.\nBut every time you win, some of the puzzles will take more time to solve.\nThey won't necessarily get harder; they just get more time-consuming and obscure.\n\nAnd after every win,\nAfter every mystery you uncover,\nAfter every puzzle you solve, more wheels might be added to the bandit.\n\nEvery wheel that gets added gives you the chance to get new puzzles to uncover new mysteries.\n\nEvery win, you will get more coins.\n\nEvery win, you need more coins to be able to play.\n\nEvery win the wheels rotate slower.\n\nEvery wheel that gets added will also hamper your chances to win.\n\nAt one point you might solve a puzzle that gives you the chance to play on another smaller one-armed bandit.\nOn that smaller bandit, you can only play once before playing on the big bandit.\nBut that smaller Bandit is in another room.\nGoing to that smaller bandit in the other room will cost you coins.\nGoing back to your big bandit will cost coins.\nAnd all you can win are more wheels, wheels that will be added to your big one-armed bandit.\n\nWheels that give you the chance to get new puzzles to uncover new mysteries.\n\nWheels that give you more coins when you win.\n\nWheels that will cost you more coins to play.\n\nWheels that will rotate slower still.\n\nWheels that will give you the illusion of progress.\n\nWhile you keep running back and forth, the machines will mercilessly eat your coins, keeping you busy while accomplishing nothing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "feels like the story is decent, but the amount of rng and stalling the game does feels very bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has design choices that conflict with each other. It's an RNG based roguelike and puzzle game. Puzzles need to be static so you can actually solve them and the RNG aspects of basically cock blocking you from solving them makes me downright HATE the gameplay.  \r\n\r\nThis game just doesn't work and it leads to a boring and frustrating experience where when it comes to solving puzzles you can't tell if it's you who is the problem or if bad RNG is the problem.\r\n\r\n3/10. This game has an identity crisis with conflicting genres that just doesn't work together.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't give a recommendation without some serious QoL improvements:\n- faster movement\n- faster/skippable animations\n- ability to save and exit in the middle of a run\n\nThe refusal to add these very basic and quick changes can only be interpreted as a lack of respect for the player's time. \n\nUnfortunately the best way to experience Blue Prince is by watching a youtuber play through it with the repetitive animations and backtracking cut out in editing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Much of this game is great, but it is unfinished. I can't recommend it until it is clear that no further updates are incoming. \n\nBlue Prince is a puzzler that is best to play entirely spoiler-free and that takes time to get into, so I can't imagine coming back to it when it is finished will be as fun as playing it in one go in its final state. As it stands, there is no narrative conclusion in any of the endings. Also there are no key rebinding options.\n\nIf the devs finish making the game, I would recommend this game to a people who have time and patience enough to enjoy the game's 10/10 atmosphere while you make less and less progress over time as mysteries get more obscure, who can set a healthy boundary and be happy when they choose to spoil themselves before they run out of patience.\n\nI will try to remember to change this review into a positive recommendation if and when the developers actually finish it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No ultrawide support. Disappointing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cannot save during run, otherwise i would have recommended it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "RNG and puzzle do not go well together.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Seemed interesting at first. But after a few hours my progress was getting slow and frustrating. it seems there is a lot of luck. And the effect of bad or just average luck its pretty drastic. You keep having to repeat similar things many times until you get lucky. I did not manage to find any strategy that enabled more predictable progress or minimised the time I was wasting. This got very tedious and I gave up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nothing I found in this game made me want to keep going. Manage to build a path to the room you're clearly supposed to get to? Nope! Can't get in. How do you get in? You keep playing randomly until you get lucky enough to see the one room that has a note telling you how to do it. Alright, so I need to find levers to open the path to the last room, got it. Where are these levers? No clue. How do I find them? No clue.\n\nHey there's some stuff outside that's locked, one needs a code. Where might I find this code? Well it turns out you need to have a run where you find two specific rooms as well as a specific item, and then use that item on one specific place. How do you know to do this? No clue.\n\nHey I keep finding these car keys, where do I use them? No clue. There's no car outside so I assume there's a room  somewhere they work in? I've never found this room, so the keys are pointless. Likely when I finally find this room, I won't have the keys for it.\n\nOh cool, I found a room that lets me order an item! Well there's a blocked door outside so let's see if the Sledgehammer works! Oh but I can't get the sledgehammer I've ordered because, you guessed it, it's apparently in a room I've never seen.\n\nAnd that's the core problem with Blue Prince. It presents things you know you need to solve and then refuses to give you the tools to solve it unless you get lucky, while also not giving any hints about where the solution might be.\n\nI want to progress these things! I feel like I have ideas on how to solve some things! But the game just crosses its arms and says \"Nuh-uh, you can't do that this run.\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pls add Saving feature during game!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No i am not sorry why would a puzzle game have rng",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you run like my grandma. snail/10 would not play again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "im not smart enough for this game :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "World's greatest tedium simulator.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cuck simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Suckers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blue Balls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Blue Prince makes a strong first impression: the mansion’s moody aesthetic, clean UI, and a soundtrack that sets the right tone. It looks nice enough. But after a few hours, the veneer wears thin and the design decisions start getting in the way of the fun.\n\nI couldn’t see the point of the randomly generated room. It feels like noise rather than discovery, adding friction without meaningful surprise. Worse, the daily reset seems unfair and fruitless to continued exploring of the mansion; progress evaporates, momentum stalls, and you spend more time retracing steps than uncovering anything clever. When a game’s core loop is “explore → learn → build on what you learned,” clearing the board each day undercuts the whole appeal.\n\nThere are flashes of charm—occasional puzzles land, and the mansion’s layout hints at a deeper mystery—but the systems rarely cohere into a satisfying rhythm. The result is a beautiful house with too many locked doors and not enough reasons to keep knocking.\n\nVerdict: Stylish, but structurally fussy. Not worth the RRP. If you’re curious, wait for a deep sale; if you’re here for sustained exploration and payoff, there are better mansions to get lost in.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gallery",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}