{
  "positive": [
    {
      "review": "An updated version of the first game that really needs more UI colors on buttons etc. Not everything should be shades of blue.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "It's a good game, don't get me wrong, but the devs know what people love about Sins: Rebellion and stuck with it. That is to say, mods. Most of their updates have been focused around modability and such, and while they have done a good job of balancing things so that their game still has its own unique identity rather than only being a vehicle for some of the greatest RTS mods known to man, you are going to be missing a large part of the experience simply due to the fact that the majority of the sequels to the biggest mods from SIns: Rebellion aren't out yet (Sins of the Prophets II, my beloved).\n\nWith all that said, I still do recommend the game. With the upcoming update to Diplomacy, I expect that the game will be a straight upgrade from Rebellion. And again, I can't overstate this enough, it's not like the base game is bad by any means. And there are some mods out already. If you want, you can wait for the game to have a bit more time in the oven, but I'd say that it's well done as is.\n\nThe previous paragraphs were directed at those coming from Sins: R. To anyone new: if you like 4x games and RTS games, this game is a definite yes. Keep the difficulty set low though, the one flaw this game has (at least to me) is the difficulty can be a bit wonky. Or maybe I just haven't played in a while.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "S-Tier Game\nIncredible upgrade from Sins 1, beautiful graphics, phenomenal gameplay.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "No more lagg with large fleets in late game, absolutely beautiful graphics and sound design and a lot smoother gameplay compared to Rebellion.\r\nTHe only downside I'd say is that the UI is worse in giving you a good overview over your planets and fleets. But that might change in time or with mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game if you enjoy taking worlds and armys on to see who's strategy is the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sins of a Solar Empire II is a truly worthy successor to Sins of a Solar Empire: Rebellion and carries forward the strengths of its predecessor in an impressive way. \n\nThe graphics have been upgraded without losing the series’ distinct style. The detailed ships and dynamic battles are particularly striking. The refined economic system and deeper diplomacy options offer greater tactical depth without becoming overwhelming. Only thing is, that you need to buy the DLCs to enrich the game to become a full game.\n\nVeterans will feel right at home, while new players will quickly find their footing thanks to improved accessibility. Each faction plays uniquely and rewards strategic thinking—exactly what fans have always loved about the series.\n\nIf you love epic space strategy games, you should try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has been very fun so far. the karrak missle spam is a little much but overall fun game esp with mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "while i do enjoy vanilla gameplay, as the base game is great, add some mods and the game is phenomenal. I love playing with the RRR mod, and it has added so much more to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked the first game, you'll probably like this one. Good strategy game overall and one with huge modding potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a great space game. wish they had more single player features though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graghic and smooth gameplay. Still waiting the dlc 4th faction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Following the massive success that was Sins of a Solar Empire: Rebellion, Ironclad Games finally present us with a long awaited sequel to the much beloved game.\n\nBuilt on a new engine, Sins II brings a new era of 4X gaming with huge modding potential. I look forward to all the mods that will be released for this game in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with better graphics. DEV mode needs some guidance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sins of a Solar Empire II takes everything that made the first game great and turns it up even higher. The scale is huge, the space battles look incredible, and the mix between real-time strategy and 4X gameplay feels smoother than ever. You can manage entire star systems, build powerful fleets, and watch massive fights unfold with zero loading screens. The factions feel unique, the pacing is perfect, and every match feels like a full galactic war.\n\nIf you love strategy games or giant sci-fi battles, this is absolutely worth playing. It’s already fun now and only getting better.\n\nA must-have for RTS fans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game, but I want to like it more than what I do.\n\nThe good: Absolutely amazing not hitting a CPU bottleneck like in Sins Rebellion (which in fairness was the technology of the time), all the added animations / moving turrets / etc. look great. I like the new exotic elements as a straightforward way to add a little complexity.\n\nThe middling: I miss the more straight forward/simplified management of planets/ships/economy that Rebellion had. Metal/crystal gathering was much more straight forward when you just were dealing with asteroid mining and not also planetary mining. I dislike the added micromanagement of putting different buildings on planets and upgrades in ships.\n\nThe bad: It is harder to get friends I used to regularly play Rebellion in here to play because of the added micromanagement they don't really want to dive into learning, and I fully get it. It's 13 years after Rebellion released, we all have much busier lives with limited free time.\n\nThe suggestion: Add a \"classic\" game mode that takes away the added complexity of ship/planet management and is a closer experience to Rebellion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Easy to understand and fun as heck. I tried to play stellaris and its has to much mirco mangement in it, I know there is a group of people out there who would enjoy it but its not fun for me. Sins is my jam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A few familiar things but so much tweaked and so much new. The challenge of the planets moving is unexpected but very welcome. Expand fast if you want to have what you need to build up a real fleet and give yourself a chance. Otherwise, very fun and just complex enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I rarely rate games, but this is a really good game. If you like Sins of Solar Empire you will like this game too, as it is an improved version of the first game.  It is much more challenging as you can't camp anymore behind strong defenses as phase lines move and intersect, so you really need to plan your game well, especially placement of your fleet and defenses.\nIf you haven't played the first game you will like it too most likely. Space battles look amazing here, I have spent hours watching them and scenery and making screenshots. Game itself can be challenging on higher difficulty, but if you want just to watch space battles and develop your emprie slowly, you can play on easy. \nSo all in all it is a solid 4x space strategy, quite rare in our times. I can name may be 3-4 good 4x space strategy that I know, Sins is one of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coop is fun.\r\nThe two Expansiosn were fun.\r\nExited what the allready announced future DLC bring.\r\nHopefully in future it will be good plattform for diffrent mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has amazing graphics, great sound design and interesting game play. If you've ever played the first Sins or are just a fan of strategy games its definitely worth checking Sins 2 out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is nothing like the first game small number of planets so the game is boring your not going to get alot of ships it less the the first game your not going to be geting alot of star bases the new exotic metals for most things you will wont so frigates will be your only ship in the game mods for the game to download and use the mods you must subscribe like youtube",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the better space RTS games I've played in a while. each faction feels unique and fun to play, the economy isn't too overly complicated and the maps feel dynamic with the orbiting mechanic. But for me personally, the biggest potential of this game is realized in its mods. I had a game that lasted 20 total hours that was a 6 way free for all battle of sci-fi with the galactic empire, the union from the orville series, starfleet from star trek, the ancients from stargate, the wraith from stargate, and babylon 5. \r\n\r\nI highly recommend this game if you're a fan of RTS games, especially space RTS. the core vanilla game is very fun, but with strong modding support and a passionate modding community, this will no doubt be the best game to play with all your favorite sci-fi factions. \r\n\r\nI beg of you modding community, please put out a halo mod. I wish to pit the covenant against the empire.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Change the background music from something in youtube while playing the game, it'll make it better!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the Sci-Fi strategy game I've always wanted. The mechanics are clever and the game has so much depth to it. It's not your basic rock, paper, scissors RTS. Plus, mix in the 4x element and you have a highly enjoyable and challenging experience. \r\nA+ \r\nPS. I never review games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed Rebellion, especially with mods. This game is so much better in just about every way:\r\n\r\nGraphics (obviously)/ability to have actual hard point arcs/no lag or slowdown in MP (so far) because the game is old/no more memory issues (using too much for the game to handle) causing crashes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easy to learn to play. Hard to master at higher levels. But fun the entire time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More Sins of a Solar Empire with better visuals and other stuff... What else is there to say?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is good I guess. I have just grown up from games like this. Don't have hours upon hours of time to seat and play such games anymore.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice complex and complete RTS. Rare these days!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playin SoSE since the first one, love this game, so hard to find good RTS games nowadays",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "please fix the random crashes I can't play without it crashing randomly it can be at any random time and yeah it saves quite a bit but its far to common to crash on a high end pc on a ssd drive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing Sins for years its a staple in my video game arsenal. Love this game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It only took a decade for them to make Sins of a Solar Empire 64 bit. \nThat's all I ever wanted.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "they could change the usage of logistics points on the mines but other than that its fine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Make ships. Conquer stars. Eat planets. What more could you ask for?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A significant upgrade from the first game, both mechanically and graphically. Though I am eager for the campaign to release.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love this game its basically empire at war meets hoi4 and its amazing highly recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall great RTS game. Has regular DLC updates and consistent updates. Replayability of game is truely awesome!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a solid incarnation of the SoaSE formula. Sleek and smooth, but still deep an complex.\r\n\r\nMy copy was a gift from someone who wanted more people to play it with.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A worthy successor to the original SOASE trilogy!\n\nThe game is still getting active updates post 1.0 and free content updates in addition to DLC content updates.  The game runs smoothly and graphics are beautiful.  The game has excellent new mechanics worthy of a v2.0 moniker!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SOSE II builds on everything that made the first game great. A roster of 3 factions that flavorfully differ from one another. Great looking smooth running battles with hundreds of ships. The empire management is straight forward to keep the focus on battles, and the whole game is wrapped in one of the best and most usable UI's in the genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the better RTS's out there. Gameplay is challenging, yet rewarding. A lot of fun to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fantastic sequel to the Sins of a Solar Empire series. If you like the first series you will love this game, this is what Dawn of War II should have been. The tweaks that were made have really fit, and as such, the developers should be commended.\r\n\r\nHowever, if you weren't a fan of the Sins series, this game really isn't for you :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, really enjoy the pace of the game. Graphics are so incredible.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is what sequels should be. Imagine if every sequel out there was done in the way Soase2 was done?\r\n\r\nI put over 600 hours into Soase1 throughout the past decade and it remained one of my top 3 strategies despite the lag issues lategame and its age. It captured the beauty and sheer size of what I always thought galactic multi-civilization warfare and colonization would be like.\r\n\r\nSoase2 took what Soase1 was, and just made it better in many ways. I have no idea how the developers did it, but they managed to make this game include MORE while having no lag. As of right now, I have played up to the second-last supply setting (which increase the supply cap of military) and I haven't seen ANY lag, anywhere. This is absolutely unbelievable. There were teeny hitches lategame when I had a 3000+ supply fleet attacking a starbase and I zoomed all the way in to see the carnage. This is more likely my PC than the game, but it just goes to show how well the game handles. 10/10 job on performance.\r\n\r\nCapital ship/titan abilities seem streamlined to me, making more sense and being more unique to the ships. The ship/planet item system was something to get used to but now that I've put 60 hours in, I love it! I think it is a fantastic way to change up the late-game building by offering the player different ways to customize a planet. Do you want to focus culture because you just invaded a new star system? Or do you want more focus on metals/crystals for your economy? Or maybe you want more trade? Soase1 pretty much had no flavor in this area and I found myself building the exact same things on my planets, no matter where or what they were. Soase2 has really completely changed that for me and I am loving it.\r\n\r\nIf you enjoyed Soase1, you will absolutely love this game. It is beautiful, runs amazingly the entire playthrough, has diversity in choices, great customization throughout... all while holding onto the magic that made Soase a truly one of a kind game.\r\n\r\nWell done. This one makes me wish I could do more for it than recommend it and review it. Let this be a standard for every sequel ever made from this day forward. Just buy the game and have fun. : )",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game, very fast paced...i hope they improve diplomacy and make it easier to add orbital structures spaced out appropriately, other than that it's great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like deep strategy games, but want a faster pace than some other options, then this game is for you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun game and much better than stellaris",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable, but not very deep.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than the first game overall.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game makes me not wanna sleep :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "First game rocks Second game no words",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It just works",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good sequel",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a worthy successor",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesome game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its Sins enough said",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am a long time sins fan, and I really like what Stardock did here. \n\nA lot of games focus on adding features, but don't take the time to make sure that the game is performant enough to be playable, especially in the late game. Stellaris is an example of this: tremendously fun, but with serious late game slowdowns on large maps.\n\nThe problem is that making your game more performant takes time, and means shipping fewer features, at least at first. (units, maps, gameplay mechanics, etc)\n\nWith sins 2, they really took the time to make sure that the have a powerful, fast, multi-core game engine, and it shows. My 10 year old computer has never had any drops in performance, and the game looks beautiful. I especially love the animations when weapons fire impact shields.\n\nFor fans of sins1 who are into modding, this isn't just sins1 with better graphics. The old sins1 engine was 32 bit, and IIRC, single threaded. There was a very perceptible limit to how many mods you could run, and how many players and ships you could have. The new engine largely removes that limit. You can really go big.\n\nWriting a performant, multi-threaded game engine is a very difficult thing to do well. For example, the Factorio devs found that without rewriting a significant chunk of their engine to use custom allocators, false sharing would actually cause the game to run slower multi-threaded than single threaded for it's main loop: https://www.factorio.com/blog/post/fff-215 . (Unfortunately, I don't have similar blog posts from Stardock explaining what exactly they multi-threaded or optimized, but it seems to work well in practice)\n\nThe developers were also very forward looking when it comes to modding. Sins 1 had a custom config you'd have to learn or parse to make changes. Without the right tooling, (which you probably didn't have), making large scale changes was hard. This is very common, with Stellaris also having it's own custom configuration language. I wound up writing my own parser just to do data extraction for modding it.\n\nIn sins2, all of the configs are just JSON files! There are excellent parsers available for JSON in just about every programming language, and lots of command line tools. It is so much easier to make edits, or write scripts to make the edits for you when a new version of Sins 2 comes out. The very readable and copy/pastable errors you get on game startup when you mess up are also very appreciated.\n\nI really hope that now that they've added such a solid, fun, and playable base, the devs are well positioned to continue expanding this awesome game, and squashing any remaining bugs. Also very excited to see what the modding community does with it.\n\nI didn't mind paying more to get the campaign. With the amount of passion that they put into the engine, I'm optimistic that it will be good.\n\n(Sorry for picking on Stellaris a bit in this review. It's an awesome game as well.)",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "While it's overall good, I have a huge problem with the main game loop, that being that by the time you get to mid game, every planet and location from the AI empires, even on easy AI all have star bases at EVERY location, taking each one down is time consuming and costs a lot in ship units that end up getting sacrificed, now this occuring at key locations would be fine but at all locations is too much, this forces the player to abandon all tactics and just mothball a fleet with max supply to take out each location one at a time, basically dumbing down all tactics to just this one move ...",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "this is an amazing game i have over 1,200hrs in rebellion this has the same voices and is just a fancy upgrade slapped together with a boat load of AI. Now don't get me wrong it is still a fun game but it is not even a contender to the raw power of rebellion. sins 2 lets you have a much bigger war and fresh looks if you like AI stuff. but the mods you can get in the OG are 1st off... MORE 2nd we got them all HALO, STAR WARS, STAR TREK and much much more. this sins has a STAR WARS one and my god is it nice but with the options on the OG well it's up to you at that point. now i say get them both you learn how to play one of them you'll do good in the other the UI is a little different but not so much you can't figure it out with ease.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "As good, if not better than the first one.\nIts only flaw IMO is that the DLC does not represent value for money.\n\nEdit. I would like to add that if your playing multiplayer that only 1 player needs to have the expansions. Any play who joins their server/hosted game will have access to the additional content that they own. That adds a good bit of value to the group IMO.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I'm new to space strategy games and felt like this was a great introduction. All of the tutorials available helped me understand the mechanics enough to enjoy trying out a new game style. I even had an issue with the game at first and a member of the team was kind enough to troubleshoot with me. I'm excited to play more.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Sins of a Solar Empire II is a great modernization of the classic. While it doesn’t reinvent the formula with a ton of new features, it refines and streamlines nearly every part of the experience, making it the best way to play the series today.\n\nThe new research tree is a big highlight, it’s much more intuitive than before and opens up some genuinely interesting strategic paths. Planetary orbits also add a unique layer of planning, for example, you can no longer just build static defenses and forget about them, instead, you need to anticipate planetary movements and adjust your defenses accordingly such as remembering to rotate the structures around the planet. This subtle change really keeps the late game dynamic.\n\nModding support remains a strong aspect of the game. It’s easy to experiment with, and mods can dramatically extend replayability. The downside is that frequent updates can break mod compatibility, which is a bit frustrating for long-term players who rely on community content.\n\nOn the technical side, the visuals are gorgeous. Fleets look spectacular in large battles, and planets and environments have much more detail than in the original. Performance has been excellent on my high-end PC. I haven’t run into a single issue so far (excluding mods), even in large-scale engagements. It’s clear the engine has been optimized for modern hardware, which makes the experience smoother and more immersive.\n\nOf course, the core gameplay loop is very familiar if you played the first Sins. This isn’t a radical sequel, more of a refinement, but the improvements in usability, visuals, and performance make it worthwhile.\n\nOverall, Sins of a Solar Empire II feels like a confident step forward for the franchise. It’s a strong foundation, and I’m really looking forward to seeing how the game evolves with future DLCs and expansions.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "One of the most amazing and emersive games there is. I loved this and homeworld as a kid, but homeworld 3 is a MEGA MEGA MEGA disappointment, and SINS 2 is an incredible continuation of the first one. Must have game. Worth every penny.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Good sequel to a great game. The devs keep improving the gameplay, content and adding mechanics.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This is THE definitive edition in the sins franchise, if you are interested in trying out this series this is the one to get.\r\n\r\nSome people say that rebellion was better and I have to ask if they played the games back to back because rebellion was nearly unplayable compare to Sins 2. They have completely overhauled the UI and it's so much better to control your fleets and planets while upgrading them to what you need specifically.\r\n\r\nOther people are also say that the price is too high but really, your getting all of the dlc from rebellion in the base game, sure you can make an arguement that some of the dlc isn't worth the price but the core game is still worth it in my opinion.\r\n\r\nOverall this game is worth it for anyone look for epic space battles with unique and balanced factions.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "It's a good game, don't get me wrong, but the devs know what people love about Sins: Rebellion and stuck with it. That is to say, mods. Most of their updates have been focused around modability and such, and while they have done a good job of balancing things so that their game still has its own unique identity rather than only being a vehicle for some of the greatest RTS mods known to man, you are going to be missing a large part of the experience simply due to the fact that the majority of the sequels to the biggest mods from SIns: Rebellion aren't out yet (Sins of the Prophets II, my beloved).\n\nWith all that said, I still do recommend the game. With the upcoming update to Diplomacy, I expect that the game will be a straight upgrade from Rebellion. And again, I can't overstate this enough, it's not like the base game is bad by any means. And there are some mods out already. If you want, you can wait for the game to have a bit more time in the oven, but I'd say that it's well done as is.\n\nThe previous paragraphs were directed at those coming from Sins: R. To anyone new: if you like 4x games and RTS games, this game is a definite yes. Keep the difficulty set low though, the one flaw this game has (at least to me) is the difficulty can be a bit wonky. Or maybe I just haven't played in a while.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "An updated version of the first game that really needs more UI colors on buttons etc. Not everything should be shades of blue.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "One of my favorite games from my formative years, expanded. This game makes a nice line between deep and challenging tactical decisions and ease of entry for newer people. A confident medium on that scale. The developers are constantly making meaningful expansions to the game (paid) with some decent free updates as well. On the RTS scale I'd give this one a 8.5 / 10. It's not changing the genre but it is a great brick in the wall.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "If you like RTS, space, and colony sims, you'll probably like this game. \nIts beautiful with huge space views, great ship detail, and excellent portraits/event cards. It almost has a board-game feel to it; and like a board-game, there is a LOT to it. It can easily be over 30 minutes just to go through the tutorials (which are actually well done and easy to follow for those of us not as well-versed in the strategy game genre).\nA lot of the gameplay is pretty intuitive, or will tell you whats up, and most importantly its slow paced - so you can take your time learning and strategizing (or if you feel confident, speed the whole game up since it lets you do that too).\nI would absolutely recommend this game to anyone who likes strategy games or even just some good space exploration sci-fi!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great strategy game. Lacks content, but hopefully devs will add more.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Awesome game following on brilliantly from its previous versions with challenging AI that fights right until the end. Cannot recommend more highly.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you liked the first, you will like the second - it is the same game, only it looks and feels much better, and the factions have added depth. The game does use AI art for the research icons and other bits of static art, but its not like you spend long looking at those images - I'm sure I read somewhere it was only fed art that the team had made but I don't know. \n\nIf you want a space RTS with large fleet battles and outrageously villainous alien voice lines, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "tutorial's helpful, there is alot of tech lines to go for different builds overall pretty fun lots of different builds",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a great game and has the spirit of the games in the old days. crisp graphics that are amazing, game play that keeps you entertained for hours, and smooth game play that has no hicups.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Good game! Long way to go, comparing to the content available on the first game, but so far Devs are delivering.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "although there is currently some stuff not implemented from Rebellion, the in game mods and all the massive quality of life changes make it worth it in my eyes. ive always loved sins and what the modders have done with it is fantastic.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As a long time player of Rebellion, I have found Sins 2 to be an overall improvement to the formula I already loved. My only regret is that I haven't had as much time to play as I would've liked!\n\nFleet management is the biggest improvement for me, followed by the customization allowed by capital ship/starbase items.\n\nI recommend to anyone who enjoys RTS or space combat!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Sins of a Solar Empire is one of those rare strategy games that successfully bridges the gap between real-time strategy (RTS) and 4X (explore, expand, exploit, exterminate) gameplay. Developed by Ironclad Games and published by Stardock, it's a space-based epic that delivers both the thrill of tactical battles and the depth of long-term empire planning and it does so with remarkable finesse.\n\nFrom the very beginning, you're plunged into a beautifully realized galaxy, filled with rival factions, uncharted planets, and endless possibilities. The game's hybrid approach allows for massive real-time space battles with dozens of ships on-screen while simultaneously managing diplomacy, research, trade, and expansion. This makes every match feel like a living, breathing galactic saga.\n\nOne of the game's standout features is its scalability and pacing. Despite being real-time, the game never feels rushed. Players can pause and issue commands, making it accessible for those who are used to turn-based strategy games, while still offering enough speed and action to satisfy RTS veterans.\n\nThe three unique factions TEC, Advent, and Vasari each offer distinctive playstyles, technologies, and aesthetics. Whether you prefer brute economic force, psychic warfare, or high-tech hit-and-run tactics, there's a faction that will suit your strategy.\n\nGraphically, while not bleeding-edge by modern standards, the game still holds up beautifully thanks to its clean UI, expansive space vistas, and well-designed ship models. Watching a fleet warp in and unleash hell on an enemy stronghold remains a visually satisfying experience.\n\nMultiplayer and modding support have also given the game remarkable longevity. There’s a vibrant community around it, and countless mods  including total conversions  that breathe new life into the game long after release.\n\nVerdict:\nSins of a Solar Empire is a genre-defining strategy game that rewards both tactical thinking and strategic planning. It’s epic in scale, deep in mechanics, and endlessly replayable. For anyone who dreams of commanding their own space-faring empire, this game is an absolute must-play.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "very fun 4x and rts combo. great performance, keeps getting better with updates.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "No more lagg with large fleets in late game, absolutely beautiful graphics and sound design and a lot smoother gameplay compared to Rebellion.\r\nTHe only downside I'd say is that the UI is worse in giving you a good overview over your planets and fleets. But that might change in time or with mods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "S-Tier Game\nIncredible upgrade from Sins 1, beautiful graphics, phenomenal gameplay.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "As a newcomer to sins of a solar empire and a Stellaris fan, this is exactly what I was looking for. Its so smooth, there's a lot to sink your teeth into and after a few tutorials it was seamless to get a hang of. \r\n\r\nAlso mods are always a good thing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Massively improves on aspects that the first game lacked, made the process of playing the game and micromanaging less stressful + more streamlined and convenient, battles look and play better and diplomacy is better, everything looks great on the new engine.\n\nSo far the modding community has popped out star wars and stargate, once more mods come out for this game we will be eating GOOD\n\nHowever, main negative thing here is the use of AI art",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a big fan of 4X games, and Sins of a Solar Empire II is one of the best out there. The building, economy, combat and sheer scale of the maps are top-notch. At first I was not really sold on the real-time gimmick, I usually prefer my 4Xs to have turns, but here it is masterfully done. Not only that, but not having different screens for the various levels of zoom is just so fucking epic - the transition from the full-blown galactic view, where you can view all the planets and hyperspace lanes, to a single ship in combat is so smooth and well-done.\n\nDevs continue to support and add features, DLCs seem fun and I plan on getting them, so I have absolutely no complains about it, and think this deserves to be paid in full.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok so…here’s my overall thoughts. Solid game a lot of what made sins a great game. Gripes though is the extreme lack of adjustments (UI, graphics, certain gameplay aspects (double click to select all ships of a certain class), pregame changes for gameplay (unchecking super weapons) and the map editor.) \nIt feels very unpolished is certain aspect compared to the previous game. (A 16 year old game somehow being more polished feels wrong) never the less it’s still solid. I recommend it maybe 55/45.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game if you enjoy taking worlds and armys on to see who's strategy is the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sins of a Solar Empire II is a truly worthy successor to Sins of a Solar Empire: Rebellion and carries forward the strengths of its predecessor in an impressive way. \n\nThe graphics have been upgraded without losing the series’ distinct style. The detailed ships and dynamic battles are particularly striking. The refined economic system and deeper diplomacy options offer greater tactical depth without becoming overwhelming. Only thing is, that you need to buy the DLCs to enrich the game to become a full game.\n\nVeterans will feel right at home, while new players will quickly find their footing thanks to improved accessibility. Each faction plays uniquely and rewards strategic thinking—exactly what fans have always loved about the series.\n\nIf you love epic space strategy games, you should try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has been very fun so far. the karrak missle spam is a little much but overall fun game esp with mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "while i do enjoy vanilla gameplay, as the base game is great, add some mods and the game is phenomenal. I love playing with the RRR mod, and it has added so much more to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked the first game, you'll probably like this one. Good strategy game overall and one with huge modding potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a great space game. wish they had more single player features though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graghic and smooth gameplay. Still waiting the dlc 4th faction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Following the massive success that was Sins of a Solar Empire: Rebellion, Ironclad Games finally present us with a long awaited sequel to the much beloved game.\n\nBuilt on a new engine, Sins II brings a new era of 4X gaming with huge modding potential. I look forward to all the mods that will be released for this game in the future.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "A good upgrade to the first game -- but uses AI slop to an absurd degree. Almost feels like no humans were involved in the development, at least artistically.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "I'm fairly mixed on this one but sadly I cannot recommend the base game for full price. The base game doesn't add enough content. What are the main new features?\n\n1. Orbits - Cool new feature\n2. Empire management via customising planets and ships. Long sought feature of the original finally added.\n3. New exotics resource for building capital ships.\n\nThose are the three big ones for me. Everything else is too similar to the first game and makes Sins 2's base game not feel different enough to warrant buying it. I am a casual player of the original. Maybe more competitive players will enjoy this one more than me but they will also be the ones most likely to buy all the DLC which would most likely make the base game worth it if you had those. But I am not buying DLC just to make the base game feel like a worthy sequel.\n\nObviously there is a huge visual upgrade and I appreciate that but there needs to be more features in the base game to attract more casual fans but I guess we aren't the target audience\n\n(To the people giving me jesters, thank you for the points)",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "pretty good sequal, but the ai art is really distracting",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, having come back to this a couple times, I can't recommend it. This feels like a shallow reskin of the original games with a couple of mechanics like new capital resources shoved in. I'm a big SoaSE fan, been playing for a decade now, but it's the same game with rotating gravity wells--you might as well get SoaSE:Rebellion and you'd have a game with just as much thought and effort put into it, but with slightly older graphics. It's pretty telling that you could trick me into thinking this is a mod for the first game, and that's disappointing.\n\nNot worth the upcharge. Get an older game for the exact same experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hard is to easy, and the difficulty after that the AI gets more cheats than iv seen in any game since i started playing strategy games 30 years ago. Super lazy by the devs imo.\n\nAlso, once one players, AI or human, snowballs, the snowballer win, human nor AI can come back, makes the gameplay very boring after a few games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Refunded when I saw the absolutely atrocious AI art work, don't care, AI is only made to take jobs and money away from people to put out a shitty looking product",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "AI art really kills the vibe for me. It's getting easier and easier to detect when it's used and I can't unsee it. A lot of the charm of the original is lost due to this kind of laziness.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TL:DR This is just a war game in space, shallow and much simpler than Galactic Civilizations or stellaris etc. This whole game could be a mod in their Galactic Civ 4 game.\r\n\r\nFirst things first, this is a good game. A fully fledged well polished game. There is a single great innovation for the genre in this game, planets rotate. You thought you could build defensive structures on this choke hold of a planet and neglect all the rest behind it? Think again! That is truly awesome! There is an element of surprise and unpredictability in this element which keeps you on edge. The ships designs are awesome aesthetically and the fleet management is awesome! The game is easy to master. And that's with the good stuff about this game. \r\n\r\nNow I will try and provide some constructive criticism. \r\n\r\n-PREMISE. The game is simple. Just conquest stuff. Build your fleet and conquer. No real exploration no feeling of dread or mystery of exploring the vast unknown space. No random events, not even scripted events. Neutral factions are just some dumb AI that mostly work like space merchants. It's just you and some other players trying to figure out who is the bigger dictator. \r\n\r\n-RESEARCH. The research tree. Almost meaningless. For the the first few hours I was paying attention and then I was like \"just queue all of them and I will figure out later the benefits\". Research felt unimpactful because most of the times was some equipment that could be loaded on one of my capital ships. Guess what, you can only have so many capital ships because of supply limit so what is the point of having SO MANY equipment choices for your ships and the same goes for your planets too. You just figure out which items fit your playstyle and your empire's needs and go with them. \r\n\r\n-RESOURCES. Don't worry about resources. It's just two basic resources that can be found in every asteroid/planet. There are of course rare resources but you can build them later on. As for money you only need to worry about it the first few hours. Seriously once you figure out the basics and own about ten colonies you don't have to worry about resources anymore. Because no matter how vast your empire is THERE IS NO UPKEEP. So I can build TWO starbases in every single one of my colonies and not get taxed about it?\r\n\r\n-SHIP/FLEET DESIGN. 4 types of frigates and 4 types of cruisers that I don't fully understand what their role in battle is. After a while some of the ships felt like more durable than others so I kept building them. Seriously there is no strategy involved or there is no sufficient explanation of it. Just don't waste resources in planet bombers, useless ships. They don't engage in any way in fights, your fleet is getting obliterated and they sit back relaxed bombing the planet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have not seen such cheating by the AI in all my life. I had a fully upgraded fleet at 2000. Yet the AI blew through my fleet with no problem. I would not recommend this game to anyone. Unless you are a glutton for punishment,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy unless they add a 4rth Race or something that makes this better than the 1st game...Honestly i see no difference except a small graphic change.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The AI generated UI elements are so jarringly ugly it makes me not want to play",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "AI slop art is overused and atrocious.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "lots of tutorials, not a bad thing, but wow. \n tech tree is overly cluttered and stupidly similar colors for everything, not good for us color blind folks, but i made due.\nthe only thing separating this from the origional is updated graphics and a celestial body movement mechanic.  \n add that movement mechanic to the origional game, and poof, you have this.\n\ncant recommend it in good faith.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game, uses ai art.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ai art galore. to the point of it being distracting",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "THIS DOES NOT WORK ON STEAM DECK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix the tech tree art its awful.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Need Work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Solid mechanical basis undermined by ignoring the UI/Aesthetic. AI Art in particular sticks out to me. I'd love to put more time into the game but one of the things I loved about 1 was that the art was simple, but evocative. When I'm getting a game to play solo I'm looking for something that looks and feels interesting. Rebellion's design made me imagine things around the game rather than just focusing on the mechanics. All I feel in Sins 2 is mechanics. \n\nAt best I would describe it as competent but soulless, which hurts for a series I dumped hundreds of hours into because it had soul.",
      "voted_up": false,
      "votes_helpful": 117
    },
    {
      "review": "I'm mostly disappointed in the AI. They keep forgetting large parts of their army to never ever move them again for the rest of the game effectively playing without several hundreds supply worth of units.\n\n They also often get their entire armies stuck in a gravity well, most often a sun for some reason, when their enemy has garrison planet augment that trickles in units one by one. I've seen 5 AI have all of their maxxed armies stuck on a sun killing straggling garrison ships while the rest of their empire gets picked apart for free.\n\nYou can only give the AI 2 \"personalities\" in this game, aggressive or defensive.\nIn the first game you could also choose economy focus or research focus.\n\nThere are also still missing capital ships from the previous game which will probably return in a 15$ DLC... ehhh not really sure this is an upgrade from the first game.\n\nI do think performance is better in long and large games though so that's one positive.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "This is somewhat tough, as on paper in a mechanical sense, Sins of a Solar Empire 2 is a GOOD sequel. It follows the design philosophy that a sequel should be more of what you like, but iterated upon. Planet management has a deeper scale to it, fleet compositions are less spammy, and faction differences (Aside from the loyalist/rebel unique techs) are more complex.\n\nControlling and managing multiple fleets feels more streamlined and less granular without losing complexity, and early game exploration is heavily rewarded. Queuing researches and build orders is easily done and altered. It is a GOOD sequel. If you liked Sins 1, you will like Sins 2. \n\nHowever, what is a terrible shame and an absolute travesty is the sheer amount of AI generated images in the game, and something I cannot condone supporting. Especially when the first game had so much charm in it's programmer art and colored concepts.\n\nOnce noticed- it's impossible to look past. At first the Balenciaga stare on some of the portraits- then that odd uniform light shading. The constant tilt shift on anything that's supposed to look granular. Odd, in-congruent positioning and posing in images where figures are supposed to be interacting with each other. Figures staring at the camera and screaming. That telltale 'figure standing in front of a bulbous space ship' that doesn't match the design of the rest of the game.\n\nThe portraits you select when in the set up lobby have lost all of their unique charm. Sure- there's more of them, but what's the point when they all look vaguely the same? Thirty nearly identical portraits will never be better than 5 filled with personality. Even the in loading screen 'ads' for upcoming DLC's have a clearly AI generated figure within it. (Look at the eyes of the green eyed woman in the paths to power DLC banner.)\n\nThe UI is too clean, some of the buttons do not look like buttons. It is serviceable, but lacks the gritty charm the original had. The steam page states that: \"This game used AI to help quickly iterate through designs for some UI elements using our own artwork as a baseline. AI is also used to help translate the game.\"\n\nAnd this feels like a lie. The UI design does not feel iterative- and the amount of AI images used when you supposedly have an artist on payroll just screams 'We only wanted to pay them for a quarter of the work we wanted done.' \nIf you have an artist, you have an artist. And even then, quirky programmer art will always be preferable to soulless AI generations.\n\nOne also has to wonder if some of this AI usage affected the visual designs of the ships themselves. Why did the Advent lose nearly all of their nautical theme?\n(The hangar defenses- for instance, are now just wedges, rather than evocative of sea shells.)\nWhy did the Vasari ships lose their insectile appearance?\nWhy do the turrets on many of the TEC ships look like they were tacked on as an afterthought?\n\nWere these conscious decisions from a person, or- did an AI simply smooth out the edges without understanding why those notions were present?\n\nIt's questioning like this that makes it hard to recommend. It looks bad, feels bad, and speaks to poor business decisions.",
      "voted_up": false,
      "votes_helpful": 275
    },
    {
      "review": "The base game is not enough of an improvement over the original.  I refuse to pay for additional DLC just to unlock improved game play.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "A good upgrade to the first game -- but uses AI slop to an absurd degree. Almost feels like no humans were involved in the development, at least artistically.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I am leaving a negative review until all the souless AI art is removed and they stop using AI for everything. \n\nAI is destroying environments. We already have an entire city about to be out of clean drinking water due to AI. People are losing their jobs. \n\nSo I can't support it.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Similar to the original, SOASE2 struggles from a combination of scale, interface, and time-sensitive design constraints. Unlike the original, the use of Generative AI to create and prototype the interfaces definitely damaged this game so severely that I cannot in good faith recommend it to anyone. Even fans of SOASE1.\r\n\r\nThe single most interesting addition is the Orbit mechanic, a feature the original direly needed where-in planets move dynamically along a rail, changing their possible Phase Lane connections. A mod that adds this feature to the original game would basically make this game pointless. An utter waste of potential, the new tech tree is completely noisy beyond reckoning and the interface just... I can't explain it. You will not be able to find the things you need.\r\n\r\nSOASE1 had a challenge or three to its scale specific to not always being able to figure out which freaking identical asteroid was under attack. Changes to the Tactical and Logistics slots system have made some differences to the fine balance of your first dozen planets, but this game is at its absolute weakest when player count and planet count starts getting too high. 2v2 or 4-way FFA probably is the best this game gets, the smaller the map the better so-as to force conflict before everyone is running into late-game balance issues.\r\n\r\nLike the first game, Advent have substantial global disadvantages, only alleviated through their unique faction mechanic, the second new idea this game had. TEC has the old trade system but it's even less compelling than making a big trade line running across the galaxy, Advent have a spell and psychic power system that makes their starbases and capships stronger, and Vasari have the lamest passive bonus system possible for their faction. These faction systems like the orbit mechanics could be put into the old game, and this game would not need to exist.\r\n\r\nThere's some new space ships, some utterly unnecessary redesigns of virtually all of the old craft, and broadly speaking the UI damage just utterly destroys the game's once-decent fleet management options. The new Fleet system lets you build a titanic kinda-manageable mass of ships that rally to the node the fleet 'leader' is at (usually a cap ship or titan), but it doesn't let you set something like a Quota per-unit for battles that will come with attrition. As mentioned, the game's later phases are kind of just miserable grinding conflicts and the new neutral faction system honestly just isn't as cool as the old one which let you bumble into neutral planets with defenses to make initial expansion more challenging.\r\n\r\nNow it's more like, you wipe out all of the neutral ships and claim your half of the galaxy within 15-30 minutes using a handful of frigates and your free cap ship. You couldn't do that in the past very easily, and that sort of blitz and streamlining steps done throughout contradict the awful menu design and frankly deplorable tech-tree which could have been trimmed to fit on the freaking screen. Just play the original, actual humans designed it, and I frankly don't think that happened with this one.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I don't care how \"ethically\" you source it. the ai art looks like shit and manages to completely undermine a key aspect of the storytelling. I'd rather replace it with emojis at this point just take it out",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "pretty good sequal, but the ai art is really distracting",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The use of AI art is painfully obvious. It detracts from the game. Had to refund.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I'm fairly mixed on this one but sadly I cannot recommend the base game for full price. The base game doesn't add enough content. What are the main new features?\n\n1. Orbits - Cool new feature\n2. Empire management via customising planets and ships. Long sought feature of the original finally added.\n3. New exotics resource for building capital ships.\n\nThose are the three big ones for me. Everything else is too similar to the first game and makes Sins 2's base game not feel different enough to warrant buying it. I am a casual player of the original. Maybe more competitive players will enjoy this one more than me but they will also be the ones most likely to buy all the DLC which would most likely make the base game worth it if you had those. But I am not buying DLC just to make the base game feel like a worthy sequel.\n\nObviously there is a huge visual upgrade and I appreciate that but there needs to be more features in the base game to attract more casual fans but I guess we aren't the target audience\n\n(To the people giving me jesters, thank you for the points)",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Cash Grab, Not unified enough, new skin, no new story.. Same package, split into 100+ dollars for what?\n\nA hacked game where all online play is hacks vs hacks...\n\nI have so many hours and year with the og Game. And this, just isn't worth playing. And its heart breaking .\n\nWhat happened Stardock?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The art design (essentially all AI, even if trained on their own art) is just bad. It looks actively bad. I can not and will not recommend a game that uses AI art like this. It's lazy and looks horrible.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I was unsure for some time what really ruined the game for me. Actually it is partly the AI images that make it soulless. Another huge negative is the DLC money pit this game is becoming. Will just keep playing the original.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Its SOASE 1 but prettier and less good mods. I wish there was more content in the base game than have paid DLC's serve as a substitute. \n\nAlso, the artwork in the previous game was better.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Replace the AI images with human made art and we'll talk. Until then, I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Mechanically, this game is amazing. The \"bones\" of the economy, fleets, leveling up capital ships, research, equipping items to customize your ships and planets are all fantastic, and make up 50% of what could have been a masterpiece. Aside from that, your captains and the opposing empires have zero personality, aside from a few generic voice-over sound bites. There is no story, no random events to pull you into an immersive experience. I was just thinking about Stellaris, and how you'd randomly get these popups about your scientists finding a mummified pilot in a derelict ship, which you could salvage or research. Those little moments and stories are what gave it so much life, whereas this is just a \"colonize planet and then zerg-rush the next system simulator.\" I've played for 11 hours and I feel like I've seen the whole thing. With all that said, if you can get it on a deep discount, then it's worth it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played through the tutorial and then started on the main game, but just couldn't get past the fact that it felt exactly like the first game. Not just similar, it felt as though it was the same game, perhaps just with a mod or two on it. it definitely isn't a brand new game, it's a tweaked remaster without much of a remaster. Honestly, it's super disappointing as I really liked the first game and was looking forward to a new twist to the game, new ships, different graphics, new visuals... it's all the same. If i wanted to play Sins 1 some more, I could just, you know... play that. Why spend money if you already own s\nSins 1? I get that fans of the franchise will like that it's more of the same, but I don't get why people are happy to pay out for a complete lack of innovation or progress. I requested a refund soon after playing some as I was searching desperately for a reason to play and just couldn't find one. With a massive plethora of games to choose from, this isn't up to par for a new game, and doesn't do justice as a follow-on or upgrade to the first game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As many said before me on paper and in reality, Sins 2 is a good sequel/remaster of the series. The Factions still feel the same as the precursor games, and the gameplay didn't lose its spirit, not like other sequels in the RTS genre (looking at you, Dawn of War). \n\nNow why is this review a negative one? The game's art is mostly AI-generated, and I hate it more the more I play. So until the art is from a real artist, the rating stays negative.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Honestly, having come back to this a couple times, I can't recommend it. This feels like a shallow reskin of the original games with a couple of mechanics like new capital resources shoved in. I'm a big SoaSE fan, been playing for a decade now, but it's the same game with rotating gravity wells--you might as well get SoaSE:Rebellion and you'd have a game with just as much thought and effort put into it, but with slightly older graphics. It's pretty telling that you could trick me into thinking this is a mod for the first game, and that's disappointing.\n\nNot worth the upcharge. Get an older game for the exact same experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would say the new changes are mostly bad.\n\nYou can no longer customize games very much at all. Maybe it was removed to be added back in DLC? Sucks either way.\nYou can not pick resource scarcity or modify planet count to create the games as desired like in the first one. Want to have a high player count with low planet count? Too bad. Want to have resource scarcity or control native strength? Nope. Its all gone.\nThe AI is balanced by cheating. Play better and you are punished for it. I verified by hacking the resources. Lazy way to balance the game\nThe Pirates were replaced by an influence system that I dislike and did not find fun\nA new resource system was added that is very punishing to specific races. Want to make a titan, star base, or a capitol ship focused build? Better choose the right race where the building is locked behind 4 research stations instead of 10. \n\nOn the bright side items added to planets and ships was cool? About the only positive I see. \n\nWorth playing, get it on a big sale. Feels like a 15$ DLC worthy price point for all it added yet all it removed and the additions were mostly bad imo.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's clunky, overly complex and just plain not fun. It takes hours and hours and feels more like I'm doing my tax return and doesn't even have a story line.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The price point to how the game feels compared to sins 1 is, quite painful.\nSins 1 does everything right and more in that there's still so much to learn and explore within it.\nSins 2 feels behind by comparison since the diplomacy mechanic is basically non-existent and hard to learn due to a lack of feedback, while some mechanics feel very much forced into a railroad. There's some things that are really cool and expressive, like the faction/ship colors being customizable beyond the main color, but functionally feels very lacking. \nIt's worth it to at least try, but I'm going to leave this in the basement till it can age like a fine wine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feel ripped off, base game feels early access. DLC should just be updates",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I was a huge fan of Sins of a Solar Empire: Rebellion, but this feels like nothing more than a poor copy-paste with just a few improvements.\r\n\r\nYesterday I tried playing it again out of nostalgia, but the AI was so broken that I ended up rage-quitting. :D",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "15 Euro for the latest DLC that contains 6 Ships. The pricing is absolutely shameless, even half of that price would have been a big push.\nCurrently cannot recommend Sins 2 while it already has bare-bones content ( no campaign either) and such shameless rip off pricing on top for tiny scraps of content.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Refuse to recommend this game until the AI UI art assets are replaced with actual art",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Hard is to easy, and the difficulty after that the AI gets more cheats than iv seen in any game since i started playing strategy games 30 years ago. Super lazy by the devs imo.\n\nAlso, once one players, AI or human, snowballs, the snowballer win, human nor AI can come back, makes the gameplay very boring after a few games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This isn't exactly bad but i cant recommend it the voices don't sound as good as they did in rebellion just look at the kol battleship it just dosen't sound as good as it did. The game music and audio in general just isn't as good either it honestly just feels like they were phoning it in on alot of it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rich gameplay, satisfying depth, exhilarating and thrilling space combat that appeals to players from across lots of different genres, 4x, RTS, MOBA, Simulation etc.\r\nImmense use of AI art; every character, technology, event portrait heavily AI doctored.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Refunded when I saw the absolutely atrocious AI art work, don't care, AI is only made to take jobs and money away from people to put out a shitty looking product",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Disappointing to be honest. I find I just lump up a load of ships together and throw them at the AI. It doesn't really matter what ships I use so long as I outnumber them. \n\nOverall. It doesn't feel like there's any meaningful depth. I like the minor factions, the rare resources, the different types of planets and the impressive space battles. But all in all it just feels kinda hollow. I wish I could suggest an improvement but I don't know how the devs can improve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First of all, no neutral vote\n\nBUT! I DO RECOMMEND IT HEAVILY compared to Sins of a Solar Empire Rebellion, for the optimization, AND Ease of access for Mods though frequent updates like every other game leaves much to be desired where you have to clear up mods one by one as there is no indicator which conflicts with the new updates until the game starts working again.\n\nNow the cons, not all the ships from the previous game exist, but you do get new ones as well, in time the old ones will be reintroduced, as for the DLC's, personally I find it staggeringly disappointing, unless of course you brought the get all future DLC's then thats fine but the problem is the DLC and the pricing themselves\n\nPaths to power DLC is cool and all, but for the average RTS player it is completely lack luster, it would just be a new map, new win condition and worse the bulk of the content is locked behind the scenario themselves.\nPersonally I'd still get it but it is not full price worthy, best to wait on a sale.\n\nReinforcement DLC, This is a mixed bag for me, again personally I love the new ships, besides the bugs that prevents me from building one even with requirements being met will surely get ironed out eventually, as well as a new factional victory condition.\n\nFor the average player the price is heavy especially when you can only use 1 of them while the rest of the 5 will be on another session, if there were new niche frigates or cruisers or any of that sort that came along with these Temu version of Titans (Over exaggeration there) So you'll enjoy $2.50 for one new ship per session I guess after waiting for months for content, that a Mod can very much well do  the same content for free............\n\nAnd thats about it thats 2 DLC's out of 4! Now my review is subject to change obviously, should the developers improve the DLCs, and hopefully don't underwhelmingly deliver the next 2 DLCs which is very much has high expectations specifically the Campaign, the 4th faction is a little extra.\n\nBut the first 2 DLCs having mixed reaction is not a good sign and may lower expectations for the game itself by lessening the hype.\n\nAgain game is worth it, and runs smoothly, speed up is less stuttery when you play alone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A game that simultaneously isn't polished, streamlined, or complex enough to be interesting. Baffling UI and balance decisions made my short time with the game a boring slog. Despite the promise of many different styles of gameplay, as with many better space strategy games, combat devolves into two big groups of your ships standing still and vaguely tickling each other in a way that doesn't even look good with the HUD turned off.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Absolutely criminal that they are charging the money that they are for a vastly inferior SoSE:R. AI art - whatever. Garbage but I care less about that. What really chaps my oysters is that it's been over a year now and instead of fixing core issues with the game (garbage bots/AI-players not challenging, microstuttering and frame drops when literally nothing is happening on screen, etc), they are releasing DLC and mini-updates no one asked for.\n\nIt's a real shame too because I am a big Sins 1 fan and I am fan of this game. I want to see it succeed but as per the usual in the modernity slop we live in, Stardock chooses greed over quality. Oy vey.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Generally, I really like this game but for the last month or so after some of the major updates, while playing the game on my Steam Deck, the game will randomly shut down and reboot the Steam Deck without warning.  This causes all progress made to be lost unless you just  recently saved the game.  If this problem were resolved I would recommend it, but for now, it's virtually unplayable.  I don't know if the same problem exists on PC as I haven't tried that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "AI art really kills the vibe for me. It's getting easier and easier to detect when it's used and I can't unsee it. A lot of the charm of the original is lost due to this kind of laziness.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TL:DR This is just a war game in space, shallow and much simpler than Galactic Civilizations or stellaris etc. This whole game could be a mod in their Galactic Civ 4 game.\r\n\r\nFirst things first, this is a good game. A fully fledged well polished game. There is a single great innovation for the genre in this game, planets rotate. You thought you could build defensive structures on this choke hold of a planet and neglect all the rest behind it? Think again! That is truly awesome! There is an element of surprise and unpredictability in this element which keeps you on edge. The ships designs are awesome aesthetically and the fleet management is awesome! The game is easy to master. And that's with the good stuff about this game. \r\n\r\nNow I will try and provide some constructive criticism. \r\n\r\n-PREMISE. The game is simple. Just conquest stuff. Build your fleet and conquer. No real exploration no feeling of dread or mystery of exploring the vast unknown space. No random events, not even scripted events. Neutral factions are just some dumb AI that mostly work like space merchants. It's just you and some other players trying to figure out who is the bigger dictator. \r\n\r\n-RESEARCH. The research tree. Almost meaningless. For the the first few hours I was paying attention and then I was like \"just queue all of them and I will figure out later the benefits\". Research felt unimpactful because most of the times was some equipment that could be loaded on one of my capital ships. Guess what, you can only have so many capital ships because of supply limit so what is the point of having SO MANY equipment choices for your ships and the same goes for your planets too. You just figure out which items fit your playstyle and your empire's needs and go with them. \r\n\r\n-RESOURCES. Don't worry about resources. It's just two basic resources that can be found in every asteroid/planet. There are of course rare resources but you can build them later on. As for money you only need to worry about it the first few hours. Seriously once you figure out the basics and own about ten colonies you don't have to worry about resources anymore. Because no matter how vast your empire is THERE IS NO UPKEEP. So I can build TWO starbases in every single one of my colonies and not get taxed about it?\r\n\r\n-SHIP/FLEET DESIGN. 4 types of frigates and 4 types of cruisers that I don't fully understand what their role in battle is. After a while some of the ships felt like more durable than others so I kept building them. Seriously there is no strategy involved or there is no sufficient explanation of it. Just don't waste resources in planet bombers, useless ships. They don't engage in any way in fights, your fleet is getting obliterated and they sit back relaxed bombing the planet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have not seen such cheating by the AI in all my life. I had a fully upgraded fleet at 2000. Yet the AI blew through my fleet with no problem. I would not recommend this game to anyone. Unless you are a glutton for punishment,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is worse than the first game in pretty much every way. also the ai swarms fighters so using them against the advent is useless. balancing is dogshit. dont waste your time, buy the first game.  and the crashes are constant and annoying. what a piece of shit! i literally lost my best game! DO NOT BUY THIS!`",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not buy unless they add a 4rth Race or something that makes this better than the 1st game...Honestly i see no difference except a small graphic change.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The AI generated UI elements are so jarringly ugly it makes me not want to play",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "AI slop art is overused and atrocious.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "lots of tutorials, not a bad thing, but wow. \n tech tree is overly cluttered and stupidly similar colors for everything, not good for us color blind folks, but i made due.\nthe only thing separating this from the origional is updated graphics and a celestial body movement mechanic.  \n add that movement mechanic to the origional game, and poof, you have this.\n\ncant recommend it in good faith.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game, uses ai art.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ai art galore. to the point of it being distracting",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Fix the tech tree art its awful.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "THIS DOES NOT WORK ON STEAM DECK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Need Work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Solid mechanical basis undermined by ignoring the UI/Aesthetic. AI Art in particular sticks out to me. I'd love to put more time into the game but one of the things I loved about 1 was that the art was simple, but evocative. When I'm getting a game to play solo I'm looking for something that looks and feels interesting. Rebellion's design made me imagine things around the game rather than just focusing on the mechanics. All I feel in Sins 2 is mechanics. \n\nAt best I would describe it as competent but soulless, which hurts for a series I dumped hundreds of hours into because it had soul.",
      "voted_up": false,
      "votes_helpful": 117
    },
    {
      "review": "I'm mostly disappointed in the AI. They keep forgetting large parts of their army to never ever move them again for the rest of the game effectively playing without several hundreds supply worth of units.\n\n They also often get their entire armies stuck in a gravity well, most often a sun for some reason, when their enemy has garrison planet augment that trickles in units one by one. I've seen 5 AI have all of their maxxed armies stuck on a sun killing straggling garrison ships while the rest of their empire gets picked apart for free.\n\nYou can only give the AI 2 \"personalities\" in this game, aggressive or defensive.\nIn the first game you could also choose economy focus or research focus.\n\nThere are also still missing capital ships from the previous game which will probably return in a 15$ DLC... ehhh not really sure this is an upgrade from the first game.\n\nI do think performance is better in long and large games though so that's one positive.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "This is somewhat tough, as on paper in a mechanical sense, Sins of a Solar Empire 2 is a GOOD sequel. It follows the design philosophy that a sequel should be more of what you like, but iterated upon. Planet management has a deeper scale to it, fleet compositions are less spammy, and faction differences (Aside from the loyalist/rebel unique techs) are more complex.\n\nControlling and managing multiple fleets feels more streamlined and less granular without losing complexity, and early game exploration is heavily rewarded. Queuing researches and build orders is easily done and altered. It is a GOOD sequel. If you liked Sins 1, you will like Sins 2. \n\nHowever, what is a terrible shame and an absolute travesty is the sheer amount of AI generated images in the game, and something I cannot condone supporting. Especially when the first game had so much charm in it's programmer art and colored concepts.\n\nOnce noticed- it's impossible to look past. At first the Balenciaga stare on some of the portraits- then that odd uniform light shading. The constant tilt shift on anything that's supposed to look granular. Odd, in-congruent positioning and posing in images where figures are supposed to be interacting with each other. Figures staring at the camera and screaming. That telltale 'figure standing in front of a bulbous space ship' that doesn't match the design of the rest of the game.\n\nThe portraits you select when in the set up lobby have lost all of their unique charm. Sure- there's more of them, but what's the point when they all look vaguely the same? Thirty nearly identical portraits will never be better than 5 filled with personality. Even the in loading screen 'ads' for upcoming DLC's have a clearly AI generated figure within it. (Look at the eyes of the green eyed woman in the paths to power DLC banner.)\n\nThe UI is too clean, some of the buttons do not look like buttons. It is serviceable, but lacks the gritty charm the original had. The steam page states that: \"This game used AI to help quickly iterate through designs for some UI elements using our own artwork as a baseline. AI is also used to help translate the game.\"\n\nAnd this feels like a lie. The UI design does not feel iterative- and the amount of AI images used when you supposedly have an artist on payroll just screams 'We only wanted to pay them for a quarter of the work we wanted done.' \nIf you have an artist, you have an artist. And even then, quirky programmer art will always be preferable to soulless AI generations.\n\nOne also has to wonder if some of this AI usage affected the visual designs of the ships themselves. Why did the Advent lose nearly all of their nautical theme?\n(The hangar defenses- for instance, are now just wedges, rather than evocative of sea shells.)\nWhy did the Vasari ships lose their insectile appearance?\nWhy do the turrets on many of the TEC ships look like they were tacked on as an afterthought?\n\nWere these conscious decisions from a person, or- did an AI simply smooth out the edges without understanding why those notions were present?\n\nIt's questioning like this that makes it hard to recommend. It looks bad, feels bad, and speaks to poor business decisions.",
      "voted_up": false,
      "votes_helpful": 275
    },
    {
      "review": "The base game is not enough of an improvement over the original.  I refuse to pay for additional DLC just to unlock improved game play.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "A good upgrade to the first game -- but uses AI slop to an absurd degree. Almost feels like no humans were involved in the development, at least artistically.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I am leaving a negative review until all the souless AI art is removed and they stop using AI for everything. \n\nAI is destroying environments. We already have an entire city about to be out of clean drinking water due to AI. People are losing their jobs. \n\nSo I can't support it.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Similar to the original, SOASE2 struggles from a combination of scale, interface, and time-sensitive design constraints. Unlike the original, the use of Generative AI to create and prototype the interfaces definitely damaged this game so severely that I cannot in good faith recommend it to anyone. Even fans of SOASE1.\r\n\r\nThe single most interesting addition is the Orbit mechanic, a feature the original direly needed where-in planets move dynamically along a rail, changing their possible Phase Lane connections. A mod that adds this feature to the original game would basically make this game pointless. An utter waste of potential, the new tech tree is completely noisy beyond reckoning and the interface just... I can't explain it. You will not be able to find the things you need.\r\n\r\nSOASE1 had a challenge or three to its scale specific to not always being able to figure out which freaking identical asteroid was under attack. Changes to the Tactical and Logistics slots system have made some differences to the fine balance of your first dozen planets, but this game is at its absolute weakest when player count and planet count starts getting too high. 2v2 or 4-way FFA probably is the best this game gets, the smaller the map the better so-as to force conflict before everyone is running into late-game balance issues.\r\n\r\nLike the first game, Advent have substantial global disadvantages, only alleviated through their unique faction mechanic, the second new idea this game had. TEC has the old trade system but it's even less compelling than making a big trade line running across the galaxy, Advent have a spell and psychic power system that makes their starbases and capships stronger, and Vasari have the lamest passive bonus system possible for their faction. These faction systems like the orbit mechanics could be put into the old game, and this game would not need to exist.\r\n\r\nThere's some new space ships, some utterly unnecessary redesigns of virtually all of the old craft, and broadly speaking the UI damage just utterly destroys the game's once-decent fleet management options. The new Fleet system lets you build a titanic kinda-manageable mass of ships that rally to the node the fleet 'leader' is at (usually a cap ship or titan), but it doesn't let you set something like a Quota per-unit for battles that will come with attrition. As mentioned, the game's later phases are kind of just miserable grinding conflicts and the new neutral faction system honestly just isn't as cool as the old one which let you bumble into neutral planets with defenses to make initial expansion more challenging.\r\n\r\nNow it's more like, you wipe out all of the neutral ships and claim your half of the galaxy within 15-30 minutes using a handful of frigates and your free cap ship. You couldn't do that in the past very easily, and that sort of blitz and streamlining steps done throughout contradict the awful menu design and frankly deplorable tech-tree which could have been trimmed to fit on the freaking screen. Just play the original, actual humans designed it, and I frankly don't think that happened with this one.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I don't care how \"ethically\" you source it. the ai art looks like shit and manages to completely undermine a key aspect of the storytelling. I'd rather replace it with emojis at this point just take it out",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "pretty good sequal, but the ai art is really distracting",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The use of AI art is painfully obvious. It detracts from the game. Had to refund.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I'm fairly mixed on this one but sadly I cannot recommend the base game for full price. The base game doesn't add enough content. What are the main new features?\n\n1. Orbits - Cool new feature\n2. Empire management via customising planets and ships. Long sought feature of the original finally added.\n3. New exotics resource for building capital ships.\n\nThose are the three big ones for me. Everything else is too similar to the first game and makes Sins 2's base game not feel different enough to warrant buying it. I am a casual player of the original. Maybe more competitive players will enjoy this one more than me but they will also be the ones most likely to buy all the DLC which would most likely make the base game worth it if you had those. But I am not buying DLC just to make the base game feel like a worthy sequel.\n\nObviously there is a huge visual upgrade and I appreciate that but there needs to be more features in the base game to attract more casual fans but I guess we aren't the target audience\n\n(To the people giving me jesters, thank you for the points)",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Cash Grab, Not unified enough, new skin, no new story.. Same package, split into 100+ dollars for what?\n\nA hacked game where all online play is hacks vs hacks...\n\nI have so many hours and year with the og Game. And this, just isn't worth playing. And its heart breaking .\n\nWhat happened Stardock?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The art design (essentially all AI, even if trained on their own art) is just bad. It looks actively bad. I can not and will not recommend a game that uses AI art like this. It's lazy and looks horrible.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I was unsure for some time what really ruined the game for me. Actually it is partly the AI images that make it soulless. Another huge negative is the DLC money pit this game is becoming. Will just keep playing the original.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Its SOASE 1 but prettier and less good mods. I wish there was more content in the base game than have paid DLC's serve as a substitute. \n\nAlso, the artwork in the previous game was better.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Replace the AI images with human made art and we'll talk. Until then, I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Mechanically, this game is amazing. The \"bones\" of the economy, fleets, leveling up capital ships, research, equipping items to customize your ships and planets are all fantastic, and make up 50% of what could have been a masterpiece. Aside from that, your captains and the opposing empires have zero personality, aside from a few generic voice-over sound bites. There is no story, no random events to pull you into an immersive experience. I was just thinking about Stellaris, and how you'd randomly get these popups about your scientists finding a mummified pilot in a derelict ship, which you could salvage or research. Those little moments and stories are what gave it so much life, whereas this is just a \"colonize planet and then zerg-rush the next system simulator.\" I've played for 11 hours and I feel like I've seen the whole thing. With all that said, if you can get it on a deep discount, then it's worth it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played through the tutorial and then started on the main game, but just couldn't get past the fact that it felt exactly like the first game. Not just similar, it felt as though it was the same game, perhaps just with a mod or two on it. it definitely isn't a brand new game, it's a tweaked remaster without much of a remaster. Honestly, it's super disappointing as I really liked the first game and was looking forward to a new twist to the game, new ships, different graphics, new visuals... it's all the same. If i wanted to play Sins 1 some more, I could just, you know... play that. Why spend money if you already own s\nSins 1? I get that fans of the franchise will like that it's more of the same, but I don't get why people are happy to pay out for a complete lack of innovation or progress. I requested a refund soon after playing some as I was searching desperately for a reason to play and just couldn't find one. With a massive plethora of games to choose from, this isn't up to par for a new game, and doesn't do justice as a follow-on or upgrade to the first game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As many said before me on paper and in reality, Sins 2 is a good sequel/remaster of the series. The Factions still feel the same as the precursor games, and the gameplay didn't lose its spirit, not like other sequels in the RTS genre (looking at you, Dawn of War). \n\nNow why is this review a negative one? The game's art is mostly AI-generated, and I hate it more the more I play. So until the art is from a real artist, the rating stays negative.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Honestly, having come back to this a couple times, I can't recommend it. This feels like a shallow reskin of the original games with a couple of mechanics like new capital resources shoved in. I'm a big SoaSE fan, been playing for a decade now, but it's the same game with rotating gravity wells--you might as well get SoaSE:Rebellion and you'd have a game with just as much thought and effort put into it, but with slightly older graphics. It's pretty telling that you could trick me into thinking this is a mod for the first game, and that's disappointing.\n\nNot worth the upcharge. Get an older game for the exact same experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I would say the new changes are mostly bad.\n\nYou can no longer customize games very much at all. Maybe it was removed to be added back in DLC? Sucks either way.\nYou can not pick resource scarcity or modify planet count to create the games as desired like in the first one. Want to have a high player count with low planet count? Too bad. Want to have resource scarcity or control native strength? Nope. Its all gone.\nThe AI is balanced by cheating. Play better and you are punished for it. I verified by hacking the resources. Lazy way to balance the game\nThe Pirates were replaced by an influence system that I dislike and did not find fun\nA new resource system was added that is very punishing to specific races. Want to make a titan, star base, or a capitol ship focused build? Better choose the right race where the building is locked behind 4 research stations instead of 10. \n\nOn the bright side items added to planets and ships was cool? About the only positive I see. \n\nWorth playing, get it on a big sale. Feels like a 15$ DLC worthy price point for all it added yet all it removed and the additions were mostly bad imo.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's clunky, overly complex and just plain not fun. It takes hours and hours and feels more like I'm doing my tax return and doesn't even have a story line.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The price point to how the game feels compared to sins 1 is, quite painful.\nSins 1 does everything right and more in that there's still so much to learn and explore within it.\nSins 2 feels behind by comparison since the diplomacy mechanic is basically non-existent and hard to learn due to a lack of feedback, while some mechanics feel very much forced into a railroad. There's some things that are really cool and expressive, like the faction/ship colors being customizable beyond the main color, but functionally feels very lacking. \nIt's worth it to at least try, but I'm going to leave this in the basement till it can age like a fine wine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Feel ripped off, base game feels early access. DLC should just be updates",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I was a huge fan of Sins of a Solar Empire: Rebellion, but this feels like nothing more than a poor copy-paste with just a few improvements.\r\n\r\nYesterday I tried playing it again out of nostalgia, but the AI was so broken that I ended up rage-quitting. :D",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "15 Euro for the latest DLC that contains 6 Ships. The pricing is absolutely shameless, even half of that price would have been a big push.\nCurrently cannot recommend Sins 2 while it already has bare-bones content ( no campaign either) and such shameless rip off pricing on top for tiny scraps of content.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Refuse to recommend this game until the AI UI art assets are replaced with actual art",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Hard is to easy, and the difficulty after that the AI gets more cheats than iv seen in any game since i started playing strategy games 30 years ago. Super lazy by the devs imo.\n\nAlso, once one players, AI or human, snowballs, the snowballer win, human nor AI can come back, makes the gameplay very boring after a few games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This isn't exactly bad but i cant recommend it the voices don't sound as good as they did in rebellion just look at the kol battleship it just dosen't sound as good as it did. The game music and audio in general just isn't as good either it honestly just feels like they were phoning it in on alot of it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rich gameplay, satisfying depth, exhilarating and thrilling space combat that appeals to players from across lots of different genres, 4x, RTS, MOBA, Simulation etc.\r\nImmense use of AI art; every character, technology, event portrait heavily AI doctored.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Refunded when I saw the absolutely atrocious AI art work, don't care, AI is only made to take jobs and money away from people to put out a shitty looking product",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Disappointing to be honest. I find I just lump up a load of ships together and throw them at the AI. It doesn't really matter what ships I use so long as I outnumber them. \n\nOverall. It doesn't feel like there's any meaningful depth. I like the minor factions, the rare resources, the different types of planets and the impressive space battles. But all in all it just feels kinda hollow. I wish I could suggest an improvement but I don't know how the devs can improve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First of all, no neutral vote\n\nBUT! I DO RECOMMEND IT HEAVILY compared to Sins of a Solar Empire Rebellion, for the optimization, AND Ease of access for Mods though frequent updates like every other game leaves much to be desired where you have to clear up mods one by one as there is no indicator which conflicts with the new updates until the game starts working again.\n\nNow the cons, not all the ships from the previous game exist, but you do get new ones as well, in time the old ones will be reintroduced, as for the DLC's, personally I find it staggeringly disappointing, unless of course you brought the get all future DLC's then thats fine but the problem is the DLC and the pricing themselves\n\nPaths to power DLC is cool and all, but for the average RTS player it is completely lack luster, it would just be a new map, new win condition and worse the bulk of the content is locked behind the scenario themselves.\nPersonally I'd still get it but it is not full price worthy, best to wait on a sale.\n\nReinforcement DLC, This is a mixed bag for me, again personally I love the new ships, besides the bugs that prevents me from building one even with requirements being met will surely get ironed out eventually, as well as a new factional victory condition.\n\nFor the average player the price is heavy especially when you can only use 1 of them while the rest of the 5 will be on another session, if there were new niche frigates or cruisers or any of that sort that came along with these Temu version of Titans (Over exaggeration there) So you'll enjoy $2.50 for one new ship per session I guess after waiting for months for content, that a Mod can very much well do  the same content for free............\n\nAnd thats about it thats 2 DLC's out of 4! Now my review is subject to change obviously, should the developers improve the DLCs, and hopefully don't underwhelmingly deliver the next 2 DLCs which is very much has high expectations specifically the Campaign, the 4th faction is a little extra.\n\nBut the first 2 DLCs having mixed reaction is not a good sign and may lower expectations for the game itself by lessening the hype.\n\nAgain game is worth it, and runs smoothly, speed up is less stuttery when you play alone.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}