{
  "positive": [
    {
      "review": "[h1] Alright. [/h1]\n[h3] Here is my opinion after 100%-ing the entire game and getting all notebook badges and steam 100%. [/h3]\n\n[h2] This part covers the game in general (all DLCs included, if you want to know about each individual DLC, just check them): [/h2]\n\n[list]\n[*]A casual game where you cook, surpassing Gordon Ramsay in culinary talent and turning the working hours into Hell's kitchen\n[*]An amazing soundtrack. You can go to most places in Gensokyo, all having a unique theme\n[*]A very beginner friendly game in order to get into the Touhou Project\n[*]The art style is fantastic and the gameplay is very fluid\n[*]During my personal playthought, I haven't encountered many bugs aside from the random steam cloud error when launching the game sometimes. (You don't lose any save files, it's fixable just by relaunching the game)\n[*]The gameplay can be repetitive for some people if you take your time it shouldn't be an issue\n[*]You'll find most of the characters of the Touhou Project\n[*]There's many references to pop culture hidden throughout the game\n[*]If you have the money, you should definitely get the game at full price. Even with all DLCs it cost less than most AAA games\n[/list]\n\n[h2] This part is for main game only: [/h2]\n\n[list]\n[*]The story is fairly easy to understand even without knowing any of the characters.\n[*]For the base price of the game, it is definitly worth it as you'll get a long [b] long [/b] playtime if you don't skip any of the dialogues.\n[*]The steam 100% can be achieved without any of the DLCs.\n[*] The game's intro is  [b] AMAZING [/b] \n[/list]\n\n[h2] Did I mention they are releasing an anime for this game? [/h2]\n\n[h1] Overall 10/10 game, get your entire family to play this masterpiece of a game. [/h1]",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "If you know nothing about Touhou this is a great forray into the lore even as a Fanon game. A plate up style cooking simulator, enjoy creating your menus, serving unique customers and helping one bird live her true dream.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "coziest game ever. best way to not pay attention in class. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite a comfort game to play with a good tie-in to the world of Gensokyo and Touhou Project, even if it's not all canon. Nonetheless, a great one to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whilst im still not finished with the main game, this game is INCREDIBLE!! its super fun and easy to play though it makes you think and plan ahead for the night, giving the perfect combo of cosy game and problem solving. I will admit, some things are a little difficult like trying to find food for tasks with a combination of tags you dont have in one meal (im not sure if i can combine ingredients for the day tasks, i havent found out yet)\r\n\r\nThe characters are charming and portrayed in a loving and respectful way, theres also quite a bit to do during the day like gather ingredients, talk to characters, start and finish side quests, learn new recipies, pre cook for the night, and more though some things i wish you would be told like going to the donation box on the left at Hakurei Shrine will give you goodies, some you can use to buy outfits at Rinnosukes. alot of love was put in this game and it shows. \r\n\r\nthe controls are super easy, i started out on a controller but found it easy to play on keyboard (which is rare for me at the moment, especially as i am on a laptop)\r\n\r\nthe game is also long (to me) but not in a tiring way. ive been playing on and off due to my College studies and recently before calling it a day i usually reach a new part in the main plot, meaning after a long day, i get to come right back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is fun, characters are cute, graphics are cute, story is not very serious but it's good enough, most importantly it doesn't break characters it works with.\n\nThe thing to note compared to normal restaurant simulators are the characters - most of the named characters from Touhou are here as special visitors that have unique tastes and are a bit of a nuisance by not ordering specific food and instead just making vague requests - but they are critical to please as they can reward or punish you in a way that affects everything else for some time.\n\nWhat I can critique is interface and general clunkiness of the game UX (user expirience). I think it's a product of the game being supported but not rewritten nor continued with a sequel, in the span of many years. It's good that you get the best experience even without buying new content, but there is a limit to how much they can reasonably change for better when the game is already made and any change might break something.\n\nBut what other fangame gets sold on Steam, with 6 DLC (ones that add new content, not ones that just split essential parts of story and gameplay), fire soundrack, and gets a whole slice of life anime (also being sold on Steam)? And on sale you can get all of that for a price that would be fair just for the game (except anime of course, it didn't come out yet as of writing the review)?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a cute game about making horrifying culinary disasters and giving them to your patrons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never thought I would enjoy a cooking-based game, but this game is GOOD.\n\n- Good music\n- Good story\n- Generally relaxing \n- Touhou\n\n TLDR: I'm glad this was my first Steam game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Touhou Mystia’s Izakaya is a cozy, charm-filled management game that blends simple cooking, light resource gathering, and a warm nighttime atmosphere into a relaxing loop. so I do recoomand this game its fun and calm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Base game takes about 20-30 hours to finish if you're mucking about, and it's worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty nice and enjoyable even for the people that are not familiar with Touhou (lore in this case I guess). I guess the advantages for knowing the lore before playing it are minimal, like it was obvious for me what kind of food Reimu, Marisa, Rumia... would eat, but I feel like anyone can enjoy.\n\nThe game on itself is pretty fun, even if repetitive at times, the story keeps things interesting. Also trying to go for all the achievements can make the game not feel grindy at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A slow paced cooking game where you gather your own ingredients by day and run an Izakaya by night. The game is stuffed full of references to other Touhou games but even as someone who berely knows of the series it doesn't leave me lost. \n\nI have focused on the main story only with occasional side quests and finished it in arould 45 hours, despite that there is plenty more to do. I would recommend getting all the DLC so your dish options are wider.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game got me through a tough time in my life, I really care for it.\r\nThe story is nothing special - a Touhou themed excuse for cooking to be important and bring in all the fan-favorite characters. The graphics are really nice - everything looks excellent and is very cute. The music is fantastic, very earwormy and the progression over the course of gameplay is very fun.\r\nThe gameplay itself is very simple but addicting - combining ingredients in different cooking utensils is pretty easy, but making sure the Special Guests are completely satisfied is very fun, and the time and money management beforehand makes things very interesting.\r\nThis is a game I'd recommend to anyone with a vague interest in management games. It's a really good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game, survival mode is great for increased replay value! very good music and of course the art is all great too. the only thing i would change is adding an option to access survival mode from the main menu",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay loop works well, the sprite art is beautiful, and most of all, I love touhou. Its characters, its setting, there's something uniquely \"comfort food\" about touhou, which I guess is apt considering we [i]are[/i] running an izakaya here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Game I have played on steam in the year, very relaxing plots with playful activities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The artstyle and the vibes in this one is so beautiful. This is my first time taking in a decent amount of Touhou content/knowledge, and I gotta say I regret not getting to know Touhou like a decade earlier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is cute and fun. I don't understand the plot at all, but I find the story amusing and the gameplay is good~! It can be a bit stressful, so keep that in mind!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Frankly, I don't know much about the Touhou games, but I've been consuming fanmade works involving the characters for a very long time. I absolutely love this game--it's so fun, the art is spectacular, and the story gives me a newfound appreciation for characters in the series that I didn't really bat an eye at before. I love how the character dialogue ranges from a slice-of-life style clash of character dynamics to real discussion of philosophy, folklore, and religion befitting their personalities. I think it might be a daunting amount of information for an \"outsider\" of the series who isn't thoroughly knowledgeable of the events that occur in the games, but it's still easily consumable for folks who don't know Touhou and I like it that way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a fan of the Touhou universe I adore this game and had a lot of fun with it, it's probably in the top 3 Touhou fan games of all time especially for the very reasonable listed price. However, it is a flawed game and I wouldn't recommend it for anyone who doesn't know and like Touhou.\n\nPositives:\n+ Great pricing\n+ Large amount of content, from characters to locations to recipes\n+ Generally good gameplay experience, especially if you enjoy casual games, optimising and routines\n+ Portrays a large region of Touhou's universe with a charming nod to both canon and fanon.\n+ A good sense of humour, if a bit memey\n+ Very satisfying to have the rhythm gameplay sync with the background music\n\nNegatives:\n- The English localisation is very poor in some places.\n- it's missing some key QoL features, such as negatively filtering dishes by tags or by work station. There is a huge problem which is that there are so many recipe tags, you need to be able to filter the tags! The tags should at least be sorted alphabetically.\n- Awkward mouse control in menus. In particular, there is one menu in DLC5 where you have to make 150 mouse clicks to complete a purchase...\n- The game's pacing is very slow and can be very repetitive. This is especially horrible if you don't have the DLCs.\n- There is no challenge whatsoever. I really like casual games... but this game takes it to extreme levels. You will never have a guest leave due to impatience unless you leave the game to go make a meal IRL.\n- Disappointing rhythm elements. The game feels like a sophisticated cafe management game with a very basic rhythm game shoehorned into it. The rhythm game is very lenient with timing and has no \"impact\" on the beats, which can make it feel very unsatisfying. It could have done with more work, currently it feels like a chore.\n- The soundtrack. There are only a couple of tracks I could listen to on repeat without growing to hate them, and this game sure does expect you to listen to them on repeat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good, similar to Recettear and Diner Dash with Touhou characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relax when collecting resources, tryhard when attending the izakaya",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice and simple cozy game. Love working my 5-9 after my 9-5!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "this game is fun and its just nice to play for a lil",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They are all so cute, 10/10 would get money from the youkai mafia again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too rifch formy own good i love you marisa",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "found out about this game through human trafficking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Satori sprites so cute :3",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Chilly game, what can I say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "real fun, no think type of game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cirno is cute and funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cooking fun! until i get rammed :/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super chill game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "load the ramen artillery.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game gave me so much joy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is PEAK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hop on touhou mystia's izakaya\r\nalways be in debt\r\nnever be sad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My Life For Mystia's Izakaya",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "非常好食堂，使咱的小碎骨旋轉🥰🥰",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i like it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "好玩😋",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best TH fangame",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love bird lady :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "香啊很香啊",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "breaking bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Human trafficking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funny birb",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "chen is cute",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "peakathon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's peak.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak coziness",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love touhou",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Weriggle nibthbug",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "o-o",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "✋ᗜˬᗜ🤚 ABSOLUTE FUMO ✋ᗜˬᗜ🤚",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "🎉😌",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kawaii",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A birdie named Mystia embarks on a quest to harem every one of Touhou's characters in what is the pinnacle of all fan-games of this multi-decade old series. It's no lie: this game is flooded with backbreaking love. With what I believe to be an award-winning soundtrack, dialogue giving an equal weight to every character you meet, & an aesthetic that'll remain perpetually fresh no matter the date, this is THE homage to Touhou.\n\nMystia's Izakaya with all its inclusion of its DLC 5 (& total translation as of patch 4.2.1) is totally completed. It's incredibly affordable price with all its DLCs (& soundtracks) - even with no discounts - makes this a no-bird-brainer for anyone already reading this page. Its gameplay loop catches up to latch on even for those unaccustomed (like myself) to the genre.\n\nSadly all good things must eventually reveal their dark sides: the main gameplay loop simply takes too long! It took me 80 hours to level my relationships to max with all the base game characters & an additional 125 to max with every DLC's characters. Maxing your relationships with all characters is important because it's the only way to unlock the boss fights, cooking assistants, skills, recipes, outfits, auto-gatherers, & equipment. This IS the main gameplay loop & it's IMPORTANT that you do this to turn this into a casual-feeling game rather than a competitive one. I have 205 hours on this game played over 75 days, that is almost 3 hours of playing ONLY this game a day! That is some serious commitment to be making to a game, it's starting to rival even MapleStory. At certain times, I felt like I'd rather pull weeds than play.\n\nI don't know if the developers should change how long it takes, as the time took with each character feels perfect at the same time. There's no incentives to come back to areas you've already finished. With being able to easily receive a perfect rating with dishes, there's no reason to go above & beyond with ingredients. The singing while cooking mini-game is cheese-able by spamming buttons, I wished they gave an option to lean into it to be harder as I find it great at bringing the players back to attention.\n\nDespite that, if you remember the passion you felt in my first paragraph, you'd know that this game is timeless. I sincerely recommend that you'd play it.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "It has Mystia in it\r\nIn fact, not only does it have Mystia in it, she is the main character\r\nThis is potentially one of the greatest Touhou games ever\r\nI love Mystia",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I've finished the main story and almost all of the DLCs (almost done with DLC5) and the value you get for the price (especially if you get everything on sale) is insane! I didn't know anything about Touhou before playing this and never touched a game from the series or any other fan game before, yet I loved this game so much. I can only imagine how fun a Touhou fan is gonna have with this! There is a wide variety of characters and they're all so adorable and cute (and also very relatable sometimes). \n\n\nThe mechanics are just right for me, simple yet challenging at times but not enough to stress me out. I love that you can play it the way you prefer, getting orders out ASAP - or taking the time to come up with the perfect order for your rare customers, trying to figure out how many liked tags you can fit into the dish, without it negatively impacting the gameplay (since the working time isn't progressing when you need to look things up in the diary). \n\nLeveling friendships feels rewarding and is fun (though frustrating at times - not in a bad way, you'll understand when you're that tinyyyy bit away from maxing them out and they just decide to not show up, even though you personally invited them). \n\nIt also includes a variety of tracks you can play as a rhythm game, though they are completely optional! I can't say much about them, since I'm not a rhtyhm game fan (spared them a glance once or twice) but if you're a fan of those, you will not be disappointed. \n\nI definitely suggest getting the game + the DLCs at once as I felt like they enriched the experience of playing through the main story (with the extra locations, characters, recipes, etc.) but you can also easily play the main story first and decide to go for the DLCs after (to see if the game is for you). \n\nI usually stick to low-effort, meme-y reviews for games but I loved this game so much that I felt guilty for not giving a proper review. So, here it is. Definitely one of my all-time favorite cozy games. <3",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "First!!,this is not a casual game unless you play on a second playthrough and know what are you doing. My first run always has like 2 days left before I make enough money so my shark loan won't kill me and have to restart last saved files. But if you are looking for time management+store management sim+resource management kindna game, this is a game for you. DLC1-5 recommended, if you are really like the base game and looking for more endgame content. I finish base game for around 30 hours and spend 45 more hours to finish all DLC1-5.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "[h1] Alright. [/h1]\n[h3] Here is my opinion after 100%-ing the entire game and getting all notebook badges and steam 100%. [/h3]\n\n[h2] This part covers the game in general (all DLCs included, if you want to know about each individual DLC, just check them): [/h2]\n\n[list]\n[*]A casual game where you cook, surpassing Gordon Ramsay in culinary talent and turning the working hours into Hell's kitchen\n[*]An amazing soundtrack. You can go to most places in Gensokyo, all having a unique theme\n[*]A very beginner friendly game in order to get into the Touhou Project\n[*]The art style is fantastic and the gameplay is very fluid\n[*]During my personal playthought, I haven't encountered many bugs aside from the random steam cloud error when launching the game sometimes. (You don't lose any save files, it's fixable just by relaunching the game)\n[*]The gameplay can be repetitive for some people if you take your time it shouldn't be an issue\n[*]You'll find most of the characters of the Touhou Project\n[*]There's many references to pop culture hidden throughout the game\n[*]If you have the money, you should definitely get the game at full price. Even with all DLCs it cost less than most AAA games\n[/list]\n\n[h2] This part is for main game only: [/h2]\n\n[list]\n[*]The story is fairly easy to understand even without knowing any of the characters.\n[*]For the base price of the game, it is definitly worth it as you'll get a long [b] long [/b] playtime if you don't skip any of the dialogues.\n[*]The steam 100% can be achieved without any of the DLCs.\n[*] The game's intro is  [b] AMAZING [/b] \n[/list]\n\n[h2] Did I mention they are releasing an anime for this game? [/h2]\n\n[h1] Overall 10/10 game, get your entire family to play this masterpiece of a game. [/h1]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Life changing game, Im so grateful it exists. 10/10 experience, I highly recommend it to anyone. I hope one day there will be part 2 or more DLC content. It would be instant buy from me",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "omg i just started but this game is so fucking fun?? its insanely entertaining, the artstyle is ADORABLE, theres a variety of tasks to do (AKA you don't just cook the whole game), and i think its a great intro to the touhou-verse. this game is literally soo worth it\n87 hours in on the third dlc. i canot even begin to explain how much i love this game. though im taking a small break, i got through the entire main game and first to dlcs in, i believe, around a month. addicting and cute and a wonderful intro to touhou. i fucking love tewi inaba.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "If you know nothing about Touhou this is a great forray into the lore even as a Fanon game. A plate up style cooking simulator, enjoy creating your menus, serving unique customers and helping one bird live her true dream.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "coziest game ever. best way to not pay attention in class. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cutesy little game, very pretty to look at and has tons of content :3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun, probably one of the best restaurant management games I've played alongside Dave the Diver. I'm a long-time Touhou fan, but imo you don't need to know anything about the franchise to enjoy this.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i asked this game for my birthday and ougghhh this game is my comfort game now... sow orth it... i stop crying every time i play it",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "mmmm food and extortion go hand in hand\r\nExcept Cirno punishing me for running out of money. How am I responsible for HER bad money management????\r\nAmazing game, very relaxing. Recommended highly",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite a comfort game to play with a good tie-in to the world of Gensokyo and Touhou Project, even if it's not all canon. Nonetheless, a great one to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Whilst im still not finished with the main game, this game is INCREDIBLE!! its super fun and easy to play though it makes you think and plan ahead for the night, giving the perfect combo of cosy game and problem solving. I will admit, some things are a little difficult like trying to find food for tasks with a combination of tags you dont have in one meal (im not sure if i can combine ingredients for the day tasks, i havent found out yet)\r\n\r\nThe characters are charming and portrayed in a loving and respectful way, theres also quite a bit to do during the day like gather ingredients, talk to characters, start and finish side quests, learn new recipies, pre cook for the night, and more though some things i wish you would be told like going to the donation box on the left at Hakurei Shrine will give you goodies, some you can use to buy outfits at Rinnosukes. alot of love was put in this game and it shows. \r\n\r\nthe controls are super easy, i started out on a controller but found it easy to play on keyboard (which is rare for me at the moment, especially as i am on a laptop)\r\n\r\nthe game is also long (to me) but not in a tiring way. ive been playing on and off due to my College studies and recently before calling it a day i usually reach a new part in the main plot, meaning after a long day, i get to come right back to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is fun, characters are cute, graphics are cute, story is not very serious but it's good enough, most importantly it doesn't break characters it works with.\n\nThe thing to note compared to normal restaurant simulators are the characters - most of the named characters from Touhou are here as special visitors that have unique tastes and are a bit of a nuisance by not ordering specific food and instead just making vague requests - but they are critical to please as they can reward or punish you in a way that affects everything else for some time.\n\nWhat I can critique is interface and general clunkiness of the game UX (user expirience). I think it's a product of the game being supported but not rewritten nor continued with a sequel, in the span of many years. It's good that you get the best experience even without buying new content, but there is a limit to how much they can reasonably change for better when the game is already made and any change might break something.\n\nBut what other fangame gets sold on Steam, with 6 DLC (ones that add new content, not ones that just split essential parts of story and gameplay), fire soundrack, and gets a whole slice of life anime (also being sold on Steam)? And on sale you can get all of that for a price that would be fair just for the game (except anime of course, it didn't come out yet as of writing the review)?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a cute game about making horrifying culinary disasters and giving them to your patrons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never thought I would enjoy a cooking-based game, but this game is GOOD.\n\n- Good music\n- Good story\n- Generally relaxing \n- Touhou\n\n TLDR: I'm glad this was my first Steam game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Touhou Mystia’s Izakaya is a cozy, charm-filled management game that blends simple cooking, light resource gathering, and a warm nighttime atmosphere into a relaxing loop. so I do recoomand this game its fun and calm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Base game takes about 20-30 hours to finish if you're mucking about, and it's worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty nice and enjoyable even for the people that are not familiar with Touhou (lore in this case I guess). I guess the advantages for knowing the lore before playing it are minimal, like it was obvious for me what kind of food Reimu, Marisa, Rumia... would eat, but I feel like anyone can enjoy.\n\nThe game on itself is pretty fun, even if repetitive at times, the story keeps things interesting. Also trying to go for all the achievements can make the game not feel grindy at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A slow paced cooking game where you gather your own ingredients by day and run an Izakaya by night. The game is stuffed full of references to other Touhou games but even as someone who berely knows of the series it doesn't leave me lost. \n\nI have focused on the main story only with occasional side quests and finished it in arould 45 hours, despite that there is plenty more to do. I would recommend getting all the DLC so your dish options are wider.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game got me through a tough time in my life, I really care for it.\r\nThe story is nothing special - a Touhou themed excuse for cooking to be important and bring in all the fan-favorite characters. The graphics are really nice - everything looks excellent and is very cute. The music is fantastic, very earwormy and the progression over the course of gameplay is very fun.\r\nThe gameplay itself is very simple but addicting - combining ingredients in different cooking utensils is pretty easy, but making sure the Special Guests are completely satisfied is very fun, and the time and money management beforehand makes things very interesting.\r\nThis is a game I'd recommend to anyone with a vague interest in management games. It's a really good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game, survival mode is great for increased replay value! very good music and of course the art is all great too. the only thing i would change is adding an option to access survival mode from the main menu",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay loop works well, the sprite art is beautiful, and most of all, I love touhou. Its characters, its setting, there's something uniquely \"comfort food\" about touhou, which I guess is apt considering we [i]are[/i] running an izakaya here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Game I have played on steam in the year, very relaxing plots with playful activities.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The artstyle and the vibes in this one is so beautiful. This is my first time taking in a decent amount of Touhou content/knowledge, and I gotta say I regret not getting to know Touhou like a decade earlier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is cute and fun. I don't understand the plot at all, but I find the story amusing and the gameplay is good~! It can be a bit stressful, so keep that in mind!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Frankly, I don't know much about the Touhou games, but I've been consuming fanmade works involving the characters for a very long time. I absolutely love this game--it's so fun, the art is spectacular, and the story gives me a newfound appreciation for characters in the series that I didn't really bat an eye at before. I love how the character dialogue ranges from a slice-of-life style clash of character dynamics to real discussion of philosophy, folklore, and religion befitting their personalities. I think it might be a daunting amount of information for an \"outsider\" of the series who isn't thoroughly knowledgeable of the events that occur in the games, but it's still easily consumable for folks who don't know Touhou and I like it that way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game for this price. I would recommend removing a loooot of the talking. It's way too much that doesn't make the story any better and simply makes me grow tired with clicking the Skip button.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfection. Not the most cozy game (You won't be relaxing), but the art is cute, the music is perfect, and...\nWell I don't have much to say about it really. It's just perfect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love this game so much! I've played it twice! The art is beautiful and the gameplay is super satisfying (and challenging, but not unrealistically!) Would reccommend to anyone who enjoys the cute artstyle and likes slice of life, somewhat fast paced gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slightly repetitive gameplay, but good for killing time. Pretty fun in general",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! Cute characters, great game progression you won't get tired of.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its just a touhou cooking game they said..........and welp for some reasons its 5AM again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "角色立绘很可爱，主线剧情也可以。即使没有东方IP，也是不错的游戏",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very well made. Nice art styles, designs, mechanisms, gameplay etc... Can't imagine this is a fan-made game. well I guess you only see this kind when it comes to Touhou.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I came here for the food but left with pure enlightenment... \n\nWords cannot describe the flavor of Mystia's Izakaya, one can say, it is like sparrow soup for the soul.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is the game I have ever bought and regretted the most. The more you play, the more boring it becomes, and the recipes of special customers all rely on checking the strategy, which is annoying. There are also ingredients to run around the map to get this setting by yourself, which is exhausting.It's not as fun as the legend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Story is decent but broken up too much and slow paced, super cute art with likeable character design, main game-play of making food is and serving is fun but remembering so many dishes and customers is annoying, gathering ingredients gets tiring after more areas open up, too many systems layered on top make it too complex to have some simple fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is complicated in an unnecessary way. I'd played many games of the genre, this one is hugely bloated (too many tags and the playing music is badly designed but critical) and the control for pc is atrocious. Overall, won't recommend if you look for cozy, chill game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please make an accessibility feature for players who don't feel comfortable serving alcohol.\nFor instance, changing the term \"alcohol\" to \"juice\" or something else.\n\nI'm willing to change or delete this negative review if this feature is added or if I end out making a mod for it.\nIf anyone comes out with a mod to fix it, please let me know.\n\nThanks.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}