{
  "positive": [
    {
      "review": "Amazing game. The story starts mysterious but gets really good toward the end. The fights are intense, the weapons and upgrades feel great, and even Atreus becomes braver and more useful as you go.\nGreat gameplay and emotional moments. totally worth playing!",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "\"Never thought I'd get this hooked on a singleplayer game...\"\nI mostly play Dota  and other multiplayer stuff, but man — God of War completely pulled me in. I’m only halfway through and it’s already insane. The story, the music, the visuals — everything feels on another level. It’s cinematic, emotional, and just pure quality from start to finish. Didn’t expect to enjoy it this much, but here I am, totally hooked.\n\n10/10 — Kratos converted a Dota player 😅",
      "voted_up": true,
      "votes_helpful": 42
    },
    {
      "review": "10/10 \r\n\r\nThis game really makes you FEEL like you're wrestling with the demons of your past while trying to be a positive father figure in a way that you never had yourself.",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☑ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☑ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☑ Short\r\n☐ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "God of War (2018) completely reinvented the series, turning a fast-paced action saga into a deep, emotional journey. Kratos is no longer just a furious warrior — he’s a father, guiding his son Atreus through a world of Norse mythology.\n\nThe gameplay change is major: the camera is now over-the-shoulder, combat feels heavier and more tactical, and the Leviathan Axe adds depth and precision. Exploration and storytelling are tightly connected, creating an unforgettable adventure.\n\nVisually stunning, emotionally powerful, and brilliantly written — God of War stands as one of the best action games ever made.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Just go for it,, great  story great lore and gameplay plus we get to play our boy again",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "So im not entirely sure how to feel about god of war these days, when i bought this i thought that i would be playing similar to GOW on ps2 era, and it plays more these days and in this one like a souls-like game, especially on harder difficulties where its highly punishing and focuses on dodging and range combat in order to survive. That being said, its not a bad game, its got a decent story. The animations are cool, and the game visually has came a very long way from the OG games. i do wish the combat was a bit like the OG personally, more of a button masher type, where every enemy you execute drops heal orbs and such, but i guess they just cater to the masses and transitioned the gameplay to this at some point. its not bad, it just wasnt really what i was hoping or expecting for. The only other complaint i really have is the game isnt particularly specific at certain points where to go / how to specifically get to the next area, althoug ha quick google search or youtube clip will solve that issue. theirs also puzzles in the game, standard to gears of wars long game history, however in this game their relatively easy to figure out compared to its predecessors, the crafting system adds a decent element or grind to the game if you want to max out your gear and weapon stats.. and yeah i guess thats pretty much it that i can say. \nSTEAM DECK USERS\nit runs okay on steam deck, its definitely managable but it does drop frames here and there, im not entirely sure why because it doesnt max out cpu or anything like that even on higher settings, so it could just be the game or maybe im not using the right proton version, idrk, but its playable on deck which is mostly where my hours are these days, just expect some fps drops here and there for whatever reason.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Amazing game with a great story line, i've heard the next one is even better, but I have decided to 100% this game before moving on. You don't have to know the story line for the previous games to understand this one either, but learning about it makes the story that much better. I highly recommend for anyone that enjoys a good action rpg game that get immersed in the story of it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game runs really well, is great fun too. Excellent story so far and the progression system is balanced. Id recommend it to anyone",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game, story amazing.\r\nLots of post-story content to explore as well.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredible game.\r\nCompelling story, masterful gameplay, salamander juices leaked onto my canvas today.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely stunning game from start to finish. The story is powerful, the world is amazing, and the combat system feels incredibly satisfying once you get the hang of it. It took me a while to fully adjust to the combat dynamics, but once everything clicked, every fight felt like I was watching a perfectly choreographed movie scene. The exploration is rewarding, the character development is top-tier, and even the hunting of side achievements felt meaningful instead of just filler.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy this game so far. It's a good blend of semi open world and storytelling, giving you just enough freedom to not feel trapped, yet even in moments of exploration you get lore and stories from mimir. \r\nThe part i absolutely HATE about this game are Valkeries. Some attacks have 0 telegraphing time, aka red circle appearing while im already taking damage, and borderline unfair mechanics some of these have. For example one of them can blind you, greatly reducing your FOV and then from within that fog she is attacking you with unblockable attacks. The same valkerie also has some attacks that have identical buildups/telegraphing but some are blockable and some are not. It's infuriating when you cannot win because the enemy seems unfair. All rest is absolutely lovely in this game, i am glad that valkeries are optional as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AMAZING game its story is one of the best in the world allowing you to explore so many things find many things and have a great time sure its hard but that is also what makes it good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game offers an emotional story with fun gameplay and breathtaking scenery",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game still holds up. Excellent graphics, fun game play, and an engaging story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A stunning reinvention of the franchise. It trades Kratos' old rage-fueled chaos for a deeply emotional journey about fatherhood and redemption. The bond between Kratos and Atreus gives real heart to the story and the seamless one-shot camera makes every moment feel cinematic and intimate. Combat is brutal yet strategic, with the leviathan axe feeling incredibly satisfying to wield. The Norse world is beautifully crafted, full of mystery and life, and the soundtrack perfectly captures its epic tone. This isn't just an action game - it's a masterpiece of storytelling, design and emotion. Easily one of the best games of its generation and I can't wait to play the next one!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "excellent game, great continuation, wonderful story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i havent beat this game but my friend the john beat this from the steam family and told me to leave a review so john of war has beat this and recommends this game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It is good. So good that I even got all the achievements for it. Not going to play the New Game+, but that's because I am more into narrative and exploration part of the game, and they are all covered now. Or most of them, at least. But I now know that I will be getting the sequel, for sure.\n\nFirst thing that I've noticed was how insanely good it looks with HDR on QD-OLED. It's been almost a year now since I had ASUS PG32UCDM, and this is the first game, where enabling HDR truly changes the experience. In previous games, even in those where there was a specific HDR toggle, it either did not do much for the picture at all or even made it worse. GYLT became very washed out, AC Mirage made night look like it's day... Dead Island 2 seemed to make scenes have more details, at least, but can't say if it mattered that much overall, since I completed the game shortly before I got the monitor, so just used it for a quick and dirty test of HDR, nothing else.\n\nIn GoW it makes a lot of difference. Not like you can't play in SDR or anything, but when I took a short break and my monitor semi-turned off due to proximity sensor, which semi-disabled HDR, I noticed that because something felt wrong, like everything is almost gray (not the washed-out effect, it looked different). Early in the game there is a scene where a candle-light is shown very close to the screen, and it felt almost real. Highlights on armor and weapons (and generally on metal things) also look amazing when HDR is enabled.\n\nUntil you get to some scene, where textures won't load right away. Yup, that happens, and relatively often, even though my PC is quite powerful, I have 24Gbs of VRAM, 64Gbs of RAM and 990Pro for SSD, so no reason for them not to load, but it was happening periodically. Often times, it as something small, but sometimes bigger objects also did not load properly. Including the World Serpent, which looked very bad. I also did not notice any pattern for this behavior.\n\nSpeaking of the Serpent: the sense of scale is great here. Seeing the Serpent for the first time is practically jaw-dropping. The fact that you can see it from a lot of places on the map also adds to this feeling of... \"Smallness of oneself\". But it's not just the Serpent. There are dragons, albeit just a few of them, and there was at least 1 giant. But even more common ogres and trolls feel imposing. Not like that affects combat system, but it does help somewhat with the narrative and overall feel of the environment.\n\nThe combat itself, though, is not to my liking. I think biggest issue for me is the camera placement. Yes, it makes fights more personal, but forces you to rely on those small arrows to know where enemies at your back are. Arrows that were very difficult to see in some lighting, because they were just blending with it. Having no way to quickly turn and switch between enemies (besides the quick-turn button) did not help me much.\n\nAnother part was the use of axe. This is just personal preference, I guess, I am more partial to swords. Or maybe it's more about how slow and heavy it felt. Slower and heavier than combat in Batman Arkham series. And it makes total sense to be that way, and hitting with the axe can feel quite satisfying, too, it's just I am more used to DMC-like combat which both gives you a little bit of extra range, ability to see more stuff around you and react better to situations. It's more... Fluid, I guess. Blades, which get unlocked later in the game, were better, but they felt almost like a long-distance weapon (which again made sense), so less personal. They did feel very good when dealing with large numbers of enemies at the same time, though.\n\nThere is another problem with the combat for me and it's that it felt quite repetitive for me. You do have some \"tools\", that can add variety, but to me they felt almost situational. There are also not that many combos. I was mostly tapping \"X\", sometimes using \"Y\" (mostly for cleave attack, really), waiting for the runic attacks to get off cooldown, and periodically using arrows. Oh, and dodge and parry, of course. It is possible, that I am just a noob, though.\n\nI would also prefer more diversity with finishers. It looked to me like every enemy had only 1 finisher, and it did not matter whether I was using a weapon (and which weapon exactly) or not. So while they feel good, they became stale at some point. Boss fights also were not that interesting in terms of mechanics. There were challenging fights, don't get me wrong, but I think only fight against a dragon, where you had to throw stuff at him was somewhat unique (although reminiscent of fights with Ancients), while the rest were more about how frequently some attacks are thrown at you that you need to dodge/parry, and amount of damage you receive, if you get hit. But, at least, you can summon a squirrel.\n\nBut I think this game is not so much about the combat, as it's about exploration and narrative. Which can't really be separated here, and that's a good thing. Level design and thus environmental story-telling is amazing here. I also liked it, that it did not went as far with \"open-world\": it is \"open\", yes, but the number of diversions is limited, and you can complete most of them while moving towards the main goal (or side quest goal) without much of backtracking. You will need to backtrack to collect everything, of course, but to me it did not feel like a pain, at all.\n\nOne of the reasons for that was banter, which is part of the narrative, as well. This was one of the complaints I had about Banishers(which clearly was inspired by GoW), where travelling from place to place was almost always silent, even though you had 2 characters. In GoW it's not the case. Atreus talks, Kratos responds. Mimir... Talks a lot. Yes, a lot of those talks happen when you are on boat, and less so when you revisiting the same location (although some places can have extra dialogues, if you return to them later in the game), but they are timed quite nicely, so that I rarely got bored traveling from place to place, and when I did get bored, it was closer to the end of the playthrough, probably because the set of dialogues has depleted.\n\nAnyway, those dialogues are not just a \"nice to have\". They also tell you more about the world (and Norse mythology), as well as show father and son bonding. Which is, obviously one of the main themes of the game. And, let me tell you... Even though Kratos is far-far-far from perfect, there were times, when I caught myself thinking, that I would have preferred him to my own father. Note, that I have not played previous games (since PC gamer), and I now would like to know what brought him to this point, how was he before. Regardless of that, there was clear care for his son, and we can see how he grows through-out the game. Those banter dialogues expand somewhat on that growth as well.\n\nNarrative is not always perfect here, of course. Earlier in the game, for example, they decide to randomly hunt a boar, despite the idea of heading directly to the mountain. Some of the side-quests are essentially courier quests with maybe a new location to explore. Although there are some that do show a bit more bonding of Kratos and Atreus, at least through sharing some feelings.\n\nBut then there are seemingly little things, that just... Work. Like how you get your \"compass\" in UI, and how it makes sense from internal lore perspective. Or how the main story ends not with a fight, but essentially with walking and more banter (and a few cutscenes, of course). As if it's not really an action game (with some RPG elements, which are fine, they seemed to connect with everything else nicely), but a story-driven game. It made the ending feel more personal, and thus more satisfying.\n\nSo, yes, I can recommend this game, for sure. It is a good one, and it's been awhile since I was this satisfied with a game. I'd probably even give it 9/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely amazing in all aspects! The story, characters, atmposphere, gameplay and cinematics are all cream of the crop.\r\nI haven't got any complaints.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After finishing Sekiro, parry mechanic in this game is way too easy. Though I like the graphics",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Best game in world fr.. \nStory, movement, musics, gameplay, graphics...\nim a person who doesnt like story games but this game made me addicted to itself.. i woke up in the morning wash my face and start to play this untill i have to go for something...\nEspecially story and musics are so good..\nif u dont like this game u are GAY fr",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "⭐ God of War (2018)—A Rebirth So Powerful It Feels Like Myth Being Forged Before Your Eyes\n\nThere are games that entertain,and there are games that leave fingerprints on your mind.\nGod of War (2018) belongs firmly to the second category.\nThis isn’t a reboot—it’s a ritual,a cleansing fire,a transformation so bold it feels like the developers broke the old series over their knee and forged something new from its ashes.\nAnd somehow,it works.\nHell,it more than works—it shines.\n\n⸻\n\n🎮 A Father,A Son,And A Silence That Says More Than Words\n\nThe very first scene doesn’t scream for attention—it whispers.\nAnd that whisper is heavier than any roar in the franchise’s past.\nKratos stands beside a pyre,and the world around him holds its breath.\n\nThis isn’t the rabid god-slayer you remember.\nThis is a man trying not to break as he holds an axe instead of the past,a son instead of revenge.\n\nAtreus isn’t just a companion—he’s the mirror Kratos avoids looking into.\nAnd every time Kratos says “Boy,”it carries a universe of things he’s afraid to say out loud.\n\nTheir relationship doesn’t just move the story forward—it reshapes it.\n\n⸻\n\n⚔️ Combat That Feels Like Wrestling With The World Itself\n\nThe Leviathan Axe isn’t a weapon—it’s a statement.\nThrowing it feels intoxicating.\nCalling it back feels like casting a spell.\nCrashing it into an enemy feels like breaking the sound barrier with your bare hands.\n\nFights are slower,heavier,more personal.\nYou don’t dance—you endure.\nYou wait.\nYou strike.\nAnd when you do,it feels like you’re bending fate itself.\n\nAtreus jumps in with arrows and attitude,and somehow becomes the missing piece of Kratos’s violence—precision wrapped in childhood.\n\nThis isn’t button-mashing.This is battle poetry.\n\n⸻\n\n🌍 The Norse Realms—Where Every Rock Feels Like It Has a Story to Tell\n\nMidgard doesn’t feel like a level.\nIt feels like a memory—a half-forgotten tale someone once told around a fire.\nThe forests feel watchful,the mountains feel ancient.\nAnd every creature looks like it crawled straight out of a saga older than language.\n\nAlfheim glows like a fever dream.\nHelheim cuts like ice in the lungs.\nEven the lake—a simple lake—has more personality than some game protagonists.\n\nThis world isn’t just beautiful.\nIt’s mythic.\n\n⸻\n\n🧩 Puzzles That Don’t Annoy—They Invite\n\nThe puzzles aren’t chores—they’re whispers.\nEach one feels like the world testing you,seeing if you’re worthy enough to go deeper.\n\nRune locks hum with quiet magic.\nMechanisms clack with dwarven precision.\nNothing feels forced.\nEvery solution feels like a small victory,every chest like a wink from the devs.\n\n⸻\n\n🎭 A Story Made From Grief,Steel,and a Quiet Hope\n\nThe goal of the journey is heartbreakingly simple:scatter a mother’s ashes at the highest peak.\n\nBut the journey?\nThe journey is a slow-burning masterpiece.\n\nThemes swirl like storm clouds:\n\t•the fear of becoming your father,\n\t•the guilt of what you’ve done,\n\t•the hope that your child will be better than you,\n\t•the dread that they might not be.\n\nKratos is a character made of stone trying desperately to become flesh.\nAnd every failure,every sigh,every silence hits harder than any monster you fight.\n\nAtreus grows,cracks,learns,and rises.\nAnd watching him change is like watching dawn break over a battlefield.\n\n⸻\n\n🎵 Music & Voice Acting—A Soundtrack Forged From Bone and Stardust\n\nBear McCreary’s music doesn’t play in the background—it carves runes on your spine.\nThe choir,the drums,the weight of every note—it feels ancient,powerful,timeless.\n\nChristopher Judge doesn’t voice Kratos—he embodies him.\nEvery word feels like a mountain groaning under centuries of snow.\n\n⸻\n\n✔ Final Verdict—A Masterpiece That Doesn’t Ask for Your Respect.\nIt Earns It.\n\nGod of War (2018) isn’t content with being good.\nIt aims for legend—and hits the mark like the Leviathan Axe hitting a frozen skull.\n\nIt’s emotional without being sentimental.\nBrutal without being hollow.\nBeautiful without being fragile.\n\nThis is what happens when a franchise grows up with its players.\n\n⭐ Score: 10/10\n\nA rare game that doesn’t just tell a story—it leaves one inside you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "God of War (2018) is an absolutely phenomenal experience, even for newcomers who only know the series from internet videos. The story is outstanding, presenting a complex, emotional, and deeply human tale centered on the evolving father-son relationship between Kratos and Atreus. The cinematic presentation, driven by the masterful single-shot camera, immerses the player entirely, making it feel less like a game and more like an epic, personal film about redemption and legacy. Coupled with the incredibly satisfying combat, especially the iconic Leviathan Axe, this title stands as a narrative masterpiece and an essential must-play adventure within the rich Norse mythology setting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War has a great storyline and does Justice to Kratos's comeback. Visuals are outstanding, combat is unmatched and overall theme is solid. Definitely a game to try in a lifetime. I'd rate it 8.5 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "solid game, the story and gameplay is top tier. I've only played it for a bit because my life is busy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of war has a really good story, but perhaps it may be too challenging for some folks. \r\nBut other than that everything is perfect. Fun mission, long cinematics which reflect the grief of losing their mother and wife. Which also rounds up the main story, about travelling to the highest peak in all of the realms to spread her ashes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A story of this quality with mechanics that feel gratifying deserve an A+ on my gradebook",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and amazing story! The nostalgia took me back to the original trilogy😭 Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some people think that God of War is a game to kill and level up with some story.. But its a tale about a father and his son. With gods and myth. 100% recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had fun playing this game. took me a little less than 20 hours to beat the game without side quests. Great game if you can get it on sale. Also, this game runs really good, didn't have any stutter or major bugs while playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War (2018) delivers an incredible story, gameplay, and visuals. The narrative is emotional and engaging, and the combat feels satisfying and challenging especially on Give Me a Challenge difficulty. Boss fights are memorable. The graphics are stunning, and the PC port runs smoothly with no performance issues. Overall, it’s a fantastic experience and absolutely deserving of its GOTY title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game looks stunning and is a great adventure so far. I've been playing 3 hours and it has been so fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game , made me ignore my cousins begging for attention. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing storyline, great character development, and amazing music and cutscenes that all tie together to create a masterpiece of a game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really enjoying it so far only problem was a weird shadow glitch where chessboard type of shadows would glitch out and appear on the floor for no reason",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um dos melhores jogos que já joguei na vida. Divertido e desafiante na medida certa. Top!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are some pretty hefty puzzles but after you get into it with some background music you´ll never want to stop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sem dúvidas um dos melhores jogos que já joguei boa história mas sinto saudade de quando god of war era sai mantando tudo que tive pela frente",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the story is nice the weapons and the features should buy it while its on discount",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game, highly recommend if your into single player games with a great story and open world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game to the fullest and got all the achievements. This is the best story telling game i have ever played. It has layers and layers of story and lore which is presented to the player smoothly combining it with one of the addicitve combat gameplay. Definitely would recommend this game to you to try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great story, progressive gameplay, fun but a little infuriating at times combat, easily one of my favourite games ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] 10 / 10 [/h1]\n★ = Story\n★ = Content\n★ = Gameplay\n★ = Difficulty\n★ = Music\n★ = Sound\n★ = Graphics\n★ = Performance\n★ = Support\n★ = Replayability",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game really makes you FEEL like you're wrestling with the demons of your past while trying to be a positive father figure in a way that you never had yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the god of war games are worth playing through if you haven't. some of the best games ever made in my opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this has to be one the best game that i have ever played i love the story the game play i would vary much recommend this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good story game so far, 100% recommend. Worth the money for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game with awesome storytelling and fighting mechanics, Kratos is such a badass. Wish they would have just deleted Nilfheim from the game and the final valkyrie was complete cancer to complete even on normal difficulty. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "what a game, the first boss fight alone gives it the right to win game of the year,and the story telling is just perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War isn’t just a great game—it’s an unforgettable journey. From the first moment Kratos and Atreus step into the Norse wilderness, the world feels alive, dangerous, and rich with mythology. The attention to detail is incredible: every environment, every enemy, every piece of lore adds depth to a story that is both intimate and grand.\n\nThe combat is absolutely phenomenal. The Leviathan Axe feels weighty, satisfying, and endlessly fun to use. Every swing, every throw, and every impact has a brutal precision that makes battles feel intense and rewarding. And as the game progresses, the variety of abilities and weapons keeps combat fresh and exciting.\n\nBut what truly sets God of War apart is its emotional core. The relationship between Kratos and Atreus evolves in such a natural, heartfelt way that you can’t help but get invested. Watching Kratos struggle with fatherhood, grief, and his own violent past gives the story a depth rarely seen in action games.\n\nCombine all that with stunning visuals, a beautiful soundtrack, thoughtful puzzles, and a world begging to be explored, and you get a game that’s not just fun but genuinely meaningful.\n\nGod of War is a masterpiece—powerful, polished, and unforgettable. A must-play for anyone who loves great storytelling and epic adventures.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God Of War is the best series pf games ever and this modern addition to the series is insanly good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the story and seeing how the boys grew and learned.  The combat was good and fun and it was a game that kept be wanting to keep playing to see what happens next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice mindblowing cenematic game with great storyline",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War 4... had a classmate I knew that could do a great Kratos impression, he advocated for the games, and so I decided to start playing 1, 2, 3 and 4. The original trilogy surprised me a lot and was WAY better than I expected. They were so good in fact that I didn't even feel a rush to play the 4th game. Then the 5th released and I was intrigued by their adaptation of norse myhtology.\r\n\r\nFinally I began playing these new installments, and I must say they are engaging, and pretty true to what God of War has always been, but all the same I do not enjoy their gameplay as much, AND IM GETTING PRETTY TIRED OF OPENING THESE CHESTS ALL THE TIME!\r\n\r\nAll in all the game delivered, and I understand why it won GOTY, because the game is very much a well made one. BOY! BOY! BOY! BOY! BOY! BOY! ATREUS! BOY! BOY! ATREUS! son?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Before playing GOW4 i was arguing for RDR2 should get the GOTY but after playing it I understand why it is the GOAT , <3 \r\n\r\nI played the previous GOW titles too enjoyed a lot but this one hits different",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game on the ps4. it was so good i just had to through and find everything i loved and everything i missed the first time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game story is amazing gameplay simply great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool and I loved the combat and how huge everything was, and the parkour was great. I recommend to people who like fast paced games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had to repurchase the game for Steam, since I switched over to PC from PS5, but this game has not lost it's beauty and story. Gameplay is still absolutely amazing and I've already platinumed this once. Going for my 2nd. Highly recommend to anybody who enjoys collecting, puzzles, and GoW in general.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute beaut of a game. It ABSOLUTELY still holds up to other games to this day even as of november 2025, no question. The BIGGEST flaw is having to actually fully climb down stuff instead of just jumping down small ledges you shouldn't need to climb down, im sure that says enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good but i finished the game too fast because it was so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is graphically awesome, and the story gets better each time you advance. The game sort of lets you find your way out of the story, but it's still fun to get things and beat the bad guys along the way.\r\nIt's pretty quick and like I mention the graphics are one of the best, for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome, with superb voice acting and player models, all thanks to the very talented people who put this game together. Chris Judge was the perfect voice for Kratos. The storyline is incredible, with many hidden challenges and a somewhat open-world experience. Finding chests and collecting various items along the way is really fun. One thing I've learned from games like this is not to directly follow the main quest, as you’ll miss some hidden items. Then you can proceed with the story. Overall, I would give this a major thumbs up. Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War  is the most emotionally exhausting dad simulator I have ever played. I went in expecting to smash monsters, not to unpack 20 years of Kratos trying his best to be a functional parent. Every fight feels epic and every conversation with Atreus reminds me that even a former god of rage gets roasted by his kid. The whole game is basically a road trip where everything wants to kill you and your son keeps asking questions you are not emotionally ready for. The combat is incredible, the world is gorgeous, and the Leviathan Axe is so satisfying it should probably be illegal. Absolute legendary experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War delivers an unforgettable journey packed with emotion, stunning visuals, and incredibly satisfying combat!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story rich game, with awesome combat and a lot of hours of entertainment. Still 7 years after its release, and is one of the best games I have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I usually pick up games on sale and play it for like 20-50 hours before getting bored but I love this game so much. The combat feels good, the story is good, the design and the visual and audio are amazing. Those stupid birds are pests though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Boring at the beginning, get's more and more exciting towards the end! \r\n\r\nTakes patience to appreciate the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Graphics Quality Fantastic Video Gameplay Awesome Story adds more interesting to make exciting and thrilling to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is both a cinematic masterpiece full of rich lore and storytelling and has extremely fun and engaging combat and also Kratos is just badass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my 3rd favorite story game ever. The world building is amazing and I genuinely lost track of time on multiple occasions. I only finished the main campaign too. I haven't even touched Muspelheim or Niflheim, so there is an absolute crap ton of content to do. 10 fish/1 hedgehog. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty cool but unfortunately this game will not let me beat my son",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game reminds me how great it would be to have children - and also how fucking awful it would be having children.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game but for some reason i had visual errors",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Recommend it for single player only if you like story driven games. & Just want to vibe out and chill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game! Graphics are wonderful, story is so well done and grabbing. Side characters are even funny and awesome. The fighting mechanics is very nice, not too complicated to understand the mechanics and rune buffs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To me, God of War (2018) is more than a simple reboot; it is a narrative triumph that has set the franchise on a completely new course.\nThe story is the absolute highlight of this game for me. I experienced the emotional journey of Kratos and his son Atreus as having unparalleled depth. The interaction between the gruff, struggling father and his uncertain son forms the beating heart of the adventure. I find it to be pure narrative mastery that captivates me from start to finish.\n\nUnfortunately, the combat cannot match this high standard for me; I find it to be very mediocre. The introduction of RPG elements, such as skill points and gear, feels superficial. I noticed that the upgrades had little to no effect on the gameplay, which meant the strategic element was missing. Furthermore, I find the chosen camera angle, tight over Kratos' shoulder, not optimal for the battles, which often led to chaotic and frustrating situations.\n\nVisually, however, I find the game an undisputed success. The graphics are enchantingly beautiful. I am amazed at how good this game, originally released in 2018, still looks. The Norse realms are spectacular, and thanks to modern optimizations (like DLSS on PC), the game runs like a dream for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I heard this game won GOTY over RDR2 so I want to try it and WOW this game is amazing.\r\nBoth are very very Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A little late to the party, but amazing game. Not surprised it won goty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War is a video game that will be looked at fondly for many years to come. God of War's experience is brought to life from an incredibly immersive combat system and deep storytelling. Loading screens are a thing of the past in God of War, as it contains virtually no loading screens. 10/10 must-buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A masterpiece. You likely do not need me to tell you. This game is sure to become a classic. I really appreciate that the story delves into complex emotions and relationships, non right or wrong circumstances and outcomes, and innocents in the face of tragedy and terror. The graphics are great even today in 2025. Bravo. I am picking up the next in the series for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyed every minute of this game. The puzzles were enjoyable & the story was an absolute masterpiece. Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loving this game so far. Addictive. Fantastic story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, good story and good lore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Firstly I just want to take a second to thank the devs for making one of the best games I've ever played, seriously just play the game, and you'll see, but now the review starts. From the gameplay to the story to the charters, this game never misses a beat, when it wants you to feel a way you will and when it wants you to throw your controller at the screen after hearing Valhalla for the 400th time you will. \r\n\r\nGameplay, superb from movement to attacks feeling and looking smooth combos fitting the charter and the different weapons to even rage mode feeling close and gritty! I loved every second, even the downtime boating around Midgard, listening to the charters share stories and jokes. Bosses felt challenging and sometimes annoying, I'm looking at you final 3 Valkyries but in a good way.\r\n\r\nStory, I don't even know what to say. Just fantastic all the charters were great even when they're annoying It's for story reason and the devs intended it that way. The charter arcs were crazy from Atreus being an unknowing child to finding out that thing and becoming annoying AF but at the end learning the error of his ways. Kratos even has charter arcs which can only be truly understood by playing. The pacing is perfect taking you from one part of the game to the next and even having stances that allow you to go off and do side quests without missing anything overall this game is amazing and has given me a new found love for the god of war franchise and Norse mythology.\r\n8.5 / 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but I hate games that has enemies with levels. That is so frustrating. Anyways good game but still Red Dead Redemption deserved to win GOTY! This is nothing when comparing to Red Dead Redemption 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As being my one of the first pc games, the experience was amazing and would definetely recomment it to anyone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good cinematic game with a welcome maturity and complexity brought to Kratos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War is a glorious experience and a more than decent way to lose 60 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s one of the best games I’ve played, hands down. The graphics are outstanding, the combat feels excellent, and the story is exceptionally welldone. I would absolutely recommend buying it  it’s fully worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic down to it's finest details\n\nThe fighting feels amazing and can be genuinely challenging in parts, the puzzles aren't too challenging which is something I think serves the game well\n\nStory feels like a movie it's incredibly cinematic\n\nCharacters are fantastic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated game love the graphics and the way that kratos and atreus characters seem to swap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When i saw some Playstation exclusives were coming to steam, I excited to finally try the God of War series. I found some amazing character and setting graphics, combat feels fun and progression to upgrade and get new abilities feels good, Can't speak much on story since this is my first GoW and I am early in this game but everything is voice acting and it is good. While not an RPG familiar simple mechanics and stats are welcomed, Game is mostly linear but with hidden loot for puzzle solves and finding hidden areas. Soundtrack is minimal while picking up during fights. A nice high quality game that is $20 on sale every here and there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "God of War 2018 is a great game. The combat is great, and the story is really good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game for every type of player. Loved every bit of it, EXCEPT THE VALKYRIE QUEEN SHE CAN GO eliminate herself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "start felt a bit slow at first, but in the end its worth it and starts building up the pace real good, i didnt like the combat at first as i prefered the more traditional hack and slash gameplay of the previous games. but i think this game is probally my #1 favorite hack and slash now, trust me this game is worth completing and doing all the side quests for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game I recommend graphics 10/10 gameplay 10/10 even better with a controller played it first on the ps4 and now on pc way smoother 100% recommend. A must play",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "So, this purely comes down to taste. It's not a bad game by any stretch, but I will say on a keyboard with a PC, the controls are exhausting to figure out / remember and not especially functional in the heat of the moment (because of how complicated some of them are). I also didn't like the menu or map layout at all and found it pretty annoying to navigate. \r\n\r\nOn the note of taste, though: I just found the game very restrictive, the upgrading kind of boring, and the gameplay so-so. As much as everyone praises the storytelling, I didn't personally find it that rich, either. Ghosts of Tsushima was the game I played before this one, and I found GoT to be an infinitely more engaging experience.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Pros:\n\n- Great graphics\n- Great story\n- Good pacing\n- Good voice acting\n\nCons:\n\n- Input lag on keyboard\n- Combat feels bad and unrewarding \n- Exploring becomes tedious\n- Upgrading is a tedious grind (Fog)\n- Button-mashing on keyboard sucks\n\nOverall, it’s a good game but the mechanics aren’t great. If you’re planning to buy it, I highly recommend using a controller for a much better experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'll be entirely honest, I just don't get the hype behind this game. This is not God of War; it's boring, slow paced, and the fact that you have leveled gear is just awful. I did not have fun at all for the short time I played this and I will not be continuing to play this nor will I ever beat it.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "The game for some reason includes exploration, and lock progression behind it.\r\n\r\nthe game also provide you with fast travel mechanic, but locks it until later on in the story. \r\nit tells you to go explore, but then lead you to a locked area that you cant explore until later on. \r\nit provides you with side quests, but the main character keep crying about not wanting to do them.\r\nmenus are atrocious. \r\n\r\nthe game would have been better if they removed exploration and kept it a purely story experience. but they didnt, which makes the game really bad in my opinion.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "You guys glizzed a game with terrible unrewarding combat\r\nThe parrying is terrible where you're stuck in a tennis match..where posture bar regenerates immediately like a street fighter training room\r\nGame lack creativity with the one hit kills \r\nPretty much a swipe swipe dodge experience...you can barely fight ...im certain people with those long combo videos had to have beaten the game4 times for the npc  not to fight back",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "brother like the game looks kinda good and the story is cool at times but the boy is so fucking annoying and the combat is repetitive and the cutscenes take forever and I just wish the game was done earlier but at the same time I played the whole game as a drinking game so maybe that's really the problem and not the game itself nobody will ever know",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Yeah no.\r\nThe storytelling delivers an interesting take on mythology (and is, imo, quite an improvement over the original trilogy), and both graphics and sound design do a great job at setting the scene; but, oh dear, the gameplay is a tedious, monotonous slugfest at the best of times - and then it devolves into a bungled mess with lots and lots of badly and inconsistently timed attack cues, stun locks (not even the punishing kind, they just take dozens of seconds at a time while dealing chip damage at most), hyper armor and blatant invincibility when the former's not enough. Couple that with the ridiculous material grind to get good gear, as well as regular crashes, and you're really better off just giving this game a pass.\r\n\r\nWatch the story as a video, play another game from Sony's studios instead if you're after their flavor of immersion (they're usually better at this, I don't know what happened here), you'll have a better time that way.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Great Game, would recommend but the pc version keeps crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck that shitty ass kid that dont help or do shit as i get raped by six dragurs\n\n\n( i love this game)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game for some reason includes exploration, and lock progression behind it.\r\n\r\nthe game also provide you with fast travel mechanic, but locks it until later on in the story. \r\nit tells you to go explore, but then lead you to a locked area that you cant explore until later on. \r\nit provides you with side quests, but the main character keep crying about not wanting to do them.\r\nmenus are atrocious. \r\n\r\nthe game would have been better if they removed exploration and kept it a purely story experience. but they didnt, which makes the game really bad in my opinion.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Unfortunately the story & exploration were too bland to really catch me. Combine that with the countless collectables for every upgrade, instead of actual cool items, just really took te fun out of it for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a 7/10.\r\n\r\nThe game is pretty good in terms of general quality. The way the game is portrayed as a single piece by having no cutscenes like 1917 is awesome.\r\n\r\nIt lacks heavily in some areas tho. e.g.:\r\n1) extremely restrictive movement (no, you can't jump from that 2m ledge without a special interactive animation)\r\n2) The story starts getting good, when the game was almost over.\r\n3) Side characters except for the villains seem to be there just for you\r\n4) The world is extremely empty when it comes to non-monster NPC's, its like a zombie game but instead of zombies you get creatures of all kind.\r\n\r\nHonestly, can't believe how this won GOTY over RDR2.\r\nFor clarity, my review is negative to bring down the average, not because it's below 5/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is good, but the world is just shit in my opinion. Nothing to do nothing to see its all just a lot of scenic background.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so boring. I just finished the Greece trilogy where I do combos and cool stuff. Those games were cinematic without sacrificing gameplay. God of War 2018 doesn't do any of that. The first ten minutes was walking. Walking. WALKING! Fighting doesn't have any combos no more you just hit bumper and trigger all day. I like Dark Souls and it does that but the reason why Dark Souls doesn't stink is because they had a systems like stamina and force you to have a strategy so you wouldn't mindlessly mash button. I keep having to do FLUFFING walking sections like carrying that dang boar which Kratos the character would never do. I wish this game was good that's the sad part, I like the premise where Kratos moves to Norse myth, but noooo we have to make it like Last of Us and have a camera position made for shooters and you can't see the enemies behind you. I keep dying to offscreen archers. A year later DMC5 had a better camera that actually shows where bad guys are at. 2022, God of War Ragnorok did not learn so what the heck Santa Monica?!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "watch a fucking youtube video instead, I tried to stick it through but tedious is the only thing that describes this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To start out, if you're expecting the same experience as earlier games in the GOW franchise, skip this.\n\nI went into God of war 2018 expecting improvements and innovations the built upon the original gameplay loop found in earlier GOW titles. Instead, I found a heap of mechanics that don't feel like they should be in the series at all, and don't even work in conjunction with one another to create a satisfying, or even remotely coherent experience. The best way to describe this would be that GOW 2018 is a ham-fisted attempt at rebooting the series with little regard for what made the original games work so well.\n\nGOW 2018 can effectively be split into four segments; Combat, Puzzle Solving, RPG advancement, and Storytelling.\n\n-COMBAT- 5/10\n\nThe combat in GOW 2018 is - for lack of a better term - outrageously sluggish and unsatisfying. Between the absurdly repetitive combos, awfully balanced Runic abilities, disgusting choice of camera angle, flat sound design, and lack of enemy variety, I found myself dreading the next encounter even more than I dreaded the next 'puzzle' that the game had to offer. As of writing this review, I have made it through half of the game, and the combat has officially broken my will to continue any further.\n\nIn a game where I would expect my attack chains to feel impactful, chaining attacks against enemies is boring. Your optimal approach against most enemy encounters is a mixture of hit-and-run, and spamming runic spells, all of which feel nearly identical with the exception of range alterations as you progress through the game. \n\nThe 'spellcasting' in this game is another can of worms entirely. Not only does it not synergize with the existing attack chains offered by either of your weapons (All two of them) spellcasting seems to trivialize encounters. All of the runic spells feel like they were added to the game after-the-fact with little regard for how they would actually interact with your innate weapon skills.\n\nLast on combat is Atreus, and the bow. This feels like yet another mechanic slapped onto the game for no particular reason, other than to fulfill the need for puzzle variety. There's no depth to his arrow or summon selection, and you'll mostly default to spamming square since there was no thought put into the timing of his attacks in conjunction with your own. I feel like I don't need to explain why mashing Square is irritating. At some point, I just stopped using him altogether.\n\n-PUZZLES- 4/10\n\nPuzzles in GOW are what you would expect from the GOW genre. Move thing there, press button here, etc. For the most part, they are annoying, and in the way of progress. If the game was fast paced, this wouldn't be as much of a problem, but with combat encounters already being sluggish, every slowdown between them was a motivation killer for me.\n\nOccasionally, you'll come across a well-crafted puzzle that - while not difficult in the slightest - does serve to give you a little break from the monotonous tone of the entire game.\n\nOverall though, I'd say they were a huge waste of time.\n\n-RPG ADVANCEMENT- 2/10\n\nI'd say that the crafting, gear, and general overall stat-block of GOW 2018 is a joke, and may be the most unnecessary addition to this franchise. \n\nWith the puzzles in this game already being a gigantic slog, I was at no point motivated to actually go out of my way to find gear. Despite this though, I had accumulated over 30 pieces of useless equipment by the half-way point of the game, 90% of which I would never even consider wearing. Build variety is largely unimportant in the game, save for the occasional \"Equip this to take less damage from X\" gear that I refused to use.\n\nThere's not much to say on the gear in GOW 2018, other than it's a pointless, ultimately annoying addition that you can effectively ignore as long as you're decent at Dodging/blocking. However, by ignoring the RPG elements of the game, you're punished with spongey encounters, forcing you to indulge in this nonsense in order to shorten the sluggish combat as much as possible.\n\nSkill leveling for each of the weapon is - likewise - uninteresting and largely pointless. At no point did I feel like I needed to use anything other than the Leviathan Axe's improved 4 hit combo, or the improved combo for the blades of chaos. The combat encounters are not designed in such a way that the improvements for either weapon tree are actually meaningful at all, making them feel out of place, and slapped on for the sake of padding the already atrocious RPG elements in the game.\n\nAdd on that the menus are ugly, obtuse, and a pain in the ass to navigate considering the bloat of item types in the game, and you've got an utter shitshow.\n\n~STORY~ 6.5/10\n\nI'll give it to this game, humanizing Kratos was the right direction for the franchise to take.\n\nUnfortunately, besides that, the story telling in GOW 2018 is just alright. While most of the VA's give an outstanding performance, the game's script is exceptionally mid, at best, and it is consistently bogged down by the irritatingly slow pacing of the gameplay, and everyone's least favorite trend with modern games - Dialogue bloat.\n\nAtreus, for one, never shuts the hell up. Not only does this child yap constantly throughout the game, but his dialogue is extremely stilted, his lines are inconsistent, and his characterization is so ham-fisted that I felt like I was listening to a damn Sunday morning Cartoon, and not a dark-and-gritty reimagining of God-of-War. Atreus as a character is so tonally deaf, that I was about to mute his dialogue at several points throughout the game just to get a break from his incessant chatter. Unfortunately, I made the uninformed decision that he might say something interesting while roaming the overworld. \n\nHe never does.\n\nThe game's focus is the dynamic between Kratos and his son. While I feel that there are moments that shine above the rest and capture sparkles of incredible storytelling, they are layered between hours of what I can only call melodramatic, hollywood nonsense. Atreus is unrealistically stupid, Kratos is absurdly unreasonable, and many of the conflicts between the two feel so manufactured that it hurts to listen to.\n\nAs with most AAA games, you should not go into this expecting an exceptional story.\n\nOverall, this game was an incredible disappointment. At its worst, it is slow, uninteresting, and frustrating, and at it's best, it's a passable story about a father and his son on a journey through Norse Disneyland.\n\n5.5/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Never played such a simplistic game before. God of War was not entertaining to me, it was just the same thing over and over again with no rewards the true definition of a hack and slash . All of the rewards are either hacksilver or equipment that is worse then items at the beginning of the game. The story is so not creative. Your wife dies so you have to travel around with your weak son to bring ashes to a mt. Your fucking Kratos not Genghis Khan.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is an interactive movie not a game. You spent so much on cinematic that you forgot to add gameplay. What a joke!!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is okay.  I just can't stand how he calls his son \"boy\" the whole time.  No good father calls their son \"boy\".  So I can't stand listening to the dialogue.  And the world is basically empty except for two dwarves and monsters.  It just feels, empty.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: A horribly casual slog with boring af combat system. Combat is not even a challenge if you use only your fists. It's laughable. \n\nIn the first 6 hours, there is literally 0 character development at all, but Kratos said \"BOY\" 62 times. The story is \"go up the mountain\" and then it just turns into \"fight the same 3 enemies\" for hours. \n\nPuzzles are \"where do I have to stand to throw my axe\" and that's it. Riddleboxes for toddlers offer more of a challenge. \n\nIf that is your thing, have at it. For everyone else this is \"God of Casual\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "How did this go from slaughtering gods and boning women to performing surgery on boars and daddy day care?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yeah, i don care what everyone else thinks the combat sucks ass",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game fun, but the kid is annoying as hell!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game, I loved it too much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only liked by tourists to the series.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "never get this game terrible dont recommende it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So linear it scratched my Oled display",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I do not like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "made me rage quit 100 odd times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Baby Face Games. Insta down vote.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "add sex",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The kid is annoying, i thought he would add something interesting but he is just there to annoy you. All he does is piss you off with his annoying voice.\n\nI have made it to the world serpant only so ill give the game the benefit of the doubt and hope it gets better.\n\nForced camera movement, randomly changing mouse speed while fighting, unskippable cutscenes, respawning needs you to press the enter button or hit a teeny tiny button on screen. \n\nYou need to either lift your left hand completely and press a button and than reseat your hand or you lift your right hand from the mouse and do the same. Either way feals super clunky and yould literally been solved if it was the space bar.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It looks expensive, but the game is just mid.\n\nI haven't played the previous games. I tried to convince myself to play it three times. The beginning was incredibly dull and drawn-out, I spent the first three hours of cutscenes waiting for something interesting to happen. The only thing that sparked my interest was the presence of Kratos and the tattooed MMA fighter in the frame. That was the only thing that kept me going – anticipating the outcome of their story. Which – spoiler alert – didn't provide any particular satisfaction; it was, again, mid.\n\nThe other characters and everything that happens to them made me very tempted to press the skip button and finally get it over with. \n\nThe boy deserves a special place in hell, every single line he says makes me want to spartan kick him somewhere far away. I know there is a mod to shut him the hell up, but come on, not on my first playthrough, I want it all and raw. And no way I'm playing it again ever.\n\nThe gameplay is yawn-inducing slog, and the plot between the introduction and the conclusion is completely unengaging. Perhaps, having the experience of previous games, I would look at it all differently, but we have what we have.\n\nWhat I can highlight positively are the visuals, art design, and overall production quality. I give it an A+.\n\nI don't recommend it at full price, maaaayyybe at a big discount, but really just watch it on YouTube/Twitch and you won't miss anything.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I'll be entirely honest, I just don't get the hype behind this game. This is not God of War; it's boring, slow paced, and the fact that you have leveled gear is just awful. I did not have fun at all for the short time I played this and I will not be continuing to play this nor will I ever beat it.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "So, this purely comes down to taste. It's not a bad game by any stretch, but I will say on a keyboard with a PC, the controls are exhausting to figure out / remember and not especially functional in the heat of the moment (because of how complicated some of them are). I also didn't like the menu or map layout at all and found it pretty annoying to navigate. \r\n\r\nOn the note of taste, though: I just found the game very restrictive, the upgrading kind of boring, and the gameplay so-so. As much as everyone praises the storytelling, I didn't personally find it that rich, either. Ghosts of Tsushima was the game I played before this one, and I found GoT to be an infinitely more engaging experience.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "brother like the game looks kinda good and the story is cool at times but the boy is so fucking annoying and the combat is repetitive and the cutscenes take forever and I just wish the game was done earlier but at the same time I played the whole game as a drinking game so maybe that's really the problem and not the game itself nobody will ever know",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "fuck that shitty ass kid that dont help or do shit as i get raped by six dragurs\n\n\n( i love this game)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The Muspelheim arena fights were so unfun that it actually destroyed any bit of a good time I had playing this game. Also, did the game testers give up after the halfway point of the story? Why is EVERY fight some 30 minute endurance match. For being a god, you sure as hell don't feel like one in this game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game should have never won game of the year. It’s really hard for me to like for a few reasons. The combat is uberly repetitive to the point where it’s just the same thing over and over again. The takedown R3 moves are the exact same for the same enemy’s over  and over. Atreus will not stop talking the entire time and it’s just annoying to the point where it’s holding your hand and says “look the object is right there , or there’s the way up” when you’re right in front of it. Besides that the games extremely dizzying and watching the animations make you feel like your spinning the whole time your fighting because it’s WAY to fast and throwing the camera around the whole time. I played the games on the psp back when they first came out and those felt like epic battles that were impossible to win, and this game even on hard is just like a weird way to make parrying attacks mean basically no buff. At a certain point in the game the enemy’s are just absurdly easy. I played on the hard difficulty and the only enemy’s that even give you a hard time are the Valkyrie’s and they don’t mean anything to the base story. You don’t fight any epic god that feels like a god. It feels like your a strong man god guy and your fighting a random ufc guy. I remember being in awe of bosses (from the old game) that were actual giant colossus and you felt like you were a god battling a god. I will say the positive is the voice acting of Kratos it’s a phenomenal voice and the snakes bass voice was epic on headphones but other then that the levels are made to look big but it feels small in a way I can’t explain properly. There’s really nothing to look at, other then a few mountains and giant snake and even in later missions it’s just kind of blah. The story really doesn’t make any sense like omg I’m shocked. It’s very much like a movie made for a streaming service and then they make it seem like they made a huge twist and in reality it just doesn’t make any sense that anything happened. Like cool you have to do one thing and get side tracked fourteen times and then you get there and your like great I’m on top of another mountain with your whiny little girl boy who basically acts like a boss but Karri’s is the god of war and the fact he’s having a coming to the light phases to be really a hero   , and it takes away from who kratos was and what the games were about. I want to play as a god who doesn’t take anything. Gets revenge and reeks havoc because everything in his wake he destroys. Not oh no I have FEELINGS and it’s complicated because of trauma :( Like let Kratos rip someone into pieces and just make it bada**. This felt like the PG-13 version of a used to be Rated M for mature. I mean for gods sake literally we used to ravage a god and have a mini game getting  frisky in an old Roman village with a chick. Like give me what made god of war , what it was and is supposed to be and not green blood and blue goo until someone gets taken out with a splinter. Like come on. I want to be an OG BOSS who used to be a rabid pit bull but instead turned into a lazy house cat with marital and parenting problems lol like let’s be realistic in the sense that this game was supposed to not go with the sugar coating norm of the times and I think it really shows with what they did in the second one. This will continue to happen to every other beloved characters from the past. I can’t wait to play the next installment in a series with a character I liked playing as turned into either a pacifist , nice , and not understood Individual who society sees as being a great depiction of how everyone accepts whomever you are and it doesn’t matter that the entire character is not the same character but re casted and re wrote re wired to be a different character then themselves. I was fully expecting other titles to follow suit when I saw the previews of this game and look what happened since.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Yeah no.\r\nThe storytelling delivers an interesting take on mythology (and is, imo, quite an improvement over the original trilogy), and both graphics and sound design do a great job at setting the scene; but, oh dear, the gameplay is a tedious, monotonous slugfest at the best of times - and then it devolves into a bungled mess with lots and lots of badly and inconsistently timed attack cues, stun locks (not even the punishing kind, they just take dozens of seconds at a time while dealing chip damage at most), hyper armor and blatant invincibility when the former's not enough. Couple that with the ridiculous material grind to get good gear, as well as regular crashes, and you're really better off just giving this game a pass.\r\n\r\nWatch the story as a video, play another game from Sony's studios instead if you're after their flavor of immersion (they're usually better at this, I don't know what happened here), you'll have a better time that way.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I understand they tried to reboot GOW but they ruined the game for me. The game is stunning visually, voice acting is good and story is okay. But the combat is slow, not rewarding enough to try different builds,the enemy variety is poor, you fight the same humanoid enemies and sometimes a big enemy like a troll. Kratos is slow, unable to jump or perform crazy combos, just slash, throw the hammer, stun and repeat. 5/10.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game for some reason includes exploration, and lock progression behind it.\r\n\r\nthe game also provide you with fast travel mechanic, but locks it until later on in the story. \r\nit tells you to go explore, but then lead you to a locked area that you cant explore until later on. \r\nit provides you with side quests, but the main character keep crying about not wanting to do them.\r\nmenus are atrocious. \r\n\r\nthe game would have been better if they removed exploration and kept it a purely story experience. but they didnt, which makes the game really bad in my opinion.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "You guys glizzed a game with terrible unrewarding combat\r\nThe parrying is terrible where you're stuck in a tennis match..where posture bar regenerates immediately like a street fighter training room\r\nGame lack creativity with the one hit kills \r\nPretty much a swipe swipe dodge experience...you can barely fight ...im certain people with those long combo videos had to have beaten the game4 times for the npc  not to fight back",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unfortunately the story & exploration were too bland to really catch me. Combine that with the countless collectables for every upgrade, instead of actual cool items, just really took te fun out of it for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "watch a fucking youtube video instead, I tried to stick it through but tedious is the only thing that describes this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So, I bought this masterpiece of “dad simulator with occasional axe throws” on sale just to understand one mystery of the universe - how the hell this got Game of the Year instead of RDR2.\nSpoiler: I still don’t know.\n\nGOW 2018 is … aggressively boring. I’m the type of psycho who finishes every piece of garbage I start, but this one? This game broke me. I gave up somewhere between “BOY” number 500 and my 20th identical fight in a stone arena that looked like every other stone arena.\n\nAtreus (aka BOY) is about as fun as a wet sock, the upgrade system feels like someone spilled alphabet soup over a spreadsheet, and combat gets repetitive faster than you can say “Leviathan Axe.”\n\nHonestly, I now pray the multiverse theory is real - so that somewhere, in a better universe, RDR2 actually won GOTY and balance was restored.\n\nLet’s be real: this isn’t even a game. It’s a cinematic workout for your thumbstick with occasional moments where you’re allowed to pretend to play. The only reason it won GOTY? Probably because PS4 didn’t have much else that year (as any year) and Sony needed to move units.\n\n1/10\n[h2] Would recommend… only if you need a cure for insomnia [/h2]",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To start out, if you're expecting the same experience as earlier games in the GOW franchise, skip this.\n\nI went into God of war 2018 expecting improvements and innovations the built upon the original gameplay loop found in earlier GOW titles. Instead, I found a heap of mechanics that don't feel like they should be in the series at all, and don't even work in conjunction with one another to create a satisfying, or even remotely coherent experience. The best way to describe this would be that GOW 2018 is a ham-fisted attempt at rebooting the series with little regard for what made the original games work so well.\n\nGOW 2018 can effectively be split into four segments; Combat, Puzzle Solving, RPG advancement, and Storytelling.\n\n-COMBAT- 5/10\n\nThe combat in GOW 2018 is - for lack of a better term - outrageously sluggish and unsatisfying. Between the absurdly repetitive combos, awfully balanced Runic abilities, disgusting choice of camera angle, flat sound design, and lack of enemy variety, I found myself dreading the next encounter even more than I dreaded the next 'puzzle' that the game had to offer. As of writing this review, I have made it through half of the game, and the combat has officially broken my will to continue any further.\n\nIn a game where I would expect my attack chains to feel impactful, chaining attacks against enemies is boring. Your optimal approach against most enemy encounters is a mixture of hit-and-run, and spamming runic spells, all of which feel nearly identical with the exception of range alterations as you progress through the game. \n\nThe 'spellcasting' in this game is another can of worms entirely. Not only does it not synergize with the existing attack chains offered by either of your weapons (All two of them) spellcasting seems to trivialize encounters. All of the runic spells feel like they were added to the game after-the-fact with little regard for how they would actually interact with your innate weapon skills.\n\nLast on combat is Atreus, and the bow. This feels like yet another mechanic slapped onto the game for no particular reason, other than to fulfill the need for puzzle variety. There's no depth to his arrow or summon selection, and you'll mostly default to spamming square since there was no thought put into the timing of his attacks in conjunction with your own. I feel like I don't need to explain why mashing Square is irritating. At some point, I just stopped using him altogether.\n\n-PUZZLES- 4/10\n\nPuzzles in GOW are what you would expect from the GOW genre. Move thing there, press button here, etc. For the most part, they are annoying, and in the way of progress. If the game was fast paced, this wouldn't be as much of a problem, but with combat encounters already being sluggish, every slowdown between them was a motivation killer for me.\n\nOccasionally, you'll come across a well-crafted puzzle that - while not difficult in the slightest - does serve to give you a little break from the monotonous tone of the entire game.\n\nOverall though, I'd say they were a huge waste of time.\n\n-RPG ADVANCEMENT- 2/10\n\nI'd say that the crafting, gear, and general overall stat-block of GOW 2018 is a joke, and may be the most unnecessary addition to this franchise. \n\nWith the puzzles in this game already being a gigantic slog, I was at no point motivated to actually go out of my way to find gear. Despite this though, I had accumulated over 30 pieces of useless equipment by the half-way point of the game, 90% of which I would never even consider wearing. Build variety is largely unimportant in the game, save for the occasional \"Equip this to take less damage from X\" gear that I refused to use.\n\nThere's not much to say on the gear in GOW 2018, other than it's a pointless, ultimately annoying addition that you can effectively ignore as long as you're decent at Dodging/blocking. However, by ignoring the RPG elements of the game, you're punished with spongey encounters, forcing you to indulge in this nonsense in order to shorten the sluggish combat as much as possible.\n\nSkill leveling for each of the weapon is - likewise - uninteresting and largely pointless. At no point did I feel like I needed to use anything other than the Leviathan Axe's improved 4 hit combo, or the improved combo for the blades of chaos. The combat encounters are not designed in such a way that the improvements for either weapon tree are actually meaningful at all, making them feel out of place, and slapped on for the sake of padding the already atrocious RPG elements in the game.\n\nAdd on that the menus are ugly, obtuse, and a pain in the ass to navigate considering the bloat of item types in the game, and you've got an utter shitshow.\n\n~STORY~ 6.5/10\n\nI'll give it to this game, humanizing Kratos was the right direction for the franchise to take.\n\nUnfortunately, besides that, the story telling in GOW 2018 is just alright. While most of the VA's give an outstanding performance, the game's script is exceptionally mid, at best, and it is consistently bogged down by the irritatingly slow pacing of the gameplay, and everyone's least favorite trend with modern games - Dialogue bloat.\n\nAtreus, for one, never shuts the hell up. Not only does this child yap constantly throughout the game, but his dialogue is extremely stilted, his lines are inconsistent, and his characterization is so ham-fisted that I felt like I was listening to a damn Sunday morning Cartoon, and not a dark-and-gritty reimagining of God-of-War. Atreus as a character is so tonally deaf, that I was about to mute his dialogue at several points throughout the game just to get a break from his incessant chatter. Unfortunately, I made the uninformed decision that he might say something interesting while roaming the overworld. \n\nHe never does.\n\nThe game's focus is the dynamic between Kratos and his son. While I feel that there are moments that shine above the rest and capture sparkles of incredible storytelling, they are layered between hours of what I can only call melodramatic, hollywood nonsense. Atreus is unrealistically stupid, Kratos is absurdly unreasonable, and many of the conflicts between the two feel so manufactured that it hurts to listen to.\n\nAs with most AAA games, you should not go into this expecting an exceptional story.\n\nOverall, this game was an incredible disappointment. At its worst, it is slow, uninteresting, and frustrating, and at it's best, it's a passable story about a father and his son on a journey through Norse Disneyland.\n\n5.5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Never played such a simplistic game before. God of War was not entertaining to me, it was just the same thing over and over again with no rewards the true definition of a hack and slash . All of the rewards are either hacksilver or equipment that is worse then items at the beginning of the game. The story is so not creative. Your wife dies so you have to travel around with your weak son to bring ashes to a mt. Your fucking Kratos not Genghis Khan.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is an interactive movie not a game. You spent so much on cinematic that you forgot to add gameplay. What a joke!!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is okay.  I just can't stand how he calls his son \"boy\" the whole time.  No good father calls their son \"boy\".  So I can't stand listening to the dialogue.  And the world is basically empty except for two dwarves and monsters.  It just feels, empty.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TLDR: A horribly casual slog with boring af combat system. Combat is not even a challenge if you use only your fists. It's laughable. \n\nIn the first 6 hours, there is literally 0 character development at all, but Kratos said \"BOY\" 62 times. The story is \"go up the mountain\" and then it just turns into \"fight the same 3 enemies\" for hours. \n\nPuzzles are \"where do I have to stand to throw my axe\" and that's it. Riddleboxes for toddlers offer more of a challenge. \n\nIf that is your thing, have at it. For everyone else this is \"God of Casual\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "yeah, i don care what everyone else thinks the combat sucks ass",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very average story game, doesn't do much for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game fun, but the kid is annoying as hell!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible game, I loved it too much",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Story good. Combat  retarded.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only liked by tourists to the series.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "So linear it scratched my Oled display",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "just play it on playstation bro",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "made me rage quit 100 odd times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Baby Face Games. Insta down vote.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "add sex",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The kid is annoying, i thought he would add something interesting but he is just there to annoy you. All he does is piss you off with his annoying voice.\n\nI have made it to the world serpant only so ill give the game the benefit of the doubt and hope it gets better.\n\nForced camera movement, randomly changing mouse speed while fighting, unskippable cutscenes, respawning needs you to press the enter button or hit a teeny tiny button on screen. \n\nYou need to either lift your left hand completely and press a button and than reseat your hand or you lift your right hand from the mouse and do the same. Either way feals super clunky and yould literally been solved if it was the space bar.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It looks expensive, but the game is just mid.\n\nI haven't played the previous games. I tried to convince myself to play it three times. The beginning was incredibly dull and drawn-out, I spent the first three hours of cutscenes waiting for something interesting to happen. The only thing that sparked my interest was the presence of Kratos and the tattooed MMA fighter in the frame. That was the only thing that kept me going – anticipating the outcome of their story. Which – spoiler alert – didn't provide any particular satisfaction; it was, again, mid.\n\nThe other characters and everything that happens to them made me very tempted to press the skip button and finally get it over with. \n\nThe boy deserves a special place in hell, every single line he says makes me want to spartan kick him somewhere far away. I know there is a mod to shut him the hell up, but come on, not on my first playthrough, I want it all and raw. And no way I'm playing it again ever.\n\nThe gameplay is yawn-inducing slog, and the plot between the introduction and the conclusion is completely unengaging. Perhaps, having the experience of previous games, I would look at it all differently, but we have what we have.\n\nWhat I can highlight positively are the visuals, art design, and overall production quality. I give it an A+.\n\nI don't recommend it at full price, maaaayyybe at a big discount, but really just watch it on YouTube/Twitch and you won't miss anything.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I'll be entirely honest, I just don't get the hype behind this game. This is not God of War; it's boring, slow paced, and the fact that you have leveled gear is just awful. I did not have fun at all for the short time I played this and I will not be continuing to play this nor will I ever beat it.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "The Muspelheim arena fights were so unfun that it actually destroyed any bit of a good time I had playing this game. Also, did the game testers give up after the halfway point of the story? Why is EVERY fight some 30 minute endurance match. For being a god, you sure as hell don't feel like one in this game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "You guys glizzed a game with terrible unrewarding combat\r\nThe parrying is terrible where you're stuck in a tennis match..where posture bar regenerates immediately like a street fighter training room\r\nGame lack creativity with the one hit kills \r\nPretty much a swipe swipe dodge experience...you can barely fight ...im certain people with those long combo videos had to have beaten the game4 times for the npc  not to fight back",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game should have never won game of the year. It’s really hard for me to like for a few reasons. The combat is uberly repetitive to the point where it’s just the same thing over and over again. The takedown R3 moves are the exact same for the same enemy’s over  and over. Atreus will not stop talking the entire time and it’s just annoying to the point where it’s holding your hand and says “look the object is right there , or there’s the way up” when you’re right in front of it. Besides that the games extremely dizzying and watching the animations make you feel like your spinning the whole time your fighting because it’s WAY to fast and throwing the camera around the whole time. I played the games on the psp back when they first came out and those felt like epic battles that were impossible to win, and this game even on hard is just like a weird way to make parrying attacks mean basically no buff. At a certain point in the game the enemy’s are just absurdly easy. I played on the hard difficulty and the only enemy’s that even give you a hard time are the Valkyrie’s and they don’t mean anything to the base story. You don’t fight any epic god that feels like a god. It feels like your a strong man god guy and your fighting a random ufc guy. I remember being in awe of bosses (from the old game) that were actual giant colossus and you felt like you were a god battling a god. I will say the positive is the voice acting of Kratos it’s a phenomenal voice and the snakes bass voice was epic on headphones but other then that the levels are made to look big but it feels small in a way I can’t explain properly. There’s really nothing to look at, other then a few mountains and giant snake and even in later missions it’s just kind of blah. The story really doesn’t make any sense like omg I’m shocked. It’s very much like a movie made for a streaming service and then they make it seem like they made a huge twist and in reality it just doesn’t make any sense that anything happened. Like cool you have to do one thing and get side tracked fourteen times and then you get there and your like great I’m on top of another mountain with your whiny little girl boy who basically acts like a boss but Karri’s is the god of war and the fact he’s having a coming to the light phases to be really a hero   , and it takes away from who kratos was and what the games were about. I want to play as a god who doesn’t take anything. Gets revenge and reeks havoc because everything in his wake he destroys. Not oh no I have FEELINGS and it’s complicated because of trauma :( Like let Kratos rip someone into pieces and just make it bada**. This felt like the PG-13 version of a used to be Rated M for mature. I mean for gods sake literally we used to ravage a god and have a mini game getting  frisky in an old Roman village with a chick. Like give me what made god of war , what it was and is supposed to be and not green blood and blue goo until someone gets taken out with a splinter. Like come on. I want to be an OG BOSS who used to be a rabid pit bull but instead turned into a lazy house cat with marital and parenting problems lol like let’s be realistic in the sense that this game was supposed to not go with the sugar coating norm of the times and I think it really shows with what they did in the second one. This will continue to happen to every other beloved characters from the past. I can’t wait to play the next installment in a series with a character I liked playing as turned into either a pacifist , nice , and not understood Individual who society sees as being a great depiction of how everyone accepts whomever you are and it doesn’t matter that the entire character is not the same character but re casted and re wrote re wired to be a different character then themselves. I was fully expecting other titles to follow suit when I saw the previews of this game and look what happened since.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So, this purely comes down to taste. It's not a bad game by any stretch, but I will say on a keyboard with a PC, the controls are exhausting to figure out / remember and not especially functional in the heat of the moment (because of how complicated some of them are). I also didn't like the menu or map layout at all and found it pretty annoying to navigate. \r\n\r\nOn the note of taste, though: I just found the game very restrictive, the upgrading kind of boring, and the gameplay so-so. As much as everyone praises the storytelling, I didn't personally find it that rich, either. Ghosts of Tsushima was the game I played before this one, and I found GoT to be an infinitely more engaging experience.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "brother like the game looks kinda good and the story is cool at times but the boy is so fucking annoying and the combat is repetitive and the cutscenes take forever and I just wish the game was done earlier but at the same time I played the whole game as a drinking game so maybe that's really the problem and not the game itself nobody will ever know",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Pros:\n\n- Great graphics\n- Great story\n- Good pacing\n- Good voice acting\n\nCons:\n\n- Input lag on keyboard\n- Combat feels bad and unrewarding \n- Exploring becomes tedious\n- Upgrading is a tedious grind (Fog)\n- Button-mashing on keyboard sucks\n\nOverall, it’s a good game but the mechanics aren’t great. If you’re planning to buy it, I highly recommend using a controller for a much better experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yeah no.\r\nThe storytelling delivers an interesting take on mythology (and is, imo, quite an improvement over the original trilogy), and both graphics and sound design do a great job at setting the scene; but, oh dear, the gameplay is a tedious, monotonous slugfest at the best of times - and then it devolves into a bungled mess with lots and lots of badly and inconsistently timed attack cues, stun locks (not even the punishing kind, they just take dozens of seconds at a time while dealing chip damage at most), hyper armor and blatant invincibility when the former's not enough. Couple that with the ridiculous material grind to get good gear, as well as regular crashes, and you're really better off just giving this game a pass.\r\n\r\nWatch the story as a video, play another game from Sony's studios instead if you're after their flavor of immersion (they're usually better at this, I don't know what happened here), you'll have a better time that way.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Great Game, would recommend but the pc version keeps crashing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck that shitty ass kid that dont help or do shit as i get raped by six dragurs\n\n\n( i love this game)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game for some reason includes exploration, and lock progression behind it.\r\n\r\nthe game also provide you with fast travel mechanic, but locks it until later on in the story. \r\nit tells you to go explore, but then lead you to a locked area that you cant explore until later on. \r\nit provides you with side quests, but the main character keep crying about not wanting to do them.\r\nmenus are atrocious. \r\n\r\nthe game would have been better if they removed exploration and kept it a purely story experience. but they didnt, which makes the game really bad in my opinion.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Unfortunately the story & exploration were too bland to really catch me. Combine that with the countless collectables for every upgrade, instead of actual cool items, just really took te fun out of it for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a 7/10.\r\n\r\nThe game is pretty good in terms of general quality. The way the game is portrayed as a single piece by having no cutscenes like 1917 is awesome.\r\n\r\nIt lacks heavily in some areas tho. e.g.:\r\n1) extremely restrictive movement (no, you can't jump from that 2m ledge without a special interactive animation)\r\n2) The story starts getting good, when the game was almost over.\r\n3) Side characters except for the villains seem to be there just for you\r\n4) The world is extremely empty when it comes to non-monster NPC's, its like a zombie game but instead of zombies you get creatures of all kind.\r\n\r\nHonestly, can't believe how this won GOTY over RDR2.\r\nFor clarity, my review is negative to bring down the average, not because it's below 5/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is good, but the world is just shit in my opinion. Nothing to do nothing to see its all just a lot of scenic background.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so boring. I just finished the Greece trilogy where I do combos and cool stuff. Those games were cinematic without sacrificing gameplay. God of War 2018 doesn't do any of that. The first ten minutes was walking. Walking. WALKING! Fighting doesn't have any combos no more you just hit bumper and trigger all day. I like Dark Souls and it does that but the reason why Dark Souls doesn't stink is because they had a systems like stamina and force you to have a strategy so you wouldn't mindlessly mash button. I keep having to do FLUFFING walking sections like carrying that dang boar which Kratos the character would never do. I wish this game was good that's the sad part, I like the premise where Kratos moves to Norse myth, but noooo we have to make it like Last of Us and have a camera position made for shooters and you can't see the enemies behind you. I keep dying to offscreen archers. A year later DMC5 had a better camera that actually shows where bad guys are at. 2022, God of War Ragnorok did not learn so what the heck Santa Monica?!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "watch a fucking youtube video instead, I tried to stick it through but tedious is the only thing that describes this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "To start out, if you're expecting the same experience as earlier games in the GOW franchise, skip this.\n\nI went into God of war 2018 expecting improvements and innovations the built upon the original gameplay loop found in earlier GOW titles. Instead, I found a heap of mechanics that don't feel like they should be in the series at all, and don't even work in conjunction with one another to create a satisfying, or even remotely coherent experience. The best way to describe this would be that GOW 2018 is a ham-fisted attempt at rebooting the series with little regard for what made the original games work so well.\n\nGOW 2018 can effectively be split into four segments; Combat, Puzzle Solving, RPG advancement, and Storytelling.\n\n-COMBAT- 5/10\n\nThe combat in GOW 2018 is - for lack of a better term - outrageously sluggish and unsatisfying. Between the absurdly repetitive combos, awfully balanced Runic abilities, disgusting choice of camera angle, flat sound design, and lack of enemy variety, I found myself dreading the next encounter even more than I dreaded the next 'puzzle' that the game had to offer. As of writing this review, I have made it through half of the game, and the combat has officially broken my will to continue any further.\n\nIn a game where I would expect my attack chains to feel impactful, chaining attacks against enemies is boring. Your optimal approach against most enemy encounters is a mixture of hit-and-run, and spamming runic spells, all of which feel nearly identical with the exception of range alterations as you progress through the game. \n\nThe 'spellcasting' in this game is another can of worms entirely. Not only does it not synergize with the existing attack chains offered by either of your weapons (All two of them) spellcasting seems to trivialize encounters. All of the runic spells feel like they were added to the game after-the-fact with little regard for how they would actually interact with your innate weapon skills.\n\nLast on combat is Atreus, and the bow. This feels like yet another mechanic slapped onto the game for no particular reason, other than to fulfill the need for puzzle variety. There's no depth to his arrow or summon selection, and you'll mostly default to spamming square since there was no thought put into the timing of his attacks in conjunction with your own. I feel like I don't need to explain why mashing Square is irritating. At some point, I just stopped using him altogether.\n\n-PUZZLES- 4/10\n\nPuzzles in GOW are what you would expect from the GOW genre. Move thing there, press button here, etc. For the most part, they are annoying, and in the way of progress. If the game was fast paced, this wouldn't be as much of a problem, but with combat encounters already being sluggish, every slowdown between them was a motivation killer for me.\n\nOccasionally, you'll come across a well-crafted puzzle that - while not difficult in the slightest - does serve to give you a little break from the monotonous tone of the entire game.\n\nOverall though, I'd say they were a huge waste of time.\n\n-RPG ADVANCEMENT- 2/10\n\nI'd say that the crafting, gear, and general overall stat-block of GOW 2018 is a joke, and may be the most unnecessary addition to this franchise. \n\nWith the puzzles in this game already being a gigantic slog, I was at no point motivated to actually go out of my way to find gear. Despite this though, I had accumulated over 30 pieces of useless equipment by the half-way point of the game, 90% of which I would never even consider wearing. Build variety is largely unimportant in the game, save for the occasional \"Equip this to take less damage from X\" gear that I refused to use.\n\nThere's not much to say on the gear in GOW 2018, other than it's a pointless, ultimately annoying addition that you can effectively ignore as long as you're decent at Dodging/blocking. However, by ignoring the RPG elements of the game, you're punished with spongey encounters, forcing you to indulge in this nonsense in order to shorten the sluggish combat as much as possible.\n\nSkill leveling for each of the weapon is - likewise - uninteresting and largely pointless. At no point did I feel like I needed to use anything other than the Leviathan Axe's improved 4 hit combo, or the improved combo for the blades of chaos. The combat encounters are not designed in such a way that the improvements for either weapon tree are actually meaningful at all, making them feel out of place, and slapped on for the sake of padding the already atrocious RPG elements in the game.\n\nAdd on that the menus are ugly, obtuse, and a pain in the ass to navigate considering the bloat of item types in the game, and you've got an utter shitshow.\n\n~STORY~ 6.5/10\n\nI'll give it to this game, humanizing Kratos was the right direction for the franchise to take.\n\nUnfortunately, besides that, the story telling in GOW 2018 is just alright. While most of the VA's give an outstanding performance, the game's script is exceptionally mid, at best, and it is consistently bogged down by the irritatingly slow pacing of the gameplay, and everyone's least favorite trend with modern games - Dialogue bloat.\n\nAtreus, for one, never shuts the hell up. Not only does this child yap constantly throughout the game, but his dialogue is extremely stilted, his lines are inconsistent, and his characterization is so ham-fisted that I felt like I was listening to a damn Sunday morning Cartoon, and not a dark-and-gritty reimagining of God-of-War. Atreus as a character is so tonally deaf, that I was about to mute his dialogue at several points throughout the game just to get a break from his incessant chatter. Unfortunately, I made the uninformed decision that he might say something interesting while roaming the overworld. \n\nHe never does.\n\nThe game's focus is the dynamic between Kratos and his son. While I feel that there are moments that shine above the rest and capture sparkles of incredible storytelling, they are layered between hours of what I can only call melodramatic, hollywood nonsense. Atreus is unrealistically stupid, Kratos is absurdly unreasonable, and many of the conflicts between the two feel so manufactured that it hurts to listen to.\n\nAs with most AAA games, you should not go into this expecting an exceptional story.\n\nOverall, this game was an incredible disappointment. At its worst, it is slow, uninteresting, and frustrating, and at it's best, it's a passable story about a father and his son on a journey through Norse Disneyland.\n\n5.5/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Never played such a simplistic game before. God of War was not entertaining to me, it was just the same thing over and over again with no rewards the true definition of a hack and slash . All of the rewards are either hacksilver or equipment that is worse then items at the beginning of the game. The story is so not creative. Your wife dies so you have to travel around with your weak son to bring ashes to a mt. Your fucking Kratos not Genghis Khan.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is an interactive movie not a game. You spent so much on cinematic that you forgot to add gameplay. What a joke!!!",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}