{
  "positive": [
    {
      "review": "Little Witch in the Woods — Review with 100 hours of pure enchantment\n     When I started Little Witch in the Woods, I confess I wasn't expecting so much. I thought it would just be another cute game, maybe quick, a light pastime among other titles. But... what a sweet mistake. With 100 hours of gameplay (and still without getting the platinum trophy, since I do ALL the side quests), today I can say with certainty: this game captivated me a lot.\n     The story is divided into chapters, and this structure works wonderfully: each chapter brings new objectives, new areas, and constant evolution not only as a little witch, but as part of the universe. The city that you rebuild together with the residents is a true beating heart: each NPC has a routine, strong personalities, complex and surprising stories that go far beyond what is expected in a \"cute little game\".\n     And if you think that's enough to grab your attention... then the map comes in. Just when you think you've explored everything, unlocked every nook and cranny and mysteries... an even BIGGER area appears, and that makes the game absolutely incredible! There wasn't a single moment I was bored; there's potion crafting, item collection, animals to discover, relationships to build, mysteries, deliveries, puzzles, fishing, and even kittens to adopt! I wish this game was more recognized; it deserves all the love and support... if you're a fan of cozy games, cute things, magic, and witches, I HIGHLY recommend it ♥\n\nMy rating: 9.9/10⭐(Request from a fan: The only point I would like you to add is romantic relationships.)",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "This game take a while for me to get into it and even now (roughly 30 hour for this review) I still have mixed feeling about the game and I just cant quite explain why. Maybe because it not a very active kind of game, there aren't much in term of planing and figuring thing out like similiar game to this that i have played ( Stardew valley, Sun haven, Rune factory).\n\nThe gameplay loop of this game is very fitting of Ellie as a character, because she still an apprentice witch so most of the game is about her researching local wild life and making potion. Which is good, I like it when game make sense. But that also where i have problem with the game, the researching part feel like just a list to fill out without any incentive or reason why to do so. The game have some neat idea like if you use correct potion on this dog you can get more material out of it, but then you still have do it the wrong way just because the research tell you to for example. And it doesn't help that some research is completely RNG based and there a fixed amount of wildlife spawning each day, which can very frustrating when you want to get something done. Thankfully you don't really have to do any of it even though a lot of progression is tied to your research level.\n\nOther than that the game is very chill and adorable, and the price is worth it for this game. I can see other people enjoying this game more than myself so if you into cozy game then this is a good one to try out.\n\nSome side note : Just don't try to 100% encyclopedia early on, save it for end game when you have better tool to speed it up. I tried 100% the first area of the game before moving on and it was really boring and tedious process.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I really wish I could give this game a mixed review. This is not exactly a \"Stardew Valley-like\". There's no farming, but there's ingredient gathering. It does however have the same character interaction system. I did enjoy this game quite a bit, and you might too, but I'm just gonna note down the negatives of the game so that you know what you'll be getting yourself into:\n1. There is a SEVERE lack of polish. The loading times (from starting the game to going between areas) are REALLY bad, and it gets worse as you play through the game. There are CONSTANT frame drops. And there's also still a lot of bugs, despite all the patches released.\n2. As of writing this, there's still [i]unfinished[/i] content in the game. I'm talking about the characters with incomplete story questlines. You can't have leftover unfinished content in the game in a full release.\n3. The story is really nice, but it's also really [i]wordy[/i]. Hours could be dropped from the story if there wasn't as much meaningless yapping.\n4. Again, as of writing this, there is no way to rebind controls if you're playing on the controller. The latest patch swapped the keys for \"Sort inventory\" and \"Switch between inventories\" in the menu where you interact with a chest, and that left me having to undo 30 hours of built-up muscle memory.\n\nBut yeah, apart from that, there's a pretty good game here. Just don't expect the quality of Stardew Valley or similar titles from this game.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "32 Hours In - here's my take aways : \n\nPRO - Cute. Like. Stupidly Super Cute.  Also, it Scratches the itch for those hunter/gatherer/crafting/villager befriending/house decorating type games ( i.e. Stardew, Animal Crossing, etc. ) . Controller controls are easy to use and functions are user-friendly . Overall a really, really great casual game.\n\nCONS - So. much. dialogue. And really - it's not so much the *amount* of dialogue ( though most reviews would argue otherwise ) it's the fact that the translation is..,.rough, to say the very least.  ( and I get it , smaller studio = smaller budget = not a perfect translation ) Honestly I'm just happy the translation is decent enough it can be *mostly* understood, but some things are confusing or not translated well *at all* and some players may find the need to just Google the solution to the quest they are trying to complete.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "If you're quite empathetic, sympathetic and other kind words, this game is for you.\r\nI had my laughs, my tears, my soul. Yes, I cried, I laughed, I enjoyed my hours in this game. It's one of the best stories I have read. Gameplay can be annoying, but story... It's 10/10. Gameplay is 8/10 tho, you just run around locations and collect. I love it. Thank you for melting my heart.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "super cozy game. very cute and comfy. if you like collecting and completing lists/tasks, this game will satisfy you. i love the encyclopedia - every flora and fauna has an entry and has multiple tasks to do x number of times in order to reach 100% completion, it's very satisfying to complete. sometimes it feels like there's a lot but there's never any rush to anything, so you can take your time. the only deadline in the game is random villager item requests every day (the reward is paltry so i did them once and stopped), and the candy delivieries which refresh twice a week, but even if you miss one it's not a big deal, you just miss out on some money.\r\nthere's definitely some janky things about the game: the translation could use some work (it feels very stiff and unnatural in english, i'm sure it sounds better in the original language, korean), sometimes names are missing (it says \"[name of villager] and Ellie grew closer\" but for Freddie, his name doesn't appear during this dialogue lol), and there's currently some performance issues, but the devs are aware of them and working on patching, so i have confidence it'll get fixed. the jank and translation issues i can overlook, it's nothing major or game breaking (that i have experienced) so it doesn't bother me.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I absolutely adore this game. \n\nIt’s a very unique game. I see a lot of reviews comparing it to Stardew Valley but honestly the only comparison is pixel art. \n\nThis is a very text heavy game but there is a lot of gameplay outside of that. I personally find I can only pick it up when I have the capacity for reading the story, as the story is brilliant! \n\nI really love the characters - they are all adorable and loveable. \n\nThe potion making mechanic is brilliant - there is an auto brew feature but I never use it as I enjoy making the potions too much. \n\nThe stamina can be a little rough however, I’m not too mad at it. Some tasks can take 20 stamina from your 300 stamina bar. But I find this makes you have to think about your exact plans for the day and not just waste stamina. Also, there are a lot of rewards you get that are food that can restore stamina. \n\nOverall, I really think this is a brilliant game. I feel I have barely scratched the surface of the game and can’t wait for more!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I don't leave reviews very often but this game is 1000% worth it. It's deceptively heartfelt and wonderfully charming. I fell in love with the characters and the gameplay loop is a lot of fun while having a ton of variety.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is amazing. If you're looking for a good story-rich cozy game, this is perfect! You can tell they put a lot of love into every character.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "it's true that the english translation in dialogue is a bit awkward at times, and the game doesn't always tell you exactly what you need to do, BUT there's a catalog exclusively for the cats you find around town and that alone makes it worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game so much, it has so much adorableness and good vibes smashed into one game <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Little Witch in the Woods is a game that presents itself with beautiful graphics and a cute appearance. It offers many things to enjoy, such as crafting potions and candies, collecting materials around the map, which becomes bigger and larger as you progress. The story is simple, but still good. Overall, it’s a great game if you want a relaxing evening after work.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "chill and relaxing game that should be more apreciated, artstyle is amazing and every little feature is made with a lot of love by the devs\n(also, has a lot of cats)\n1000/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game and I’m soon getting to the end of this game, remains few more achievements to get all achievements. It’s sort of like a light version of stardew valley while this game definitely have cuter and nicer pixel visuals. The musics are calm and looking at the visual really brings glow in your heart. There’s a few bad design/bug like in terms of item has to be in bag instead of inventory boxes or else you cant trace it while crafting potion etc, but they hot-fix it better with the latest updates. So we can tell that the developer do listen to player’s rant and complains. Anyway the main story is quite short, looking forward whether there’s any else new DLC or new story line coming up!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is a cute game but crashed no green bag showed up for me in the starlit cave ... i think needs more time i couldnt finished the game :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The sweetest game ever (am I biased because I love witches so much? Perhaps, but the game is soooo cozy and so dear to me)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 coziest witch game I´ve ever played.\nIt´s my favourite game this year, right besides expedition 33 and fantasy life.\n\nIf you want a cozy collection game with amazing characters, top notch pixel art style and animation, then this is the game for you.\n\nAt the moment I am very close to finishing the story, and I plan to continue playing this game afterwards as there is still much to do!\nMy favourite parts are the enzyclopedia and all the character stories. I did not think I would be this invested in the characters, but here we are.\n\nIf you have the time, please play this wonderfull game. It is really amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The latest update added craft from storage and it's amazing. Cute cozy game about making friends and collecting items. Very chill and easy to pick up. \r\n\r\nThere isn't a lot of hand-holding and it's sometimes easy to forget what you were working on even though some quests are tracked automatically. \r\n\r\nPros:\r\n-Craft from storage!\r\n-Easy to learn\r\n-Chill, cozy, nice music (though the town music is a little repetitive after a while)\r\n-Cute characters you build friendships with and learn their backstories. (friendship only, no romancing)\r\n-No combat, just harassing some creatures for their fur\r\n-Collection completion = cute decoration rewards\r\n-Cats you can befriend\r\n\r\nCons:\r\n-I don't like how fast the days go by. It wasn't so bad with only one zone to explore but after you start to open up the town and the other two zones, you really need to pick one task/zone to work on during the day; there's not really enough time to more than one area. There doesn't seem to be any penalty if you do take several days to complete anything so it doesn't really matter, but it's a little frustrating. Especially when the night cycle is a fraction of the day cycle and you have less time for nighttime creatures and plants.\r\n-you can't save right away. there are several (and I mean [i]several[/i]) steps you need to complete before you get the desk in the house to save from unlocked, takes about 30 minutes.\r\n-gameplay gets a little laggy/jittery after awhile, especially when you're running around\r\n-activities don't seem balanced for the amount of energy they use: why does plucking a flower taking 20 energy but fishing only takes 5? I think it takes more effort to haul in a fish than it does to pluck a flower.\r\n-collection requirements don't seem balanced; some are really easy to complete, others are challenging.\r\n\r\nOverall, I have really enjoyed this game. I've mostly played while recovering from a shoulder injury so I'm glad it's easy to play on a controller.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got this game as a birthday gift, and it took me so long to finally play it. Oh boy, I wish I had started Little Witch in the Woods sooner. At first, it felt like a pretty good game while I was going through the main story, it's super cozy, with lots of things to do to pass the time, but nothing particularly special.\n\nThen, as I progressed through Arden's and Roy's storylines, I realized how great the game really is. They made me so emotional that I was sobbing uncontrollably. At that point, I was in the middle of an ~8-hour gaming session and just wanted to push further in the main storyline so I could continue Roy’s, lol. I hope the other characters storylines get added soon, I can't wait to finally be able to play!!\n\nSometimes, the pacing felt a bit slow, but now, looking back after finishing the game, it wasn’t slow or rushed, just perfectly balanced.\n\nThe soundtrack is amazing. Every track fits the atmosphere and ambiance beautifully. The devs really nailed how the music builds during the cutscenes and hits right at the climax, it makes those moments hit even harder.\n\nThe English translation is a bit questionable, I guess. There were a few descriptions and quests that were barely understandable, and I don’t think the problem was my English. The game doesn’t feel completely polished yet: it’s not very well optimized, and there are a few visual bugs here and there (like cats and Rubrum appearing duplicated, or NPCs getting stuck so you can’t interact with them), but nothing game-breaking.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Initially I thought this game was a bit slow, I had a hard time getting \"into it\" but once I got the hang of things & got past the tutorial aspect. I found this game to have a rich story & an expansive list of tasks to complete that were not quick to complete, which made the game fun. There are some aspects that are a bit tedious but overall I find it really fun.\r\n\r\nMy only complaint - there is a LOT of text, it would be nice to have the option for voice over as I sometimes am not in the mood to read every conversation but I want to know what they're saying. That's just a personal thing, it is cozy, quiet and I enjoy it a lot.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Was an amazing demo to now an INCREDIBLE full game. I was so worried that each act was the end of the game but it kept expanding and opening new areas and characters. My main goal now is finishing every characters arcs since Roy broke me as a person. 10/10 would rate higher if I could",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is so cute and fun, I really have been enjoying it so far.\r\n\r\n...But the English localization is SO BAD;;;;; It's very difficult for native English speakers to read the dialogue because it just doesn't read naturally at all, and often gets very confusing as to what the characters are even talking about.\r\n\r\nThis game deserves better. Please update the English to be improved;;",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very cute and cozy game. However, a little too much dialogue for me. You end up mindlessly hitting the space-bar to get through diaglouge, since most of what is being said is fluff and not actually necessary for the plot. This isn't a deal-breaker though! It's been a fun game so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For the pricetag I expected a short and sweet game but what I got was way more than I thought. For the amount of care and content its a steal at the current price. Completing the encyclopedia, potion brewing and getting to know the villagers was all a nice gameplay loop mix. I find Little Witch in the Woods to be among my favorite games I've played this year and I am glad I waited until early access was over to be so pleasantly surprised by it.\nA game to be taken at your own pace for sure. Anyone impatient might not get the most out of it as things can feel quite slow at times.\n \nHowever, the English translation and game stuttering are an issue. The translation is good enough for you to understand what's happening even if it is at times shoddy and it did not bother me, but I could see it being a problem for others. As for the stuttering, keeping the game open for some time you'll encounter constant stuttering. My desktop wasn't as affected by it but it got quite annoying on Steam deck. The game also takes quite a while to boot up. Hopefully they manage to tackle these issues in the future as there is something truly wonderful here and the technical bumps could be turning people away.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolutely amazing though the controls are a bit waky at the beggning like hard to understand BUT in my opinion its the only bad thing about it. The story is rich, the gameplay is interesting and for once night is not super scary. Love this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I haven't played much because of work, but after experiencing the crafting and some of the gathering I can say its pretty good. I can't say much about story since I played for almost 2 hours. But the pixelart is quite good. the music helps the cozy vibe  Will update after more playtime",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I learned about this game only because of cute and funny art devs posted related to delay of the release (because of Silksong)\nThis game has everything you need: world exploration, friendships, crafting, decoration, researching and adorable creatures to collect.\nYou can also pet, play and feed cats and even adopt one!\n❤️🔥 10/10 would recommend!❤️🔥",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Controls are bad and really hard to fix (on keyboard) controller might be better idk. Dialogue is translated kinda bad and the story is childish. But I don't really care about those things because the game is cute, I like the art and character designs. I hated the puzzles. I still recommend cuz vibes are all that matters to me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played through a very early access demo. I enjoyed it back then enough to keep tabs on its release. I must say, what has released so far exceeds that original play through. I'm very impressed by the team's efforts, this game is really well done. the stories and character development are cute, heart wrenching, and lovingly presented. overall, just a wonderful cozy little SIM.\n\nthe game maintains a very slow pace. if you're in a hurry to get to the end, this isn't the game for you. this game is all about the journey, not the destination.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i got addicted to this game.\ni love the art style, soundtracks, characters designs. all of the characters are so alive! \ni also played the game very slow paced, i love the vibe of this game soo much i have to check on every detail.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SUCH an adorable cozy game to play laid back with music and a little snack, the storyline is also easy to follow and thought-provoking! I am thoroughly enjoying making potions and talking to the villagers it's so fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The witch who runs the Witch Shop (trademark) is hecking adorable, remembers nothing from her schooldays, and has the very realistic goal of just wanting to finish work on time.\n\n11/10, very good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "THis is one of the best chill games I have played in a while. I love this the characters are great as well. Please pick up this game its really well made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm absolutely in love with the game, and though there are some negative aspects that could be improved (better translation, grindy goals in the journal (FORTY FUCKING WEED EXTERMINATOR POTIONS?!)), overall it's a wonderful experience, and even though the potion-making isnt anything grand, i'm simply enamored with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gorgeous art, lovable characters, and the perfect “just one more quest” energy. If you enjoy wholesome games, this one’s a must-have.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cute and relaxing to play, and it has a lot to it for the price. A prologue and three acts of main story, plus several characters with side quests and emotional stories. The start is slow, but every game is slow as it opens you up to the world and mechanics of the game. Overall, very enjoyable and I am not even done with everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like cosy and witchy games, then you really shouldn't miss out on this game.\nit took some time for the full release to come out, but it was worth the wait.\nThe cute graphics are a bonus and the puzzles of the game are easy to mid difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most perfect cozy game for Steam Deck. It's also incredibly cute, fun, and highly addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From early access to its current form, this game has grown and developed more than I anticipated. The design is adorable, smooth, and nostalgic. The quests are simple, but entertaining, while also slowly roping you into the villager's lives and story arcs. The added decoration features (and shop items) adds a new level of customization that I feel is pleasant and not too overwhelming. Overall, this is a super cozy, feel-good game that is surprisingly in-depth and enjoyable to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "real cute and fun. very relaxing and i like the storyline and the character designs. like some people have mentioned, there are definitely some parts of the conversations that aren't well translated and it can sometimes make quests confusing. overall tho, i love this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very calm and relaxing, like the art style too. If your looking for a relaxing Stardew like feel with more adventure and magic this is a good game to get.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game. It might be the only game of this \"type\" where I don't feel like I am pressured for time and always have to min/max what I do in a day. It took me a while to even realize that time wasn't paused while in my inventory, and it didn't even matter. I was happy to explore and draw things at my leisure. I love the art and the colors. There's even more dialogue than I had expected, which I'm fine with but I can see why it's a deterrent to others. I like the main character's attitude, and continue to be introduced to new cute things that I didn't know about beforehand.\r\n\r\nAfter 20 hours, there was something unexpected though. I had to upgrade my house to continue the story, and when I came home, the cute house I'd spent all my time in before was gone, replaced with an ugly, massive empty room. This actually made me feel heartbroken. I DO like decorating, but I didn't expect to lose this cozy space that I was so accustomed to. Sure I sometimes clicked on the wrong thing because it was so small, but so what? Now the room is a plain square and I don't think all the furniture in the world is going to make me feel happy about the new space. Plus, I'd been wasting my money beforehand since there was nothing new to buy for a while. Plus, I had to dump my stuff on the floor since chests wouldn't be sold until the next day and I didn't want to leave my junk in the mail. How strange to lose storage space on an upgrade, and what exactly did Kyla do with all the adorable knick-knacks that were present before? ... I had to mention this because it really did change how I felt in the game.\r\n\r\nSuddenly I was coming home too late every day, stressing to make money so I wouldn't again miss a shop stocking decorative stuff that I wanted really badly. I had to stop playing for a moment and reframe my mind so that I could enjoy what I was doing again. It reminds me of another game released this year where it took so long to unlock the decorative things I wanted, that I had to spend all my time playing in an ugly space that I didn't like. Coming home to the cozy house at the beginning of Little Witch in the Woods was enjoyable to me. The \"upgrade\" was a real loss for me.\r\n\r\nThere are also some unique quirks, I once hadn't used a potion in so long that I turned back from a quest that I could have completed because I had completely forgotten how to do it. I was trying to drink it from my inventory, which you can't do. Then once I remembered, I wasted the potion, because I'd tried standing in the correct position before and couldn't get there, so I didn't try again (I guess it had become stand-able later, or I'd just messed up?).\r\n\r\nAnyway, I continue to like everything else new in the game, and I know there's still more to see. I half expected the next \"area\" I unlocked to feel less content-filled, but it hasn't been. So I still feel like there's more to look forward to and I will continue enjoying the game. \r\n(just give me back my cozy house? can I trade it in for a smaller square at least? repeated same-style furniture items can't fill this big area without feeling off... I wonder if it can be modded)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely adore this game, its a completionist's wet dream.  My only criticism is the amount of dialogue which takes a while to get through, and to a lesser extent the controls are a little difficult to get down at first.  As I havent encountered a game with similar controls before.  \r\n\r\nabsolutley recomend if looking for a cozy game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cozy, funny, great story telling and beautiful world. I love love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVER! I love it so much and it's my favorite game to sit back and relax.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't finish yet, but I already recommend the game! The game is super cute and the characters are very interesting. I adore Ellie! She is childish, stubborn but very lovely. It's interesting to have a cozy game in which you are not the main character, in the sense that the main character has it's own personality, so instead of thinking \"I want to do that\", I think \"I want to help Ellie to do that!\"\r\n\r\nI don't know, I thought that was nice =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is seriously addictive. It totally makes me feel like I'm that little witch brewing potions, discovering new stuff almost every in-game day, bumping into all sort of adorable little creatures, jotting everything down and so on..\nThe atmosphere is super chill, even if I do rage here and there. I love that the game isn't monotonous at all. Besides being cute and all, the story is actually engaging too. With most other games, I usually skip it after 10 minutes if I'm not hooked, but that's definitely not the case with Little Witch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little Witch in the Woods is basically what happens when you mix Stardew Valley, Ghibli energy, and a “touch grass but make it magical” vibe. You play as Ellie, a trainee witch who’s supposed to be studying… but ends up running around the forest collecting ingredients like a feral raccoon with a wand.\nThe visual style is the star of the show. The pixel art is chef’s kiss: cozy, charming, and full of tiny details that make every screen feel alive. \nVerdict: If you want a wholesome, comfy game with gorgeous pixel art and witchy cottagecore energy, this is your sign. 10/10 would brew potions again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little Witch in the Woods is one I would give a mixed review on if I could like many others. It's got a beautiful pixel art style, charming music and characters, it's cosy but it's hard to praise the gameplay. \n\n(bonus note; I started playing this game back while it was still being worked on in early access, I'm glad to see it finally got released even if its got it's kinks to work out I wish the team well.)\n\ntl/dr: it's a cute game that needs lot of patience, if you plan on playing it in small bursts to match the slow pace of the game you'll probably like this one and should give it a go. If you don't have a lot of patience and tend to play games for long stretches of time, the bountiful dialogue and a slow pace that can lack on the reward front probably wont be up to your taste.\n\nThe pros:\n\nI'm lumping this into one cause it's not a lot sadly. The art style is really simple but cute, sprites have a lot of love put into them and it makes the game feel really lively and fun. I particularly love the portraits of characters, their super well done in both style and expressions. Music is really good. It's fun, whimsical, and also quite relaxing. I'd definitely put it on in the background from time to time for some comfy vibes. (I did have one account where the music got really loud during a cutscene and stayed loud until it finished it's run). Characters are neat, their expressive and really distinct from one another and gave me a good chuckle here and there but some people have noted there's missing dialogue and names later on so bear that in mind...\n\nThe Notable Cons:\n\n-Grammar. It's a translated game so hiccups in text are going to pop up, it's a small studio so I can't fault them but it can cause issues for understanding what to do at points. I just find it a shame to see some I saw in the early build are still present in the full release version.\n\n-So much text, and not all in the right place. There's a LOT Of dialogue in the game, this is fun for the story I don't mind if it's there to add to the world, but it really gets in the way when your trying to get something done or when dialogue is repetitive like 'hey you need to know I can also accept candies made despite the prior vendor already telling you that'. Also when I say 'not all in the right place' I mean some places NEEDED more text particularly for tutorials like using the cauldron or notes of 'oh I can't make this thing until I get x' just to nudge the player along sometimes.\n\n-Gameplay is a bit of a repetitive loop with not really anything to break it up. Collect things for potions/candies, fill out book by doing so, make what need in the cauldron, use candies/potions on quests or to progress story, rinse and repeat. Ellie being an apprentice makes sense why it needs to be simple, but I found myself aching for more of a reward or just something else to do especially with the research since it really just unlocks some notes and better drops for the creatures or automations for the potions...\n\nSmaller, quality of life notes;\n\n-I'd rather have purchased recipe's go straight to the book rather than the inventory, I kept forgetting this part because a lot of other games just put a mark on the log/book to say you got it, so I'd go around and do other stuff completely forgetting I never learned the recipe until I need it/inventory full.\n\n-The map is kind of annoying at it's current state. It doesn't tell you what route (marked by a door) leads where, and only shows the area your in rather than offering the entire map. I would love to see the names of areas added to their entrances at the minimum because I kept going the wrong way especially when I wasn't visiting an area frequently.\n\n-The stamina bar needs to be able to get bigger or things need to take less out of it, 300 goes down RAPIDLY when a lot of items need 20 and it doesn't seem like there's any upgraded for it but I am not that deep into the game.\n\n-There are books you can buy but they don't seem to do anything other than just...add more text of a story summary. I had hoped these may have been something to actually read even if short just to pass the time or give a small buff to Ellie even if temporary but they don't. It made wish there was more things to do outside of the crafting of potions/candies and decorating the house (which you don't get for quite awhile!), maybe some minigames like making tea or events with characters, ya know?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was honestly bummed out when they announced that they postponed the game by a week because of silksong. However it was worth the wait, this cozy game was such a treat to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very surprised by this game, it was much longer and full of cute details than I would have expected. I finished it at a slow pace in about 70 hours, taking my time to explore and fill-out the encyclopaedia.\n\nThe creatures you find across the various regions are all unique, cute and give you a variety of challenges to collect. Lovely pixel art and animations for all the critters.\n\nThe story isn't groundbreaking but I found it quite interesting and satisfying to go through it. Some characters are also interesting and they give you fun side quests.\n\nLoved searching for cats in the village everyday, trying to befriend them.\n\nTo be improved: crafting potions and candies can be tedious: although the crafting minigame is nice, it gets stale quite quickly; translation to english isn't great, especially when trying to complete encyclopaedia tasks it can get really unclear what you're supposed to do; I wish there was romance and more to do with the villagers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pestered with minor glitches but a very charming game that you can casually play after a long day. Almost no stress or rush to do objectives and can do things at your own pace. Even more forgiving than Stardew valley.\nThe devs are trying to smooth out the glitches so once that's over I think this game can be a solid 8 outta 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cozy game you can just sit back and relax with at any time. \nThe storyline is fun and although it is easy to connect the dots, the final mystery reveal was unexpected to me. The individual character stories had me more hooked. They start out quite simple but end up being nicely crafted and emotionally relatable stories.\nI have had really bad rng with collection of some special ingredients, but besides that it was a fun challenge to 100% the encyclopedia. It is not manadatory so there is no pressure for it, but the rewards for doing so makes the later parts of the game much easier.\nMy only qualm has been the amount of dialogue. There is Just. So. Much. Dialogue to go through, which is great for character development but slightly overwhelming after a while.\nBest thing about the game? The cats.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This  game is enjoyable and chill experience.  Interconnected world design and material collection are my favourite parts.  Just the positive energy this game has is nice and refreshing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Favourite cozy game. Cozy games often end up feeling repetitive or like a grind, but this one is just right. I love feeling involved in the potion making, I love having a story to keep me from getting lost in the tasks, the characters are very charming, and it's just an overall calming, yet fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cute game! reminds me of research story a little bit :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The crafting is fun and intuitive, albeit a little simplistic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of my favorite games. Such a cute art style, sweet story, lovable characters, and enjoyable gameplay. Would highly recommend for someone looking for a cute, relaxing game where you collect materials, craft potions, and make friends with lovable characters!\n\nBiggest strengths:\n1. The game is relaxing and doesn't make you feel rushed. While there is a clock that's constantly running, there's very little reason to need to rush. From what I've seen while playing there isn't a time limit for the main quests and you can spend your days how you please\n2. The world and environment have so much love put into them and you can tell. The characters really do feel fleshed out and loved and I've grown attached to everyone in my village. The soundtrack and visual style are also just wonderful.\n3. As far as this style of gameplay goes, it does it very well. I've played games where it feels like such a hassle to get to an area, realize I need specific ingredients, go find them, then come back and repeat the cycle many many times. Maybe it's the way I played this game but I never really felt myself feeling this way. Ingredients never felt too far away and there's very little stopping you from hoarding them.\n4. The encyclopedia was super fun to fill out and figuring out how to collect each item was a fun puzzle and never too difficult because you get hints if it's taking you too long. Some of the goals for the encyclopedia seem a bit tedious to get the best ranking, but since that's a completionist task I don't see that as too much of an issue.\n\nThe only things I'd say the game could improve on is the dialogue. While I do feel like I know the characters so well, I do find myself skimming through most of the text and quickly skipping through. A lot of it is wordy and just drags on far longer than is captivating. Also a full map that you're able to view instead of just the area you're in, but that's a small nitpick that never bothered me too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this sweet little game! I still haven't made it to the end of what I think is the last area 46 hours in. The controls are a little clunky at first but I do love not having to use a mouse. Character design and creature designs are all so good and cute and really remind me how charming pixel art is!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super calming so far, love all the characters (so far); again, another game I found through Gab Smolders! love finding games like these, can't wait to continue playing & see where the story goes!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and engaging with loads to do! Love the aesthetics and calm vibes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cute game with a nice storyline, some fun little puzzles and a tendency to make me get stuck by the computer for more time than I should. \nIt's a little bit slow in the begining and maybe a little heavy on the amount of text sometimes, but I'm still having fun playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like cottages and witchcraft, this is the game for ya",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my first video game. I remember a year ago finding it on tiktok and actually giving it a try, it has been an amazing journey since and I cannot thank the developers of this enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is better for me than a Stardew Valley based solely on the fact that it doesn't have a timed events inside of it. Worth it's money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it sp cute, but i do hope it have a multiple save slot so i can play different file",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so cute! Its a great game to sit back, relax and play!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly thought that the dev had given up on this game back in early access, but I can say that it is now a worthwhile game for those who enjoy collecting items, brewing potions, and solving puzzles. The characters are surprisingly well crafted, too, and the plot of the story is quite heartwarming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute game, lots of fun. Hoping the next title introduces some light combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love, love LOVE this game ! I initially found out about this game from the meme the creators posted about delaying the game's release because of Silksong. Decided to try it out, at first just because it seemed adorable and for the amazing graphics. Gosh, there's so much more than that ! What an adventure... Thank you so much for making such a wonderful game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love it. Especially more since the updates have come out. I also adore that the creators of this wonderful peace of art keep enlarging the content and working on it. I can only recommend if you like cozy games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "╭──────────.★..─╮\n          My Review\n╰─..★.──────────╯\n\nI truly adore the little world in this game! I was a little impatient to start with as there was quite a lot of dialogue to go through in the beginning but after a little while I was grateful to the amount of effort and thought that had gone into the world building and characters. It's narrative rich with plenty of time for wandering around and doing your own thing in-between. The tutorials are robust as well as a result, and it's pleasant and cosy to play. \n\nI adore being able to talk to so many different characters and trying to find out what is happening in this world, as well as encouraging my little character to take hold of her independence and make a life for herself in a mysterious witchy forest & village. \n\nI haven't finished the game yet but I am really looking forward to restoring the village and discovering what happened. \n\n────── ⋆⋅☆⋅⋆ ──────\n(˃ᆺ˂✿)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THIS GAME SO MUCH!!! IT WAS WORTH EVERY PENNY I SPENT!!!\nA wonderful cozy game that doesn't rush you at all! The character designs are beautiful and their stories made me feel so many emotions! \nIf you love cozy games I ABSOLUTELY recommend you this one!\n\nLooking forward to updates ^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Little Witch in the Woods has been an absolute joy to play so far. The story unfolds at a gentle pace, but every interaction with the villagers feels meaningful. There’s an impressive amount of dialogue, and I find it really brings this game's universe to life. \nI enjoy the quest system, while some tasks can feel a bit repetitive, they still fit well within the cozy rhythm of the game. The steady stream of new cosmetics is a great bonus and keeps things feeling fresh.The overall aesthetic is adorable, with that perfect “forest witch” vibe. The atmosphere, visuals, and tone all come together beautifully. A wonderfully charming experience!\n\nI may have bought a LOT of flowers from Roy :>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love a good pixel art game. The intro got me curious, and the game play kept me going. Would love to see this as a animated series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely, cozy, relaxing. Beautiful art style and charming characters, and an enjoyable enough gameplay loop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it took a while to get the full game released and it still feels like there is some content thats yet to be released but aside from needing to restart a save to access the newer content ive enjoyed it from the start \r\nnice cozy relaxing with enough quirks to make it engaging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this game is very fun and the story and characters are very interesting so far. Some of the translation is still off but honestly a really fun play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fun to explore, make potions and it just super cute!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely, funny, addictive and cosy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a pleasant game for those who want wind down at the end of a long day. Nothing high octane, just gathering resources, making potions, and completing little quests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really cute, and also pretty chill it just sit back and play it mindlessly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has quickly become one of my favorite games. \nIt's so cozy. \nA perfect game to play when life get way too stressful and you need something to distract you. :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Comfy, cute, good pacing. If you like Stardew Valley and Animal Crossing, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute, the vibes are good and the art is fantastic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is a whole quest to entice the cats so you get to pet them, this is one of the greatest games ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sit back and Relax\r\nForget about the world and don't mind\r\nBetween the woods, may the little witch find what should.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Показалось что игра наподобие Stardew Valley, что нужно будет выращивать всякие растения, строиться. Когда поиграл оказалось что всё по другому и выращивать самому ничего не надо, только собираешь готовое. Поначалу разочаровался, но если не сравнивать эти две игры, то сама по себе она очень неплохая. Я бы сказал это скорее что-то вроде новеллы с крафтом. Много времени уделено историям и персонажам, а варка зелий очень упрощена и идёт как бы вторым планом как мини игра. Баланс таков что выгоднее двигать сюжет, иначе вначале придется много фармить. В игре отсутствуют противники и боевка, совсем - \"это добрая игра\" (Вирджил). Ну и ещё в игре много котиков. Для игры советую запастись большим количеством свободного времени.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot of fun! I am excited to play more of it. The storyline is cute and there is so much to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looove it, its a perfect game to play when you want to just chill and relax.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun and cozy game that sucks you right in, I find it hard to stop sometimes haha\r\n\r\nThe characters are fun, the gameplay is quite innovative as you will need new methods to collect the ingredients\r\n\r\nThe only downside is the constant memory dump and lag",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played a lot yet but I quite like the story and characters so far! \nBut I do quite dislike the controls. There are way too many menus which makes playing a bit confusing and frustrating at times. I really hope we get a version where we can play with mouse only (like Cozy Grove) because I think that would improve the gameplay a lot for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. Very fun and relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I initially bought this game when it came out in Early Access and now after full release i can finally say i am glad I held onto it.\r\nThe unplayable game due to uncustoimizable keybindings evolved to a very cute, cozy game with beautiful art.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was everything I expected it to be and more.\nFrom getting to design my own little witch home, crafting potions that are helpful for gathering materials, befriending cats, customizing furniture, customizing my own broom, getting to know and befriend npc villagers. This game has everything I could ever want from a comfy, cozy witch game.\nI love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely adored the journaling aspect of this game. The fact that you learn the plants and creatures of this world as you go rather than just being given the answers is one of the main factors why I play this game at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable little game that sparks my want to 100% complete each and every part of the encyclopedia. <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the story-line and the animation its such a cute game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and relaxing. loved playing the beta and am ready for the full game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. Roy's story had me ugly crying.\nI highly recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I want to like it but I cannot. It goes incredibly slow, walking or even riding the broom feels like a chore. You cannot craft unless everything is in your pockets. Time passes really quick and with the speed you walk you cannot explore as much. Story and characters look very interesting but I really have not the patience to play it and actually progress.\r\nI will come back to it if :\r\n- you can access the box & inventory when you craft\r\n- you have a map where you can actually see all the maps you have so far so you don't walk aimlessly around\r\n- the walking or riding the broom actually go fast",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "I WANT to love this game so badly, but MAN is it stretched thin. \n\nI really enjoyed the first 5-10 hours of the game, the art style, the characters, just about everything was hitting the notes for a life sim that I enjoy. Then I started to notice how long it was taking just to get the bridge in town fixed, then when it DID get fixed I realized how many homes needed to be repaired, THEN I walked into an entirely new area, with new creatures for the encyclopedia, new potions I had to craft and suddenly I felt like I had barely scratched the surface of what I was playing. Then I looked at my play time and realized that I had played 20 hours to get to this point.\n\nIt's one thing to have a slow pace, but with how simple the gameplay actually is and how many fetch quests there are, the tedium sets in long before you even get to the second round of new characters. The charm of the game dissolves like sugar in water, and not even the promise of more adorable townsfolk can keep me going. \n\nIf doing the same chores over and over again without the joy of seeing even a farm grow in front of your house, or sitting through so much fluff in poorly written dialogue to get to the point, or wandering around the same locations again and again to collect ingredients sounds like fun, then here's the game for you. I unfortunately need to tap out.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I had to refund it. The translations were just so bad, only compounded by the fact that there is a LOT of dialogue. I genuinely couldn't make it past however long I played, which wasn't long at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "While additional menu options are intimidating, it’s fine and surmountable. \n\nI’ve not even played two hours. I quit because the dialogue is exhausting me. I’d hoped it was just for tutorial sake, but it isn’t. I searched and read countless others’ experiences to find my hope slaughtered on site.\n\nIt’s just too much. I plan to refund the game. It’s such a shame, I wanted to like this so much.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do not get this game if you are predominantly a PC player; there is NO mouse support. Only played for a few minutes, and hated every bit of it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Honestly- the keyboard system is really not intuitive- and the intro is so bad I could barely get through it. I was sick of it after 5 minutes of hitting the space bar 60 times just to get through some inner monologue.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The \"healing game\", as the game itself says in one of its 4th wall breaking dialogues, with simple, yet interesting mechanics. Character art is nice. Pixel art is once again \"non-true\", since the rendering resolution is higher that of the sprites used. Animation is ok, I guess, but don't expect fluidity. Audio effects are lacking a bit. Music is simple, but fitting for the chill experience. Characters are quite likable and dialogues are straight without the kid-level bs. The game is quite easy to get into. At least until you start noticing bugs.\n\nPurchased the game during its EA stage. While it changed to the better a lot on the release, it still is not at the \"released\" stage just yet. After playing for a bit you start noticing how the game is stuttering, making the camera jitter when following the character, and breaking the sounds and music. You can also end up with a side quest, which will keep taking your items while not allowing you to complete it and get the reward.\n\nThe game itself is also very heavy despite being 2D - eats over 5Gb of memory, takes quite long to start and load, especially the village map (on a fkn i7-14700K with SSD!!). Kind of tips towards low dev skill in optimization area.\n\nIf you want chill experience, but can handle random bugs and stutters, go ahead and buy it.\nOtherwise, wait until that \"known bugs\" list is clear. Unlikely to happen in 2025 though.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tons of slow, boring dialogue. Couldn't bring myself to go past the first carriage.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gg",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The last thing you expect from a pixelated chill indie game like this is that flight simulator like amount of controls. Tons of menus and options, no mouse support, weird default settings. As a one-handed gamer I haven’t imagined that I’d be unable to play this kind of game one day. I hope there’ll be mouse support in the future, but until then I have to refund",
      "voted_up": false,
      "votes_helpful": 259
    },
    {
      "review": "I just...ugh, this pains me, because this game is so cute, and when it is working it feels pretty cozy. But holy smokes...the dialogue...\n\nLook, I know it is a translation, and a smaller studio probably can't afford a good translator, but I'm not convinced this is just a translation issue. There is just so much inane yammering. Like, I love cute little conversations in these cozy games, but this was frequent and bad enough that I started to dread whenever I had to talk to NPCs. Most important, quest related dialogues were so rough that I either couldn't fully follow what they wanted or was so uninterested in the endless chatter that I didn't retain the info. Sure, I was able to just look at the journal and figure it out, but even so...dialogue is a BIG part of this game, so dreading encounting the dialoague is kind of a problem. \n\nAlso, I know a lot of folks have complained about the keyboard controls, and holy schmoly are they right. If the dialog in this game isn't a deal break (and honestly, I don't think it would be for a lot of folks) do yourself a favor and play with a controller. I know, I know, a lot of y'all stardew purists would never consider giving up the robustness of a mouse and keyboard, but I promise, the keyboard controls are bad, and if you want to rebind them, haaaave fun...\n\nI dunno, I want to like this game so bad. I really do. But I've tried to come back twice now and I just can't get past some of this stuff",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "[h2]Player-unfriendly in a way that reminds me of a mobile game[/h2] \nI can't recommend LWITW in its current state and I won't be playing the game until at least the localization is improved. I kept pushing through, hoping it would improve, but all I found was more grind, tedium and dialogue that became increasingly frustrating to read due to its frequency and poor English localization. \n\nFirstly, the controls are clunky and unintuitive. There are too many button presses for everything. If you use a controller, there's no single button mapped for something as essential as opening the map. I eventually found a workaround by: using a controller and remapping the keys for the map, journal, and encyclopedia to my keyboard. I'd use the controller to control Ellie, and I'd use the keyboard for my mapped shortcuts. Without that, I'd first have to press a button to open a ring menu, and then select the map, journal, etc. Even then, both the map and potion encyclopedia required an extra button press to display a more useful view. \n\nWhat will really turn people off of the game is the pacing. Everything is slow or has some sort of friction attached to it. Movement is slow because Ellie moves slowly. You have to frequently shuffle between different collection tools with the clunky controls. Nearly every action requires you to press and hold A. With some materials, you have to press A to pick each off of the ground and this is accompanied by an animation. This all starts to add up. \n\nEarly on, your workshop tools are a chore to use. Every item must be processed one at a time. The Extractor is the most painful, with its animations quickly becoming annoying. Later tools like the Mixer and Roaster are slightly better in that they're passive so you can leave them running, but they take upwards of 30 seconds to process an item. You eventually gain access to an Incubator that partially supplants the Extractor, Mixer and Roaster. The Incubator works passively, *and* you can actually purchase multiple, unlike the other tools. The Incubator takes hours to work though, and being able to use it with a specific material is something you have to unlock, with its usage being gated behind collecting that specific material repeatedly in a specific way to fill your encyclopedia. Your Cauldron also eventually lets you brew multiple potions at once, though doing that stands at odds with some of the encyclopedia requirements.\n\nIf you're like me, and most of your enjoyment from these types of games comes from obsessively minmaxing and *then* focusing on the rest of the game: you won't be able to do that here. Your progression is gated by the main story. The game may appear to open up after a while, but the bulk of the game is locked behind story progression. New villagers, expanding shop stock, increasing stamina, and accessing upgrades all require sitting through the game's excessive dialogue and fetch quests. I recommend making a beeline for the main story up until you unlock furniture. As for the dialogue, coming from a game like Persona, imagine if regular NPC interactions could be as long as a social link rank up event for no reason. Nearly every small observation made by Ellie, or conversation with a villager feels like it drags on for upwards of 10 extra dialogue windows. There's often some combination of a text overflow issue, missing punctuation, typos and poor English more times than they are not. Any personality or charm the writing may have is killed by the bad English.\n\nSomething I really enjoyed at first was the foraging and filling up of the encyclopedia. You catalog items and detail ways to collect them. Every item offers bonuses for gathering it in specific ways or for finding rare variants. Like collect a Bush Bug within 1 second after you shake its bush 10 times. Collect 2 Maple Herb within 10 seconds 10 times, etc. Do that and you hit Rank A. Do those same conditions again 10 times and you hit Rank S, etc. Finished products also have unlockables tied to how many times you create/deliver/use them, but they're not as engaging as the ones for raw materials. Unfortunately, filling the encyclopedia eventually becomes tedious. I made it to the second area which visually looks great, but it also meant new materials to collect and potions to brew. Some of the new materials had collection requirements that were quite tedious compared to the first area. You'll have to collect these new materials over and over again. Collect Item A in X way 10 times, and then 20 times, and then 30 times multiplied by however many new items. So the encyclopedia basically devolved into a grind. \n\nSo overall: your progress will virtually be reset in every new area, there's an inability to reliably earn money outside of your weekly deliveries (and the amount of weekly deliveries available is gated behind grinding), and there are stamina and gold sinks tied to the durability of your cauldron, broom, and the already one-way quick travel gates *and* you have to sometimes choose between efficiency and completing your encyclopedia entries. The stamina system itself is also particularly annoying. Every action actually drains something like -20 Stamina + -10% Max Stamina. So if you gather a few items with 300/300 Stamina, you'll go down to something like 200/250. You can recover your max Stamina, but it requires buying a different type of food, meaning you now need two separate items which means more gold and another item slot just to fully restore yourself. You can forage for free and recover some Stamina, but the foraged berries and fruits restore very little. You can also choose to nap to pass time and recover a little Stamina. Also, good luck if you want to gather at night and accidentally napped for just one hour instead of the maximum of four, because then Ellie will say that she's not tired and you'll have to wait 3 in-game hours. The game also blocks you from napping before 8PM, presumably so you can't just sleep through to your weekly deliveries. All of this combined makes the game player-unfriendly in a way that reminds me of a mobile game. \n\nAside from foraging, potion making is the other major thing you'll be doing. Unfortunately, potion making is quite simple and nearly every mechanic present just feels like a gimmick throw in to slow you down after you spent so much time refining your raw materials. Making a couple of potions in a row for your weekly deliveries is tedium.\n\nWhen you're not upgrading your workshop through Luna Coins (that are earned separately from Gold Coins and used for specific things) or befriending villagers, you can use your Gold Coins (that is earned separately from Luna Coins and used for specific things) to purchase furniture. There's a surprising amount of furniture (and they're cute!) to unlock, but decoration is really just that. Furniture has no impact (not a problem for me personally) other than making your house and workshop look cute. The shop system could use some QoL additions here, since it doesn't tell you what items or furniture you already own, so unless you keep track of that yourself then you'll be wasting gold. \n\nVisually, the game is really cute. I love the pixel art, and especially the second major area. However, the music is often too tranquil to the point of being barely present. I also found the workshop having no music being a little jarring. On the technical side, I experienced no crashes, though loading screens could be a little long and sometimes freeze slightly. The only issue I had was my house suddenly having black wallpaper and tiles until I reapplied my custom wallpaper and tiles to fix it.\n\nTL;DR: this is a slow-paced, dialogue-heavy, whimsical slice-of-life RPG with collectathon and crafting elements, but it suffers from an overly verbose and badly translated script and does nearly everything it can to make you more and more frustrated. There's an enjoyable core here for sure, but the devs need to add a lot more polish.",
      "voted_up": false,
      "votes_helpful": 84
    },
    {
      "review": "I've played the game for a considerable amount of time, and while I find the main game play to be fun, the translated dialog and visuals tend to be a bit lazy. My largest gripe tends to be with the dialog being repetitive and just awkward to read through. While I can typically ignore the usual grammatical error from a company who's main language is not English, it's hard to ignore when the game is heavily text based and revolves around relationships and community. It is hard to feel connected to any of the characters because they are just frustrating to read with this translation. I would much rather just get the quests over and done with then really take the time to get to understand their individual personalities. While I cannot for sure know if this tidbit is true or not, I have heard that this game is *only* machine translated, which would make sense since the awkwardness of the text could be because it is a literal translation without the context of how those sentences would work in the English sentence structure.\r\n\r\nMy issues with the visuals tend to boil down to there being little to no clean up work. The sprites and animations are fun and lovely, however, there are some areas where corners were cut, especially in the localization. Sometimes, translated text will *overflow* the box, making it so there is text bleed above and below where it should be. This of course is very visually distracting and a tad hard to read through. Virgil's text can also do something similar where the font is squashed and squished to fit his text box. While the idea of him having his own box is neat and makes sense so he doesn't take up the main box as he tends to typically only have witty remarks, it is really distracting to see the kerning of the font get changed so often depending on how much he is saying. While I will agree this last part is a bit picky on my end, sometimes the animations are strange in the game, especially when things are moving to different levels of elevation. While we may have a map with visible elevation, such as a hill or slope.  the animations treat it as if it's a flat surface for anything interacting with it. This gives the impression that the character isn't changing elevations but is just in a static area. Sometimes, I've had issues with catching bush bugs because of this elevation trickery as well, but by far, it's not the worst contender in this review, but it's still distracting. \r\n\r\nI really want to be able to recommend this game as I think it's really fun and I like cozy games like this, there are too many issues post launch for me to feel comfortable to praise it. Who knows, maybe these issues will be fixed and I will be able to recommend it in good faith later. I'll be keeping a keen eye on this project until then.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "Very cute, and fun concept, but too many incredibly basic bugs for me to recommend it.\n\nOne example; there's a side quest early on to research the Squishychub. But if you've already researched it before getting the quest? You can NEVER complete the quest. It doesn't auto-complete because the task is done it's just a stuck quest that can never be completed. In alpha or even beta this is fair enough, but unacceptable for a game that's considered fully released.\n\nThis one is smaller but, stairs that go left/right don't animate like stairs, you just go straight across as if it's flat ground. This doesn't break the game or anything, but even the most amateur of indie games manages to get something so basic correctly, and it is very immersion breaking. Another thing that might be fine for early access but unacceptable for a released game.\n\nI don't doubt if I kept playing I'd find more problems, but being confronted with these issues, especially the quest one which just breaks your ability to complete parts of the game, are enough that I cannot recommend buying this.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I want to like it but I cannot. It goes incredibly slow, walking or even riding the broom feels like a chore. You cannot craft unless everything is in your pockets. Time passes really quick and with the speed you walk you cannot explore as much. Story and characters look very interesting but I really have not the patience to play it and actually progress.\r\nI will come back to it if :\r\n- you can access the box & inventory when you craft\r\n- you have a map where you can actually see all the maps you have so far so you don't walk aimlessly around\r\n- the walking or riding the broom actually go fast",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "It's a cute game with potential, but the translation is so unnatural and confusing that it's really not worth playing. It's hard at times to tell what you're supposed to do because the language just doesn't make sense. The team should really have spent any time on localization instead of possibly just leaving it up to machine translation. Really disappointing!",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "The controls are *very* wonky especially if you're playing on pc. Personally, I feel like it's mandatory for a game to have wasd controls over arrow keys if it is released for pc in mind (tbf this might be out of frustration on my part because my keyboard is the small one without arrow keys). I completely gave up on the game after manually trying to bind custom keys when i saw the amount of keys i had to rebind. Will pick this game up I guess if it gets updated, but for the moment I'll probably stick to my other pixel games.\n\nEdit: Additional stuff to add. \n* Had to play using a controller (My inputs sometimes doubles??? so I get stuck in a loop)\n* The resolution is awful, even on full resolution it was still small with a large black void around the game\n* Personal issue but the game runs so slow on my setup, especially compared to my other demanding games such as deadlock. Why does it run so bad for a 3.5 gb pixel game?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "[h1] Avoid until the bugs are fixed.[/h1]\n\nWhat a disappointment. I really want to recommend this game but I just can't in it's current state. The developers released a broken mess that's riddled with bugs, typos, and an English translation that barely makes sense sometimes. I've actually been telling my friends about this game and how much I liked it, and that the translation needed some work but I thought it was still worth checking out. Unfortunately, I can't recommend it anymore. \n\nThe last straw was a bug that blocked story progression that the only fix for is to roll back to an earlier save. Not one or two saves back... Ten saves back, which means I would lose at least two real-time days, or 10+ hours of playtime where I spent time ranking up my encyclopedia, decorating, collecting recipes, and doing side quests. \n\nIt's a shame, because I really can tell that there was a lot of heart put into the game, and if it wasn't completely broken, I would wholeheartedly recommend it, because when you're not fighting one of the several game-breaking bugs that currently exist, it's a delightful experience. \n\nI respect that the devs are trying to fix their game. They've released at least 15 hotfixes since the launch of the game a week ago, which is commendable. However, to me it's ridiculous that they looked at the state of this game and thought \"Yep, that's done, ship it\". The game is still in early access, they've just removed the EA label. It seems like they've essentially outsourced bug testing to their customers.\n\n[b] For anyone on the fence, I recommend checking the updates for the game to see if they're done releasing hotfixes before you purchase. Until the bugs are fixed, playing is mostly just a waste of your time.[/b]\n\n[h3] The Good[/h3]\n\n- The pixel art is beautiful. Rubrum is possibly one of the cutest little guys I've ever seen in a game. \n- The story, when you can understand the translation, is cute and engaging.\n- Crafting and gathering gameplay is unique and interesting.\n\n[h3] The Bad[/h3]\n\n- The music is pretty mediocre. There are a few areas that have nice background music, but the one you hear the most (when in your home/workshop) is pretty bland.\n- The game can be a bit too grindy, especially when you start opening up the ability to purchase furniture and decoration. Everything is really expensive and your ways of making money are pretty limited. \n\n[h3] The Broken[/h3]\n\n- There are currently at least 5 game-breaking bugs that can block your progression or force you to roll back to an earlier save as of September 24, 2025. At least wait to play until all of these are fixed. \n- The game is riddled with typos and dialogue that seems like it was translated incorrectly. \n- There are multiple minor bugs that are slowly being addressed.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Frankly awful english translation. sitting through the opening crawl / intro and wondering why the dialogue is this terrible, I went to the discussion boards and found it doesnt get any better : whatever localization team Sunny Side Up hired to do this should never get work again. Im sure there's a great game in here somewhere, Im just not going looking for it in spite of the gibberish.\n\nto be clear : I wish the devs all the best. they're a small Korean studio and there's clearly so much love and effort put into this. I just really, really wish they'd contracted a decent localization team for this, and added keybind options.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Unfortunately I just can't recommend this game. For PC users, even with the new control re-bindings, I think this game is extremely annoying to play simply because THERE IS NO MOUSE SUPPORT. I also think this game needs a 'quit to desktop option' since it takes way too long to close the game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Despite being cute and cozy game, and that a adore witches and all witchy stuff, I can't recommend this product. \r\nKeep in mind that i played only through Prologue.\r\n\r\n[b][u]Pros:[/u][/b]\r\n+ very cute and pretty sprites, both characters and world\r\n+ relaxing and chill soundtrack\r\n+ overall \"vibe\" of the game\r\nBut that's it, I'm afraid.\r\n\r\n[b][u]Cons:[/u][/b]\r\n- [b]very[/b] long and dull Prologue, It's not long story-vise but dialogues not interesting\r\n at all, so it definitely feels that way.\r\n- It looks like Witch's Hat was meant to be either educational or comic character but ends up just being irritating\r\n- gathering elements seem interesting in concept but so far feel suffocating\r\n- constant tutorials quickly become annoying\r\n\r\nAt this stage, the game feels more like a chore than an adventure. Maybe it opens up later, but the prologue didn’t give me any reason to want to stick around and find out.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I don't find endless forced dialogue cozy at all. I just want to play in comfort. Not be held captive audience to someone trying to be funny all the time. I can forgive the the controls and the game is very cute, but I load this game and then rethink if I want to even play at all or just eat and go to bed.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "A few hours into the game and already got the second patch in four days. \nStill, game-breaking bug with a missing potion and game freezing when exiting. \nIt might be worth waiting for patch x.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm only a couple hours in and the game itself seems pretty fun, but it runs very poorly on both a PC and on my Steam Deck. I'd skip the game until the developer does some optimisations for the game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Cute graphics, but the process of brewing potions is far too complicated and does not make for an enjoyable experience at all. Also it seems that my older save file from the previous version of the game could not be transferred to this build.\n\nEdit: I am not referring to the process of gathering resources, but to the brewing mechanisms itself. It's way too cumbersome.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I WANT to love this game so badly, but MAN is it stretched thin. \n\nI really enjoyed the first 5-10 hours of the game, the art style, the characters, just about everything was hitting the notes for a life sim that I enjoy. Then I started to notice how long it was taking just to get the bridge in town fixed, then when it DID get fixed I realized how many homes needed to be repaired, THEN I walked into an entirely new area, with new creatures for the encyclopedia, new potions I had to craft and suddenly I felt like I had barely scratched the surface of what I was playing. Then I looked at my play time and realized that I had played 20 hours to get to this point.\n\nIt's one thing to have a slow pace, but with how simple the gameplay actually is and how many fetch quests there are, the tedium sets in long before you even get to the second round of new characters. The charm of the game dissolves like sugar in water, and not even the promise of more adorable townsfolk can keep me going. \n\nIf doing the same chores over and over again without the joy of seeing even a farm grow in front of your house, or sitting through so much fluff in poorly written dialogue to get to the point, or wandering around the same locations again and again to collect ingredients sounds like fun, then here's the game for you. I unfortunately need to tap out.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love the idea of this game, and I like the gameplay loop. However, this developer was in desperate, DESPERATE need of an editor who knows the rules of English. The dialog of this game is so poorly done. It's often grammatically incorrect, obtuse, and repetitive for no reason. This game should never have had a 1.0 release in this state. If it ever gets the editing it so desperately needs, I'd be more than happy to pick it up again and play it. \n\nIf the language thing doesn't bother you, it's fun to play if you like a cozy collection/potion maker game. Otherwise, I can't recommend it in its current state.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The game definitely has potential but as for how it is right now, I am really surprised it is released. The UI is super clunky, switching tools is a pain in the peach, widescreen resolutions need to be fixed, controls re-thought, font options revisited and desperately requires other basic improvements to consider this game ready for release.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Beautiful art and an interesting concept. Unfortunately this game is unplayable for me. Too many menus, the controls need a lot of work and there is just *far* too much dialog.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I was really excited for the full release, so much so that I stopped playing early access to avoid burnout.\nUnfortunately many of the issues I had with the game in the beginning are still there: unintuitive gameplay, like stirring the pot shows a circle motion, but you just hold the joystick left or right. There are many more things that are just frustrating. Why do vines wither after putting a potion on them? It makes no sense.\nThere are still bugs that have been there a long time.\nSteam Deck performance is awfull.\nWhile the art style is really cute and the charm is there, I can't really recommend this game in good faith until these problems are addressed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the translation is shit for english and mandarin - same items have different names at different places, and some of the quest descriptions are just wrong, which means you basically have to guess what to do. would not recommend unless they fix it\n中英文翻譯都超爛，同個物品在不同地方會有不同名字，有些任務描述根本就是錯的，別玩",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Oh, boy, I did not believe the reviews mentioning the control scheme and the general tempo of the game. Don't make the same mistake I did: a realistic flight simulator or a hardcore fighting game pale in comparison to what it takes to control the everyday life of a tiny mischievous witch. Also the scarce saves completely disable short gaming sessions.\nMaybe one can reach the balanced state of mind needed to indulge in \"Little Witch in the Woods\", but I currently lack both endurance and time for such endeavors.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I would love to recommend this game. It's SO cute, perfect soundtrack, has unique mechanics, and I love that it's not just another clone of a certain \"cozy\" game we all know and love.\n\nBut there's just too much jankiness. The English translation, the massive heap of controls, the lack of ability to use the keyboard (who uses arrow keys for movement in 2025?), and not to mention all the game-breaking bugs still in the game for the past few years. This could easily be a 10/10 game if it was cleaned up.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The other negative reviews had it right on the major issues:\n1) Controls and UI. Way too many buttons and ankward UI for what is supposed to be a chill and healing game.\n2) Excessive dialogue. Basically, what could be said in 1 or 2 lines of dialogue, is repeated and stretched into double or triple that amount. For every single interaction and conversation. And I could already tell from just a couple of minutes. No thanks.\n\nA shame, because the other elements of the game (art and visuals, music, atmosphere and setting) seem good.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game is absolutely adorable, the dialogue, the character designs and the environments are all so cute and well designed. The gameplay is very fun and familiar without feeling redundant and like a copy of other popular games in the genre. I love the exploration aspect and the plot as a whole feels very compelling, there is a clear goal to work towards but no real rush so you can take as much time as you want getting there. The characters you meet are sweet and unique. There is so much to do and the game feels full of content to explore.\n\nThat said I could not recommend this game to anyone because it runs terribly. I am constantly forced to give up my exploration attempts to run back to the cottage and save because the game threatens to crash at every loading screen - and I don't want to lose my progress. On a computer that can run games like BG3 and AC without major issues I did not expect to have so much trouble running this game and it needs MAJOR performance improvements before I could recommend it to anybody. As it stands right now the performance issues affect the player way too much and really stops me from having a good time with the game. \nI've only played for 6 hours but the game has crashed multiple times for me already, I've had to do the tutorial 3 times, it takes several minutes to launch the game and it often crashes multiple times before I can launch it, and anytime there's a loading screen between areas (of which there are several) the game loads forever and starts experiencing major hickups that sometimes leads to crashes. There is just no way this is acceptable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The Game Developers clearly lack the ability and desire to make even a remotely working game. Everything about the game is tedious, and painful, and that's when the game works. Pages of forced dialogue of stupid comments (Developers idea of flavor?) hide the few details you need to know. Game controls are so oddly designed that it suggests the  Developers have never even seen how a human hand uses a keyboard before. The game lacks any  type of flow or momentum. Just stumble through areas being bombarded by forced dialogue and useless tips, while trying to get the character to do anything right. And the walking speed is a joke, and you can only \"run\" for a few seconds making even walking across a single screen a torture. Just a terrible, terrible game that is torture to play.\n\nWhich is sad because the idea has merits. It -could- be a cute, adorable game. The Developers would need to start from scratch, limit to very basic dialogues, simplify the menu system with a priority on functionality, double the walking speed of the character, take steps to ensure the game runs smooth, reduce the delay in tool use, and a few other major fixes. But it -could- be done if the Developers have any desire to make anything removely to a working game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Started playing the game since the keybinding issue was fixed. It is indeed very cute, but I got stuck on a prologue quest because there is no discernible way to use a potion I brewed to get rid of the vines its supposed to get rid of. As it stands, still can't recommend.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Up until now, I was absolutely loving the game – it’s soothing, a little whimsical, and just the right kind of cutesy to warm the soul. But alas, I lost my second Moonflower, and now I’m completely stuck in the main story. Without it, I can’t destroy the Prickly Wine Core – and from what I can tell, there’s no way to reacquire the item. That’s a major no-go for me, and something the devs really need to address.\r\n\r\nI deliberately waited until the game was out of Early Access, hoping to avoid exactly this kind of frustration and just enjoy a smooth, cozy experience. Well...\r\n\r\nI’ll probably check back in someday to see if it’s been fixed. But for now, starting a whole new playthrough feels like a chore I’m not willing to take on.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i really want to like this game, but the controls are not intuitive, no mouse support and some of the translations don't read well in English. The game performance is iffy for something that is no longer in early release. I haven't played for very long and unfortunately already encountering bugs. Something kept going wrong while making potions and it kept failing. I thought I was doing something wrong, but it turned out the game was just not registering that I was stirring the potions :/ There's also no quick way to save and exit the game. \n\nHaving played several other games in this genre, this one is not meeting the mark yet. Hope there are some improvements so I can give this a better review/ rating later on!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love this game but:\n\n- UX/UI design definitely needs improvement: quests, books, etc. (feels like folder inside folder inside folder inside folder…)\n\n- Menu (clicking to start — maybe there is some logic behind making it like this, I have zero ideas, but it takes time for nothing)\n\n- Dialogues are so pointless and monotonous sometimes. Try to use more visual storytelling rather than putting a bunch of text, which honestly feels AI-generated from time to time.\n\n- Walking is ridiculously slow.\n\n- No manual save = big no no.\n\n- Going all the way to the basement, which requires loading to go inside the house and then loading again to reach the basement and then maybe loading again to go outside to gather some materials, really takes time for nothing. The idea is cute, but if it is the main technique of the game, I guess it should be less complicated to reach.\n\nI LOVE THIDS GAME IT HAS A LOT OF POTENTIAL, CUTE LITTLE QUESTS AND ADORABLE VISUAL STYLE!!!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Like a lot of other reviews, I found this game to be lacking in certain aspects. On the surface, the premise is cute, and I can see the potential it has if it were more polished. Unfortunately, the actual experience didn’t live up to that potential, and I just can’t justify paying $16 for something that only gives brief, surface-level moments of joy.\n\nThe controls were one of my biggest frustrations. They felt clunky and unintuitive, especially since you can’t use your mouse at all. Everything is locked to the keyboard. I constantly found myself fumbling around and pressing the wrong keys, which really took me out of the flow of the game. For something that should feel light and enjoyable, the mechanics just made it more frustrating than fun.\n\nThe dialogue was another sticking point. It dragged on far too long, and there wasn’t any way to skip or fast-forward through it. Instead of being charming or immersive, it felt like a chore to sit through, which killed any momentum the game was trying to build.\n\nOverall, I think the game has a nice aesthetic and some good ideas, but in its current state it feels underdeveloped. With tighter controls, more player options, and better pacing in the dialogue, it could be a solid casual title. As it is now, though, I wouldn’t recommend it at full price.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cute art style, but that’s about it. Unpolished game, feels like I'm playing early access, clunky controls, cluttered interface, pixel-hunting, and endless boring dialogues. Definitely not the cozy relaxing game it pretends to be.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wanted to like this game, it seemed like something right up my alley and ive been CRAVING a game where I can just chill and make potions for the town. This game has so much useless dialogue, in the beginning I read through every conversation and thats how I got most of my play time. Especially in a game like this I would judge people for skipping over dialogue but honestly after the second hour of conversations lasting wayyyyy too long, I just started clicking through them. I feel like i barely progressed in the game and as if the excessive dialogue wasnt enough, they also repeat things to you! Like  why can I open and read a letter and then when I close it, the main character has to repeat the contents of the letter. The controls are a bit unclear and not intuitive at times which I would be able to get over if the story was better but unfortunately its not :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Extremely well made game with charming visuals and music, unfortunately there's SO MUCH DIALOGUE its actually insane. NPCs talk about the same minor detail for 15 text boxes or say irrelevant things 95% of the time, or keep repeating the same things accorss multiple scenarios.\n\nI understand this is likely for world building but it took me TWO HOURS to finish the Tutorial due to the sheer amount of text, only 14% of players have finished the tutorial according to Steam achivements. My thumb hurts after having to press a button so frequently to progress text boxes.\n\nUnfortunately I will be issuing a refund, fingers crossed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I normally do more in-depth reviews on Steam, but I can't with this one as I could barely play it.\n\n1. The game would crash the second I would launch it, and while I made attempts to try and fix it, nothing worked.\n2. The most I could do was play the tutorial, and the dialog became too much. I adore story-heavy games, but I couldn't get over the amount of dialog in just a tutorial section alone as it felt like it just dragged on too much. And, this comes from someone who's beaten games like P5R despite all of its dialog/story.\n\nGenuinely, I wanted to love this game. I still do want to love it, but I just can't unless changes are made. For example: an option to allow faster text speeds to make dialog less tedious would be good. I'm sure there could be more that could be added, but I never got far enough to speak further on it.\n\nFor now? I cannot recommend this game, and I've already requested a refund. Of course, just because I don't recommend the game doesn't mean you shouldn't do what you want to with your own money. Everything here is my experience, and my opinion.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "WARNING:  This game has no mouse controls at all.  The keyboard available is really clumsy and difficult to navigate, very very frustrating to play unless you play with a controller, which I do not.  They need to make this game much more keyboard mouse friendly.  Right now its not even keyboard friendly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I had to refund it. The translations were just so bad, only compounded by the fact that there is a LOT of dialogue. I genuinely couldn't make it past however long I played, which wasn't long at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do not get this game if you are predominantly a PC player; there is NO mouse support. Only played for a few minutes, and hated every bit of it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Honestly- the keyboard system is really not intuitive- and the intro is so bad I could barely get through it. I was sick of it after 5 minutes of hitting the space bar 60 times just to get through some inner monologue.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The \"healing game\", as the game itself says in one of its 4th wall breaking dialogues, with simple, yet interesting mechanics. Character art is nice. Pixel art is once again \"non-true\", since the rendering resolution is higher that of the sprites used. Animation is ok, I guess, but don't expect fluidity. Audio effects are lacking a bit. Music is simple, but fitting for the chill experience. Characters are quite likable and dialogues are straight without the kid-level bs. The game is quite easy to get into. At least until you start noticing bugs.\n\nPurchased the game during its EA stage. While it changed to the better a lot on the release, it still is not at the \"released\" stage just yet. After playing for a bit you start noticing how the game is stuttering, making the camera jitter when following the character, and breaking the sounds and music. You can also end up with a side quest, which will keep taking your items while not allowing you to complete it and get the reward.\n\nThe game itself is also very heavy despite being 2D - eats over 5Gb of memory, takes quite long to start and load, especially the village map (on a fkn i7-14700K with SSD!!). Kind of tips towards low dev skill in optimization area.\n\nIf you want chill experience, but can handle random bugs and stutters, go ahead and buy it.\nOtherwise, wait until that \"known bugs\" list is clear. Unlikely to happen in 2025 though.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tons of slow, boring dialogue. Couldn't bring myself to go past the first carriage.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gg",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The last thing you expect from a pixelated chill indie game like this is that flight simulator like amount of controls. Tons of menus and options, no mouse support, weird default settings. As a one-handed gamer I haven’t imagined that I’d be unable to play this kind of game one day. I hope there’ll be mouse support in the future, but until then I have to refund",
      "voted_up": false,
      "votes_helpful": 259
    },
    {
      "review": "I just...ugh, this pains me, because this game is so cute, and when it is working it feels pretty cozy. But holy smokes...the dialogue...\n\nLook, I know it is a translation, and a smaller studio probably can't afford a good translator, but I'm not convinced this is just a translation issue. There is just so much inane yammering. Like, I love cute little conversations in these cozy games, but this was frequent and bad enough that I started to dread whenever I had to talk to NPCs. Most important, quest related dialogues were so rough that I either couldn't fully follow what they wanted or was so uninterested in the endless chatter that I didn't retain the info. Sure, I was able to just look at the journal and figure it out, but even so...dialogue is a BIG part of this game, so dreading encounting the dialoague is kind of a problem. \n\nAlso, I know a lot of folks have complained about the keyboard controls, and holy schmoly are they right. If the dialog in this game isn't a deal break (and honestly, I don't think it would be for a lot of folks) do yourself a favor and play with a controller. I know, I know, a lot of y'all stardew purists would never consider giving up the robustness of a mouse and keyboard, but I promise, the keyboard controls are bad, and if you want to rebind them, haaaave fun...\n\nI dunno, I want to like this game so bad. I really do. But I've tried to come back twice now and I just can't get past some of this stuff",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "[h2]Player-unfriendly in a way that reminds me of a mobile game[/h2] \nI can't recommend LWITW in its current state and I won't be playing the game until at least the localization is improved. I kept pushing through, hoping it would improve, but all I found was more grind, tedium and dialogue that became increasingly frustrating to read due to its frequency and poor English localization. \n\nFirstly, the controls are clunky and unintuitive. There are too many button presses for everything. If you use a controller, there's no single button mapped for something as essential as opening the map. I eventually found a workaround by: using a controller and remapping the keys for the map, journal, and encyclopedia to my keyboard. I'd use the controller to control Ellie, and I'd use the keyboard for my mapped shortcuts. Without that, I'd first have to press a button to open a ring menu, and then select the map, journal, etc. Even then, both the map and potion encyclopedia required an extra button press to display a more useful view. \n\nWhat will really turn people off of the game is the pacing. Everything is slow or has some sort of friction attached to it. Movement is slow because Ellie moves slowly. You have to frequently shuffle between different collection tools with the clunky controls. Nearly every action requires you to press and hold A. With some materials, you have to press A to pick each off of the ground and this is accompanied by an animation. This all starts to add up. \n\nEarly on, your workshop tools are a chore to use. Every item must be processed one at a time. The Extractor is the most painful, with its animations quickly becoming annoying. Later tools like the Mixer and Roaster are slightly better in that they're passive so you can leave them running, but they take upwards of 30 seconds to process an item. You eventually gain access to an Incubator that partially supplants the Extractor, Mixer and Roaster. The Incubator works passively, *and* you can actually purchase multiple, unlike the other tools. The Incubator takes hours to work though, and being able to use it with a specific material is something you have to unlock, with its usage being gated behind collecting that specific material repeatedly in a specific way to fill your encyclopedia. Your Cauldron also eventually lets you brew multiple potions at once, though doing that stands at odds with some of the encyclopedia requirements.\n\nIf you're like me, and most of your enjoyment from these types of games comes from obsessively minmaxing and *then* focusing on the rest of the game: you won't be able to do that here. Your progression is gated by the main story. The game may appear to open up after a while, but the bulk of the game is locked behind story progression. New villagers, expanding shop stock, increasing stamina, and accessing upgrades all require sitting through the game's excessive dialogue and fetch quests. I recommend making a beeline for the main story up until you unlock furniture. As for the dialogue, coming from a game like Persona, imagine if regular NPC interactions could be as long as a social link rank up event for no reason. Nearly every small observation made by Ellie, or conversation with a villager feels like it drags on for upwards of 10 extra dialogue windows. There's often some combination of a text overflow issue, missing punctuation, typos and poor English more times than they are not. Any personality or charm the writing may have is killed by the bad English.\n\nSomething I really enjoyed at first was the foraging and filling up of the encyclopedia. You catalog items and detail ways to collect them. Every item offers bonuses for gathering it in specific ways or for finding rare variants. Like collect a Bush Bug within 1 second after you shake its bush 10 times. Collect 2 Maple Herb within 10 seconds 10 times, etc. Do that and you hit Rank A. Do those same conditions again 10 times and you hit Rank S, etc. Finished products also have unlockables tied to how many times you create/deliver/use them, but they're not as engaging as the ones for raw materials. Unfortunately, filling the encyclopedia eventually becomes tedious. I made it to the second area which visually looks great, but it also meant new materials to collect and potions to brew. Some of the new materials had collection requirements that were quite tedious compared to the first area. You'll have to collect these new materials over and over again. Collect Item A in X way 10 times, and then 20 times, and then 30 times multiplied by however many new items. So the encyclopedia basically devolved into a grind. \n\nSo overall: your progress will virtually be reset in every new area, there's an inability to reliably earn money outside of your weekly deliveries (and the amount of weekly deliveries available is gated behind grinding), and there are stamina and gold sinks tied to the durability of your cauldron, broom, and the already one-way quick travel gates *and* you have to sometimes choose between efficiency and completing your encyclopedia entries. The stamina system itself is also particularly annoying. Every action actually drains something like -20 Stamina + -10% Max Stamina. So if you gather a few items with 300/300 Stamina, you'll go down to something like 200/250. You can recover your max Stamina, but it requires buying a different type of food, meaning you now need two separate items which means more gold and another item slot just to fully restore yourself. You can forage for free and recover some Stamina, but the foraged berries and fruits restore very little. You can also choose to nap to pass time and recover a little Stamina. Also, good luck if you want to gather at night and accidentally napped for just one hour instead of the maximum of four, because then Ellie will say that she's not tired and you'll have to wait 3 in-game hours. The game also blocks you from napping before 8PM, presumably so you can't just sleep through to your weekly deliveries. All of this combined makes the game player-unfriendly in a way that reminds me of a mobile game. \n\nAside from foraging, potion making is the other major thing you'll be doing. Unfortunately, potion making is quite simple and nearly every mechanic present just feels like a gimmick throw in to slow you down after you spent so much time refining your raw materials. Making a couple of potions in a row for your weekly deliveries is tedium.\n\nWhen you're not upgrading your workshop through Luna Coins (that are earned separately from Gold Coins and used for specific things) or befriending villagers, you can use your Gold Coins (that is earned separately from Luna Coins and used for specific things) to purchase furniture. There's a surprising amount of furniture (and they're cute!) to unlock, but decoration is really just that. Furniture has no impact (not a problem for me personally) other than making your house and workshop look cute. The shop system could use some QoL additions here, since it doesn't tell you what items or furniture you already own, so unless you keep track of that yourself then you'll be wasting gold. \n\nVisually, the game is really cute. I love the pixel art, and especially the second major area. However, the music is often too tranquil to the point of being barely present. I also found the workshop having no music being a little jarring. On the technical side, I experienced no crashes, though loading screens could be a little long and sometimes freeze slightly. The only issue I had was my house suddenly having black wallpaper and tiles until I reapplied my custom wallpaper and tiles to fix it.\n\nTL;DR: this is a slow-paced, dialogue-heavy, whimsical slice-of-life RPG with collectathon and crafting elements, but it suffers from an overly verbose and badly translated script and does nearly everything it can to make you more and more frustrated. There's an enjoyable core here for sure, but the devs need to add a lot more polish.",
      "voted_up": false,
      "votes_helpful": 84
    },
    {
      "review": "I've played the game for a considerable amount of time, and while I find the main game play to be fun, the translated dialog and visuals tend to be a bit lazy. My largest gripe tends to be with the dialog being repetitive and just awkward to read through. While I can typically ignore the usual grammatical error from a company who's main language is not English, it's hard to ignore when the game is heavily text based and revolves around relationships and community. It is hard to feel connected to any of the characters because they are just frustrating to read with this translation. I would much rather just get the quests over and done with then really take the time to get to understand their individual personalities. While I cannot for sure know if this tidbit is true or not, I have heard that this game is *only* machine translated, which would make sense since the awkwardness of the text could be because it is a literal translation without the context of how those sentences would work in the English sentence structure.\r\n\r\nMy issues with the visuals tend to boil down to there being little to no clean up work. The sprites and animations are fun and lovely, however, there are some areas where corners were cut, especially in the localization. Sometimes, translated text will *overflow* the box, making it so there is text bleed above and below where it should be. This of course is very visually distracting and a tad hard to read through. Virgil's text can also do something similar where the font is squashed and squished to fit his text box. While the idea of him having his own box is neat and makes sense so he doesn't take up the main box as he tends to typically only have witty remarks, it is really distracting to see the kerning of the font get changed so often depending on how much he is saying. While I will agree this last part is a bit picky on my end, sometimes the animations are strange in the game, especially when things are moving to different levels of elevation. While we may have a map with visible elevation, such as a hill or slope.  the animations treat it as if it's a flat surface for anything interacting with it. This gives the impression that the character isn't changing elevations but is just in a static area. Sometimes, I've had issues with catching bush bugs because of this elevation trickery as well, but by far, it's not the worst contender in this review, but it's still distracting. \r\n\r\nI really want to be able to recommend this game as I think it's really fun and I like cozy games like this, there are too many issues post launch for me to feel comfortable to praise it. Who knows, maybe these issues will be fixed and I will be able to recommend it in good faith later. I'll be keeping a keen eye on this project until then.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "Very cute, and fun concept, but too many incredibly basic bugs for me to recommend it.\n\nOne example; there's a side quest early on to research the Squishychub. But if you've already researched it before getting the quest? You can NEVER complete the quest. It doesn't auto-complete because the task is done it's just a stuck quest that can never be completed. In alpha or even beta this is fair enough, but unacceptable for a game that's considered fully released.\n\nThis one is smaller but, stairs that go left/right don't animate like stairs, you just go straight across as if it's flat ground. This doesn't break the game or anything, but even the most amateur of indie games manages to get something so basic correctly, and it is very immersion breaking. Another thing that might be fine for early access but unacceptable for a released game.\n\nI don't doubt if I kept playing I'd find more problems, but being confronted with these issues, especially the quest one which just breaks your ability to complete parts of the game, are enough that I cannot recommend buying this.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I want to like it but I cannot. It goes incredibly slow, walking or even riding the broom feels like a chore. You cannot craft unless everything is in your pockets. Time passes really quick and with the speed you walk you cannot explore as much. Story and characters look very interesting but I really have not the patience to play it and actually progress.\r\nI will come back to it if :\r\n- you can access the box & inventory when you craft\r\n- you have a map where you can actually see all the maps you have so far so you don't walk aimlessly around\r\n- the walking or riding the broom actually go fast",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "It's a cute game with potential, but the translation is so unnatural and confusing that it's really not worth playing. It's hard at times to tell what you're supposed to do because the language just doesn't make sense. The team should really have spent any time on localization instead of possibly just leaving it up to machine translation. Really disappointing!",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "The controls are *very* wonky especially if you're playing on pc. Personally, I feel like it's mandatory for a game to have wasd controls over arrow keys if it is released for pc in mind (tbf this might be out of frustration on my part because my keyboard is the small one without arrow keys). I completely gave up on the game after manually trying to bind custom keys when i saw the amount of keys i had to rebind. Will pick this game up I guess if it gets updated, but for the moment I'll probably stick to my other pixel games.\n\nEdit: Additional stuff to add. \n* Had to play using a controller (My inputs sometimes doubles??? so I get stuck in a loop)\n* The resolution is awful, even on full resolution it was still small with a large black void around the game\n* Personal issue but the game runs so slow on my setup, especially compared to my other demanding games such as deadlock. Why does it run so bad for a 3.5 gb pixel game?",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "[h1] Avoid until the bugs are fixed.[/h1]\n\nWhat a disappointment. I really want to recommend this game but I just can't in it's current state. The developers released a broken mess that's riddled with bugs, typos, and an English translation that barely makes sense sometimes. I've actually been telling my friends about this game and how much I liked it, and that the translation needed some work but I thought it was still worth checking out. Unfortunately, I can't recommend it anymore. \n\nThe last straw was a bug that blocked story progression that the only fix for is to roll back to an earlier save. Not one or two saves back... Ten saves back, which means I would lose at least two real-time days, or 10+ hours of playtime where I spent time ranking up my encyclopedia, decorating, collecting recipes, and doing side quests. \n\nIt's a shame, because I really can tell that there was a lot of heart put into the game, and if it wasn't completely broken, I would wholeheartedly recommend it, because when you're not fighting one of the several game-breaking bugs that currently exist, it's a delightful experience. \n\nI respect that the devs are trying to fix their game. They've released at least 15 hotfixes since the launch of the game a week ago, which is commendable. However, to me it's ridiculous that they looked at the state of this game and thought \"Yep, that's done, ship it\". The game is still in early access, they've just removed the EA label. It seems like they've essentially outsourced bug testing to their customers.\n\n[b] For anyone on the fence, I recommend checking the updates for the game to see if they're done releasing hotfixes before you purchase. Until the bugs are fixed, playing is mostly just a waste of your time.[/b]\n\n[h3] The Good[/h3]\n\n- The pixel art is beautiful. Rubrum is possibly one of the cutest little guys I've ever seen in a game. \n- The story, when you can understand the translation, is cute and engaging.\n- Crafting and gathering gameplay is unique and interesting.\n\n[h3] The Bad[/h3]\n\n- The music is pretty mediocre. There are a few areas that have nice background music, but the one you hear the most (when in your home/workshop) is pretty bland.\n- The game can be a bit too grindy, especially when you start opening up the ability to purchase furniture and decoration. Everything is really expensive and your ways of making money are pretty limited. \n\n[h3] The Broken[/h3]\n\n- There are currently at least 5 game-breaking bugs that can block your progression or force you to roll back to an earlier save as of September 24, 2025. At least wait to play until all of these are fixed. \n- The game is riddled with typos and dialogue that seems like it was translated incorrectly. \n- There are multiple minor bugs that are slowly being addressed.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Frankly awful english translation. sitting through the opening crawl / intro and wondering why the dialogue is this terrible, I went to the discussion boards and found it doesnt get any better : whatever localization team Sunny Side Up hired to do this should never get work again. Im sure there's a great game in here somewhere, Im just not going looking for it in spite of the gibberish.\n\nto be clear : I wish the devs all the best. they're a small Korean studio and there's clearly so much love and effort put into this. I just really, really wish they'd contracted a decent localization team for this, and added keybind options.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Unfortunately I just can't recommend this game. For PC users, even with the new control re-bindings, I think this game is extremely annoying to play simply because THERE IS NO MOUSE SUPPORT. I also think this game needs a 'quit to desktop option' since it takes way too long to close the game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Despite being cute and cozy game, and that a adore witches and all witchy stuff, I can't recommend this product. \r\nKeep in mind that i played only through Prologue.\r\n\r\n[b][u]Pros:[/u][/b]\r\n+ very cute and pretty sprites, both characters and world\r\n+ relaxing and chill soundtrack\r\n+ overall \"vibe\" of the game\r\nBut that's it, I'm afraid.\r\n\r\n[b][u]Cons:[/u][/b]\r\n- [b]very[/b] long and dull Prologue, It's not long story-vise but dialogues not interesting\r\n at all, so it definitely feels that way.\r\n- It looks like Witch's Hat was meant to be either educational or comic character but ends up just being irritating\r\n- gathering elements seem interesting in concept but so far feel suffocating\r\n- constant tutorials quickly become annoying\r\n\r\nAt this stage, the game feels more like a chore than an adventure. Maybe it opens up later, but the prologue didn’t give me any reason to want to stick around and find out.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I don't find endless forced dialogue cozy at all. I just want to play in comfort. Not be held captive audience to someone trying to be funny all the time. I can forgive the the controls and the game is very cute, but I load this game and then rethink if I want to even play at all or just eat and go to bed.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "A few hours into the game and already got the second patch in four days. \nStill, game-breaking bug with a missing potion and game freezing when exiting. \nIt might be worth waiting for patch x.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm only a couple hours in and the game itself seems pretty fun, but it runs very poorly on both a PC and on my Steam Deck. I'd skip the game until the developer does some optimisations for the game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Cute graphics, but the process of brewing potions is far too complicated and does not make for an enjoyable experience at all. Also it seems that my older save file from the previous version of the game could not be transferred to this build.\n\nEdit: I am not referring to the process of gathering resources, but to the brewing mechanisms itself. It's way too cumbersome.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I WANT to love this game so badly, but MAN is it stretched thin. \n\nI really enjoyed the first 5-10 hours of the game, the art style, the characters, just about everything was hitting the notes for a life sim that I enjoy. Then I started to notice how long it was taking just to get the bridge in town fixed, then when it DID get fixed I realized how many homes needed to be repaired, THEN I walked into an entirely new area, with new creatures for the encyclopedia, new potions I had to craft and suddenly I felt like I had barely scratched the surface of what I was playing. Then I looked at my play time and realized that I had played 20 hours to get to this point.\n\nIt's one thing to have a slow pace, but with how simple the gameplay actually is and how many fetch quests there are, the tedium sets in long before you even get to the second round of new characters. The charm of the game dissolves like sugar in water, and not even the promise of more adorable townsfolk can keep me going. \n\nIf doing the same chores over and over again without the joy of seeing even a farm grow in front of your house, or sitting through so much fluff in poorly written dialogue to get to the point, or wandering around the same locations again and again to collect ingredients sounds like fun, then here's the game for you. I unfortunately need to tap out.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I love the idea of this game, and I like the gameplay loop. However, this developer was in desperate, DESPERATE need of an editor who knows the rules of English. The dialog of this game is so poorly done. It's often grammatically incorrect, obtuse, and repetitive for no reason. This game should never have had a 1.0 release in this state. If it ever gets the editing it so desperately needs, I'd be more than happy to pick it up again and play it. \n\nIf the language thing doesn't bother you, it's fun to play if you like a cozy collection/potion maker game. Otherwise, I can't recommend it in its current state.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "The game definitely has potential but as for how it is right now, I am really surprised it is released. The UI is super clunky, switching tools is a pain in the peach, widescreen resolutions need to be fixed, controls re-thought, font options revisited and desperately requires other basic improvements to consider this game ready for release.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Beautiful art and an interesting concept. Unfortunately this game is unplayable for me. Too many menus, the controls need a lot of work and there is just *far* too much dialog.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I was really excited for the full release, so much so that I stopped playing early access to avoid burnout.\nUnfortunately many of the issues I had with the game in the beginning are still there: unintuitive gameplay, like stirring the pot shows a circle motion, but you just hold the joystick left or right. There are many more things that are just frustrating. Why do vines wither after putting a potion on them? It makes no sense.\nThere are still bugs that have been there a long time.\nSteam Deck performance is awfull.\nWhile the art style is really cute and the charm is there, I can't really recommend this game in good faith until these problems are addressed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the translation is shit for english and mandarin - same items have different names at different places, and some of the quest descriptions are just wrong, which means you basically have to guess what to do. would not recommend unless they fix it\n中英文翻譯都超爛，同個物品在不同地方會有不同名字，有些任務描述根本就是錯的，別玩",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Oh, boy, I did not believe the reviews mentioning the control scheme and the general tempo of the game. Don't make the same mistake I did: a realistic flight simulator or a hardcore fighting game pale in comparison to what it takes to control the everyday life of a tiny mischievous witch. Also the scarce saves completely disable short gaming sessions.\nMaybe one can reach the balanced state of mind needed to indulge in \"Little Witch in the Woods\", but I currently lack both endurance and time for such endeavors.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I would love to recommend this game. It's SO cute, perfect soundtrack, has unique mechanics, and I love that it's not just another clone of a certain \"cozy\" game we all know and love.\n\nBut there's just too much jankiness. The English translation, the massive heap of controls, the lack of ability to use the keyboard (who uses arrow keys for movement in 2025?), and not to mention all the game-breaking bugs still in the game for the past few years. This could easily be a 10/10 game if it was cleaned up.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The other negative reviews had it right on the major issues:\n1) Controls and UI. Way too many buttons and ankward UI for what is supposed to be a chill and healing game.\n2) Excessive dialogue. Basically, what could be said in 1 or 2 lines of dialogue, is repeated and stretched into double or triple that amount. For every single interaction and conversation. And I could already tell from just a couple of minutes. No thanks.\n\nA shame, because the other elements of the game (art and visuals, music, atmosphere and setting) seem good.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game is absolutely adorable, the dialogue, the character designs and the environments are all so cute and well designed. The gameplay is very fun and familiar without feeling redundant and like a copy of other popular games in the genre. I love the exploration aspect and the plot as a whole feels very compelling, there is a clear goal to work towards but no real rush so you can take as much time as you want getting there. The characters you meet are sweet and unique. There is so much to do and the game feels full of content to explore.\n\nThat said I could not recommend this game to anyone because it runs terribly. I am constantly forced to give up my exploration attempts to run back to the cottage and save because the game threatens to crash at every loading screen - and I don't want to lose my progress. On a computer that can run games like BG3 and AC without major issues I did not expect to have so much trouble running this game and it needs MAJOR performance improvements before I could recommend it to anybody. As it stands right now the performance issues affect the player way too much and really stops me from having a good time with the game. \nI've only played for 6 hours but the game has crashed multiple times for me already, I've had to do the tutorial 3 times, it takes several minutes to launch the game and it often crashes multiple times before I can launch it, and anytime there's a loading screen between areas (of which there are several) the game loads forever and starts experiencing major hickups that sometimes leads to crashes. There is just no way this is acceptable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The Game Developers clearly lack the ability and desire to make even a remotely working game. Everything about the game is tedious, and painful, and that's when the game works. Pages of forced dialogue of stupid comments (Developers idea of flavor?) hide the few details you need to know. Game controls are so oddly designed that it suggests the  Developers have never even seen how a human hand uses a keyboard before. The game lacks any  type of flow or momentum. Just stumble through areas being bombarded by forced dialogue and useless tips, while trying to get the character to do anything right. And the walking speed is a joke, and you can only \"run\" for a few seconds making even walking across a single screen a torture. Just a terrible, terrible game that is torture to play.\n\nWhich is sad because the idea has merits. It -could- be a cute, adorable game. The Developers would need to start from scratch, limit to very basic dialogues, simplify the menu system with a priority on functionality, double the walking speed of the character, take steps to ensure the game runs smooth, reduce the delay in tool use, and a few other major fixes. But it -could- be done if the Developers have any desire to make anything removely to a working game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Started playing the game since the keybinding issue was fixed. It is indeed very cute, but I got stuck on a prologue quest because there is no discernible way to use a potion I brewed to get rid of the vines its supposed to get rid of. As it stands, still can't recommend.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Up until now, I was absolutely loving the game – it’s soothing, a little whimsical, and just the right kind of cutesy to warm the soul. But alas, I lost my second Moonflower, and now I’m completely stuck in the main story. Without it, I can’t destroy the Prickly Wine Core – and from what I can tell, there’s no way to reacquire the item. That’s a major no-go for me, and something the devs really need to address.\r\n\r\nI deliberately waited until the game was out of Early Access, hoping to avoid exactly this kind of frustration and just enjoy a smooth, cozy experience. Well...\r\n\r\nI’ll probably check back in someday to see if it’s been fixed. But for now, starting a whole new playthrough feels like a chore I’m not willing to take on.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i really want to like this game, but the controls are not intuitive, no mouse support and some of the translations don't read well in English. The game performance is iffy for something that is no longer in early release. I haven't played for very long and unfortunately already encountering bugs. Something kept going wrong while making potions and it kept failing. I thought I was doing something wrong, but it turned out the game was just not registering that I was stirring the potions :/ There's also no quick way to save and exit the game. \n\nHaving played several other games in this genre, this one is not meeting the mark yet. Hope there are some improvements so I can give this a better review/ rating later on!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love this game but:\n\n- UX/UI design definitely needs improvement: quests, books, etc. (feels like folder inside folder inside folder inside folder…)\n\n- Menu (clicking to start — maybe there is some logic behind making it like this, I have zero ideas, but it takes time for nothing)\n\n- Dialogues are so pointless and monotonous sometimes. Try to use more visual storytelling rather than putting a bunch of text, which honestly feels AI-generated from time to time.\n\n- Walking is ridiculously slow.\n\n- No manual save = big no no.\n\n- Going all the way to the basement, which requires loading to go inside the house and then loading again to reach the basement and then maybe loading again to go outside to gather some materials, really takes time for nothing. The idea is cute, but if it is the main technique of the game, I guess it should be less complicated to reach.\n\nI LOVE THIDS GAME IT HAS A LOT OF POTENTIAL, CUTE LITTLE QUESTS AND ADORABLE VISUAL STYLE!!!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Like a lot of other reviews, I found this game to be lacking in certain aspects. On the surface, the premise is cute, and I can see the potential it has if it were more polished. Unfortunately, the actual experience didn’t live up to that potential, and I just can’t justify paying $16 for something that only gives brief, surface-level moments of joy.\n\nThe controls were one of my biggest frustrations. They felt clunky and unintuitive, especially since you can’t use your mouse at all. Everything is locked to the keyboard. I constantly found myself fumbling around and pressing the wrong keys, which really took me out of the flow of the game. For something that should feel light and enjoyable, the mechanics just made it more frustrating than fun.\n\nThe dialogue was another sticking point. It dragged on far too long, and there wasn’t any way to skip or fast-forward through it. Instead of being charming or immersive, it felt like a chore to sit through, which killed any momentum the game was trying to build.\n\nOverall, I think the game has a nice aesthetic and some good ideas, but in its current state it feels underdeveloped. With tighter controls, more player options, and better pacing in the dialogue, it could be a solid casual title. As it is now, though, I wouldn’t recommend it at full price.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Cute art style, but that’s about it. Unpolished game, feels like I'm playing early access, clunky controls, cluttered interface, pixel-hunting, and endless boring dialogues. Definitely not the cozy relaxing game it pretends to be.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wanted to like this game, it seemed like something right up my alley and ive been CRAVING a game where I can just chill and make potions for the town. This game has so much useless dialogue, in the beginning I read through every conversation and thats how I got most of my play time. Especially in a game like this I would judge people for skipping over dialogue but honestly after the second hour of conversations lasting wayyyyy too long, I just started clicking through them. I feel like i barely progressed in the game and as if the excessive dialogue wasnt enough, they also repeat things to you! Like  why can I open and read a letter and then when I close it, the main character has to repeat the contents of the letter. The controls are a bit unclear and not intuitive at times which I would be able to get over if the story was better but unfortunately its not :(",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Extremely well made game with charming visuals and music, unfortunately there's SO MUCH DIALOGUE its actually insane. NPCs talk about the same minor detail for 15 text boxes or say irrelevant things 95% of the time, or keep repeating the same things accorss multiple scenarios.\n\nI understand this is likely for world building but it took me TWO HOURS to finish the Tutorial due to the sheer amount of text, only 14% of players have finished the tutorial according to Steam achivements. My thumb hurts after having to press a button so frequently to progress text boxes.\n\nUnfortunately I will be issuing a refund, fingers crossed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I normally do more in-depth reviews on Steam, but I can't with this one as I could barely play it.\n\n1. The game would crash the second I would launch it, and while I made attempts to try and fix it, nothing worked.\n2. The most I could do was play the tutorial, and the dialog became too much. I adore story-heavy games, but I couldn't get over the amount of dialog in just a tutorial section alone as it felt like it just dragged on too much. And, this comes from someone who's beaten games like P5R despite all of its dialog/story.\n\nGenuinely, I wanted to love this game. I still do want to love it, but I just can't unless changes are made. For example: an option to allow faster text speeds to make dialog less tedious would be good. I'm sure there could be more that could be added, but I never got far enough to speak further on it.\n\nFor now? I cannot recommend this game, and I've already requested a refund. Of course, just because I don't recommend the game doesn't mean you shouldn't do what you want to with your own money. Everything here is my experience, and my opinion.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "WARNING:  This game has no mouse controls at all.  The keyboard available is really clumsy and difficult to navigate, very very frustrating to play unless you play with a controller, which I do not.  They need to make this game much more keyboard mouse friendly.  Right now its not even keyboard friendly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I had to refund it. The translations were just so bad, only compounded by the fact that there is a LOT of dialogue. I genuinely couldn't make it past however long I played, which wasn't long at all.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do not get this game if you are predominantly a PC player; there is NO mouse support. Only played for a few minutes, and hated every bit of it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Honestly- the keyboard system is really not intuitive- and the intro is so bad I could barely get through it. I was sick of it after 5 minutes of hitting the space bar 60 times just to get through some inner monologue.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The \"healing game\", as the game itself says in one of its 4th wall breaking dialogues, with simple, yet interesting mechanics. Character art is nice. Pixel art is once again \"non-true\", since the rendering resolution is higher that of the sprites used. Animation is ok, I guess, but don't expect fluidity. Audio effects are lacking a bit. Music is simple, but fitting for the chill experience. Characters are quite likable and dialogues are straight without the kid-level bs. The game is quite easy to get into. At least until you start noticing bugs.\n\nPurchased the game during its EA stage. While it changed to the better a lot on the release, it still is not at the \"released\" stage just yet. After playing for a bit you start noticing how the game is stuttering, making the camera jitter when following the character, and breaking the sounds and music. You can also end up with a side quest, which will keep taking your items while not allowing you to complete it and get the reward.\n\nThe game itself is also very heavy despite being 2D - eats over 5Gb of memory, takes quite long to start and load, especially the village map (on a fkn i7-14700K with SSD!!). Kind of tips towards low dev skill in optimization area.\n\nIf you want chill experience, but can handle random bugs and stutters, go ahead and buy it.\nOtherwise, wait until that \"known bugs\" list is clear. Unlikely to happen in 2025 though.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tons of slow, boring dialogue. Couldn't bring myself to go past the first carriage.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "gg",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The last thing you expect from a pixelated chill indie game like this is that flight simulator like amount of controls. Tons of menus and options, no mouse support, weird default settings. As a one-handed gamer I haven’t imagined that I’d be unable to play this kind of game one day. I hope there’ll be mouse support in the future, but until then I have to refund",
      "voted_up": false,
      "votes_helpful": 259
    },
    {
      "review": "I just...ugh, this pains me, because this game is so cute, and when it is working it feels pretty cozy. But holy smokes...the dialogue...\n\nLook, I know it is a translation, and a smaller studio probably can't afford a good translator, but I'm not convinced this is just a translation issue. There is just so much inane yammering. Like, I love cute little conversations in these cozy games, but this was frequent and bad enough that I started to dread whenever I had to talk to NPCs. Most important, quest related dialogues were so rough that I either couldn't fully follow what they wanted or was so uninterested in the endless chatter that I didn't retain the info. Sure, I was able to just look at the journal and figure it out, but even so...dialogue is a BIG part of this game, so dreading encounting the dialoague is kind of a problem. \n\nAlso, I know a lot of folks have complained about the keyboard controls, and holy schmoly are they right. If the dialog in this game isn't a deal break (and honestly, I don't think it would be for a lot of folks) do yourself a favor and play with a controller. I know, I know, a lot of y'all stardew purists would never consider giving up the robustness of a mouse and keyboard, but I promise, the keyboard controls are bad, and if you want to rebind them, haaaave fun...\n\nI dunno, I want to like this game so bad. I really do. But I've tried to come back twice now and I just can't get past some of this stuff",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "[h2]Player-unfriendly in a way that reminds me of a mobile game[/h2] \nI can't recommend LWITW in its current state and I won't be playing the game until at least the localization is improved. I kept pushing through, hoping it would improve, but all I found was more grind, tedium and dialogue that became increasingly frustrating to read due to its frequency and poor English localization. \n\nFirstly, the controls are clunky and unintuitive. There are too many button presses for everything. If you use a controller, there's no single button mapped for something as essential as opening the map. I eventually found a workaround by: using a controller and remapping the keys for the map, journal, and encyclopedia to my keyboard. I'd use the controller to control Ellie, and I'd use the keyboard for my mapped shortcuts. Without that, I'd first have to press a button to open a ring menu, and then select the map, journal, etc. Even then, both the map and potion encyclopedia required an extra button press to display a more useful view. \n\nWhat will really turn people off of the game is the pacing. Everything is slow or has some sort of friction attached to it. Movement is slow because Ellie moves slowly. You have to frequently shuffle between different collection tools with the clunky controls. Nearly every action requires you to press and hold A. With some materials, you have to press A to pick each off of the ground and this is accompanied by an animation. This all starts to add up. \n\nEarly on, your workshop tools are a chore to use. Every item must be processed one at a time. The Extractor is the most painful, with its animations quickly becoming annoying. Later tools like the Mixer and Roaster are slightly better in that they're passive so you can leave them running, but they take upwards of 30 seconds to process an item. You eventually gain access to an Incubator that partially supplants the Extractor, Mixer and Roaster. The Incubator works passively, *and* you can actually purchase multiple, unlike the other tools. The Incubator takes hours to work though, and being able to use it with a specific material is something you have to unlock, with its usage being gated behind collecting that specific material repeatedly in a specific way to fill your encyclopedia. Your Cauldron also eventually lets you brew multiple potions at once, though doing that stands at odds with some of the encyclopedia requirements.\n\nIf you're like me, and most of your enjoyment from these types of games comes from obsessively minmaxing and *then* focusing on the rest of the game: you won't be able to do that here. Your progression is gated by the main story. The game may appear to open up after a while, but the bulk of the game is locked behind story progression. New villagers, expanding shop stock, increasing stamina, and accessing upgrades all require sitting through the game's excessive dialogue and fetch quests. I recommend making a beeline for the main story up until you unlock furniture. As for the dialogue, coming from a game like Persona, imagine if regular NPC interactions could be as long as a social link rank up event for no reason. Nearly every small observation made by Ellie, or conversation with a villager feels like it drags on for upwards of 10 extra dialogue windows. There's often some combination of a text overflow issue, missing punctuation, typos and poor English more times than they are not. Any personality or charm the writing may have is killed by the bad English.\n\nSomething I really enjoyed at first was the foraging and filling up of the encyclopedia. You catalog items and detail ways to collect them. Every item offers bonuses for gathering it in specific ways or for finding rare variants. Like collect a Bush Bug within 1 second after you shake its bush 10 times. Collect 2 Maple Herb within 10 seconds 10 times, etc. Do that and you hit Rank A. Do those same conditions again 10 times and you hit Rank S, etc. Finished products also have unlockables tied to how many times you create/deliver/use them, but they're not as engaging as the ones for raw materials. Unfortunately, filling the encyclopedia eventually becomes tedious. I made it to the second area which visually looks great, but it also meant new materials to collect and potions to brew. Some of the new materials had collection requirements that were quite tedious compared to the first area. You'll have to collect these new materials over and over again. Collect Item A in X way 10 times, and then 20 times, and then 30 times multiplied by however many new items. So the encyclopedia basically devolved into a grind. \n\nSo overall: your progress will virtually be reset in every new area, there's an inability to reliably earn money outside of your weekly deliveries (and the amount of weekly deliveries available is gated behind grinding), and there are stamina and gold sinks tied to the durability of your cauldron, broom, and the already one-way quick travel gates *and* you have to sometimes choose between efficiency and completing your encyclopedia entries. The stamina system itself is also particularly annoying. Every action actually drains something like -20 Stamina + -10% Max Stamina. So if you gather a few items with 300/300 Stamina, you'll go down to something like 200/250. You can recover your max Stamina, but it requires buying a different type of food, meaning you now need two separate items which means more gold and another item slot just to fully restore yourself. You can forage for free and recover some Stamina, but the foraged berries and fruits restore very little. You can also choose to nap to pass time and recover a little Stamina. Also, good luck if you want to gather at night and accidentally napped for just one hour instead of the maximum of four, because then Ellie will say that she's not tired and you'll have to wait 3 in-game hours. The game also blocks you from napping before 8PM, presumably so you can't just sleep through to your weekly deliveries. All of this combined makes the game player-unfriendly in a way that reminds me of a mobile game. \n\nAside from foraging, potion making is the other major thing you'll be doing. Unfortunately, potion making is quite simple and nearly every mechanic present just feels like a gimmick throw in to slow you down after you spent so much time refining your raw materials. Making a couple of potions in a row for your weekly deliveries is tedium.\n\nWhen you're not upgrading your workshop through Luna Coins (that are earned separately from Gold Coins and used for specific things) or befriending villagers, you can use your Gold Coins (that is earned separately from Luna Coins and used for specific things) to purchase furniture. There's a surprising amount of furniture (and they're cute!) to unlock, but decoration is really just that. Furniture has no impact (not a problem for me personally) other than making your house and workshop look cute. The shop system could use some QoL additions here, since it doesn't tell you what items or furniture you already own, so unless you keep track of that yourself then you'll be wasting gold. \n\nVisually, the game is really cute. I love the pixel art, and especially the second major area. However, the music is often too tranquil to the point of being barely present. I also found the workshop having no music being a little jarring. On the technical side, I experienced no crashes, though loading screens could be a little long and sometimes freeze slightly. The only issue I had was my house suddenly having black wallpaper and tiles until I reapplied my custom wallpaper and tiles to fix it.\n\nTL;DR: this is a slow-paced, dialogue-heavy, whimsical slice-of-life RPG with collectathon and crafting elements, but it suffers from an overly verbose and badly translated script and does nearly everything it can to make you more and more frustrated. There's an enjoyable core here for sure, but the devs need to add a lot more polish.",
      "voted_up": false,
      "votes_helpful": 84
    },
    {
      "review": "I've played the game for a considerable amount of time, and while I find the main game play to be fun, the translated dialog and visuals tend to be a bit lazy. My largest gripe tends to be with the dialog being repetitive and just awkward to read through. While I can typically ignore the usual grammatical error from a company who's main language is not English, it's hard to ignore when the game is heavily text based and revolves around relationships and community. It is hard to feel connected to any of the characters because they are just frustrating to read with this translation. I would much rather just get the quests over and done with then really take the time to get to understand their individual personalities. While I cannot for sure know if this tidbit is true or not, I have heard that this game is *only* machine translated, which would make sense since the awkwardness of the text could be because it is a literal translation without the context of how those sentences would work in the English sentence structure.\r\n\r\nMy issues with the visuals tend to boil down to there being little to no clean up work. The sprites and animations are fun and lovely, however, there are some areas where corners were cut, especially in the localization. Sometimes, translated text will *overflow* the box, making it so there is text bleed above and below where it should be. This of course is very visually distracting and a tad hard to read through. Virgil's text can also do something similar where the font is squashed and squished to fit his text box. While the idea of him having his own box is neat and makes sense so he doesn't take up the main box as he tends to typically only have witty remarks, it is really distracting to see the kerning of the font get changed so often depending on how much he is saying. While I will agree this last part is a bit picky on my end, sometimes the animations are strange in the game, especially when things are moving to different levels of elevation. While we may have a map with visible elevation, such as a hill or slope.  the animations treat it as if it's a flat surface for anything interacting with it. This gives the impression that the character isn't changing elevations but is just in a static area. Sometimes, I've had issues with catching bush bugs because of this elevation trickery as well, but by far, it's not the worst contender in this review, but it's still distracting. \r\n\r\nI really want to be able to recommend this game as I think it's really fun and I like cozy games like this, there are too many issues post launch for me to feel comfortable to praise it. Who knows, maybe these issues will be fixed and I will be able to recommend it in good faith later. I'll be keeping a keen eye on this project until then.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "Very cute, and fun concept, but too many incredibly basic bugs for me to recommend it.\n\nOne example; there's a side quest early on to research the Squishychub. But if you've already researched it before getting the quest? You can NEVER complete the quest. It doesn't auto-complete because the task is done it's just a stuck quest that can never be completed. In alpha or even beta this is fair enough, but unacceptable for a game that's considered fully released.\n\nThis one is smaller but, stairs that go left/right don't animate like stairs, you just go straight across as if it's flat ground. This doesn't break the game or anything, but even the most amateur of indie games manages to get something so basic correctly, and it is very immersion breaking. Another thing that might be fine for early access but unacceptable for a released game.\n\nI don't doubt if I kept playing I'd find more problems, but being confronted with these issues, especially the quest one which just breaks your ability to complete parts of the game, are enough that I cannot recommend buying this.",
      "voted_up": false,
      "votes_helpful": 32
    }
  ]
}