{
  "positive": [
    {
      "review": "I know it wont show on my steam profile but I’ve been playing My Hero Ultra Rumble on my Xbox since it dropped in 2023, and after getting all the way up to the highest rank, I figured I wanna share my thoughts. I’ve watched My Hero Academia since the first season, so I jumped into this game mostly because I love the series but honestly, I ended up staying because the gameplay’s actually really fun once you get into it. When the game first came out, it was kind of a mess. Balance was all over the place, All Might and Todoroki were way too op and matches could feel super random. But over time, the devs have done a good job tightening things up. Most characters feel usable now, Except the new all for one youth age that recently came out since hes very overpowered right now lol. Getting to the top rank was a grind, though. Solo queueing can be rough since teamwork is such a big deal here. But when you get a good squad, it feels amazing. The ranked climb actually rewards skill and coordination, which I didn’t expect at first.\r\n\r\n If you’re a My Hero fan or not, give it a fair shot and stick with it for a bit. Once you get the hang of the quirks and team play, it’s a blast. Not flawless, but definitely one of the better anime games out there.\r\n\r\n8.5/10 ❤️",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Yes i love ts game it makes me smile when blue deku violently assaults me and ruins my day",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "A fun, fast-paced battle royal where you and your teammates duke it out as heroes (or villains) from the anime. The combat leans into flashy “Quirk” abilities, and the team-based gameplay can lead to satisfying coordinated takedowns. The anime aesthetic and character variety give real charm for fans, and being free-to-play lowers the barrier for new players",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Genuinely a really fun battle royale, a little hard to get into, but once the ball is rolling, its one of the most entertaining ones out there",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun. There is no other way to say that, it is very fun,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game should not be as enjoyable as it is- the Gacha system compared to others makes Genshin seem generous. A vast majority of the roster are asset rips from My Hero Ones Justice 2 and I wouldn't be surprised if they take assets from the newest MHA game that'll come out. This game has literally so much wrong with it yet it's genuinely so fun and addicting, I only worry for its future since MHA Manga has already ended & MHA anime is about to end alongside the absolute best characters (imo) peaking with the newest Deku, AFO, All Might & Shigaraki. I'm expecting a huge decline in player account once this season is over UNLESS they start adding movie characters and MHA Vigilante characters, then it might have a longer lifespan, and it'd be even longer if MHA continues to get movies which increases hype, increases playercount & increases the amount of characters that can be in the game. \r\n\r\nI recommend this game right now during this season, but once it ends, I can't forsee MHA Ultra Rumble ever peaking like this again or really being worth your time unless the mentioned favorable scenario happens- which is very much possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm a big fan of MHA although I only got this recently because of a friend! The game is very addicting BUT a few characters are very overpowered. For example All For One (Youth) and Armoured All Might! It's hard to escape them due to their kit. Like All Might just pulls you in with this move that you literally can't get out of and it does a lot of damage. With All For One it's different, you can escape them but before the attack happens, although All For One's attacks cover a lot of land.\n\nAnyway, I find the gacha alright (I play a few gacha games so I'm used to gachas) although I wish it had a pity system (I don't know if it does, I'm still new!), if it does have a pity system, I think it could be better.\n\nI love everything else even though playing matches can be frustrating at times. \n\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun if you are in to MHA. Pity is too high even for a gacha game (I play a lot of gacha). Character releases are spread out and rewards are fine. Co-op is good but the map/gameplay options are quite limited.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has a Cheater problem but outside of that I think it's a really great game. It doesn't try to squeeze you for money and is super F2P friendly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Before I played the game I read the reviews for like every game. Thats what I did for this game and I saw many people disliked the game. I for myself love MHA. Alyways haved and I've always noticed this game but never really wanted to give it a try until today. So I did, it was hella good. Yes some charaters are over powered. Maybe most I'd say. But im still new to the game and dont really know how to play most charaters which is fine by me, I love learning new games its one of my favariot thing to do. and yes I know im miss spelling, but as I was saying it's a great game a lot do players just need to get better like I do. I suck at the game but im still able to get kills.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good but they need to nerf alot of characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish I had gotten into this game whenever it came out, or at least sooner than this. The gameplay is fun and the loop isn't bad. The only problem is having to learn characters and mechanics, but I feel that the vast majority of people didn't know anything about T.U.N.I.N.G. As long as you aren't too worried about losing, the loop is actually pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best battle royale game other than fortnite, IF you are a my hero academia fan. Its not really beginner friendly due to it having crossplay but once you play more and get the new characters you should be able to dominate lobbys with your teammates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "na to ze ta hra je vonku 2 roky a fanbase a celkovo komunita hracov sa zmensila, aj tak tato hra dostava prijemne updaty ako aj je stale gameplayovo zabavna. Samozrejme hlavne minus je gacha ale mne osobne to nevadi.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first, the game is a little boring, and super repetitive. But once you play for a little bit, it gets better and easier. I have OFA Izuku after a few hours of playing, and it got alot easier. Pretty fun, and kind of addictive. This game isn't most people's jam, but if you play for a little, you'll warm up to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a really fun and cool games it has really good graphics and this  very close to the anime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fucking fun, just expect character unlocks to go sloooooooow with the gatcha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is peak but the gacha system is sucks balls, i mean just let me buy the character instead rather than spending 300$ just for a character",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game overall Just fix the Skill-Based matchmaking and balance the characters too. But i like it and would recommend it to others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun but can be challenging but the player base is all leaches",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I tell you cementoss is BUNS in this game I mean it. Hard target all of them and they fold to my PLUS ULTRA power. I'd even 5 bar them in deepwoken should they speak up to the king. Also, name your account (character)fan24 to guarantee a roll of the character you want 👍\n\nW game though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had about 30 hours almost on this game and I can say its definitely the most fun I've had in a while, don't have to spend any money you don't want to and overall just a great game to have fun on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely addicting and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game used to be a mess, the matchmaking took hours It was unbalanced and extremely ridden with cheaters.\nBut honestly in the latest months or so It has been fantastic, they started balancing characters left and right, the anti cheat apparently works better (havent met cheaters in a while), and most importantly the matchmaking Is human now (takes About 1 Min) to find a match.\nDo yourself a favor and try this game with 2 Friends, you will have a blast regardless if you are a MHA fan or not.\n\nPlus Ultra!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ironically the only battle royale game to ever get me hooked on it like this oh it's bad this game is amazing my one complaint though gotta be how much better some characters are than others like rapid deku literally has auto lock on that does 150 free damage to you that's pretty much inescapable :sob:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok to cut to the chase, this games balancing sucks and if you want to unlock anything it will take you years or you would have to spend all your money to gamble. Those two things are just about the only huge complaints I could have as the gameplay is amazing and the art style works super well. The only other nit pick i could think of is I would like to see more character interactions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun if you're not looking to spend ant money on steam or cash grabs check this game out for sure most fine I have had in a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The diversity of game play styles and the balance between them are great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I mostly play on PS (note the low hours here) this game is an absolute blast. Hate to pull the old Arkham line, but you really feel like the characters you play as. This is essentially a quirk emulator wrapped in a battle royale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ever hate yourself enough? Look no further than this game here you have a bit of ALL the worst communities:\nShooter sweats\nBattle royale sweats\nAnime fans\ngambling addicts \n\nAll in the same game telling you to unistall regardless if you play ranked or unranked\nThe game is fine just an unbalanced mess but I guess is part of the charm depending on who bully you or you're bullying\nBest saving grace is the fact that the currency for the gacha is VERY humble",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started this game around its release date and I had a ton of fun with it. Characters were balanced with basic movesets and it never really felt cluttered. Then i took a hiatus all the way to May of this year. Ever since i came back honestly the game has been a ton of fun (with friends) but i do have to say at times i have some critiques. For one, theres rapid OFA deku which isnt a fun character to face at all. An infinite combo that needs PU or a teamate to save you from, AFO who honestly i actually like but he makes the game extremely hard to manage when hes shooting nukes at u in final circle.\r\n\r\nAll in all it is fun with friends but has many issues and bugs that sometimes just makes me dislike the game.\r\n\r\nPS: Fix hackers/Random game shutdowns",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ive ever played on steam, it tugs your heart strings no cap bro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game but full of cheaters in the higher ranks, such as unlimited plus ultra spam, unlimited invisibility, and 1-shot damage. The whole UI disappears while in game (you can't see your teammates or map or use specific items that you want from your inventory). The UI bug often appears when a teammate’s player name contains special characters (for example, non-Latin script or invisible characters).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun for those who like games like marvel rivals and fornite and if you like My Hero Acedaimia The Manga Or Anime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first i thought this game was going to be mid but no this game is really good it has good qualty garpics and has great cummmnty i reccommend it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "amazing game and the gacha can be annoying but its so fun to get the character",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good fun game with bad balance. i wish they would move away from the gacha thing- maybe make gacha for skins only?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy this game, I just don't like how hard it is to get characters you want.\r\nthe game is super grindy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gacha mechanics in PvP game is never a good sign.\r\n\r\nHowever, the game does provide enough characters for you to unlock and try. I'm not a fan of the anime so finding a character that fits my playstyle was easy for me.\r\n\r\nYes there will be OP characters. Yes your favorite character is most likely behind a gambling paywall. Yes, it will hurt your experience of playing this game. Yes it's completely fine to not play this game because of these conditions.\r\n\r\nHowever, speaking in terms of pure gameplay, you can get away with enough skill and understanding of a character. As someone who played this game as a game, it's not TOO bad.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you love mha and want to play a pretty good but not balanced game, welcome!\r\nif you are here to goon to the girls or complain about other people, please exit stage left.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Top 5 Game on Steam\r\n\r\nAfter Expedition 33, Elden Ring, Factorio and Overwatch 2",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its better now in 2025 then in season 5 its still a gacha so only play if you find enjoyment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Literally my favourite, but the Deku's and Urarakas and Mirio's are so strong but they must just be playing for a long time 🙏😭",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's completely free, it's easy to play. If you have 2 friends it's even better. The graphics are good, the game play is WAY better than I expected for a free game like this, there's actual voice acting from the actors (or at the very least very good impersonators). It's definitely a gatcha game but unranked matches are completely unlimited so you don't really need to worry about an energy system. If you're not good at the game or on a lose streak the games don't take very long and you can leave once your team is out without penalty. Honestly this game couldn't be much better except having a bit more variety in maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you know the game is not dead despite it's shitty self when they still haven't pulled their master card, the one and only Mirko",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i cant complain, i paid no money and got armored all might lmao but pretty fun if you only care about fighting, dont get mad just run another youll be alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a pretty good BR but please just let us use golden tickets at any level plase man",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i recommened playing this game if youre a fan of MHA or a fan of a skill based battle royal with easy enough mechanics for a new player to learn but advanced enough for vertirans to have a challange",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and funny using deku and puching and kicking people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 wouldnt play it without friends, game is great. duh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "itss fun just wished it still worked on steam deck that was easier then the laptop for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AllMightFan24 here, I managed to get both Armoured All Might and The alternate endeavour play style in only 14 roles, also cementoss is a bum",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is well-balanced and dis-like when you cant counter melee/ parry!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HYDROGEN BOMB VS COUGHING BABY WHO WOULD WIN??\n\nNEITHER THEY'RE ON THE SAME TEAM NOW IN THIS GAME AND PLOT ARMOUR DEKU (the blue one) WILL SOLO THE ENTIRE LOBBY",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very cool game for mha lovers.  nice maps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the only bad thing is it is two exspensive to buy the charicters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a great hame and it is really nice to play my fav chareter in mha",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun when you're not getting assaulted from every angle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is peak it good pls add awaken bakugo or awaken shigaraki",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too much PLUS ULTRA (game's quite difficult even in low rank XD)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you dont run meta your gonna get butt raped so bad you will try to get away but you will have someone ride your ass from half the map away. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun my hero academia game. i'd say if you watch the anime my hero academia you should play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An overall challenging game, the higher you progress. I would recommend that players who already have experience in shooter games play this, as it is not a very friendly game to beginners. Personally love it-\r\n;)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "for any MHA fan, I would tottaly recomend, though it deffinitlly takes a lot of play time to get some of your favriote charecters its worth every minute!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good, very noob friendly and genuinely enjoyable with friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game really enjoy the combat only complaint is the  gambling system is  bad  but overall fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is low-key fire. The only thing is its kinda chaotic and the rates are bad. But it is kind of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although the finishing animations are not the greatest to look at. And some of the models just are flat out not good. The game is pretty fun but by far the most insufferable part of the game is rolling for characters. But it goes two ways. On one hand it keeps the player grinding for a while and makes it so every single meta and new character isnt unusable on launch. But on the other hand it feels cheap sometimes. But character vouchers make it bearable. The new player expeirence is not that bad cause you get a bunch of free stuff to unlock at least 2 characters you'd wanna play. Overall not bad, better than fortnite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is sooo fucking fun bro even when I lose I really don't even get mad as long as my placement is good, This game is especially fun with friends that actually know how to play. I hope this game stays alive and gets more popular and more updates. I really hope this game doesn't shut down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good game the only problem with me not that much people with mics but over all it's really good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an extremely fun game. First off you don't need to watch or read My Hero Academia to understand or play the game (for the most part) as most abilities are self-explanatory or you can easily read what they do, althought I would imagine you'd have a lot more fun if you did.\r\nStarting out without a big event is most likely a pretty bad experience because to get characters you need to roll on a gacha and the pull currency that the battle pass + events/missions give out is just enough to be considered \"fine\". I'll also state that the pity system in this game sucks complete ass, you'll either HAVE to save up for a banner or get lucky if you really want a character/costume. Also while there may be some p2w aspects you can technically play the game against paying players and win, although you will have a tougher time depending on some circumstances.\r\n\r\nGameplay wise the game is amazing, so many characters with different playstyles and unique abilities since it's tied to an already existing anime IP. The game is also pretty buggy and clunky although most of the bugs are pretty minor. Balancing is a huge issue tho, new characters are usually extremely strong on release and the devs tend to let a lot of characters go under the radar but nothing so big that the game is unwinnable. Some bugs can also either enhance or ruin a character's combo which can leave make you happy or mad depending on who you pick as your main.\r\n\r\nThere are still some smaller annoyances but the game is definitely worth giving a shot, especially since it's somewhat f2p friendly (kinda, sorta, don't quote me on that).\r\nUnderneath the layers of corporate greed and a bit of leaving the game as a side project exists the only battle royal that I can say I had fun playing, the community of this game is pretty friendly and deserves to be treated with more respect by the devs.\r\nThank you for reading.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun with every match being quite unique. My only complaint is the gatcha system is so overpriced, so you really have to grind the game to get any new character unlocks. Also all skillsets are only unlocked via rolls (gatcha system).. so it makes it really frustrating for new players.\n\nOverall though I love this game, but it does not have any real player-base.. so even with crossplay on I typically run into the same people especially at higher ranked lobbies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s a good game but I’m not the biggest fan of the rolls but I like the exchange method",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it takes a lot skill and time but overall fun to play rolls are unfair but just gotta keep playing to get more tickets",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "el juego es bueno pero los pperosnajes estan mal balanceados y hay muchos bugs, pero no es mal juego",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is peak idc what anyone says. Want brainless enjoyment with easy to learn characters pick this game up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a lot of fun, and you can play it for a long time!! I like that there's always room for improvement or new goals to pursue!! Def recommend for bored people!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ">fun gameplay\n>garbage gacha system\n>booty\n>I hope they add Mina or Miruko",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "MY HERO ULTRA RUMBLE is a free-to-play 24-player battle royale where you drop in as My Hero Academia characters and immediately remember that **friendship is powerful, but being 3v1’d is more powerful.**\n\nYou pick a hero or villain, form a 3-man squad, and then:\n\n* Land,\n* Loot,\n* Get one-combo’d by Bakugo from across the map while All Might body-slams you from orbit.\n\n---\n\n### Pros:\n\n* Actually fun team roles:\n\n  * **Strike** – punches first, thinks never\n  * **Assault** – ranged spam merchant\n  * **Rapid** – movement gremlin\n  * **Technical** – “I swear I’m helping” support\n  * **Support** – heals, revives, gets blamed anyway\n* Abilities feel ripped straight out of the anime, including:\n\n  * “Delete building”\n  * “Stunlock that guy forever”\n  * “Miss everything and pretend it was zoning”\n* You can revive teammates by **hugging their trading card**, which is both adorable and deeply cursed.\n* Voice lines and ult animations go unnecessarily hard for a game where half the lobby is looting dumpsters.\n\n---\n\n### Cons:\n\n* Solo queue experience:\n\n  * Teammate 1 lands 300m away\n  * Teammate 2 pushes 3 squads alone\n  * You’re in the middle with 2 Common cards and a dream\n* You will die in 0.4 seconds to a combo you absolutely could not see under all the particle effects.\n* Ranked is just casual, but everyone’s angrier and somehow only picks DPS.\n* Map sometimes feels less like a city and more like a collection of places to get jumped from above.\n\n---\n\n### Peak ULTRA RUMBLE Moments:\n\n* Dropping in with drip, immediately slipping on gravel and getting Detroit Smashed into the stratosphere.\n* Watching two squads brawl it out, waiting like a vulture, then third-partying all 6 of them and pretending it was “good rotations.”\n* Being the only Support on the team, healing everyone, and then getting abandoned the moment you get downed.\n* Hitting your ultimate, whiffing it completely, still getting a double kill from collateral damage and acting like it was 100% calculated.\n\n---\n\n9/10\nIt’s chaotic anime dodgeball with superpowers and trust issues.\nWould yell “PLUS ULTRA” while getting deleted by a level 2 Deku with better timing again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE MHA, and for a mha fan this game is awesome!!!!  i love the combat and how you are able to play as your favorite characters!!! especially toga and tomura :3 it's really fun and i am always excited to play!!! though, i will say i really don't like the gacha and the roll's system. it feels rigged and it's hard to get characters or battle styles that you want. For example, I really wanted Assault Shigaraki when he came out, but I never got him even after spending a lot of money to try and roll him. So that kind of annoys me, but besides that this game is amazing!!!! Actually, another thing I dislike is that I find myself getting teamed up with bots and playing with bots most of the time, but when a major update like a new season starting happens there's real players again. I think that's normal with certain games, so it's not that big of an issue. I really wish I had someone to play this game with, I recommend it totally!!!!!! :33",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kacchan, watch me go gear 5 and spam melee all over these street tiers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game for anime lovers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright but once you get suck in its a prison of no escape",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best game ive ever laid my eyes and fingers on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i left it on over night by actcident thats why i have 24 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 loved kissing bakugo while playing with deku",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and entertaining game for a free game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like fighting and anime this game is for you\r\nkinda hard at first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the best anime game ever  happy happy happy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played a little bit of it. Its alright.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game tuff skibidi toilet mango 6-7 around here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i liked how this game is fun i dislike have little upds there are",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The new izoku is shit, bug and overpowered",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun, but at the same time annoying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i got this game fpr free\r\n\r\nbecause ot is fre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun but the gacha sucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, screen white after uraraka",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it makes me scream bc the stupid dekus but love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AMAZING MHA game i cant stop playing since i got it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "underrated battle royal",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "One of the worst game I've played in my WHOLE life. The gameplay is good and all but the problem comes to the matchmaking and the harshness of the matches when your'e new. I couldn't enjoy the game or the mechanics of the characters because I only lasted 38 SECONDS IN THE MATCH.\n\nThe gacha mechanic isn't even good. Spend 100 tickets with a percentage of earning them from 10 to 10 IS WILD. Then, you'll have the opportunity to win A SUIT!! NOT EVEN A CHARACTER THAT IS LOCKED FOR YOU TO PLAY ONLY WITH A FEW CHARS!!!\n\nI love the series and it's one of my favourites but this game just makes me want to hate it LIKE I WAS NOT SUPPOSED TO!!!\n\nWorst battle royale game I've played and the worst anime game I've played (yes, even worse than JJK). If you like the series (and hate Bakugo like me) DO NOT PLAY THIS GAME",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Balancing is terrible and character tickets don`t unlock anyone good, on top of this, older characters keep the same properties in their movesets making them unplayable, you could tweak yellow kiri alpha and make it usable, too many hackers too...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Terrible game absolutely awful just hate it so much yet keep playing it... Buggy ass mess with so many game breaking bugs, gacha system is straight ass unbalanced piece of slop for characters. Rapid Izuku wants to make me die whenever I fight him. Mhur devs are literal toddlers unable to see their mess they have made and fix it. More updates making the game worse. Will still play it though bc its addicting...",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game is so unbalanced and that’ll never change, this game is one of the worst beginner friendly games I’ve ever seen, there is no efficient way for a beginner to truly learn how to play the game and the game overall is pay to win as fuck, clearly it was very unfinished on released and that is one of the many reasons this game isn’t as great as it could’ve been",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most toxic game i´ve ever know...community is just a joke...you get tbagged for no reason, \nThe devs need so many seasons to fix a bug and than they add  a broken ass character whos dmg is just not fair....They are greedy af because for 3 emotes and 10k or less crystals they want 50€ just for this T.T \nits not newbie friendly because if you start and play with a higher rank friend you get sweaty lobbys and its just not fun for the newbies....\n\nthe good side on this game is....some people are really chill and lovely and i found really kind people from this game <33 there are also some funny moments but also dumb moments\n\nthey dont really change the lobby like it used to be....season 1-4 lobby was so pretty but than they changed it into a cage and only add small things and never a new lobby....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is 100% pay to win... unless you spend thousands of dollars you're not going to be able to stand against people with maxed tuning, which only comes from playing since beta non-stop or spending thousands of dollars, but shocker! it matters. Whenever I check post death reports its people with maxed out tuning. Can't even build stuff you roll because to place stuff into the costumes you had to have rolled it as well, so you're perma f'd in this game if you aren't spending THOUSANDS. I mean this literally... I spent $75 and got nothing but a few voice lines on characters I didn't own...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you have a gambling addiction, this game is terrible for your mental health. I don’t play for fun, I play to feed my gambling habit and destroy my sanity every time I open a plus ultra chest and get an ugly 3-star costume instead of a character. Please, Biking, do something about your monetization system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most unbalanced game I have ever played. Each character has a cheese method that makes this game psychically impossible to enjoy, no matter how hard I try. Each new character is overpowered, and never gets nerfed. Armored Allmight alone can do a driveby on you and take at least 3/4 of your health while doing it. There's not even the chance to fight back, you just have to accept your fate. This game is only fun *sometimes*. The worst part by far is the fact that it takes 20 hours at least to even give you a character good enough to compete in the average game. This game is a awful disaster that could've been fixed with more attention from the developers. A single patch nerfing some of the more unfair characters would make this game super duper fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WTF i want to play this game again but it's always said the server is time out, can i even play this game again in my county????? btw I'm from indonesia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Abysmal dogshit game. The core combat could be fun and is somewhat fun when you encounter someone who isn't playing with broken, p2w characters. But this game is almost exclusively played by whales that spend $100s on new meta characters. The game has the most greedy, stingy gacha system on the market, Also, the ugliest UI of any fully released game I've ever seen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun and a nice grind however I do not recommend playing until they have cross progression. I understand console ranks not crossing over, but not letting me use the characters I’ve unlocked on PlayStation and grinded for is such a dumb move. I hate how games allow cross play but no cross progression. This and marvel rivals just want more money and don’t actually care about their players. It’s a sad day when Fortnite is able to do something you can’t.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games fun but i lost intrest when i realised how greedy the gacha roll system is if it's ever fixed ill come back but it's not worth playing when you can only get MAAAAAYBE 1 hero you want greedy trash devs have ruined a really fun game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "incredibly mid game, most good characters are p2w for 3 weeks and by the time you can get em or if you already had em anyway all of a sudden they're fucking useless now so enjoy em while you can until next season's bullshit. and dont bother playing support unless you're on a squad with 2 friends because randoms WILL consistently leave you to fucking die.\r\n\r\n\r\noverall: 4/10 game, just save yourself the headache",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the matchmaking sucks, and the gacha aspect of the game makes it practically unplayable. it feels like to get any good character, you need to either grind for ages to get roll tickets or you need to spend money to buy them. would not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A shitty pay-to-win game, made by fuckin asian developers who don’t even know what it means to earn their own bread, because they even put their mom’s ass into a gacha just to squeeze a few cents out of the idiots who keep feeding this character-unlock system.\nAll of you should get lost. Damn Endeavor looks possessed; he won’t stop flying, and it feels like I accidentally joined a Dragon Ball game because every bastard is flying around like a deranged pigeon.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ass game that has a horrid gotcha system. Need 2,000+ tickets to get a guaranteed character. A whole season only gives you 1,000 and you have to do every single mission and get to the highest rank to get all those tickets.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is lowkey buns if the rates weren't so ass and you grind for a eternity for rerolls just to get either nothing or a shit costume and emote please fix the rates this game is buns as FUCK (love the inf combos too)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Makes hard to get our fav char and you will see your game sinking.\n\nBiomedical, reaseachr, professor, physicist advice.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Every season they release a game breaking character and then take 2-3 seasons to nerf/fix them, that is if they ever fix them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state, this game is very repetitive, lacks characters, and the gacha system kind of sucks. Also, the gameplay is very boring. I wouldn't recommend it even if you're a fan of my hero, as it does just the bare minimum.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i'm going to be completely honest. I recently started playing this game again with friends. Won some, lost most. The game CAN be sweaty. No ones lying about sweatiness, balancing, or the horrible gacha system. I am writing this review as a warning... PLEASE DO NOT SPEND MONEY ON THIS GAME! I keep finding myself wanting to, do NOT! Everytime I want to and run the calculations for how much something would cost, I just find it isn't worth it. This is without a doubt the worse, gacha system in existence. They add a bunch of fluff in every pull you worked hard for so you never get what you want. And thats only a quarter of the problem. The prices for small things are absolutely absurd for a game like this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Balancing, Cannot find teammates that actually play with the team, report system sucks, to unlock any good character it depends all on luck, DO NOT get this game, not until they actually balance the hell out of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lowkey fun game, but once you get the char you want and max em out there's not really anything else to work towards. Played F2P for 2 days, ended up with young afo, his 3 star skin, and a fully tuned loadout just by doing quests. Pretty much everyone I know was able to get whatever they were going for within a day or so, gameplay gets boring quick though and aim assist is so aggressive it may as well be aimbot. Balancing is equally questionable as often at full hp / gp you'll get insta-downed by a team pulling up and using AOE abilities or IFrames. Most notable of which is Kendo (major issue). And the game doesn't really have a way to prevent people keeping you alive when it's 3 on 1 final circle for toxicity or wtv which can drag out the game (since if you leave, you don't get your rewards). Overall, fire concept, mid gacha game in practice.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am not that far in but so far i have found that the balancing sucks, and with the gotcha aspect it makes the game slightly pay to win as you can just buy a bunch of rolls for the better characters. I think it was really good idea, just a very bad execution",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Might be the worst BR game available. 2/3 of the roster is just the first 1/3 copied and pasted then altered ever so slightly, there is a gotcha system that allows for pay to win by pulling special abilities and/or characters, the gameplay itself has not changed at all since the beta/release of the game (clunky, slow and overall just feels bad to play). This game is just another cash grab from a dev that only makes shitty cash grab gotcha games.... Could have had a real game but no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game was so bad holy balls man charlie's favorite character is like 15 year old in high school lmao what a f'ing freak",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash spammy game is unhealthy....but fun only thing is play with teamates and tell your teamtes to stay together",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DON'T PLAY THIS GAME! \nThis game have no balance. \nNerf Deku rapid. Y have character like that It don't want skill play in this game anymore.\nY Who play Deku have fun with this game?\nSo I wish who play that character have fun in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is horrible, I only play it Because my MHA Obsessed Cornball Younger Brat(Brother) Likes to play it and call People the N Word",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game doesnt even load up, \"download data damage or lack of space\" all files were verified twice and made no change and had 300gb or space",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too long of a tutorial with too much information, controller sensitivity was way too high, and one of the mechanics just disables you from using part of your ability until you either wait, or use it. Would not reccommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is pure dogshit only bots and its just hot ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst game I've played in my WHOLE life. \nThe gameplay is good and all but the problem comes to the matchmaking and the harshness of the matches when you're new. Can't enjoy the game or the mechanics of the characters because you get melted by people lv 100+ in game\n\nDon't Listen to the Postive Reviews ~ Save your sanity from thinking about playing it.. Cause you won't enjoy it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has pretty good combat but the skill-based matchmaking is god-awful. i mean im like 40,000 in the world and i often get in games with #700. actually stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so poorly balanced, every match its a Mirhio and Deku on two entirely different teams that decide to team up against 1 player and chase you across the map to kill you. You play All Might with a grab move and nearly everyone magically escapes it when they already get grabbed even though they dont use plus ultra. How do you not nerf over powered characters and keep sucky characters so weak. Not to mention teammates who start fights only to run off and get you killed because of their actions and then proceed to abandon your revive card. If they decide to fix this game then I'd day otherwise\nPlay a match and watch the entire lobby die to a hacker me included\nPlay a match do over 500 damage to a person they dont die no matter what I do, I jump in the air once as All might and get instantly hit with pinpoint accuracy as if I was Jfk getting assasinated\nPlay a match As One For All Deku and use a move that teleports you behind your enemy hitting them and the game decides I die as I hit my enemy, But whenever I fight a Deku with the same move I get nuked and have zero chance to fight.\nYou chase someone down to kill them only for them to magically disappear and come back fully heal, but whenever I hide to heal up with zero players around all of a sudden everyone knows that Im exactly in one spot across the map like they're CIA agents like wtf is this crap\nThese devs are so lazy to balance this crap.\nHere's Endeavor who is shown to be versatile and mobile but oh no 2 inputs of his special action and he is a sitting duck where as Hawks flies forever, Oh look a character who has nothing to do with flight Deku, Kirishima Shigaraki and how many more all of a sudden fly towards you to end up nuking you by spamming one move but Endeavor's free style has no damage to compete\nBy all means lets make a roll system that gives you voice lines dupes 10 times in a row before getting a character\nBy all means make abilities that lock onto enemies but get you stuck on a random object that ends up getting you killed because Oh you use a grab move or kick move on a stupid frog yeahhh you missed and they just slap you once killing you... smart game\nLike Ive never seen such a shit game here you go get respawned just for a random player to animation cancel to spam one fucking move and then you cant even use the dodge mechanic because oh you rolled nahh you got hit on a pinky toe hitbox and die of cancer\nBut to top it all off these Developers could care less to actually read the reviews and fix this game, at this point let this dogwater of a game die",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Colossal dog shit, think u pulled the banner character? Nah that's just one of their 3 million costumes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont play if you want a balanced game with a fair character earning system. Pay to win, characters too broken. I play anyways",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game I dont like the graphics and the play style is so boring, would not reccomend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game's pitty system is ridiculous. I spent over $300 for roll tickets and didn't even get the character. This game is nothing but a scam and the roll percentages are made up numbers. Rolling for a character with 80 percent drop rate but consistently pulling the same costumes that have a 10 percent drop rate is makes zero sense. This game should be looked into for fraud.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ITS ADDICTING AND UNBALANCED. NO CHARACTER IS BALANCE AND THE META IS ALMOST ALWAYS GACHA/PAYWALLED. IF U DO PLAY MAIN RAPID URARAKA UNTIL U GET TECH TOGA FROM PASS. IF YOUO PLAY YOU WILL GET ADDICTED.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Esta hecho solo para que fanboy de la saga lo jueguen. No trae nada inovador, plagado de bug y desbalance extremo de personaje.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "could be a decent game if there wasn't a built in aim bot for controllers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do not play a character would cost over 300$s hawlks is busted, all ver's of All might and Deku are busted no ballance once so ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is horrendous pay to win garbage not a single soul should ever touch this TRASH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "did reccomend now don't. it lets you get hooked then turns up the matchmaking algorithm to where you just get destroyed over and over and so its no longer fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Balancing is very bad, tf is my regular ass shigaraki supposed to do against a Hawks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can we please have an update. So we can get old skins. Ty\n\nAlso can we please add some QOL updates instead. Things like searching a specific player\n\nCan we have a better design team so we can have good color scheme",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't tell me to play a different character. I only want to play Froppy.\nThe menus are so annoying and bright. Rarely my eyes get hurt looking at colors, but All Mighty. There are less colors in a pride parade. There is too much on screen, I can hardly keep up with trying to pick up items and track where eneimes are flying all around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you have luck to get character from gacha. BUT if you have no luck to get character who you want you need some money you can purchase motorcycle to confirm ONE character\nfor me i got lucky deku (ofa) but after that (=)_(=)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible game with the worst gacha rates of all time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fortnite if you kicked the timeline a few times and it was worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "izuku mydorya ofa is over powered anYONE AND I MEAN ANYONE WHO PLAYS HIM HAS NO SKILL IT IS JUS SHOOT ONE SHOT sooooooo over powered",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i dont rec this UNLESS YOU ARE A DIE HARD MHA FAN\r\n\r\nPROS \r\nGOOD CONSEPT\r\nTHE ONLY ALIVE MHA GAME TILL MHAJ\r\nFUN TO TROLL AND FUCK AROUND W YOUR FRIENDS ON\r\n THE TUNNING SYSTM (good and bad)\r\n\r\nCONS \r\nMOST PAY TO WIN SHIT I HAVE SEEN IN A MIN\r\nDOGSHIT GACHA EVEN FOR GACHA STANDERS\r\nDOGSHIT BALNCEING TO THE POINT ITS FUNNY ASL\r\n THE TUNNING SYSTM (good and bad)\r\nLACK OF MODES if this matters to you\r\nLACK OF MAPS there only 3 at this moment with the next one soon?\r\nALMOST NO VILLAINS if this bothers you \r\nALMOST NO CHAR TO START WITH \r\nAND THE DEVS BARLY LISTEN\r\nin other words the game is decent held back by its devs gacha and lack of mods and maps the tunning stym is good in my op but its held back by a insane amount bc you have to get the chars so all and all id give it a 4/10 i still somewhat enjoy it for now tho if they were to fix the gacha and make the game over all more balenced and tune back on the greed a lil when it comes to the gacha sytm the game would be a soild 7.5/10 do i think that would ever happen\r\n\r\n\r\nno.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game you're better off playing fortnite",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TO SWEATY EVEN DOING SURVEY DONT FUCKING MATTER AND ALL THESE ROLL TICKETS SUCK ASS HAVE THE TIME YOU GET VOICES OR THE SAME EMOTES AND COSTUMES IVE ONLY GOTTEN ONLY A FEW CHARACTERS BEHIND THE PAY WALL BUT THIS GAME SUCKS OVERALL DONT RECCOMEND TO ANY NEWCOMER OF THE GAME I HOPE THIS GAME FALLS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nerf Blue Deku and Yellow All Might damage and the game will be fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the worst game ive ever played in my life. My friend said it too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game combat is bad you can't even air recover with dash or anything you get hit and fly far then fall on ground then i frames to get up.This style makes every encounter feel same no mater what moves you are doing unfortunately.Alot of games have combat heavily focused in them and lack good fundamentals for it to be fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolute garbage, you must hate your self to play this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is basically pay to win cuz no one wants to grind a shitty game with unbalanaced characters all for one is basically the best character too buy and win with so hard to get tokens with all the virgin ahh mfks that play this shi barely can level up shi is jus not fun bandai makes the shittiest anime games fr they put no effort into this shi its ahh, edit just deleted this game gives u no rewards all the free characters are ahh compared to all the mfks that dick rode this shi ahh game i cant get no tickets to get good chars and im not gon spend money on a game thats so shit i have no fun playing crazy how bandai takes anime title games and just makes it the shittiest they can no love for the gameplay its ahh and its crazy how 15 year old kids can make games on roblox that shit on this game with no effort at all just dont play this shit they need to use that billion dollar studio too make sum thats decent their studio is only good as a producer for money any game they get control of becomes shit just drop xenoverse 3 every other anime game they make is shit! even xenoverse is shit but i can tolerate its shitness.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has terrible matchmaking, i just started and i get ganked on solo and fight people who know exactly how my character works making it unplayable for anyone who just starts with out any prior playing of this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont play all deku players are homosexual don think about installing evr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible balance and powercreep behind newly released gacha characters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game bluescreened my pc multiple times lmao",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun unless you are a casual / new player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I keep crashing and keep getting \"unexpected connection\" again and again and it keep annoying me!. FIX YOUR GAME RIGHT NOW!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad game, many hackers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Addicting, in a bad way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most unbalanced game i've ever played in my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NEVER SEEN A P2W BR BEFORE, AVOID IT AT ALL COST",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Reward system so ass dont play this shitty ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckin plus ultra dude or something like that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Long story short. The game is NOT good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Holy unbalance, this game is ass.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cheap slop that i keep coming back for more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i love this game just fix gacha system bummy ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WORST GAME IVE EVER APLYED DONT PLAY IT NOT JOKING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "love when i get single diget fps when i can run AAA games 160 fine 10/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad optimization",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wallah this game ain't it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play, adicting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its very Pay-To-Win.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Puta mierda",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this gME IS UDERFUCKING SHOOEADS SHITTE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ts so bad :broken heart:",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME SUCKS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "everyone can fly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so greedy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unbalanced.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "knockoff fortnite",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unbalanced mess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p2w utter garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Plus Ultra!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DekusDirtySock",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "remove young afo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Hack",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}