{
  "positive": [
    {
      "review": "Love this game. The different divisions and gameplay styles are great. Pretty well balanced. Lots of fun running 2v2s. Biggest complaint is the lack of players. PLS MARKET THE GAME",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "I'm only 5 hours in so far, but i'm loving the game. Feels like playing an RTS version of Arma 3. Im a big fan of large scale RTS games from Total war to Starcraft and this game scratches the modern combat itch that I didn't even know I had. \r\nIt's easy to say it's not bringing anything new to the table, that you can get the same type of gameplay from any of the Command & Conquer games, even the earlier games made by this same developer, but this game has something that none of the others have had so far; Atmosphere. You put your 'good' gaming headphones on, crank the volume to 50%, and you're instantly immersed in the sounds, sights, and anxiety of modern warfare. Sometimes i'll play a skirmish with AI on my team just to zoom in and follow individual units as they fight across the battlefields. It makes me feel like a kid again, playing with my little plastic army men. Can't put a price on nostalgia and atmosphere..\r\n10/10 buy it.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "IMO the best non-base building RTS there is,especially for the era its set in",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "i love this game honestly, but if there was one thing id like to sea for the nato is a MARINE CORPS UNIT. and A campaign for it. then id buy this for my friends that were in the marines with me.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This game is incredible fun every time that I play. The only real gripe that I have is that the line of sight tool isn't the default view for when we select units in order to move them,. I feel that no matter what, in this game, LoS is the single most fundamental, valuable, and game changing tool available to players. Besides that, and how quickly TOW units ruins everything(???), I would like to see more maps, and hopefully at least one division available to every country in Europe.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Words ALMOST fail me to describe how GOOD of a strategy title this is.\n\nI own WarGame RedDragon for comparison.  It is an OK game, I bought it because of how well it does SOME things.  Glad to own it.  Yet this title here, it is INSANE how superior over that one this is.  This is like taking chess AND MULTIPLYING THE FUN/JOY factor by about 1000x!\n\nI will update this review as time goes along.  Yet IMO just buy the base game AND THEN maybe the NEMISIS #3 pack as well ON SALE.  This should give you YOUR BEST experience for your BEST price.  There is a seaon pass which is expensive that includes just about everything else you may be missing.  There are GBs UPON GBs of FREE FAN MADE MOD content, like honestly, some of the BEST I have ever seen for ANY vanilla game!\n\nIn addition this is PvP, PvE, and SOLO, all done to perfection from what I can tell so far!\nJust get it, I was on the fence about Amored Brigade 2 or this for a little, super glad I made the right decision as they were both the same price, and the amount of content this game has IS BEAUTIFULLY INSANE!\n\nIf you enjoy MASTERFUL strategy releases = THIS IS A MUST OWN!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Got it on sale. Installed it. Played the tutorials. Here I am four hours later. I think. This game is FUN. This game is PRETTY. I like to follow behind the various planes, trains, and automobiles and watch them rain down annihilation on my unsuspecting foes. The tutorials, I think, are also worth mentioning. They are quite good and take you through all the various nuances and mechanics of play. There are multiple game modes (many of which are multiplayer, of course), and the game runs well. I tanked the settings as low as they'd go and then cranked them as high as they'd go....and the game is always pretty. If you are on the borderline with specs, it will still be pretty even if you have to turn off all the bells and whistles. If you ARE able to crank it up, though, it's basically like watching a Cold War documentary, as historical accuracy is also a thing in this gem. \n\nSo yea, basically, in short: I got it on sale, but it's worth it at full price. I can tell this is one of those games you can sink hundreds of hours in and always go back for more. To whit: It has mod support, including Steam Workshop integration. And as you all know, a game with a lively mod community = countless hours of blissful gaming. \n\nIt has some quirks, but nothing that would cause me to defenestrate my computer, so we're good.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "super fun. I would just recommend adding like cinematic world war moments, its pretty cool",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game is fine, and in fact is very good. The undisclosed and rampant use of gen AI imagery and voices throughout the tutorials and loading screens is very disappointing. All of these elements feel like they were placeholders awaiting the genuine art and artistry....but it never emerged. \n\nAs gamers we appreciate art - games are art. Unfortunately this developed has chosen genAI over artists as a cost cutting and time saving measure, but it may cost them far more than their savings.\n\nI won't refund the game as there is a lot of technical knowledge and development that has gone into making it - this is demonstrably a good game. However I don't think I'll endorse this developer in future unless they are up front with their approach to their medium, or directly support human artists.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So far so good.\n\nMy biggest concern was the player count though it seems there's lots of matches happening on a daily basis. Happy to see that Eugen is upping the discount to 60% off during on sale, I think base game's very much worth the money then. Kinda wishing they did those free weekends a tad more often as Warno's the kind of game you have to try to know if it's your thing, and two hours is far from enough to decide that.\n\nWill probs update this once I get the hang of it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Hesitent recommend, AI is Cringe (its loading screen only AFAIK(NOT THAT THAT MAKES IT OK))\nHOWEVER\nThe army general is a great experience imo and there is a insane amount of divisions to build with, while broken arrow sorts itself out this is a great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very solid cold war RTS. Eugen, for all the shit people hang on them, are quite good at their niche. \r\nGame is balanced around 1v1, and is easily the best balanced and most fun 1v1 rts I have played. \r\n\r\nRecommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "looks awesome and the music is really good, the gameplay so far is pretty fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a great game, the successor to a great series.  It is hard to learn but very rewarding when you get down the basics.  All it needs is more players --- BUY THIS GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best RTS I've played so far. The mechanics are really complex and deep, the units are impressively detailed, each vehicle, plane or squad having their own weapon, and the game goes really in depth in the mechanics of each weapons. Also, the soundtrack is a banger.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I left for awhile to go play Broken Arrow. But after a bit I realized this game is just better all around.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The M60 is a U.S. second-generation main battle tank that entered service around 1960 as an evolution of the M48 Patton. It kept the general Patton layout but introduced a new wedge-shaped hull, diesel engine, and—crucially—a 105 mm M68 gun derived from the British L7, giving it a major firepower boost over earlier American tanks. Designed by Chrysler and built in large numbers (over 15,000 of all variants), it became the primary U.S. MBT throughout much of the Cold War before the M1 Abrams took over. \n\n\nThe M60 family went through several key variants. The M60A1 added a new longer “needle-nose” turret with thicker armor, improving survivability. The oddball M60A2 “Starship” tried to field a 152 mm gun/launcher capable of firing Shillelagh missiles, but it proved complex and unreliable. The definitive model was the M60A3, which folded in reliability upgrades, better fire control, laser rangefinders, and thermal sights, keeping the basic 105 mm gun but giving the tank far better hit probability and night-fighting capability. \n\n\nIn terms of performance, an M60A3 weighs roughly 54–55 short tons, uses a 750 hp AVDS-1790 diesel, and tops out at about 30 mph on roads with a range around 300 mi. It has a four-man crew (commander, gunner, loader, driver) and typical secondary armament of a .50 cal machine gun plus a 7.62 mm coax. Although retired from U.S. frontline service by the late 1990s, M60s have seen combat with many operators—from the Yom Kippur War to Operation Desert Storm and even more recent Middle Eastern conflicts—often in upgraded forms with added armor and modern optics to keep an old but solid hull relevant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I’ve ever played! Very detailed in every spec of the game to which I’ve never had a problem with the game. Also there is one issue with skirmish where if you lowered your starting point it doesn’t lower your AI teammates so they and the other AI enemy’s spawn with 2-4x as much as me. Regardless of that, still one of the best games I’ve played!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a solid RTS game thats quite fun with friends. God is it brutal to learn for newcomers though. I am still quite bad at it, though I would say better than average. Wish they went with more alt-history units than they have been tbh. I want wacky soviet tank projects and darpa napkin-sketch attack aircraft. \n\nOr better modding support. One of the thing stopping me from making mods for this game is the reportedly abysmal modding support that breaks mods completely every update. I aint wanna deal with that shit. Fix it and i will be adding Japan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A big upgrade in quality of life and playability from Wargame: Red Dragon. Despite the gross and disappointing use of AI generated content in a 40 dollar game, I can still recommend this game - particularly on sale. Plus, there's mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"I’ve been playing WARNO for a while now, and I’m honestly impressed with how far it’s come. If you enjoyed Wargame: Red Dragon or Steel Division, this feels like the natural evolution of those games, but with a much cleaner interface and more attention to detail.\"\r\n\r\nThe thing I enjoy the most is how every match feels different. The units actually matter—if you don’t pay attention to your positioning or recon, the game punishes you fast, but in a way that feels fair. When you pull off a good maneuver or use the right combined arms setup, it’s genuinely satisfying.\r\n\r\nPerformance has improved a lot too. Early on I had some stutters, but recent updates smoothed things out for me. The devs also seem really active and actually listen to feedback, which is rare these days.\r\n\r\nIf you like real-time tactical games with more depth than the average RTS, WARNO is definitely worth a shot. It’s not perfect yet, but it’s heading in a really solid direction, and I find myself coming back to it more than I expected.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has a lot of potential. The graphics are excellent. But It desperately needs an even lower difficulty level if it wants to appeal to a larger crowd. Sure, you can still win by pausing and going at a slow rate. But for me, I just want to have fun.\r\nNow to the suggestions for the developers:\r\nFor starters, you need to clean the keyboard shortcut mess. Some shortcuts do not work, Some are at odds with the in-game manual, and some are entirely missing (like the ones for the lower left buttons, the eye, etc.). You will hate me for this, but you could learn a few things from popular, polished RTS games like, yes, Command & Conquer (even there you have to pick the well rated).\r\nI really hope you put that extra 10% effort because it could make a big difference as a commercial success. Good luck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been looking for a while now for a decent strategy millitary game and this one is gooooode.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I truly love this game, but after almost every update/hotfix, half modes are broken, that is ridiculous",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game for people that like stategy games and fun vehicles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eugen, please advertise your game!!! We cant have proper matchmaking if there are no players to matchmake!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually better than Broken Arrow on so many levels, both dev-wise and gameplay-wise. Its just shame Broken Arrow has much better marketing despite being so much worse.\n\nI want to apologize to all my friends for getting them into Broken Arrow in a first place.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After using chat GPT to understand which units are good for, and understanding basics - i really like this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the RTS that 14yo me thought they were playing when they got Command and Conquer back in the 90s.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Always beautiful and getting better every update.\n\nGIVE ME THE 1ST CAV EUGEN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "all of my three tanks delibarately missed their shots against an abrams and got annihilated. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks cool, but very very hard, i get my ass kicked on easiest difficulty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was so hyped to play this but I lowkey fell asleep, normally I give RTS games a chance and play them for hours but with this game I can't, I'm on the verge of taking a nap just thinking about this game.\n\nI'll give it a positive cuz it's a good game I'm just board",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is quite micro-heavy but its very fun nonetheless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not bad, best of such war simulators and devs are trying to make this better)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My Leopard 2 MBT got molested by a gang bang of East German T-34s",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so hard :(\nRecommended!\nEDIT: I figured it out. I can beat the easy AI now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Would love to see a TOTAL WAR (Empire?) and WARNO combo. How good could that be!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Attempt, but UX still flawed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best land war game in the last twenty years, IMHO.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dutasteride and Minoxidil Sulfate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, this game takes some time and skill to adjust to the playstyle. However, having played other games by the same devs, this game is a league ahead from their previous titles. I played a lot of Wargame: Red Dragon and loved it but never realized how much they advanced and tweaked from there until WARNO.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is wery good and, it shoud get more publiciti from the rts community.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The faction and vehicle variety alone make the game worth it, especially if you love late-Cold War military aesthetics. Gameplay is fun and almost any nation you can think of when it comes to NATO or Warsaw Pact is here, including the Canadians!!! You can play as the West Germans, East Germans, Muricans, Brits, French, Dutch, Belgians, Spanish, Canadians, Poles, Czechs, Russians, all with unique voice lines, and plans to add many more nations for both sides. There’s something for everyone whether your a Cold War buff or an RTS fan",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's installing and it says i have 24 minutes so me in the future played it so listen to him",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is nice and recommand for people who like politic games and RTS",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lots of fun in breakthrough, no cheaters in custom servers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WARNO offers a unique RTS experience with a good balance paid to realism and playability. There is new content and balance for competitive and casual games. The game has a very steep learning curve and could stand to its \"hidden knowledge\" made accessible, but overall WARNO is a very fun and well made game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive played and own both Regiments and Broken Arrow. Both lasted less than 4hrs play time. \n\nThis however Im hooked. Multiplayer is fun as is army general. \n\nGraphics are great, I love watching the replays. \n\nSteep learning curve, but once you get the hang of your chosen division its a lot of fun. \n\nHighly recommend but you need to put in the time to learn each unit.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Imagine that wargame red dragon works fine = warno.\n\nDoes not cancel that developers do masturbate on russian/soviet/red armies coz they are overpowered in both games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is just so addicting, i just love messin around in skirmishes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Russia is absuolutly OP, 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Conditional positive review. Would recommend if you are a dad.\n\nJokes aside if you have played wargame red dragon. It felt very samey. Can skip.\n\nI don't like the deck system. Why cant I just have a full air only deck? Lets say in a 2v2 or 3v3 map. I want to be the dedicated close air support guy. But I am limited to picking a very limited number of planes and have lots of deck points left over. \n\nGreat graphics, I don't typically praise a game for graphics but this deserves a praise. \n\nAlso, it would be nice if I could assume direct control over some units especially the planes and helicopters I would do some nice strafing runs and provide solid CAS rather than let the AI do its thing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enjoying so far, please add Yugoslavia!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOOKING FORWARD TO BLACK BIRDS. I FEEL LIKE WARNO'S COMING TO ASIA NOW",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A worthy successor to Wargame: Red Dragon.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "plays like steel division 2 but in a cold war setting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A huge upgrade from Red Dragon. It is a return to a more action base RTS.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the best strategy game I have every played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played it a bit pretty good game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great RTS cold war game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in some aspects better than broken arrow",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "couldn't vacuum anything 0/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best RTS game on steam",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Better than broken arrow",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love being drilled by rocket arty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very solid game for a fair price",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun RTS game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better then coh3",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "хороший игра",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than Broken Arrow!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I got Pinned by a 6'1 Guy....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hope that SGT Highway guy is Ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "endorsed by maduro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like. Simple as.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the f15 but only when on my team. :/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HELP ME IM ADDICTED",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gaming",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great rts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOO PACT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Leo the leopard 2",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "fun game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GIB 👏 MIR 👏 MORPHIUM 👏\nGIB 👏 MIR 👏 MORPHIUM 👏",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "INFANTRY KILLS AND IS KILLED BY TANk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this fuels my \"autism\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT STOP THE ARTILLERY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ooga",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "war.. now..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Suck",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bewup",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i am a T-64 enjoyer",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I loved this game but using and trying to hide the use of generative AI is utterly unacceptable.",
      "voted_up": false,
      "votes_helpful": 166
    },
    {
      "review": "I find it completely disgustingly unfair that despite paying full price or on discount that you don't really \"own\" the content you're paying for, having an important portion of the game locked behind \"community guidelines\" that affect all instances of the game inside multiplayer, including PRIVATE SERVERS. It would have been understandable if you could of gotten banned from community servers for a set time, however being banned from all instances of multiplayer is disgustingly unfair. This games Terms of Services is comparable to an EA's game ownership Terms, instead of owning a copy, you're owning a license that can strip off the majority content of the game.\n\nI completely do not recommend this game to anyone who wants to play with friends.",
      "voted_up": false,
      "votes_helpful": 98
    },
    {
      "review": "i wish it wouldn't made saves obsolete after every hotfix. it would be nice to not have to restart everytime.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Meh. I wish we had a meh choice instead of yes or no. Game is fine the publisher is greedy. If you want an arcade experience instead of a realistic strategic warfare experience buy the game. As I mentioned the eugen (developers) is  greedy. Honestly I don’t think there would be more “free” updates for the game. Rest would just a bunch of DLC’s",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "WAR? NO\r\nAIR SPAM? YES\r\n\r\n\r\nThe game is mostly AIrplane & Artillery Spam in current state .",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Warno versus Wargame Red dragon.\r\n\r\nGraphics looks bette than WGRD.\r\n\r\nMultiplayer 10vs10 still remains with the same problems that WGRD suffered from, which is pubstomp and noob feeders.\r\n\r\nWarno could still improve with a more comprhensive fog of war to make the multiplayer less prone to multi account cheats/hacks. Maybe incorporating delayed orders and cohesion / suppresion penalties being more significant for infantry unit movement.  Artillery could do with a single shot before the barrage to simulate artillery triangulation with recon.\r\n\r\nThe line of sight feature has improved a lot from WGRD but could do with some sort of topography graph.\r\n\r\nSingle player features are better than WGRD.\r\n\r\nThere are no naval units in this title unlike WGRD.\r\n\r\nPre-made decks are more authentic in this title and the badges look good.\r\n\r\nThe UI is a lot more refreshed and the game is an improvement.\r\n\r\n7 / 10 points. Improving multiplayer balance would deserve a higher score.\r\n\r\nNot recommended for gamers under 18 or recruitment age.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game but the pact forces are made too op. theres no point in playing bc youll never win if you play as nato without cheat mods. great game but awfully executed",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "boring game with very little content without dlc \r\nwargame red dragon is way better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't hate it, it has a lot of quality of life improvements over Wargame but the effects and kills aren't as satisfying and the game is really dark and depressing. The deck building is also heavily stripped down. Instead of picking a nation/coalition, deck type and year, now you only get to pick a premade faction & type with pretty limited unit choices. On the plus side you can now see all units stats in the armory. Artillery also has auto aim which both makes artillery less skillful and more annoying. And why are command units mixed into every tab instead of being under logistics and why are transport vehicles under tanks?\n\nIf they just took the graphics and deck building from Wargame and added the quality of life changes everyone would love it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Undisclosed genAI usage for loading screen thumbnails and other art",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Please, for the love of god, add regional pricing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ah yes. This is that type of a game when you need more than 2 hours to go through a tutorial, so u can't refund it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is outright boring and untactical. This game promises big, strategic battles but basically everything ends up turning into a zergball of ATGMs and defeating wave after wave of enemy troops and armor. At least in army general mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Broken english, stupid AI, and horribly-generated voice AI for pretty much every voice. Terrible, couldn't even get past the tutorial.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nope. nope. nope 72 gigs is ridiculous, this game is everything wrong with modern gaming",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "me no big like\n\nmy bro can not get the game. game too over priced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not great. cool idea, grubby execution",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Russia cheats america poo multiplayer no slow down time :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game was originally good. Now after the Southag update the game feels completely ruined.\n\n- Friendly high level TOW missles are horrendous (8 side pens to kill a T55)\n- Enemy TOW missles kill my stuff instantaniously\n- Friendly AA misses 90% of the time while enemy AA seems to be perfectly accurate. \n- 3 Challenger 2's lost to a T55\n- It is just horrendous now, the AI feels so unfair and its like there is a BG3 roll for each attack and they all have disadvanatge \n\n\nDon't buy until they release an update that fixes the issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Minor/patch releases with only bug fixes should not break mod compatibility. It is quite a frustrating experience having to find that 'good' version that is not broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't enjoy the game... Previous titles were just better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game makes me want to cut off my left testicle",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Getting tired of the AI slop",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Negative review until they remove the AI",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "not worth your money, buy broken arrow instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never buy any games or dlc from this company, the dev are highly bitter and spiteful people, they BAN people for 1000 years online for freedom of speech, just for talking not cheating or exploiding the game but for talking... I will try to get a refund of all theses games and dlc I bought from this company, oh I almost forgot once your account is banned on 1 multiplayer game from one game it will be banned from all multiplayer mode on any game... Steel division 2 banned, wargame red dragon banned, warno ? you guessed it ban.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Awful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game itself isn’t bad, but the way the developers treat their community is absolutely terrible. I’ve never seen such awful treatment of an audience in my life. Their DLC policy is just horrendous.\n\n80% of the paid content is simply copies of what’s already in the game. There’s also a lot of scammy behavior regarding release dates for DLCs and DLC bundles. For example, you might think that the Expansion Pass includes all DLCs since it’s the most expensive and even labeled as a “Gold Edition,” but that’s far from true. It’s just a scam—the most interesting content isn’t included. Instead, it only contains about 70% of the content, plus one unreleased DLC, which I’ll get to in a moment.\n\nMost recently, they were supposed to release SOUTHAG three months ago for purchase. However, they are intentionally delaying its release so it won’t be sold as a standalone DLC, trying to push as many people as possible to buy the Expansion Pass for 2–3 times the price, which does include it. Keep in mind, nowhere does the Expansion Pass say it gives early access to products. So, like most rational people, I bought the DLCs individually, and now I can’t play with the new decks. They’re trying to force me to buy the bundle just for one DLC. It’s absolutely disgraceful.",
      "voted_up": false,
      "votes_helpful": 218
    },
    {
      "review": "I used to love this game.\n\nBUT.\n\nUsing AI generated content in promotional material and NOT disclosing it on the store page is a HUGE personal no-no.",
      "voted_up": false,
      "votes_helpful": 166
    },
    {
      "review": "Undeclared AI content, and constant crashing in Army General mode.\n\nI enjoy playing the game, but I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "I loved this game but using and trying to hide the use of generative AI is utterly unacceptable.",
      "voted_up": false,
      "votes_helpful": 173
    },
    {
      "review": "**NOTE** SOUTHAG as of today, the seventh of October 2025, has been released. Good on the team for buckling down and finally getting it out, and I am editing the review with this note at the beginning to reflect that, whilst the situation regarding SOUTHAG itself has now resolved, the deeper problem(s) that it revealed in how the WARNO team communicates with the playerbase remain. However I do hope that in time there will be a point where this review will prove to be able to be at worst, removed, and at best, replaced with a positive review. **END NOTE**\n\n\nFirst and foremost, I wish to be clear: WARNO itself is a solid(ish) to good stand-alone Wargame RTS, and is an -OUTSTANDING- successor to the Wargame series. With that said it is plagued by two major factors that, in my opinion, cause it to suffer severely: \n\n1) A severe lack of sticking to timelines in regards to DLC content promised both pre-release and post launch.\n\n2) The inability to be clear, concise, and frank with the playerbase when it comes to their timelines for aforementioned delays.\n\nThis is something that is most offensive and downright unacceptable in their last section of the WARNO - Expansion Pass DLC; SOUTHAG. \n\nThe Release Schedule for the Expansion Pass was quite straightforward, Nemesis 1 was to Release in Q3 of 2024, Nemesis 2 and NORTHAG were to both release Q4 2024, and SOUTHAG was to release Q2 of 2025. You could purchase the Expansion Pass to save 20% on all four items. Nemesis 1 released quite literally the 1st day of Q3 2024, one couldn't ask for a better start and it was received very well; Nemesis 2 was released Oct. 30th which, whilst the tail end of October, is still the first month in Q4, and by far acceptable and a good pace. Rounding out the year was NORTHAG releasing Dec. 17th, easily making it in before Christmas and the end of Q4, which left one to simply wait until April for Q2 to begin and SOUTHAG to appear....right? \n\nWe are now, at the time of writing this (20:33 UTC -4) two days away from the start of Q4 of 2025. SOUTHAG is in early access for only those who have purchased the Expansion Pass (a concept I dislike, but understand from the situation the developers are in), however what I find rather angering is the following: The Expansion Pass costs 47.99 USD to purchase, more than the entire game, and I personally own Nemesis 1, 2, and NORTHAG! Yet the values of the three DLC's (34.97 USD) is not subtracted from the Expansion Pass. The closest thing to a 'discount' I get is if I purchase WARNO - Gold Edition because I have the Digital Guides and WARNO base game already so I get a 20% off discount bringing it down to 38.39 USD. \n\nLads, I know ya'll are in a hard place trying to get this done, but I cannot underscore how frustrating it is to see update after update of \"Guys, it's ALMOST here, we SUPER DUPER PROMISE! *smiley face*\" whilst either announcing -more DLC-, or showing off assets that the majority of the playerbase cannot use. A phrase my grandfather uses often is \"Don't show me the pain, show me the baby\", and it is applicable here. I understand the wish to update us as a community, but perhaps don't tell us the fifth time that SOUTHAG is -almost ready- for release, and only say so when you have a -date- for the release. For goodness sake, don't let Paradox of all people do better DLC policy than you guys, that's just unacceptable. if people own other parts of a bundle/expansion pass, they ought to at-least get -some- form of discount if they are trying to buy the last bit of the pass, especially in a case like this. I just wanna play my silly Frenchies ;-;, please just let me play my Frenchies already, and the Luftdivisione, I beg you ;(",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I find it completely disgustingly unfair that despite paying full price or on discount that you don't really \"own\" the content you're paying for, having an important portion of the game locked behind \"community guidelines\" that affect all instances of the game inside multiplayer, including PRIVATE SERVERS. It would have been understandable if you could of gotten banned from community servers for a set time, however being banned from all instances of multiplayer is disgustingly unfair. This games Terms of Services is comparable to an EA's game ownership Terms, instead of owning a copy, you're owning a license that can strip off the majority content of the game.\n\nI completely do not recommend this game to anyone who wants to play with friends.",
      "voted_up": false,
      "votes_helpful": 102
    },
    {
      "review": "Game is great, sunk thousands of hours into it. Negative review for the AI slop Eugen is forcing everywhere for no fucking reason",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Good game but uses AI art, and predatory DLC. Don't support these devs.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "i wish it wouldn't made saves obsolete after every hotfix. it would be nice to not have to restart everytime.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "As much as I love the game, I cant support the lazy AI slop that was used here. Hire a proper artist and remove the AI generated stuff from the game. It is unprofessional behaviour to add this to your product, and paints the whole game in a bad light. Will update the review when they remove it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Have you ever wanted to play a fantastic strategy game with your friend?\n\nDo you enjoy long campaigns with tough decisions to make and plots to undertake?\n\nDid you know this game has co-op campaigns? \n    - This actually doesn't matter as you will never finish one.\n    - The game hot patches almost twice a week and it will not allow you to continue your online co-op campaign if between sessions there was a hot fix.\n    - In the past month I have started 6 campaigns, I have been unable to finish a single one due to this.\n\nUntil the dev can \n1. stick to an update schedule or\n2. find out how to not cuck me during every single campaign\n\nI will not be playing this game anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you're not buying this SOLELY for the multiplayer, don't bother. The single player AI is almost nonexistent, and the balance is horrible. PACT tanks like the T80 are just better than any tank NATO gets, their better armor and accuracy are irrelevant when they're outranged and miss every shot anyway because they took one or two ATGM shots from PACT tanks pushing up. Almost all PACT infantry come with disposable IFVs (if you don't kill their infantry, they just come back for the next battle) with ATGMs that can kill any NATO vehicle while NATO gets few infantry units with HMG armed transports, let alone full IFVs. They also get wayyyyy to much artillery, and you'll have to spend half your time microing your units away from their bombardments because one of their scouts half the map away revealed your unit for .01 seconds. \r\n\r\nThe AI is completely non-reactionary to what you're doing. It won't move units to counter you, it won't react to their position in any way. It'll shove most of its units down one area of the map, scatter ATGM teams and vehicles around the rest and might call in one or two planes per battle. I've had battles where they'll move tanks and IFVs down a road 200 meters behind a unit of my tanks that I know they see because they're currently shooting at other units of theirs, but won't move those vehicles through the forest to kill them. \r\n\r\nAll this combined leads to nothing but frustration, because if you try to play the game like how you think you should all of your units, especially tanks, will get ripped to pieces. Try to push 6 tanks across a field? They're killed by ATGMS before they even get close. Want to send infantry through a town? They die because you turned your attention away for 5 seconds and they got artillery'd. Put a ATGM team in a woodline? They die because the AI doesn't need scouts to see them. \r\n\r\nIt's a horribly frustrating experience and the only way to succeed is to play /around/ the AI, not against it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I bought this game with the intent to mostly play the Army general mode. Keep this in mind because some of what I am going to say probably doesn't matter in the context of multiplayer, and I know that is why a lot of people like this game, but if you are going to have a mode it should be good. I enjoy that style of game the most, and although it had flaws I very much liked the sd2 version and war game red dragon has an amazing one. \r\n\r\nOne problem, that is a carry over from sd2, is that with the way the card/point system works plus the cap system, it attacking is easier than defending, for mp makes an amount of sense, for the army general it is stupid and makes what should be winnable fights terrible. I will talk about this a bit more in a different section, but the spam is just awful if you play as NATO, and if you are supposed to somehow defend and attack its just impossible. You might say it is realistic and to an extent it is but that gets to a bigger problem.\r\n\r\nThat bigger problem is the balancing. Once again for mp i'm sure it is fine, but for this game mode it doesn't work. Pact forces are way more capable than they should be, way stronger and NATO is nerfed. Given that divisions are structured based around capabilities in the real world, and the game takes those organizations into account for this mode, that becomes a problem. It is much worse than in Wargame. What will happen is you will get spamed, your units will not preform as you would think, you have to go on the offensive to not loose and you will just get stomped. Now this is not in every situation when you have multiple regiments deployed and have points to use NATO can do well, but with some of the scenarios what should be winnable fights feel impossible.\r\n\r\n Additionally it makes no sense that I am the defender and I am starting out having to cap points like everything is a meeting engagement . What is even stranger is that sd2 got this right but this one doesn't. \r\n\r\nOverall I will say this the mp is fun and so is skrimish, but I bought this game for the Army General mode, because I liked it in sd2. In this game it is a downgrade. Some people might just say get good or whatever. I am not saying I am some top level player or anything, but I play a lot of RTS games. I play combat mission, I play SD, GOH, all kinds. I have an idea of what I am doing and I know what I like. The core mechanics of this game do not fit with one of it's modes making it unfun to play. It is sad because the concept is so cool. If you just want an arcadey but fun mp rts this is probably for you, but if you want something a bit more with a good campaign mode look elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Back after 2 years. Game is unplayable. More divs than you can care to learn. First ranked match against the 13th best player in the game. Hilarious. Buy it if you want to play single player otherwise expect to get pounded by no lifers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh. I wish we had a meh choice instead of yes or no. Game is fine the publisher is greedy. If you want an arcade experience instead of a realistic strategic warfare experience buy the game. As I mentioned the eugen (developers) is  greedy. Honestly I don’t think there would be more “free” updates for the game. Rest would just a bunch of DLC’s",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you're looking for a balanced game with AI that is tough but not overwhelming difficult, you won't find it in WARNO. Even on the first Army General level on the easiest difficulty, the AI just has so much of everything, and by the time you get your main reinforcements, the Pact is already knocking on your doorstep. In-short;  the AI in this game is just supercharged, making it completely unbalanced.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "WAR? NO\r\nAIR SPAM? YES\r\n\r\n\r\nThe game is mostly AIrplane & Artillery Spam in current state .",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the game is now unplayable crashes every game to every second",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Leaving a negative review until eugen removes AI generated content or discloses AI use on the store page",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Extremely clunky controls nowadays, legacy bugs like missiles charging into the ground as soon as they loose lock and damaging the firing unit haven't been fixed since beta, Some Divs straight up useless (Looking at you, MNAD).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its fun but its pay for play and every DLC group is way stronger than normal. Not worth it if you dont wanna pay extra",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the multiplayer is dead and the single player revolves around you beating back hordes of enemies (with little to no strategy or skill) like a plants vs zombies game, waste of money and time \n\neugen also uses AI goyslop for their loading screens, if that matters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just go to a casino, you'll get the same experience and might actually enjoy yourself too.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TL;DR: I strongly do not recommend this game. Hopefully it gets better within a couple years, but to me it currently feels like the named-and-shamed method of pushing unfinished content out the door that appears appealing enough to get sales but is ultimately lacking in several critical areas.\r\n\r\nThings I don't like:\r\n- Awkwardly straddles the line between realism and arcade. If they want realism there needs to be so much more balancing, polishing, and emphasis on unit behaviors during combat. I think the devs may have backed themselves into an unrealistic mountain of work with how many units, weaponry, and factions they included from the get-go. If they want more arcadey, that doesn't change how much work needs to be done. \r\n- The balancing and mechanics in the existing game are generally kinda poor or confusing. \r\n- Units don't feel very different, even the special forces and kitted-out vehicles. How can a unit like Tanya in a decades-old Command & Conquer game totally sell the special forces feel and gameplay but the special forces in this game play almost exactly like basic infantry units by comparison? Overall, there aren't many special abilities that would fit into the realism aspect, either. \r\n- It's really frustrating when you tell a unit to move/flee but they sit completely still in an open field to fire/return fire like a fish in a bucket. There's moments like this in the game where unit commands feel more like unit suggestions.\r\n- I can't shake the impression that there was a huge emphasis on visual-accuracy of units (uniforms, camos, how weaponry looks, etc.), overall 80's vibes, and period-correct small details (low-quality audio for voice-overs and unit speech-lines as well as how/what they say), but that the meat of the game, from the outset, wasn't addressed as thoroughly as the aesthetics.\r\n- There's purchasable DLC all the time but it seems like the base-game is neglected.\r\n- Most importantly, why does it feel like I have to give this company my social security number and blood type to play online multiplayer? Definitely not hitting any good 80's vibes with that. \r\n\r\nConfuses me in a bad way:\r\n- Air support can't see ground enemies unless another unit has line-of-sight but isn't spotted or dead. You mean to tell me that in 1989 there was no briefing, tech packages, or eyeballs in those pilots? Maybe that's why they fly in circles constantly until they run out of fuel? \r\n- How do enemy tanks/armor just immediately know where my infantry are barricaded in buildings with pinpoint accuracy? \r\n- There's a little too much emphasis on certain tanks. planes, etc. over what would have likely been used if the Cold War went hot. I don't see omniscient T-80 tank crews mowing down M1 Abrams.\r\n\r\nThe good:\r\n- The soundtrack slaps, the 80's feel is the best out of any game I've played (isn't obnoxiously overdone), and the nostalgia deja vu vision wobbles got me a few times. \r\n- Units look very good.\r\n- Basic controls are not overly complicated or confusing. \r\n- Sound effects are great.\r\n\r\nHow do I best sum this all up? Like the rush you feel the first time you call in an A-10 Warthog with bops blaring and vibes on-point, but then it flies in circles and gets blown out of the sky. I really wish I knew beforehand just how surface-deep this all was.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wish I could give this game a good review but it is just so poorly balanced with poorly operation core mechanics I cannot. It completely favors a spammy and nonsense style of gameplay. It's great for someone who wants a game that's 90% graphics and 10% mechanics but that's just not me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is great, I like almost everything. Will change when you will add \"Reconnect\" function at least in team battles. Because its so sad and unfortunate to get disconected because of few seconds lag and see my friends die +no matter outcome its lose for your statistics",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI generated loading screens gross me out, extremely uncanny. Give us a file directory to put our own photos for loading screens.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "genuine waste of time and money. as much as i'm heavily interested in the story and the concept of the game, the tutorials are NOTHING like the actual gameplay in army general. you do the tutorials and think oh this seems easy, but as soon as you boot up army general you immediately get screwed over because either your battalion is decisively engaged and can't run, you lack the so called \"combined arms\" the tutorial mentions, or you get slaughtered in a tactical battle because the friendly AI can't do anything or all of your units get MOWED by dozens of enemies all in one place. sure, maybe it's just that i have a skill issue and instead of adapting im just seething, but im playing on ROOKIE. mind you, rookie and i can't win any damn battle. hopefully this changes as i continue to play given i have seven hours of gametime but jeez make this more beginner-friendly this shit is a PAIN IN THE ASS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Warno versus Wargame Red dragon.\r\n\r\nGraphics looks bette than WGRD.\r\n\r\nMultiplayer 10vs10 still remains with the same problems that WGRD suffered from, which is pubstomp and noob feeders.\r\n\r\nWarno could still improve with a more comprhensive fog of war to make the multiplayer less prone to multi account cheats/hacks. Maybe incorporating delayed orders and cohesion / suppresion penalties being more significant for infantry unit movement.  Artillery could do with a single shot before the barrage to simulate artillery triangulation with recon.\r\n\r\nThe line of sight feature has improved a lot from WGRD but could do with some sort of topography graph.\r\n\r\nSingle player features are better than WGRD.\r\n\r\nThere are no naval units in this title unlike WGRD.\r\n\r\nPre-made decks are more authentic in this title and the badges look good.\r\n\r\nThe UI is a lot more refreshed and the game is an improvement.\r\n\r\n7 / 10 points. Improving multiplayer balance would deserve a higher score.\r\n\r\nNot recommended for gamers under 18 or recruitment age.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game but the pact forces are made too op. theres no point in playing bc youll never win if you play as nato without cheat mods. great game but awfully executed",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "boring game with very little content without dlc \r\nwargame red dragon is way better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am a single player guy and bought Warno for that reason. First of all. If you don't like micromanagement i suggest you stay away from this title the game can be confusing you have to micromanage everything. \n\nTutorial was fun. Campaign was lame. Not for me. 4/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't hate it, it has a lot of quality of life improvements over Wargame but the effects and kills aren't as satisfying and the game is really dark and depressing. The deck building is also heavily stripped down. Instead of picking a nation/coalition, deck type and year, now you only get to pick a premade faction & type with pretty limited unit choices. On the plus side you can now see all units stats in the armory. Artillery also has auto aim which both makes artillery less skillful and more annoying. And why are command units mixed into every tab instead of being under logistics and why are transport vehicles under tanks?\n\nIf they just took the graphics and deck building from Wargame and added the quality of life changes everyone would love it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Undisclosed genAI usage for loading screen thumbnails and other art",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Please, for the love of god, add regional pricing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ah yes. This is that type of a game when you need more than 2 hours to go through a tutorial, so u can't refund it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is outright boring and untactical. This game promises big, strategic battles but basically everything ends up turning into a zergball of ATGMs and defeating wave after wave of enemy troops and armor. At least in army general mode.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Broken english, stupid AI, and horribly-generated voice AI for pretty much every voice. Terrible, couldn't even get past the tutorial.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nope. nope. nope 72 gigs is ridiculous, this game is everything wrong with modern gaming",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "me no big like\n\nmy bro can not get the game. game too over priced",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Russia cheats america poo multiplayer no slow down time :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[ENG]\r\nArmy General is a big step up from the old Wargame singleplayer campaign and easily the best part of the package. Playing these operations in coop or against friends is genuinely fun. The new multiplayer focused Army General mode finally gives structure and context instead of just throwing you into random matches, and it keeps you busy for many hours.\r\n\r\nOn top of that, there are quality of life improvements. Menus, UI and general game flow feel smoother and more modern. Compared to its predecessor, the whole game simply plays cleaner and more coherent.\r\n\r\nUnfortunately, the division and deck system is also the biggest disappointment. It should not really be called a builder, because you are not truly building a division, you are mostly just choosing a pre made one. Real customization with units that are actually viable in PvP is extremely limited. As a result, the playstyle of each division is basically locked in from the start.\r\n\r\nYes, this design makes it easier to sell more divisions as DLC and to balance them on paper, but it kills the core thing that made Wargame decks so addictive. The fun, sometimes frustrating process of deciding which of five slightly different bombers fits your plan best is simply gone. In practice there is usually one optimal deck layout per division and that is it.\r\n\r\nIn short: if you want to play Army General together with friends, whether in coop or against each other, the game is absolutely worth a look. If you mainly want loose skirmishes and deep deck building, then Wargame Red Dragon or another title will probably suit you better.\r\n\r\n\r\n[GER]\r\nArmy General ist eine deutliche Verbesserung gegenüber der alten Wargame Singleplayer Kampagne und klar das Highlight des Spiels. Die Operationen im Koop oder gegeneinander mit Freunden zu spielen macht wirklich Laune. Der neue, auf Multiplayer ausgelegte Army General Modus gibt den Gefechten endlich Struktur und Kontext, statt nur zufällige Schlachten aneinander zu reihen, und beschäftigt einen viele Stunden lang.\r\n\r\nDazu kommen ein paar Quality of life Verbesserungen. Menüs, Interface und der generelle Spielfluss wirken runder und moderner. Im direkten Vergleich fühlt sich das Spiel ausgereifter an als sein Vorgänger.\r\n\r\nDer größte Kritikpunkt ist aber leider das Divisions und Deck System. Einen echten Builder kann man das kaum nennen, denn man baut keine eigenen Divisionen, man sucht sich im Grunde nur eine fertige aus. Die realen Individualisierungsmöglichkeiten mit im PvP sinnvollen Einheiten sind minimal. Dadurch ist der Spielstil jeder Division praktisch von Beginn an festgelegt.\r\n\r\nNatürlich lässt sich so einfacher mehr Divisionen als DLC verkaufen und auf dem Papier besser balancieren, aber genau dabei geht der Kern des alten Wargame Decksystems verloren. Die spannenden und manchmal nervenzerrenden Entscheidungen, welcher von fünf ähnlichen Bombern nun wirklich in mein Deck passt, gibt es hier nicht mehr. Am Ende existiert für jede Division im Prinzip nur noch ein wirklich starkes Standarddeck.\r\n\r\nKurz gesagt: Für gemeinsame Runden im Army General, ob im Koop oder gegeneinander, ist das Spiel durchaus empfehlenswert. Wenn ihr aber vor allem zusammenhangslose Skirmishes und tiefgehenden Deckbau wollt, dann greift lieber wieder zu Wargame Red Dragon oder einem anderen Titel.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game was originally good. Now after the Southag update the game feels completely ruined.\n\n- Friendly high level TOW missles are horrendous (8 side pens to kill a T55)\n- Enemy TOW missles kill my stuff instantaniously\n- Friendly AA misses 90% of the time while enemy AA seems to be perfectly accurate. \n- 3 Challenger 2's lost to a T55\n- It is just horrendous now, the AI feels so unfair and its like there is a BG3 roll for each attack and they all have disadvanatge \n\n\nDon't buy until they release an update that fixes the issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Minor/patch releases with only bug fixes should not break mod compatibility. It is quite a frustrating experience having to find that 'good' version that is not broken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just don't enjoy the game... Previous titles were just better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game makes me want to cut off my left testicle",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Would be good if not for the AI slop",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Negative review until they remove the AI",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "not worth your money, buy broken arrow instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working\nWARNO has stopped working",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awful",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game itself isn’t bad, but the way the developers treat their community is absolutely terrible. I’ve never seen such awful treatment of an audience in my life. Their DLC policy is just horrendous.\n\n80% of the paid content is simply copies of what’s already in the game. There’s also a lot of scammy behavior regarding release dates for DLCs and DLC bundles. For example, you might think that the Expansion Pass includes all DLCs since it’s the most expensive and even labeled as a “Gold Edition,” but that’s far from true. It’s just a scam—the most interesting content isn’t included. Instead, it only contains about 70% of the content, plus one unreleased DLC, which I’ll get to in a moment.\n\nMost recently, they were supposed to release SOUTHAG three months ago for purchase. However, they are intentionally delaying its release so it won’t be sold as a standalone DLC, trying to push as many people as possible to buy the Expansion Pass for 2–3 times the price, which does include it. Keep in mind, nowhere does the Expansion Pass say it gives early access to products. So, like most rational people, I bought the DLCs individually, and now I can’t play with the new decks. They’re trying to force me to buy the bundle just for one DLC. It’s absolutely disgraceful.",
      "voted_up": false,
      "votes_helpful": 218
    },
    {
      "review": "I used to love this game.\n\nBUT.\n\nUsing AI generated content in promotional material and NOT disclosing it on the store page is a HUGE personal no-no.",
      "voted_up": false,
      "votes_helpful": 166
    },
    {
      "review": "Undeclared AI content, and constant crashing in Army General mode.\n\nI enjoy playing the game, but I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "I loved this game but using and trying to hide the use of generative AI is utterly unacceptable.",
      "voted_up": false,
      "votes_helpful": 173
    },
    {
      "review": "**NOTE** SOUTHAG as of today, the seventh of October 2025, has been released. Good on the team for buckling down and finally getting it out, and I am editing the review with this note at the beginning to reflect that, whilst the situation regarding SOUTHAG itself has now resolved, the deeper problem(s) that it revealed in how the WARNO team communicates with the playerbase remain. However I do hope that in time there will be a point where this review will prove to be able to be at worst, removed, and at best, replaced with a positive review. **END NOTE**\n\n\nFirst and foremost, I wish to be clear: WARNO itself is a solid(ish) to good stand-alone Wargame RTS, and is an -OUTSTANDING- successor to the Wargame series. With that said it is plagued by two major factors that, in my opinion, cause it to suffer severely: \n\n1) A severe lack of sticking to timelines in regards to DLC content promised both pre-release and post launch.\n\n2) The inability to be clear, concise, and frank with the playerbase when it comes to their timelines for aforementioned delays.\n\nThis is something that is most offensive and downright unacceptable in their last section of the WARNO - Expansion Pass DLC; SOUTHAG. \n\nThe Release Schedule for the Expansion Pass was quite straightforward, Nemesis 1 was to Release in Q3 of 2024, Nemesis 2 and NORTHAG were to both release Q4 2024, and SOUTHAG was to release Q2 of 2025. You could purchase the Expansion Pass to save 20% on all four items. Nemesis 1 released quite literally the 1st day of Q3 2024, one couldn't ask for a better start and it was received very well; Nemesis 2 was released Oct. 30th which, whilst the tail end of October, is still the first month in Q4, and by far acceptable and a good pace. Rounding out the year was NORTHAG releasing Dec. 17th, easily making it in before Christmas and the end of Q4, which left one to simply wait until April for Q2 to begin and SOUTHAG to appear....right? \n\nWe are now, at the time of writing this (20:33 UTC -4) two days away from the start of Q4 of 2025. SOUTHAG is in early access for only those who have purchased the Expansion Pass (a concept I dislike, but understand from the situation the developers are in), however what I find rather angering is the following: The Expansion Pass costs 47.99 USD to purchase, more than the entire game, and I personally own Nemesis 1, 2, and NORTHAG! Yet the values of the three DLC's (34.97 USD) is not subtracted from the Expansion Pass. The closest thing to a 'discount' I get is if I purchase WARNO - Gold Edition because I have the Digital Guides and WARNO base game already so I get a 20% off discount bringing it down to 38.39 USD. \n\nLads, I know ya'll are in a hard place trying to get this done, but I cannot underscore how frustrating it is to see update after update of \"Guys, it's ALMOST here, we SUPER DUPER PROMISE! *smiley face*\" whilst either announcing -more DLC-, or showing off assets that the majority of the playerbase cannot use. A phrase my grandfather uses often is \"Don't show me the pain, show me the baby\", and it is applicable here. I understand the wish to update us as a community, but perhaps don't tell us the fifth time that SOUTHAG is -almost ready- for release, and only say so when you have a -date- for the release. For goodness sake, don't let Paradox of all people do better DLC policy than you guys, that's just unacceptable. if people own other parts of a bundle/expansion pass, they ought to at-least get -some- form of discount if they are trying to buy the last bit of the pass, especially in a case like this. I just wanna play my silly Frenchies ;-;, please just let me play my Frenchies already, and the Luftdivisione, I beg you ;(",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "I find it completely disgustingly unfair that despite paying full price or on discount that you don't really \"own\" the content you're paying for, having an important portion of the game locked behind \"community guidelines\" that affect all instances of the game inside multiplayer, including PRIVATE SERVERS. It would have been understandable if you could of gotten banned from community servers for a set time, however being banned from all instances of multiplayer is disgustingly unfair. This games Terms of Services is comparable to an EA's game ownership Terms, instead of owning a copy, you're owning a license that can strip off the majority content of the game.\n\nI completely do not recommend this game to anyone who wants to play with friends.",
      "voted_up": false,
      "votes_helpful": 102
    },
    {
      "review": "Game is great, sunk thousands of hours into it. Negative review for the AI slop Eugen is forcing everywhere for no fucking reason",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Good game but uses AI art, and predatory DLC. Don't support these devs.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "i wish it wouldn't made saves obsolete after every hotfix. it would be nice to not have to restart everytime.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "As much as I love the game, I cant support the lazy AI slop that was used here. Hire a proper artist and remove the AI generated stuff from the game. It is unprofessional behaviour to add this to your product, and paints the whole game in a bad light. Will update the review when they remove it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Have you ever wanted to play a fantastic strategy game with your friend?\n\nDo you enjoy long campaigns with tough decisions to make and plots to undertake?\n\nDid you know this game has co-op campaigns? \n    - This actually doesn't matter as you will never finish one.\n    - The game hot patches almost twice a week and it will not allow you to continue your online co-op campaign if between sessions there was a hot fix.\n    - In the past month I have started 6 campaigns, I have been unable to finish a single one due to this.\n\nUntil the dev can \n1. stick to an update schedule or\n2. find out how to not cuck me during every single campaign\n\nI will not be playing this game anymore.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you're not buying this SOLELY for the multiplayer, don't bother. The single player AI is almost nonexistent, and the balance is horrible. PACT tanks like the T80 are just better than any tank NATO gets, their better armor and accuracy are irrelevant when they're outranged and miss every shot anyway because they took one or two ATGM shots from PACT tanks pushing up. Almost all PACT infantry come with disposable IFVs (if you don't kill their infantry, they just come back for the next battle) with ATGMs that can kill any NATO vehicle while NATO gets few infantry units with HMG armed transports, let alone full IFVs. They also get wayyyyy to much artillery, and you'll have to spend half your time microing your units away from their bombardments because one of their scouts half the map away revealed your unit for .01 seconds. \r\n\r\nThe AI is completely non-reactionary to what you're doing. It won't move units to counter you, it won't react to their position in any way. It'll shove most of its units down one area of the map, scatter ATGM teams and vehicles around the rest and might call in one or two planes per battle. I've had battles where they'll move tanks and IFVs down a road 200 meters behind a unit of my tanks that I know they see because they're currently shooting at other units of theirs, but won't move those vehicles through the forest to kill them. \r\n\r\nAll this combined leads to nothing but frustration, because if you try to play the game like how you think you should all of your units, especially tanks, will get ripped to pieces. Try to push 6 tanks across a field? They're killed by ATGMS before they even get close. Want to send infantry through a town? They die because you turned your attention away for 5 seconds and they got artillery'd. Put a ATGM team in a woodline? They die because the AI doesn't need scouts to see them. \r\n\r\nIt's a horribly frustrating experience and the only way to succeed is to play /around/ the AI, not against it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I bought this game with the intent to mostly play the Army general mode. Keep this in mind because some of what I am going to say probably doesn't matter in the context of multiplayer, and I know that is why a lot of people like this game, but if you are going to have a mode it should be good. I enjoy that style of game the most, and although it had flaws I very much liked the sd2 version and war game red dragon has an amazing one. \r\n\r\nOne problem, that is a carry over from sd2, is that with the way the card/point system works plus the cap system, it attacking is easier than defending, for mp makes an amount of sense, for the army general it is stupid and makes what should be winnable fights terrible. I will talk about this a bit more in a different section, but the spam is just awful if you play as NATO, and if you are supposed to somehow defend and attack its just impossible. You might say it is realistic and to an extent it is but that gets to a bigger problem.\r\n\r\nThat bigger problem is the balancing. Once again for mp i'm sure it is fine, but for this game mode it doesn't work. Pact forces are way more capable than they should be, way stronger and NATO is nerfed. Given that divisions are structured based around capabilities in the real world, and the game takes those organizations into account for this mode, that becomes a problem. It is much worse than in Wargame. What will happen is you will get spamed, your units will not preform as you would think, you have to go on the offensive to not loose and you will just get stomped. Now this is not in every situation when you have multiple regiments deployed and have points to use NATO can do well, but with some of the scenarios what should be winnable fights feel impossible.\r\n\r\n Additionally it makes no sense that I am the defender and I am starting out having to cap points like everything is a meeting engagement . What is even stranger is that sd2 got this right but this one doesn't. \r\n\r\nOverall I will say this the mp is fun and so is skrimish, but I bought this game for the Army General mode, because I liked it in sd2. In this game it is a downgrade. Some people might just say get good or whatever. I am not saying I am some top level player or anything, but I play a lot of RTS games. I play combat mission, I play SD, GOH, all kinds. I have an idea of what I am doing and I know what I like. The core mechanics of this game do not fit with one of it's modes making it unfun to play. It is sad because the concept is so cool. If you just want an arcadey but fun mp rts this is probably for you, but if you want something a bit more with a good campaign mode look elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Back after 2 years. Game is unplayable. More divs than you can care to learn. First ranked match against the 13th best player in the game. Hilarious. Buy it if you want to play single player otherwise expect to get pounded by no lifers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Meh. I wish we had a meh choice instead of yes or no. Game is fine the publisher is greedy. If you want an arcade experience instead of a realistic strategic warfare experience buy the game. As I mentioned the eugen (developers) is  greedy. Honestly I don’t think there would be more “free” updates for the game. Rest would just a bunch of DLC’s",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you're looking for a balanced game with AI that is tough but not overwhelming difficult, you won't find it in WARNO. Even on the first Army General level on the easiest difficulty, the AI just has so much of everything, and by the time you get your main reinforcements, the Pact is already knocking on your doorstep. In-short;  the AI in this game is just supercharged, making it completely unbalanced.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "WAR? NO\r\nAIR SPAM? YES\r\n\r\n\r\nThe game is mostly AIrplane & Artillery Spam in current state .",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "the game is now unplayable crashes every game to every second",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Leaving a negative review until eugen removes AI generated content or discloses AI use on the store page",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Extremely clunky controls nowadays, legacy bugs like missiles charging into the ground as soon as they loose lock and damaging the firing unit haven't been fixed since beta, Some Divs straight up useless (Looking at you, MNAD).",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its fun but its pay for play and every DLC group is way stronger than normal. Not worth it if you dont wanna pay extra",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}