{
  "positive": [
    {
      "review": "Love the game, over 100 hours in, but summoning is pretty busted. For a ranged or melee build, the mechanic of having to manage summons by constantly firing off a summon that lasts a minute or two (just to have an added damage source) seems reasonable. That micromanaging is NOT reasonable for a dedicated summoner.\r\n\r\nSummon armor absolutely needs to be adjusted so summons get [permanence] while wearing a set, not just an extra minute or two via rings and such. If someone wants to sacrifice defense with the goal of allowing a horde of summons to do the work, then those summons should be out 24/7. \r\n\r\nOr just make summons permanent and give summon armors even more summon count. Anything would be better than the ridiculous micromanaging that summoning requires right now.",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "[b]Core Keeper is a crafting/building game about expansive exploration, in a beautiful but unfamiliar underground world.[/b]\n\n[h3]What you'll want to know:[/h3]\n[list]The [b]core gameplay mechanics are presented to the player within the first 30 minutes, and it rarely ever deviates from them[/b]. The variety comes from finding more items, biomes, and bosses as you push outwards.\n[b]If you don't enjoy the gameplay during the first hour, you won't later.[/b][/list]\n[list]It's great with friends, but it plays completely fine solo.[/list]\n[list][b]There's a lot of exploration, but you need to lean heavily on the progression mechanics in the game.[/b][/list]\n[list]The combat in the game is very fast. There are times where you get killed within a few seconds. You have to learn to slow down and use mechanics like cooking and armour to mitigate this.[/list]\n\n\n[h3]Things I loved:[/h3]\n[list]The music and graphics are truly works of art.[/list]\n[list]The mechanics are uncomplicated, intuitive and polished[/list]\n[list]Crafting using nearby containers, and a single button to quick stack.[/list]\n[list]An abundance of items. You'll need lots of chests.[/list]\n[list]Numerous viable approaches to movement and combat[/list]\n\n[h3]Things I liked:[/h3]\n[list]Chill time at base doesn't feel wasted. There's always something you can do or build between ventures.[/list]\n\n[h3]Things I disliked:[/h3]\n[list]Pacing slows down dramatically during the second act.[/list]\n[list]The game ends pretty anticlimactically.[/list]\n[list]Ctrl+scroll wheel to swap inventory layers is neat but becomes overwhelming.[/list]\n[list]Huge amount of [b]inter-biome[/b] variety, but not a lot of [i]intra-biome[/i] variety[/list]\n[list]Thankfully not a lot of resource grinding, but you are expected to have collected some obscure items.[/list]\n[list]hard mode doesn't add as much in-game reward as it suggests.[/list]\n\n[h3]Things I hated:[/h3]\n[list]Font is egregious. I honestly gave up on cooking because it's so hard to read the font.[/list]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "What a great little gem of a game.  The world is huge, the progression was fun and I really enjoyed my time in this one.  My son and I went through it all in around 45 hours.  Had a blast with it and will return to it in the future I am sure.  Worth the pick up!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I like this game a lot - it's just nice to get lost in and explore the world for hours. The design elements for the creatures are cute and the bosses look interesting. I love the fact that they have seasonal events that you can turn on and off whenever you like. I'm excited to see what they add to the game next.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "You mine, craft, and explore a huge, mysterious cave full of secrets, resources, and big bosses to fight. The loop is super addictive you'll always be saying \"just one more tunnel.\"\n\nIt's fun alone, but even better with friends. If you like crafting, exploration, and a cozy vibe with some combat, you'll love it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is one of the best base building games on the market!\nPlaying this game with friends is the most fun i have had on my channel. with lots of bosses to beat, weapons to create, food to cook and farms to automate there is a lot to master. you also have a skill tree to customize your explorer to fit any playstyle. \nThe best part is being able to pet your pets, always a selling point for me",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I could say\nit feels slow at 1st. But there will be a point where everything seems soo smoothly.\nHighly recommend for those who played games like Terraria/Starbound and trying to find new games to play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome game to relax and come back to after major updates =)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game for those who like to explore and expand in the underground (like me).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played this game with friends despite that I usually don't play co-op games or any game with other people at all.\n\nThis game is a fun one that I didn't expect to enjoy it. Definitely waiting for more updates!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "테라리아를 다깨고 우울한 나한테 내려온 한줄기 빛 테라리아랑 비슷하면서도 본인만에 특색이있는 매력적인게임",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely love this game. It’s one I keep coming back to time and time again. The artwork is beautiful, the music and ambiance are so relaxing—it’s the perfect game to unwind with.\n\nI honestly don’t have anything bad to say about it. I love how much there is to explore, and how the game rewards you for doing so. Sure, you can stay at your base to cook, farm, and build, but it’s the exploration that truly drives the experience forward. And I really appreciate that the game actually has an ending—it gives everything a satisfying sense of completion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great sandbox game, not too hard and not too easy\r\nSimple building style and my only complaint is the lack of a fishing minigame\r\nOverall one of my favorite games I have gotten in a long time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I never thought I’d enjoy a game like this, but I have to admit it surprised me in a very positive way. I first jumped in with a couple of friends, but what really pulled me in were the long solo sessions where the game showed its full potential.\n\nExploring the underground world, moving through all the different biomes, collecting resources, mining, and trying to stay alive creates a really engaging mix. This game offers a bit of everything. The base building and decorating can easily keep you busy for hours as well, thanks to the wide selection of structures, furniture, and crafting stations.\n\nLeveling and gearing up my character became one of my favorite parts, and the boss fights add just the right amount of challenge to keep things interesting.\n\nWhether you prefer playing solo or with friends, and whether you only have time for short sessions or want to sink entire evenings into it, this game is definitely worth recommending.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mix the progression of Valheim with the art style of Stardew Valley and the gameplay of Minecraft and you get this gem. Is it unique? Nah, I wouldn't say so. But is it fun? Definitely. The bosses take actual thinking (not just running around screaming) as they progress but not so much that a casual player would feel out of their depth.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "mmmm… progression-based pixel art survival game with automation mechanics… my favorite 🤤",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have so many memories playing with friends late at night, organizing our base and being lulled to sleep by the music. In my very first playthrough this game instantly became a top 5 favourite. The only reason I stopped playing was because I had played everything there was in early access and was waiting for more updates. Perhaps it's time to jump in again!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun game, it reminds me of Terraria with the crafting and bosses. It's fun to set up your base and discovering new ores and crafting materials. I haven't finished the game/beat all the bosses, because I have too much fun creating new worlds and characters. It's a nifty game and it's more fun with friends, but you can still have fun playing solo.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love how the game is the same terria but with better armor and ores and tools u can create and how cool the map is in general",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like exploration crafting games, and this is a pretty good one. The pacing is not as good towards the second half of the game  and some sets are not really worth using but major updates are being added all the time. I think over time a lot of criticisms will be resolved as long as the developer keeps up the work. \nI see many people saying that this doesn't have as much content as Terraria but I think its an unfair comparison when Terraria has been out for over a decade.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, more addicting than substances",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game and will continue to play it for a long time.  I've gotten a couple of friends to join as well.  Super looking forward to 1.2. My favorite thing I've built is a chess board using the figurines where my brother and I play pretty regularly.  It's not a complex thing, but the experience of getting to share that with family who is far away is pretty awesome. Play a couple chess moves, go grind out some bosses, go back to chess for a couple of moves etc. Love it. \r\n\r\nFew things I've noticed while enjoying the game: \r\n\r\nI am very annoyed by the render distance. Building complex automation systems can break at points of overlapping objects when rendered. Its inconsistent, but only happens when out of field of view.  Monster spawn distance is also annoying and makes it difficult to farm creatures of all types at the same time. To solve these issues, i bought a second copy of the game so I could have another player stand in specific locations as to keep everything rendered and allow for overnight farming of monsters tied to biomes that are further away from my automation system (essentially using player characters as part of the automation system)\r\n\r\nBuilding a racetrack out of conveyers currently (full circle around the map).  Game cant keep up with rendering the many many thousands of conveyer tiles when using the faster car.  \r\n\r\nPlease please let 1.2 come with a way to filter non-stackable items\r\n\r\nI would like support for multi world servers. \r\n\r\nAs far as I'm concerned, everyone should play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alot of content and very cute artstyle! Fun gameplay and combat!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game, enjoyable soundtrack can be relaxing when building or farming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You like facotorio , stardew valley, and necesse? this game is for ya!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "always a blast and is always interesting what people come up with in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing. beautiful game, truly. art style, graphics, music is super relaxing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don’t write reviews much - \n\nbut this is one of my favorite games for sure. It’s an explore-survival game with sandbox mechanics but also has a story/boss progression (similar to terraria). I would compare this game as a beautiful combination of terraria, Stardew valley, and Minecraft (and some others in there). It takes all the great and fun aspects of those games and puts them into one. It does get grindy at times (especially in later game) but some people like that and I am one of those people.\n\nIt runs super well on the steam deck as well which makes it the perfect game to sit back and relax in bed or while watching tv. There are some cons to it but not any that are significant enough for me to mention (in my opinion). \n\nI think this is the perfect game for someone who loves cozy games but is also perfect for someone who loves challenging fighting games. \n\nHowever, this is my opinion and as much as I love this game and can’t wait for more updates, I understand that some people won’t like this game. I say give it a try at least ❤️\n\nMuch love and peace! ✌🏻 \n- TeaSnail",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and yet somewhat challenging game with relaxing soundtrack and extremely good visuals; I've never seen 3D used so well in a 2D environment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had an absolute blast with this game.\n\nBeat everything there was to beat, making automation circuits was super fun, had all kinds of auto-farms running... so then I figured I'd mess around with decorating my base. Aaaand then it hit me: I have high aesthetic standards and potato-level execution. No design skills whatsoever. I got annoyed at myself and bailed.\n\nDidn't know this type of game was my thing until I played it. I tried some similar games afterward, and yeah, they're fun in their own way— but Core Keeper just has its own special charm.\n\nThere's been a ton of updates since I last played, so starting fresh is gonna feel like playing it for the first time again. Super excited to dive back in. This game's a keeper for me, no pun intended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game i have ever played, you truly have to play it firsthand to understand\nThis game 100% has my nomination for Labor of Love steam awards 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely a very fun game, a lot of content for its price. Lots of fun MP and has some decently challenging fights later on. It does get a little grindy, but if that's your thing and you like a top down Terraria-style game with interesting crafting mechanics and skill trees, give this a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great co -op or solo game, lots of stuff to do, fair bit of freedom to build. Always fun to replay, since worlds are randomly generated alsways soemthing new. Looking forward for future content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "170 hours and i still haven't furnished my base but that doesn't matter, game still holds a special place in my heart and one day i will have all the achievements",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Core Keeper is a very loved and nostalgic game to me and my fiance. We started playing it years ago when it wasn't near finished and we have loved being apart of it's growth, experiencing every little addition to make it even more amazing. At first we didn't love having to make a new map every time an update came out to fully appreciate it, but we got used to it and just planned to make a bigger and better base every update(this was before the official release ofc...). \n\nThis is a game we can always come back to and I couldn't recommend it enough. I used to joke and say this is Stardew(obsessed) if they focused more on the combat and caves, haha! But it is so much more, my words aren't enough, the best way to know is to try it and you totally should.\n\nCore Keeper is an underground survival game, you can craft, cook, fish etc. You mine through walls, build your base and fight enemies as well as challenging mini bosses and big bosses. This underground cave is made up of 8(maybe more) different biomes to explore all with different enemies, plants, armor, and bosses. There's fun easter eggs and plenty of little areas to get side tracked on. Might not be for everyone but it was definitely for us.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not that good at survival, sandbox games. Through the countless hours spent in Minecraft or Terraria, I'm always there with a tutorial or a guide on a second screen. Not with Core Keeper ! I think it has casual play enough for someone to quickly pick it up and just enjoy the game without thinking too much about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. It is a very cute game with a pixel style. I love the combat, skills and different types of weapons/classes you can use. My personal favorite is the warlock and I enjoy being able to spawn creatures to fight for me lol. I think the storyline is super simple but entertaining. If you like cozy games similar to Stardew, but have a bit more action to them- then this game is absolutely for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great alone and even better with friends! Core Keeper is the definition of a labor of love!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i'm so happy you're still working on this game for so long, just like we're expanding and refining a wonderful base each time we do a new run! this game is wonderful to dive into solo, and just as amazing with friends, different but both great. gg, looking forward to the next update, everybody should have played this game at some point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a serious pros-and-cons review, you'd better ignore this one.\n\nI'm writing this solely to praise the qualities of this game, and without going into too much detail, even. It was one of the games that was most worth picking up in early access and playing as its development evolved.\n\nThis game has the cutest pixel art I've ever seen, plus an incredible soundtrack (seriously, each area of the world has a different background music and the next one is always the best). It obviously has some flaws, but I haven't noticed any because I'm always busy with all the fun things you can do, build, discover, create, and above all, with the mechanics, which, for me, are always innovative and intelligent. Besides all that, if you're a player who likes to explore absolutely EVERYTHING, you'll definitely find very cool surprises and references around.\n\nIn a way, it's just another open-world building game, but it happens to be the best I've ever seen in what it sets out to do and what it offers <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bout the same style as terraria but 3d and more automation very good music, very fun worth my money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best cozy games to ever exist. Played for nearly one hundred hours and I am still experiencing new stuff. Its great alone and great together with friends. Love it! <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play with friends or ur SO. Everything is cubes and the cubes wiggle when you smack them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think survival crafting games are really boring and this one is still a lot fun. Incredible with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super slept on game, really well made def recommend if you like terraria or minecraft kinda vibes with that stardew sprinkle ontop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very charming game that is great fun with friends. The atmosphere, sound design, and music all lend itself to making this a very relaxing and fun game to play alone, but with friends it is even more fun. \r\nThe gameplay is enjoyable and its fun to explore each new region as you progress through the game. Base building is a lot of fun as well, and the pets mechanic is a nice feature, especially that you can put them onto items to let them roam your base after you don't use them anymore. \r\nThe one gripe I have is for multiplayer you do have some connection issues, but besides that I don't have any complaints with the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game to play with friends. Great balance between cozy and adventure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd recommend it alone for supporting up to 8 players - pretty rare in the age of MMOs - but it also has a decent exploration aspect and a reasonable grind for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun survival sandbox that stands out while also paying homage to other amazing games like terraria. give it a try, theres a lot of ways to customize your experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good overall game. good and useful skill trees, progression feels good, end-games items are rare, not like games with a legendary every two seconds (i'm looking at you borderlands 3). Also, the bosses are good and unique. The exploration can give you either 2 hours of empty deserts, and then you can find a nice cave, or very cozy lake. Obviously better and way funnier with friends, the more the merrier. Who would not love to beat a giant squid to death with your friends using freaking laser drills ?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hello niche community. Buy the game it has good progression and as always is fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The crafting and exploration systems are pretty rewarding, with a modest pace that is neither too slow nor too fast. Base building is easy to get into, but hard to stop, as there is always another thing that you want to add to it. Once you are done more tasks await you: take down bosses, go on a trip to discover new biomes, areas, structures, or create a new build for your character.\n\nGetting RNG-based drops, or finding a specific sctructure can be frustrating. A few bosses are close to being clones, but other than that I didn't really find any negative aspects.\n\nDefinitely recommended for sandbox lovers and builders alike. Co-Op is a lot of fun and makes sense in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play this Game now since early access and I can tell - I fell in love with a vidoe game. It’s not even the gameplay and design, also the developer and his team are just amazing. You can feel there love for video games, it shows in the gameplay. I wish I had more words to describe how amazing this game is. If you love decorating, exploring, rpg - this game is for you.. try it, you will not regret it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to relax even if you are mining underground and doing stuff...Great to play with other friends...Soundtrack is so soothing that you can use it as a sleeping aid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy the art of Core Keeper. The game play is also quite enjoyable. I haven't gone through all the bosses, but really enjoyed building the base and setting up automation. Although I find that it's more enjoyable with mods enabled. Especially the auto boxes and auto farming mods. Otherwise Farming takes way too long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Core Keeper is a outstanding pixel graphic game in my opinion. Sound design is amazing in every biome. combat is challenging. Building bases is a dream with different lighting and blocks to explore and texture with. I cannot say enough about this game really. 100 Out of 10 from me ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i started this game because i love co-op sandbox games. now, i have somehow lost 80 hours to this game. time passes by like nothing and there is so much to do! c:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, would love to see use of idk i cant think at this time of night but great game and id love to see whats in store for future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RATING: 9.5/10 (Only deducted points because I forgot to eat dinner)\n\nCore Keeper isn't just a game; it's a hole in the ground where my time and social life went to die. I purchased it expecting a cute, casual mining/survival game, and instead, I became a subterranean zealot, driven by the insatiable urge to dig just one more layer and find just one more piece of glittering space-ore.\n\nThe Good: The loop is perfect. Digging feels immediately satisfying. The boss fights are genuinely tense and require actual effort (who knew a giant slime could induce so much panic?). And the moment you break through a wall and discover a massive, ancient, glowing biome? Pure dopamine.\n\nThe Bad: The inventory management is peak reality simulation. It perfectly captures the feeling of a miner carrying 40,000 pounds of dirt and 3 rotten apples.\n\nThe Ugly (But Loveable): You will get catastrophically lost. You will run out of torches. You will panic and accidentally eat your only healing potion while surrounded by sentient mushrooms. And you will love every minute of it.\n\nIf you enjoy Terraria, Stardew Valley, or simply losing yourself for 10 hours straight while your house slowly fills with dirt blocks, buy this immediately. But maybe buy a large pizza first. Just in case.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely peak game. I havent encountered any bugs, loving the gameplay loop/grind, and dont think anything requires too much grind for now. Im pretty much late-game, and theres still content and improvements i could make to advance my character. Bosses are fun and not at mandatory for story progression. Peak game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a game that can provide you with the countless hours of Exploration in Terraria combined with the Quirky Charm of Stardew Valley, look no further! Core Keeper is a unique entrant into the Sandbox/Survival Genre, providing an experience honed by a team with such love and care that shines through on every single level. Having been a part of the community since the very early parts of Early Access, I can say without hesitation that this game has every bit the potential to match it's piers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good multiplayer support, great game, huge potential with future releases and modding support.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I stumbled upon this when looking up pixel games. A nice little mix of RPG element with chill production progression system.\n\nGo at your own pace, farm and look after animals; or invite friends and cause massive destruction upon randomly generated underground areas.\n\nThe game doesn't hold your hand, you just got to explore and figure things out. Though, if you want to go quicker there's a nice wiki to refer to!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I saw gameplay and was intrigued by it. I bought the game and instantly fell in love with it! Reminds me of a hybrid between Stardew Valley and Terraria.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is definitely one of my favorite games! Fantastic sense of progression and exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you ever have played a game like terraria and loved to explore its large and interesting world and lovingly crafted mechanics, heres another game to give you just that!\r\n\r\nCore keeper is a truely great example of what an indie team can do with love, passion and care!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing it for a long time, and even today, it is one of the best dungeon-crawling, boss-fighting, farming and crafting, chilling RPG I've played. I'm still some way-off completing the entire game per se but having a blast since day one fighting all the unique bosses and crafting gear pieces and recipes!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Game! I've played it extensively and I'm super excited about the new content to come! Thank you Pugstorm dev team - for taking the time to regularly update and expand this game. You get my vote for the labor of love award  - no question about it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! If you like games like Terraria you'll enjoy this.\nSo addicting a whole day IRL goes by before you even notice.\n\nEven more fun if you play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played through Early Access up to and including Full Release, the game has followed a solid trend and continually outdone itself with each bit of content added.  If you enjoy this type of game it's an absolute solid choice!  Fun game-play, easy and still fun building, great progression system that both works naturally, but doesn't hinder play if you fall behind in gear while pushing forward in content.  Having a stat system for the character is great, allows for more refined game-play in the ways you prefer without making you useless in other methods if you decide to experiment.  \n\nThe game is fairly flexible to help ease new players into game-play, while still offering challenges to those who want them.\n\n10/10 would recommend to anyone who enjoys games like Terraria, Starbound, Necesse, or Tinkerlands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is just too good, dangerously addicting. A wet dream for a minecraft//terraria//pixel-game player. Trust.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game with pretty challenging bosses!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you like exploring and getting distracted by every little thing you see? Do you like base building, farming and relaxing to some amazing music with a pet by your side? Or maybe you like conquering bosses with various different builds and strategies however dumb they may be? Then this game is DEFINITELY for you. Would STRONGLY reccomend you to play with friends as you can synergize your builds together to take on the bosses in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Went into the game blind when my brother recommended it to me, I went melee life-steel, this game completely exceeded my expectations in almost every way. in my opinion Melee feels a little unbalanced but besides that 5/5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the balance of certain items rarity requiring you to explore extensively and not being able to just farm everything, but also lots of thing being very farmable that are more for base building. It feels like it has a pretty good balance. Playing with friends is also really fun especially since you can setup your own server for everyone to play on. The one thing I still wish it had though was crossplay with consoles. I have friends that only play on PC and some that only play on consoles so the only way to play with them all would be to have multiple copies...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun to play with friends. Also come with a lot of great features with a great atmosphere both for combat and non-combat activity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game more end game progression would be nice more biomes would be very nice more buildings in the world would help it not feel so empty and having 17 million crafting tables is annoying  beyond annoying add the ability to combine crafting tables to condense them or just add an item thatll let you add crafting tables to it and you can scroll through and select the name of the one you want im so sick of needing a whole spawn cell just for crafting tables it makes me not want to play at times its exhausting 4 stars condense the crafting tables and itll be a solid 5 stars for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, has kind of a mix of Terraria and Minecraft going on. I've put in 25 hours and feel like there is so much more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, not too easy, not overly complicated, its a the perfect game to kill some time, and some slime, and relax to a decent soundtrack.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There no single aspect of this cozy crafter that isn't absolutely JOYFUL. Incredible solo, even better with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, especially with friends\n\nsome of the pacing/progression could use a bit of work, for example, beat the final boss by surprise since there were other bosses I was aware of but hadn't killed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolutely wonderful game from talented creators. Progression can feel slow at times, but the payoff is always worth it, and exploring for resources often leads to finding even more things to do!\n\nTruly worth every penny in my opinion!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game so much!\r\nI think the best way to describe it is as 'a beautiful little game'.\r\n'Beautiful' is self-explanatory;\r\n'little' is not in reference to the game's relative popularity, or to its scope - rather to its down-to-earth feel, you really feel as if you're a part of the journey that Core Keeper has to offer.\r\nThe graphics are amazing, I love 8-bit games. The soundtrack is just awesome, I have it saved on Spotify!\r\n\r\nIf you don't have it, pick it up. It's not too expensive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for sandbox, exploration, and progression gameplay. Lots of content, few to no bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well made and captivating, be sure to give it a go, even if you are not a fan of survival games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game with a nice world. Farm, keep pets, explore, build.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great combination of terraria and stardew valley, the worlds are vast and filled with tons of content. Recommend it to sandbox enjoyers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A well-made and fun game, especially for co-op. \n\nThe game looks nice, plays well, and is intuitive, with a lot of freedom to do what you want.\n\nThe biomes, enemies and bosses are well made and interesting; however, do not expect any real difficulty from any of the bosses. Most likely, your deaths and runbacks will be from getting ganked by random mobs that you are trying to ignore while you are traveling from A to B rather than the bosses.\n\n\n\n\nThe end-game could be fleshed out a little more since the later tiers go by really fast and the automation aspects feel like they fall a little short of what you would expect, but it is not a big deal. I also heard that there is an automation-based update coming soon, so maybe that will address that nitpick.\n\nAnd if I'm being extremely nitpicky: maybe some small QoL features would be nice, like a direct \"Use From Inventory\" or \"Copy Entity At Mouseover Location\". Scrolling your action bars up/down or quickswapping items isn't quite the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First game i bought twice just because i love it so much and can now play on 2 consoles!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm in love with this game. It's Terraria with a top down view. Crafting, Combat, Basebuilding, Exploring, it's all perfect! Co-op with friends is superb and the achievement hunt is a ton of fun (except the skill ones lol).\nCan only recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. Great progression, very cool bosses, beautiful pixel art. A very fun co-op experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing. Love the boss fights. Love the farming, the automation, progression in game, the pets, all the loot...everything! It's so much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Kind of a hybrid of terraria and a few other games in the genre. Has it's own charm. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Based game, 100% the achievements are a pain but I love it still and would do it again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had a wonderful time playing this game thus far, and ended up putting 15 hours into it within my first couple of days! Very cozy vibe and scratches that terraria type of itch. Will 100% be continuing and replaying Core Keeper.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very similar to Valheim, but with simpler graphics and (surprisingly) more complex game play. Best played with friends or on a dedicated server.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty good. Not the kind of game I will likely come back to after working my way through the main loop, but I had a lot of fun with it for about 70 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, ain't got much to say other than that. built myself an automated ore smelter and raised roly poly bugs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm Keeping my Core so hard rn. (I love this game so effin much) It's engaging and challenging as well as being very entertaining. I played since before 1.0 and through and through update after update it gets better. And the price is actually reasonable for a game like this. 100% would recommend. Absolute Peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! It reminds me a lot of Terraria. The combat and movement are smooth and fun. There's so much to discover and learn!!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "After sitting down and finally seeing all the content Core Keeper has to offer, I feel nothing but burnt out and frustrated. \r\n\r\nTo start, the areas are huge and pretty decently designed - aside from the fact that there's just 2-3 enemies per area and that they're vast, empty, and boring most of the time. Have fun hacking away at walls and enemies you've seen hundreds of times over when trying to find an underwhelming structure that gives you items that barely have any functionality or uniqueness to them. I'll give it to them though, a lot of this stuff is super cool and fun to find the first time, but this game has an EXTREMELY bad issue with being repetitive in almost every way after that initial wow factor wears off. Things like a vast array of structures, items, rare enemies, etc, make these types of games fun, and Core Keeper just completely lacks those features. It feels like there's a really solid base for them to add onto, and I'm hoping future updates will turn these issues around.\r\n\r\nFurthermore, the skill tree is also a glaring issue in this game and almost feels like it's still in beta mode. Something about it is just very linear, boring, and uninspired. You can see everything it offers from the start of the game, and it really doesn't spark any sense of excitement for the later levels. Every 5 levels, you get to put a skill point in each corresponding tree's skills in a very linear fashion. There's really not much more to it than giving you some extra stat bonuses and occasionally a cool effect. Most of the time, one path of the tree is just so obviously better than the other that there's no point in diversifying between playthroughs. It just overall feels half baked and unfun, and in my opinion, needs a COMPLETE overhaul to even remotely feel like a finished feature.\r\n\r\nTo be clear, first half/early game feels very polished and well designed, but this formula completely falls off at a certain point and just becomes an uninspired grind fest with almost no reward. Items like the soul seeker show how terribly designed parts of this game are. The item is only good for a small portion of the game where it's not even worth grinding for since other mining equipment outclasses it very quickly. So what's the point in spending all of that time and effort searching for the forge and grinding all the bars/materials to craft it? It's just glaring BAD game design that makes 0 sense and doesn't even feel rewarding. I used the rune song for 80% of the game because I was lucky enough to find the stupidly rare structures its components spawn in very early on. I had zero reason to use any other weapon because of how easily this one outclasses everything in the game all the way up to end game. I had fun using it, but it just feels like really half assed game design especially when it's one of the very few interesting items in the game. So, looking at the worlds of difference between these two legendary weapons, you can see a major flaw in their design philosophy. You can get the rune song super early and it outclasses everything, while the soul seeker is a complete waste of time by the time you can get it. It all feels very silly and like they don't understand their own game's progression. And the funniest part - I only had fun because of the rune song and how OP it is because it made the game a bit less of a slog than the last time I had booted up a new world. Not to mention that it's one of the only well designed weapons that have a sense of uniqueness and some cool effects. Most of this game is crafting the same axe, sword, ranged weapon, etc just in a different font. This unfortunately makes the game become repetitive extremely quickly as well as proves as an example of this game not being well-designed as far as equipment goes (for the most part).\r\n\r\nOverall, I really want to like Core Keeper, but it falls flat in way too many areas to feel like a finished and entirely fun game. Around 60-70% completion, the game just completely wastes your time in so many ways that it's exhausting. Getting to that next initial wow factor kept me going to the next stage, but in the end, I realized my journey was more unsatisfying and annoying than it was fun, exciting, and challenging. I still recommend trying this game and in no way think it's terrible - it's just mid to OK at best once you've seen the bigger picture, in my opinion. When games like Terraria, tModLoader/Calamity, and Necesse exist, it's hard to say I'll ever truly want to return for more Core Keeper when the other experiences do almost everything entirely better. I see the work that has been put in, and I appreciate it. From the art, music, and general concept. With that said though, I still can't say this is an amazing game in its current state. What I can say, though, is that I think they can easily fix these design flaws with some time, effort, and maybe some design philosophy changes in the future updates. I'm excited to see what's coming in Core Keeper's future, but will not be returning until I see that the game can be a more fulfilling experience until the very end.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's just a boring game I don't know how else to explain my feelings but that.\n\nI never made it to the end of the game but it feels shallow and lacking content. I also don't like the art style for player built bases. Game is just boring to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game genuinely was fun for about 2 hours, then you realize that is what the game is going to be for the next 30 hours. They need to change the game play loop, it is dreadful. They want to be Terraria so bad. If I get killed by one more octopus arm throwing a snowball at me, I am going to lose it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is boringly linear, in particular the tool upgrading system boiled down to new area -> new ore -> new ore needs the pickaxe from the previous area -> mine new ore -> make all tools using that ore -> find new area -> new ore -> new ore needs the pickaxe from previous area -> mine new ore -> and so on.\n\nAnother very linear part of the game was fighting bosses, a lot of them need a thing to summon them or optionally find them, which just prolonged the game with annoying grinding because you have to get 10 of some drop or exploration item for every boss. \n\nI'm a pretty grind resistant person and play a lot of grindy games and tend to have fun with them, however, this game was just too linear in gameplay. A bunch of my hours in the game were just miserably walking around the map trying to find a specific item to summon a boss\n\nThe farming was pretty satisfying to harvest and I did like the ranching (although not very interactive). The bosses and bossfights themselves were cool",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Core Keeper allows any kind of spoilers on their official Discord. I joined to see the update announcements. A user posted an end of game spoiler in the general chat with no warning. Apparently that's allowed even though there is a specific channel for lore and spoilers.I have lost all interest in this game after having the ending spoiled. I feel like I was punished for showing extra interest in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wandered around a bit. Found a boss, got killed a few times, adjusted my strategy, killed it, cool...\r\nWandered around for hours. Haven't found anything interesting. No idea where all the iron's supposed to be at, but it's bottlenecking me. No idea where the next boss is at. No idea why I can't find any of the waypoints. Going anywhere takes forever. \r\n\r\nIDK. I could probably figure this game out if I wanted, but when I looked at it on my games list, I thought to myself... Do I really want to play this game some more?\r\n\r\nThe answer was no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good game, but publisher (bilibili) is promoting HamasDiddyEpstein\"oldenough to count, old enough to mount\"Piker.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "will get boring after the intial \"zone\", like the rest is an afterthought, I bet you anything that it is. dont get it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The core game is good, let me be clear that my negative experience is personal opinion.\r\n\r\nI really struggled with the progression of this game, I've played many others like it (Necesse, Terraria etc) and this is one of the first of it's kind that didn't have a clear progression system in terms of strength.\r\n\r\nThere are 4 main builds that you can play with, melee, ranged, magic and summon. The only one of these that you can obviously progress (crafting tables etc) is melee, the others require you to happen across loot for armour and weapons in the world. Loot which has spawn rates such as 2% or some even 0.5% meaning that you spend an awful lot of time wasting your time running around in circles looking for a drop.\r\n\r\nI really began to struggle with this after the first main boss, the lightning bird, you begin to feel under-powered very fast and have to resort to mindless wandering, or the wiki/reddit for how to advance your ability to fight in the new areas.\r\n\r\nHaving given in to using reddit to find what armour I needed to play the game and how / where to find it, I continued until I beat the bug boss, which after crafting gear for the next area up, not even the area meant for the boss, it still can one shot you, feeling supremely unfair.\r\n\r\nNow i've finished that boss, and there's nowhere further to upgrade but I still feel weak.\r\n\r\nReddit obviously tells you to get good and to find very specific rare items which just feels wrong to me. Why should the progression of a game hinge on finding rare items that unless researching them you would no nothing about?\r\n\r\nI just can't recommend this game currently, it has some great core features and a lot of work has gone into it but it just does not respect your time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just call it 'Terraria [with a view] from the Y-axis' instead of Terraria [with a view] from the Z-axis.  POV change doesn't change the mechanics or play style.   Got repetitive way too fast and unless they add a lot of content, I'm done.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not focusing on the right things with updates, gets boring after a while",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dynamically generated drops, with no way to narrow down the find / search is insane.  Chipped blade might as well not exist for me.  Such high potential.\r\n\r\nPut in SOMETHING that narrows down the search, or make the generation bigger so it's visible in a wider grid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Actually fuck this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have no sound. I dont get any help or something. tho",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mid",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "n",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just want my pants man.\n\nAs someone who was wowed by the first few hours of the game, I really cannot express how disappointed I am with the experience after a few more hours.\n\nCore Keeper is a cave exploration game that is centered around progression by upgrading your gear and defeating bosses, pretty similarly to Terraria! The game also allows you to flex your creative muscles with some building mechanics, and even has NPCs that you can have move in as well!\n\nLet's start with the good:\nThe game is visually stunning! The art style perfectly suits it in every way! I found myself eager to explore the beautiful caverns and see all of the diverse biomes where you find all kinds of fantastical creatures! It really is a joy to load up the game as a new player and explore what the early stages of the game has to offer visually!\n\nThe music is also incredible! I routinely found myself in awe in the early stages when I would find a new biome and the music would change. It inspired all kinds of feelings of whimsical adventuring/caving. \n(Side Note: I can tell the developers have musical backgrounds by the fact they also put musical puzzles in the game, so it makes sense the music is really good!)\n\nThe enemy and boss design is cool! I like the different types of enemies, and I've found many of them to be unique and interesting! (I do wish there were more though)\n\nUnfortunately, that's where the strengths of the game end for me, and the laundry list of problems begin to start.\n\nMechanics in General:\nCore Keeper has several mechanics, and nearly all of them feel unfinished to me. Skill progression is hit or miss, combat is limited for reasons I'll discuss later, building doesn't feel as fleshed out as it could be, the villagers seem relatively uninteresting to me, and the class system really struggles for a major reason I'll discuss later.\n\nGrind, Grind, and Grind some more:\nIf you love mindless grinding, this is the game for you.\nI cannot believe that I am 7 hours into the game, and I'm still grinding for a singular piece of gear to complete the set for my specific class of choice (Mage). The reason for this is that the acquisition of armor and weapons (outside of a very few select sets, mainly the ore armors) is entirely tied to loot tables on enemies or in the environment. After feeling lost for a few hours, I finally took a look over at the wiki to see what I was missing, and as it turns out, I wasn't missing anything! The game has NO way of crafting gear for ANY of the classes.\nThis might not be so bad, as long as the drop chances are at least pretty forgiving, right? Well, unfortunately, the EARLIEST set of mage gear has a >5% drop rate from every instance you can acquire it from with the exception of a BOSS FIGHT.\nI understand that in games like Terraria (A game I quite like), there are some frustrating instances where you have to grind for gear, but for the gear that is essential to progression for your main classes, most of the gear is relatively achievable within a short time frame. I have spent HOURS searching for the FIRST SET of gear for my class of choice.\nAlso remember, that the drop rate per enemy is equal for each set of armor, meaning that you might find 10 hats and 5 chest pieces, but no pants for instance. Don't even get me started on the weapons. -_-\nI would appreciate if, even if the gear is not entirely craftable, there was some way to swap two pieces of gear for one. For instance, maybe I could swap my leggings and chest piece for a hat, or hat and leggings for a chest piece, or some sort of mechanic that minimizes the grind a bit, but alas, there is no mechanic present.\n\nContinuing on the trend of grinding:\nIn my short time playing the game I can already see how inbalanced progression is among certain skills compared to others. \nRunning levels up incredibly fast for something that you do literally all the time in game, but combat skills level up FAR TOO slow for the amount of time you spend doing them relatively. I'm not saying it has to be one to one, but a slightly less grindy balance for earlier levels of these skills would be nice.\nSpeaking of skills:\nThe Skill trees feel underwhelming and boring. You spend all of this time shooting magic or your bow at people, and your reward for levelling FIVE levels is (+2% Crit Chance). Come on now. I understand the minor stat boosts for things such as mining and running, but the actual combat skills?\n\nGeneral Takeaways\nI've spent a lot of time griping about my largest concerns, so I'll summarize the rest with this:\n\nSimilar to Terraria, the game just tosses you in and expects you to figure this s*** out. While Terraria has taken some steps to minimize this, I HIGHLY RECOMMEND consulting the Wiki for this game if you feel lost.\n\nSeveral other mechanics feel unfinished.\n- The Main Biomes don't feel unique to explore. They feel like identical areas but with slightly higher or lower tier ores and a coat of paint.\n- There are SO MANY crafting stations, and many of them allow you to craft random assortments of blocks that vary in terms of usefulness. This is particularly frustrating because there are so many cool ideas here, and it feels like the devs either didn't want or didn't have the time to expand on them and make them meaningful.\n\nThis is my first ever written review for a game, so sorry if it's a bit scatterbrained, but I found myself needing to get some of my frustrations off of my chest, and potentially bring awareness to some problems that the game has that aren't apparent right away. \n\nWhether or not you buy is entirely personal preference. If you enjoy mindless grinding and the dopamine hit from finally finding that last piece of gear, this is definitely the game for you. I personally don't find the need to grind this early on and to this scale enjoyable.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "No hotkeys or separate slots for often used tools/consumables. You must scroll through hotbars and use items individually. \r\nYou can't use/place items directly from inventory.\r\n\r\nIt is just tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really fun til mid-game, then it gets too grindy and the progression is boring.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I wanted to like this game but it just gets more and more tedious the longer you play. They wanted to extend playtime and instead of adding anything meaningful they simply make the player grind and grind and grind. This wouldn't be a problem if they didn't put in cooldown timers that don't need to exist. I reached my end point and uninstalled when I saw the portals in game have a 10 minute timer per use. THEY ALSO PUT NO I FRAMES IN THE GAME. So if you don't dodge for a split second? instant death. Have fun walking 2000 tiles back to the boss room! This is a game with huge potential where the developers got rich, and quit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "After sitting down and finally seeing all the content Core Keeper has to offer, I feel nothing but burnt out and frustrated. \r\n\r\nTo start, the areas are huge and pretty decently designed - aside from the fact that there's just 2-3 enemies per area and that they're vast, empty, and boring most of the time. Have fun hacking away at walls and enemies you've seen hundreds of times over when trying to find an underwhelming structure that gives you items that barely have any functionality or uniqueness to them. I'll give it to them though, a lot of this stuff is super cool and fun to find the first time, but this game has an EXTREMELY bad issue with being repetitive in almost every way after that initial wow factor wears off. Things like a vast array of structures, items, rare enemies, etc, make these types of games fun, and Core Keeper just completely lacks those features. It feels like there's a really solid base for them to add onto, and I'm hoping future updates will turn these issues around.\r\n\r\nFurthermore, the skill tree is also a glaring issue in this game and almost feels like it's still in beta mode. Something about it is just very linear, boring, and uninspired. You can see everything it offers from the start of the game, and it really doesn't spark any sense of excitement for the later levels. Every 5 levels, you get to put a skill point in each corresponding tree's skills in a very linear fashion. There's really not much more to it than giving you some extra stat bonuses and occasionally a cool effect. Most of the time, one path of the tree is just so obviously better than the other that there's no point in diversifying between playthroughs. It just overall feels half baked and unfun, and in my opinion, needs a COMPLETE overhaul to even remotely feel like a finished feature.\r\n\r\nTo be clear, first half/early game feels very polished and well designed, but this formula completely falls off at a certain point and just becomes an uninspired grind fest with almost no reward. Items like the soul seeker show how terribly designed parts of this game are. The item is only good for a small portion of the game where it's not even worth grinding for since other mining equipment outclasses it very quickly. So what's the point in spending all of that time and effort searching for the forge and grinding all the bars/materials to craft it? It's just glaring BAD game design that makes 0 sense and doesn't even feel rewarding. I used the rune song for 80% of the game because I was lucky enough to find the stupidly rare structures its components spawn in very early on. I had zero reason to use any other weapon because of how easily this one outclasses everything in the game all the way up to end game. I had fun using it, but it just feels like really half assed game design especially when it's one of the very few interesting items in the game. So, looking at the worlds of difference between these two legendary weapons, you can see a major flaw in their design philosophy. You can get the rune song super early and it outclasses everything, while the soul seeker is a complete waste of time by the time you can get it. It all feels very silly and like they don't understand their own game's progression. And the funniest part - I only had fun because of the rune song and how OP it is because it made the game a bit less of a slog than the last time I had booted up a new world. Not to mention that it's one of the only well designed weapons that have a sense of uniqueness and some cool effects. Most of this game is crafting the same axe, sword, ranged weapon, etc just in a different font. This unfortunately makes the game become repetitive extremely quickly as well as proves as an example of this game not being well-designed as far as equipment goes (for the most part).\r\n\r\nOverall, I really want to like Core Keeper, but it falls flat in way too many areas to feel like a finished and entirely fun game. Around 60-70% completion, the game just completely wastes your time in so many ways that it's exhausting. Getting to that next initial wow factor kept me going to the next stage, but in the end, I realized my journey was more unsatisfying and annoying than it was fun, exciting, and challenging. I still recommend trying this game and in no way think it's terrible - it's just mid to OK at best once you've seen the bigger picture, in my opinion. When games like Terraria, tModLoader/Calamity, and Necesse exist, it's hard to say I'll ever truly want to return for more Core Keeper when the other experiences do almost everything entirely better. I see the work that has been put in, and I appreciate it. From the art, music, and general concept. With that said though, I still can't say this is an amazing game in its current state. What I can say, though, is that I think they can easily fix these design flaws with some time, effort, and maybe some design philosophy changes in the future updates. I'm excited to see what's coming in Core Keeper's future, but will not be returning until I see that the game can be a more fulfilling experience until the very end.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "The game is boringly linear, in particular the tool upgrading system boiled down to new area -> new ore -> new ore needs the pickaxe from the previous area -> mine new ore -> make all tools using that ore -> find new area -> new ore -> new ore needs the pickaxe from previous area -> mine new ore -> and so on.\n\nAnother very linear part of the game was fighting bosses, a lot of them need a thing to summon them or optionally find them, which just prolonged the game with annoying grinding because you have to get 10 of some drop or exploration item for every boss. \n\nI'm a pretty grind resistant person and play a lot of grindy games and tend to have fun with them, however, this game was just too linear in gameplay. A bunch of my hours in the game were just miserably walking around the map trying to find a specific item to summon a boss\n\nThe farming was pretty satisfying to harvest and I did like the ranching (although not very interactive). The bosses and bossfights themselves were cool",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Core Keeper allows any kind of spoilers on their official Discord. I joined to see the update announcements. A user posted an end of game spoiler in the general chat with no warning. Apparently that's allowed even though there is a specific channel for lore and spoilers.I have lost all interest in this game after having the ending spoiled. I feel like I was punished for showing extra interest in the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's just a boring game I don't know how else to explain my feelings but that.\n\nI never made it to the end of the game but it feels shallow and lacking content. I also don't like the art style for player built bases. Game is just boring to me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game genuinely was fun for about 2 hours, then you realize that is what the game is going to be for the next 30 hours. They need to change the game play loop, it is dreadful. They want to be Terraria so bad. If I get killed by one more octopus arm throwing a snowball at me, I am going to lose it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The initial buildup to \"endgame\" is the type of thing I was looking for. However, it simply becomes a \"wander around until you find an item to summon the next boss\" game. The sense of progression between material tiers really falls off just as you think it should be picking up. There are about 5 bosses left for me, but nothing left in between each to \"get stronger\". I felt I could only wander around gambling for a random drop so much, when I had been through every zone type before it got stale. If they had just locked some/all of the progression (material tiers) behind the bosses, this probably would have been a non-issue. Unfortunately I won't be bothering to finish the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A game that desperately wants to be Terraria but with none of the actual fun or QOL or player choice but all of the frustrating elements. When was the game planning on explaining the crafing stations in spawn or when are we planning on adding a pin on the minimap for me to see my grave instead of having to press 'M' and then die again? Don't make me fucking shift click each individual item to deposit them into a chest; let me drag to deposit or add a deposit all.  The durability system adds so much depth! SO MUCH DEEP MECHANIC IN GAME WITH DURABILITY. This shit is like all the worst design decisions packaged into a game that I want to like but can't because it fucking sucks.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "will get boring after the intial \"zone\", like the rest is an afterthought, I bet you anything that it is. dont get it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stuck with this game too long. Starts out very promising, but very quickly becomes nothing but a grind. The limited selection of bosses are dealt with very quickly, and most of them are just copy/pastes of each other anyway. Once they're done, the only things left are levelling up all your skills, and searching every inch of the world for something, literally anything, to do. Found something? A golden idol? Look again. It's a yellow fish on a pedestal.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "good game, but publisher (bilibili) is promoting HamasDiddyEpstein\"oldenough to count, old enough to mount\"Piker.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like the game. buuut Its boring. not enough to do. Not enough enemies, weapons, ect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just call it 'Terraria [with a view] from the Y-axis' instead of Terraria [with a view] from the Z-axis.  POV change doesn't change the mechanics or play style.   Got repetitive way too fast and unless they add a lot of content, I'm done.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The core game is good, let me be clear that my negative experience is personal opinion.\r\n\r\nI really struggled with the progression of this game, I've played many others like it (Necesse, Terraria etc) and this is one of the first of it's kind that didn't have a clear progression system in terms of strength.\r\n\r\nThere are 4 main builds that you can play with, melee, ranged, magic and summon. The only one of these that you can obviously progress (crafting tables etc) is melee, the others require you to happen across loot for armour and weapons in the world. Loot which has spawn rates such as 2% or some even 0.5% meaning that you spend an awful lot of time wasting your time running around in circles looking for a drop.\r\n\r\nI really began to struggle with this after the first main boss, the lightning bird, you begin to feel under-powered very fast and have to resort to mindless wandering, or the wiki/reddit for how to advance your ability to fight in the new areas.\r\n\r\nHaving given in to using reddit to find what armour I needed to play the game and how / where to find it, I continued until I beat the bug boss, which after crafting gear for the next area up, not even the area meant for the boss, it still can one shot you, feeling supremely unfair.\r\n\r\nNow i've finished that boss, and there's nowhere further to upgrade but I still feel weak.\r\n\r\nReddit obviously tells you to get good and to find very specific rare items which just feels wrong to me. Why should the progression of a game hinge on finding rare items that unless researching them you would no nothing about?\r\n\r\nI just can't recommend this game currently, it has some great core features and a lot of work has gone into it but it just does not respect your time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not focusing on the right things with updates, gets boring after a while",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It won't start! The moment I created a world, selected a character, and finished the intro, there was no response!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dynamically generated drops, with no way to narrow down the find / search is insane.  Chipped blade might as well not exist for me.  Such high potential.\r\n\r\nPut in SOMETHING that narrows down the search, or make the generation bigger so it's visible in a wider grid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS SHIT AND ONE DIMENSIONAL",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Core Keeper has such a strong start that everything after that feels like a wasted opportunity. The game feels like it could have been amazing, but because of a lack of polish in its game design and a lack of content it’s just *passable*. \n\nThe basic foundation of the game is great — fun co-op, great art style, decent enough combat. But then you pull on almost any thread and start to see the issues: \n\n- The weapons and armors are all incredibly shallow, it feels like there’s 3 weapons per class all just palette swapped. Magic is just a worse ranged option and both magic and ranged are just bullets with different sprites. There’s one or two interesting weapons but that’s it. Legendary weapons from pre-1.0 were untouched and totally fall behind in the powercreep, so you can spend hours and hours hunting the parts for these Legendaries only to be rewarded with junk you’ll never use.\n\n- Every “end-game” biome they added is so incredibly boring and empty with shockingly thin enemy variety. There’s about 2 enemies per biome and you just fight them over and over again. This would be fine for an Early Access release, but on 1.0 it feels like they completely gave up towards the end of development. Who thought a big open desert with nothing in it would be fun to explore? Oh and the ocean, it’s just a desert with water instead of sand! The bone biome? Surprise! More desert.\n\n- The POI design they have means you just have to wade through thousands of bland tiles hoping you’ll stumble on something interesting. Why is there no detector that you can use? They just want you to wander, for hours, in any direction, hoping you’ll find something? Why aren’t there things like radar towers? Anything to point you in some direction of meaning.\n\n- Why is skill exp using such a stupid system? One exp per hit with no scaling for attack speed, one exp per wall with no scaling for wall hp — so it promotes super fast weapons or mind numbingly destroying dirt rather than rewarding you for progressing.\n\n- Skills are uninspired and are stuffed with horrible filler choices, not to mention they have almost no interesting effects on gameplay. Your choices should transform how you play and they do nothing but make some numbers slightly higher (which is the exact same as their weapon and armor design — very little interesting weapons, spells, or guns; just number slightly higher). It means how you play in early game is almost the same how you play in end-game. Compare early game Terraria to end-game Terraria — completely different experiences.\n\n- Minions and pets are terrible and trying to rely on them to do anything of note is a waste of time.\n\n- Why is your inventory constantly filled up with decorative garbage that has no use, sells for nothing? Why do these things even drop normally?? If we want a decorative object, maybe make us use a special tool (i.e., like a silk touch pickaxe in Minecraft)\n\n- Why is your inventory constantly filling up with valuables whose only purpose is to be sold? Why not just give us the money directly? It appears to be an excuse to just clog your inventory. Why did they waste all these dev and artist hours making these sprites? Combined with the above point, 80% of what you pick up is often trash.\n\n- Why is there no spawn or item cap on the world? The game just continues spawning enemies and never culls any dropped item or spawn, making your long-term game slowly lose performance. This gets worse the weaker your rig is. Classic indie development with no consideration for performance or optimization. They can’t just assume you have infinite memory and performance and take no responsibility for their own spawning mechanics.\n\n- Why is there a 10 minute delay on portals that you craft? Why are there no Wormhole potions that let you warp to your friends? QOL around exploration and teleportation is sorely needed. Again, the basics are here, but the devs have totally failed any sort of thorough or well executed design. You end up just having to walk or minecart rail if there’s no portal — again, just like the first few hours of the game. No special movement, no interesting mobility, no new options. You can’t slide, sprint, jump, hookshot, fly, hover, charge, nothing.\n\n- Why are the end-game bosses locked off by rare RNG drops? You have to farm fucking gems to summon them, and good luck if you’re missing one! Hope you like checking the wiki or trying to make some horrible, barely working mob farm or wasting hours of your actual life praying for a stupid ruby to drop, just to continue playing the game.\n\n- Automation! Why? Just because! There's no reason for it to exist. Speaking as a Satisfactory fanatic, I love automation. But you need to use game design to promote this entire feature set, otherwise it's just something you can do, that's just weirdly there.\n\nSo many areas of the game make you feel like not only did the designers not think twice, but they didn’t try to think about interesting choices at all. Just whatever was the easiest, quickest option, requiring the least amount of work so they could move on to something else. \n\nThey just made a choice and never evaluated whether it was a good choice or not, leaving you with an experience whose first ten hours are amazing and everything after that is just a slow descent into mind-numbing mediocrity.\n\nThey're working on a 2D Terraria clone next, and the problems with this game make me especially wary of what their design choices will be in that one. I'm praying they'll hire an actual game designer.",
      "voted_up": false,
      "votes_helpful": 161
    },
    {
      "review": "I just want my pants man.\n\nAs someone who was wowed by the first few hours of the game, I really cannot express how disappointed I am with the experience after a few more hours.\n\nCore Keeper is a cave exploration game that is centered around progression by upgrading your gear and defeating bosses, pretty similarly to Terraria! The game also allows you to flex your creative muscles with some building mechanics, and even has NPCs that you can have move in as well!\n\nLet's start with the good:\nThe game is visually stunning! The art style perfectly suits it in every way! I found myself eager to explore the beautiful caverns and see all of the diverse biomes where you find all kinds of fantastical creatures! It really is a joy to load up the game as a new player and explore what the early stages of the game has to offer visually!\n\nThe music is also incredible! I routinely found myself in awe in the early stages when I would find a new biome and the music would change. It inspired all kinds of feelings of whimsical adventuring/caving. \n(Side Note: I can tell the developers have musical backgrounds by the fact they also put musical puzzles in the game, so it makes sense the music is really good!)\n\nThe enemy and boss design is cool! I like the different types of enemies, and I've found many of them to be unique and interesting! (I do wish there were more though)\n\nUnfortunately, that's where the strengths of the game end for me, and the laundry list of problems begin to start.\n\nMechanics in General:\nCore Keeper has several mechanics, and nearly all of them feel unfinished to me. Skill progression is hit or miss, combat is limited for reasons I'll discuss later, building doesn't feel as fleshed out as it could be, the villagers seem relatively uninteresting to me, and the class system really struggles for a major reason I'll discuss later.\n\nGrind, Grind, and Grind some more:\nIf you love mindless grinding, this is the game for you.\nI cannot believe that I am 7 hours into the game, and I'm still grinding for a singular piece of gear to complete the set for my specific class of choice (Mage). The reason for this is that the acquisition of armor and weapons (outside of a very few select sets, mainly the ore armors) is entirely tied to loot tables on enemies or in the environment. After feeling lost for a few hours, I finally took a look over at the wiki to see what I was missing, and as it turns out, I wasn't missing anything! The game has NO way of crafting gear for ANY of the classes.\nThis might not be so bad, as long as the drop chances are at least pretty forgiving, right? Well, unfortunately, the EARLIEST set of mage gear has a >5% drop rate from every instance you can acquire it from with the exception of a BOSS FIGHT.\nI understand that in games like Terraria (A game I quite like), there are some frustrating instances where you have to grind for gear, but for the gear that is essential to progression for your main classes, most of the gear is relatively achievable within a short time frame. I have spent HOURS searching for the FIRST SET of gear for my class of choice.\nAlso remember, that the drop rate per enemy is equal for each set of armor, meaning that you might find 10 hats and 5 chest pieces, but no pants for instance. Don't even get me started on the weapons. -_-\nI would appreciate if, even if the gear is not entirely craftable, there was some way to swap two pieces of gear for one. For instance, maybe I could swap my leggings and chest piece for a hat, or hat and leggings for a chest piece, or some sort of mechanic that minimizes the grind a bit, but alas, there is no mechanic present.\n\nContinuing on the trend of grinding:\nIn my short time playing the game I can already see how inbalanced progression is among certain skills compared to others. \nRunning levels up incredibly fast for something that you do literally all the time in game, but combat skills level up FAR TOO slow for the amount of time you spend doing them relatively. I'm not saying it has to be one to one, but a slightly less grindy balance for earlier levels of these skills would be nice.\nSpeaking of skills:\nThe Skill trees feel underwhelming and boring. You spend all of this time shooting magic or your bow at people, and your reward for levelling FIVE levels is (+2% Crit Chance). Come on now. I understand the minor stat boosts for things such as mining and running, but the actual combat skills?\n\nGeneral Takeaways\nI've spent a lot of time griping about my largest concerns, so I'll summarize the rest with this:\n\nSimilar to Terraria, the game just tosses you in and expects you to figure this s*** out. While Terraria has taken some steps to minimize this, I HIGHLY RECOMMEND consulting the Wiki for this game if you feel lost.\n\nSeveral other mechanics feel unfinished.\n- The Main Biomes don't feel unique to explore. They feel like identical areas but with slightly higher or lower tier ores and a coat of paint.\n- There are SO MANY crafting stations, and many of them allow you to craft random assortments of blocks that vary in terms of usefulness. This is particularly frustrating because there are so many cool ideas here, and it feels like the devs either didn't want or didn't have the time to expand on them and make them meaningful.\n\nThis is my first ever written review for a game, so sorry if it's a bit scatterbrained, but I found myself needing to get some of my frustrations off of my chest, and potentially bring awareness to some problems that the game has that aren't apparent right away. \n\nWhether or not you buy is entirely personal preference. If you enjoy mindless grinding and the dopamine hit from finally finding that last piece of gear, this is definitely the game for you. I personally don't find the need to grind this early on and to this scale enjoyable.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "After sitting down and finally seeing all the content Core Keeper has to offer, I feel nothing but burnt out and frustrated. \r\n\r\nTo start, the areas are huge and pretty decently designed - aside from the fact that there's just 2-3 enemies per area and that they're vast, empty, and boring most of the time. Have fun hacking away at walls and enemies you've seen hundreds of times over when trying to find an underwhelming structure that gives you items that barely have any functionality or uniqueness to them. I'll give it to them though, a lot of this stuff is super cool and fun to find the first time, but this game has an EXTREMELY bad issue with being repetitive in almost every way after that initial wow factor wears off. Things like a vast array of structures, items, rare enemies, etc, make these types of games fun, and Core Keeper just completely lacks those features. It feels like there's a really solid base for them to add onto, and I'm hoping future updates will turn these issues around.\r\n\r\nFurthermore, the skill tree is also a glaring issue in this game and almost feels like it's still in beta mode. Something about it is just very linear, boring, and uninspired. You can see everything it offers from the start of the game, and it really doesn't spark any sense of excitement for the later levels. Every 5 levels, you get to put a skill point in each corresponding tree's skills in a very linear fashion. There's really not much more to it than giving you some extra stat bonuses and occasionally a cool effect. Most of the time, one path of the tree is just so obviously better than the other that there's no point in diversifying between playthroughs. It just overall feels half baked and unfun, and in my opinion, needs a COMPLETE overhaul to even remotely feel like a finished feature.\r\n\r\nTo be clear, first half/early game feels very polished and well designed, but this formula completely falls off at a certain point and just becomes an uninspired grind fest with almost no reward. Items like the soul seeker show how terribly designed parts of this game are. The item is only good for a small portion of the game where it's not even worth grinding for since other mining equipment outclasses it very quickly. So what's the point in spending all of that time and effort searching for the forge and grinding all the bars/materials to craft it? It's just glaring BAD game design that makes 0 sense and doesn't even feel rewarding. I used the rune song for 80% of the game because I was lucky enough to find the stupidly rare structures its components spawn in very early on. I had zero reason to use any other weapon because of how easily this one outclasses everything in the game all the way up to end game. I had fun using it, but it just feels like really half assed game design especially when it's one of the very few interesting items in the game. So, looking at the worlds of difference between these two legendary weapons, you can see a major flaw in their design philosophy. You can get the rune song super early and it outclasses everything, while the soul seeker is a complete waste of time by the time you can get it. It all feels very silly and like they don't understand their own game's progression. And the funniest part - I only had fun because of the rune song and how OP it is because it made the game a bit less of a slog than the last time I had booted up a new world. Not to mention that it's one of the only well designed weapons that have a sense of uniqueness and some cool effects. Most of this game is crafting the same axe, sword, ranged weapon, etc just in a different font. This unfortunately makes the game become repetitive extremely quickly as well as proves as an example of this game not being well-designed as far as equipment goes (for the most part).\r\n\r\nOverall, I really want to like Core Keeper, but it falls flat in way too many areas to feel like a finished and entirely fun game. Around 60-70% completion, the game just completely wastes your time in so many ways that it's exhausting. Getting to that next initial wow factor kept me going to the next stage, but in the end, I realized my journey was more unsatisfying and annoying than it was fun, exciting, and challenging. I still recommend trying this game and in no way think it's terrible - it's just mid to OK at best once you've seen the bigger picture, in my opinion. When games like Terraria, tModLoader/Calamity, and Necesse exist, it's hard to say I'll ever truly want to return for more Core Keeper when the other experiences do almost everything entirely better. I see the work that has been put in, and I appreciate it. From the art, music, and general concept. With that said though, I still can't say this is an amazing game in its current state. What I can say, though, is that I think they can easily fix these design flaws with some time, effort, and maybe some design philosophy changes in the future updates. I'm excited to see what's coming in Core Keeper's future, but will not be returning until I see that the game can be a more fulfilling experience until the very end.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Overall was a good game, enjoyed it until I realised that my friend and I couldn't both work towards the legendary gear for the both of us. The fact that it was 1 item per world of each piece.... Killed it for us, unless the devs give us a tick box allowing us to both get this gear I will not be coming back",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "No hotkeys or separate slots for often used tools/consumables. You must scroll through hotbars and use items individually. \r\nYou can't use/place items directly from inventory.\r\n\r\nIt is just tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pixel art is spectacular and many of the enemies/animals are charming and cute; but, combat & skill trees are skin deep. If you like decorating and pixel art, you will have a great experience, bonus if you like bosses and exploration.\n\nMuch like terraria, items are tiered/leveled, additionally items only have so much intricacy as what's written in the description. What I thought would spice it up was the skill tree, but it consists of 4% attack speeds bonuses, or 4% damage increases, so there's nothing to look forward to except subpar unimaginative skyrim perk tree bonuses.\n\nLastly mods(As in game modifications.) aren't very active. Which is odd, since it seems like the devs have mod support.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game genuinely was fun for about 2 hours, then you realize that is what the game is going to be for the next 30 hours. They need to change the game play loop, it is dreadful. They want to be Terraria so bad. If I get killed by one more octopus arm throwing a snowball at me, I am going to lose it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Core Keeper allows any kind of spoilers on their official Discord. I joined to see the update announcements. A user posted an end of game spoiler in the general chat with no warning. Apparently that's allowed even though there is a specific channel for lore and spoilers.I have lost all interest in this game after having the ending spoiled. I feel like I was punished for showing extra interest in the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really fun til mid-game, then it gets too grindy and the progression is boring.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's just a boring game I don't know how else to explain my feelings but that.\n\nI never made it to the end of the game but it feels shallow and lacking content. I also don't like the art style for player built bases. Game is just boring to me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is boringly linear, in particular the tool upgrading system boiled down to new area -> new ore -> new ore needs the pickaxe from the previous area -> mine new ore -> make all tools using that ore -> find new area -> new ore -> new ore needs the pickaxe from previous area -> mine new ore -> and so on.\n\nAnother very linear part of the game was fighting bosses, a lot of them need a thing to summon them or optionally find them, which just prolonged the game with annoying grinding because you have to get 10 of some drop or exploration item for every boss. \n\nI'm a pretty grind resistant person and play a lot of grindy games and tend to have fun with them, however, this game was just too linear in gameplay. A bunch of my hours in the game were just miserably walking around the map trying to find a specific item to summon a boss\n\nThe farming was pretty satisfying to harvest and I did like the ranching (although not very interactive). The bosses and bossfights themselves were cool",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to like this game but it just gets more and more tedious the longer you play. They wanted to extend playtime and instead of adding anything meaningful they simply make the player grind and grind and grind. This wouldn't be a problem if they didn't put in cooldown timers that don't need to exist. I reached my end point and uninstalled when I saw the portals in game have a 10 minute timer per use. THEY ALSO PUT NO I FRAMES IN THE GAME. So if you don't dodge for a split second? instant death. Have fun walking 2000 tiles back to the boss room! This is a game with huge potential where the developers got rich, and quit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game has a lot of fun content and genuinely shows huge potential, but there are a lot of issues that hold it back from being as good as it could be. One of the biggest problems is the imbalance between classes. Melee clearly gets the most attention with there being over 30 melee weapons, while the summoner class has only SIX. Like seriously when even the EXPLOSIVE class ends up with more items than a major class, something has gone wrong in development.\r\n\r\nProgression also feels frustrating because so much of the game is locked behind rare chests or low drop enemy items. Instead of working toward rewards through gameplay, it often feels like you're waiting on RNG to cooperate. I mean its fine if a few drops are rare enemy drops, but when the entire game is an enemy drop, it gets a bit grindy.\r\n\r\nAnother issue is the wild damage scaling. Even with some of the best gear available, enemies from multiple progression tiers earlier can still kill me in just a few hits. It makes upgrades feel unrewarding and progression less meaningful.\r\n\r\nThe bosses also do fall flat. Pretty much all of them feel anticlimactic, with no real incentive to fight them beyond mandatory progression checks. There's a lot of room for these encounters to be more memorable, challenging, and rewarding.\r\n\r\nOverall, the game [i]could[/i] be great, but these problems drag down the experience and make it feel less polished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is good but there is a lot of bad stuff like how every thing is melee you get this cool thing but it has to have the \"10 life on melee hit\" or how some stuff should be \"on hit\" but its \"on melee hit\". I feel like the need to love the classes equally like what do you mean summing has 6 weapons only. On top of that normal enemies do half your heath even when you are much farther in progression and bosses do no damage. And speaking about bosses they are sooooo boring like how the dragon bosses are just 3 copy and paste boss same with the slime\n\nThe armor feels really boring and lazy because the upgrading table. I think that could be a good thing but you need to lower the cost of it and make more armor. Their is a lot of more things bad with this game but im to lazy to write them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wandered around a bit. Found a boss, got killed a few times, adjusted my strategy, killed it, cool...\r\nWandered around for hours. Haven't found anything interesting. No idea where all the iron's supposed to be at, but it's bottlenecking me. No idea where the next boss is at. No idea why I can't find any of the waypoints. Going anywhere takes forever. \r\n\r\nIDK. I could probably figure this game out if I wanted, but when I looked at it on my games list, I thought to myself... Do I really want to play this game some more?\r\n\r\nThe answer was no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good game, but publisher (bilibili) is promoting HamasDiddyEpstein\"oldenough to count, old enough to mount\"Piker.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "will get boring after the intial \"zone\", like the rest is an afterthought, I bet you anything that it is. dont get it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The core game is good, let me be clear that my negative experience is personal opinion.\r\n\r\nI really struggled with the progression of this game, I've played many others like it (Necesse, Terraria etc) and this is one of the first of it's kind that didn't have a clear progression system in terms of strength.\r\n\r\nThere are 4 main builds that you can play with, melee, ranged, magic and summon. The only one of these that you can obviously progress (crafting tables etc) is melee, the others require you to happen across loot for armour and weapons in the world. Loot which has spawn rates such as 2% or some even 0.5% meaning that you spend an awful lot of time wasting your time running around in circles looking for a drop.\r\n\r\nI really began to struggle with this after the first main boss, the lightning bird, you begin to feel under-powered very fast and have to resort to mindless wandering, or the wiki/reddit for how to advance your ability to fight in the new areas.\r\n\r\nHaving given in to using reddit to find what armour I needed to play the game and how / where to find it, I continued until I beat the bug boss, which after crafting gear for the next area up, not even the area meant for the boss, it still can one shot you, feeling supremely unfair.\r\n\r\nNow i've finished that boss, and there's nowhere further to upgrade but I still feel weak.\r\n\r\nReddit obviously tells you to get good and to find very specific rare items which just feels wrong to me. Why should the progression of a game hinge on finding rare items that unless researching them you would no nothing about?\r\n\r\nI just can't recommend this game currently, it has some great core features and a lot of work has gone into it but it just does not respect your time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just call it 'Terraria [with a view] from the Y-axis' instead of Terraria [with a view] from the Z-axis.  POV change doesn't change the mechanics or play style.   Got repetitive way too fast and unless they add a lot of content, I'm done.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not focusing on the right things with updates, gets boring after a while",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dynamically generated drops, with no way to narrow down the find / search is insane.  Chipped blade might as well not exist for me.  Such high potential.\r\n\r\nPut in SOMETHING that narrows down the search, or make the generation bigger so it's visible in a wider grid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Actually fuck this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have no sound. I dont get any help or something. tho",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mid",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "n",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Core Keeper has such a strong start that everything after that feels like a wasted opportunity. The game feels like it could have been amazing, but because of a lack of polish in its game design and a lack of content it’s just *passable*. \n\nThe basic foundation of the game is great — fun co-op, great art style, decent enough combat. But then you pull on almost any thread and start to see the issues: \n\n- The weapons and armors are all incredibly shallow, it feels like there’s 3 weapons per class all just palette swapped. Magic is just a worse ranged option and both magic and ranged are just bullets with different sprites. There’s one or two interesting weapons but that’s it. Legendary weapons from pre-1.0 were untouched and totally fall behind in the powercreep, so you can spend hours and hours hunting the parts for these Legendaries only to be rewarded with junk you’ll never use.\n\n- Every “end-game” biome they added is so incredibly boring and empty with shockingly thin enemy variety. There’s about 2 enemies per biome and you just fight them over and over again. This would be fine for an Early Access release, but on 1.0 it feels like they completely gave up towards the end of development. Who thought a big open desert with nothing in it would be fun to explore? Oh and the ocean, it’s just a desert with water instead of sand! The bone biome? Surprise! More desert.\n\n- The POI design they have means you just have to wade through thousands of bland tiles hoping you’ll stumble on something interesting. Why is there no detector that you can use? They just want you to wander, for hours, in any direction, hoping you’ll find something? Why aren’t there things like radar towers? Anything to point you in some direction of meaning.\n\n- Why is skill exp using such a stupid system? One exp per hit with no scaling for attack speed, one exp per wall with no scaling for wall hp — so it promotes super fast weapons or mind numbingly destroying dirt rather than rewarding you for progressing.\n\n- Skills are uninspired and are stuffed with horrible filler choices, not to mention they have almost no interesting effects on gameplay. Your choices should transform how you play and they do nothing but make some numbers slightly higher (which is the exact same as their weapon and armor design — very little interesting weapons, spells, or guns; just number slightly higher). It means how you play in early game is almost the same how you play in end-game. Compare early game Terraria to end-game Terraria — completely different experiences.\n\n- Minions and pets are terrible and trying to rely on them to do anything of note is a waste of time.\n\n- Why is your inventory constantly filled up with decorative garbage that has no use, sells for nothing? Why do these things even drop normally?? If we want a decorative object, maybe make us use a special tool (i.e., like a silk touch pickaxe in Minecraft)\n\n- Why is your inventory constantly filling up with valuables whose only purpose is to be sold? Why not just give us the money directly? It appears to be an excuse to just clog your inventory. Why did they waste all these dev and artist hours making these sprites? Combined with the above point, 80% of what you pick up is often trash.\n\n- Why is there no spawn or item cap on the world? The game just continues spawning enemies and never culls any dropped item or spawn, making your long-term game slowly lose performance. This gets worse the weaker your rig is. Classic indie development with no consideration for performance or optimization. They can’t just assume you have infinite memory and performance and take no responsibility for their own spawning mechanics.\n\n- Why is there a 10 minute delay on portals that you craft? Why are there no Wormhole potions that let you warp to your friends? QOL around exploration and teleportation is sorely needed. Again, the basics are here, but the devs have totally failed any sort of thorough or well executed design. You end up just having to walk or minecart rail if there’s no portal — again, just like the first few hours of the game. No special movement, no interesting mobility, no new options. You can’t slide, sprint, jump, hookshot, fly, hover, charge, nothing.\n\n- Why are the end-game bosses locked off by rare RNG drops? You have to farm fucking gems to summon them, and good luck if you’re missing one! Hope you like checking the wiki or trying to make some horrible, barely working mob farm or wasting hours of your actual life praying for a stupid ruby to drop, just to continue playing the game.\n\n- Automation! Why? Just because! There's no reason for it to exist. Speaking as a Satisfactory fanatic, I love automation. But you need to use game design to promote this entire feature set, otherwise it's just something you can do, that's just weirdly there.\n\nSo many areas of the game make you feel like not only did the designers not think twice, but they didn’t try to think about interesting choices at all. Just whatever was the easiest, quickest option, requiring the least amount of work so they could move on to something else. \n\nThey just made a choice and never evaluated whether it was a good choice or not, leaving you with an experience whose first ten hours are amazing and everything after that is just a slow descent into mind-numbing mediocrity.\n\nThey're working on a 2D Terraria clone next, and the problems with this game make me especially wary of what their design choices will be in that one. I'm praying they'll hire an actual game designer.",
      "voted_up": false,
      "votes_helpful": 161
    },
    {
      "review": "I just want my pants man.\n\nAs someone who was wowed by the first few hours of the game, I really cannot express how disappointed I am with the experience after a few more hours.\n\nCore Keeper is a cave exploration game that is centered around progression by upgrading your gear and defeating bosses, pretty similarly to Terraria! The game also allows you to flex your creative muscles with some building mechanics, and even has NPCs that you can have move in as well!\n\nLet's start with the good:\nThe game is visually stunning! The art style perfectly suits it in every way! I found myself eager to explore the beautiful caverns and see all of the diverse biomes where you find all kinds of fantastical creatures! It really is a joy to load up the game as a new player and explore what the early stages of the game has to offer visually!\n\nThe music is also incredible! I routinely found myself in awe in the early stages when I would find a new biome and the music would change. It inspired all kinds of feelings of whimsical adventuring/caving. \n(Side Note: I can tell the developers have musical backgrounds by the fact they also put musical puzzles in the game, so it makes sense the music is really good!)\n\nThe enemy and boss design is cool! I like the different types of enemies, and I've found many of them to be unique and interesting! (I do wish there were more though)\n\nUnfortunately, that's where the strengths of the game end for me, and the laundry list of problems begin to start.\n\nMechanics in General:\nCore Keeper has several mechanics, and nearly all of them feel unfinished to me. Skill progression is hit or miss, combat is limited for reasons I'll discuss later, building doesn't feel as fleshed out as it could be, the villagers seem relatively uninteresting to me, and the class system really struggles for a major reason I'll discuss later.\n\nGrind, Grind, and Grind some more:\nIf you love mindless grinding, this is the game for you.\nI cannot believe that I am 7 hours into the game, and I'm still grinding for a singular piece of gear to complete the set for my specific class of choice (Mage). The reason for this is that the acquisition of armor and weapons (outside of a very few select sets, mainly the ore armors) is entirely tied to loot tables on enemies or in the environment. After feeling lost for a few hours, I finally took a look over at the wiki to see what I was missing, and as it turns out, I wasn't missing anything! The game has NO way of crafting gear for ANY of the classes.\nThis might not be so bad, as long as the drop chances are at least pretty forgiving, right? Well, unfortunately, the EARLIEST set of mage gear has a >5% drop rate from every instance you can acquire it from with the exception of a BOSS FIGHT.\nI understand that in games like Terraria (A game I quite like), there are some frustrating instances where you have to grind for gear, but for the gear that is essential to progression for your main classes, most of the gear is relatively achievable within a short time frame. I have spent HOURS searching for the FIRST SET of gear for my class of choice.\nAlso remember, that the drop rate per enemy is equal for each set of armor, meaning that you might find 10 hats and 5 chest pieces, but no pants for instance. Don't even get me started on the weapons. -_-\nI would appreciate if, even if the gear is not entirely craftable, there was some way to swap two pieces of gear for one. For instance, maybe I could swap my leggings and chest piece for a hat, or hat and leggings for a chest piece, or some sort of mechanic that minimizes the grind a bit, but alas, there is no mechanic present.\n\nContinuing on the trend of grinding:\nIn my short time playing the game I can already see how inbalanced progression is among certain skills compared to others. \nRunning levels up incredibly fast for something that you do literally all the time in game, but combat skills level up FAR TOO slow for the amount of time you spend doing them relatively. I'm not saying it has to be one to one, but a slightly less grindy balance for earlier levels of these skills would be nice.\nSpeaking of skills:\nThe Skill trees feel underwhelming and boring. You spend all of this time shooting magic or your bow at people, and your reward for levelling FIVE levels is (+2% Crit Chance). Come on now. I understand the minor stat boosts for things such as mining and running, but the actual combat skills?\n\nGeneral Takeaways\nI've spent a lot of time griping about my largest concerns, so I'll summarize the rest with this:\n\nSimilar to Terraria, the game just tosses you in and expects you to figure this s*** out. While Terraria has taken some steps to minimize this, I HIGHLY RECOMMEND consulting the Wiki for this game if you feel lost.\n\nSeveral other mechanics feel unfinished.\n- The Main Biomes don't feel unique to explore. They feel like identical areas but with slightly higher or lower tier ores and a coat of paint.\n- There are SO MANY crafting stations, and many of them allow you to craft random assortments of blocks that vary in terms of usefulness. This is particularly frustrating because there are so many cool ideas here, and it feels like the devs either didn't want or didn't have the time to expand on them and make them meaningful.\n\nThis is my first ever written review for a game, so sorry if it's a bit scatterbrained, but I found myself needing to get some of my frustrations off of my chest, and potentially bring awareness to some problems that the game has that aren't apparent right away. \n\nWhether or not you buy is entirely personal preference. If you enjoy mindless grinding and the dopamine hit from finally finding that last piece of gear, this is definitely the game for you. I personally don't find the need to grind this early on and to this scale enjoyable.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "After sitting down and finally seeing all the content Core Keeper has to offer, I feel nothing but burnt out and frustrated. \r\n\r\nTo start, the areas are huge and pretty decently designed - aside from the fact that there's just 2-3 enemies per area and that they're vast, empty, and boring most of the time. Have fun hacking away at walls and enemies you've seen hundreds of times over when trying to find an underwhelming structure that gives you items that barely have any functionality or uniqueness to them. I'll give it to them though, a lot of this stuff is super cool and fun to find the first time, but this game has an EXTREMELY bad issue with being repetitive in almost every way after that initial wow factor wears off. Things like a vast array of structures, items, rare enemies, etc, make these types of games fun, and Core Keeper just completely lacks those features. It feels like there's a really solid base for them to add onto, and I'm hoping future updates will turn these issues around.\r\n\r\nFurthermore, the skill tree is also a glaring issue in this game and almost feels like it's still in beta mode. Something about it is just very linear, boring, and uninspired. You can see everything it offers from the start of the game, and it really doesn't spark any sense of excitement for the later levels. Every 5 levels, you get to put a skill point in each corresponding tree's skills in a very linear fashion. There's really not much more to it than giving you some extra stat bonuses and occasionally a cool effect. Most of the time, one path of the tree is just so obviously better than the other that there's no point in diversifying between playthroughs. It just overall feels half baked and unfun, and in my opinion, needs a COMPLETE overhaul to even remotely feel like a finished feature.\r\n\r\nTo be clear, first half/early game feels very polished and well designed, but this formula completely falls off at a certain point and just becomes an uninspired grind fest with almost no reward. Items like the soul seeker show how terribly designed parts of this game are. The item is only good for a small portion of the game where it's not even worth grinding for since other mining equipment outclasses it very quickly. So what's the point in spending all of that time and effort searching for the forge and grinding all the bars/materials to craft it? It's just glaring BAD game design that makes 0 sense and doesn't even feel rewarding. I used the rune song for 80% of the game because I was lucky enough to find the stupidly rare structures its components spawn in very early on. I had zero reason to use any other weapon because of how easily this one outclasses everything in the game all the way up to end game. I had fun using it, but it just feels like really half assed game design especially when it's one of the very few interesting items in the game. So, looking at the worlds of difference between these two legendary weapons, you can see a major flaw in their design philosophy. You can get the rune song super early and it outclasses everything, while the soul seeker is a complete waste of time by the time you can get it. It all feels very silly and like they don't understand their own game's progression. And the funniest part - I only had fun because of the rune song and how OP it is because it made the game a bit less of a slog than the last time I had booted up a new world. Not to mention that it's one of the only well designed weapons that have a sense of uniqueness and some cool effects. Most of this game is crafting the same axe, sword, ranged weapon, etc just in a different font. This unfortunately makes the game become repetitive extremely quickly as well as proves as an example of this game not being well-designed as far as equipment goes (for the most part).\r\n\r\nOverall, I really want to like Core Keeper, but it falls flat in way too many areas to feel like a finished and entirely fun game. Around 60-70% completion, the game just completely wastes your time in so many ways that it's exhausting. Getting to that next initial wow factor kept me going to the next stage, but in the end, I realized my journey was more unsatisfying and annoying than it was fun, exciting, and challenging. I still recommend trying this game and in no way think it's terrible - it's just mid to OK at best once you've seen the bigger picture, in my opinion. When games like Terraria, tModLoader/Calamity, and Necesse exist, it's hard to say I'll ever truly want to return for more Core Keeper when the other experiences do almost everything entirely better. I see the work that has been put in, and I appreciate it. From the art, music, and general concept. With that said though, I still can't say this is an amazing game in its current state. What I can say, though, is that I think they can easily fix these design flaws with some time, effort, and maybe some design philosophy changes in the future updates. I'm excited to see what's coming in Core Keeper's future, but will not be returning until I see that the game can be a more fulfilling experience until the very end.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Overall was a good game, enjoyed it until I realised that my friend and I couldn't both work towards the legendary gear for the both of us. The fact that it was 1 item per world of each piece.... Killed it for us, unless the devs give us a tick box allowing us to both get this gear I will not be coming back",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "No hotkeys or separate slots for often used tools/consumables. You must scroll through hotbars and use items individually. \r\nYou can't use/place items directly from inventory.\r\n\r\nIt is just tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pixel art is spectacular and many of the enemies/animals are charming and cute; but, combat & skill trees are skin deep. If you like decorating and pixel art, you will have a great experience, bonus if you like bosses and exploration.\n\nMuch like terraria, items are tiered/leveled, additionally items only have so much intricacy as what's written in the description. What I thought would spice it up was the skill tree, but it consists of 4% attack speeds bonuses, or 4% damage increases, so there's nothing to look forward to except subpar unimaginative skyrim perk tree bonuses.\n\nLastly mods(As in game modifications.) aren't very active. Which is odd, since it seems like the devs have mod support.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game genuinely was fun for about 2 hours, then you realize that is what the game is going to be for the next 30 hours. They need to change the game play loop, it is dreadful. They want to be Terraria so bad. If I get killed by one more octopus arm throwing a snowball at me, I am going to lose it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Core Keeper allows any kind of spoilers on their official Discord. I joined to see the update announcements. A user posted an end of game spoiler in the general chat with no warning. Apparently that's allowed even though there is a specific channel for lore and spoilers.I have lost all interest in this game after having the ending spoiled. I feel like I was punished for showing extra interest in the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really fun til mid-game, then it gets too grindy and the progression is boring.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's just a boring game I don't know how else to explain my feelings but that.\n\nI never made it to the end of the game but it feels shallow and lacking content. I also don't like the art style for player built bases. Game is just boring to me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is boringly linear, in particular the tool upgrading system boiled down to new area -> new ore -> new ore needs the pickaxe from the previous area -> mine new ore -> make all tools using that ore -> find new area -> new ore -> new ore needs the pickaxe from previous area -> mine new ore -> and so on.\n\nAnother very linear part of the game was fighting bosses, a lot of them need a thing to summon them or optionally find them, which just prolonged the game with annoying grinding because you have to get 10 of some drop or exploration item for every boss. \n\nI'm a pretty grind resistant person and play a lot of grindy games and tend to have fun with them, however, this game was just too linear in gameplay. A bunch of my hours in the game were just miserably walking around the map trying to find a specific item to summon a boss\n\nThe farming was pretty satisfying to harvest and I did like the ranching (although not very interactive). The bosses and bossfights themselves were cool",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to like this game but it just gets more and more tedious the longer you play. They wanted to extend playtime and instead of adding anything meaningful they simply make the player grind and grind and grind. This wouldn't be a problem if they didn't put in cooldown timers that don't need to exist. I reached my end point and uninstalled when I saw the portals in game have a 10 minute timer per use. THEY ALSO PUT NO I FRAMES IN THE GAME. So if you don't dodge for a split second? instant death. Have fun walking 2000 tiles back to the boss room! This is a game with huge potential where the developers got rich, and quit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game has a lot of fun content and genuinely shows huge potential, but there are a lot of issues that hold it back from being as good as it could be. One of the biggest problems is the imbalance between classes. Melee clearly gets the most attention with there being over 30 melee weapons, while the summoner class has only SIX. Like seriously when even the EXPLOSIVE class ends up with more items than a major class, something has gone wrong in development.\r\n\r\nProgression also feels frustrating because so much of the game is locked behind rare chests or low drop enemy items. Instead of working toward rewards through gameplay, it often feels like you're waiting on RNG to cooperate. I mean its fine if a few drops are rare enemy drops, but when the entire game is an enemy drop, it gets a bit grindy.\r\n\r\nAnother issue is the wild damage scaling. Even with some of the best gear available, enemies from multiple progression tiers earlier can still kill me in just a few hits. It makes upgrades feel unrewarding and progression less meaningful.\r\n\r\nThe bosses also do fall flat. Pretty much all of them feel anticlimactic, with no real incentive to fight them beyond mandatory progression checks. There's a lot of room for these encounters to be more memorable, challenging, and rewarding.\r\n\r\nOverall, the game [i]could[/i] be great, but these problems drag down the experience and make it feel less polished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is good but there is a lot of bad stuff like how every thing is melee you get this cool thing but it has to have the \"10 life on melee hit\" or how some stuff should be \"on hit\" but its \"on melee hit\". I feel like the need to love the classes equally like what do you mean summing has 6 weapons only. On top of that normal enemies do half your heath even when you are much farther in progression and bosses do no damage. And speaking about bosses they are sooooo boring like how the dragon bosses are just 3 copy and paste boss same with the slime\n\nThe armor feels really boring and lazy because the upgrading table. I think that could be a good thing but you need to lower the cost of it and make more armor. Their is a lot of more things bad with this game but im to lazy to write them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wandered around a bit. Found a boss, got killed a few times, adjusted my strategy, killed it, cool...\r\nWandered around for hours. Haven't found anything interesting. No idea where all the iron's supposed to be at, but it's bottlenecking me. No idea where the next boss is at. No idea why I can't find any of the waypoints. Going anywhere takes forever. \r\n\r\nIDK. I could probably figure this game out if I wanted, but when I looked at it on my games list, I thought to myself... Do I really want to play this game some more?\r\n\r\nThe answer was no.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good game, but publisher (bilibili) is promoting HamasDiddyEpstein\"oldenough to count, old enough to mount\"Piker.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "will get boring after the intial \"zone\", like the rest is an afterthought, I bet you anything that it is. dont get it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The core game is good, let me be clear that my negative experience is personal opinion.\r\n\r\nI really struggled with the progression of this game, I've played many others like it (Necesse, Terraria etc) and this is one of the first of it's kind that didn't have a clear progression system in terms of strength.\r\n\r\nThere are 4 main builds that you can play with, melee, ranged, magic and summon. The only one of these that you can obviously progress (crafting tables etc) is melee, the others require you to happen across loot for armour and weapons in the world. Loot which has spawn rates such as 2% or some even 0.5% meaning that you spend an awful lot of time wasting your time running around in circles looking for a drop.\r\n\r\nI really began to struggle with this after the first main boss, the lightning bird, you begin to feel under-powered very fast and have to resort to mindless wandering, or the wiki/reddit for how to advance your ability to fight in the new areas.\r\n\r\nHaving given in to using reddit to find what armour I needed to play the game and how / where to find it, I continued until I beat the bug boss, which after crafting gear for the next area up, not even the area meant for the boss, it still can one shot you, feeling supremely unfair.\r\n\r\nNow i've finished that boss, and there's nowhere further to upgrade but I still feel weak.\r\n\r\nReddit obviously tells you to get good and to find very specific rare items which just feels wrong to me. Why should the progression of a game hinge on finding rare items that unless researching them you would no nothing about?\r\n\r\nI just can't recommend this game currently, it has some great core features and a lot of work has gone into it but it just does not respect your time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just call it 'Terraria [with a view] from the Y-axis' instead of Terraria [with a view] from the Z-axis.  POV change doesn't change the mechanics or play style.   Got repetitive way too fast and unless they add a lot of content, I'm done.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not focusing on the right things with updates, gets boring after a while",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dynamically generated drops, with no way to narrow down the find / search is insane.  Chipped blade might as well not exist for me.  Such high potential.\r\n\r\nPut in SOMETHING that narrows down the search, or make the generation bigger so it's visible in a wider grid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Actually fuck this game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have no sound. I dont get any help or something. tho",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mid",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "n",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Core Keeper has such a strong start that everything after that feels like a wasted opportunity. The game feels like it could have been amazing, but because of a lack of polish in its game design and a lack of content it’s just *passable*. \n\nThe basic foundation of the game is great — fun co-op, great art style, decent enough combat. But then you pull on almost any thread and start to see the issues: \n\n- The weapons and armors are all incredibly shallow, it feels like there’s 3 weapons per class all just palette swapped. Magic is just a worse ranged option and both magic and ranged are just bullets with different sprites. There’s one or two interesting weapons but that’s it. Legendary weapons from pre-1.0 were untouched and totally fall behind in the powercreep, so you can spend hours and hours hunting the parts for these Legendaries only to be rewarded with junk you’ll never use.\n\n- Every “end-game” biome they added is so incredibly boring and empty with shockingly thin enemy variety. There’s about 2 enemies per biome and you just fight them over and over again. This would be fine for an Early Access release, but on 1.0 it feels like they completely gave up towards the end of development. Who thought a big open desert with nothing in it would be fun to explore? Oh and the ocean, it’s just a desert with water instead of sand! The bone biome? Surprise! More desert.\n\n- The POI design they have means you just have to wade through thousands of bland tiles hoping you’ll stumble on something interesting. Why is there no detector that you can use? They just want you to wander, for hours, in any direction, hoping you’ll find something? Why aren’t there things like radar towers? Anything to point you in some direction of meaning.\n\n- Why is skill exp using such a stupid system? One exp per hit with no scaling for attack speed, one exp per wall with no scaling for wall hp — so it promotes super fast weapons or mind numbingly destroying dirt rather than rewarding you for progressing.\n\n- Skills are uninspired and are stuffed with horrible filler choices, not to mention they have almost no interesting effects on gameplay. Your choices should transform how you play and they do nothing but make some numbers slightly higher (which is the exact same as their weapon and armor design — very little interesting weapons, spells, or guns; just number slightly higher). It means how you play in early game is almost the same how you play in end-game. Compare early game Terraria to end-game Terraria — completely different experiences.\n\n- Minions and pets are terrible and trying to rely on them to do anything of note is a waste of time.\n\n- Why is your inventory constantly filled up with decorative garbage that has no use, sells for nothing? Why do these things even drop normally?? If we want a decorative object, maybe make us use a special tool (i.e., like a silk touch pickaxe in Minecraft)\n\n- Why is your inventory constantly filling up with valuables whose only purpose is to be sold? Why not just give us the money directly? It appears to be an excuse to just clog your inventory. Why did they waste all these dev and artist hours making these sprites? Combined with the above point, 80% of what you pick up is often trash.\n\n- Why is there no spawn or item cap on the world? The game just continues spawning enemies and never culls any dropped item or spawn, making your long-term game slowly lose performance. This gets worse the weaker your rig is. Classic indie development with no consideration for performance or optimization. They can’t just assume you have infinite memory and performance and take no responsibility for their own spawning mechanics.\n\n- Why is there a 10 minute delay on portals that you craft? Why are there no Wormhole potions that let you warp to your friends? QOL around exploration and teleportation is sorely needed. Again, the basics are here, but the devs have totally failed any sort of thorough or well executed design. You end up just having to walk or minecart rail if there’s no portal — again, just like the first few hours of the game. No special movement, no interesting mobility, no new options. You can’t slide, sprint, jump, hookshot, fly, hover, charge, nothing.\n\n- Why are the end-game bosses locked off by rare RNG drops? You have to farm fucking gems to summon them, and good luck if you’re missing one! Hope you like checking the wiki or trying to make some horrible, barely working mob farm or wasting hours of your actual life praying for a stupid ruby to drop, just to continue playing the game.\n\n- Automation! Why? Just because! There's no reason for it to exist. Speaking as a Satisfactory fanatic, I love automation. But you need to use game design to promote this entire feature set, otherwise it's just something you can do, that's just weirdly there.\n\nSo many areas of the game make you feel like not only did the designers not think twice, but they didn’t try to think about interesting choices at all. Just whatever was the easiest, quickest option, requiring the least amount of work so they could move on to something else. \n\nThey just made a choice and never evaluated whether it was a good choice or not, leaving you with an experience whose first ten hours are amazing and everything after that is just a slow descent into mind-numbing mediocrity.\n\nThey're working on a 2D Terraria clone next, and the problems with this game make me especially wary of what their design choices will be in that one. I'm praying they'll hire an actual game designer.",
      "voted_up": false,
      "votes_helpful": 161
    },
    {
      "review": "I just want my pants man.\n\nAs someone who was wowed by the first few hours of the game, I really cannot express how disappointed I am with the experience after a few more hours.\n\nCore Keeper is a cave exploration game that is centered around progression by upgrading your gear and defeating bosses, pretty similarly to Terraria! The game also allows you to flex your creative muscles with some building mechanics, and even has NPCs that you can have move in as well!\n\nLet's start with the good:\nThe game is visually stunning! The art style perfectly suits it in every way! I found myself eager to explore the beautiful caverns and see all of the diverse biomes where you find all kinds of fantastical creatures! It really is a joy to load up the game as a new player and explore what the early stages of the game has to offer visually!\n\nThe music is also incredible! I routinely found myself in awe in the early stages when I would find a new biome and the music would change. It inspired all kinds of feelings of whimsical adventuring/caving. \n(Side Note: I can tell the developers have musical backgrounds by the fact they also put musical puzzles in the game, so it makes sense the music is really good!)\n\nThe enemy and boss design is cool! I like the different types of enemies, and I've found many of them to be unique and interesting! (I do wish there were more though)\n\nUnfortunately, that's where the strengths of the game end for me, and the laundry list of problems begin to start.\n\nMechanics in General:\nCore Keeper has several mechanics, and nearly all of them feel unfinished to me. Skill progression is hit or miss, combat is limited for reasons I'll discuss later, building doesn't feel as fleshed out as it could be, the villagers seem relatively uninteresting to me, and the class system really struggles for a major reason I'll discuss later.\n\nGrind, Grind, and Grind some more:\nIf you love mindless grinding, this is the game for you.\nI cannot believe that I am 7 hours into the game, and I'm still grinding for a singular piece of gear to complete the set for my specific class of choice (Mage). The reason for this is that the acquisition of armor and weapons (outside of a very few select sets, mainly the ore armors) is entirely tied to loot tables on enemies or in the environment. After feeling lost for a few hours, I finally took a look over at the wiki to see what I was missing, and as it turns out, I wasn't missing anything! The game has NO way of crafting gear for ANY of the classes.\nThis might not be so bad, as long as the drop chances are at least pretty forgiving, right? Well, unfortunately, the EARLIEST set of mage gear has a >5% drop rate from every instance you can acquire it from with the exception of a BOSS FIGHT.\nI understand that in games like Terraria (A game I quite like), there are some frustrating instances where you have to grind for gear, but for the gear that is essential to progression for your main classes, most of the gear is relatively achievable within a short time frame. I have spent HOURS searching for the FIRST SET of gear for my class of choice.\nAlso remember, that the drop rate per enemy is equal for each set of armor, meaning that you might find 10 hats and 5 chest pieces, but no pants for instance. Don't even get me started on the weapons. -_-\nI would appreciate if, even if the gear is not entirely craftable, there was some way to swap two pieces of gear for one. For instance, maybe I could swap my leggings and chest piece for a hat, or hat and leggings for a chest piece, or some sort of mechanic that minimizes the grind a bit, but alas, there is no mechanic present.\n\nContinuing on the trend of grinding:\nIn my short time playing the game I can already see how inbalanced progression is among certain skills compared to others. \nRunning levels up incredibly fast for something that you do literally all the time in game, but combat skills level up FAR TOO slow for the amount of time you spend doing them relatively. I'm not saying it has to be one to one, but a slightly less grindy balance for earlier levels of these skills would be nice.\nSpeaking of skills:\nThe Skill trees feel underwhelming and boring. You spend all of this time shooting magic or your bow at people, and your reward for levelling FIVE levels is (+2% Crit Chance). Come on now. I understand the minor stat boosts for things such as mining and running, but the actual combat skills?\n\nGeneral Takeaways\nI've spent a lot of time griping about my largest concerns, so I'll summarize the rest with this:\n\nSimilar to Terraria, the game just tosses you in and expects you to figure this s*** out. While Terraria has taken some steps to minimize this, I HIGHLY RECOMMEND consulting the Wiki for this game if you feel lost.\n\nSeveral other mechanics feel unfinished.\n- The Main Biomes don't feel unique to explore. They feel like identical areas but with slightly higher or lower tier ores and a coat of paint.\n- There are SO MANY crafting stations, and many of them allow you to craft random assortments of blocks that vary in terms of usefulness. This is particularly frustrating because there are so many cool ideas here, and it feels like the devs either didn't want or didn't have the time to expand on them and make them meaningful.\n\nThis is my first ever written review for a game, so sorry if it's a bit scatterbrained, but I found myself needing to get some of my frustrations off of my chest, and potentially bring awareness to some problems that the game has that aren't apparent right away. \n\nWhether or not you buy is entirely personal preference. If you enjoy mindless grinding and the dopamine hit from finally finding that last piece of gear, this is definitely the game for you. I personally don't find the need to grind this early on and to this scale enjoyable.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "After sitting down and finally seeing all the content Core Keeper has to offer, I feel nothing but burnt out and frustrated. \r\n\r\nTo start, the areas are huge and pretty decently designed - aside from the fact that there's just 2-3 enemies per area and that they're vast, empty, and boring most of the time. Have fun hacking away at walls and enemies you've seen hundreds of times over when trying to find an underwhelming structure that gives you items that barely have any functionality or uniqueness to them. I'll give it to them though, a lot of this stuff is super cool and fun to find the first time, but this game has an EXTREMELY bad issue with being repetitive in almost every way after that initial wow factor wears off. Things like a vast array of structures, items, rare enemies, etc, make these types of games fun, and Core Keeper just completely lacks those features. It feels like there's a really solid base for them to add onto, and I'm hoping future updates will turn these issues around.\r\n\r\nFurthermore, the skill tree is also a glaring issue in this game and almost feels like it's still in beta mode. Something about it is just very linear, boring, and uninspired. You can see everything it offers from the start of the game, and it really doesn't spark any sense of excitement for the later levels. Every 5 levels, you get to put a skill point in each corresponding tree's skills in a very linear fashion. There's really not much more to it than giving you some extra stat bonuses and occasionally a cool effect. Most of the time, one path of the tree is just so obviously better than the other that there's no point in diversifying between playthroughs. It just overall feels half baked and unfun, and in my opinion, needs a COMPLETE overhaul to even remotely feel like a finished feature.\r\n\r\nTo be clear, first half/early game feels very polished and well designed, but this formula completely falls off at a certain point and just becomes an uninspired grind fest with almost no reward. Items like the soul seeker show how terribly designed parts of this game are. The item is only good for a small portion of the game where it's not even worth grinding for since other mining equipment outclasses it very quickly. So what's the point in spending all of that time and effort searching for the forge and grinding all the bars/materials to craft it? It's just glaring BAD game design that makes 0 sense and doesn't even feel rewarding. I used the rune song for 80% of the game because I was lucky enough to find the stupidly rare structures its components spawn in very early on. I had zero reason to use any other weapon because of how easily this one outclasses everything in the game all the way up to end game. I had fun using it, but it just feels like really half assed game design especially when it's one of the very few interesting items in the game. So, looking at the worlds of difference between these two legendary weapons, you can see a major flaw in their design philosophy. You can get the rune song super early and it outclasses everything, while the soul seeker is a complete waste of time by the time you can get it. It all feels very silly and like they don't understand their own game's progression. And the funniest part - I only had fun because of the rune song and how OP it is because it made the game a bit less of a slog than the last time I had booted up a new world. Not to mention that it's one of the only well designed weapons that have a sense of uniqueness and some cool effects. Most of this game is crafting the same axe, sword, ranged weapon, etc just in a different font. This unfortunately makes the game become repetitive extremely quickly as well as proves as an example of this game not being well-designed as far as equipment goes (for the most part).\r\n\r\nOverall, I really want to like Core Keeper, but it falls flat in way too many areas to feel like a finished and entirely fun game. Around 60-70% completion, the game just completely wastes your time in so many ways that it's exhausting. Getting to that next initial wow factor kept me going to the next stage, but in the end, I realized my journey was more unsatisfying and annoying than it was fun, exciting, and challenging. I still recommend trying this game and in no way think it's terrible - it's just mid to OK at best once you've seen the bigger picture, in my opinion. When games like Terraria, tModLoader/Calamity, and Necesse exist, it's hard to say I'll ever truly want to return for more Core Keeper when the other experiences do almost everything entirely better. I see the work that has been put in, and I appreciate it. From the art, music, and general concept. With that said though, I still can't say this is an amazing game in its current state. What I can say, though, is that I think they can easily fix these design flaws with some time, effort, and maybe some design philosophy changes in the future updates. I'm excited to see what's coming in Core Keeper's future, but will not be returning until I see that the game can be a more fulfilling experience until the very end.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Overall was a good game, enjoyed it until I realised that my friend and I couldn't both work towards the legendary gear for the both of us. The fact that it was 1 item per world of each piece.... Killed it for us, unless the devs give us a tick box allowing us to both get this gear I will not be coming back",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "No hotkeys or separate slots for often used tools/consumables. You must scroll through hotbars and use items individually. \r\nYou can't use/place items directly from inventory.\r\n\r\nIt is just tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pixel art is spectacular and many of the enemies/animals are charming and cute; but, combat & skill trees are skin deep. If you like decorating and pixel art, you will have a great experience, bonus if you like bosses and exploration.\n\nMuch like terraria, items are tiered/leveled, additionally items only have so much intricacy as what's written in the description. What I thought would spice it up was the skill tree, but it consists of 4% attack speeds bonuses, or 4% damage increases, so there's nothing to look forward to except subpar unimaginative skyrim perk tree bonuses.\n\nLastly mods(As in game modifications.) aren't very active. Which is odd, since it seems like the devs have mod support.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game genuinely was fun for about 2 hours, then you realize that is what the game is going to be for the next 30 hours. They need to change the game play loop, it is dreadful. They want to be Terraria so bad. If I get killed by one more octopus arm throwing a snowball at me, I am going to lose it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Core Keeper allows any kind of spoilers on their official Discord. I joined to see the update announcements. A user posted an end of game spoiler in the general chat with no warning. Apparently that's allowed even though there is a specific channel for lore and spoilers.I have lost all interest in this game after having the ending spoiled. I feel like I was punished for showing extra interest in the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really fun til mid-game, then it gets too grindy and the progression is boring.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's just a boring game I don't know how else to explain my feelings but that.\n\nI never made it to the end of the game but it feels shallow and lacking content. I also don't like the art style for player built bases. Game is just boring to me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is boringly linear, in particular the tool upgrading system boiled down to new area -> new ore -> new ore needs the pickaxe from the previous area -> mine new ore -> make all tools using that ore -> find new area -> new ore -> new ore needs the pickaxe from previous area -> mine new ore -> and so on.\n\nAnother very linear part of the game was fighting bosses, a lot of them need a thing to summon them or optionally find them, which just prolonged the game with annoying grinding because you have to get 10 of some drop or exploration item for every boss. \n\nI'm a pretty grind resistant person and play a lot of grindy games and tend to have fun with them, however, this game was just too linear in gameplay. A bunch of my hours in the game were just miserably walking around the map trying to find a specific item to summon a boss\n\nThe farming was pretty satisfying to harvest and I did like the ranching (although not very interactive). The bosses and bossfights themselves were cool",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I wanted to like this game but it just gets more and more tedious the longer you play. They wanted to extend playtime and instead of adding anything meaningful they simply make the player grind and grind and grind. This wouldn't be a problem if they didn't put in cooldown timers that don't need to exist. I reached my end point and uninstalled when I saw the portals in game have a 10 minute timer per use. THEY ALSO PUT NO I FRAMES IN THE GAME. So if you don't dodge for a split second? instant death. Have fun walking 2000 tiles back to the boss room! This is a game with huge potential where the developers got rich, and quit.",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}