{
  "positive": [
    {
      "review": "Better than anything GameFreak has put out in the last 10 years, and it scares them.",
      "voted_up": true,
      "votes_helpful": 216
    },
    {
      "review": "This game takes what worked from other survival titles such as Ark: Survival Evolved, Conan Exiles, and The Forest and mixes them together. I don’t like calling it “Pokémon with guns,” because the game doesn’t follow a JRPG-style linear story. Instead, it’s a free-roam survival experience, despite the similar art style and creature-capture mechanics (which have been around far longer than Pokémon).\r\n\r\nThe controls are well done, and the creature progression feels fair. No Pal goes forgotten—there is always a use for each one, no matter your progression. You never feel obligated to abandon your little penguin Pal just because you’ve moved on to stronger creatures.\r\n\r\nThe world feels alive, with pockets of NPCs to visit, both friendly and… not so friendly. This helps solve the “empty hostile world” problem that many survival games struggle with. When you visit a town, you’ll see NPCs performing small tasks that make them feel less like interactive cardboard cutouts and more like background characters living their own lives. Another nice touch is the visits from random merchants, which can genuinely help the player along. It’s much better than finding a “traveling merchant” standing in the same spot on the map every time. Some of the dialogue still feels a little stilted, but honestly? We’re not here for deep engagement with NPCs we’re here for the gameplay loop.\r\n\r\nIt’s hard to review Palworld without mentioning the lawsuit by Game Freak/Nintendo. Personally, I feel the lawsuit was in poor taste, especially as it has shifted into a larger company attempting to patent things like riding an animal something humanity has been doing throughout history. Regardless, if you go into Palworld without the “Pokémon with guns” mindset, you’ll find a much more rewarding experience.",
      "voted_up": true,
      "votes_helpful": 51
    },
    {
      "review": "Palworld is stupid fun in the best way. It looks cute at first, then suddenly you’re crafting guns, catching creatures, building factories, and letting those same adorable creatures run your entire operation like overworked employees. The loop is addictive: explore, catch, build, upgrade, repeat.\n\nYeah, it’s chaotic and a bit janky at times, but honestly that’s part of the charm. Watching a tiny smiling Pal operate heavy machinery or fire a rifle never stops being entertaining. Solo or with friends, it’s one of those games where an hour turns into five without noticing.\n\nIf you want something serious and polished, skip it. If you just want to have fun, break things, and create questionable ethical decisions with cute animal-workers, this game nails it.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "I'm addicted to Palworld, and got several of my friends hooked too. Nintendo sued because Pocketpair legitimately made a better game. All of the \"patents\" Nintendo filed after the fact, are gameplay mechanics that a dozen games used even before the 1st Pokemon game was released, and that hundreds of games have used before Palworld entered early access.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Love how immersive this game is, a perfect game to play solo and chill out, this game feels like you have extra company when you have Pals alongside you, can't wait for this game to be out of Early Access and using mods gives a better experience. Don't ever give up Pocketpair!!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "This game is amazingly fun. I love playing it with my friends. This game is a must have for pokemon lovers.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "1260 hours says I love this game. Though I wish they would focus more on actual content than doing collaborations with other games since it seems to be slowing down their major updates.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Good creature collertor game.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This is an incredibly fun, addicting, and polished survival game that successfully merges crafting, base building, and most importantly monster collecting.\n\nThe open world is vast, the exploration is rewarding, and the Pal designs are charming. A small studio like pocketpair managed to deliver a large-scale, open-world experience that the dominant brand in the genre has refused to create.\n\nIt's also been unfairly targeted by corporate interests, so If you want a fresh, ambitious, and genuinely fun game that challenges the status quo, buy this now.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I enjoyed my time with Palworld. It had just enough structure and variation between working at my base, exploring, and catching Pals, throughout which I relished the fact that it all worked. It’s a game that’s pushed me to rethink what kinds of games and genres can and do fit together. At times, the game buckled under its massive scope; certain systems glitch or play like works in progress. It’s only in early access, but I can’t wait to see what’s in store for the future of Palworld.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I love this game. It's wonderful, feels fresh (bear in mind I've never played ark), and the aesthetics feel very comfy. I wish GameFreak / The Pokemon Company would stop being evil and forcing the devs to make their game worse to appease them. I'm rooting for you Pocket Pair! Defeat Goliath!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A game that completely pulls you into the world of adventures and Pals!\nCollecting and strengthening Pals, finding the right combinations, managing your base — all of it is done wonderfully. Yesterday my friend and I started playing early in the morning, and when we looked at the clock today, we were shocked at how long we’d been playing!\n\nAs for the downsides — I hope they fix the building system. It feels a bit clunky and has some flaws, plus there’s not enough variety in building parts.\n\nOverall, I definitely recommend playing Palworld! The game has tons of engaging content, and I also love the collaborations — especially with Terraria, another game that’s very dear to me.\nAmazing Game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game to play with friends or solo. Had fun through out the year and have played multiple times and enjoyed it each time. Even if its had slander or law suites it a fun game for all and would definitely recommend others to play~ ✨",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With over 600 hours in Palworld, I can confidently say this is one of the most enjoyable and addictive games I’ve played. I’ve restarted multiple times, and every new playthrough is just as exciting as the first. It never gets old to explore the world, build up my team, and fight my way through challenging areas. The sense of progression, discovery, and adventure keeps pulling me back in again and again. If you enjoy survival, exploration, and creature collecting, Palworld is absolutely worth your time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very well put together game and just fun in general with a lot of regular humor and dark humor hidden in it. The Pal catching is also very enjoyable. The modelling is great and the animations are pretty good to. Its a blast to play alone or with some friends. The game devs are also very active and updating the game periodically.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best survival game that ever built, but need to fix some bugs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely addicting and entertaining. I am really enjoying this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Palworld is a great game and it feels like the pokemon game we've been begging for but never got",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For an Open World Survival Crafter Creature Collector, which in on itself is a mouthful, Palworld is quite a good game. Battling with & against Pals of different level, size and stats as well as different attacks keeps the game interesting and entertaining. Finding NPCs with Pals to fight against is also interesting, just like fighting trainers in Pokémon. The world also feels more alive thanks to the recent updates to the game, so it's not like you're going over large distances of nothingness. Of course, having a large world that isn't completely empty does raise another problem: inventory management.\n\nPalworld operates with a limited inventory space that can be upgraded when progressing through the game, as well as a carry weight limit, which also can be increased. But having both limited inventory and a limit to how much weight one can carry does mean that one cannot carry too much of heavy stuff like metal, stone or wood, which are important materials for crafting items & base buildings, and it also limits how much different items one can have in their inventory at a time, which does include not only materials, but money, food and consumables, as well as Pal spheres. And while one can upgrade their carry limit and inventory space, it does require some rare materials for both. And that is another thing I personally find quite a bother.\n\nAs a Survival Crafter game, there's obviously a lot of materials one can obtain which are used for different things. Some materials are very common, like wood or stone, where other materials are less common, like high-quality pal oil. There are even some very rare materials that can only be obtained from specific sources, either a certain location or from certain types or species of Pals. Some crafting recipes are also very material-hungry, which does lead to material grinding which is quite bothersome. As mentioned before, there's metal which can be mined, but it is not the only \"ore\" to exist in the game. And like metal ore, all of the \"ores\" are pretty heavy and you will need a lot of ore to process to make higher-leveled equipment, make better base buildings and to repair the higher-leveled equipment. The whole progress becomes more time-consuming the further you progress in the game, and the game expects the player to just deal with it. Unless someone has found a way to make the progress less bothersome, it's going to be a pain later in the game progression.\n\nNow, there are a lot of Pals in the game, some look cool, some don't, and many remind players of Pokémon, and Pals also have different types just like Pokémon, which means that some types do more damage to other types while doing less damage to other types. However, almost every type has only one strength and two weaknesses where one is that the attack does less damage to the Pal of the same type, with fire element doing more damage and taking less damage against Grass and Ice element, and normal element having no type it does extra damage to. This simple type effectiveness chart means that against bosses you practically need the full party of 5 Pals to be of a specific type to do more damage against the boss and to survive against the boss for longer. Now that might not sound too bad to some players but I personally like some Pals more than others and would rather play Palworld with the same mindset as with Pokémon games, where I use my favorite Pokémon to play through the game. It is a shame though, that many of my favorite Pals are Dark element.\n\nStill, even after the few things that I personally find as bothersome, the game is fun and entertaining for the most part, and some of the Pals have some cool design and interesting abilities, from Pals you use to travel on land, in water or in the air to Pals that use guns to fight alongside you. And to me, being able to build a house with Japanese aesthetics is like a cherry on top.\n\nThough, I still haven't played with other people so I should try to do that at some point.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun? Yes.\r\nBadass? Yes.\r\nYou get what you see, and that's a 10/10 for me.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Palworld is, in my opinion, a near-perfect game for me.\nEven though it was created by an indie developer, it feels incredibly complete — just like how No Man’s Sky eventually became an amazing experience.\n\nPalworld contains every gameplay element I’ve always wanted:\n\nCharacter level-up and monster level-up\n\nAutomation by Pals, which is absolutely brilliant. Each Pal has unique abilities, so managing them properly is extremely satisfying\n\nWeapons ranging from basic bows to rocket launchers\n\nA huge map with various biomes to explore\n\nTaming and breeding Pals\n\nPals that actually eat and sleep (except nocturnal types), making the world feel alive and believable\n\nRaiding by land, sea, and air — flying into battle with your Pal is an incredible feeling\n\nDungeons with fully different biomes, treasure chests, rare Pals, and extremely rich mineral deposits — this system makes so much sense in a game like this\n\nFarming multiple types of crops\n\nRanching livestock that produce food and useful items\n\nMachines and production lines that require fire, electricity, water, and even ice to operate — the crafting system is truly complete\n\nPalworld is just super impressive, and it perfectly matches the type of open-world game I’ve always wanted.\n\nMost open-world games only let you ride mounts on land, and their NPCs feel stiff and lifeless — they don’t eat, don’t sleep, and don’t behave realistically.\nBut Palworld? Everything feels alive. Pals interact with the world, have needs, rest, work, and fight alongside you.\n\nFor me, this game is something special. beyond any game on the world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Definitely an enjoyable game, like Ark but with fictional dinos.\r\nA must buy in my book, and the way they treat the fans and allow both fan art of all kinds, mods included is a wonderful trait to have for it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favorite creature taming games. I hope for more updates soon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is not perfect, but it clearly has devs who are trying their hardest to deliver a good game with constant updates after listening to feedback from players. Fun crossovers, and great updates cause it to be one of my most played games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game, nice mechanichs, funny and cool creatures.\n\nStrongly recommend!\nAlso recommend that you try it out first and messa round, do shit \"wrong\" and then take a break, come back and restart for a different view",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game to scratch the monster catcher itch, but adds or improves adventuring, collecting, building, and battles compared to its aging spiritual successor. I only wish I was as nostalgic about all the creatures here as I have been for the last couple decades of established franchises. I do really like much of the designs on the catchables here, though. Nominated for Steam Awards 2025 - Labor of Love",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I know this game gets a lot of hate from weirdos and that Nintendo is fighting like hell against their company (for the stupidest reasons, really.) But in all honesty, after playing this, I can't ever go back to playing Pokemon. Palworld expanded the possibilities of what Pokemon COULD have been. They expanded it first and it's been a hit and Nintendo is scared of that. All Nintendo is doing is Copy/Pasting Pokemon to a new gen. There's never really been any ACTUAL improvements. Palworld has fulfilled that need and run with it. \n\nI love Palworld and I will continue to play it as long as it exists. It's a great game that allows me to not have to think too hard, and relax or let my mind process something else while I play it. I love it's ever-expanding world, the crossovers (I hope to see one done with Craftopia in the future, maybe?) And I hope to see the world keep growing. I also WANT TO REACH THE DANG TREE!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Dev's literally love us, its great that I can play for a bit until I get tired, and then come back in a few months and there's more content. \n\nThe learning curve on leveling character's is good in the way that it's not too tiring to level a new character once you get the hang of it.\n\nVery fun, 100% reccommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, lot's of things to do, great progression, balanced Pals, great modding support as well, devs are always working on the game and show their love for the players.\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it wasnt good when it came out, now its quite fun, has it problems though, the character creation screen is (sarcasm) the most intuitive ive ever seen (sarcasm) and i also hate the random key generator to play with friends, that is very incovenient when the connection keeps having issues which i believe is a type of sync error",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Palworld is one of those games that constantly surprises you. It looks cute at first, but once you dive in, you realize how much charm, chaos, and creativity it packs in. Exploring the world, collecting Pals, and figuring out your own way to survive ends up being way more fun than you expect. It’s vibrant, silly in the best ways, and full of little moments that make you smile. Honestly, it’s a game that just keeps pulling you back in.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "When Palworld first released, I thought it was a rip and an attempt at copying the Pokemon franchise in a shameless cashgrab... Oh how wrong I was.\r\n\r\nPalworld and its frequent free expansions have proven this game has transcended my original expectations, which self-admittedly were low. The only thing that's now \"low\" is how far Nintendo has stooped in their greedy arrogance.\r\n\r\nThis game confidently made me realise why I fell in love with monster-taming games to begin with. It's one of those magical experiences that makes you remember your love of games. From the legendary soundtrack to exploration of the beautiful landscapes to as much base customisation as you can think of, this game gets my positive review for sure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While the \"pokemon with guns\" description is a good introduction, the reality goes beyond that. A proper survival closer to Craftopia, where your pals fit in as part of the survival and production chains. If survival is not your thing, this is not the right game.\n\nBut if you wanted a good expansion on top of the survival concepts, this is a damn good game. The mesh between pal capturing, pal breeding, and the survival-crafting loop is very well executed. Plus, it gives the player a lot of toggles to tailor the experience, making it as challenging, or simple as you want it.\n\nI hope that they beat Nintendo in their lawsuit, so that they can then expand on this great base of a game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Things I enjoyed:\r\n- guns\r\n- slavery\r\n- dungeons\r\n- slavery\r\n- cute Pals\r\n- slavery\r\n- butchering said cute Pals\r\n- slavery\r\n- trafficking of said cute Pals\r\n- slavery\r\n- human trafficking\r\n- slavery\r\n- & slavery\r\n\r\nThings I did not enjoy:\r\n- the pathfinding\r\n\r\n10/10 would enslave again...\r\n\r\n\r\n\r\n...and then play Palworld.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolute trash...[b] at stopping me from playing it [/b]. All my time and effort wasted on a perfectly functioning survival crafting and progression system - a very rewarding and open-ended progression I might add. What makes this stand out from the other survival crafting games for me is the Pals helping you around the base, automating what was once time-consuming tasks. There's a type of bond you feel where you observe the little creatures you go on adventures with helping you around the house. How dare they craft a gem of a game with meat on it's bones which is still getting better to this day. I give give it a -Pal/10. The audacity of this BS game, man. Crazy work!\r\n\r\nWith that said, on a serious note, there are evidently some snags with the game which I'm pretty sure will be ironed out later. First off, I DEFINTELY want to see more housing options. What we have so far, imo, is acceptable and manageable. But it could do so much more with added variety. For example, having inverted triangle frames and half walls could so much in making creative designs for homes. Also, I honestly think there should be more foundation themes or rather, a wall paper system akin to another survival crafting game: V-Rising. Speaking of the home base, there's a problem with ranch pals phasing through the floor randomly throughout the day (in-game). I would like to see that fixed because it led to many situations where I would hop off for 20 mins or longer and the ranch pals received \"Major Injury\" and are \"Depressed\". Mildly annoying but not something I would lose sleep over, I dealt with worse with games of this genre or outside of it. Another major thing with me is the simplicity of the battle system, specifically the Pals and their move set. Now, the battle system is perfectly fine, it's actually fun! I just wish there's more variety in the pal moves department, just to shake up other than using the highest damaging attacks. Maybe something that plays to the more, unique aspects of the game such as the use of the environment, stat altering actions, and weather effects (they do have temperature mechanics and a few status effects after all.) Dogen comes to mind when thinking about interesting pal moves since this specific pal has a reflection move. Flash step (such as in Anubis's case) and Teleport Peck (Cawgnito's pal move) are what I also considered interesting, technical variations of pal abilities that they can perform. Now, in retrospect, I could understand why that is asking a bit much. The game is also a [b] survival-crafting game [/b], not a full-on action RPG game. However, if they somehow find a way to flesh out and/or incorporate a system atop of what they have right now that would allow variation in their battle system, I think it might one of the best survival crafting games for me, personally. Heck, even monster taming games period.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fight back Pocketpair!!! You have my support even thought I don't tend to play these kinds of games for long. You're keeping parts of what I love alive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An open world, survival, creature collector more akin to Ark Survival than Pokemon. The game offers a large pre made map where the most fun is had in exploring it and discovering new Pals. You build your base, craft guns, take down and capture bosses, and witness the absurd dark humour that's sprinkled here and there in the form of enslaving the Pals(or people) you've captured. Fight alongside your Pals, pet them, force them to work, and watch how lively they feel with their various animations.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is one the most addicting and entertaining gaming experiences OF ALL TIME! The progression is very balanced and feels like it's endless. The amount of different activities in Palworld is close to infinite and the masterpieces of Pal bases you can build words can not describe. I recommend everyone trying this game for at least 10 hours of basic walkthrough so you'd see all the beauty and possibilities Palworld gifts you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am really hoping this game will wil the labour of love award.\nIt is incredible to me how much effort the developers have put into this game, with as much pressure they have gotten from lawsuits by nintendo.\n\nI understand some features had to get removed, but I am hoping that they can re-introduce them.\nAwarding Palworld would just be another middle finger towards nintendo.\n\nIt is a genuinely really fun game to play especially with friends! The amounts of hours I have put in recently on a new playthrough were crazy but I just really felt like it. Still not fully done, as in I have one last region to conquer, some more player levels to gain, but I am excited to see updates bringing me back to the game eventually, until then I suppose I am breeding pals with rainbow passives! \n(Seriously the cross breeding mechanic is insane)\n\nAnd many more features that would make me want to play more, I have not tried any big servers yet (I don't quite know if there's public servers at all, I have not really checked, but with stuff like PvP in Arena I can see that being fun, ngl)\n\nThanks for this banger game, the collabs, I am thrilled to see how this game will continue to develop!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun game alone or with friends, with tons of cute critters to befriend and battle. Still needs a lot of love, exploring is fun but not the most rewarding, dungeons are nice in rewards but very samey after a while, the combat is iffy and doesn't feel great but at least late game your pal will be taking over most of the fighting, the factory gameplay is still practically non-existent (only glorified crafting tables) and that's sad to me as a factory game nerd, and base building is very wonky with not a lot of freedom of details which sucks as a base building game nerd. \n\nI still enjoy this game, and I hope it still improves, so I'm leaving it positive, but I'd recommend anyone interested to either play with friends to goof off, or wait a long while for them to work on it more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a player of a well known creature catching game serie since 2000, Palworld beats it in ways that I can not explain. They understood the essence and elevated it. If you like such games and want some freedom/sandbox, you'll love Palworld. Saying that, I am waiting for a story deeper than what we have eventually.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game that remembers the point, FUN.\n\nClearly scared Nintendo enough that they sued and forced out two specific mechanic's (throwing Pal Sphere's to Summon and using pals as gliders).\n\nThankfully Pocketpair are talented developers and the game is phenomenal, with updates that build on and refine the gameplay and throw in fun stuff because why not?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Palworld is a creature-collection survival game that mixes open-world exploration, base building, and combat with a darkly comedic tone. At its core, the loop revolves around capturing Pals, assembling a team suited for gathering, crafting, and fighting, and steadily expanding your operations across a large, resource-rich map. The blend of survival mechanics with monster-raising creates a structure that is familiar but distinct from traditional creature-collecting games.\n\nPals serve dual roles as companions and labor. Each species excels at different tasks, so efficient base management depends on assigning the right Pal to jobs such as farming, refining, mining, or guarding. Watching bases operate autonomously is a major part of the appeal, and upgrading facilities turns your settlement into a self-sustaining production chain. The automation system provides clear progression without excessive micromanagement.\n\nCombat is built around third-person shooting, melee attacks, and Pal abilities. Different Pals offer elemental powers, burst damage, or utility skills, encouraging experimentation with team compositions. Boss encounters found across the world act as difficulty spikes and offer valuable rewards. While the combat is accessible, certain encounters require preparation, proper gear, and tactical use of your Pals to succeed.\n\nExploration is broad and flexible. Biomes range from forests and deserts to snowy mountains and volcanic regions, each populated with unique Pals and resources. The variety of traversal tools—mounts, gliders, and specialized Pals—helps reduce travel time and opens new ways to navigate the environment. Discovering new zones, dungeons, and landmarks ties progression directly to exploration.\n\nThe game’s tone is intentionally absurd, contrasting cute creature designs with mechanics that allow for weapon crafting, base defense, and industrial automation. This juxtaposition is part of its identity, though some players may find the darker humor or morally ambiguous systems off-putting. Regardless, the presentation stays consistent and leans into its own eccentricity.\n\nMultiplayer expands the experience by enabling cooperative base building and exploration. Coordinated teams can tackle tougher bosses, create shared production lines, and progress more efficiently. Performance can vary depending on server setup, but the cooperative structure adds replay value and long-term engagement.\n\nPalworld succeeds by merging survival crafting, automated labor systems, and creature collection into a single loop that rewards exploration and experimentation. Its unconventional tone and flexible mechanics make it stand out within the genre, appealing to players who enjoy open-world progression driven by both personal skill and an evolving roster of creatures.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was never a fan of the poke style games, but this is a mix of several genres that is fun and addicting",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is quite literally any co op survival but with unlimited stolen ips. I played this game for about for 46 hours. I would've played it for longer if one of my friends didn't stop stealing all the cool stolen ips. 7.1/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game had good potential but kind of failed, it is way too grindy and yet the game isnt honestly worth it. However the game is cute and nice design, gameplay and story wise could have been a lot better tho.\r\n6.3/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An edgier, cooler Pokemon adapted into an ARK-like sandbox game, made by developers who actually care about it, while Nintendo seems to care more about waging a legal war *with* Palworld and performing mass amounts of mudslinging in their direction simply for being viable competition after so many years of being unchallenged than to actually make a good Pokemon game.\n\nWhile Nintendo actively fights with it's fans on everything while extorting them for everything they're worth, Pocketpair provides content updates for free, makes an entire dating sim for the funny that's also free, and actively engages with their community in a way Nintendo is far too corporate and out-of-touch to do for it's own fans.\n\nBuy this game, make a Nintendo shareholder cry.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't be a sheep and say its a copy. This is a very creative and enjoyable game with incredible replayability.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bought this purely to spite nintendo and its attempts at monopolizing the gaming industry through lawsuits, and its actually tons of fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a big fan of resource gathering, base building, and the occasional action. This game has hit all three marks. Fun to play either solo or multiplayer. Story line is there but for other people I play with is hard to read (most of them have short attention spans and ADHD). As one of them said, \"reading is for nerds\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "people constantly describe Palworld as \"pokemon with guns\" when that couldnt be further from its actual game play\r\nwhen i first started playing the thought that kept popping up was \"this is like pixelmon\" (a pokemon mincraft mod i absolutely adore(coblemon on newer versions)) but as i continued to play it finally hit me as to what the game play actually was like\r\nthe best way to actually describe this game would be a far more casual version of Conan Exile with pokemon as slaves. but even with that Palworld took the base game play of Conan Exile and dropped some of the mechanics and added improvements to them, even with a lot of the original game being changed and a lot of what this game has done has only been innovating on what other developers either dont want to touch or dont want to ACTUALLY experiment with thire IPs. Palworld took what a LOT of other devs didnt want to try and ran with it and won",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game! I had way more fun than I thought I would have! And SCREW YOU NINTENDO for your greed and legal BS toward Pal World... and your copy-cat game of Pal World sucks! I mean that with the utmost respect. Have a nice day.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Palworld is Open World but it's a strange and You can be a good person, a nasty person, or perhaps both in this blatantly harsh game that nonetheless requires effort.  yes there are some glitches in the game  but some real thought running through its core design and what i like the most about this game is capturing pals, ensuring their happiness, and raising their stats in accordance with my requirements,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Blatant rip off of a niche Japanese monster capturing game that no one has heard of. Makes me furious to see huge companies like this ripping off devs from such a smaller company.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I genuinely adore this game. Contains everything I love about Conan Exiles and ARK but just makes it far more fun. I'm a big survival game enjoyer and this is definitely ONE of my favourites",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't normally play games like this you know where you have to build things like Sims & animal crossing. I'm actually having fun playing this game & building things. I lke the battle system & the designs for the pals. The world looks amazing can't wait for the update that makes this a full game & not an early access game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than that game with the lightning mouse. Speaking from playing hours of those said game only to be disappointed by the recent switch games, Palworld still a tiny bit buggy but pocket pair is doing a pretty good job at updating the game within a year. I wish all the devs further success in the future and that they get recognized for their talents.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Literally this game existing is a massive \"fuck you\" to the big boys and I love it for that.\r\nThe game itself? Meh not worth 30 euro's in my opinion",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even though this game gets hate because it's a \"ark and pokemon copy\" the game was supprisingly refreshing. The pals all seem unique and the overall game play is mostly fun (except for the glitches) the only thing I think they could do better is adding more late game thing to do as once you enter late game you mainly just breed for optimal pals and then rank them up. But overall worth giving a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is fire. It chose to do what Nintendon't with Pokemon. I first played this game a day after launch when it was still in its most broken and glitchy state. Even then, it was still worth every penny. My only gripes with the game are that it still has some issues with the enemy AI. Other than that, it has a satisfying gameplay loop, fun combat, good progression, so many options to customize how you play and level up, and constantly receiving updates to make the game even better. I give this game a 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great open-world survival with creature capture mechanics.\n\nDensity of things to find in the world is great. Progression is broadly good, though some aspects aren't great and breeding can be a bit frustrating especially in multiplayer where bases need to be shared to reduce the industrialisation it seems to want.\n\nI would like to see more variety in endgame viability in combat. Often times there's one definitively good pal for a function, for instance why use any ice pal for combat besides Frostallion? In multiplayer it feels like that homogenises things so everyone will end up with similar teams.\n\nThere are a few irritating bugs, fortunately most are minor. (Large pals do NOT work well in bases, even if you make 2x2 openings in buildings they often clip into stairs and get stuck unable to move leading to becoming useless, starvation and major injuries.) The upcoming December update is said to be focusing on cleaning up bugs ahead of next year's 1.0 release though so hopefully some of these irritants will disappear then.\n\nThe soundtrack is awesome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "MF Pokemon with goddam guns! what the hell should i say more other than keep it the fuck away from Nintendo, or they will assfuck this game to a state where we can´t recognise it anymore. Experience fucking Pickachu with a fucking anti-tank-Rocket your self!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Every thumbs up is a vote to start calling creature collecting games Pal-likes just as a big middle finger to Nintendo",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Although it has had it's upsides and downsides, it will always be a charming and lovely game to me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. I like to rename the pals to the original pokemon because suck it, Nintendo!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At first, I thought Palworld was skating too close to Pokémon’s shadow... but after playing it, I realized it’s not a copy at all — it’s a clever rebellion against predictable game design. When major publishers are busy patenting every small mechanic, Palworld feels like a breath of freedom for players who crave creativity and risk-taking.\n\nWhat makes this game shine is how it transforms familiar ideas into something truly new. It’s not just “Pokémon with guns”... it’s an open-world survival adventure where exploration, automation, crafting, and creature companionship all blend together perfectly. Your Pals aren’t just for combat; they live with you — farming, mining, building, and fighting with genuine personality and charm.\n\nExploring the world is deeply rewarding. Each biome feels distinct... forests, snowy peaks, and deserts full of secrets and unique Pals to discover. The sense of progression is strong too — building your base from a small camp into a thriving automated settlement is surprisingly addictive. The tech tree, crafting, and automation systems give you endless goals to chase.\n\nCombat is fun and chaotic, with both melee and ranged options. It’s darkly funny at times — seeing your cute Pals wield firearms shouldn’t work, but somehow it fits perfectly. Performance is decent across most systems, though complex bases may cause small frame drops. Given the scale of what this small team achieved, it’s impressive overall.\n\nVisually, Palworld nails its aesthetic. The world feels alive, and each Pal is full of personality. The music and sound design blend beautifully with the tone of the game — calm when you explore, intense when you fight.\n\nIn short, Palworld is more than just a monster-catching game... it’s a daring experiment that actually works. It combines comfort and chaos in equal measure, turning creative risk into something unforgettable. It may still have room to grow, but it already stands as one of the freshest and boldest experiences in modern gaming.\n\nOverall: Highly recommended — a unique, addictive, and refreshingly daring take on the creature-collecting genre.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Have done at least two full playthroughs of this from a server with friends to my own world. The game was super refreshing in the monster-catching genre and was easy to sink a few hundred hours into. I keep coming back occasionally because it's a wonderful game to either min-max, or relax.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing this game since its release and it still surprises me how far this game has come despite being in early access, as they are constantly adding new content and mechanics and actively listening to the player base. I love the developers for the same reason I love games like No Man's Sky, you can tell the creators truly love gaming and are focused on making the best game they possibly can.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is first of all just a really good game\n\nbut most importantly they are sticking it to nintendo, and i will always support the little guy in these situations",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is very vaguely like pokemon, but without the corporate greed. I personally hope Pokemon Company tanks which is unfortunate because i used to be a HUGE pokemon fan. but seeing how they are trying to kneecap the entire gaming industry with patents and trying to shut this amazing game down, i've since boycotted their products entirely. i'm 100% in support of this game and it's developers! they made a great game and continue to make updates constantly even while fighting off the ridiculous legal battles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought for the pokemon with guns meme stayed for the depth of the game and the pals i made along the way.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really love this game and I can’t wait till its official release in 2026! Despite some bugs that have not been fixed yet, it runs really smoothly",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely Stunning game. Once you take the time to learn and understand.\r\nHonestly seen the hype but never had too much interest, Got the game to try it out after the new Pokemon Legends Z-A was just terrible, wanted something different. Definitely nothing close but has similar instances that replicate the joy of searching and capturing pokemon but Pals. Honestly 20/10 Devs listen to the player-base/community & it's the best way to stick it to Nintendo after the BS they be trying in they're recent lawsuits.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's pretty cool how Pocketpair can continue to update the game while being harassed buy a larger, lazier, and overall terrible and past its prime trio of companies that can only put out glitchy messes that are below the bare minimum. Some of the sabotage they were legally compelled to do are annoying to work around it's still worth coming back to every now and then when they do have a positive change with either an old save or starting over.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Breeding Simulator -> The breeding system is deep. If you love crunching numbers to get the perfect IVs and passive skills (like in gacha games), you will sink hundreds of hours here like me LMAO, and Runs great on the XBOX ROG Ally X.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Although I might not play this all that much anymore.  Yet if you have the cash or steam wallet funds you should not regret it. worth way more than any creature capture game currently on the market today.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game, Palworld, is a lot of fun for me, it is really good, it isn't done yet, but it's a lot of fun, and there is a lot to do already. I can't really say much on the game other than it is fun and I've played it a lot, but I have a specific taste for game. Let's just say, if you like open world and base building, as well as collecting creatures, you probably will like this game, despite the fighting and the like.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the few survival games I've actually enjoyed. It features an enormous map with much to explore and many pals to collect. However, one complaint I have is that the gameplay becomes repetitive if you grind for the best pals and equipment. This can be monotonous at times, but I've still enjoyed the gameplay loop.\n\nOverall, I highly recommend giving Palworld a try and look forward to future updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lovely survival game about catching monsters and making them work for profit. It can be a bit tedious with how many resources you need to collect but there's a lot of stuff to do in the meantime. And no I'm not weird because I have a base full of Lovanders you are weird for judging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would HIGHLY recommend this game if you are looking for a laid back, adventurous, and beautiful game!! The possibilities are endless! From base building, catching and training pals, to flying around to different places on the HUGE map!! You can also do boss fights! This game is very well made and has beautiful graphics! Definitely recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solo it's just ok, with friends it's amazing. 100 times better than pokemon slops",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall an amazing game! Great combination of mechanics. Settings allow you to tailor the difficulty and preferences for a wide range of levels of ease or challenge. Developers are great at communicating and keeping their word. Good pace of updates, additions, and bug fixes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am in love with this game. It's so immersive and easy to get lost in this game and spend hours playing. The only things I wish were a build mode where you can build multiple things at once and then edit (specifically for building structures) and multiplayer game being explained better. This game is great for the money and I look forward to seeing how much better it gets !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically what you'd get if pokemon continually steped outside of their comfort zone a little bit more with each release over the years. Very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't think of any deep analysis to say really.\r\n\r\nIt's just a competently produced indie survival game with capsule creatures. Simplistic but surprisingly unexpected colony management mechanics (sort of akin to 'Necesse').\r\n\r\nOnly real negatives come from optimization & graphical glitches due to Unreal Engine shenanagains.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game. I enjoy exploring the open world and learning new ways to utilize pals.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Palworld blends creature collecting, survival, and base building in a way that feels fresh and enjoyable. The world is lively, the Pals are useful and unique, and the mix of combat, exploration, and automation keeps the gameplay engaging.\n\nEven in active development, the game is stable and constantly improving. If you enjoy open-world crafting and managing your own team of creatures, Palworld is an easy recommendation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun, alot to do, lots of variety and Pals to catch, breed. Love the building and fighting too. Fishing is a great new addition as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun easy to start a base a lot of things to do and every level is something new you also need to explore to get stuff so its fun breading is one of my favourite things about the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, and its one of my favorites. Love playing with friends and family. Catch Pals and explore the world. Build and customize your bases. There are quests now and new bosses. Its a go to for me to play and connect with people that are far from me in real life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Palworld is a addicting game. First time I played for 11 hours straight. love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, even though there are some \"similarities\" between this and the other (which I do also enjoy) I loved the base building and open world exploration. The real journey was the Pals we enslaved along the way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'ma keep it a stack with you its just monsters with guns. Not much better than that, better than anything gamefreak has done in the past 10 years.\nAs a long time fan of gamefreak titles this blows 90% of the crap they made in the past 10 years, and its not even done improving",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have too many hours in this game. Combining monster taming with dungeon crawling and survival elements is my Kryptonite. The building mechanics are clunky and often frustrating, and once you get guns, the game's difficulty drops, but all in all, it's a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game Rocks, and i am happy that it got so big, Pocket Pair keep up the good work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like base building survival games?  Then you'll like this.\r\n\r\nDon't like base building survival games?  You'll probably still like this.  Very cutesy, very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is kill capture build defeat and repeat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Palworld is a magnificent blend of monster collecting and survival crafting. It offers a massive, fun world to explore where your captured creatures (Pals) are not just fighters, but also essential workers for your base.\n\nThe base building is satisfying, the exploration is rewarding, and the ability to fight alongside your Pals with varied gear adds an exciting tactical edge. It's ambitious, often hilarious, and immensely addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awsome game, really addicting. The gameplay loop is something I know alot of people have been waiting for (well not anymore, since Palworld has benn out for a while).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if u want to farm and build an empire while cute monsters shoot RPGs at your enemies. this game is for you",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Focus less on crossovers with other games and more on making your own game more fleshed out.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "After a lot of play, I can’t recommend this game. It isn’t outright terrible, but the sheer number of bugs and balance problems hold it back from being what it could be.\r\n\r\nPAL abilities are often costly but useless, and PALs swap setups whenever they level. Passive bonuses are far too random, frequently rolling on PALs that can’t even use them. Some PALs feel like they had no effort put into their design at all, while others are very well made, which makes the inconsistency stand out even more. Player gear durability also drains far too quickly, adding another layer of frustration to progression.\r\n\r\nThe AI is a mess. PALs in the base sometimes get stuck and starve for unknown reasons, repeat pointless actions, swap tasks without reason, and at times refuse to engage because they endlessly spam the dodge move instead of fighting. They sometimes stay locked on distant foes instead of the ones right next to them, wasting time and leaving you exposed. Defensive abilities are used with no purpose, sometimes even to initiate combat against non‑alerted or non‑hostile PALs.\r\n\r\nLeveling up itself isn’t too bad, but overall progression can’t keep pace, and while new areas may look different, they rarely add anything fresh to the gameplay beyond appearances. Finding new PALs can be exciting, but there aren’t enough stats exposed to the player to understand what differences swapping around actually makes. It becomes hard to know the optimal path forward, and eventually you’re forced into leveling new PALs just to keep up. With limited storage and only five PAL team slots to use when out and about, this quickly becomes a nightmare. PALs barely gain experience while working in base, so you have to bring them with you to level, or use consumable items that can be farmed very slowly — but doing this for dozens or even hundreds of PALs is not viable. Re‑catching them instead feels dumb and highlights the gaps in game design. This is more tedious than fun.\r\n\r\nAt higher levels, progression becomes extremely frustrating. You may reach higher levels, but you can’t get what you need because resources stop keeping pace with player effort. The game seems designed around the expectation of having more allies, yet there’s no option to compensate for solo play. Gathering certain resources requires many hands, and PALs simply can’t keep up, making late‑game play a slog.\r\n\r\nBase building isn’t the worst, but it is heavily restricted with odd space requirements and strange placement limitations. Resource gathering is uneven. Some low‑tier resources are harder to get than they should be, yet you need far more of them than is reasonable, and not all can be auto‑gathered by PALs. Inventory management is another chore: too many items, no auto‑deposit features, and the need for hundreds of chests just to store everything. Like in many other games, there’s no thought given to where the abundance of items introduced should actually go. I don’t understand why there need to be so many items without at least allowing conversion or consolidation.\r\n\r\nPlaying with a few people on a dedicated server might improve the experience, but solo play feels stagnant even after a year’s break. New PAL introductions don’t help when balance and functionality remain broken.\r\n\r\nThere’s potential here, but polish is sorely lacking. I know this is early access, yet the game has been around for a long time already, and most titles don’t change much between early access and release. I doubt there will be meaningful improvement, though I suppose time will tell.\r\n\r\nMy thumbs down isn’t because the game is unplayable — it can be fun for a while. But the mountain of issues builds frustration until the fun is gone. Worse, you end up playing more simply because the time you’ve already invested makes you reluctant to abandon progress. That’s why I can’t give it a thumbs up. In the end, it’s a frustrating mess of a game as it stands.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "this game commits the gaming sin of being able to disconnect you from a single player game cause of server issues, I'm not on a server how did I lose connection to my offline game? HOSTED ON MY OWN COMPUTER!?!?!??!??, I want to recommend this game cause minus the building system making me want to take an axe to my head it's hilarious and fun but that one issue is just an immediate minus 5k points in my mind",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game kicked off a new genre of open world games i think, while the idea is good most games of this type fall short in the amount of content. most games of this type seem in depth at the start but after playing for more than 8 hours you quickly find that these kinds of games are super shallow",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "On Steam Deck, if you choose to use mouse and keyboard controls the game only registers a controller. And while PC inputs work in GAMEPLAY, many of the prompts are for a controller, and the game prevents you from editing keyboard controls which means I can't rebind the pal sphere throw key to something less annoyingly easy to press by accident.\n\nFIX THIS PLEASE!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wanted to love it, but I quickly lost it. I'm probably not the target audience, even though I really liked the game with a similar atmosphere that everyone knows when I was a kid. I don't rule out that I'll love this game someday, but overall, it's a disappointment for me. No, it's not necessarily because the game is bad, it's just probably not for me. Although there's more playtime than I showed on Steam, it's still very little. If my opinion of the game is due to the little time I've played it, you can consider it null and void, but I still think that about 3-4 hours is enough for a game of this kind to grab the player. Unfortunately, this title hasn't managed to do that yet.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has horrible disconnects for co-op both server and client on the code connect. I've reported it many times. I hope they can get their shit figured out because otherwise I just love this game. It's quirky and funny. It would be great if you could stay connected with your friends for more than 3 seconds at a time. Please figure it out Pocket Pal!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to leave a review here hoping that Palworld devs will see it and address my complaints. I would also like to add a disclaimer that Palworld is by no means a bad game; it is very fun and by all rights deserves all of the positive reviews it receives.\n\nWhy, then, am I leaving this negative review? Well, it's because Palworld is a negative experience specifically for me. I started playing the game in early access, and ultimately I never managed to get very far because my favorite aspect of the game--base building--is very broken, flawed, and inconvenient.\n\nI'm going to start with the most severe flaw, in my opinion. The basics are all there and decent, but the problems arise when evaluated in combination with other systems. Specifically, pathing for Pals. Pals simply do not understand how to navigate bases, and this puts severe restrictions on a player's ability to creatively design the exact kind of base that they want to have because it comes into competition with practicality. Want a cliff base? Well, be ready for most of your Pals not to be able to access much of your base due to their inability to path to different floors of a base. Even a base that is on a cliff that extends down to the base of the cliff faces problems because unless there is a natural (not player-placed) path between the levels, the pals get stuck\n\nI think I figured out the problem and it's simply that pals only really recognize terrain that isn't player created. Sure, they can stand on and in some capacity interact with player-built platforms and stairs, but for all intents and purposes they do not see them as viable paths for getting from one place to another. This essentially means that the only practical way of building a base is on perfectly flat terrain, and that sucks.\n\nMy second complaint is more of a quality of life one--would it be too much to ask for a streamlined and simplified method of replacing existing walls and floors with the upgraded tier of them? Maybe this already exists in the game as some sort of upgrade that I never managed to reach, but I don't think so. Please, just let us overlap old floors with new ones and place the new ones. Ideally we would reclaim the old resources, but honestly I don't even care if we did. The problem with the system not being this way already is when it comes to needing to replace foundation/\"load-bearing\" platforms or anything with crafting interfaces on top of them; you have to manually destroy and rebuild absolutely everything. When combined with the fact that (as I mentioned in my last complaint) pals can't always reach places in your base if it is comprised of different levels, and this becomes a very time-consuming and annoying process.\n\nBasically, the base-building needs better integration with the Pal pathing and better optimization and quality-of-life injected into it. I hate to leave a negative review over these very specific and isolated issues, but the fact is that base-building is a very major part of the game and one of the parts that would otherwise have been my favorite thing to engage with. When I played the game over a year ago in early access I had hoped that these issues would just naturally get resolved in a series of patches, but after having returned to the game and none of these issues having been addressed it left me with concerns. Genuinely, and not hyperbolizing here, it kills my desire to play the game. I've owned this game for over a year, I WANT to love this game (and genuinely do love a lot of it), but my playtime is a testament to the fact that it's just impossible for me, personally, to get over these problems.\n\nI know the lawsuits with Nintendo have likely taken a lot of time and attention away from what could have been used improving the game, so I hope that anyone reading this takes this review with a grain of salt, especially the developers. I'm leaving it because these problems do affect my enjoyment enough to ruin the game for me (which to me warrants a subjectively placed negative review) and because I know that negative reviews often receive attention better than buried forum posts do. I'll definitely update my review if major improvements are ever implemented into the base-building aspects of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is decent but its a pretty demotivational experience leveling up to 20 or so in an official server, trying to place a palbox to have a base somewhere, and being told over and over that the server is at max bases, logging in again the following day and being told the same thing, etc, not being able to make a base and continue playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent about 10hrs total reinstalling game, uninstalling game, deleting all files associated with Palworld, verifying integrity of files, running Palworld/ShippingPalworld exe in administrator mode, restarting pc, restarting router, etc.\n\nNothing fixed the EOS error I kept getting that prevented me from playing multiplayer or even clicking the join multiplayer button, it wouldn't even let me create a world with multiplayer enabled.\n\nMy friend, the genius that he is, told me to download Vortex.\nIt automatically installed TWO mods, UE4SS + Unreal Pak Tool\n\nI don't expect my review to affect a game with overwhelmingly positive reviews, but needing to download a mod manager just to finally access multiplayer is unacceptable.\n\nUpdate: I can now start the game without the mod manager and access multiplayer.\nI have no clue what the mod manager changed, I don't feel like I have an answer as to why any of this happened, and the only stuff I can find online is for issues that happened 2yrs ago, none of which helped before the mod manager suggestion.\n\nI'll give a positive review after I've played enough that I'm certain the issue isn't persisting, otherwise just assume the error keeps happening every now and then.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing good since Feybreak\nWhens the next major island? \n1.0 better not just be the 2nd and only major land",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is essentially unprogressable as a solo player after level 50. The moonflower tower boss is unbeatable even with custom settings increasing my damage rate and reducing the bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game gets too grindy towards the end it was fun but the game sucks all the fun out of it towards the end game. Baby sitting your Palls is not fun! undodgeable attacks, attacks that go through walls or cover.  some moves have strong aim assist and strong tracking.  0 hand holding or explanations on back story or plot story. \r\n\r\nIf you want Punishment Then maybe this is for You. your spend more time in base prepping than exploring!  \r\n\r\n6/10 strong start bad finish !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disclaimer: I only played solo and tweaked default settings to be a little less grindy and punishing for no reason.\nTL;DR: 4/10 unless you enjoy grinding, then it's 6/10\n\nGame starts fine, you get to next techs pretty fast but then you discover areas with higher level brackets and get completely stomped by aggressive spawns and little to no fast travel points. And then the need to grind hits you. At first, it can and should be automated, only requiring manual intervention once in a while to gather small amounts of non-automatable resources. Automation itself is a bit of a pain because buildings that produce resources suck at first and you have to find one of the like 3 locations with good amount of natural deposits. Then you unlock 3rd tier of material and it requires resource that can't be automated up until you basically get to the next tier. This material also allows to make actual guns and they suck! Every bullet is made using manual labor to gather 2 different resources and 3-step process to make just a bit of ammo painfully slowly. To unlock full ammo automation you basically have to finish the game, or at least, what was originally the game. For a \"Pokemon with guns\" the gun part is too expensive. Then one of the \"endgame\" materials has a straight-up non-automatable component. This also appears to be the theme of expansions, new resources require you to either run around vast and mostly empty locations, avoiding unneccessary fights as they slow you down, and gathering required resources, or sit on the base and breed and butcher ONE species of pal. Good thing relevant ammo can be automated, right? Nope, there's only grind in the endgame. I played until level 47 and got tired of doing the same dungeons to gather just a bit of resources.\n\nVenting is mostly over, now for the review part. \n\nGraphics are okay-ish, you find visibly stretched terrain textures basically everywhere outside of roads. \n\nSound exists and works, no complaints here.\n\nOptimization is inconsistent. Open world with baked lighting works fine but as soon as dynamic lighting gets involved, things get laggy. Don't even try to illuminate the room you frequently visit unless you want as frequent FPS drops, use natural lighting instead. Otherwise, the game runs fine even when using AoE attacks on large groups of enemies.\n\nPal designs are decent, older ones are \"reimagined\" Pokemon designs and there're like 2 pal designs I genuinlny like, newer ones are better but I haven't seen them much due to new locations being behind grind walls. \n\nHuman enemies are pointless, feel the same and the only lore behind them are 100+ damn notes that i'm not going to collect, we're not in Slenderman. Human interactable NPCs exist but usually for single function, be it a single quest, a trickle of free resources, a pointless phrase, or a shop.\n\nLocation difficulties vary wildly, you can have \"starting\" zone border engame death forest with the same pals, just 40 (out of 60 total) levels higher. Same goes for occasional NPC bases, how about a random endgame base where you'd get oneshot situated in the middle of second level bracket zone?\n\nBase building is bad. There might be a bunch of decorations but you can't make a non-prismatic structure at all, there aren't even corner roof pieces! Building restrictions are inconsistent, you might be able to place structures one way, but not vice versa. Doors straight up suck. Moving with grappling hook is faster anyway and doors only obstruct your path...\n\nPal automation is underwhelming. Job priority is non-sensical, they switch between tasks uncontrollably, bug out during pathfinding, only eat until they have 50% of satiety when they hit <50% statiety and if you use cheap food - too bad, they will go eating every 30 seconds until you install a mod to fix it or switch to a more grindy food that expires quickly by the way. Full automation is impossible because you can't automate task creation or even do it remotely.\n\nSurvival aspect is basically non-existent, it's actualy hard to find yourself in a forced death situation in the open world once you get your mobility options a few hours into the game. NPC base assaults are a slog, half of the enemy attacks ignore walls, your pals have a non-zero chance to get stuck and die inside the cramped buildings. Non-\"raid\" bosses are huge damage sponges with a time limit. I don't know how AI chooses targets but they usually focus me, and if they focus my pal - it dies in under a minute. Haven't tried \"raid\" bosses but those have even higher hp and are supposed to be killed using your base defences.\n\nExploration part is mostly fine, until you get to mountain zones. Most locations are empty outside of a few trees, rocks and the same copy-paste minor vegetations but mountains are even emptier, having fewer rewards and a wall on the side of your screen. Sometimes distant islands show up as unshaded PNGs intead of foggy shaded ones, scaring you in the dark by, for example, a bunch of bright ice.\n\nPal combat AI sucks, they can start attacking unreachable enemies, ignoring ones right in front of them and using the command menu requires you to stand in place for several seconds, while there are a dozen of projectiles aimed straight in your face.\n\nEndgame balance is something I don't understand. You're supposed to breed your pals to pass down passives you want but I haven't tried it, instead using the ones I caught and proceed to lose my pals every time they get focused (compared to early game when they can tank for you). You can't predict damage attack can deal based on \"power\" alone, sometimes this includes collision shenanigans. It seems \"power\" only shows damage potential of a single damage tick and amount of those can vary between 1 and BEAM(several tens). Beams are just heavens above anything else, especially if used by you while riding your pal because they can actually be aimed during attack animation, unlike when AI uses them. Also endgame NPC bases can have several beam users inside at once so if you lag for a few seconds your pal dies. The concept of \"higher damage - longer cooldown\" sucks. You are forced to juggle your pals for consistent damage output since endgame skills have cooldowns of about a minute.\n\nOverall, a decent grinding game but progression slows down significantly as you approach endgame. I don't think it's worth the money or the time you spend doing dungeons to craft another 5 magazines for your assault rifle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes constantly. especially at key moments like right after you beat a boss and you lose everything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Last update broke the game, i can't load it. \n\nThe game itself it's good. I do have a lot of problems with the UI, but I have enjoyed it so far. It got a little better once i discovered that i could change the world settings to tweak it quite a bit.\n\nBut i wanted to play today and i cant even launch it cuz it crashes.\n\nI hate the Nightstar sands, Chromite and Coralum Ore because all three had the same problem, you need them in quantities to craft things, but there is nothing you can do to automate them. Chromite is the worst because you need the Metal Detector and going around until a place \"to dig\" appears. At least the sands are easy to spot at night.\nAnd the Coralum is a paing to farm... So much base building for automation to be stuck with items like this that are awful to find.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game just randomly boots you back to the title screen sometimes.\n\nFix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels sloppily made, guess it can be fun with friends but nothing for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Complete hot sewage of a game. Which is a shame cause it has a lot potential and can be fun, if the hitboxes weren't complete garbage, the path-finding actually found something for once, the AI doesn't hyper focus on one player the entire boss fight and the terrain wasn't like walking on oil half the time or getting stuck on tiny lips on stairs etc. \r\n\r\nTry fixing these basic things before collaborating :3",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is absolute bad dont recomend to anyone with life go get minecraft instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Animal cruelty, Human Traffic rings and Slavery what a game!!!! fucking pokemon rip off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What to say... where to start... hmm... I guess the deciding factor that made me huck this game into the garbage was the concerning amount of slavery and animal abuse topics that this game just continues to make the core part of gameplay. I was iffy at first, but after they added a machine to FORCE CREATURES INTO CONCENTRATION CAMPS, I decided my worries were indeed well founded.\n\nI'm personally against animal cruelty, not to mention against Hitler in general... and this game really makes me scared of where humanity is headed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game was good but now I cannot get on a network error has occurred. the multiplayer feature is currently unavailable. error:  EOS login timeout.  Tried everything to correct and still nothing. Another player on a different computer same network no issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This a good game with great idea (thank you nintendo). But implementation  of various features is just a disaster, UI + interaction mechanics is a good for student level of work,  i can't name even a single feature/mechanics which works like it should, interaction with storage, palls, riding, everything is choppy and i have no feeling if i press something will work in 100% of cases. Riding is awkward,  even single stone on the ground can be a serious barrier for your ground pall. Flying and interacting with objects on jetdragon feels slippery af. Base elements are just huge   for that base size, some pals like dragons are just toooo big. This is a  good idea but need serious optimizations for performance and gameplay, Using rocket barrage while riding a jetdragon instantly throw my 7900xtx into the power wattage limits, and that's just horrible for a skill especially with so low dmg",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is super buggy for the amount of hype it gets. Ended up returning it which was a first for me. Couldn't suggest paying $30 for this. Also it didn't try very hard with its \"original\" characters...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I never had any interest in this video game to begin with I only have the game because a friend wanted me to play the game I would not stop talking about the game\r\n\r\nSo pale world could be a good video game however I never had any interest in the video game at all so my reviews probably not a fair review to the game it's self.\r\n\r\n In all from what LITTLE TIME I played the game i just couldn't get in to the game\r\nAgain the game just could not catch my interest at all i may give the game a try again later on down the line but that remains  to be seen unfortunately  as it is now ima say it's highly unlikely I will press play on this game again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is awesome but the disgusting bug that perma kicks u from server for 0 its lowkey ruining it, once they fix it its an amazing game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game doesnt have a single original bone in its body. Not recommended because I bounced off of it pretty hard but your enjoyment on this will basically depend on how much you like Ark Survival Evolved",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is not worth playing. As a new player, you'll quickly find out when joining an official server that all palworld bases/server is full. You either join a guild, or kick rocks. I tried every official server and still got that message when attempting to build my base.\n\nThe devs can initiate a simple fix by limiting the amount of bases a guild and solo players can have, but they don't. The base decay is also extremely long, so you're just a sitting duck until then. It's a fun game, but the lack of base building due to dev's crap coding makes this game unplayable. Don't buy until it leaves Early Access.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Would've recommended in its honeymoon phase but the main priority shifted from being this fun, unique standalone survival game with Pal elements to a cesspool of collaborations I have zero interest, want or need for.   Game just needed better Pal controls to actually control the attacks/dodges of your team but instead its more bloat from other desperately dying franchises hoping for crossover traffic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just buy Pokemon Z/A it's better and this game just copies pokemon without creativity",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "got fucked over by the game mechanics and it ruined my game.    i spent 8 hours gathering shit for a boss battle and  then 7/8 from being done it timed out the boss and kicked me out of the tower.   unimpressed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game frankly sucks. Its not the worst game ever made but it does nothing well. The problems with Palworld stem primarily from the things that also make the game unique. Which in its defense may still appeal to certain people.\r\n\r\n[h1] Combat [/h1]\r\n\r\nThe combat is shit and anything difficult will be spent watching your party of indestructible pals whittle down the \"boss\" you're fighting slowly. This is even on level or close level. Like 1 or 2 numbers close. You the \"trainer\" will do next to no damage and your pals will do most of it. This sounds fine. You can even saddle up and ride/control alot of Pals. Sounds cool and at sometimes it seems like it. However in their infinite wisdom even while mounted you still can and WILL take full damage from any attacks. This means in any sort of scenario where you arent overleveled what youre fighting then Mounting for combat is not an option or an extremely limited one.\r\n\r\n[h1] Survival [/h1]\r\nThe survival aspect is basic or run of the mill for the genre. Farm food, cook meat from Pals, generic shit. There is buff foods but buff foods are never worth the effort. 10% bonuses for limited times from ingrediants you cant farm without work for such a small bonus. The large brunt of it is just farming thousands of berries for yourself and pals. Which you can do like 30 minutes in and will never stop doing ever.\r\n\r\n[h1] Experience Gain and why it makes the game MUCH worse [/h1]\r\n\r\nThis shit is AIDS. This game is UNPLAYABLE at standard XP values and only after bumping it to x5 more XP gain does it feel more natural. The issues with XP is multifaceted. \r\n\r\nTechnology points is a terrible system. It only makes the game worse. You see when you level up you gain Tech points which you can use to grab new Techs to craft and progress the game. In a normal game you just find the mats and make the items. The problem here is this includes Vanity objects and Main Progression items costing the SAME POINTS. Hell even not mandatory items but things that may be unique and interesting but not Mandatory. What does this mean? It means you are generally not allowed any experimentation or allowed to take ANY vanity items whatsoever. Like making your base pretty with baths, shelfs, a cool bar, Barrels, etc? LMAO fuck you loser. Leveling takes forever so enjoy wasting your time on vanity.\r\n\r\nSkill points on level up. This is also just retarded. It sounds nice in theroy to \"Oh do I upgrade HP and Stamina or my carrying capacity?\". Except yet again theres armor for this shit. You could make more bags for this. Extra stamina items. Oh wait you CANT because of the dumbass TECHNOLOGY POINTS. The problem I have is the illusion of choice. XP in this genre is more normal then it isnt however its typically more general or is used as a currency. The retarded \"kinda\" skill point system just doesnt work.\r\n\r\n[h1] Crafting and the Pal Dilemma [/h1]\r\n\r\nIm bundling these because they go hand and hand with each other. This game is a grind and not a fun one. Every task that Pal's perform (which is \"automation\") is made excessively large to account for the Pals. You see in a NORMAL game you'd gather lets say 2-10 Ores for a specific item depending on its function. In Palworld? 50 seems to be the standard. Everything needs 50 ores. Even consumable items of disposable quality like low damage arrows or Palballs require a couple ores or 2. Then of course naturally everything takes time to craft. Even with help itll still take longer then other games in the genre to make. You constantly get the assitance of dozens of pals helping you do everything yet most of the game is still just twittling your thumbs doing nothing because of the MASSIVE amount of resources literally everything takes. Its absurd.\r\n\r\n[h1] Closing thoughts [/h1]\r\nGame's shit. Pal's take away combat urgency and make combat dull and boring. Pal's are required to make unplayable crafting times into slow crafting times. There is some cool designs in here and crafting a new saddle for a new pal is probably the only times the game REALLY feels fun. However automating thousands of background things incedibly slowly while you desperately find something to waste your time. Its just ASS.\r\n\r\nAlso never play this solo. You'll want to blow your brains out. Even in Co-Op its so hard to enjoy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only reason this game is loved is because Nintendo doesn't have the balls to make a game in this genre. Creatively desolate slop game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "we are 2 years in and performance still feels like release day. servers with 5 server-side FPS on average and community servers with 10-25 average server side fps, Disgusting barely functional server browsers, minimal content updates, \"Jank\", rubberbanding and terrible animations..\n\nGenuinely other than getting sued what are they doing at all with this game?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I bought this game because I love Pokemon and like to explore vast worlds with lots of opportunities and being able to make Pals work alongside you too.\n\nAt first I was very excited to try a game that is inspired by Pokemon and has a large area to explore but something felt off and I couldn't pin point why.\n\nI bought the game for £25 and started it, set a timer for 1 hour and 20 mins so incase I did not enjoy it I would issue a refund to Steam.\n\nFirst off I want to say that this is not to discredit the effort and dedication of the developers of Palworld and I am intrigued about the exploration and personalities the pals have according to what people have stated on YouTube.\n\nMy reason as to why I am leaving a negative review is simply because the game would be a few hours of fighting and trying to find your way around the story with no clear guidance except a sidebar and a small navigation icon in the top middle of your screen.\n\nI feel as if the developers have tried to mash together a mix of Shooting, Monster Hunting/Catching like in Pokèmon and Monster Hunter Wilds, alongside a supposed alleged boss tower similar to Miitopia's Tower of Hell in functionality.\n\nThe replayability of shooting with guns at a boss and finding pals just to do work for you and you to go find the resources again (micro managing) feels very mundane and I honestly dont see myself spending hours and hours just to fight a boss, win or faint and then do the same thing again and again you know?\n\nLet alone the fact the devs are focusing on other games like Craftopia and Palworld with Farming (which should just be a feature in Palworld itself instead of a fully fledged game) considering the fact that Palworld has become popular with a lot of sales overnight and in the span of a week that Nintendo is even taking action with a lawsuit is baffling to make me think that instead of spending more and more time in improving the new player experience and how to actually progress in the story and not feel bored after defeating a few bosses or the limited availability in customising your base and character would be helpful to us as a community and the developers in its impressions.\n\nThank you for the time spending to read this review and I am looking forward to seeing the new upcoming  content release next year but my thoughts still stand and this is more of a awareness incase anybody else feels the same way.\n\nLastly, credits to the guy that spent a long time writing his review that influenced me to refund the game after finding out why because of his reasons and feelings himself.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I keep uninstalling when ever I go to the feybreak area. The pals aren't and issue its the beserkers (rocket launcher guys). They one shot any pal, I don't know what the point is of having and enemy that one shots monsters in a monster catching game. They are also super tanking unloaded and entire ariel missle pod from my jetdragon and he didn't care. Its bad enough how tanky and hard hitting any of the human npcs are in feybreak. I don't know why this choice was made but I find it to be super annoying and no longer worth my time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "'The greatest game ever made' offering a glorious monster-taming and base-building. And then, Day 3-4 dawns, an endless, soulless grind starts. The entire gameplay loop is down to hitting rocks to get resources, to build spheres, to catch new Pals... so they can hit more rocks for you. The \"major updates\" like Sakurajima and Feybreak have done nothing to fix this, only adding new islands with new, slightly different-colored rocks to hit. In the nearly two years since launch, the fundamental problem remains.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If Pokemon fans ever got a game from a good studio, it would make one-trillion dollars. Until then, this is as good as it gets (somehow)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, you can listen to all the nintendo hate gooners who are satisfied byt not much even tho that's what they complain about! This game is bad in many ways! The only thing it did is stole a bunch of assets from other genre and put all of it in a unpolished fashion. If you take it all appart, this is NOT a good survival game, this is NOT a good shooter, this is NOT a good RPG, this is NOT a good creature catching game, etc. The only thing that people say when trying to sell it is ''Screw Nintendo'' saying they produce unpolished games. They live solely to f with nintendo and gamefreak at this point, and the game is still the same bad thing it was a year ago, and it's still in early access!!! And what do they do??? Announce another spin off to compete with pokopia!!! They are unprofessional at best, and like I said, live solely on their hate toward nintendo and gamefreak, and their fanbase who's the conspiracy theory type just tryna find somewhere to belong to and be toxic! The pals are unoriginal and so many of them are just recolors!!! The game is one hell of a grind, the kind of game you think about logging in then remember how much your base and your progression needs time and maintenance! Many things are unbalanced and just never used cause it's just SO BAD!!! For performances we've seen it all, had so much fun having to remove pals from boxes over and over and over so that they do what they are suppose to!! I'm being toxic??? Well kinda got sick of hearing people praying upon this game with no real arguments other than ''better than anything Gamefreak ever did'' when it's far from reality!! I got sick of people gaslighting others that this game is a MASTERPIECE!!!!! This game is bad and unpolished, I had more things to do in RDR2O and it was less grindy! But oh hey!!!! You can make silly characters, shoot pals, say this is the best game to never play it past 10-12 hours playtime!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun but still needs work and QoL in some areas for sure..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels a little too stale, combat wasn't as engaging as I hoped it would be.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes on a constant. Waste of time and money. Optimize the fking game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't know if I enjoy this game. I get disconnected from my own single player so often I don't get enough time to do anything in base or explore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So much love on how they copy everything from everyone lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "black fucking screen and nothing is fixing it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game keeps crashing no matter what i do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just boring and not very good",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lost my girl but you know what they say horses dont stop they keep going",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is not working anymore or blocked from steam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "servers stay crashing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Super Good! i really love it 8/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hardest game ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fucking world woant loade",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its not fun :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Over promised and under delivered.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the most lazy pokemon ripoff ever",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its just Ark, if you like Ark you might like this, if you don't, you won't",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "love it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LAGGY AND NOT VERY GOOD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game SUCKS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dont like it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Garbage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "|",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, the only thing that really irks me about this game is seeing how much progress has been made - and yet, some very basic and fundamental game mechanics have been disregarded for so long that I wouldn't recommend it. Now, hear me out please before the insane stans bombard me with clown awards. Palworld is fun. It's a good game. But the atrocious AI, god awful pathing and navmesh issues, and crazy clipping bugs will have you tearing your hair out. Especially towards the end game content. \r\n\r\nFor example, I tend to play everything on very difficult settings. Often with permadeath. It isn't even fathomable to try with Palworld. Your pal will frequently run straight by enemies in order to chase down some random ass guy who somehow, despite being on the complete opposite side of the POI and stuck running into a wall, has drawn aggro. They will prioritize aggro'd units and there is currently no way to command or micromanage your pals. If they can even go chase them down. More likely they'll get caught on a corner or some stairs or just flat out be summoned and then not move. Because that's how fucked the pathing and AI is. And since it's end game content, maybe that random ass guy will summon a little tocotoco bird who will, through multiple floors and walls, hyper beam your ass into oblivion. And sure, you can often easily cheese content as well, blasting people through walls and rooftops with aoe skills. But that isn't fun or challenging. It's tedious, and there is only so much dopamine to be had by watching numbers go up.\r\n\r\nAnd so the novelty of exploring quickly wears off when you realize the chests, the eggs, they're just filler. It's a landscape filled with distraction more than anything. And so the immersion wears off and the zip from point A to B begins. And then the novelty of your pals wears off as you realize, your choices are pretty moot. There's a bit of preference and then there's the end game pals which you can easily get to with the first chicken and lamb that you pick up. And you'll just need them to keep doing end game content. Or, you turn the difficulty up and spend days if not weeks breeding, not because you enjoy making the numbers go up at this point but because you need too. And there's no novelty to be had with achieving the next tier of gear either, since the game rushes you through the first ~40 levels (out of 60). You'll basically be starting at metal/refined metal and it doesn't change after that.\r\n\r\nMy point is, the longevity of the game is entirely forced and artificial at this point. The balance isn't there. It's exciting and easily hooks you in the beginning because at it's core concept, Palworld is a very fun and addicting game. And if you decide to buy it I'm sure you will have fun and mostly have a net gain on the entertainment/frustration scale. But it is alarming to me that the most basic game mechanics have not been improved in nearly 2 years since it's release to EA. It is frustrating that due to the lawsuit, a huge piece of the game was hamstringed, but even more so that they haven't done ANYTHING to replace it. \r\n\r\nOh and also, mandatory aim assist? What the fuck. You know how many pokespheres got wasted due to this trash snapping onto a moving target instead of being able to lead? \r\n\r\nBut that's all. I'm tired of the jank. I just want to enjoy the game fully with out being laser beamed through two walls and a cargo container just to watch helplessly as my oatmeal thicc character gets pushed into a column and grabs on to climb, repeatedly, stun locking me until death. Please focus on the basic game play mechanics and polish for once. My Anubis has been stuck on the stairs for DAYS.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "Focus less on crossovers with other games and more on making your own game more fleshed out.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "It starts off really well but the longer and longer you play, the worse and worse it gets. I don't know if the game is intended to be played with multiple people or not but as soon as I started running things in the level 55-60 range all of the enemies became such extreme damage sponges that just killing one enemy would take upwards of 10-20 seconds. Which doesn't seem like a lot, until you realize that there's like 50 other enemies also running at you, and also they don't get stunned at all while you're damaging them so they WILL shoot back and almost immediately kill you, even with Rare armour of the appropriate tech tier.\r\n\r\nAnother issue is that you eventually get to the point where your equipment is so expensive to craft that every missed Bullet, Arrow or Pal-sphere just has you think about how insanely expensive the losses are in your mind, and if it's at the point where all you're thinking about while playing is how much you're losing by engaging with the content it just...stops being fun. This isn't too much of an issue in the early game where almost all of your materials can be auto farmed by setting up a base with some pals but once you're in the 55+ range the auto mine-able materials are in such a drastically small supply that you're better off just doing it yourself, and the ingot you need to craft at this tier requires another ore where the ONLY method to gather it is manually by yourself with one specific Pal.\r\n\r\nSpeaking of the Pals themselves...the designs are mostly just okay. Quite a few of them are literally just direct, derivative rip offs of Pokemon though. I've noticed that the later Pals, released in updates after the launch generally have better designs but in general they're all pretty mid so far, with maybe like 5 or 10 really great designs out of the 150-ish.\r\n\r\nAnother issue is with all of the different factions/teams in the game. That being that they are all functionally and mechanically the same. They're all just random humans that look slightly different that inhabit different parts of the world. They might use slightly different weapons and look slightly different but they just sorta all do the same thing, which is be a minor nuisance or just attack and kill random Pals. This also includes the team that's literally called the Free Pal Alliance, who are a Pro-Pal faction that believes in the ethical and fair treatment of Pals...all while shooting them in the head with crossbows?\r\n\r\nAll in all it's a very mixed bag and if I could give this a mixed review it would be. I did enjoy my time with it but the endgame just straight up sucks. If you're on the fence about the game at this point and still haven't checked it out, I'd suggest just waiting for the 1.0 release and seeing if they can patch up all of the game's issues by then.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Great game at first but gets boring and very time consuming game can be buggy some times overall 4/10. Game could use more bug fixes and make obtaining new stuff a little easier. i only recommend this if u have a lot of time and patience.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I know this game is still in EA but with the massive amount of accolades and success this game has earned, it's odd to still see such a massive lack of polish within the game, especially with the ongoing collab updates. Character animations are still lazily done with quest NPC's still levitate in mid-air and characters not being positioned properly when using equipment. The combat is sometimes hard to enjoy due to the fact that any and every pal nearby can get hit by strays if you're engaged in combat nearby with another pal, the same goes for NPC combat if you or your pal is close enough. As others have also mentioned, the world still feels quite empty. I appreciate leaving room for people to build bases, but I feel as though a lot of the empty spaces too small for bases could be filled with more settlements or something. All in all, I want this game to succeed but I truly think the devs need to focus on polishing things up first before doing anymore collabs.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "After a lot of play, I can’t recommend this game. It isn’t outright terrible, but the sheer number of bugs and balance problems hold it back from being what it could be.\r\n\r\nPAL abilities are often costly but useless, and PALs swap setups whenever they level. Passive bonuses are far too random, frequently rolling on PALs that can’t even use them. Some PALs feel like they had no effort put into their design at all, while others are very well made, which makes the inconsistency stand out even more. Player gear durability also drains far too quickly, adding another layer of frustration to progression.\r\n\r\nThe AI is a mess. PALs in the base sometimes get stuck and starve for unknown reasons, repeat pointless actions, swap tasks without reason, and at times refuse to engage because they endlessly spam the dodge move instead of fighting. They sometimes stay locked on distant foes instead of the ones right next to them, wasting time and leaving you exposed. Defensive abilities are used with no purpose, sometimes even to initiate combat against non‑alerted or non‑hostile PALs.\r\n\r\nLeveling up itself isn’t too bad, but overall progression can’t keep pace, and while new areas may look different, they rarely add anything fresh to the gameplay beyond appearances. Finding new PALs can be exciting, but there aren’t enough stats exposed to the player to understand what differences swapping around actually makes. It becomes hard to know the optimal path forward, and eventually you’re forced into leveling new PALs just to keep up. With limited storage and only five PAL team slots to use when out and about, this quickly becomes a nightmare. PALs barely gain experience while working in base, so you have to bring them with you to level, or use consumable items that can be farmed very slowly — but doing this for dozens or even hundreds of PALs is not viable. Re‑catching them instead feels dumb and highlights the gaps in game design. This is more tedious than fun.\r\n\r\nAt higher levels, progression becomes extremely frustrating. You may reach higher levels, but you can’t get what you need because resources stop keeping pace with player effort. The game seems designed around the expectation of having more allies, yet there’s no option to compensate for solo play. Gathering certain resources requires many hands, and PALs simply can’t keep up, making late‑game play a slog.\r\n\r\nBase building isn’t the worst, but it is heavily restricted with odd space requirements and strange placement limitations. Resource gathering is uneven. Some low‑tier resources are harder to get than they should be, yet you need far more of them than is reasonable, and not all can be auto‑gathered by PALs. Inventory management is another chore: too many items, no auto‑deposit features, and the need for hundreds of chests just to store everything. Like in many other games, there’s no thought given to where the abundance of items introduced should actually go. I don’t understand why there need to be so many items without at least allowing conversion or consolidation.\r\n\r\nPlaying with a few people on a dedicated server might improve the experience, but solo play feels stagnant even after a year’s break. New PAL introductions don’t help when balance and functionality remain broken.\r\n\r\nThere’s potential here, but polish is sorely lacking. I know this is early access, yet the game has been around for a long time already, and most titles don’t change much between early access and release. I doubt there will be meaningful improvement, though I suppose time will tell.\r\n\r\nMy thumbs down isn’t because the game is unplayable — it can be fun for a while. But the mountain of issues builds frustration until the fun is gone. Worse, you end up playing more simply because the time you’ve already invested makes you reluctant to abandon progress. That’s why I can’t give it a thumbs up. In the end, it’s a frustrating mess of a game as it stands.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "As much fun as it is, it has a few issues I greatly despise:\r\n1. Too buggy, too glitchy, I think I've clipped in the environment more times than I remember. My game threatens to crash at many times, and some creatures and enemies straight up get clipped through walls, doors, and floors, and can STILL attack.\r\n2. AI Pathing is terrible in this game, both for your pals and enemies. I've had pals sit on top of enemies actively attacking me and still do nothing despite being in combat. Also, the auto targeting your pals get is very annoying, as it will always target the creature closest to you rather than where you aim.\r\n3. OMG what is that leveling??? its very over the place, where some spots are lvl 10 right next to lvl 20-30 enemies. It makes it feel like some places/enemies are too strong but close to your starting point, and others are just too weak and far. It makes no sense for their placement. \r\n4. It desperately needs some QoL features like a PAUSE BUTTON FOR SINGLEPLAYER, or a transfer button to move items from inventory to storage boxes. Also, an element chart that isn't in the survival guide would help so much, or atleast a indicator. Also please add an unstuck button or command. I'd rather not use the respawn button since it won't pop my items out of the clipped area and they will permanently stay stuck.\r\n5. Solo, especially hard mode, feels extremely unbalanced for the players who like singleplayer. It especially sucks when it comes to multiple enemies, as it feels almost like you're the only target they see no matter if your pal is out or not. hard mode essentially makes the early game really hard as most pals insta kill you. Also, for some reason, they have building degrading on by default, and while you can disable it and it isn't as big an issue, it doesn't make any sense to have it on for a solo player. \r\n6. I wish they had better indicators for quest givers and task, as the map doesn't show any, and the map marking system is very archaic when there's quite a lot to find and look for. \r\n7. The tutorial needs to be better built, as there's a lot of different things they don't explain until you figure it out yourself, which while they do give a survival guide to look at, it would be way better to introduce them in-game.\r\nOverall, I think the game is a lot of fun, but it definitely has a LOT of ironing to do. I'll play some more of course, but definitely not recommendable right now.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game commits the gaming sin of being able to disconnect you from a single player game cause of server issues, I'm not on a server how did I lose connection to my offline game? HOSTED ON MY OWN COMPUTER!?!?!??!??, I want to recommend this game cause minus the building system making me want to take an axe to my head it's hilarious and fun but that one issue is just an immediate minus 5k points in my mind",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "+Addictive gameplay loop.\n+Nintendo competitor.\n~Good character designs, but ripoff-y.\n~Mediocre overall artistic direction.\n-HOURS of backtracking.\n-Oil rig AI is TERRIBLE.\n-Chillet and player hit through walls.\n-Humans easy to condense souls.\n-Powerful pals like Anubis early breeding.\n-30 dollars for a buggy mess is embarrassing.\n-Environmental hazards are too annoying.\n-Tower bosses require grinding to beat.\n-Soul condensing discourages team variety.\n-Attracts its OWN criticism-appalled fanboys.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game kicked off a new genre of open world games i think, while the idea is good most games of this type fall short in the amount of content. most games of this type seem in depth at the start but after playing for more than 8 hours you quickly find that these kinds of games are super shallow",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "On Steam Deck, if you choose to use mouse and keyboard controls the game only registers a controller. And while PC inputs work in GAMEPLAY, many of the prompts are for a controller, and the game prevents you from editing keyboard controls which means I can't rebind the pal sphere throw key to something less annoyingly easy to press by accident.\n\nFIX THIS PLEASE!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wanted to love it, but I quickly lost it. I'm probably not the target audience, even though I really liked the game with a similar atmosphere that everyone knows when I was a kid. I don't rule out that I'll love this game someday, but overall, it's a disappointment for me. No, it's not necessarily because the game is bad, it's just probably not for me. Although there's more playtime than I showed on Steam, it's still very little. If my opinion of the game is due to the little time I've played it, you can consider it null and void, but I still think that about 3-4 hours is enough for a game of this kind to grab the player. Unfortunately, this title hasn't managed to do that yet.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has horrible disconnects for co-op both server and client on the code connect. I've reported it many times. I hope they can get their shit figured out because otherwise I just love this game. It's quirky and funny. It would be great if you could stay connected with your friends for more than 3 seconds at a time. Please figure it out Pocket Pal!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to leave a review here hoping that Palworld devs will see it and address my complaints. I would also like to add a disclaimer that Palworld is by no means a bad game; it is very fun and by all rights deserves all of the positive reviews it receives.\n\nWhy, then, am I leaving this negative review? Well, it's because Palworld is a negative experience specifically for me. I started playing the game in early access, and ultimately I never managed to get very far because my favorite aspect of the game--base building--is very broken, flawed, and inconvenient.\n\nI'm going to start with the most severe flaw, in my opinion. The basics are all there and decent, but the problems arise when evaluated in combination with other systems. Specifically, pathing for Pals. Pals simply do not understand how to navigate bases, and this puts severe restrictions on a player's ability to creatively design the exact kind of base that they want to have because it comes into competition with practicality. Want a cliff base? Well, be ready for most of your Pals not to be able to access much of your base due to their inability to path to different floors of a base. Even a base that is on a cliff that extends down to the base of the cliff faces problems because unless there is a natural (not player-placed) path between the levels, the pals get stuck\n\nI think I figured out the problem and it's simply that pals only really recognize terrain that isn't player created. Sure, they can stand on and in some capacity interact with player-built platforms and stairs, but for all intents and purposes they do not see them as viable paths for getting from one place to another. This essentially means that the only practical way of building a base is on perfectly flat terrain, and that sucks.\n\nMy second complaint is more of a quality of life one--would it be too much to ask for a streamlined and simplified method of replacing existing walls and floors with the upgraded tier of them? Maybe this already exists in the game as some sort of upgrade that I never managed to reach, but I don't think so. Please, just let us overlap old floors with new ones and place the new ones. Ideally we would reclaim the old resources, but honestly I don't even care if we did. The problem with the system not being this way already is when it comes to needing to replace foundation/\"load-bearing\" platforms or anything with crafting interfaces on top of them; you have to manually destroy and rebuild absolutely everything. When combined with the fact that (as I mentioned in my last complaint) pals can't always reach places in your base if it is comprised of different levels, and this becomes a very time-consuming and annoying process.\n\nBasically, the base-building needs better integration with the Pal pathing and better optimization and quality-of-life injected into it. I hate to leave a negative review over these very specific and isolated issues, but the fact is that base-building is a very major part of the game and one of the parts that would otherwise have been my favorite thing to engage with. When I played the game over a year ago in early access I had hoped that these issues would just naturally get resolved in a series of patches, but after having returned to the game and none of these issues having been addressed it left me with concerns. Genuinely, and not hyperbolizing here, it kills my desire to play the game. I've owned this game for over a year, I WANT to love this game (and genuinely do love a lot of it), but my playtime is a testament to the fact that it's just impossible for me, personally, to get over these problems.\n\nI know the lawsuits with Nintendo have likely taken a lot of time and attention away from what could have been used improving the game, so I hope that anyone reading this takes this review with a grain of salt, especially the developers. I'm leaving it because these problems do affect my enjoyment enough to ruin the game for me (which to me warrants a subjectively placed negative review) and because I know that negative reviews often receive attention better than buried forum posts do. I'll definitely update my review if major improvements are ever implemented into the base-building aspects of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game is decent but its a pretty demotivational experience leveling up to 20 or so in an official server, trying to place a palbox to have a base somewhere, and being told over and over that the server is at max bases, logging in again the following day and being told the same thing, etc, not being able to make a base and continue playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spent about 10hrs total reinstalling game, uninstalling game, deleting all files associated with Palworld, verifying integrity of files, running Palworld/ShippingPalworld exe in administrator mode, restarting pc, restarting router, etc.\n\nNothing fixed the EOS error I kept getting that prevented me from playing multiplayer or even clicking the join multiplayer button, it wouldn't even let me create a world with multiplayer enabled.\n\nMy friend, the genius that he is, told me to download Vortex.\nIt automatically installed TWO mods, UE4SS + Unreal Pak Tool\n\nI don't expect my review to affect a game with overwhelmingly positive reviews, but needing to download a mod manager just to finally access multiplayer is unacceptable.\n\nUpdate: I can now start the game without the mod manager and access multiplayer.\nI have no clue what the mod manager changed, I don't feel like I have an answer as to why any of this happened, and the only stuff I can find online is for issues that happened 2yrs ago, none of which helped before the mod manager suggestion.\n\nI'll give a positive review after I've played enough that I'm certain the issue isn't persisting, otherwise just assume the error keeps happening every now and then.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nothing good since Feybreak\nWhens the next major island? \n1.0 better not just be the 2nd and only major land",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is essentially unprogressable as a solo player after level 50. The moonflower tower boss is unbeatable even with custom settings increasing my damage rate and reducing the bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game gets too grindy towards the end it was fun but the game sucks all the fun out of it towards the end game. Baby sitting your Palls is not fun! undodgeable attacks, attacks that go through walls or cover.  some moves have strong aim assist and strong tracking.  0 hand holding or explanations on back story or plot story. \r\n\r\nIf you want Punishment Then maybe this is for You. your spend more time in base prepping than exploring!  \r\n\r\n6/10 strong start bad finish !",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Disclaimer: I only played solo and tweaked default settings to be a little less grindy and punishing for no reason.\nTL;DR: 4/10 unless you enjoy grinding, then it's 6/10\n\nGame starts fine, you get to next techs pretty fast but then you discover areas with higher level brackets and get completely stomped by aggressive spawns and little to no fast travel points. And then the need to grind hits you. At first, it can and should be automated, only requiring manual intervention once in a while to gather small amounts of non-automatable resources. Automation itself is a bit of a pain because buildings that produce resources suck at first and you have to find one of the like 3 locations with good amount of natural deposits. Then you unlock 3rd tier of material and it requires resource that can't be automated up until you basically get to the next tier. This material also allows to make actual guns and they suck! Every bullet is made using manual labor to gather 2 different resources and 3-step process to make just a bit of ammo painfully slowly. To unlock full ammo automation you basically have to finish the game, or at least, what was originally the game. For a \"Pokemon with guns\" the gun part is too expensive. Then one of the \"endgame\" materials has a straight-up non-automatable component. This also appears to be the theme of expansions, new resources require you to either run around vast and mostly empty locations, avoiding unneccessary fights as they slow you down, and gathering required resources, or sit on the base and breed and butcher ONE species of pal. Good thing relevant ammo can be automated, right? Nope, there's only grind in the endgame. I played until level 47 and got tired of doing the same dungeons to gather just a bit of resources.\n\nVenting is mostly over, now for the review part. \n\nGraphics are okay-ish, you find visibly stretched terrain textures basically everywhere outside of roads. \n\nSound exists and works, no complaints here.\n\nOptimization is inconsistent. Open world with baked lighting works fine but as soon as dynamic lighting gets involved, things get laggy. Don't even try to illuminate the room you frequently visit unless you want as frequent FPS drops, use natural lighting instead. Otherwise, the game runs fine even when using AoE attacks on large groups of enemies.\n\nPal designs are decent, older ones are \"reimagined\" Pokemon designs and there're like 2 pal designs I genuinlny like, newer ones are better but I haven't seen them much due to new locations being behind grind walls. \n\nHuman enemies are pointless, feel the same and the only lore behind them are 100+ damn notes that i'm not going to collect, we're not in Slenderman. Human interactable NPCs exist but usually for single function, be it a single quest, a trickle of free resources, a pointless phrase, or a shop.\n\nLocation difficulties vary wildly, you can have \"starting\" zone border engame death forest with the same pals, just 40 (out of 60 total) levels higher. Same goes for occasional NPC bases, how about a random endgame base where you'd get oneshot situated in the middle of second level bracket zone?\n\nBase building is bad. There might be a bunch of decorations but you can't make a non-prismatic structure at all, there aren't even corner roof pieces! Building restrictions are inconsistent, you might be able to place structures one way, but not vice versa. Doors straight up suck. Moving with grappling hook is faster anyway and doors only obstruct your path...\n\nPal automation is underwhelming. Job priority is non-sensical, they switch between tasks uncontrollably, bug out during pathfinding, only eat until they have 50% of satiety when they hit <50% statiety and if you use cheap food - too bad, they will go eating every 30 seconds until you install a mod to fix it or switch to a more grindy food that expires quickly by the way. Full automation is impossible because you can't automate task creation or even do it remotely.\n\nSurvival aspect is basically non-existent, it's actualy hard to find yourself in a forced death situation in the open world once you get your mobility options a few hours into the game. NPC base assaults are a slog, half of the enemy attacks ignore walls, your pals have a non-zero chance to get stuck and die inside the cramped buildings. Non-\"raid\" bosses are huge damage sponges with a time limit. I don't know how AI chooses targets but they usually focus me, and if they focus my pal - it dies in under a minute. Haven't tried \"raid\" bosses but those have even higher hp and are supposed to be killed using your base defences.\n\nExploration part is mostly fine, until you get to mountain zones. Most locations are empty outside of a few trees, rocks and the same copy-paste minor vegetations but mountains are even emptier, having fewer rewards and a wall on the side of your screen. Sometimes distant islands show up as unshaded PNGs intead of foggy shaded ones, scaring you in the dark by, for example, a bunch of bright ice.\n\nPal combat AI sucks, they can start attacking unreachable enemies, ignoring ones right in front of them and using the command menu requires you to stand in place for several seconds, while there are a dozen of projectiles aimed straight in your face.\n\nEndgame balance is something I don't understand. You're supposed to breed your pals to pass down passives you want but I haven't tried it, instead using the ones I caught and proceed to lose my pals every time they get focused (compared to early game when they can tank for you). You can't predict damage attack can deal based on \"power\" alone, sometimes this includes collision shenanigans. It seems \"power\" only shows damage potential of a single damage tick and amount of those can vary between 1 and BEAM(several tens). Beams are just heavens above anything else, especially if used by you while riding your pal because they can actually be aimed during attack animation, unlike when AI uses them. Also endgame NPC bases can have several beam users inside at once so if you lag for a few seconds your pal dies. The concept of \"higher damage - longer cooldown\" sucks. You are forced to juggle your pals for consistent damage output since endgame skills have cooldowns of about a minute.\n\nOverall, a decent grinding game but progression slows down significantly as you approach endgame. I don't think it's worth the money or the time you spend doing dungeons to craft another 5 magazines for your assault rifle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes constantly. especially at key moments like right after you beat a boss and you lose everything.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Last update broke the game, i can't load it. \n\nThe game itself it's good. I do have a lot of problems with the UI, but I have enjoyed it so far. It got a little better once i discovered that i could change the world settings to tweak it quite a bit.\n\nBut i wanted to play today and i cant even launch it cuz it crashes.\n\nI hate the Nightstar sands, Chromite and Coralum Ore because all three had the same problem, you need them in quantities to craft things, but there is nothing you can do to automate them. Chromite is the worst because you need the Metal Detector and going around until a place \"to dig\" appears. At least the sands are easy to spot at night.\nAnd the Coralum is a paing to farm... So much base building for automation to be stuck with items like this that are awful to find.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game just randomly boots you back to the title screen sometimes.\n\nFix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels sloppily made, guess it can be fun with friends but nothing for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Complete hot sewage of a game. Which is a shame cause it has a lot potential and can be fun, if the hitboxes weren't complete garbage, the path-finding actually found something for once, the AI doesn't hyper focus on one player the entire boss fight and the terrain wasn't like walking on oil half the time or getting stuck on tiny lips on stairs etc. \r\n\r\nTry fixing these basic things before collaborating :3",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is absolute bad dont recomend to anyone with life go get minecraft instead",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Animal cruelty, Human Traffic rings and Slavery what a game!!!! fucking pokemon rip off",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What to say... where to start... hmm... I guess the deciding factor that made me huck this game into the garbage was the concerning amount of slavery and animal abuse topics that this game just continues to make the core part of gameplay. I was iffy at first, but after they added a machine to FORCE CREATURES INTO CONCENTRATION CAMPS, I decided my worries were indeed well founded.\n\nI'm personally against animal cruelty, not to mention against Hitler in general... and this game really makes me scared of where humanity is headed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game was good but now I cannot get on a network error has occurred. the multiplayer feature is currently unavailable. error:  EOS login timeout.  Tried everything to correct and still nothing. Another player on a different computer same network no issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This a good game with great idea (thank you nintendo). But implementation  of various features is just a disaster, UI + interaction mechanics is a good for student level of work,  i can't name even a single feature/mechanics which works like it should, interaction with storage, palls, riding, everything is choppy and i have no feeling if i press something will work in 100% of cases. Riding is awkward,  even single stone on the ground can be a serious barrier for your ground pall. Flying and interacting with objects on jetdragon feels slippery af. Base elements are just huge   for that base size, some pals like dragons are just toooo big. This is a  good idea but need serious optimizations for performance and gameplay, Using rocket barrage while riding a jetdragon instantly throw my 7900xtx into the power wattage limits, and that's just horrible for a skill especially with so low dmg",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is super buggy for the amount of hype it gets. Ended up returning it which was a first for me. Couldn't suggest paying $30 for this. Also it didn't try very hard with its \"original\" characters...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I never had any interest in this video game to begin with I only have the game because a friend wanted me to play the game I would not stop talking about the game\r\n\r\nSo pale world could be a good video game however I never had any interest in the video game at all so my reviews probably not a fair review to the game it's self.\r\n\r\n In all from what LITTLE TIME I played the game i just couldn't get in to the game\r\nAgain the game just could not catch my interest at all i may give the game a try again later on down the line but that remains  to be seen unfortunately  as it is now ima say it's highly unlikely I will press play on this game again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game doesnt have a single original bone in its body. Not recommended because I bounced off of it pretty hard but your enjoyment on this will basically depend on how much you like Ark Survival Evolved",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}