{
  "positive": [
    {
      "review": "LIes of P is a pretty interesting game and fun its not like any other souls like but it has some elements of other souls born, u definitely need a new perspective for this game and need to adapt to everything, so in all i would consider it as an masterpiece.\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☑ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐10",
      "voted_up": true,
      "votes_helpful": 70
    },
    {
      "review": "Lies of P is a seriously polished soulslike that surprised me in the best way. The gameplay feels smooth and responsive, making tough fights more satisfying than stressful. The bosses are a blast, challenging without feeling cheap, and super stylish too. If you’re into modern soulslikes, this one’s absolutely worth your time.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Best souls-like out there. Felt as if I played another one of fromsoftware's games. \n\nAlso, I love Sophia, Lea.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This might be my favorite souls-like game. The story is easier to grasp and the combat is really fun",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The P stands for Peak. This game is a fantastic. The combat is amazing, the story is wild, and the atmosphere is spooky in a classy Victorian way. The whole thing radiates heavy Bloodborne vibes.\nI do like the weapon merge system, it lets you mix and match the blades and the handles as you deem fit, giving you more freedom and more of a personalized instrument.\nAlso, P's hair is 10/10.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "[h3][b]Thoughts[/b][/h3]\nTo think that I almost dropped this game forever when I tried it on Game Pass... because I couldn't get past the first boss. What an epic mistake that would've been!\n\nSo glad I picked it up again and gave it a chance it deserves. Lies of P now stands toe to toe with my other favorites in the genre. And even surpasses few of them in some areas. Neowiz / Round8 did an incredible job here and I'm looking forward to whatever they cook up next.\n\n[h3][b]What I liked[/b][/h3]\n🟢 Captivating narrative elevated by the meticulous world-building and melancholic atmosphere\n🟢 Smooth and engaging gameplay with satisfying combat\n🟢 Wide variety of weapons that can be mixed and matched\n🟢 Immersive level design that is fun and rewarding to explore\n🟢 Overture DLC is sprawling with content and ties to the base game, I'd call it essential\n🟢 Oh my god the soundtrack...\n\n[h3][b]What I didn't like[/b][/h3]\n🟠 Parry window seems to be a bit too punishing\n🟠 The difficulty spike in the Overture DLC is substantial\n\n[h3][b]My score[/b][/h3]\n[b]9.2 / 10[/b]",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game feels tough at first, but once you get into the rhythm, it’s extremely addictive. I kept coming back because the combat is satisfying and the atmosphere is dark but beautiful. Sometimes early on I got frustrated, but that frustration made the victories even better. After all that time, I can say it’s one of the few games that  has kept me hooked for so long.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "10/10 dark fantasy Pinocchio. The story, level design and combat all knock out of the park. DLC puts everything into context in such an amazing and special way. You owe it to yourself to give this one a go and stick with it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game in general and one of the best Souls-likes. It's better than most FromSoftware games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Base game was great, but Overture pushed this game to one of my favorites in the genre. Must play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "stunning visuals and challenging gameplay; what more could one ask for? i especially liked how the story and characters of pinocchio plays a role in the greater game, and how the theme of lies is important throughout. i'm a sucker for parallels. other than that, the music is to die for — really. cannot wait to dip my toes into the dlc.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game the atmosphere, the sound track, the gameplay, the voice acting, and the story. I can't wait for the sequel, but I have no problem beating this game again and again until it comes out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lies of P is an amazing, atmospheric souls-like that grabs your attention right from the start. The visuals are beautiful, and the gothic world it creates is really immersive. The soundtrack and sound design are top-notch and add a lot to the overall feel of the game.\nUnlike many games in this genre, Lies of P tells a great story that keeps you hooked from beginning to end.\nThe bosses in this game are fantastic! Each one feels unique and challenging.\nI also really like the feature where you can mix different weapon parts. It gives you a lot of freedom to customize your playstyle.\nIf you’ve never played a souls-like before, Lies of P is a perfect game to start with. Definitely recommend it to anyone!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I know that I'll repeat what others said but I actually do not care: this is the best Souls-like not made by From Software. For me it felt a bit like \"Bloodbourne\" because of the setting but it definetley has its personal touch. Higly recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lies of P is fantastic. From the setting and story, to the combat and playstyle customization, it's gorgeous inside and out, and an extremely satisfying game. Combat is challenging, but comes with ways to tailor that challenge if you desire, though, Legendary Stalker feels just right. The DLC is also incredible and worth every penny. I adore this game. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game of all time in my opinion, literally a better bloodborne. The story is an absolute masterpiece and the soundtrack is even better the combat is smooth and fun and the arts style and art direction is beautiful. I dont really have much more to say Lies of P is an amazing game on par or even better than most if not all of Fromsoftwares souls games. Go play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Первая проба Lies of P — и я в восторге! Сеттинг в стиле мрачного Пиноккио с марионетками и проклятым городом Krat — чистый шик, атмосфера на уровне. Боевка — сплошной кайф: парри, сборка оружия, динамика как в Souls, но с изюминкой.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of if not the best souls-likes I have ever played, The story is amazing and not buried under cryptic item descriptions, all of the weapons are unique and fun, the characters are all memorable, and the combat is utterly fantastic. I highly recommend this to any souls fans. You should treat yourselves to this gorgeous game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lies of P surprised me with how polished and satisfying it is. The world is dark, stylish, and full of atmosphere, and the combat feels tight and rewarding without being unfair. Every weapon has weight, every dodge matters, and progressing through its areas gives a real sense of achievement. The soundtrack and visual design make the whole experience even more immersive. Overall, it’s a refined, challenging Souls-like that feels great to play and absolutely worth the time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome! It was my first sous like game and I love it. The variety of NPC's, monsters and bosses is very impressive. Each boss has an unique fight setup with a specific pattern attack, and in the most of cases a good background history. The most impressive thing about this game is the way of history and gameplay connect with each other, and there's no word to explain how good history it is. My tip to you? Don't try rush this game, discover paths, take collectibles, read letters, and enjoy every place of the world in this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the best game ever \nthe dlc is the best part \nI recommend this game for everyone especially for new players \nMy fav character is the cat <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "my friends said i would like this game because its emo dark souls. unfortunately they were right. this game slaps. and it slapped me hard, repeatedly, for the entire play through. \r\n\r\non the real tho, this was my first souls like and it was an incredible ride. it feels easier to give criticisms as the positives require a lot of spoilers. the game has a ton of style if some odd but endearing choices. such as despite having incredible music, the game is largely silent. the bosses are mostly great, even if at times i preferred some of the mini-bosses to the bosses. my biggest gripe mechanically is how the parry system works. it is very unforgiving which makes it rewarding to master, but it doesn't seem to be designed to be a \"tap\" but rather a \"press and brief hold\". so, when dealing with fast attacks that are difficult to otherwise roll, the parry system feels incredibly unintuitive with how long the \"hold\" should be. in other cases, taps do seem to work, i can't tell if its mechanic for the specific encounter in which you need to tap when it otherwise feels like you can not get away with that. it is likely a skill issue and i never quite learned it despite finishing the game. it really incentivizes running away rather staying in the action in certain fights. \r\n\r\nalso, as someone playing on an M2 MacBook Pro 32GB, this game ran absolutely beautifully and looked gorgeous. big respect to the developers for optimizing the game so well. there was one section with a lot of rain effects that had an occasional frame drop, but it happened about twice and didn't effect my experience. if you're on the hunt for a triple A feeling game that is hard to find on MacOS and want to try a soulslike, i can't recommend it enough. i will grab the dlc after my heart rate settles from beating the game :)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really enjoyed this, sure it can be quite clunky at times when dodging but overall really good.  Still need to play the DLC.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game shows that FromSoft isn't the only big-time player in the soulslike genre anymore, that is how incredible of an experience Lies of P is. I cannot recommend it enough! This was the only game I ever finished and actually could not wait to do another playthrough with the additional context you are given in NG+.\n\nYes, the game is definitely linear compared to FromSoft's catalogue (I'd argue that isn't even inherently a bad thing), but that is more than made up for with the refined and fleshed out combat system, the incredible setting, the characters, the art direction, most boss designs, etc.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game for all lovers of Souls type games, with a unique setting and a strong sense of what it wants to be.\r\nLove the music!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is simply the best Souls like outside of Fromsoft, and even then it holds it own when compared to them. I've completed 4 playthoughs (NG ++++), have seen all of the endings and achieved 100%, something I haven't had the endurance to do for other soulslikes.\r\n\r\nThe gameplay, atmosphere, soundtrack, weapon choices and boss fights are all extremely high quality.\r\nThe difficulty is there, and you will be challenged but not in an excessive way\r\nThe game brings the standard souls-like experience and elevates it in its own way;\r\n\r\nThe environments tell the story as much as any other part, my personal favourites being the Kraat Zoo, the Museum, the Opera House and ofc, Rosa Isabelle Street (*chef's kiss*)\r\nThe enemy and character designs are gorgeous, and some are honestly terrifying (in a good way!)\r\nThe boss fights are memorable, there are a good mix of faster and slower bosses that encourage you to switch up how you approach the game.\r\nThe DLC, Overture, adds so much to the already tragic story, grants countless amazing weapons and moments. Along with some of the most challenging and impressive bosses I've fought in Soulslikes before. \r\nTHE RECORDS. One of the standouts of this game are the records. Small pieces of music you can play in the hub world after collecting them, and they happen to be some of the most impactful parts of your playthrough. You get punched in the feels the minute you hear \"Feel\" for the first time.\r\n\r\nI could blabber about this game for hours and I cannot wait to see what the studio do next (if you know you know!). Honestly, if you enjoy soulslikes, and are open to a game that has a clear sense of identity and a range of strengths then please give it a try. It is worth it. And I hope you enjoy your time with it as much as I have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TL;DR:\r\nI know you won't read this whole thing. This game is amazing, and revolutionizes the Souls formula, providing an incredible experience and proving that not just Fromsoft can make a Souls game.\r\n\r\nLies of P is a revolutionary game. It, I believe, has finally made a necessary jump that inumerable gamers have desired for years, whether they knew it or not. What I believe Lies of P has done is finally break the monopoly Fromsoft has on the Souls-like genre. \r\n\r\nWhile there are almost inevitably countless smaller games that have taken ideas from the Soulsbourne games or made games of the genre, and ripples of Souls concepts have become included in almost every AAA release, no other major studio has attempted to create a game that could be considered a true Souls-like down to its core. The creators of Lies of P have finally tackled the intimidating prospect of creating a game to rival Fromsoft's masterpieces, and they did an incredible job. \r\n\r\nThe gameplay, while a bit stiff at times, is lovely. Taking a page out of Sekiro's handbook, guarding perfectly is your main way of dealing with larger enemies, while dodging is a vital second option for when you need to create space or can't block the attack. Unlike Sekiro, however, the game is not completely based on parrying, with no deathblow system, and has a customization and build variety on par with Bloodbourne or even Elden Ring. There are at least 3 dozen unique weapons in this game, and almost every one is viable and interesting.\r\n\r\nTwo twists on the formula elevate the system to be on par or perhaps even better than Elden Ring's weapons systems. Much like Elden Ring, each weapon has special abilities that can be swapped out. The way that works in this game, though, is that you can swap the actual head of the weapon to be on the handle of a different weapon, mixing and matching different components to create unique weapons with different basic movesets, charge attacks, and even ranges, on top of the different \"fable\" abilities of the blade and handle.\r\n\r\nThe next level of customization is incredibly cool, and makes me wonder why no one thought of it sooner, which is that you can directly affect the scaling of weapons in the game using cranks. You can make any weapon work with any build this way and get full (or at least better) scaling out of it. I have never seen a game with this much build variety, short of Elden Ring, which is a crazy comparison considering that game is absolutely massive, and build variety that is very interesting.\r\n\r\nWhile there is even more build variety to this game in the Legion Arms and P-Organ, I literally don't have enough space to write about them so let's cover area exploration instead. This game's levels feel a lot like Dark Souls 3, which has some of my favorite levels in between the bosses. They're generally pretty simple in concept, though greatly enjoyable in execution. While nothing particularly special, they're certainly on par with the Souls Series, though there is a severe lack of poison swamps in this game. While not flashy or exciting, they are nonetheless a wonderful time.\r\n\r\nAt the end of every zone is a bossfight, and they are absolutely excellent. There very are few boss fights in this game I'd consider frustrating, and the ones that are good are absolute gold. The nearly flawless implementation of Sekiro ideas in a more traditional Souls body, mixed with boss design that's in between Dark Souls 3 and Elden Ring, create a soup of excellent video game perfection. While the game is a little held back by the timings of perfect guarding, which always felt a little off, this awkwardness quickly fades away as you learn the boss and get to know it's moveset and weaknesses. The frustration of hitting the proverbial wall melts into bliss as you perfectly counter and weave between the bosses attacks, having learned their moves and patterns. The fight against the King Puppet, mostly it's second phase, is perhaps one of my favorite fights in any souls game. And, like the Souls Games, a good build will scoot you on by the rougher fights, unlike the purely-skill based Sekiro, which wasn't for everyone.\r\n\r\nNow, perhaps one of the most important parts of Lies of P that truly defines it as something not made by Fromsoft, but instead inspired by. That would be this game's story. We Fromsoft gamers have grown very used to the cryptic and grimdark world building of the Soulsbourne games. You explore a decaying land with a decent idea of your goal and, with careful study of the environment, items, and characters, you can piece together a number of correlated tragic tales often stretching centuries or even millennia into the past. A weakness of this system is that most people won't be able to really get what's going on or the tragedy of the games until looking online, though.\r\n\r\nTo say it is a breath of fresh air to play a souls game that is neither extremely cryptic nor nearly as grim would be an understatement. This game has an excellent cast of wonderfully voiced characters that have engaging stories and personalities, and most of whom don't die hopeless and sad! Perhaps the highest praise that I can give this game is that it made me cry. I doubt there is a single person on the planet, short of season 8 Spongebob Squarepants, who would cry playing any Souls game. They're too bleak, too grim, and too confusing to be emotionally invested in. It's hard to feel anything when Dark Souls NPC #22 dies at the end of their questline, either because you're rereading the wiki to make sure you actually did the damn thing right, or because every other character also has something horrible happen to them in every other quest or story. Lies of P lights a torch from Fromsoft's brazier and carries it to new places, themes, ideas, and emotions. The music in this game is perhaps some of my favorite video game music, and I don't just mean the regular tracks, though those are certainly fine, but the records. The record I got after a certain character died... that made me cry as the song took me on a journey of remembering my journey, the characters I had met, and the final steps I had yet to take. I have never felt anything like it in almost any game before, let alone a Souls Game!\r\n\r\nOverall, Lies of P is the best Souls-like not made by Fromsoft. Actually, Scratch that. That doesn't do this game justice. Simply treating this game as something in the shadow of the giant doesn't truly get across the genius of this game. I believe that this game deserves to stand alongside its genre's namesake. Souls-like doesn't make sense as a name anymore, now that the floodgates have opened and companies other than Fromsoft can make this genre of masterpiece. This is a game that takes from the clay Fromsoft has used for years, and sculpts something new. I would then, in honor of Lies of P and the legacy of the Souls games, propose that we rename the genre of Souls-like to a SoulRPG. These games are no longer merely \"like\" an old game, that they exist only in the shadow, or to continue, an older game. They have, in my opinion, graduated to another branch in the tree of RPG subgenres, flowering with unique buds created by many kinds of pollen. (I don't actually think Souls-like is a bad or insufficient name, I'm just trying to be dramatic). Buy this game now, I look forward to the DLC!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lies of P is hands down the best souls-like I've ever played.\n\nExcellent combat, amazing story and an incredible soundtrack. Everything about this game is absolutely fantastic.\nAnd the DLC is a cherry on top.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't even finish games often, but this one I did finish. Time well spent, the fights were the right amount of challenge, made me want to get the DLC as well. 10/10 will replay, NG+ here I come",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredibly good game. I really like this game a lot. The art/music/aesthetic are all great. The story's neat. I love all the characters a lot (extra props for having a lot of women characters, including one of the coolest old women in a video game I've ever seen). The difficulty level (Legendary Stalker) is just what I like - I still die, but I don't have to try every single boss 200 times memorizing the attack patterns until I beat it. I also extremely appreciate the fact that there are easier difficulty levels too.\nMan. I could go on. I really love everything about this game. It was a delight to play and I'm planning on doing another playthrough right away to get some of the stuff I missed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I do recommend this game for souls veterans looking for a great challenge because this is it, but the challenge partially comes from the way this game telegraphs the moves, which I felt were a little cheap. Instead of giving this game a rhythm to the fight with smooth animations and clear telegraphs, like other souls games, in Lies of P you have to rely more on your sense of timing and knowledge of a move. Characters will hit a pose for a split second, giving no indication as to when they are going to do the part of the attack you have to block. This makes sense because of the lore that the enemies are puppets, and therefore are robotic in motion, but it is still not super fun to play. Nevertheless, this is great for souls veterans, as everything else about the game is, in my opinion, without flaw.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredible game with excellent boss fights and breathtaking world design. Every nook and cranny is beautiful.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A million people saying \"best non-Fromsoft souls game\". I'll take it a step further and say \"best souls game, period\"",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "6/10 - This game manages to maintain individuality in terms of setting and lore. Other than that it is a hard try copycat of a From Software games. Recommend if you are a fan of dark souls looking for more",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I had heard good things about Lies of P, as someone who has played all of the core FromSoftware games; and still I was hesitant to give it a try, out of worry this would be another clunky attempt to clone the mechanics and concepts from their games. I am glad to say this game surpassed all of my expectations and was in fact one of the most polished, creative, and enjoyable Soulslike games I have ever played; reaching and even surpassing, in some places, a good chunk of FromSoftware's own experiences. If you are still wary of giving this game a try don't be. I am writing this review at the end of my first play-through with intentions to go and get all achievements. The environments are beautiful and engaging. The music is distinct and true to form. And, the quests/NPC stories, throughout, gave me a commensurate drive to keep going in between every play session. I think my only critique is that the game never felt as challenging as any of the original Soulsborne games, often vying for a richer story and smoother experience. This for me detracts a tiny bit from the experience of the game. since part of why I enjoy the Soulsborne games is that they are quite a challenge at parts. Overall though, this is not a FromSoftware title and Neowiz has their own game-making philosophy; and, regardless, the overall creativity and depth of the \"dark bloody children's book\" theme continues to drive my interest despite the lack of challenge. The idea of multiple titles themed around stories like the Wizard of Oz or Alice in Wonderland, makes me open my wallet like a deranged mimic of Pavlov's Dog. If Neowiz continues with what they have made here, I have no doubt they will have an incredible series of games unlike what we have ever seen.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game however lumacchio could potentially be on par with Joseph Stalin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the first souls game I EVER played. Yes, before I even played Elden Ring. When I first picked it up, I didn't even know it was a souls-like, I just saw a video of gameplay with one of the boss designs and thought \"Huh, that looks cool...\", oh how Right I was! This game hooked me on the souls genre, and one of the ONLY games I bought on Steam AND Playstation AND 100% it on both! It would take me hours to give this game the justice it deserves. Absolutely recommend, PLEASE play it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first ever souls-like game I have ever played and in my opinion, the best one. I am looking forward too what else Round8 will make in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutley love this game! The main story is so good and the bosses are challenging but not too difficult. Its linear but with plenty of hidden surprises. This souls-like take on a well known story is both thrilling and captivating. Ive played the game through quite a few times now and still love it. Well worth the money and i also recommend getting the dlc!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Among NON-Fromsoft games, Lies of P is one of the best. That's a huge compliment especially if you consider that a lot of those other souls-likes have tried but never captured the feel nor fun of the genre.\n\nAlso love the Renaissance/Victorian aesthetic of the game. Has a similar art style to Bloodborne/Duskbloods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best non-fromsoft soulslike out there. I love this game, and the Overture DLC makes it even better.\n\nAmazing combat, more akin to Sekiro but with certain elements from Bloodborne mixed in (health recovery upon taking damage). Bosses are incredibly tough and feel very satisfying to beat. There are tools to make the fight easier for yourself if you so wish, but no fight is designed to be unbeatable without the tools. The Overture final boss is absolutely insane, one of the best fights I've experienced in any game.\n\nStory is great, it's more easy to digest and coherent than anything in the souls franchise, while still leaving elements for interpretation (although the DLC addresses most things). A gut wrenching, beautiful journey of despair, hatred, revenge, hope and sacrifice. It pulled at my heartstrings in all the right ways.\n\nI cannot recommend this game enough, it feels like a true love letter made by people who've played other soulslikes and truly understand the genre and what makes it great and fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Devs really understand what makes a souls game fun and put it all in one game. A must play for all souls fans. The boss design rivals that of fromsoft's games, especially the final DLC boss. However, those who enjoy the more open level design of the souls games might be a little disappointed with the linear level design in Lies of P.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Handoff my favourite non- from soft souls like game and probably my 2nd favourite game of all time aside Sekiro , and one the only games made me invested in the story to the point i feel actual sadness and the bittersweet momement and the little bit of hope and happiness from what that game shows us. Its been a while played such nice game with nice level design , setpieces , great music and smooth combat while having a bit of a challenge in difficulty .i . Absolutely worth the time and money .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good souls-like with a couple of caveats:\n- Developers loved the souls series so much that they forgot that they are not platformers, unfortunately some of the poor platforming made its way into this one as well\n- Too many combat mechanics for the game's own good - they lack proper explanation on what does what and during the puppet upgrade process, it is a hit-and-miss or you have to consult the wiki (which is NEVER a good design choice)\n- Weapons are pretty much useless - once you find a decent one, you will stick to it until the end... oh and they now give you a weapon in the beginning which easily carries you throughout 1/2 of the game, after that, get the hammer (the one with fire buff on Fable attack)\n- Lie mechanics, etc are not well explained - does it do anything? No, only alters the ending IF you stick with 100% truth or lies, which is a bummer\n- Difficulty has spikes. The very worst boss in the game is Laxasia... nothing even comes close to the BS she gives you in her second stage - 0 breathing room. On the other hand the 2 final bosses were quite enjoyable again...\n\nOther than that, the game runs great and even HDR is nicely calibrated.\nIf you like the souls series, then give it a go - it is good enough.\n\nEDIT:\nOh yeah, before I forget, Walker of Illusions can go and ¤(#/ itself as well. That is all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soulsborn gameplay with a surprisingly good and touching story. A pretty solid experience and can't wait to see what the sequel would be. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR\nGet it on a discount. Worth a playthrough and grind until the next iconic game reveals itself. Gets better the more you play, just like my wife. First level is a joke so be patient. Read full review if you want the legit critiques and problems I have with the game.\n--------------------------------------------------------\nJust beat First Berserker: Khazan and I've got this dark souls gameplay kind of fatigue, so I didn't really enjoy this game to be honest, especially because I loved Khazan and this just isn’t at that level in gameplay or story or level design. Attack/move sets (THUS FAR) are really... underwhelming/simple... basically I'm hyper critical because I'm comparing it to Khazan and it just isn't as fun, I don't find the story engaging either... like at all. I've been reading whatever document I find in the game and I'm just like... \"Oookay... sooo just random letters to random people that have no signatures or belong to any characters, or develop any main or side stories? An attempt to create a feel for the game's universe and state of the city?\" In my opinion it is a rather poor quality way to go about doing that, Like the letters are found in a corner of the map under a bush like it's an easter egg hunt... it's not next to a well designed scene of the corpse of a father shielding wife or child... nope... just... OOO LOOK, another random letter that's pointless. \n\nThere's little annoyances here and there I keep running into like, The HUD with instructions of what buttons do what actions DON'T GO AWAY FOR THE FIRST LIKE 10-20 minutes of the game until you get out of the first area... No option to turn that part off. There is an option to turn off the HUD but it turns off everything like your health and stamina bars go away, map goes away. Just Mediocre sh*t like that.\n\nAGAIN Comparing to Khazan… where the voice acting IMO was phenomenal in many character’s cases, but so far the main character voice actors feel very… amateur, like the world's most disapointing voice acting for an anime that might've been good (Example english Naruto (Whiney lil' b*) vs Japanese Naruto (bad A* dunce rebel); Japanese Goku scream (high pitched and girly), English Goku, \"SUPER SAIYAN DEATH METAL\") Now this game isn't quite English Naruto, but it's definitely miles away from Super Saiyan Death Metal. This ain't exactly an indi game so I expect the voice acting to be better, doesn't have to be the best, just better. \"BELIEVE IT!\" XD\n\nThe control scheme: Mostly good except one thing that was annoying -Holding the B button (xbox controller) to run with no option for toggle, and I don't know about you but I like using my right thumb for operating the camera angles and not perma-occupied with running.\n\nLuckily You can reconfig. I changed run to L3 (left thumb analog press), and for some freaking reason when doing that it TOGGLES THE RUN, which I'm grateful for, but why doesn't it do that same function for the B button? Makes no sense. Anyway... fear not, that's the work around.\n\nI’m on the hardest setting and the first map is just wayyyy too easy. So they’re pampering the first timers here which I can respect but it’s just wayyyy to freaking long of an easy mode intro! So game doesn’t start until you get to the first real boss, which killed me like 20 times, but honestly he’s not a hard boss, just got to not make those dumb little mistakes and figure out the timings… WHICH AGAIN… COMPARED TO KHAZAN… I feel like they’re not quite as calibrated to the visuals so you have moments where you know that should’ve deflected an attack but it didn’t. Trust me I own up to my own noobness… if I get got I was gotten, no justifying it.\n\nSo why would I recommend this game after being so critical? Cuz I have First Berserker: Khazan Love Blinders on right now and need to decompress a little before I can give my real/less biased opinion of this game. \n\nThe art and atmosphere is spectacular. The level design is mediocre but not too bad (example, too many short cuts back to spawn point that are unnecessary… In dark souls it was like coming up from the bottom of the ocean for a breath of air before you drown… here it’s like… kill three enemies, turn left twice… unlock a shortcut to spawn point. F^ing training wheels galore man!\n\nDON’T PUT TOO MUCH WEIGHT INTO MY REVIEW… I haven’t put in the hours yet and there’s still plenty of game left. I’ll update this if there’s anything that changes my mind or seeme worth mentioning. I’m going to take a break from the Dark Souls type of games for a while and decompress so I can come at it with a fresher set of eyes. I won’t put it above games like sekiro or Dark souls, or elden ring, or Khazan… definitely a downgrade in every way with the exception of visuals…. I think they got the art right for this one, but when it comes to videogames… I’d rather have a fat ugly wife who can cook than a hot worthless one who takes my money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Great Music, Great Combat Highly Recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of P is a convoluted hodge-podge of a bunch of different ideas, art directions, and game mechanics, mashed together into a game that is entirely too difficult for casual gamers and too linear and combat focused to give the lore room to breathe.\r\n\r\nThat said, I played the whole damn thing and had a good time, though I did use several mods in order to decrease the difficulty further with better parry windows and no stamina depletion.\r\n\r\nLies of P is first and foremost a combat game. You fight bad guys, and boss bad guys, and you dodge and block, and then hit them when they're down. Rinse and repeat. The gameplay loop doesn't get too tiring (at least from my modded perspective, as I wasn't dying nearly as much as vanilla), the enemies have a solid amount of variety, and the various settings and locations are beautiful and haunting to look at.\r\n\r\nOne thing this game excels at is switching things up as soon as you get comfortable. They start you out with simple melee opponents, but over time you have to deal with spitting acid, bombs, bullets, and even giant cannons firing down on you. Even enemies that are clearly remixes of previous enemies have slightly new movesets or tricks up their sleeves to prevent you from fully anticipating their attacks.\r\n\r\nThe lie mechanic is a fascinating concept that feels largely underutilized, especially in the first half of the game. You spend most of your time killing enemies and very little time roleplaying/having moral dilemmas where you must lie/be honest. There are a few sidequests where you will be given more opportunities to practice your lying/truthing, but those sections are often completely out of the way and can easily be missed without a walkthrough of some sort. Failure to encounter those areas will prevent you from achieving the \"human\" ending as you will not have committed enough lying (this game doesn't do \"save states,\" so you will have to start over from square one in order to achieve a different ending).\r\n\r\nThe lore is also sidelined a lot, and reduced to scattered notes that you must pause the game to read through. Many of these notes, like the lie mechanic, are located in areas that you can easily miss going from place to place, which kinda sucks considering some of the lore is very fascinating when you get the chance to read about it. I'm not saying Lies of P should've added a ton of unskippable cutscenes or long, drawn-out lore dumps, but I am saying that the game sort of... expects you to know a lot of the lore out of the box? In some ways, it almost feels like I am playing a tie-in game for a larger universe, one that I am expected to have read-up on beforehand.\r\n\r\nBack to the combat a bit- this game draws heavily from the soulslike genre in how it plays. If you are not a soulslike gamer, DO NOT PLAY THIS GAME, unless you are willing to mod it like I did in order to tone down the experience. Even on the easiest difficulty setting, some of the bosses will genuinely stun-lock you or jam you into a corner and beat you to death over and over until you're sick of it. The stamina pool is very small, and the ways to increase stamina and improve your stats are not very intuitive for someone casual like myself to figure out.\r\n\r\nYou can read reviews and studies about this game or watch videos on YouTube, which will tell you that even for a soulslike game, the parry windows, hitboxes, and boss difficulties are all insanely high and a bit broken/janky from a technical perspective, which is largely why I didn't lose any sleep over modding the damn thing in order to enjoy it (I had already purchased it, after all, and didn't want to just have it sit there on steam).\r\n\r\nAll of this to say, my overall experience was a mixed bag. I say play it once, as there is a lot of good material in there, but I wouldn't necessarily recommend paying full price for it, and I definitely wouldn't recommend trying to do New Game Plus or anything like that. One playthrough is plenty for me, at least.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still to this day Lies of P continues to be a favourite game of mine, this game is made for gamers of all skill level. Would recomend you play it. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best games oat. \n\nI genuinely think that this is the only worthy souls-like game. \n\nThe atmosphere, the gameplay, the bosses, the story - just everything is overwhelmingly good. \n\nEspecially the last boss of the DLC is just Peak Gaming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best Souls game not made by Fromsoftware that I've ever tried. The combat is extremely fun, the atmosphere and levels are gorgeous, and the characters are very well designed and written. I especially want to lend credit to the final boss of the DLC, who outranks a very large number of Fromsoftware bosses in my tier list.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best souls-likes I've ever played. Lies of P plays closer to Bloodborne if that's your Souls-like cup of tea",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game. The story and songs are beautifull and the gameplay is very fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from a developer that did not make a Soulslike in the past, it's just INCREDIBLE.\nI don't usually play NG+, but THIS was an exception...\n\nCan't wait for their next game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just... WOW. What a game that was.. my second ever soulslike, after Elden Ring. the difficulty and story both made me cry.. the music was beautiful on top of all that. beyond recomended to anyone who likes getting lost in a story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like the mechanics and the story so far. The art style and tone is absolutely beautiful! I haven't played a more horror oriented game, so it is a bit strange to me but I am still liking it a lot and can't wait to finish it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Wonderful soundtrack and a beautiful story. Highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A breakout triumph rivaling the slow burn critical adoration of FromSoftware's Demon's Souls followed by the wild success of Dark Souls. Except that Round8 & Neowiz never had a Demon's Souls, which makes this game all the more impressive. Excellent game, unbelievably excited for their next effort.\n\nMy main complaints: Technical issues, an overused enemy theme, a supremely annoying boss, and mechanical weirdness surrounding an NPC's questline. Truly, a Souls-like to it's core.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Suffice to say, there hasn't been a SINGLE souls-like game that I've ever wanted to play over and over again, let alone through new game plus and 100% all of the achievements. But Lies of P is just somehow a cut above the rest. All the challenge, typical mechanics, and brilliant level design of a legit FromSoft souls game, but with extra polish, clearer story, and addicting combat options make this game just... better to me. I seriously cannot wait for a potential sequel or continuation of the world of this game (pls Round 8 I beg you).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only thing that bothered me about this game when I finished it was that I wanted to play more, and then they released the dlc. Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my all time favorite games. The gameplay, soundtrack and storyline are all immaculate.\n\n10/10 the twink pinocchio game made me cry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never thought I'd play a singleplayer story game which takes about 40 hours to complete (with DLC) that much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lies of p is one of the best adaptation of a souls like game so much to do and boss are amazing and same with boss weapons parry makes the game evene better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though I've finished the game long time ago, I still remember the awesome soundtracks and the great story. It's obvious that this game is created with passion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First souls-like game I ever officially played and completed! Great art, great gameplay, overall one of the best souls-like games I have played since I started my journey! Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect Parry or you are dead.\r\n10/10 would break many more controllers for this game. Absolutely perfect.\r\n\r\nFrick u Laxasia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing souls-like, with one of the best stories and settings for the genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of P delivers a hauntingly beautiful, brutal experience that mixes the best of classic Souls-like combat with a gripping, twisted retelling of the Pinocchio story. Every battle is intense, every corner hides a new danger, and the atmosphere is rich with dark lore and intricate design. The world feels alive, and the gameplay is as satisfying as it is punishing.\n\nIf you’re a fan of challenging action RPGs, Lies of P is a must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but can we have the item's description to be more precise especially the numbers and what it does.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE play this game, base game and dlc both worth every second. The game quality of the game is either on-par or exceeds that of FromSoftware's Souls titles, and honestly is in my top three for best souls games out there (fromsoft included). PLAY IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of P is an absolute masterpiece of video games, honestly surpassing Dark Souls. The combat is so fluid and engaging, wrapped in a stunning original concept and a dark, unexpectedly great narrative. Even if you skip Souls-likes, there’s a \"weenie boy mode\" so you can easily jump in and experience the awesome world-building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed the main game. It was my first game in the very hard Souls like category. It was punishing in places but the story keep me pushing forward. The unique combo of weapons, arms, and throwables gave me many options in every fight. The sound track and environment gave a sad dark sense of the aftermath of something terrible.  After finishing the game I played it right through again to get the other ending. Took me a while to understand that lying is what makes you human because a robot can not lie. Then the DLC came out and I got sucked back in. This time I played with my daughter and she wanted to see every new weapon used. This forced me to play each new section with a new random weapon that my daughter picked and actually made the game alot of fun. I wasn't just using my favorite over powered weapon, I had to learn the play style of each new weapon the DLC introduced. And they are really creative, from a large pinwheel weapon that spins as you run to ramp up the damage or flame weapon that is a short range flame thrower. Each one makes you play totally differently.  The DLC added some nice behind the scenes of what lead up to the main game and why some of the things happened as they did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic game that requires you to learn the timings of enemies and bosses carefully and rewards this patience with flashy and punchy attacks and abilities. A very satisfying game to beat, when you put the time in to master it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of P, man. Hands down the best non-FromSoftware soulslike. I love the blending of a ton of Souls games concepts with its own unique touch that makes it feel very unique and stand apart from the others. The story and lore are super entertaining. The weapons and tools are very fun and creative, and they offer the potential for so many builds. A few of the bosses can be frustrating, but at the same time Lies of P has some of my favorite bosses in any game. The DLC is sooo good. I will continue to glaze this game and will likely buy whatever future titles they put out. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of Peak - \n\nIn my opinion the best souls-clone without the overly convoluted \"Environmental story telling\" of Souls in general with better music.\n\nThe DLC is absolute perfection",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best souls-likes out there. Challenging with a lot to unlock and plenty of endgame content to keep the player interested. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a person that has never played souls games this made me want to start.\r\nThe game is hard but never felt like a chore to play. The hardest bosses still felt manageable and parrying is so satisfying.\r\nFunny Pinocchio game is fun.\r\nUnreal has unreal visual quirks but unlike what i've heard of souls games it can run at any fps.\r\nMy computer crashed every now and then when playing on linux. Might be my problem tho, haven't checked. binged the whole game and had fun doing so. Even did a new game + run. made the last two bosses actually take more than 2 attempts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10\n\nOnly grievances I have with this game is how Fkn annoying it is that almost every boss has two phases. In Soulsborne games they are awesome because they are far between (rare). In this game you have to go in expecting every boss to have two phases. \n\nAlso, fk delayed attacks, its not natural and its trash game design, but at least it ain't as bad as in Elden Trash.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Love this game and its story. I cant wait until the second games comes out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imagine that Dark Souls and Bloodborne had a beautiful baby with a bunch of evil puppets.\r\n\r\nCombat = Impressive.\r\nStory = Depressive.\r\n\r\nI loved it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest souls-like, second place is not even close.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a must-play if you are a fan of soulslike games.\r\nAbsolute gem and the DLC is incredible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of P is a great game, and the only game i would consider a truly great souls-like not made by Fromsoftware, all while managing to have its own unique design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is absolutely the best Soulslike I've played recently. The OST in Overture, especially, is phenomenal, and the story progresses at a natural pace while also escalating in the best ways that don't seem contrived or necessary for Drama. Gameplay is smooth and pretty simple to progress, a lot of the upgrading and leveling up just comes at a natural pace, and you don't need to feel limited for what weapons/arms/P-Organ you upgrade on your first playthrough since, with New Game+ and beyond, you just get more upgrade materials on top of what you got prior.\n\nThat said, your upgraded gear can only take you so far. This is not a game where you can just spam vitality and face tank everything. Parrying is incredibly important to learn, and it will feel punishing for a bit a bit until you can get proficient at attack timings for different mobs and bosses. It CAN be frustrating, but it's also incredibly rewarding. There are few things more satisfying than watching the weapon of your opponent break because you parried them enough times for it to destroy it. This also has the added bonus of altering the effectiveness of the enemy you're fighting, since a broken weapon makes them less effective.\n\nSo overall, the game is amazing. Full price? Buy it. On sale? DEFINITELY buy it. And absolutely grab the DLC while you're at it, it's just as incredible as the main game is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good game. It's worth it \r\nSome bosses can be hard... but that is part of the experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely incredible game from start to finish but, not for everyone!\r\nIt is hard and will force you to get good and there is a variety of weapons to find out for your own playstyle.\r\nSound design is phenomenal especially the soundtrack.\r\nCombat system is good and it's similar to Sekiro's combat with a very tight parry timing.\r\nVoice acting is awesome, story is awesome, visually it looks good, a true masterpiece and a must play for the fans of the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun, responsive fun snappy combat. Really enjoyed the creative morbid lore based off a classic story. Give it a shot if you love soulslike and haven't tried it. Goes toe to toe with all From Software games. Will jump right into Overture as soon as I beat it. Sequel sounds like it's gonna be a banger x3 too from what the director just said.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's definitely got a learning curve, but nothing feels better than finally crushing that one boss you got stuck on. Such a beautiful world, and given the chance I'd reset my memory for a chance to rediscover it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of P is the most innovative souls game that I have ever played. The bosses, the soundtrack, the level design, just phenomenal a work of art. The combat is like a combination of Sekiro and Bloodborne. Weapon crafting system is tasteful and not over done. The overall level design is more linear but still very enjoyable to look around. Lastly, The Overture DLC cranks it up to 11 with more open levels, and even harder bosses. The achievement grind was still fun, giving you more runs to try out different builds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want to start off by saying that on steam I only have 4 hours in the game but I have played it on console since it launched (about 150 hours total) and let me tell you the game has just gotten better ever since. Lies of P was the first souls-like game I ever played, the genre can be a little daunting for most but Lies of P was a great first entry into it in my opinion. The story, characters, world, and visuals are all amazing, it left me wanting more not just from Lies of P but other games in the genre. Just like other soul-like games there is a good bit of replayability for this game, different builds, choices, endings, collectables, and you can do boss rush if that's your thing. Coming from mainly playing fps game there was a definite learning curve for me when it came to everything but the combat was the most difficult to get down, learning when to dodge, parry, attack, or just straight up run for my life. I haven't had the time to try out the DLC but I have heard that it is pretty good and added a good amount of new content for people that wanted more of the game. Yes you can change the \"difficulty\" of the game if your having a hard time. I know, I know a lot of people don't really like that feature for these games, but I think its especially nice for newer players to the genre who want a challenge but don't really want to be throwing their controller through a wall or smashing a keyboard. I played the game on controller because it just felt more natural for me and with other games like this it just seems to be the better choice overall. Whether the game is on sale or not it is a must buy if you have ever been interested in it or souls/souls-like games. I would absolutely recommend this game to anyone whether they are a seasoned souls player or someone new to this genre. Also the OST is phenomenal it fits the world and theme perfectly, I could sit and listen to Feel for hours and I did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ight so its good. like really good. I hate it too. How about I start with the fact that I first started playing Lies for free through the Game Pass. I had fun and was enjoying the challenge of the perfect guard with the dodge mechanic all the way till a particular boss fight that made me uninstall for months. I eventually came back and bought it on Steam and tried again ( I also learned that I screwed myself on the first run oops ). This was right around when the DLC came out, my friend got back into it and convinced me to try again. Finally I beat the boss I was so stuck on and even beat the game and DLC. Now I can say I have beaten the base game twice and DLC once, this is a solid souls like game only two souls like games I personally enjoyed more was Lords of the Fallen, and Code Vein. This game has a fantastic world built to explore and learn the lore or just to look at as your are fighting your way through enemies. Combat feels really good ( once you get the hang of the weapon building mechanic ) generally nothing too unfair or ridiculous that can't be learned/over came. Several fights I personally could just do without but otherwise I can say I enjoyed it and came back to play more. I am interested as to what they do with the next game that they tease atfter the ending. GIve it a shot you might like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of P was a game I was initially skeptical about playing because of the difficulty. Then for some reason I decided to try it and it became my favorite game that I've ever played. If you're thinking about playing it even if the souls-esqu style isn't yours then go for it. Love everything about this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lies of P is easily my favorite game of all time. it is innovative, with the legion system and the lie system. the art style is my favorite, especially in the opening, with the water coloring. the story was something new and refreshing, and despite being a little... on the nose... it had so many twists, I was still amazed by the ending. The DLC is the  best i have ever purchased. I commend the team, and i even nominated it for labor of love.\n\ni have purchased the base Game. twice, i preordered on console. the soundtrack. and The Overture.\n\nThis game drips with creativity, and soul.\n\npros\n- beautiful graphics\n- beautiful art style\n- innovative take on soulslike combat\n- FANTASTIC OST\n- fantastic characters\n- beautiful areas, that feel fluidlike, and have good puzzles and flow.\n\ncons (i genuinely cannot find a \"Real\" one, with 139.9 hours)\n- not enough legion plugs in the base game to max out all the arms\n- i genuinely want a mobile record player\n\nTo the devs.\n\nI love Lies of P. i was drawn to it because of fond memories, but i was captivated by it's innovation. I hope you continue pushing forward, creating more fantastic games, like Skull the hero slayer, metal unit, and yes Lies of P.\n\nOverture was a beautiful prequel, to an already perfect game. i was not only blown away by the story, and boss design, but the amount of lore you added.\n\nfrom the bottom of my heart. thank you, for the most incredible game, i have ever played.\n\nsigned, an appreciative fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a game just as good as a fromsoft souls game, best soulslike out there, fantastic from start to finish, also best souls/soulslike game in terms of innovative mechanics. Story is fantastic as well, can't wait for the sequel!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best souls-likes to do it other then Fromsoft itself. It gives a good story to follow and read with sekiro/bloodborne inspired combat system against puppets, undead, and humans alike as a drippy puppet with an array of regular (can mix and match heads/handles) and boss weapons, can't wait for the sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a wonderous look into the great wonders of technology and the stupidity of morons that think they know whats for the best..... like certain people who may or may not keep screwing everyone else over",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favourite souls likes. Combat, exploration, story, graphics, music, general vibes.it all fits well together. My complains would amount to nitpicking some enocunters as not being fun to fight against but that's the case for all Souls likes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly one of the best supported games this year, and one of my favourite souls like game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game on three different systems, xbox one, ps5, and on pc. Ive beaten this game several times and its still is my all time favorite soulslike game. I would go back every once in a while and beat the story in a day or two then give it some time so i can try remember the storyline and the characters. Gameplay is a 10 out of 10. Fighting/Deflecting is hard to get down but its what makes this game its own unique way. Such as the p-organ, the upgrading of the veingini's arms, to upgrading the handle and blade of your weapons. \r\nThe story of this game is amazing. Im still intrigued into where the next game will lead too. They take their time on perfecting their work. I hope for the best for this studio and great things will come from this type of story telling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very well made Souls Like with a rich story that I was invested in. Plus you do not need to read all the item descriptions to get the gist of the story, which is one of the quirls I have with Souls Likes. Combat is also on par with From Software, if not even a bit better in some areas. Definitely give it a try, especially if you are into more \"dark\" storylines! Also great for \"hobby\" players, since there are easier difficulties for those that do not like getting frustrated.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I love this game but in its current state i cant recommend the game on steam, you would honestly be better off looking at a console copy to avoid issues the devs have been ignoring all year.\n\nPoor frame pacing and shader stutter issues have plagued this game since the launch of the DLC and most of the latest graphics cards seem to be effected, the devs have proven that they are happy to ignore this issue without any kind of acknowledgment that a problem even exists. \n\nIf you own a 50 series card from nvidia or a 90 series card from AMD i would avoid this game until the community forum stops talking about FPS issues.\n\nI suspect the devs wont look into this or ask GPU vendors to look into driver fixes until reviews start to hit mixed or lower.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "Fantastic game, played perfectly on my 3070 PC but upgraded to a 5080 and now the game barely runs, fatal error crashes after about 10mins of playing, dlss runs poorly, using AMD FSR helped with the frame stutters but the crashing persists. Will change to a Thumbs up if this is fixed, its a known issue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Soulslikes really are video game royalty: capriciously cruel, inexplicably beloved, and so massively inbred they all share the DNA of a handful of decrepit progenitors. How this genre continues to thrive with practically everyone slavishly copying FromSoftware is beyond me. Very rarely is there an infusion of new blood, and then we're treated to a masterpiece like Hollow Knight or the better of the two Nioh games. Lies of P is what happens the rest of the time. \n\nIt's strangely appropriate that a game loosely based on The Adventures of Pinocchio imitates Bloodborne with all the inarticulate clumsiness of a wooden puppet. Tone, atmosphere, and even entire story beats are lifted wholesale. Stop me if you've heard this one before. The city of [strike]Yharnam[/strike] Krat, elevated to widespread renown through the miraculous properties of a mysterious substance known as [strike]The Old Blood[/strike] Ergo, is suffering from an outbreak of an unknown disease, possibly connected to a sinister, cult-like organization called [strike]The Healing Church[/strike] The Alchemists. You are a [strike]Hunter[/strike] Stalker, newly awakened in [strike]Yharnam[/strike] Krat, navigating a city on the brink of ruin, all the while trying to figure out exactly what is going on and how to stop it. \n\nCombat mechanics focus on blocking, rather than dodging (which is a lot weaker than in the Soulsborne games), as Lies of P fuses Bloodborne's rally with Sekiro's deflection, distorting both in the most annoying way possible. An imperfectly-timed block leads to stamina drain and chip damage that can be healed by landing attacks, while a perfectly-timed one will prevent all damage and simultaneously reduce the posture of your opponent. Do enough posture damage, and you can open them up to a finishing move.\n\nIt should already be clear this kind of system encourages defensive play, with perfect guarding and countering taking the place of Sekiro's continuous aggression or Bloodborne's fighting through incoming attacks. Thus, the game becomes slower, more tedious, and more static, with no tangible benefits in exchange. Even worse, bosses frequently have uninterruptible multi-hit combos, forcing you to block or parry until you can finally “take your turn”. Patiently waiting while a lady dressed in a metal gimp suit does her best combine harvester impression a few inches from my face is not my idea of fun. \n\nThe reduction of the parry window (Sekiro's 12 frames to Lies of P's 8) makes fighting inconsistent and unrewarding. Several times I went from barely doing any damage to a boss during one attempt to instantly defeating it the next, because I was suddenly perfectly guarding all of its attacks. There was no learning process or gradual accumulation of mastery, which felt wholly unsatisfying, like winning had nothing to do with anything I did. \n\nNot that there's much satisfaction to be found anywhere in the game. The bosses are an unhealthy combination of too easy and too frustrating. I repeatedly noticed a fight that was over in 30-40 minutes felt like it had taken hours. Time sure drags on when you're not having any fun. However, even at its most punishing (probably sometime around the two-thirds mark in the main game or at the very end of the DLC), Lies of P never quite matches the sheer sadism of the Souls series, let alone Elden Ring. This actually makes the game less engaging, since it's just not hard enough to create immersion through difficulty. \n\nOutside of boss and miniboss encounters, the levels are so forgettably bland, I'm already having trouble remembering anything about them. Was there a factory and maybe a train station? What is the point of all the fancy textures when every area is designed like the digestive tract of a nematode? Half the appeal of Soulslikes is exploration. You can jump over a suspiciously low balcony railing or step into an innocuous-looking painting and end up in a completely new world. Here everything is so linear it might as well be on-rails.\n\nWhat is this game even about? Parts of it don't make any sense. There is a core mechanic that ties your character's humanity to his ability to tell lies. The more human and less puppet-like you become by the end of the game, the better the final ending. Now, it would seem to me that having to constantly lie to get the best ending makes you just as lacking in self-determination as a puppet that is programmed to only tell the truth, but what would I know? Concepts like “ludonarrative dissonance” are ultimately meaningless when neither the “ludum” nor the “narrative” is interesting enough to be worth analyzing.\n\nI did not enjoy my time with Lies of P. The most remarkable thing about it is that Neowiz took two pretty good combat mechanics and combined them together into one really bad one. The level design is feeble. The story is derivative. The bosses are annoying. Being able to recombine the handles and blades of various weapons would have been cool if fighting anything was actually fun. Instead, it's as irritating and pointless as everything else in the game. There is nothing here save for mediocrity. A pale imitation of Bloodborne made slightly more unpleasant for no good reason. About as entertaining and immersive as a marching down a corridor, ankle-deep in tepid piss.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I may get heat for this but it's just worse than every souls game out there (yes, even ds2). It's actually not a bad game for souls players to kill time in but if you haven't already played all the souls games including sekiro then just go do that.\n\nThe game's strongest point is that it is gorgeous. Probably the nicest looking soulslike. \n\nThe story is quite good, or at least better than any souls game apart from sekiro, which is not saying much,\n\nThe level design is fine I guess. I think too many enemies were reused but whatever. It's serviceable.\n\nThe main thing that stuck with me is how much the bosses suck. There doesn't seem to be any sort of design philosophy at all when it comes to them, which is strange because I feel like the bosses are the whole point of a soulslike. The bosses alternate between extremely easy and quite difficult seemingly at random, but the difficult bosses are only that way because they flail around unpredictably and have long attack combos with different variations. There are a few exceptions but tbh the game is quite easy... until the true ending final boss, where suddenly it felt like I had to relearn the game. I think I spent almost half my total playtime on the final boss. The parry sucks and feels bad throughout the entire game (I think it's got a 1/3 shorter window than sekiro's parry) but is necessary to learn for the true ending boss, which I really struggled with. Each phase of this fight is actually quite strong on its own, but the second phase has nothing in common with the first phase so you may as well be fighting two completely different bosses. \n\nIt's hard to put my finger on this next point, but I felt that the game had a satisfaction problem. None of the bosses or levels ever made me feel accomplished for beating them like I would in dark souls or elden ring. Even the final boss, challenging as it was, left me unsatisfied.\n\nOverall it left me feeling very underwhelmed. Though I gave it a thumbs down to balance the overwhelming positive reviews, I would still recommend this to people who have played all the souls games. If you haven't, then give this a pass. Elden Ring, Sekiro and DS3 are far more worth your time and money.\n\nedit: just adding a disclaimer that I did not really engage with the arms or the fable arts. I beat the game purely with light and heavy attacks, with the chinese glaive you get at the start. Maybe the satisfaction problem stems from the way I played it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly disappointed by this. Pretty forgettable bosses and music. I didn't care about the story at all. The dungeons range from alright to terrible and get worse as the game goes on. I enjoyed the general gameplay and weapon assembly mechanic, but I think people overhyped this one. \nAt least it's better than Elden Ring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I swear to god if I find ONE MORE  multi phase boss-fight I'm switching it to negative!\nGood game though.\n*EDIT* found another one >:(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ich kann das Geld leider nicht zurück geben.\r\ndas Kampfsystem ist absolut nichts für mich, Parry und Dodge in diesem Spiel geht gar nicht für mich. Schwere Waffen sind unbrauchbar.\r\nAnsprechende Optik und läuft gut.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Subpar Bloodborne ripoff\r\n\r\nFor a fast paced action game it feels really clunky, on top of that there are many systems working together at once that make this game a lot more complicated than its contemporaries.\r\nLegion Arms\r\nSpecial Moves\r\nStamina/Poise/Parries\r\nStatus Effects (which are everywhere during the endgame)\r\nAnd to top it all off there's a shitty durability mechanic to make your waste your time during the heat of battle.\r\nIts a lot to juggle all at once. And during downtime segments there's an annoying side character who constantly chatters in your ear.\r\n\r\nThe game isn't terrible, but the third act really dragged when enemies and bosses started getting reused.\r\nSome things I really liked were the customizable weapons and parry breaking the enemies.\r\n\r\nI'd really only recommend this one to soulsborne fans who already have played the greatest hits and need something else.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful and original world design, insane ececution on the vibe and style. It's steampunk though, which I personally don't like.\nFrame stutter issues, random lag spikes, buggy movement, been stuck in walls several times, have to fight a gang of bosses and get rushed by several sides instead of focusing on one enemy to parry.\nGameplay feels good if it works, camera is utterly annoying.\nNo active updates or focus from the devs, very sad state.\n\nRyzen 7 5800X3D AMD Radeon RX 7900 XTX, m.2 SSD 64 GB DDR4 RAM.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is interesting, but the frame stuttering is crazy. \n\n5080 with 9800x3D on 1440p caps out around 40% GPU usage and 20% CPU at max settings and 120 FPS cap. Frames drop down into the 70s still. \n\nChanged the in game settings to unlimited frames and capped at 120 in Nvidia app and it is better but still has issues.\n\nAfter beating it update: Can be frustrating at times. Some enemies and bosses feel a little cheap or just difficult in ways that are for difficulty's sake instead of challenge. The lack of hyper armor on heavy attacks for bigger slower weapons is a major downside when enemies with smaller weapons have hyper armor on non red glowing attacks. \n\nAlso, if you see an item next to a corner or on a piece of wood sticking out over an abyss, expect a hidden enemy 8/10 times. Those types of things are tradition in a soulslike, but this game uses it a little too often.\n\nOverall, wouldn't recommend on steam because of the graphical issues, but the game is worth a shot if the issues listed above aren't deal breakers for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me, but I think it's because the dodge timing feels really weird and the mechanics felt too forced.\n\nAnother \"souls like\" that isn't a souls game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I come back to finish the game. Fatal error after 2 minutes of booting up the game every single time. I can't do anything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is literally unplayable. Every time the shaders get done compiling theres a fatal error and it crashes. If I uninstall and redownload it though I'm able to get the first play session going but once I exit the game the fatal error happens again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's have a long ass questline with riddles, then have a riddle 25 hours into the game with a stupid answer that makes no sense and the only way to recover the questline is with a quest item which there's only one in the game and you need to use it earlier for a different quest so you've botched the questline completely in this playthrough. And you have people fixing your stupid game with console mods so you can actually get the fuckin apple and complete the quest. This completely ruined my playthrough to the point I don't even wanna continue the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Looks pretty and plays ok but is pretty boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Не стоит того. \r\n\r\nПопытка сделать свой бладборн, взяв худшее из соулсов - на мой взгляд провалена. Игра абсолютно перегруженна механиками, системами улучшений, консюмаблами на все случаи жизни и прочим микроменджементом, явно выдающими разрабов корейских гриндилных параш. \r\nАдаптация ралли из бладборна только отвлекает. \r\nВраги дергаются, как на рейве, тяжело отличать анимации атак от фоновых. Их размеры, скорость ходьбы, скорость атак, ренджа атак - никак не коррелируют между собой.\r\nКомпоновка врагов и их расстановка в засады в лучших традициях длц от фромов, но уже на 3й час игры, так что исследование мира только раздражает. \r\nНовые оружия попросту лень пробовать из-за системы их прокачки. \r\n\r\nХороший мир и зачатки боевки в итоге не стоят даже понижения сложности.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "absolutely unfun jump and run sections",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was really looking forward to this game which was supposed to be something new and fresh in the souls-like genre. However, I found it quite formulaic - the usual \"Oh, look, here you can open a shortcut\", \"here is a mysterious character who givers you some hints and when you look around a lot, you can find out something about him\" etc. \r\nGraphics is nice, but it is not better than, for example, Steelrising (which has a similar atmosphere in some parts).\r\nBut of course Soulslikes live and die with the fighting system. Lies of P relies very heavily on guarding / perfect guarding. If you are (like me) not able to consistently do the perfectly timed guard, fights become difficult and you always feel like you miss out. You can still manage by reducing the difficulty one level, but this just changes the damage done by opponents, it does not change the time windows for parrying (like you could do in SW Jedi Survivor) or the speed of the boss moves or anything else. Add to that that many envioronments are really darkish so that actually seeing the opponents moves is not that easy. \r\nThere is also one boss fight towards the end with the usual \"Boss flies into the air and hits you with ranged attacks and then slams down\", but here there are lots of electric flashes which sometimes makes  it difficult to actually see what is going on.\r\nIt may be only me or my controller, but frequently the game did not react to something I did, especially using healing items, so I found myself hitting the button again and again. (You also have only one item on the shortcut key and need to switch the item if you want to use something else which is not a gamebreaker, but somewhat annoying.)\r\nItems and special abilities (like the Legion arms Aegis charge) are also not well explained in may cases leaving you puzzled what they actually do and how to use them.\r\n\r\nAll in all, it's not a bad game and if you like soulslikes you will probably have fun, but it is also not a great game, rather o.k.-ish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First half is a 10/10 souls game\r\nSecond half they forgot they were trying to be a soulslike and turned the game into sekiro but with dogwater parrying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story line is good, the combat is mostly tolerable, but it just does not follow through with the weapon system.  You want to mix and match blades and handles?  Great, that's fine; but the sheer fixed rarity of boss weapon upgrade materials and cranks to boost weapon handle scaling towards strength or dexterity defeats that premise in a way that comes off as a half-measure at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "temu version of bloodborne and sekiro. trying way too hard to be difficult for the sake of being difficult. the parry system is useless. absurd amounts of status affects. the story is however 10/10 . i completed the game. didnt really enjoy it. i just wanted to see what the hype about this game is all about. people meat ride this game just so that they can shit on fromsoft games to look cool or whatever. buy it during deep discounts only.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's an intresting game and some good fun if you like Bloodborne.\nThe fact it's clearly meant to be a Bloodborne clone is the reason I can't recommend it.\nIt tries to have the same fast-paced and interactive combat but ignores your button inputs if the last nanosecond of your previous animation is still going. Making using items or perfect blocking very frustrating when it matters.\nEverything outside from bossfights is repetitive and drawn out. And some of the later bossfights just come down to \"fully study my moveset for the next 15min\".\nIt was a fun game for the first half but became a chore for the second half.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the first half the game a lot. Felt it dragged on in the second half but I think I was just getting tired of playing it. Every boss having 2nd phases was getting annoying. I think those should be used more sparingly. Overall it was an okay game but I can't say I reccomend it. If they make a sequel I might check it out. A few nitpicks that I didn't like. \r\n\r\nLeveling felt weak. Capacity being the most invested stat didn't feel great. I think I ended the game with my damage stat being at like 30. It just feels not great to level. \r\nThe Handles and blades felt cool but under utlized. \r\nSome bosses lacked visual clarity on what they were doing. First timing a boss is unlikely. Though with so little bosses maybe its okay.\r\nMost bosses having 2 health bars just made the fight endurance slogs.\r\nOh and potentially ruining character quests by choosing the wrong dialogue option in a timed window? Don't do that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Difficult at times to navigate, no main map, no mini-map, no compus, no yellow things, no golden strand... nadda.\nAlso you cannot check on your quest progress or even check what your suposed to be doing... Waste of $60",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Easiest mode is too hard, and frustrating . Not fun at all , want to play a game and experience it. Don`t want to sit hours on a boss fight just to have another harder boss next. Waste of time. Be prepared to waste a lot of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While I would love to suggest this game to others, I just can't. It's broken on PC. I got a good way through it, really enjoying the game. I am extremely annoyed at how UNOPTIMIZED it is. Fatal errors will pop up now when I try to progress through one of the later zones. After all my reading and tinkering, no solution has been found. I'm just one of many who wasted their money and got teased with a fun game and good story. \r\n\r\nIf you're going to play this game, play it on console so you can actually finish it. The game itself is good, but 0/10 on playability on PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so far this game is ass. only the tutorial feels like dark souls and its on WALK TROUGH mode bru. idk maybe i will play this game later. but im here for the story twin... not dark souls like battle w normal enemies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't think this is a terrible game but if you played Dark Souls and are thinking should I play this, I recommend playing Dark Souls again instead and if you played Dark Souls again instead, I recommend playing Dark Souls for the third time instead...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very bland souls like.\nThe weapon customization feels insignificant which reduces a lot the diversity in combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has very nice visuals and performance for me exceeds 120fps  at 1440p on a 7900xt (which is rare these days) the levels and world look very good. my problem is first with some level design, some boss battles' area needs to be a bit larger. another problem is that since this game allows you to change difficulty to easy, it is not a soulslike and even then it's mediocre if it were to be considered another genre. enemy variety sucks and gets super boring after 10-15 hrs. But on a positive note, I was able to speed through, lowering difficulty since it was so boring I wanted to be done with it. Not only that, there was a lack of outifits and weapons that suit my style (most were heavy). This game is below average. There aren't even any waifu bosses either to compensate for this dull game. and the sharpening your weapon mechanic is retarded... having to sharpen my blade mid boss battle smh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For the third time I'm trying this game and trying to write a negative comment. This game style is not for me. Ciao.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I regret buying this game. Even on sale, it Doesn\"t feel worth it. The world's representation feels nihilistic, dark, empty and filled with lifeless dolls. The character's movement is too slow, and there's no option to sprint. There's also no minimap. Despite that, I haven't finished the game yet Unlike games such as Star Wars, Nioh, or elden ring, Which present living worlds that players can truly feel connected to, Lies of p feels nihilistic cold and devoid of life. I quit :3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has been fun, but the parrying window is infuriatingly unclear. I'm not pouring hundreds of hours into figuring this shit out. Sekiro was fine, but it's fucking cancer in this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who was this game made for?\n\nAdult gamers with lives/responsibilities? No, clearly not. This game absolutely does not respect the time of people who can't sit in front of a screen for hours/days, masochistically \"learning\" all the crack-brained, hypertuned boss fights, that are measurably more of a chore then most FromSoft bosses (relevant since it's always been obvious what the devs here have been chasing.)\n\nZoomers? Doubtful. Zoomers don't read and can't spell, So outside of (maybe) a vague knowledge of the existence of Le Disney Pinocchio Character From Kingdom Hearts™, they don't know the nuance on display here, the subtle nods to other classic literary characters/works; it's entirely lost on them. (Maybe they know who \"Dorothy\" is, I'll give them that frfr)\n\nThe bottom line: this game wasn't actually made for anyone who exists in the real world, who isn't a middle-aged loser with tons and tons of time on their hands, who also happens to be \"well read\" from their time in grade school, 25-30 years ago.\n\nIt looks good, and it sounds good. That's it. Don't waste your money if you consider yourself a fully-functioning adult, or a zoomzoom that can't spell/never cracked open a book in their lives. Everyone else have at it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "как будто че то не то хз \nесли отдельно от жанра рассматривать может и норм",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Keeps crashing whenever playing on my macbook pro, with M1 pro chip and 16 gb of ram. Dont know why but kinda sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst sould like ever.Not buy if you are expecting another sekiro.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well I am die hard souls like game fan but this just doesn't feel right",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lie of p fatal error.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad dlc and not worth the money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parry var Bok gibi, Kol var bok gibi, map var bok gibi, boss var bok gibi.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "huinya",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dumb",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game but in its current state i cant recommend the game on steam, you would honestly be better off looking at a console copy to avoid issues the devs have been ignoring all year.\n\nPoor frame pacing and shader stutter issues have plagued this game since the launch of the DLC and most of the latest graphics cards seem to be effected, the devs have proven that they are happy to ignore this issue without any kind of acknowledgment that a problem even exists. \n\nIf you own a 50 series card from nvidia or a 90 series card from AMD i would avoid this game until the community forum stops talking about FPS issues.\n\nI suspect the devs wont look into this or ask GPU vendors to look into driver fixes until reviews start to hit mixed or lower.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "Fantastic game, played perfectly on my 3070 PC but upgraded to a 5080 and now the game barely runs, fatal error crashes after about 10mins of playing, dlss runs poorly, using AMD FSR helped with the frame stutters but the crashing persists. Will change to a Thumbs up if this is fixed, its a known issue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Soulslikes really are video game royalty: capriciously cruel, inexplicably beloved, and so massively inbred they all share the DNA of a handful of decrepit progenitors. How this genre continues to thrive with practically everyone slavishly copying FromSoftware is beyond me. Very rarely is there an infusion of new blood, and then we're treated to a masterpiece like Hollow Knight or the better of the two Nioh games. Lies of P is what happens the rest of the time. \n\nIt's strangely appropriate that a game loosely based on The Adventures of Pinocchio imitates Bloodborne with all the inarticulate clumsiness of a wooden puppet. Tone, atmosphere, and even entire story beats are lifted wholesale. Stop me if you've heard this one before. The city of [strike]Yharnam[/strike] Krat, elevated to widespread renown through the miraculous properties of a mysterious substance known as [strike]The Old Blood[/strike] Ergo, is suffering from an outbreak of an unknown disease, possibly connected to a sinister, cult-like organization called [strike]The Healing Church[/strike] The Alchemists. You are a [strike]Hunter[/strike] Stalker, newly awakened in [strike]Yharnam[/strike] Krat, navigating a city on the brink of ruin, all the while trying to figure out exactly what is going on and how to stop it. \n\nCombat mechanics focus on blocking, rather than dodging (which is a lot weaker than in the Soulsborne games), as Lies of P fuses Bloodborne's rally with Sekiro's deflection, distorting both in the most annoying way possible. An imperfectly-timed block leads to stamina drain and chip damage that can be healed by landing attacks, while a perfectly-timed one will prevent all damage and simultaneously reduce the posture of your opponent. Do enough posture damage, and you can open them up to a finishing move.\n\nIt should already be clear this kind of system encourages defensive play, with perfect guarding and countering taking the place of Sekiro's continuous aggression or Bloodborne's fighting through incoming attacks. Thus, the game becomes slower, more tedious, and more static, with no tangible benefits in exchange. Even worse, bosses frequently have uninterruptible multi-hit combos, forcing you to block or parry until you can finally “take your turn”. Patiently waiting while a lady dressed in a metal gimp suit does her best combine harvester impression a few inches from my face is not my idea of fun. \n\nThe reduction of the parry window (Sekiro's 12 frames to Lies of P's 8) makes fighting inconsistent and unrewarding. Several times I went from barely doing any damage to a boss during one attempt to instantly defeating it the next, because I was suddenly perfectly guarding all of its attacks. There was no learning process or gradual accumulation of mastery, which felt wholly unsatisfying, like winning had nothing to do with anything I did. \n\nNot that there's much satisfaction to be found anywhere in the game. The bosses are an unhealthy combination of too easy and too frustrating. I repeatedly noticed a fight that was over in 30-40 minutes felt like it had taken hours. Time sure drags on when you're not having any fun. However, even at its most punishing (probably sometime around the two-thirds mark in the main game or at the very end of the DLC), Lies of P never quite matches the sheer sadism of the Souls series, let alone Elden Ring. This actually makes the game less engaging, since it's just not hard enough to create immersion through difficulty. \n\nOutside of boss and miniboss encounters, the levels are so forgettably bland, I'm already having trouble remembering anything about them. Was there a factory and maybe a train station? What is the point of all the fancy textures when every area is designed like the digestive tract of a nematode? Half the appeal of Soulslikes is exploration. You can jump over a suspiciously low balcony railing or step into an innocuous-looking painting and end up in a completely new world. Here everything is so linear it might as well be on-rails.\n\nWhat is this game even about? Parts of it don't make any sense. There is a core mechanic that ties your character's humanity to his ability to tell lies. The more human and less puppet-like you become by the end of the game, the better the final ending. Now, it would seem to me that having to constantly lie to get the best ending makes you just as lacking in self-determination as a puppet that is programmed to only tell the truth, but what would I know? Concepts like “ludonarrative dissonance” are ultimately meaningless when neither the “ludum” nor the “narrative” is interesting enough to be worth analyzing.\n\nI did not enjoy my time with Lies of P. The most remarkable thing about it is that Neowiz took two pretty good combat mechanics and combined them together into one really bad one. The level design is feeble. The story is derivative. The bosses are annoying. Being able to recombine the handles and blades of various weapons would have been cool if fighting anything was actually fun. Instead, it's as irritating and pointless as everything else in the game. There is nothing here save for mediocrity. A pale imitation of Bloodborne made slightly more unpleasant for no good reason. About as entertaining and immersive as a marching down a corridor, ankle-deep in tepid piss.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I may get heat for this but it's just worse than every souls game out there (yes, even ds2). It's actually not a bad game for souls players to kill time in but if you haven't already played all the souls games including sekiro then just go do that.\n\nThe game's strongest point is that it is gorgeous. Probably the nicest looking soulslike. \n\nThe story is quite good, or at least better than any souls game apart from sekiro, which is not saying much,\n\nThe level design is fine I guess. I think too many enemies were reused but whatever. It's serviceable.\n\nThe main thing that stuck with me is how much the bosses suck. There doesn't seem to be any sort of design philosophy at all when it comes to them, which is strange because I feel like the bosses are the whole point of a soulslike. The bosses alternate between extremely easy and quite difficult seemingly at random, but the difficult bosses are only that way because they flail around unpredictably and have long attack combos with different variations. There are a few exceptions but tbh the game is quite easy... until the true ending final boss, where suddenly it felt like I had to relearn the game. I think I spent almost half my total playtime on the final boss. The parry sucks and feels bad throughout the entire game (I think it's got a 1/3 shorter window than sekiro's parry) but is necessary to learn for the true ending boss, which I really struggled with. Each phase of this fight is actually quite strong on its own, but the second phase has nothing in common with the first phase so you may as well be fighting two completely different bosses. \n\nIt's hard to put my finger on this next point, but I felt that the game had a satisfaction problem. None of the bosses or levels ever made me feel accomplished for beating them like I would in dark souls or elden ring. Even the final boss, challenging as it was, left me unsatisfied.\n\nOverall it left me feeling very underwhelmed. Though I gave it a thumbs down to balance the overwhelming positive reviews, I would still recommend this to people who have played all the souls games. If you haven't, then give this a pass. Elden Ring, Sekiro and DS3 are far more worth your time and money.\n\nedit: just adding a disclaimer that I did not really engage with the arms or the fable arts. I beat the game purely with light and heavy attacks, with the chinese glaive you get at the start. Maybe the satisfaction problem stems from the way I played it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I swear to god if I find ONE MORE  multi phase boss-fight I'm switching it to negative!\nGood game though.\n*EDIT* found another one >:(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly disappointed by this. Pretty forgettable bosses and music. I didn't care about the story at all. The dungeons range from alright to terrible and get worse as the game goes on. I enjoyed the general gameplay and weapon assembly mechanic, but I think people overhyped this one. \nAt least it's better than Elden Ring.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If there was a mixed button it would get it.\nI dont have a big problem with the gameor anything but to fully recommend for this price+dlc it should be a little better.\n\nThe performance is top, 2k 144fps all the time. Visually stunning and a really nice world (exept for some parts.)\n\nSounds and Music is also very good! Mechanic where u can put the handle on diffrent heads was really new and good! Even the story isbetter then expected but..\n\nThe Combat doesnt feel... Crisp to me. They try to mix bloodborne and Sekrio together which should be no problem but they just didnt manage that. \nBoss designe is cool from the looks but the balancing and patterns... wow 50% of the bosses are utter garbage. And for soulslike its half of why you play the game.\n\nThe Dlc has the same problem. Specially with the bosses. Shame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ich kann das Geld leider nicht zurück geben.\r\ndas Kampfsystem ist absolut nichts für mich, Parry und Dodge in diesem Spiel geht gar nicht für mich. Schwere Waffen sind unbrauchbar.\r\nAnsprechende Optik und läuft gut.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Subpar Bloodborne ripoff\r\n\r\nFor a fast paced action game it feels really clunky, on top of that there are many systems working together at once that make this game a lot more complicated than its contemporaries.\r\nLegion Arms\r\nSpecial Moves\r\nStamina/Poise/Parries\r\nStatus Effects (which are everywhere during the endgame)\r\nAnd to top it all off there's a shitty durability mechanic to make your waste your time during the heat of battle.\r\nIts a lot to juggle all at once. And during downtime segments there's an annoying side character who constantly chatters in your ear.\r\n\r\nThe game isn't terrible, but the third act really dragged when enemies and bosses started getting reused.\r\nSome things I really liked were the customizable weapons and parry breaking the enemies.\r\n\r\nI'd really only recommend this one to soulsborne fans who already have played the greatest hits and need something else.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful and original world design, insane ececution on the vibe and style. It's steampunk though, which I personally don't like.\nFrame stutter issues, random lag spikes, buggy movement, been stuck in walls several times, have to fight a gang of bosses and get rushed by several sides instead of focusing on one enemy to parry.\nGameplay feels good if it works, camera is utterly annoying.\nNo active updates or focus from the devs, very sad state.\n\nRyzen 7 5800X3D AMD Radeon RX 7900 XTX, m.2 SSD 64 GB DDR4 RAM.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is interesting, but the frame stuttering is crazy. \n\n5080 with 9800x3D on 1440p caps out around 40% GPU usage and 20% CPU at max settings and 120 FPS cap. Frames drop down into the 70s still. \n\nChanged the in game settings to unlimited frames and capped at 120 in Nvidia app and it is better but still has issues.\n\nAfter beating it update: Can be frustrating at times. Some enemies and bosses feel a little cheap or just difficult in ways that are for difficulty's sake instead of challenge. The lack of hyper armor on heavy attacks for bigger slower weapons is a major downside when enemies with smaller weapons have hyper armor on non red glowing attacks. \n\nAlso, if you see an item next to a corner or on a piece of wood sticking out over an abyss, expect a hidden enemy 8/10 times. Those types of things are tradition in a soulslike, but this game uses it a little too often.\n\nOverall, wouldn't recommend on steam because of the graphical issues, but the game is worth a shot if the issues listed above aren't deal breakers for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me, but I think it's because the dodge timing feels really weird and the mechanics felt too forced.\n\nAnother \"souls like\" that isn't a souls game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I come back to finish the game. Fatal error after 2 minutes of booting up the game every single time. I can't do anything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is literally unplayable. Every time the shaders get done compiling theres a fatal error and it crashes. If I uninstall and redownload it though I'm able to get the first play session going but once I exit the game the fatal error happens again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let's have a long ass questline with riddles, then have a riddle 25 hours into the game with a stupid answer that makes no sense and the only way to recover the questline is with a quest item which there's only one in the game and you need to use it earlier for a different quest so you've botched the questline completely in this playthrough. And you have people fixing your stupid game with console mods so you can actually get the fuckin apple and complete the quest. This completely ruined my playthrough to the point I don't even wanna continue the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Looks pretty and plays ok but is pretty boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Не стоит того. \r\n\r\nПопытка сделать свой бладборн, взяв худшее из соулсов - на мой взгляд провалена. Игра абсолютно перегруженна механиками, системами улучшений, консюмаблами на все случаи жизни и прочим микроменджементом, явно выдающими разрабов корейских гриндилных параш. \r\nАдаптация ралли из бладборна только отвлекает. \r\nВраги дергаются, как на рейве, тяжело отличать анимации атак от фоновых. Их размеры, скорость ходьбы, скорость атак, ренджа атак - никак не коррелируют между собой.\r\nКомпоновка врагов и их расстановка в засады в лучших традициях длц от фромов, но уже на 3й час игры, так что исследование мира только раздражает. \r\nНовые оружия попросту лень пробовать из-за системы их прокачки. \r\n\r\nХороший мир и зачатки боевки в итоге не стоят даже понижения сложности.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "absolutely unfun jump and run sections",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was really looking forward to this game which was supposed to be something new and fresh in the souls-like genre. However, I found it quite formulaic - the usual \"Oh, look, here you can open a shortcut\", \"here is a mysterious character who givers you some hints and when you look around a lot, you can find out something about him\" etc. \r\nGraphics is nice, but it is not better than, for example, Steelrising (which has a similar atmosphere in some parts).\r\nBut of course Soulslikes live and die with the fighting system. Lies of P relies very heavily on guarding / perfect guarding. If you are (like me) not able to consistently do the perfectly timed guard, fights become difficult and you always feel like you miss out. You can still manage by reducing the difficulty one level, but this just changes the damage done by opponents, it does not change the time windows for parrying (like you could do in SW Jedi Survivor) or the speed of the boss moves or anything else. Add to that that many envioronments are really darkish so that actually seeing the opponents moves is not that easy. \r\nThere is also one boss fight towards the end with the usual \"Boss flies into the air and hits you with ranged attacks and then slams down\", but here there are lots of electric flashes which sometimes makes  it difficult to actually see what is going on.\r\nIt may be only me or my controller, but frequently the game did not react to something I did, especially using healing items, so I found myself hitting the button again and again. (You also have only one item on the shortcut key and need to switch the item if you want to use something else which is not a gamebreaker, but somewhat annoying.)\r\nItems and special abilities (like the Legion arms Aegis charge) are also not well explained in may cases leaving you puzzled what they actually do and how to use them.\r\n\r\nAll in all, it's not a bad game and if you like soulslikes you will probably have fun, but it is also not a great game, rather o.k.-ish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First half is a 10/10 souls game\r\nSecond half they forgot they were trying to be a soulslike and turned the game into sekiro but with dogwater parrying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story line is good, the combat is mostly tolerable, but it just does not follow through with the weapon system.  You want to mix and match blades and handles?  Great, that's fine; but the sheer fixed rarity of boss weapon upgrade materials and cranks to boost weapon handle scaling towards strength or dexterity defeats that premise in a way that comes off as a half-measure at best.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "temu version of bloodborne and sekiro. trying way too hard to be difficult for the sake of being difficult. the parry system is useless. absurd amounts of status affects. the story is however 10/10 . i completed the game. didnt really enjoy it. i just wanted to see what the hype about this game is all about. people meat ride this game just so that they can shit on fromsoft games to look cool or whatever. buy it during deep discounts only.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's an intresting game and some good fun if you like Bloodborne.\nThe fact it's clearly meant to be a Bloodborne clone is the reason I can't recommend it.\nIt tries to have the same fast-paced and interactive combat but ignores your button inputs if the last nanosecond of your previous animation is still going. Making using items or perfect blocking very frustrating when it matters.\nEverything outside from bossfights is repetitive and drawn out. And some of the later bossfights just come down to \"fully study my moveset for the next 15min\".\nIt was a fun game for the first half but became a chore for the second half.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the first half the game a lot. Felt it dragged on in the second half but I think I was just getting tired of playing it. Every boss having 2nd phases was getting annoying. I think those should be used more sparingly. Overall it was an okay game but I can't say I reccomend it. If they make a sequel I might check it out. A few nitpicks that I didn't like. \r\n\r\nLeveling felt weak. Capacity being the most invested stat didn't feel great. I think I ended the game with my damage stat being at like 30. It just feels not great to level. \r\nThe Handles and blades felt cool but under utlized. \r\nSome bosses lacked visual clarity on what they were doing. First timing a boss is unlikely. Though with so little bosses maybe its okay.\r\nMost bosses having 2 health bars just made the fight endurance slogs.\r\nOh and potentially ruining character quests by choosing the wrong dialogue option in a timed window? Don't do that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Difficult at times to navigate, no main map, no mini-map, no compus, no yellow things, no golden strand... nadda.\nAlso you cannot check on your quest progress or even check what your suposed to be doing... Waste of $60",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Easiest mode is too hard, and frustrating . Not fun at all , want to play a game and experience it. Don`t want to sit hours on a boss fight just to have another harder boss next. Waste of time. Be prepared to waste a lot of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While I would love to suggest this game to others, I just can't. It's broken on PC. I got a good way through it, really enjoying the game. I am extremely annoyed at how UNOPTIMIZED it is. Fatal errors will pop up now when I try to progress through one of the later zones. After all my reading and tinkering, no solution has been found. I'm just one of many who wasted their money and got teased with a fun game and good story. \r\n\r\nIf you're going to play this game, play it on console so you can actually finish it. The game itself is good, but 0/10 on playability on PC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so far this game is ass. only the tutorial feels like dark souls and its on WALK TROUGH mode bru. idk maybe i will play this game later. but im here for the story twin... not dark souls like battle w normal enemies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't think this is a terrible game but if you played Dark Souls and are thinking should I play this, I recommend playing Dark Souls again instead and if you played Dark Souls again instead, I recommend playing Dark Souls for the third time instead...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very bland souls like.\nThe weapon customization feels insignificant which reduces a lot the diversity in combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has very nice visuals and performance for me exceeds 120fps  at 1440p on a 7900xt (which is rare these days) the levels and world look very good. my problem is first with some level design, some boss battles' area needs to be a bit larger. another problem is that since this game allows you to change difficulty to easy, it is not a soulslike and even then it's mediocre if it were to be considered another genre. enemy variety sucks and gets super boring after 10-15 hrs. But on a positive note, I was able to speed through, lowering difficulty since it was so boring I wanted to be done with it. Not only that, there was a lack of outifits and weapons that suit my style (most were heavy). This game is below average. There aren't even any waifu bosses either to compensate for this dull game. and the sharpening your weapon mechanic is retarded... having to sharpen my blade mid boss battle smh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For the third time I'm trying this game and trying to write a negative comment. This game style is not for me. Ciao.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I regret buying this game. Even on sale, it Doesn\"t feel worth it. The world's representation feels nihilistic, dark, empty and filled with lifeless dolls. The character's movement is too slow, and there's no option to sprint. There's also no minimap. Despite that, I haven't finished the game yet Unlike games such as Star Wars, Nioh, or elden ring, Which present living worlds that players can truly feel connected to, Lies of p feels nihilistic cold and devoid of life. I quit :3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has been fun, but the parrying window is infuriatingly unclear. I'm not pouring hundreds of hours into figuring this shit out. Sekiro was fine, but it's fucking cancer in this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who was this game made for?\n\nAdult gamers with lives/responsibilities? No, clearly not. This game absolutely does not respect the time of people who can't sit in front of a screen for hours/days, masochistically \"learning\" all the crack-brained, hypertuned boss fights, that are measurably more of a chore then most FromSoft bosses (relevant since it's always been obvious what the devs here have been chasing.)\n\nZoomers? Doubtful. Zoomers don't read and can't spell, So outside of (maybe) a vague knowledge of the existence of Le Disney Pinocchio Character From Kingdom Hearts™, they don't know the nuance on display here, the subtle nods to other classic literary characters/works; it's entirely lost on them. (Maybe they know who \"Dorothy\" is, I'll give them that frfr)\n\nThe bottom line: this game wasn't actually made for anyone who exists in the real world, who isn't a middle-aged loser with tons and tons of time on their hands, who also happens to be \"well read\" from their time in grade school, 25-30 years ago.\n\nIt looks good, and it sounds good. That's it. Don't waste your money if you consider yourself a fully-functioning adult, or a zoomzoom that can't spell/never cracked open a book in their lives. Everyone else have at it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "как будто че то не то хз \nесли отдельно от жанра рассматривать может и норм",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Keeps crashing whenever playing on my macbook pro, with M1 pro chip and 16 gb of ram. Dont know why but kinda sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst sould like ever.Not buy if you are expecting another sekiro.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well I am die hard souls like game fan but this just doesn't feel right",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lie of p fatal error.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad dlc and not worth the money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Parry var Bok gibi, Kol var bok gibi, map var bok gibi, boss var bok gibi.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}