{
  "positive": [
    {
      "review": "Less tidying and more pattern findings. Most levels are trivially easy and can be easily solved in a matter of seconds, you'll be able to beat the entire base game in just 3-4ish hours. Usually, as an advocate of the dollar per hour rule, I would say the price of 14.99 is a bit steep. But having seen how high quality the arts are, and almost none of them are recycled, with their effort I can't really see this game being priced less. I wish it had fewer asymmetry levels, though. Like always, wait for a sale and grab both DLCs as well as the bundle under discount costs only 2 dollars more than the base game's MSRP. The developers also made the formerly time limited seasonal exclusive content always accessible under the archive levels label, so they earn an extra point from me for that too.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "very satisfying and keep you engage with the daily task. However some solutions are ridiculous, like you cannot think about it at all, and the game is kinda short to me",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "what a lovely game!! you can tell it was made with so much love and care. genuinely relaxed me so much. everything from the visuals, sound design and the gentle way the game rewards you are so satisfying and relaxing. def recomend!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "for a game with no dialogue and an abstract sort of \"storyline\", this hit me like a gut punch as someone with ocd. maybe i read too far into the way the game was made, but it felt like being shown how silly it is for me to be so high strung over mundane things and that it's okay to let myself loosen up a little bit :-)",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "its a charming, kinda cute designed puzzle game with creative, calming challanges and a secret story. The varied levels and the michievous cat make it especially fun.\nPerfect for anyone who loves relaxing, cozy Games!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice art style and good puzzles, i quite enjoyed the little story too, it was cute!! >w<\nhowever, it doesn't take that long to complete the game (like 5 hours ish for most i'd guess) and a LOT of the achievements require DLC \noverall i recommend! :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a beautiful little game with fantastic art in each level. It certainly achieves its goal as a very satisfying puzzle game, and it allows you to get clear hints without some complicated mechanic. The only let down would be the amount of levels; there are maybe 100+ levels (?), but once you start enjoying the game, you progress too fast and the end of the game arrives too soon. \r\n\r\nThis led me to buy the Cupboards & Drawers DLC. It's really nice and a great expansion to the main game. The art style is still maintained. However, the code seems much... buggier in C&D. It just doesn't seem complete. Sometimes, it won't put an item into a slot correctly and mark the level as complete with a very  unsatisfactory appearance.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "--- I've completed the base game, almost all achievements; I haven't completed all of the daily tidy (Daily Level) achievements. Going for 100% achievements requires all DLC and an excessive amount Daily Tidies (The game takes 75 days to 100%). However, the game is good enough value for what you get (Bought when 50% off, they have frequent sales). ---\n\nMost levels are alright. Some are way too easy to complete whilst others are actually a satisfying challenge. The levels that really shine are mostly levels that have multiple solutions instead of one, albeit quite a few of the single solution levels in the final chapter play really well. Funnily enough, the credits are one of those levels, one which really ties the entire game together.\n\nThe art style is really nice. It's pretty colourful and simplistic, giving of a warm feeling and allowing you to focus on the levels/puzzles. \n\nThe game's quite fun. Though, don't play it all in one go fun fun. 7/10.\nI am not looking forward to playing it for 75 days though... That's actually wild...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Some of the puzzles are quite difficult; however, when they are solved they do have an internal logic. I enjoy this game very much.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A Little to the Left is a lovely little game about taking your everyday things, and arranging them in a pleasing manner. The solutions aren't always the most technically useful, but they all make sense. If you like relaxing games, organization, and/or cats, this is most definitely for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "completed the main game within 3hours, cute and cozy game when on sale - there are daily levels too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game. I'm not very good at puzzles, so I took my time and did my best to solve them without hints.\n\nWhen I did need hints, I appreciated the way hints were set up, where you could reveal a little bit at a time. \n\nI've put over a dozen hours into this game and I know I'll play it again in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great puzzle game! While I struggle to do more than a few puzzles in one go, I enjoy playing it after work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best chilling game i ever played, one of the games thats worth the price, so fun and could be tricky i love playing it whenever i want, doesnt need a high end pc to play, can be played on school laptops!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun chill puzzle game.   Good for an evening's entertainment so worth the $8 I paid for it on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A delightful little game for folks that like to organize! The aesthetics and sound effects make it feel like a tangible reward every time you figure out the pattern. There have been a couple of puzzles that I came up with an additional way to solve that wasn't considered 'correct,' but overall the solutions make sense. The music is fantastic, but the loops are just a bit too short in my opinion, which makes some of the tracks feel repetitive over time. Tiny nitpicks, to be sure- I'm having a ton of fun and love the kitty moments :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great organizing game that can be simple if you just want to clear the level, or challenging if you want to 100% the game and find all the solutions. I love the art style, and the puzzles in the DLC stumped me a few times. I think this is a modern classic when it comes to these types of cozy games. A well crafted, cleaver game that you can pick up and put down whenever you feel like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun puzzles, really casual, not too difficult since the answer is typically \"what feels right.\" Nice art style, fun music, and very satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am not a regular player of computer games. A Little to the Left is the first and only one I've played. I have really enjoyed the pace I can work at. I generally play each day as a way to relax and unwind from the day. I love the feeling of satisfaction from solving the puzzle and putting everything in its place. The music and sound effects also add to the charm of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is cozy, fun and satisfying.\n\nBut please for the love of the universe, DO NOT TIE ACHIEVEMENTS TO DLC OWNERSHIP, NOT EVERYONE WANTS TO PLAY THEM AND SOME OF US WANNA 100% THE GAME.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute and cozy game. thank goodness for friends and the ability to think for me for some of the puzzles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, but the daily tidy achievements are pissing me off so bad. Amazing for playing, a nightmare for 100%ing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! It works as a great relaxation game and really helps calm my anxiety down. Been playing it daily for a long time and look forward to the holiday puzzles every year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very relaxing to play :) I enjoy just getting stuff into its place. A few levels are rather annoying but they are a minority in a mostly calming majority.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The style is really nice and some of the levels are really clever, especially in seeing stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and satisfying game. I wish I felt the same when organizing my room.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute little puzzle game! The DLC is also super enjoyable. Highly recommend but wait for a sale! It’s not crazy long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is cute and it was one to keep me busy. Some were a little challenging, but that is why I kept coming back for more. I've always liked games like this and this one definitely scratched that itch for me. I can't wait for more updates to the game to come!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros:\nA lovely little game, the graphics are enjoyable and some of the puzzles are very satisfying. I especially like the organizing puzzles and the \"magnets.\"\n\nCons:\nThe pricing doesn't quite match other games on Steam for the time spent: ~3.6 hours of gameplay to complete it. Not sure if that says more about this game or about Steam.\n\n---THE CAT !--- I say this as a 1000% cat lover: I cannot stand the cat in this game. While the majority of this game is relaxing and calming, there are random levels where you have to fight this cat in order to straighten anything. I do not like that. Additionally, there is a whole section called \"Inner Nature,\" which has a very eerie quality to it. Like putting bugs in a spider's web for the spider to eat, or cleaning up a vase your cat broke, with sad music playing. It brings new meaning to the title screen, which has melancholy music and the shadow of a cat over a vase with flowers.\n\nI believe what they are going for is \"zen.\" You must be at peace with the things you organize getting ruined over and over again by this cat. That is life. Well... I guess, but that makes the game much less relaxing to me!\n\nOverall I would recommend it with the two above caveats - the price and... THE CAT !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is an amazing game if you have ocd, or if you dont. it is super atisfying to\r\nplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cute game, easy and relaxing. Style is refreshingly different from a wide selection of high grade 3D graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very easy and enjoyable game while still providing levels that require a bit more thinking, i love how they included options for other ways to solve certain puzzles so it encourages you to think of alternate solutions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought it as it was on sale and I've wanted to play for a while after seeing Markiplier play it! It's such a good game, the puzzles definitely make you think, it's cosy, the background music is nice, the additional sound effects make my autistic brain happy too! Very highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome puzzle game! Feels great getting all of the stars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 cozy puzzle game. kept my low attention span hooked (played this during a boring lecture lol)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cosy and relaxing game, thoroughly enjoyed it, especially the cupboards and drawers DLC :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game! Definitely worth if you want to have a laid back game where you can just chill. Definitely really cozy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is this a good game for my ocd and compulsions? probably not. do i love it anyways? absolutely. i love organization games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game scratches an itch in my brain that I never knew I needed reliving. Each puzzle has it's own unique way of solving it that give me a sense of satisfaction upon finding it. The soundtrack pairs perfectly with the given task, and really makes me feel immersed in a world where I need to sort my books or just want to arrange loose pieces of paper in a neat way. Would recommend to anyone who is looking for a casual puzzle game to play while neglecting to do their chores in the real world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean this sincerely, from the deepest recesses of my soul and being, with every fiber of who i am as a person. ffffffffffffffUCK this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun little puzzle game along with enjoyable daily puzzles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some solutions are rather obscure but overall it's very relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute game. The game I play when I don't want to think but still use my brain. Does that make sense?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me and my partner had the most fun playing this together. It is a great game and it was very fun to see how we both would solve a puzzle and the ideas we brought to the table. We also have 2 cute cats and this game was a perfect display of how cute and annoying cats can really be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks neat but that damn pencil with a pattern level near the end of chapter one was absolutely terrible game design",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very enjoyable and calming. \r\nthe music is lovely and so are all the kitty details. excited to purchase the DLCs when possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cute game, Relaxing, Love the puzzles & the DLC was really fun. Great if you like cozy games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that there is no time limit so it is a low stakes puzzle game.  I also appreciate that there is a hint system that doesn't penalize you for using it but also allows you to reveal as much or as little of the hint as you like.  Very creative, very pleasing to my brain who likes to organize things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a very fun and engaging puzzle game with a few annoying achievements. if you like sorting/organizing/arranging things (and cats), you'll love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed the relaxing game as I worked on the puzzles in it. This game is wonderful to relax to and it is a great stress reliever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun game with no pressure to solve the puzzles. There's no timer which I really like and the hints are helpful with a mini \"task\" to see them (trying to avoid spoilers). The music is calm and relaxing with very nice sound effects that just add to the whole experience. The only \"problem\" I have with this game is that I went through it too quickly and wish there were more levels to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its the game equivalent of earning head pats and purrs as you solve each level with a satisfying \"ding\", and feel good sorting items into their place. It's too easy to consume the whole game plus DLC quickly. It would be nice if some levels had more solutions options, if only so there was MORE game to play, but there is also a daily level you can always come back to for a calming little morsel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For those with the OCD mind. I don't have OCD, but it still satisfies the mind in a way that can only be explained as such.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cute and cozy! loved it very much i listen to the trailer every day! the new puzzles that came in the packed update.and cats rule!:3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful little puzzle game about trying to keep things tidy. In addition to very satisfying gameplay, very pleasingly minimal yet intuitive interface, cute art style, and forgiving hint system, this game also has a very fun little thematic throughline that was immensely rewarding to pick up on and see to its conclusion. For someone with OCD that is also a devoted pet owner, this game was a perfect little reminder that as much as we often strive to get things around us -exactly perfect-, oftentimes the untidy spots and imperfections in our environment are proof of life being lived there, and that the people (and animals) we love are worth cleaning up after to have in our lives. I'm genuinely touched. Thank you for including all of your pets in the credits <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cute! some of the puzzles are a little challenging, but its all good fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill, clever, and oddly satisfying. The perfect game to unwind with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and challenging. I keep resetting all the levels to do it all again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very cute and cozy puzzle game that is a great deal of fun to pick up and play for just a few minutes every now and then. Definitely one of the most unique styles I've ever seen for a puzzle game. I also enjoy the silly side achievements and wish there were more of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For those of us who love staring at picture puzzles whilst muttering to ourselves \"I have NO idea what they want me to do with this\" until it dawns on us, only to repeat this process on many new boxes to think outside of, sometimes in several stages and by several new ways and means other than those already discovered, all of which just might hone our abilities to read minds, discover what to pay attention to, solve riddles and resolve global issues...well then, we just might want to purr-chase & play this brilliant little gem of a brain baffler.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So cute and fun to play. Even better if you have a touch screen on your console",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE the puzzles. I really enjoy the variety. The cat is a pain in the butt and therefore reminds me so much of my own. LOL. Some of the puzzles are a little finicky and you have to be super precise. I do wish they'd add more levels but other than that I have no critisisms.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its cool and has many options for organizing puzzles down to color, patterns or connecting shapes/patterns etc. the only gripe i would say i have is in some puzzles even with hints its hard to figure out how to finish it even w multiple resets and you might have to resort to the wiki! OVERALL very cute colorful and peaceful and the music is very rythimic and relaxing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has become my go-to daily play. The hints help withoutmaking you feel stupid and the music is a delightful way to set the mood as you (I) delve into the puzzles. Challanging in the best kind of ways but always having hints is helpful. I will be telling everyone about this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is perfect for some brain off organisation time! really helpful for me when i'm having a task paralysis day because seeing something completed in front of me usually gives me the boost to complete other tasks. small wins.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was able to pet my cat the entire time i was playing. i hated the last 4 levels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished in one sitting of ~5 hours. After a concerningly easy first few levels, things pick up, with a scattering of highlights throughout. For the most part they are intuitive logic puzzles, with only maybe 3 that I had no clue what was expected of me, and a few more that I needed hints for alternative solutions.\n\nThe game could really use some more instruction on what you can do, as a couple of levels had me clicking randomly because I had no idea what my goal was--particularly the 'mirror' level, which I had no idea I could move the mirror, which told you what the layout should be. It's a great shame there aren't more kinetic puzzles like the finale, which ended the game beautifully after some repeated gimmick tedium.\n\nOver all, a decent purchase on sale if you like busy work to pass the time. It's not really a \"clean up\" game, it's more about pattern recognition and symmetry. By far my favourite levels were the drawers, where you arrange random objects like a jigsaw puzzle. It's very sad so many achievements are paywalled behind DLC, so be aware you will have to spend more if you want 100%. My least favourite aspect being the \"daily puzzle\" achievements, that require 100 days of commitment, 30 consecutive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun and chill. Plus, cat!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100 days of chores in a game instead of irl. Yes please!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My life may be broken, but this game gives me the feeling that I’ve put the pieces back together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the daily tidy really keeps this game in your rotation...love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a game you accidently finish bc you had too much fun playing the lil games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sometimes you just need a game to organise things, and that's that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very coazy game that does sometimes needs you to think outside the box",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very relaxing and so many different ways to organize",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look at how many hours I have in this game. I don't think I need to say anything else. Perfect game no notes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Such a cute and relaxing puzzle game. Lots of little details and the art is unique for each level. I love that some levels have multiple solutions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Am I using this game to avoid cleaning my own apartment? Mayhaps.\r\n\r\nThere's a wonderful variety of puzzles, and a lot of the puzzles have different solutions (i.e. color coding, sorting by size, making a pattern, etc.). \r\n\r\nMy only suggestion for future updates would be the option to change up the color palette, but the one in game is still lovely!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A nice cozy game that I play when I want to relax!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "satifying\n\nexcept that cat. fuck the cat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy, cozy game for rainy days.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great puzzle game for passing time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Calming even if my brain is round and smooth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "neat game but kinda pricey",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a chill cute puzzle game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "hell yeah, so many cute kitties that absolutely rock your shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You'll be up to 3am either frustrated or having fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "casual and engaging",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A relaxing masterpiece. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "makes me frsutrated but fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I organized and it was funn teehee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Contrary to popular belief, you do have to move things to the right",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a satifing game. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVED THIS GAME, WISH IT HAD MORE CHAPTERS :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for people who love organising",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Calm and comforting game :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice very chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cute :3 very fun to complete",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute relaxing game.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "about 3 hours of gameplay for this price is insane.\nit needs way more content to be worth the price",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I've already posted a positive review of this game but I'm tired of being nagged to post another one so I would no longer recommend this game (however fun) to other players. If you play it you will be incessantly nagged to give reviews on it every day. Day after day. Every time you sign in. Frankly, it causes anxiety and a mild form of stress which I can live without. Please don't ask me again or the supplied text will, next time, be ever increasingly acerbic. Just leave me alone now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR; Agonizing gameplay\nSome puzzles are fun, but the main game on its own (and even with the DLC bundle) aren't worth your money for the amount of content provided. The puzzles slowly become illogical over time and left me more frustrated than satisfied.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game suffers from lack of directions. Additionally, like most of the reviews that do not recommend this game, the puzzles are NOT intuitive and heavily relies on the hint system and random guessing to figure out what the heck is going on. If you are someone who needs boundaries/slots for your puzzle pieces (or literally anything) this game will bother you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn't much fun. Theoretically it has a lot going for it - pleasant graphics, relaxing music, puzzles, sorting, and a cat. However, the puzzles are fiddly in an annoying way. There might be multiple solutions to one puzzle, but within the solutions, there isn't much flexibility. For example, you got that you have to order something by size or number, but only one way (left to right, top to down) counts, not right to left or bottom up. Sometimes, your solutions have to be pixel-perfect, so that you actually sorted everything correctly, just two pixles too far right. Therefore \"A little to the left\" has to be taken literally and this slight readjustment of correct solutions becomes an annoying trial-and-error assignment far too often.\n\nI also encountered some bugs (e.g. in the Archives with the extendable tool drawer - one of the puzzle pieces got stuck to the drawer and could not be picked up again), which made the game feel really tedious. It is fun in concept, but the execution leaves too much room for frustration as the difficulty is not finding patterns, but adjusting the objects in hopes you found the right spot for it to count.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’m only giving this game a negative rating because people deserve to see the honest cons—I actually really enjoyed it. It’s a great, relaxing puzzle game with a unique atmosphere, but the bugs (especially in Chapter 5) really hold it back. Some of these issues have been reported on the community tab for over a year without fixes, and the devs seem more focused on releasing DLCs than addressing long-standing problems. When a bug hits, the only “solution” is restarting the level until it decides to work, which gets frustrating fast.\n\nIf the bugs were resolved, this would easily be a positive review from me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I must have lost my actual soul somewhere along the way, one of those times where you sell it during a cursing moment, but didn't mean it.\r\n\r\nI remember when this came out everyone was delighted by it. OCD made for OCD gamers! It just clicks!\r\n\r\nNo. It doesn't. At least not for me. Its just a series of sorting puzzles, some of them nonsensical and almost all of them just boring. It's like when as a kid your Mum demands that you do one of those General Reasoning test papers, or submit an IQ test because they're convinced your special 'but not in an academic way' and you sit there going \"what is this shit, Mum?\"\r\n\r\nLook, if you can find a game in arranging pencils sometimes by the amount they have been shaved and sometimes by the pattern on the bottom end, then all power to you I guess. \r\n\r\nOtherwise, to me it's a lo-fi, low-effort shabby replacement for a proper maths GCSE which could have actually gotten me a job, thanks a lot Mum",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A heavy casual-focused game with just enough diversity throughout the game to keep playing.\nHas some grindy achievements including playing the daily challenge for so many days in a row, and also for playing the daily challenge 100 times (not necessaryily in a row, fortunately).\nAlso, a big bunch of the achievements are locked behind two DLC, which given I paid only a few dollars for the base game, I'll likely not get the DLC unless it's heavily discounted at some stage.\n\nIt's not going to win any awards: it's relatively short if you just play through it without trying to 100% it, and DLC that cost almost as much as this over-priced game (at full price), tips me into giving it the thumbs down.\n\nIf it has a decent bundled discount with all DLC, then maybe consider buying it, but your life won't be any less for skipping this game.\n\nEDIT: Developer completely missed the point - why does the DLC cost MORE than the base game, even when they're on sale? DLC has been out long enough that it should be discounted to the same price as base game on sale by now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "game is too short and its not organizing. most of it is puzzles. not good at all. took me four hours to complete the whole game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth the money i was able to finish the dlc in under 2 hours and thank god i got a refund and some of these puzzles are so stupid like they were totally reaching and running out of ideas in this shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wish there was a neutral option, I can't recommend the game at full price though\n\nBe sure to get this game on sale if you want it (I got it when it was 50% off), the main set of levels is only 4 hours long if you're actually good with puzzles (I used hints several times since I am not, so for me it would have taken about 5 hours without hints)\n\nNot a bad game, it is chill and relaxing, but at its full asking price I'd say it's mediocre value at best",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice, super satisfying game and I love the graphics. However, I finished the game after 3 hours of playing (I enjoyed those 3 hours tho) and after that the puzzles just repeat themselves. Basically far too expensive for a 3-hour game. I still play it to get all the daily puzzles done, but they also repeat themselves after 10-ish days",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, I have crossed the refund window for the game and regret paying and playing this game. The game is supposed to be a cozy satisfying puzzler game. But the puzzles themselves are not the issue. The real issue is the mundane music, the no gap between puzzles, the zero reasons given as to why there a bloody cat in my game ruining everything, and the progression system in it's entirety. The game's positive of having interesting puzzles is negated by the fact that everything else about the game is boring us to death. I didn't buy this game for myself, i bought it for my wife who loves playing puzzles games and after 2 hours she said she hated playing the game. Sad part is, i sat next to her and watched her solve the puzzles, and get furious over the fact that her efforts were thwarted by a cat(she hates cats). Sometimes there is no point to solving some puzzles as well as some of the puzzle solving made no sense(It was just plain stupid). Overall i cannot in good faith recommend this game to anyone. You would be better off playing a co-op or a split screen game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to play this because it's been recommended if you like Unpacking, but I don't think that's a fair recommendation. Although both games have the major mechanic of organising things, it wasn't what made Unpacking special to me. By itself, A Little to the Left isn't a bad game but ultimately I didn't like it very much. Maybe I would have liked it if I didn't go into it with a false expectation.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy this if you are a completionist, or at all. The achievements require you to purchase DLC and I despise that I did not notice until after I passed the time I can get a refund. It is not fun or innovative with unclear rules that change for each level and just end with me looking up the answers. Don't even buy this game on sale, I beg. There are much better indie puzzles games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "12.99 FOR 3 HOURS OF GAMEPLAY? if it had more content id be happy, but it doesnt, and now i cant refund it because i took 1 extra hour :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worst game ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "about 3 hours of gameplay for this price is insane.\nit needs way more content to be worth the price",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "I have never encountered a game that overstays its welcome more than A Little to the Left. This is a \"puzzle\" game (I use that term somewhat loosely; I don't think the game is really the next Baba is You, nor is it trying to be) about arranging objects neatly. If, like I had, you've seen footage of the game, you've probably seen a lot of nice clips of people tidying up drawers of utensils or aligning stationery in a satisfying way.\n\nAnd the game does have those levels. If the game [i]just[/i] had those levels, I'd probably like it a lot more. But those levels are somewhat few and far between, and a lot of the content that makes up the rest of the game just doesn't really work for me. There are some decent ones - some levels later in the game play with ideas of symmetry, which are fun. A lot of levels, though, amount to \"arrange these six objects by height\", with an optional bonus objective for also arranging them by colour or something like that. These levels are such blatant filler and I have little good to say about them. A Little to the Left isn't trying to be a super complex puzzle game, but it'd still be nice if I had to think hard enough to be paying more attention to it than whatever I'm watching on my second monitor.\n\nThe worst offenders, however, are what I'll call the nonsense levels: levels where the solution isn't clear at all, and might not even become apparent after you've solved it. The final set of base game levels has a lot of these more experimental ideas, and often they just make no sense. For example, in one level you're presented with a set of hanging picture frames you can tilt, and eventually have to surmise that you have to get a ball in one painting into a hole another by tilting the frames so it rolls. But even once you work that out, which frame the ball will go to next isn't obvious, because they're not aligned, and so it just becomes a tedious process of trial and error. There's no \"aha\" moment like you'd want from a good puzzle.\n\nThe absolute worst level for this is the calendar level you encounter very early in the game. I have beaten this twice (achievements required two full playthroughs) and I still have no idea what the solution was. You have to put stickers on a calendar. I thought it'd be the case that each sticker would follow patterns on the grid, and for the most part they did, but some couldn't go where they would need to in order to continue the pattern, so it wasn't clear where else they should be. I eventually just resorted to trying each sticker in every square until I heard the audio cue for a correct placement. I'm probably missing something obvious, but that's also kind of besides the point when this game is marketed as \"the satisfying drawer arranging game\". There is at least a hint system - though they're less so \"hints\" than just reveals of the solution - as well as the option to skip levels entirely. Be aware, however, using these at all locks you out of achievements, which is why my second playthrough was necessitated.\n\nThe satisfying drawer arranging levels are good. I want to make that clear. The DLCs especially are a bit more focused on those kinds of levels, often with less obvious places for things to go (early game ones can be a bit simplistic because the spoon goes in the spoon-shaped hole, and so on), so some trial and error (the good kind) is required. That said, the second DLC also goes a lot harder on the obtuse stuff where you have to read the devs' minds to get the solution to trigger. Often I'd find the solution but not fulfil some arbitrary second requirement (at times, I'm not even sure if these requirements were intended) and have to just randomly move things around. For example, one level had one solution where you had to pull plants out of their pots and check the lengths of their roots, then arrange them by root length. When I did this, the solution didn't trigger, and so I ended up swapping plants into different pots until it did. As far as I could tell, there was no logic or pattern to the pots each plant was in when the solution triggered. I have no idea if I was missing something or if it's completely arbitrary due to some kind of oversight.\n\nThe problem with this game is just that satisfying drawer arranging really only has so much mileage. And rather than just make a small game focused on that concept, A Little to the Left is padded out with a bunch of levels which stretch its gimmick and wear it incredibly thin. I think the best way to sum the game up is its daily challenges. I normally wait until I've 100%ed a game before I review it (because I think you can only really give a fair review of something once you've experienced all of it and Steam achievements are usually a solid benchmark for what \"all the content\" entails). However, I'm still missing 9 achievements for A Little to the Left. I've played all the base game and DLC content, but those 9 achievements are for the game's daily challenges. Every day, the game wants you to solve one of its puzzles (and these puzzles are, at best, slightly tweaked versions of existing levels, there's nothing fundamentally new about them if you've played the base game). This game does not merit playing daily. It's not interesting enough for me to want to sign onto it every day. But it seems to think it is, because it has achievements for doing so for 100 days.\n\nA Little to the Left has a misplaced confidence in its own quality. The total cost of this game and its DLCs, outside of a sale, is £25. And its gimmick simply does not have the legs to support the number of puzzles required to justify that price tag. If this game were £10, and it was just the puzzles that are actually good, I'd love it. But for what it actually is - a lot of disappointing filler padding out the diamonds in the rough - there are much better indie games to spend that amount of money on.\n\n4/10 - While some satisfying, original tidying puzzles mean the game has its moments, A Little to the Left's gimmick far overstays its welcome by padding out its runtime with boring and obtuse levels that feel like they're trying to justify its high-for-an-indie-game price tag.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "it overstays its welcome for sure. repetitive puzzles that also grow a bit frustrating when you have found a solution that personally makes you happy lol. i didn't really feel like being at the whims of the tidiness of the devs. i'd recommend trying out 'is this seat taken?' instead, which has more clear-cut solutions... a personal preference, though!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not exactly relaxing to get interrupted by a cat for every minute. I wish there was a setting to turn it off.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TLDR; Agonizing gameplay\nSome puzzles are fun, but the main game on its own (and even with the DLC bundle) aren't worth your money for the amount of content provided. The puzzles slowly become illogical over time and left me more frustrated than satisfied.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Probably wouldn't recommend this to someone as a relaxing or simple puzzle game. I kept struggling with how specific the game requires your solutions be, and how often it's near impossible to figure out what they want for a solution without checking the hints. And sometimes, when I came up with something that did look like a good solution, the game just wouldn't accept it. Especially with the symmetrical puzzles, those were incredibly frustrating. I got all the way to chapter 4 trying to get into it, hoping that maybe it would be satisfying in the end, but ultimately, I just gave up. Just poorly designed, if I'm being honest. The cat was very cute though when it showed up.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game suffers from lack of directions. Additionally, like most of the reviews that do not recommend this game, the puzzles are NOT intuitive and heavily relies on the hint system and random guessing to figure out what the heck is going on. If you are someone who needs boundaries/slots for your puzzle pieces (or literally anything) this game will bother you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn't much fun. Theoretically it has a lot going for it - pleasant graphics, relaxing music, puzzles, sorting, and a cat. However, the puzzles are fiddly in an annoying way. There might be multiple solutions to one puzzle, but within the solutions, there isn't much flexibility. For example, you got that you have to order something by size or number, but only one way (left to right, top to down) counts, not right to left or bottom up. Sometimes, your solutions have to be pixel-perfect, so that you actually sorted everything correctly, just two pixles too far right. Therefore \"A little to the left\" has to be taken literally and this slight readjustment of correct solutions becomes an annoying trial-and-error assignment far too often.\n\nI also encountered some bugs (e.g. in the Archives with the extendable tool drawer - one of the puzzle pieces got stuck to the drawer and could not be picked up again), which made the game feel really tedious. It is fun in concept, but the execution leaves too much room for frustration as the difficulty is not finding patterns, but adjusting the objects in hopes you found the right spot for it to count.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "overall its a pretty good game ill admit that, the art is very nice and some of the puzzles did confuse me at times which was nice, but at the same time there was no clear solution. i liked a lot of it and its very enjoyable: i dont think its worth 15 dollars though. i got about 3ish hours of playtime for it when i expected much more content than what i actually got for the price which may just be my fault.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is cute, and the art style is enjoyable, but honestly the puzzles are not particularly clever and often are not even fun. There's not a \"satisfying\" element to it, save for a couple of puzzles. You are better off just watching someone play this and guess how things are organized.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game surprised me and sadly not in a good way. At first I loved it, only really being frustrated when some of the puzzles are obscure. But, then it ends, really quickly. And the last chapter just feels like it's full of filler puzzles, including one where you're just stacking boxes for a long period of time. \n\nI thought this was going to be a really fun game I can just play when I don't want anything too intense but sadly it really isn't much of a game at all",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some of the solutions are more guesswork than puzzle solving and it doesn't really scratch the relaxing itch either since you don't exactly get to organize things how you want. This game left me more frustrated than relaxed or fulfilled.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’m only giving this game a negative rating because people deserve to see the honest cons—I actually really enjoyed it. It’s a great, relaxing puzzle game with a unique atmosphere, but the bugs (especially in Chapter 5) really hold it back. Some of these issues have been reported on the community tab for over a year without fixes, and the devs seem more focused on releasing DLCs than addressing long-standing problems. When a bug hits, the only “solution” is restarting the level until it decides to work, which gets frustrating fast.\n\nIf the bugs were resolved, this would easily be a positive review from me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I must have lost my actual soul somewhere along the way, one of those times where you sell it during a cursing moment, but didn't mean it.\r\n\r\nI remember when this came out everyone was delighted by it. OCD made for OCD gamers! It just clicks!\r\n\r\nNo. It doesn't. At least not for me. Its just a series of sorting puzzles, some of them nonsensical and almost all of them just boring. It's like when as a kid your Mum demands that you do one of those General Reasoning test papers, or submit an IQ test because they're convinced your special 'but not in an academic way' and you sit there going \"what is this shit, Mum?\"\r\n\r\nLook, if you can find a game in arranging pencils sometimes by the amount they have been shaved and sometimes by the pattern on the bottom end, then all power to you I guess. \r\n\r\nOtherwise, to me it's a lo-fi, low-effort shabby replacement for a proper maths GCSE which could have actually gotten me a job, thanks a lot Mum",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've already posted a positive review of this game but I'm tired of being nagged to post another one so I would no longer recommend this game (however fun) to other players. If you play it you will be incessantly nagged to give reviews on it every day. Day after day. Every time you sign in. Frankly, it causes anxiety and a mild form of stress which I can live without. Please don't ask me again or the supplied text will, next time, be ever increasingly acerbic. Just leave me alone now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A heavy casual-focused game with just enough diversity throughout the game to keep playing.\nHas some grindy achievements including playing the daily challenge for so many days in a row, and also for playing the daily challenge 100 times (not necessaryily in a row, fortunately).\nAlso, a big bunch of the achievements are locked behind two DLC, which given I paid only a few dollars for the base game, I'll likely not get the DLC unless it's heavily discounted at some stage.\n\nIt's not going to win any awards: it's relatively short if you just play through it without trying to 100% it, and DLC that cost almost as much as this over-priced game (at full price), tips me into giving it the thumbs down.\n\nIf it has a decent bundled discount with all DLC, then maybe consider buying it, but your life won't be any less for skipping this game.\n\nEDIT: Developer completely missed the point - why does the DLC cost MORE than the base game, even when they're on sale? DLC has been out long enough that it should be discounted to the same price as base game on sale by now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It is a simple and relaxing game; however, that experience is greatly tainted by the fact that you have to buy all DLCs if you are a completionist, like me, and want to get all achievements. \r\nI also greatly dislike the fact that some of the achievements (daily missions) force you to remember to open up the game for less than 5 minutes on 100 days. I would be less frustrated with this if it felt worthwhile opening up the game, but it is, on average, more time to load all of the transitioning screens than to actually do each daily mission. They are repetitive, short, and overall not very fun. What's even worse is that some other daily mission achievements ask you to do so on consecutive days! \r\n\r\nI personally wish I hadn't bought the game. It's a calm and short little game, but not my cup of tea for the amount of money you are forced to put into it, especially if you want to complete it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is too short and its not organizing. most of it is puzzles. not good at all. took me four hours to complete the whole game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth the money i was able to finish the dlc in under 2 hours and thank god i got a refund and some of these puzzles are so stupid like they were totally reaching and running out of ideas in this shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wish there was a neutral option, I can't recommend the game at full price though\n\nBe sure to get this game on sale if you want it (I got it when it was 50% off), the main set of levels is only 4 hours long if you're actually good with puzzles (I used hints several times since I am not, so for me it would have taken about 5 hours without hints)\n\nNot a bad game, it is chill and relaxing, but at its full asking price I'd say it's mediocre value at best",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice, super satisfying game and I love the graphics. However, I finished the game after 3 hours of playing (I enjoyed those 3 hours tho) and after that the puzzles just repeat themselves. Basically far too expensive for a 3-hour game. I still play it to get all the daily puzzles done, but they also repeat themselves after 10-ish days",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, I have crossed the refund window for the game and regret paying and playing this game. The game is supposed to be a cozy satisfying puzzler game. But the puzzles themselves are not the issue. The real issue is the mundane music, the no gap between puzzles, the zero reasons given as to why there a bloody cat in my game ruining everything, and the progression system in it's entirety. The game's positive of having interesting puzzles is negated by the fact that everything else about the game is boring us to death. I didn't buy this game for myself, i bought it for my wife who loves playing puzzles games and after 2 hours she said she hated playing the game. Sad part is, i sat next to her and watched her solve the puzzles, and get furious over the fact that her efforts were thwarted by a cat(she hates cats). Sometimes there is no point to solving some puzzles as well as some of the puzzle solving made no sense(It was just plain stupid). Overall i cannot in good faith recommend this game to anyone. You would be better off playing a co-op or a split screen game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to play this because it's been recommended if you like Unpacking, but I don't think that's a fair recommendation. Although both games have the major mechanic of organising things, it wasn't what made Unpacking special to me. By itself, A Little to the Left isn't a bad game but ultimately I didn't like it very much. Maybe I would have liked it if I didn't go into it with a false expectation.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy this if you are a completionist, or at all. The achievements require you to purchase DLC and I despise that I did not notice until after I passed the time I can get a refund. It is not fun or innovative with unclear rules that change for each level and just end with me looking up the answers. Don't even buy this game on sale, I beg. There are much better indie puzzles games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "about 3 hours of gameplay for this price is insane.\nit needs way more content to be worth the price",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "I have never encountered a game that overstays its welcome more than A Little to the Left. This is a \"puzzle\" game (I use that term somewhat loosely; I don't think the game is really the next Baba is You, nor is it trying to be) about arranging objects neatly. If, like I had, you've seen footage of the game, you've probably seen a lot of nice clips of people tidying up drawers of utensils or aligning stationery in a satisfying way.\n\nAnd the game does have those levels. If the game [i]just[/i] had those levels, I'd probably like it a lot more. But those levels are somewhat few and far between, and a lot of the content that makes up the rest of the game just doesn't really work for me. There are some decent ones - some levels later in the game play with ideas of symmetry, which are fun. A lot of levels, though, amount to \"arrange these six objects by height\", with an optional bonus objective for also arranging them by colour or something like that. These levels are such blatant filler and I have little good to say about them. A Little to the Left isn't trying to be a super complex puzzle game, but it'd still be nice if I had to think hard enough to be paying more attention to it than whatever I'm watching on my second monitor.\n\nThe worst offenders, however, are what I'll call the nonsense levels: levels where the solution isn't clear at all, and might not even become apparent after you've solved it. The final set of base game levels has a lot of these more experimental ideas, and often they just make no sense. For example, in one level you're presented with a set of hanging picture frames you can tilt, and eventually have to surmise that you have to get a ball in one painting into a hole another by tilting the frames so it rolls. But even once you work that out, which frame the ball will go to next isn't obvious, because they're not aligned, and so it just becomes a tedious process of trial and error. There's no \"aha\" moment like you'd want from a good puzzle.\n\nThe absolute worst level for this is the calendar level you encounter very early in the game. I have beaten this twice (achievements required two full playthroughs) and I still have no idea what the solution was. You have to put stickers on a calendar. I thought it'd be the case that each sticker would follow patterns on the grid, and for the most part they did, but some couldn't go where they would need to in order to continue the pattern, so it wasn't clear where else they should be. I eventually just resorted to trying each sticker in every square until I heard the audio cue for a correct placement. I'm probably missing something obvious, but that's also kind of besides the point when this game is marketed as \"the satisfying drawer arranging game\". There is at least a hint system - though they're less so \"hints\" than just reveals of the solution - as well as the option to skip levels entirely. Be aware, however, using these at all locks you out of achievements, which is why my second playthrough was necessitated.\n\nThe satisfying drawer arranging levels are good. I want to make that clear. The DLCs especially are a bit more focused on those kinds of levels, often with less obvious places for things to go (early game ones can be a bit simplistic because the spoon goes in the spoon-shaped hole, and so on), so some trial and error (the good kind) is required. That said, the second DLC also goes a lot harder on the obtuse stuff where you have to read the devs' minds to get the solution to trigger. Often I'd find the solution but not fulfil some arbitrary second requirement (at times, I'm not even sure if these requirements were intended) and have to just randomly move things around. For example, one level had one solution where you had to pull plants out of their pots and check the lengths of their roots, then arrange them by root length. When I did this, the solution didn't trigger, and so I ended up swapping plants into different pots until it did. As far as I could tell, there was no logic or pattern to the pots each plant was in when the solution triggered. I have no idea if I was missing something or if it's completely arbitrary due to some kind of oversight.\n\nThe problem with this game is just that satisfying drawer arranging really only has so much mileage. And rather than just make a small game focused on that concept, A Little to the Left is padded out with a bunch of levels which stretch its gimmick and wear it incredibly thin. I think the best way to sum the game up is its daily challenges. I normally wait until I've 100%ed a game before I review it (because I think you can only really give a fair review of something once you've experienced all of it and Steam achievements are usually a solid benchmark for what \"all the content\" entails). However, I'm still missing 9 achievements for A Little to the Left. I've played all the base game and DLC content, but those 9 achievements are for the game's daily challenges. Every day, the game wants you to solve one of its puzzles (and these puzzles are, at best, slightly tweaked versions of existing levels, there's nothing fundamentally new about them if you've played the base game). This game does not merit playing daily. It's not interesting enough for me to want to sign onto it every day. But it seems to think it is, because it has achievements for doing so for 100 days.\n\nA Little to the Left has a misplaced confidence in its own quality. The total cost of this game and its DLCs, outside of a sale, is £25. And its gimmick simply does not have the legs to support the number of puzzles required to justify that price tag. If this game were £10, and it was just the puzzles that are actually good, I'd love it. But for what it actually is - a lot of disappointing filler padding out the diamonds in the rough - there are much better indie games to spend that amount of money on.\n\n4/10 - While some satisfying, original tidying puzzles mean the game has its moments, A Little to the Left's gimmick far overstays its welcome by padding out its runtime with boring and obtuse levels that feel like they're trying to justify its high-for-an-indie-game price tag.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "it overstays its welcome for sure. repetitive puzzles that also grow a bit frustrating when you have found a solution that personally makes you happy lol. i didn't really feel like being at the whims of the tidiness of the devs. i'd recommend trying out 'is this seat taken?' instead, which has more clear-cut solutions... a personal preference, though!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not exactly relaxing to get interrupted by a cat for every minute. I wish there was a setting to turn it off.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TLDR; Agonizing gameplay\nSome puzzles are fun, but the main game on its own (and even with the DLC bundle) aren't worth your money for the amount of content provided. The puzzles slowly become illogical over time and left me more frustrated than satisfied.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Probably wouldn't recommend this to someone as a relaxing or simple puzzle game. I kept struggling with how specific the game requires your solutions be, and how often it's near impossible to figure out what they want for a solution without checking the hints. And sometimes, when I came up with something that did look like a good solution, the game just wouldn't accept it. Especially with the symmetrical puzzles, those were incredibly frustrating. I got all the way to chapter 4 trying to get into it, hoping that maybe it would be satisfying in the end, but ultimately, I just gave up. Just poorly designed, if I'm being honest. The cat was very cute though when it showed up.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game suffers from lack of directions. Additionally, like most of the reviews that do not recommend this game, the puzzles are NOT intuitive and heavily relies on the hint system and random guessing to figure out what the heck is going on. If you are someone who needs boundaries/slots for your puzzle pieces (or literally anything) this game will bother you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn't much fun. Theoretically it has a lot going for it - pleasant graphics, relaxing music, puzzles, sorting, and a cat. However, the puzzles are fiddly in an annoying way. There might be multiple solutions to one puzzle, but within the solutions, there isn't much flexibility. For example, you got that you have to order something by size or number, but only one way (left to right, top to down) counts, not right to left or bottom up. Sometimes, your solutions have to be pixel-perfect, so that you actually sorted everything correctly, just two pixles too far right. Therefore \"A little to the left\" has to be taken literally and this slight readjustment of correct solutions becomes an annoying trial-and-error assignment far too often.\n\nI also encountered some bugs (e.g. in the Archives with the extendable tool drawer - one of the puzzle pieces got stuck to the drawer and could not be picked up again), which made the game feel really tedious. It is fun in concept, but the execution leaves too much room for frustration as the difficulty is not finding patterns, but adjusting the objects in hopes you found the right spot for it to count.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "overall its a pretty good game ill admit that, the art is very nice and some of the puzzles did confuse me at times which was nice, but at the same time there was no clear solution. i liked a lot of it and its very enjoyable: i dont think its worth 15 dollars though. i got about 3ish hours of playtime for it when i expected much more content than what i actually got for the price which may just be my fault.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is cute, and the art style is enjoyable, but honestly the puzzles are not particularly clever and often are not even fun. There's not a \"satisfying\" element to it, save for a couple of puzzles. You are better off just watching someone play this and guess how things are organized.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game surprised me and sadly not in a good way. At first I loved it, only really being frustrated when some of the puzzles are obscure. But, then it ends, really quickly. And the last chapter just feels like it's full of filler puzzles, including one where you're just stacking boxes for a long period of time. \n\nI thought this was going to be a really fun game I can just play when I don't want anything too intense but sadly it really isn't much of a game at all",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some of the solutions are more guesswork than puzzle solving and it doesn't really scratch the relaxing itch either since you don't exactly get to organize things how you want. This game left me more frustrated than relaxed or fulfilled.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’m only giving this game a negative rating because people deserve to see the honest cons—I actually really enjoyed it. It’s a great, relaxing puzzle game with a unique atmosphere, but the bugs (especially in Chapter 5) really hold it back. Some of these issues have been reported on the community tab for over a year without fixes, and the devs seem more focused on releasing DLCs than addressing long-standing problems. When a bug hits, the only “solution” is restarting the level until it decides to work, which gets frustrating fast.\n\nIf the bugs were resolved, this would easily be a positive review from me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I must have lost my actual soul somewhere along the way, one of those times where you sell it during a cursing moment, but didn't mean it.\r\n\r\nI remember when this came out everyone was delighted by it. OCD made for OCD gamers! It just clicks!\r\n\r\nNo. It doesn't. At least not for me. Its just a series of sorting puzzles, some of them nonsensical and almost all of them just boring. It's like when as a kid your Mum demands that you do one of those General Reasoning test papers, or submit an IQ test because they're convinced your special 'but not in an academic way' and you sit there going \"what is this shit, Mum?\"\r\n\r\nLook, if you can find a game in arranging pencils sometimes by the amount they have been shaved and sometimes by the pattern on the bottom end, then all power to you I guess. \r\n\r\nOtherwise, to me it's a lo-fi, low-effort shabby replacement for a proper maths GCSE which could have actually gotten me a job, thanks a lot Mum",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've already posted a positive review of this game but I'm tired of being nagged to post another one so I would no longer recommend this game (however fun) to other players. If you play it you will be incessantly nagged to give reviews on it every day. Day after day. Every time you sign in. Frankly, it causes anxiety and a mild form of stress which I can live without. Please don't ask me again or the supplied text will, next time, be ever increasingly acerbic. Just leave me alone now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A heavy casual-focused game with just enough diversity throughout the game to keep playing.\nHas some grindy achievements including playing the daily challenge for so many days in a row, and also for playing the daily challenge 100 times (not necessaryily in a row, fortunately).\nAlso, a big bunch of the achievements are locked behind two DLC, which given I paid only a few dollars for the base game, I'll likely not get the DLC unless it's heavily discounted at some stage.\n\nIt's not going to win any awards: it's relatively short if you just play through it without trying to 100% it, and DLC that cost almost as much as this over-priced game (at full price), tips me into giving it the thumbs down.\n\nIf it has a decent bundled discount with all DLC, then maybe consider buying it, but your life won't be any less for skipping this game.\n\nEDIT: Developer completely missed the point - why does the DLC cost MORE than the base game, even when they're on sale? DLC has been out long enough that it should be discounted to the same price as base game on sale by now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It is a simple and relaxing game; however, that experience is greatly tainted by the fact that you have to buy all DLCs if you are a completionist, like me, and want to get all achievements. \r\nI also greatly dislike the fact that some of the achievements (daily missions) force you to remember to open up the game for less than 5 minutes on 100 days. I would be less frustrated with this if it felt worthwhile opening up the game, but it is, on average, more time to load all of the transitioning screens than to actually do each daily mission. They are repetitive, short, and overall not very fun. What's even worse is that some other daily mission achievements ask you to do so on consecutive days! \r\n\r\nI personally wish I hadn't bought the game. It's a calm and short little game, but not my cup of tea for the amount of money you are forced to put into it, especially if you want to complete it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is too short and its not organizing. most of it is puzzles. not good at all. took me four hours to complete the whole game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth the money i was able to finish the dlc in under 2 hours and thank god i got a refund and some of these puzzles are so stupid like they were totally reaching and running out of ideas in this shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wish there was a neutral option, I can't recommend the game at full price though\n\nBe sure to get this game on sale if you want it (I got it when it was 50% off), the main set of levels is only 4 hours long if you're actually good with puzzles (I used hints several times since I am not, so for me it would have taken about 5 hours without hints)\n\nNot a bad game, it is chill and relaxing, but at its full asking price I'd say it's mediocre value at best",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice, super satisfying game and I love the graphics. However, I finished the game after 3 hours of playing (I enjoyed those 3 hours tho) and after that the puzzles just repeat themselves. Basically far too expensive for a 3-hour game. I still play it to get all the daily puzzles done, but they also repeat themselves after 10-ish days",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, I have crossed the refund window for the game and regret paying and playing this game. The game is supposed to be a cozy satisfying puzzler game. But the puzzles themselves are not the issue. The real issue is the mundane music, the no gap between puzzles, the zero reasons given as to why there a bloody cat in my game ruining everything, and the progression system in it's entirety. The game's positive of having interesting puzzles is negated by the fact that everything else about the game is boring us to death. I didn't buy this game for myself, i bought it for my wife who loves playing puzzles games and after 2 hours she said she hated playing the game. Sad part is, i sat next to her and watched her solve the puzzles, and get furious over the fact that her efforts were thwarted by a cat(she hates cats). Sometimes there is no point to solving some puzzles as well as some of the puzzle solving made no sense(It was just plain stupid). Overall i cannot in good faith recommend this game to anyone. You would be better off playing a co-op or a split screen game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to play this because it's been recommended if you like Unpacking, but I don't think that's a fair recommendation. Although both games have the major mechanic of organising things, it wasn't what made Unpacking special to me. By itself, A Little to the Left isn't a bad game but ultimately I didn't like it very much. Maybe I would have liked it if I didn't go into it with a false expectation.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy this if you are a completionist, or at all. The achievements require you to purchase DLC and I despise that I did not notice until after I passed the time I can get a refund. It is not fun or innovative with unclear rules that change for each level and just end with me looking up the answers. Don't even buy this game on sale, I beg. There are much better indie puzzles games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "about 3 hours of gameplay for this price is insane.\nit needs way more content to be worth the price",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "I have never encountered a game that overstays its welcome more than A Little to the Left. This is a \"puzzle\" game (I use that term somewhat loosely; I don't think the game is really the next Baba is You, nor is it trying to be) about arranging objects neatly. If, like I had, you've seen footage of the game, you've probably seen a lot of nice clips of people tidying up drawers of utensils or aligning stationery in a satisfying way.\n\nAnd the game does have those levels. If the game [i]just[/i] had those levels, I'd probably like it a lot more. But those levels are somewhat few and far between, and a lot of the content that makes up the rest of the game just doesn't really work for me. There are some decent ones - some levels later in the game play with ideas of symmetry, which are fun. A lot of levels, though, amount to \"arrange these six objects by height\", with an optional bonus objective for also arranging them by colour or something like that. These levels are such blatant filler and I have little good to say about them. A Little to the Left isn't trying to be a super complex puzzle game, but it'd still be nice if I had to think hard enough to be paying more attention to it than whatever I'm watching on my second monitor.\n\nThe worst offenders, however, are what I'll call the nonsense levels: levels where the solution isn't clear at all, and might not even become apparent after you've solved it. The final set of base game levels has a lot of these more experimental ideas, and often they just make no sense. For example, in one level you're presented with a set of hanging picture frames you can tilt, and eventually have to surmise that you have to get a ball in one painting into a hole another by tilting the frames so it rolls. But even once you work that out, which frame the ball will go to next isn't obvious, because they're not aligned, and so it just becomes a tedious process of trial and error. There's no \"aha\" moment like you'd want from a good puzzle.\n\nThe absolute worst level for this is the calendar level you encounter very early in the game. I have beaten this twice (achievements required two full playthroughs) and I still have no idea what the solution was. You have to put stickers on a calendar. I thought it'd be the case that each sticker would follow patterns on the grid, and for the most part they did, but some couldn't go where they would need to in order to continue the pattern, so it wasn't clear where else they should be. I eventually just resorted to trying each sticker in every square until I heard the audio cue for a correct placement. I'm probably missing something obvious, but that's also kind of besides the point when this game is marketed as \"the satisfying drawer arranging game\". There is at least a hint system - though they're less so \"hints\" than just reveals of the solution - as well as the option to skip levels entirely. Be aware, however, using these at all locks you out of achievements, which is why my second playthrough was necessitated.\n\nThe satisfying drawer arranging levels are good. I want to make that clear. The DLCs especially are a bit more focused on those kinds of levels, often with less obvious places for things to go (early game ones can be a bit simplistic because the spoon goes in the spoon-shaped hole, and so on), so some trial and error (the good kind) is required. That said, the second DLC also goes a lot harder on the obtuse stuff where you have to read the devs' minds to get the solution to trigger. Often I'd find the solution but not fulfil some arbitrary second requirement (at times, I'm not even sure if these requirements were intended) and have to just randomly move things around. For example, one level had one solution where you had to pull plants out of their pots and check the lengths of their roots, then arrange them by root length. When I did this, the solution didn't trigger, and so I ended up swapping plants into different pots until it did. As far as I could tell, there was no logic or pattern to the pots each plant was in when the solution triggered. I have no idea if I was missing something or if it's completely arbitrary due to some kind of oversight.\n\nThe problem with this game is just that satisfying drawer arranging really only has so much mileage. And rather than just make a small game focused on that concept, A Little to the Left is padded out with a bunch of levels which stretch its gimmick and wear it incredibly thin. I think the best way to sum the game up is its daily challenges. I normally wait until I've 100%ed a game before I review it (because I think you can only really give a fair review of something once you've experienced all of it and Steam achievements are usually a solid benchmark for what \"all the content\" entails). However, I'm still missing 9 achievements for A Little to the Left. I've played all the base game and DLC content, but those 9 achievements are for the game's daily challenges. Every day, the game wants you to solve one of its puzzles (and these puzzles are, at best, slightly tweaked versions of existing levels, there's nothing fundamentally new about them if you've played the base game). This game does not merit playing daily. It's not interesting enough for me to want to sign onto it every day. But it seems to think it is, because it has achievements for doing so for 100 days.\n\nA Little to the Left has a misplaced confidence in its own quality. The total cost of this game and its DLCs, outside of a sale, is £25. And its gimmick simply does not have the legs to support the number of puzzles required to justify that price tag. If this game were £10, and it was just the puzzles that are actually good, I'd love it. But for what it actually is - a lot of disappointing filler padding out the diamonds in the rough - there are much better indie games to spend that amount of money on.\n\n4/10 - While some satisfying, original tidying puzzles mean the game has its moments, A Little to the Left's gimmick far overstays its welcome by padding out its runtime with boring and obtuse levels that feel like they're trying to justify its high-for-an-indie-game price tag.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "it overstays its welcome for sure. repetitive puzzles that also grow a bit frustrating when you have found a solution that personally makes you happy lol. i didn't really feel like being at the whims of the tidiness of the devs. i'd recommend trying out 'is this seat taken?' instead, which has more clear-cut solutions... a personal preference, though!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not exactly relaxing to get interrupted by a cat for every minute. I wish there was a setting to turn it off.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TLDR; Agonizing gameplay\nSome puzzles are fun, but the main game on its own (and even with the DLC bundle) aren't worth your money for the amount of content provided. The puzzles slowly become illogical over time and left me more frustrated than satisfied.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Probably wouldn't recommend this to someone as a relaxing or simple puzzle game. I kept struggling with how specific the game requires your solutions be, and how often it's near impossible to figure out what they want for a solution without checking the hints. And sometimes, when I came up with something that did look like a good solution, the game just wouldn't accept it. Especially with the symmetrical puzzles, those were incredibly frustrating. I got all the way to chapter 4 trying to get into it, hoping that maybe it would be satisfying in the end, but ultimately, I just gave up. Just poorly designed, if I'm being honest. The cat was very cute though when it showed up.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game suffers from lack of directions. Additionally, like most of the reviews that do not recommend this game, the puzzles are NOT intuitive and heavily relies on the hint system and random guessing to figure out what the heck is going on. If you are someone who needs boundaries/slots for your puzzle pieces (or literally anything) this game will bother you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn't much fun. Theoretically it has a lot going for it - pleasant graphics, relaxing music, puzzles, sorting, and a cat. However, the puzzles are fiddly in an annoying way. There might be multiple solutions to one puzzle, but within the solutions, there isn't much flexibility. For example, you got that you have to order something by size or number, but only one way (left to right, top to down) counts, not right to left or bottom up. Sometimes, your solutions have to be pixel-perfect, so that you actually sorted everything correctly, just two pixles too far right. Therefore \"A little to the left\" has to be taken literally and this slight readjustment of correct solutions becomes an annoying trial-and-error assignment far too often.\n\nI also encountered some bugs (e.g. in the Archives with the extendable tool drawer - one of the puzzle pieces got stuck to the drawer and could not be picked up again), which made the game feel really tedious. It is fun in concept, but the execution leaves too much room for frustration as the difficulty is not finding patterns, but adjusting the objects in hopes you found the right spot for it to count.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "overall its a pretty good game ill admit that, the art is very nice and some of the puzzles did confuse me at times which was nice, but at the same time there was no clear solution. i liked a lot of it and its very enjoyable: i dont think its worth 15 dollars though. i got about 3ish hours of playtime for it when i expected much more content than what i actually got for the price which may just be my fault.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is cute, and the art style is enjoyable, but honestly the puzzles are not particularly clever and often are not even fun. There's not a \"satisfying\" element to it, save for a couple of puzzles. You are better off just watching someone play this and guess how things are organized.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game surprised me and sadly not in a good way. At first I loved it, only really being frustrated when some of the puzzles are obscure. But, then it ends, really quickly. And the last chapter just feels like it's full of filler puzzles, including one where you're just stacking boxes for a long period of time. \n\nI thought this was going to be a really fun game I can just play when I don't want anything too intense but sadly it really isn't much of a game at all",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some of the solutions are more guesswork than puzzle solving and it doesn't really scratch the relaxing itch either since you don't exactly get to organize things how you want. This game left me more frustrated than relaxed or fulfilled.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’m only giving this game a negative rating because people deserve to see the honest cons—I actually really enjoyed it. It’s a great, relaxing puzzle game with a unique atmosphere, but the bugs (especially in Chapter 5) really hold it back. Some of these issues have been reported on the community tab for over a year without fixes, and the devs seem more focused on releasing DLCs than addressing long-standing problems. When a bug hits, the only “solution” is restarting the level until it decides to work, which gets frustrating fast.\n\nIf the bugs were resolved, this would easily be a positive review from me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I must have lost my actual soul somewhere along the way, one of those times where you sell it during a cursing moment, but didn't mean it.\r\n\r\nI remember when this came out everyone was delighted by it. OCD made for OCD gamers! It just clicks!\r\n\r\nNo. It doesn't. At least not for me. Its just a series of sorting puzzles, some of them nonsensical and almost all of them just boring. It's like when as a kid your Mum demands that you do one of those General Reasoning test papers, or submit an IQ test because they're convinced your special 'but not in an academic way' and you sit there going \"what is this shit, Mum?\"\r\n\r\nLook, if you can find a game in arranging pencils sometimes by the amount they have been shaved and sometimes by the pattern on the bottom end, then all power to you I guess. \r\n\r\nOtherwise, to me it's a lo-fi, low-effort shabby replacement for a proper maths GCSE which could have actually gotten me a job, thanks a lot Mum",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've already posted a positive review of this game but I'm tired of being nagged to post another one so I would no longer recommend this game (however fun) to other players. If you play it you will be incessantly nagged to give reviews on it every day. Day after day. Every time you sign in. Frankly, it causes anxiety and a mild form of stress which I can live without. Please don't ask me again or the supplied text will, next time, be ever increasingly acerbic. Just leave me alone now.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A heavy casual-focused game with just enough diversity throughout the game to keep playing.\nHas some grindy achievements including playing the daily challenge for so many days in a row, and also for playing the daily challenge 100 times (not necessaryily in a row, fortunately).\nAlso, a big bunch of the achievements are locked behind two DLC, which given I paid only a few dollars for the base game, I'll likely not get the DLC unless it's heavily discounted at some stage.\n\nIt's not going to win any awards: it's relatively short if you just play through it without trying to 100% it, and DLC that cost almost as much as this over-priced game (at full price), tips me into giving it the thumbs down.\n\nIf it has a decent bundled discount with all DLC, then maybe consider buying it, but your life won't be any less for skipping this game.\n\nEDIT: Developer completely missed the point - why does the DLC cost MORE than the base game, even when they're on sale? DLC has been out long enough that it should be discounted to the same price as base game on sale by now.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It is a simple and relaxing game; however, that experience is greatly tainted by the fact that you have to buy all DLCs if you are a completionist, like me, and want to get all achievements. \r\nI also greatly dislike the fact that some of the achievements (daily missions) force you to remember to open up the game for less than 5 minutes on 100 days. I would be less frustrated with this if it felt worthwhile opening up the game, but it is, on average, more time to load all of the transitioning screens than to actually do each daily mission. They are repetitive, short, and overall not very fun. What's even worse is that some other daily mission achievements ask you to do so on consecutive days! \r\n\r\nI personally wish I hadn't bought the game. It's a calm and short little game, but not my cup of tea for the amount of money you are forced to put into it, especially if you want to complete it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is too short and its not organizing. most of it is puzzles. not good at all. took me four hours to complete the whole game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth the money i was able to finish the dlc in under 2 hours and thank god i got a refund and some of these puzzles are so stupid like they were totally reaching and running out of ideas in this shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really wish there was a neutral option, I can't recommend the game at full price though\n\nBe sure to get this game on sale if you want it (I got it when it was 50% off), the main set of levels is only 4 hours long if you're actually good with puzzles (I used hints several times since I am not, so for me it would have taken about 5 hours without hints)\n\nNot a bad game, it is chill and relaxing, but at its full asking price I'd say it's mediocre value at best",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice, super satisfying game and I love the graphics. However, I finished the game after 3 hours of playing (I enjoyed those 3 hours tho) and after that the puzzles just repeat themselves. Basically far too expensive for a 3-hour game. I still play it to get all the daily puzzles done, but they also repeat themselves after 10-ish days",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, I have crossed the refund window for the game and regret paying and playing this game. The game is supposed to be a cozy satisfying puzzler game. But the puzzles themselves are not the issue. The real issue is the mundane music, the no gap between puzzles, the zero reasons given as to why there a bloody cat in my game ruining everything, and the progression system in it's entirety. The game's positive of having interesting puzzles is negated by the fact that everything else about the game is boring us to death. I didn't buy this game for myself, i bought it for my wife who loves playing puzzles games and after 2 hours she said she hated playing the game. Sad part is, i sat next to her and watched her solve the puzzles, and get furious over the fact that her efforts were thwarted by a cat(she hates cats). Sometimes there is no point to solving some puzzles as well as some of the puzzle solving made no sense(It was just plain stupid). Overall i cannot in good faith recommend this game to anyone. You would be better off playing a co-op or a split screen game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to play this because it's been recommended if you like Unpacking, but I don't think that's a fair recommendation. Although both games have the major mechanic of organising things, it wasn't what made Unpacking special to me. By itself, A Little to the Left isn't a bad game but ultimately I didn't like it very much. Maybe I would have liked it if I didn't go into it with a false expectation.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy this if you are a completionist, or at all. The achievements require you to purchase DLC and I despise that I did not notice until after I passed the time I can get a refund. It is not fun or innovative with unclear rules that change for each level and just end with me looking up the answers. Don't even buy this game on sale, I beg. There are much better indie puzzles games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "about 3 hours of gameplay for this price is insane.\nit needs way more content to be worth the price",
      "voted_up": false,
      "votes_helpful": 46
    },
    {
      "review": "I have never encountered a game that overstays its welcome more than A Little to the Left. This is a \"puzzle\" game (I use that term somewhat loosely; I don't think the game is really the next Baba is You, nor is it trying to be) about arranging objects neatly. If, like I had, you've seen footage of the game, you've probably seen a lot of nice clips of people tidying up drawers of utensils or aligning stationery in a satisfying way.\n\nAnd the game does have those levels. If the game [i]just[/i] had those levels, I'd probably like it a lot more. But those levels are somewhat few and far between, and a lot of the content that makes up the rest of the game just doesn't really work for me. There are some decent ones - some levels later in the game play with ideas of symmetry, which are fun. A lot of levels, though, amount to \"arrange these six objects by height\", with an optional bonus objective for also arranging them by colour or something like that. These levels are such blatant filler and I have little good to say about them. A Little to the Left isn't trying to be a super complex puzzle game, but it'd still be nice if I had to think hard enough to be paying more attention to it than whatever I'm watching on my second monitor.\n\nThe worst offenders, however, are what I'll call the nonsense levels: levels where the solution isn't clear at all, and might not even become apparent after you've solved it. The final set of base game levels has a lot of these more experimental ideas, and often they just make no sense. For example, in one level you're presented with a set of hanging picture frames you can tilt, and eventually have to surmise that you have to get a ball in one painting into a hole another by tilting the frames so it rolls. But even once you work that out, which frame the ball will go to next isn't obvious, because they're not aligned, and so it just becomes a tedious process of trial and error. There's no \"aha\" moment like you'd want from a good puzzle.\n\nThe absolute worst level for this is the calendar level you encounter very early in the game. I have beaten this twice (achievements required two full playthroughs) and I still have no idea what the solution was. You have to put stickers on a calendar. I thought it'd be the case that each sticker would follow patterns on the grid, and for the most part they did, but some couldn't go where they would need to in order to continue the pattern, so it wasn't clear where else they should be. I eventually just resorted to trying each sticker in every square until I heard the audio cue for a correct placement. I'm probably missing something obvious, but that's also kind of besides the point when this game is marketed as \"the satisfying drawer arranging game\". There is at least a hint system - though they're less so \"hints\" than just reveals of the solution - as well as the option to skip levels entirely. Be aware, however, using these at all locks you out of achievements, which is why my second playthrough was necessitated.\n\nThe satisfying drawer arranging levels are good. I want to make that clear. The DLCs especially are a bit more focused on those kinds of levels, often with less obvious places for things to go (early game ones can be a bit simplistic because the spoon goes in the spoon-shaped hole, and so on), so some trial and error (the good kind) is required. That said, the second DLC also goes a lot harder on the obtuse stuff where you have to read the devs' minds to get the solution to trigger. Often I'd find the solution but not fulfil some arbitrary second requirement (at times, I'm not even sure if these requirements were intended) and have to just randomly move things around. For example, one level had one solution where you had to pull plants out of their pots and check the lengths of their roots, then arrange them by root length. When I did this, the solution didn't trigger, and so I ended up swapping plants into different pots until it did. As far as I could tell, there was no logic or pattern to the pots each plant was in when the solution triggered. I have no idea if I was missing something or if it's completely arbitrary due to some kind of oversight.\n\nThe problem with this game is just that satisfying drawer arranging really only has so much mileage. And rather than just make a small game focused on that concept, A Little to the Left is padded out with a bunch of levels which stretch its gimmick and wear it incredibly thin. I think the best way to sum the game up is its daily challenges. I normally wait until I've 100%ed a game before I review it (because I think you can only really give a fair review of something once you've experienced all of it and Steam achievements are usually a solid benchmark for what \"all the content\" entails). However, I'm still missing 9 achievements for A Little to the Left. I've played all the base game and DLC content, but those 9 achievements are for the game's daily challenges. Every day, the game wants you to solve one of its puzzles (and these puzzles are, at best, slightly tweaked versions of existing levels, there's nothing fundamentally new about them if you've played the base game). This game does not merit playing daily. It's not interesting enough for me to want to sign onto it every day. But it seems to think it is, because it has achievements for doing so for 100 days.\n\nA Little to the Left has a misplaced confidence in its own quality. The total cost of this game and its DLCs, outside of a sale, is £25. And its gimmick simply does not have the legs to support the number of puzzles required to justify that price tag. If this game were £10, and it was just the puzzles that are actually good, I'd love it. But for what it actually is - a lot of disappointing filler padding out the diamonds in the rough - there are much better indie games to spend that amount of money on.\n\n4/10 - While some satisfying, original tidying puzzles mean the game has its moments, A Little to the Left's gimmick far overstays its welcome by padding out its runtime with boring and obtuse levels that feel like they're trying to justify its high-for-an-indie-game price tag.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "it overstays its welcome for sure. repetitive puzzles that also grow a bit frustrating when you have found a solution that personally makes you happy lol. i didn't really feel like being at the whims of the tidiness of the devs. i'd recommend trying out 'is this seat taken?' instead, which has more clear-cut solutions... a personal preference, though!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's not exactly relaxing to get interrupted by a cat for every minute. I wish there was a setting to turn it off.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TLDR; Agonizing gameplay\nSome puzzles are fun, but the main game on its own (and even with the DLC bundle) aren't worth your money for the amount of content provided. The puzzles slowly become illogical over time and left me more frustrated than satisfied.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Probably wouldn't recommend this to someone as a relaxing or simple puzzle game. I kept struggling with how specific the game requires your solutions be, and how often it's near impossible to figure out what they want for a solution without checking the hints. And sometimes, when I came up with something that did look like a good solution, the game just wouldn't accept it. Especially with the symmetrical puzzles, those were incredibly frustrating. I got all the way to chapter 4 trying to get into it, hoping that maybe it would be satisfying in the end, but ultimately, I just gave up. Just poorly designed, if I'm being honest. The cat was very cute though when it showed up.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game suffers from lack of directions. Additionally, like most of the reviews that do not recommend this game, the puzzles are NOT intuitive and heavily relies on the hint system and random guessing to figure out what the heck is going on. If you are someone who needs boundaries/slots for your puzzle pieces (or literally anything) this game will bother you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game isn't much fun. Theoretically it has a lot going for it - pleasant graphics, relaxing music, puzzles, sorting, and a cat. However, the puzzles are fiddly in an annoying way. There might be multiple solutions to one puzzle, but within the solutions, there isn't much flexibility. For example, you got that you have to order something by size or number, but only one way (left to right, top to down) counts, not right to left or bottom up. Sometimes, your solutions have to be pixel-perfect, so that you actually sorted everything correctly, just two pixles too far right. Therefore \"A little to the left\" has to be taken literally and this slight readjustment of correct solutions becomes an annoying trial-and-error assignment far too often.\n\nI also encountered some bugs (e.g. in the Archives with the extendable tool drawer - one of the puzzle pieces got stuck to the drawer and could not be picked up again), which made the game feel really tedious. It is fun in concept, but the execution leaves too much room for frustration as the difficulty is not finding patterns, but adjusting the objects in hopes you found the right spot for it to count.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}