{
  "positive": [
    {
      "review": "Very good game\n\nPlease add controller support",
      "voted_up": true,
      "votes_helpful": 48
    },
    {
      "review": "I am not sure how I got sucked into 55 hours of this game at the time of writing this review.  I was concerned with the low-poly graphics not being immersive, but I was wrong.  Less is more.  I think my imagination fills in the rest and really makes it engaging, plus a fun base building system (build anywhere), and fun weapons to go find in interesting places held by scary bosses.  This is one of the few games to give me jump scare when a sneaky zombo pops around a corner after waiting for you there.  Unscripted fun at it's best.  Worth every penny at full price.",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "Great game great survival mechanics, Can but wish for co-op to happen no fun playing alone.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "This little gem took me by surprise. I got this 5 days ago and I'm now at 31 hours into it. It has little bits of different games that it resembles. The closest one that it made me think of was state of decay 2, but with building and crafting. I played it about 20 hours without crafting anything, and JUST started building a base at 30 hours. The storage situations a little different for me. It has rare items you can find or buy, and harder areas to go to once you are a little more together. And you can customize most aspects of the game play to suit your play style. I do recommend this.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "It's a great game, just wished there will be a multiplayer option soon.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "great game, having lots of fun. but heres a idea for next update 'random world generation' this would be a cool addition and add more immersion not knowing where you are at all times, also maybe add so gps needs batterys. other than that i would defo reccomend this game to people.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "One of the best little big games I've played so far, a pure pearl in survival games. Regular updates guarantee a long life for the game, which certainly deserves it. Recommended!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "So far its a great game. If i had to rate it id give it a 6.5/10. There a couple things that can be touched up on, minor bugs like getting stuck between obstacles and having your vehicle get flung upon loading into the world. Once you get to later game or even early game for that matter its not too difficult, all challenges or zombie/ zombie bosses can basically be easily killed by standing ontop of almost anything, in most cases a car thats sitting around. The zombie ai isnt advanced enough yet to be able to climb or really do anything about it. The points of interest are well made and look amazing but back to the zombie bosses and zombies themselves theres not enough variety. The zombie bosses are all basically the same with no real distinguishing factors between each other. Just bigger version of a regular zombie with a lot more hp. But its a good time killer overall and if multiplayer gets added i can see it being pretty fun. It has great potential.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The low poly visual aesthetic might not be to everyone's taste, but this is a really great post-apocalyptic zero to hero experience. It's a fun survival looter shooter that is consistently updated.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Addictively enjoyable\r\n\r\nGood realistic flashlight, good variety of enemies, and lets me fully indulge my inner hoarder. Took me a bit to figure out the guns, though, and I do wish there was a deposit/sort button for bags and containers (at least there is a transfer all button for loot containers)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a great little game. Solo dev too? I happily support this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a really fun zombie/survival game at a great price. At the time of this review, I have approx. 105 hours of early access game play, and feel like I have gotten great value for the money I spent so far. The game also appears to get substantial and relatively frequent updates.\n\nWhile the game map doesn't seem particularly large at first glance, the open world is surprisingly large, with lots of interesting points of interest to discover and explore. You can play in a third person or first person view. There are also lots of great weapons to find and play with, that sound and feel real (to me at least).  I also really like the art style.\n\nThe fact that the world resets everytime you reload the game isn't something I am a fan of though (although you do keep everything you have claimed/built/placed once you save). The sound system still needs some work - sometimes it seems like there is no sound, but when a strong storm happens it is too loud (I usually mute until the storm subsides). The game also still needs the addition of explainations for how various things work - luckily the internet is very helpful until this gets added.\n\nIf an open world zombie survival game sounds like something you would like, you should definitely check Surroundead out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have to say when I first saw this game I was skeptical but I looked into it and eventually decided to try it and I have to say its a great game 100% would recommend however my only gripe is I wish it had a multiplayer so I could play it with some of my buddies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is an absolute blast and I hope nothing but the best for the developer. \r\n\r\nLooking forward to the co-op in the far future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great game indeed. I know the Dev has a roadmap on the development of this game and once that gets completed, especially when multiplayer/co-op gets added it's gonna be more fun and popular. Hopefully the devs manage to polish and add all the things they want. Overall in short this game is pretty promising and has got a lot of potential.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An absolutely fantastic zombie survival game being made by one guy. There is a lot more to come, but don't expect multiplayer for a while yet. The dev wants to get more of the core systems working before implementing MP.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best survival game ever! I wait until you add multiplayer mode.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You can sit back and relax while playing this game but still not much content since it still early access game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Runs better than DayZ. Is better than DayZ. I hate DayZ. I love this game.\n\n'SurrounDead' more like 'i love this game'",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yes, I would highly recommend this game to anyone who wants to try it. It's in early access and still being updated by the dev, also, it's single player only for now. Which I prefer. The map is huge, and there's loads to explore and tons of loot to grab. also, there are vehicles you can drive, and others you can tow back to your base. So yes, pick this game up and try it for yourself. Its worth the price of admission. \r\n   I'll add updates here as things progress.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is as of 24/11/2025, quite early in the road map.\r\n\r\nFist off, thank you to the developers for such a treat of a game. I found it hard to put down once I picked it up! I overall enjoyed my time, and had an extremely smooth experience with 0 crashes or issues, and found no bugs.\r\n\r\nExploration is really fun and engaging with the random potential elements that occur, this allowed me to revisist previous locations but have a different experience.\r\n\r\nThe graphical style although not everyones cup of tea for certain, is clean, easy to navigate and stands out! I sincerly look forward to the introduction of more!\r\n\r\nCombat although straight forward, wasn't dull at all. It created in many situations a sense of excitement and rush! Some unique environments altered the way I went about combat, and I enjoyed the fact there were different approachs I could take to handle the situation the way I wanted to, and wasn't locked into any one way!\r\n\r\nThe variety of weapons was awesome to discover and expand into over the course of the game, as well as vehicle variety, althought RNG had it's way with hiding all the vehicle repair kits until the end of my run!\r\n\r\nI found a lack of purpose overall after about 10 hours of exploring. There is no direction in the current state that pushes a player in any direction clearly. I decided to chase the achievements as a sort of 'task list' to give myself direction and this worked out pleasantly.\r\n\r\nThe Infestations were cool engagement, and I enjoyed the changes they brought to the POI. Although after defeating the first one, and the second and third, I realised there was no objective or point in doing so. I have faith this will change in later versions. The bones are there, and they are strong!\r\n\r\nThe game had a similar feel to State of Decay in my opinion, without the community side (yet).\r\n\r\nI didn't get to much into the building side of things, I put down the 3 crafting tables and came to the conclusion that I had already found, or could buy better so moved on rather quickly down those avenues.\r\n\r\nI understand that the road map covers a lot of things that I find will expand the game dramatically and create an excellent experience for all that play! However the above review is in it's current state.\r\n\r\nIn later version, I will be running on more scarce/rare loot on the extreme side, to give the games later stages, a feeling of awe, and strategy relating to use of firearms and throwables. As I found I was swimming in weapons after 4 hours of play, after 10 I had a a kit of named weapons.\r\n\r\nI look forward to updates! And can't wait to see what's coming next! Best of luck to all the survivors to come, and those already out there!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "THIS GAME IS AMAZING for $15. I really enjoyed all aspects of the game. ONLY thing i wish for, is that this game be remade with a AAA budget and make the map bigger and more events happening around the map. More grapics changes. \n\nBUT i love this game and i love all the details in it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game for what it is so far, as long as the updates keep happening. I can see this game becoming even better, I do hope co-op or multiplayer can be added. That would be icing on the cake!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really really like what SurrounDead is!\nThis game scatches that itch that Dayz gives me but without having to worry about a random player killing me or my base getting raided.\nPerfect balance of Survival, Crafting, Zombie killing and base building. \nBig map, bunch of different place to explore and loot.\n\nI would like to personally see a few additions to the game in the future:\n(I know it's been talked about before) Online Coop would be delightful! Playing with friends on PermaDeath would be dope.\nChanging of seasons depending on where on the map you are. \nDecor for houses - holiday packs (Sell these for $5 a pack as DLC)\nPets - Adopting a dog or cat to roam around your base\nGardening - Being able to plant food (Tomato, Potato, Corn, etc) leading to additional cooking options (Full Meals with Buffs maybe)\nRoaming Hordes of Zombies (The longer you survive the bigger the horde)\nZombies that specially target your base (Similar to 7 Days to Die)\nRandomization on character customization\n\nGuarantee the developer has heard all these ideas at some point but I very much look forward to the future of this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, this game is really good for being made by one developer. The world is nice and big, there are a bunch of different POIs to explore, and you actually get rewarded for going to the harder POIs, unlike some other games where you clear it and get scraps. The base building system in this game is also fairly good, with a bunch of buildables for you to find, and it's simple to understand.\n\nI will say though, the only downside currently is that there isn't a lot of content in the game itself. Once you explore the map, kill all the bosses, and build your base, there really isn't anything left to do. Based on the road map though, this will be fixed later down the line since there are plans for quests, a bounty system, and then stuff in regard to settlements. There is also no co-op currently, but this is also a planned feature down the line in the road map, so I guess we'll have to wait.\n\nOverall, while you may not be able to sink hundreds of hours into this game yet, it was and still is quite enjoyable with the number of hours I've currently put into this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game has so much content its worth the price and you dont need a high end pc to run it smoothly",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a really fun game!\r\nAlthough the current content may not be extensive, it compactly includes all the fun elements of a zombie survival game.\r\nThe controls, UI, and core systems are simple and streamlined, making the gameplay stress-free.\r\nWhile there are a few minor details that could be improved, the overall fun factor definitely outweighs them.\r\n\r\nBy the way, why is the golf cart the fastest vehicle in this game?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game and played it for 12+ hours straight.\r\n\r\nTruthfully, this is exactly what ive been searching for, always having been a fan of dayZ, with a bit of Tarkov and other extraction shooters.\r\n\r\nThe overall gun-play of the game is absolutely fantastic, theres a huge variety of guns!\"\r\n\r\nIf you're looking for a great playing experience for a solo looter-shooter, then this might just be the game for you!\r\n\r\n10/10 in my opinion, damn near perfection!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surround is surpisingly addictive survival game. the atomsphere  is tense but relaxing at the same time. Scavenging, exploring and upgrading skills all feel rewarding. The way the game looks is amazing as well run good too. If i could make one request it would be co-op being part of it one day other then that 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is such a good game! still excited to see what the dev has in store for us, though. \n\nlove the graphics, the map, the vehicles, the crafting, love the weapons and the faithful recreation of them in pixel form.  \n\nwish we could have a dog. that's the only thing that i would actually love to see implemented, everything else is terrific. maybe some goofy stuff that isn't really important like, maybe cosmetics? more mouth shapes? seriously, though, there's really nothing i can think of that is 100% necessary to make this game better. it's great as is.\n\noh! the score is gorgeous, too. it's surprisingly great and something i didn't even expect.\n\nthanks so much to the dev, for making such a satisfying and oddly relaxing survival game. more people should be playing it. i will say that if you're the kind of person who doesn't enjoy finding their own way in a game and prefers to have things pushed on you then i can see that perhaps this might not be the title for you. personally i prefer games that give you a true open world, and the freedom to do whatever you please. this game gives you that in spades.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surroundead is coming along nicely! It mixes the looting-crafting loop of Fallout 4, the vibe of Day-Z and the building of Rust into a single cohesive experience that feels like the right counterpart to Zomboid for those like me.\r\n\r\nI'm excited to see where the game goes from here - I think I'd love to see more attention paid to unique POIs, a structure of quests and an advanced base building system in the future that allows for removing items from existing locations.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even though I got the game refunded it is a good game just not for me.\r\n\r\nThe customisation of what you want the game play like was amazing. The graphics are nice and different and it seemed to run ok when I was playing. I like the fact your storage was very limited to start with until you found a back pack or something like that. The lock picking was an ok mechanic on locked items.\r\n\r\nI only got it refunded because I just felt the resource collection was a little lack luster and did not draw me into the game. The fighting the zombies just did not make sense where you had to right click then left click to swing the weapon. Using the axe etc you could only use it in a certain slot on the toolbar and again right click then left click to use.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Difficulty settings for just about everything is why this is my favorite game. \n\nI love building, so I would like to see more in that aspect. More build pieces and collectibles to decorate my base.\n\nGreat Dev, great game, very active development.\n\nHighly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty fun but as of current (10/31/2025) there is no multiplayer i feel like this would make the game a lot funner if i could play with a friend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. needs multiplayer and more things to do like missions ! i love it tho and more is coming",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cant wait to see the final product someday.  Finally a single player non-PvP survival game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing zombie survival Game\nThe world feels and looks great, espeacially the underground/subway in first person with a flashlight, clearing out the tunnels and stations is an amazing experience. The gunplay also feels really good. This game has so much potential for even more content and new or improved mechanics and for 10 bucks an absolute steal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It amazes me that this was made by a solo developer ! this game is amazing. it got a lot and lots of weapons. base buildings, POIs, vehicules and more. there are tons of updates. you can see dev is reallt pationate about his game. honestly it is worth buying !!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very engaging! And quality of implementation is good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a well made game for a single developer.  Fun gameplay loop with some different takes on the sandbox survival games.  The addition of sliders for game difficulty and loot frequency dynamics is very welcome to reduce the barrier of entry to learning the ropes.  Off to looting I go again!  Just avoid those damn Raiders and Soldiers!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly reminded me a lot of an older more blocky game thats dead by now, but the visual style is very pelasant, gameplay is cool, im able to spend one hour in the game, farm couple POIs and quit happy!\r\nThe weather effect are worthy of a seperate note, because hail or rain are so comfy and well executed, i love the detail of sounds muffling when you get in the car.\r\nReally excited for this games future and to put a lot more hours, but this game does really need more content or at least modding support <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a truly impressive and detailed game experience from a solo developer. i've been looking for this exact kind of single-player survival game for ages! disclaimer is i got it on sale at $7 i think.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game i really feel like caters to every kind of gamer there is. You can change anything in the settings to cater to your playing style & make the game as challenging or relaxing as you want to make it. If you feel like you just arent finding anything you can turn up the loot spawns, if you feel the zombies are too hard you can slow them down & lower their health. you can literally change anything in this game in the options. this dev has really made something great here & i really look forward to the multiplayer coming out soon so i can play with my wife.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly recommend to implement CO-OP Multiplayer. Love the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i like it just wish it had a co op option. it feels like it has 7 days to die and state of decay dynamics and i like both of those games so its great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rule no. 1, get a bag, find another bag, put in the first bag for extra storage.\nPs. If you see more bag.. put it in each other, that way you will get infinite storage. \nRule no. 2 find more bag",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its like a mini singleplayer dayz without the pvp and just pure survival. theres also ai bandits, soldiers and also friendly npcs, so theres plenty of dynamic things happening.  easily game of the year",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Such a treat for such a great price. Just add co-op and this game will soar too an insanely high level. Goated dev keep it up",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game works really well. You just jump in and go. Combat is clean and responsive. 4 hours on my first session.... pretty good. I can't wait to get my mates in here with me and do base building.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is really good! Like really really good... \nIt's a bit rough around the edges, needs a lot of polishing, but for what it is right now it's great and definetly worth the money! Specially since this was done by ONE GUY, absolutely crazy!\n\nHere is a list of the things i currently like and dislike:\n\nPositives:\n- You can basically tweak every world setting in your game, from weapons getting damaged, the amount of hunger/thirst you lose, attachments durability, everything you can tweak the way you like.\n\n- The game looks really good, the lighting makes the game look so much better than it actually does!\n\n- It runs so well, as it should since it's a low poly game. I've got a 3070 with a 5700x3D and i'm running all on cinematic @1080 getting 200fps +\n\n- Combat feels nice, the meele weapons swing feel impactful and effective. There are a big variety of guns and the gun play is pretty good aswell!\n\n- The map is pretty big and full, i never found a place in the map where there's basically nothing.\n\n- It feels very casual, usually these kinds of games are very hardcore and hard to get into, but this one i felt more relaxed playing, there are a lot of mechanics, don't get me wrong, but they are straight foward and easy to get into.\n\n- Lot's of NPCs around the map, sadly you can't interact with them, but they make the game feel more alive.\n\n- The big POI's feel very different from one another.\n\nNegatives:\n\n- The inventory is a bit of a grey line for me... From one side is nice, because i'm a bit of a loot goblin, and i can basically get everything that i see in front of me with the endless stacking backpacks. But from the other side, it's quite annoying to open a crap ton of backpacks everytime i open a new container to loot just to get to a open spot. This gets progressively worse the farther you get into the game.\n\n- The gameplay loop, as you would expect with these kinds of games in single player, gets a bit boring, i'm already fully kitted out with legendary weapons and there's no incentive to keep playing.\n\n- The vehicles all sound the same, i wasn't expecting every car to sound different, but it feels quite weird to have a Golf Cart and a Military Humvee to have the same sound.\n\n- The AI needs some serious work, the game gets very trivial as soon as you can either shoot all the zombies from outside their aggro range, or by just climbing a car.\n\n- While the big POI's are very diverse and different, the smaller ones look exactly the same. Gas Stations being the biggest offenders here..\n\n- The traders don't have nearly enough money, everytime i've raided a big POI, i've had to keep exiting to the menu and logging in again to reset the NPCs inventory, to then buying more backpacks or ammo, to finally they be able to afford what i've picked up.\n\n- I wish i could rename my saves.\n\n- There's a waypoint guide on the top right of the minimap, which completely hides that area of the map, there's no way of minimizing that, you can zoom out completely, but then you can't see the POI's anymore.\n\nOverall the game has a great foundation and a lot of room to improve upon, there's a couple of things wrong with the AI specially and the gameplay loop overall feels a bit repetitive, i would like a bigger incentive to play the game rather then just \"survive\".\n\n 7/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Highly recomand for the gameplay , but we all wait for the COOP , that will be the goat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "honestly, so far games fire. Crafting is fun, editing how the game plays out, how spawns work, you can do so much with many runs, play however you like, and challenge yourself to the fullest. The only downside i ever think of is that there's no multiplayer rn, but it's in the roadmap. \r\n\r\nTLDR: solid single player zombie survival, i recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is exactly the kind of game that I love! Customizable game play. You can make the game as fun or difficult as you would like. Make a few saves, one for the ultimate struggle and survival experience; or a casual survival crafting chill world. you can make it whatever you want. This game has all the replay-ability you could ever want. Build, experiment, explore, and of course decimate hordes of zombies. Find survivors and trade. Repair vehicles and make travel a breeze. Loot storage and craft items. Go to the Safe Zone and do some trading. This game has so many things to do. After hours and hours in it I still love logging in and running a sesh! \n\nGet this game no matter your style. Casual, serious, streaming, chilling, whatever it can be whatever you want it to be! Awesome game, hats off to the DEV!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Saw the gameplay on Youtube, & bought the game. Absolutely love the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "buy it, doesn't matter if its on sale or not, 100% best indie survival game i've ever played, for a guy who barely has time to grind multiplayer survival games such as rust, this game gave me all the fun that comes with those games in a single player experience that I can control however i want, disable what annoys me, save whenever i want, literally anything you can think of doing, you can do it in this game, go buy it right now, the dev i absolutely insane and hard at work and best of all listens to feedback, you should be proud of this masterpiece",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game! Should have many updates coming up in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't really care about having the best graphics in a game, just as long as the gameplay is fun and this definitely achieves that. Good gameplay mechanics that aren't common that I like e.g. having to pack mags, carry items similar to a Resident Evil inventory management system, and carrying cases helping to pack and carry specific items for your base storage or on your personal kit. As cartoony as the simple art style might look, it still has good realism but not over the top to make it unfun to play. I'm glad weight wasn't implemented because that was always the most annoying mechanic in a survival game. The end-game is a bit hard to find. Fifty hours in and still can't find the rocket launcher. Improve the skill tree. Bosses are too easy to snipe from a safe distance (I would have them move around franticly trying to locate where the shot came from). Destroying the hives are a good balance of increased difficulty even if you are all kitted out. You are still flesh and bone and not a tank so can die easily. Can't wait for more updates to come like the bunker update. Found this game from a random YouTuber. Oh and most definitely worth the price!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sad to say that I have paid to play such a game, but honestly I ok with paying since the game is good, turns out to be worth every penny and its just crazy how such a game could suck so much ours of your day to play. The world the concept and gameplay provided in this game is truly immersive and fascinating. \r\n\r\nPlease if you could catch an offer or somehow get it for free try it and let me know your opinion...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant zombie survival crafting game. interesting secrets to discover and game play loop. Needs a little bit more recipes to craft and end game loop improvements but I know dev(s?) are working on that.  I cannot wait for future updates to this. fantastic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really like this game! \n\nMe and my son play it on different save files and both cant wait for another updates coming.\nIt just gets better and better for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everytime I think about firing this game up - I take a look and see how much much work has been done and how much more is in the game, I also see it increasingly getting covered by Youtubers - all having genuinely good things to say and everytime there is something more, new or improved about the game!\n\nAt first it looked and felt a lot like another one of those asset flip games that would just stop getting worked one day, with the Dev(s) dissappearing shortly after - But that has not been the case, it's very much the opposite and it deserves the praise it has been getting - when I see what has been done it seems \"too good to be true\" but this keeps surprising - to the point firing it up feels like I am started over in a new and much bigger and better game - It's a pleasant surprise but sometimes it feels a bit overwhelming when I don't have a lot of time to put in - That being said it's going to be getting some solid playtime sunk into it very soon!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Imagine the feel of a PvE Dayz server back in the day. This is pretty much it, but in a single player flavour (for now I hope). I'd say there is tons of stuff to add to make it team-ready, but for now it is a great butt cluncher at the start and mid game. Still not there at the end game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just fun. Not too many bells and whistles or anything special. Just a simple, enjoyable game to kill a few hours of your day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the gameplay, cant wait for the Co-op to be added so I can cause chaos with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, simple but fun and not too hard. Great game for survival games people, and it even has basebuilding, love it. Can't wait to be able to play wih friends, that would make the game way more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, loving it so far! Can't wait until next update. I would like to see controls over the weather, it has rained 4 to 5 times a day. It's getting old.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is  VERY fun single player survival game with tons to do and tons to find. i highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Review for SurrounDead – The Underrated Survival Masterpiece\n\nSurrounDead is one of those games that grabs you completely out of nowhere. It combines the classic feeling of true survival gaming with an open, dangerous world that keeps you constantly on edge. The atmosphere is brutally authentic — every step, every building, every item you find feels meaningful. You can tell right away that this isn’t just another loot shooter, but a game built around real survival.\n\nThe open world feels harsh, empty, yet somehow alive — exactly how a post-apocalyptic environment should be. You’re rewarded for playing carefully, looting smartly, and planning your route through abandoned areas. The progression system is addictive: every upgraded weapon, every piece of gear, every level-up makes you noticeably stronger, but never invincible.\n\nSurrounDead achieves something many survival games fail at:\nIt delivers the perfect mix of tension, freedom, and challenge. Whether you're looting for hours, exploring new locations, or fighting enemies, the game stays consistently intense and immersive.\n\nFor anyone looking for an honest, atmospheric, and surprisingly deep survival open-world experience, SurrounDead is an absolute hidden gem. One of the best titles in its genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, hours of fun, each update brings new guns to shoot and new areas to keep everything feeling fresh. so excited for the Dec update. keep up the good work. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game may not have the best graphics, but it delivers one of the most expansive open-world experiences you'll find. You need to buy it—at just $12, it’s an incredible deal that you shouldn’t pass up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game, a lot of things to do and explore. Many customization options to make the game easier or harder on pretty much every aspect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been going down a rabbit hole of zombie games for a while now. Some are good, Some are not.. SurrounDead was not one i would assume i would like. I was wrong.  This game has deep customization for weapons,  clothing, gear, etc. The building aspects are new to me, as i have been mainly running and trying to get better loot, but after 30 hours, im about to get into it. Everything about this game is a blast. This is one that you must not pass up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a great game and great deal for everything you can do. This game is really dope I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game!  Highly recommend to any casual gamer.  Can't wait for more content!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a cool game if you love looting and fighting zombies this game is for you. \r\nits lacking some stuff and it hasnt got all the potencial it needs but it is a decent game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really love how you can change  this game from a relaxing walking simulator into a hardcore zombieslasher in seconds with only a couple of sliders. If I only could tame the dog and keep the rabits as pets in my base...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically DayZ without the pvp has some \"pvp\" like moments with npc bandit groups that get around but other then that your'e free to navigate without seeing the you are dead screen when you finally get geared up after 3 hours of sweaty palms dodging zombies and other desperate players only to get knocked off by a camper so if you like survival base building and looting gear then get this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but in my opinion the spawns for the infections should be reduced a bit my general advice for new players is to wander around and loot and scoot until you get gps by that point you should have decent gear go to survivor camp and then keep exploring if you do wanna try the infections go for the secondarys only ignore the primary infections as it has more health also take out the health ffirst on the secondary infections before dealing with zombie spawns also do for 45 rifles or 7.75 those ammos appear more frequently then 5.56 well for me at least",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really loving this game so far! it feels great to play, guns are fun and varied and melee is straightforward and balanced. I like the ability to stash backpacks within backpacks/containers within containers to save on storage space lol. the environment is also very pretty, I know it isn't really a huge deal but the little flowers everywhere in the forest make me happy. it's a relaxing game when you want to relax with some base building, and a tense learning experience of a game when you want that too. keep up the great work, dev!! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game features great replay value for its price point with many creatively familiar aspects pulled form the broader survival / zombie genre. I am looking forward to future updates with fresh content be it POI's, vehicles, mechanics and/or weapons. Thank you for such a wonderful gift to enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game... but the RNG is rough. Item drops in high level areas are pretty garbage... car spawns are there.... youll need to explore everywhere...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The style and quality really catch the eye and as a zombie game its nice to see some changes in how a game like this works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I actually love this game, kind of proud for the dev to stick around after 3 years, I have seen other devs leave after much less time has passed. Can't wait for having to get car parts!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got this game and was very surprised with how fun it it. Cant wait to see what else they add to the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Best indie game ive played in years. Cant put it down. Also, stop asking for coop, let the dev do it when he wants to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my go-to Low-Poly Art Style Zombie Survival Game! Definitely deserves the attention, love and spotlight for the great updates from Z and his community driven updates.\n\nNOMINATE FOR Steam's LABOR OF LOVE AWARD! Really deserves it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun and very simple. I enjoy the gameplay very much. Kudos to the dev!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game but I would suggest adding multiplayer and a story line that utilize the quests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really good survival game just keeps getting better with each up date.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Besides being a great zombie survival game, the world's map is huge and full of interesting places to explore. The developer is constantly working on the game with updates and bugfixes, and can be seen very often in SurrounDead's subreddit commenting on posts.\nThe developer has a Trello page as well, where you can see what they intend to add to the game, it's current progress or if it's already added. This, combined with this game very low price, makes it a great experience and honestly a must play if you enjoy zombie content.\n\nThat being said, there is a couple things I wish the game had. For one is lore and/or enviromental storytelling in map locations. I know the developer is adding this among many other things in the upcoming 0.8 update, so I'm looking forward to that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even in Early Access I love this game, in an year it will become something incredible I will definitely keep playing!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome crafting mechanics and gunplay, but the zombie AI leaves a lot to be desired. Game is still in Early Access but I have great hopes Zurvivor will pop off and make a great product when it leaves development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game needs more stuff to do but the dev is constantly working on it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only game I have played that I have been able to notice updates thru out my time playing it. Can be stressful but also pretty chill at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a great game and reminds me alot of unturned but better in every way. Amazing game keep up the great work dev.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun and immersive game with a unique survival element.\r\n\r\nIt's like DayZ, but well done (so far).\r\n\r\nI hope it continues like this and that version 1.0 arrives soon.\r\n\r\nHighly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the inventory and gunplay, easily the only reason I played.\n\nOtherwise this game is suuuper empty.\n\nIt's fun to get the highest rarity weapons but they're really not that hard to get. The high tier zones are basically just \"kill all zombies who have bigger numbers than normal zombies\" then you go and get the loot and leave. Which is essentially the entire gameplay loop of the game. Once you've gotten the best stuff the world is dead.\n\nNo point in even building a base when you don't really store anything because you already have everything you need. No events or anything that would put your life in danger.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is gonna be one heck of a game.  As it currently stands, its well polished, despite being in early access.  You can really tell that this is a passion project for the dev team.  The graphics, while not great by modern standards, don't detract from the experience at all.  If anything, it comes off as even more charming because of it.  Also, I haven't run across a single bug yet.  Overall, I'm extremely impressed, hats off to the devs for focusing on playability rather than fluff.  Definitely going to keep a close eye on this one.  If you're on the fence and like survival crafting games, in my opinion, this is well worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SurrounDead is a super fun and chill survival game. The atmosphere is great, exploration feels rewarding, perfect if you want a laid-back post-apocalyptic experience. Definitely recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game so far!\n\nYou can tell the dev has put a lot of effort into it and so far its pretty promising.\n\nI'm 41 and just need a dad game that isn't insane or too intense and this fits in pretty well. Zombies can kill you in a few hits to keep the pressure going. Not a fan of the exploding acid guys.. main culprit to my deaths.\n\nfew things need to be done still, like the blood moon shows up but nothing happens. Dev stated he has plans for it so I'm excited to see how that works out.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "REALLY overrated. After about 5 or 6 hours I was completely kitted out and had experienced pretty much everything the game had to offer, and was bored out of my mind doing the mindless loop of kill, loot, kill, loot. Unless there is a substantial overhaul to the content (and judging by the fact this has been in early access since 2022 I find that unlikely), avoid. Not worth your time.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Put an extremely rare sniper on a mount to admire in my base, took the mount down to move elsewhere, extremely rare sniper vanished... Next I found I drop with a fancy generator and extremely rare backpack, spent 15 mins. rearranging my current backpack to fit the generator I desperately needed, got in my car and then everything froze. I couldn't move... lost the generator, lost my current backpack and the 15 mins. it took me to do all that crap. After than I decided to finally use the 7 laptops I'd saved the whole game (very rare items). Got in a fire fight, character got stuck in the terrain, couldn't move, character died... I reload and all the laptop locations disappeared along with all the laptops... Uninstalled the game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This needs to cook for a loooong time. I'm not sure why it is reviewed so well.\n\nIt's basically the unreal engine framework easy survival RPG with some custom assets.\n\nEverything is full-on jank, from weapons not hitting at the reticle, broken animations, empty world, lack of depth, bad UI etc. Compare this title to the trailer for Deadpoly which is essentially the same thing. They even use the same plugins share a lot of the same assets on the same frameworks.\n\nBecause this is a solo developer and they're relying on an unreal engine plugin with poor multiplayer support... I can't see this ever exiting early access unless the developer hires a dev team to assist them.\n\nPass on this for at least a year, unless you have a very high tolerance for bugs and problems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even though it's Early Access, I still wouldn't recommend it. It doesn't seem to do anything different or better than other games in the genre and does a lot of things worse. Controls are clunky and don't always work as expected and enemies are pretty broken.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The graphics I had to get over a bit, but quick getting used to. Pleasantly supprised by the game lot of content and really fun to play. \r\n\r\nStill negative review for now because to the total mess with the savegames. For example repaired vehicle loaded up with loot and next login its gone, loot gone and waisted playtime. Overwriting savegame also didnt work and got rown back to the original savegame Showstoppers for me till this is fixed. Dev if you want happy costumers this is one of the first tings which should be ok.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Put an extremely rare sniper on a mount to admire in my base, took the mount down to move elsewhere, extremely rare sniper vanished... Next I found I drop with a fancy generator and extremely rare backpack, spent 15 mins. rearranging my current backpack to fit the generator I desperately needed, got in my car and then everything froze. I couldn't move... lost the generator, lost my current backpack and the 15 mins. it took me to do all that crap. After than I decided to finally use the 7 laptops I'd saved the whole game (very rare items). Got in a fire fight, character got stuck in the terrain, couldn't move, character died... I reload and all the laptop locations disappeared along with all the laptops... Uninstalled the game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unreal Asset store flip. I really don't get why this has the reviews it does. It's just Unturned in 3rd person, but worse.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Pretty boring in the current condition. There's seemingly nothing to do in this zombie survival game aside from slowly dying or quickly dying. It's DayZ minus everything that makes the game entertaining (the multiplayer aspect).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not a great attempt at being a 3D Project Zomboid. I do appreciate that you, unlike PZ, can save the game if you want to, but the combat feels way too wonky, the objects that says \"Blocks Spawns\" don't actually keep zombies from appearing nearby the next day, and the most immersion breaking feature is that all the lootable objects gets reset every day which means you can get so much more loot than what seems fair",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i really dont get it, looks and plays like a really bad unity engine game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This needs to cook for a loooong time. I'm not sure why it is reviewed so well.\n\nIt's basically the unreal engine framework easy survival RPG with some custom assets.\n\nEverything is full-on jank, from weapons not hitting at the reticle, broken animations, empty world, lack of depth, bad UI etc. Compare this title to the trailer for Deadpoly which is essentially the same thing. They even use the same plugins share a lot of the same assets on the same frameworks.\n\nBecause this is a solo developer and they're relying on an unreal engine plugin with poor multiplayer support... I can't see this ever exiting early access unless the developer hires a dev team to assist them.\n\nPass on this for at least a year, unless you have a very high tolerance for bugs and problems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even though it's Early Access, I still wouldn't recommend it. It doesn't seem to do anything different or better than other games in the genre and does a lot of things worse. Controls are clunky and don't always work as expected and enemies are pretty broken.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Interesting idea, but everything in this game is janky.  \r\n\r\nNeeds a LOT more time in development.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i just noticed this game has been out for 3 years. hence the not recommended tag.\nit also came out shortly after ( https://store.steampowered.com/app/1621070/DeadPoly/ ) Deadpoly was released.\nand oof the similarities. that being said. both seem to be putting out \"updates\" continuously. Deadpoly being updated monthly.\nyou decide.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "pretty fun until you realise there isnt much point in playing past a sertain point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please add controller support.  The game experience would be improved greatly with controller support. Mapping multiple keys for specific things that could’ve be worked better with full controller support.  Please add that in one of you phases.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game after some friends told me about it ( like many do lol ) and figured i try it out! i kinda slightly regret buying this now!! After only 17.2 hours ( yes only that long ) i noticed and finally realised how much of a rinse dry and repeat this game honestly is.\ni 100% understand its one person working on this and i give HUGE MASSIVE PROPS and CLAPS for this person. i love how this game looks and everything about it but its lacking sooo much that its hard to look at it and go \"do i really wanna play right now?\" or \"do i honestly feel like doing the same thing over and over and get legit nowhere?\".\nNow hear me out yes there are games out there that are the same thing but least they offer a little more.\nThis game gives me unturned vibes with how fast i found stuff right off my first day playing.\nLooting is pointless cause your legit selling everything back to traders that already have what you have.\ni gotta base already whats in my base 10 tents whats in those 10 tents USELESS STUFF I DONT NEED CAUSE I CANT SELL TO THE TRADERS!!!!!!!!!!!. i got so much stuff like bruh why. CANT DO ANYTHING WITH IT. dust collectors my friend would say. i legit just shoot zombies collect EXP and leave everything there cause legit no point. i got 2 wallets full of cash i cant spend why cause i already have the stuff thats being offered and then some. i should be the traders and set up shop LOL.\nNow i did see somewhere that co-op is coming and honestly i think that would so turn tides on this game and make it actually worth that i think it should have been in first place a co-op/MP game.\nBut meh thats my 2 cents worth. if i had to scale the game on a MEH to HELL YEAH rating for me its more MEH EH MEH ( in english 1 to 10 its like a 4.6 )",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashed 5 times in 30 mins during the tutorial, crashed again during the radiation zone so I couldn't add the rad filter, died & respawned to only then fall through the map. I had high hopes for this game based on reviews :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used the last hour to sucide so i could get clsoer to where i died, it keept spawning me the same palce out in the end of the map, just because the save point didnt work... A little sad a bought this one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs an in depth overhaul on how the inventory management system works. Either limit \"containers\" within \"containers\" or allow for item stacking with no limit on \"container depth/sub containers\". Haven't spent long playing and really enjoy the game. I want to play more, just don't enjoy 50% of my gameplay being inventory management.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a broken game that has a garbage melee attack mechanic and broken fall mechanic. when i slide, i received fall damage. i'm not recommending this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i CAN see this game become somthing fun and good in the future, but as of right now its pretty barebones and lackluster, doesnt really hold any interest for me in its current state. needs to cook quite a bit longer. 2/10 as of 11/9/2025.. maybe in a year or so an update will come out to where it can be re-visited.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At least at this point in Early Access, I'm going to say I'm not really into SurrounDead. I've played Project Zomboid, 7 Days to Die, and plenty of other great survival games like NeoScavenger. For me, the game play is too arcade-like for a post-apocalyptic survival game.\n\nMaybe arcade combat and boss killing loot mechanics are a plus to others, but I wouldn't suggest this game to any of my friends. I had a few hours of fun so I don't regret my purchase, but I found the combat and survival aspects a bit too shallow.\n\nNote: This review focuses on the current state in Early Access. I will change my review in the future if updates warrant it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I understand its early access but no sorry.\nThe entire thing is just a worse unturned reskin atm with worse movement/combat feeling.\nI altF4 refund after shooting few bullets and being in melee combat with 2 zombies for like 5 seconds. \nMaybe someday with years of work...right now this has literally no advantage over unturned and that game is freaking F2P.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like big empty buildings that dont look like anyone has ever lived in them then you found your game.\nIt's pretty bare bones in my eyes and I dont see any reason to play it at this point\n\nEnemies just have a gotoplayer script and thats about the AI of it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have over 200 hours into this game and recently, about 2 months ago or so, this game just locks up when loading into the game. I can spend all the time setting up a new game, but when i finally get to loading the game it immediately locks up after initially loading. Don't know what drastically changed to cause this but it is functionally dead for me. I really enjoyed this game up to this point but now, it's just a big disappointment.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nope, game need's like 5 years of development..  Not a Single player game !!!!!!!!!!!!  This will go multi player soon. Just another open world trash game, could of been good if kept single player. BAD DEVELOPMENT !!!!!! Note the Dev's name and tag him so you do not have to deal with anything he put's out.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "BUGGY MESS , $2500 (in game currency) wasted on classified case , the quest and crate disappeared as got to the location . found an ambulance decided to tow it back to base and when i unhitch it both vehicles got launched into space . The save function doesn't save the enemies you have killed so when you load the game into a hostile area you have cleared you get f*cked as your character cant move for 5 seconds when its loading in . The game has potential but in its current state i would avoid it .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I woudln't recommend it in its current as of 0.8 . I played 10 hours, it feels bland and empty. I played 500+ hours of project zomboid. This is not it. For the price, it's Ok. Some of you might find this fun. For me, it gets pretty repetitive very quickly and it's an unbalanced jenky mess sometimes. \r\n\r\nmaybe worth a buy later, who knows.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love what this game could eventually be, but I can't recommend it in its current state.\nTo be fair, it is being actively developed. But, it's incredibly slow for my taste.\nI assume that's mainly because it's a solo dev or a small team.\nHere's my advice: add it to your wishlist, follow it, and buy it when version 1.0 is released.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has been out a while now and I'm not sure what is even being added to the game. \n\nIt's overall boring. Melee is terrible. Skill progression is weak. Animations don't exist for basic actions. Movement feels clunky. It's inventory management out the wazoo. No real narrative to carry you. Enemy AI leaves more to be desired. Enemy variety seems weak but I'm not sure. Zombie games usually have weak enemy variety. There's lots of texture pop-in, which is bizarre considering the graphics are bare-bones basic. Texture pop-ins drive me crazy. \n\nThere is no world here. It's a big empty sandbox, which would be more interesting if it the graphical fidelity was beautiful and there was great music but that's not the case. \nThis is basically competing with my modded Fallout 4 experience and even State of Decay, which I hardly play, and to be fair, Fallout 4 keeps getting hammered into the ground by Bethesda so we'll see what becomes of that. \n\nI won't refund the game because it's cheap enough and I want to support small devs and I have a Steam family who can check it out too. \nI hope they do more with this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TO THE SURROUNDEAD DEV'S  the game stopped working i have tried everything please fix it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is in EA, Ill come back and update after v1 but currently:\r\n\r\n- Game has really solid foundation, but needs to be built out more. As it stands there isnt really anything to do besides collect loot. Theres little reason to play this over DayZ or 7 Days to Die.\r\n- Combat is brain dead. You shoot or shoot or swing, thats it.\r\n- Looting is BOUNTIFUL. I mean good lord, once you have what you need, there is almost zero chance of dying EXCEPT\r\n- The larger and boss zombies are kinda dumb. Basically if they catch you, youre dead. You can't run away, you can't roll away. You either out DPS them, or you die. Its a really bad design. Players need choice, they need options, they need tools. None of that matters here.\r\n- Zombies are effectively all black belt ninja masters in the art of never-make-a-sound. Even the big dudes will just magically appear next to you. Disabling the music is almost required (which, again, bad design because why even bother spending time on music if we have to mute it to hear anything). \r\n- Theres some QOL features sorely needed for inventory management. Disassemble, split, auto pickup/auto reject, stack-all, sort-all, etc etc.\r\n\r\nI LOVED State of Decay and this has an opportunity to be close to that but it needs time to soak. And you cant blame the guy, its literally one developer. \r\n\r\nGive it time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Seems like a cool concept, but crashed early and often. First character I played about 10 minutes - crashed with no save or restore - had to start at character creation again. Second character I played less than five minutes - same thing. Created a third character that crashed immediately after creation. Requesting refund, might check in later.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At the moment the game does not support cloud saves so it is not a good game if you like to move between PC and steamdeck. If this is implemented I'd recommend the game, but looks like it's been over a year without it and it isn't on the roadmap by the looks of things...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "tired of progress never saving, give autosave feature. makes this game unbearable to play when my power is being spotty. other than that, love the game, but ive lost so much shit at this point im done playing this game. it ruins the experience and flow. i finally had good gear and lost it all. (edit while in a more clear thinking state, i realised i was malding a bit too much, I love the game, but please auto save whenever ya get the chance <3)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can corrupt your save, resetting your map, progress and deleting all your bases. Don't risk it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "350 hours game wont start literally did everything and cant evenfind save files to delete if i wanted to start over , i actually liked this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has potential, but there's too many flaws at the moment for me to recommend it. I wish there was a \"Neutral\" option for reviews. I understand it's Early Access, so I will change this if things improve.\nHunger and Dehydration happens way too quick. You can hardly do anything at the start except look for food and hope you don't get swarmed.\nThe little bit that I played, I just wanted to play 7 Dayz to Die instead. Again, I hope this changes, but as of now, I can't recommend this as there are much better options out there with the same genre.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The inventory system is terible. you can place a backpack inside another backpack and having virtually infinite inventory space. combat feel a little bland too",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Looks good, but feels unfinished.\nIn one \"hand\" games goes super \"real\" makes you load bullets into mags from backpack and prepare mags so you can reload\nand on the other \"hand\" you cant find or pick up  simple \"stone\" from floor or \"salvage\" any car that you find\nyou have to walk around from \"trashed car\" to \"trashed rusty car\" mind you they all look the same; but you can only salvage like 1 in 20 you find. \nAnd i wont even start on inventory managment. \nFeels unpolished and unfinished if updates keeps coming il try again in 1y time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "missing lots of basic features, game is cash grab garbage, save your money and time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game made me kill a family of 5 with an RV on the side of Highway 3 and i have less regrets of that than buying this game. 10/10 would hit them again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "needs multi player wont tell anyone to buy it until you guys add it that should be prio number one if you guys did that this game would sell 10x",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring, forgettable experience, glitchy. \r\nAlso big cartoon heads look stupid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Put 33 hours into this game within a couple days. Had a BLAST playing it. Then i switched to a newer PC and now my saved files are gone. So from what I've been told, I have to start all over since the game doesn't support cloud saving. So I have to start ALL OVER. Bullshit. If i would've known this i would've never bought the game and bothered with it to begin with. Waste of money and time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't. Still on development and feels better then crack. just don't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad hitboxes from zombies, knife didn't work, pickaxe+axe didn't work in the tutorial.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When the game has full controller support, I will take it seriously. Until then, it's an absolute no for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controller support please!  Will revisit later.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "combat is horrible, unreal asset flip",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game suddenly crashed all the saving lost please do something about this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It’s not that good like people say it is, idk what they like about it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible optimization. took up 94 percent of a RTX 4070.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "without multiplayer its kind of boring after a lill time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is cheeks and buggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Assetflip + 1 month made slop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unplayable until they add an Unstuck button",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand whats to like about this game...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cool demo but has the depth of a small puddle.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "make this shit multi player already...smh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "wow this game intro needs some heavy revision",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs multiplayer....................",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "feels unfinished...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS IS BUNS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game keeps freezing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ill wait",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "LOL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Boring.[/h1]\n\nSurroundead doesn't offer players much to do. There's some stuff to loot, there's a couple of zeds to kill, and there's currency to accrue, but that's it. The map never changes, all zombies are essentially the same, and the loot table is surprisingly small. Nothing exists to capture a player's attention, apart from knowing you're supporting a solo developer.\n\nThere are also a few things that flat-out don't make sense, like how a box of ammo -- which only nets one actual bullet -- takes up two inventory slots. Slots which, I might add, are very hard to come by; I had to loot half the map just to find a duffel bag. And since very little actual looting can be done until containers are found, the game is actually pointless to play until storage is obtained. Otherwise, you're just looting things to leave behind.\n\nSince Surroundead has [i]this[/i] little content to offer after [b]2.5 years in EA[/b], I have to assume it'll be just as boring and lifeless in the years to come. \n\n\n3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has a lot of potential. However, my main issue is that zombies are locked into specific poi (point of interest) locations which makes building a defensive base unnecessary. Since zombies aren't a threat in the open world, there's no constant danger. Knowing exactly where the zombies will be removes the challenge and becomes repetitive. I think Project Zomboid is a great example of wandering zombies being a constant threat, and implementing a similar system would make this game much more engaging. Zombies and loot at poi locations respawn the next morning. This makes clearing a town feel pointless, as you lose the sense of accomplishment. That being said, I bought the game on sale and don't regret the purchase. I understand it's in early access and a work in progress, but this is my current impression. I'll check back after each patch and update my review if things change. 6/10",
      "voted_up": false,
      "votes_helpful": 655
    },
    {
      "review": "I really want to like this game, and I kinda do, but it's just... kinda boring.\nI understand it being in early access, so obviously things are gonna be a work in progress or upcoming features, but it's pretty painful in this game at times.\n\nThe gameplay loop basically boils down to explore, kill, loot, sell, repeat. This could work, but the problem here is that the loot table is pretty small, and even the unique/named items are mostly a cosmetic difference with a mild boost to stats. The zombies are all unique COSMETICALLY and that's it; there's really no difference in any engagement with the infected. All you have to do is jump on top of a car, fire off a gun to get attention, and pick them all off from the safety of 6 feet high. Even the unique zombies and the boss zombies just try to beeline their way directly towards you, and then stand idle when they can't reach you, just letting you shoot them or even just crouch-melee them. Boots-on-ground combat is definitely a challenge but it's JUST as rewarding as cheesing it.\n\nThen there's the grid-style inventory management system. If you like to keep your stuff tidy, if you are a pack rat, if you play like a nomad, or if you're all of the above like me, then you will literally spend half of your time just doing inventory management. You have access to bags and containers for specific items, but you have to limit yourself by not putting bags inside of bags (or disable it,) or you'll end up playing tetris while thinking about that gif of spongebob pulling the bag for chocolate out of the bag for chocolate over and over and over... yanno?\n\nLet's say you figured out the inventory management system, and you have a good start going... well, what now? The game gives ONE quest (as far as i've seen) which is \"go to the main settlement.\" After that, it's all just exploration, which is fine. There's points of interest to explore that are fairly unique, but this game artificially inflates how dense the map actually is by dotting the entire map with tons of abandoned houses with like 2 loot chests that give mediocre stuff, and suddenly OVER HALF of the POIs become drive-through points, and half of the ones that are actually interesting are soft-locked by keycards that you can buy or loot. Good luck having the right one, though. (I spent an entire playthrough with 10+ level 0 and 1 keycards, but the only cards I ever used were 2 and 3. Maybe I'm missing something?) The card-locked places and non-abandoned ones can be fun, but then you end up just looting all of the same crap you've been looting for the last 15 hours. By the time you're done, you're either hauling an insane amount of gear to TRY to sell at a vendor (who is also just selling more of the same crap you've been looting with SOME exceptions,) only to be hit with the realization that all 4 vendors plus the wandering trader can only afford to buy a total of like 60% of your crap, which you then take that money and promptly slide it into your rectum because that's more useful than spending $2500 on 70 bullets (a high tier weapon sells for 200 at MOST)\n\nSo now you're stuck with the other 40% of the crap you couldn't sell, and some resources you want to keep, just in case they're useful. So let's set up base somewhere! Except... that's kind of pointless. Yes, you can pick a spot to call home and yes, there are quite a few buildable pieces you can craft or loot, but... other than that, the resources you've collected will more than likely end up collecting dust while you're out collecting more. There's crafting recipes for gear and other stuff... but it's all just the SAME SHIT YOU'VE BEEN LOOTING THIS WHOLE TIME (again, with a few exceptions.) There's not anything that you could craft that would give you much of an edge over the zombies (not that you'd need it,) there's only a handful of building pieces that are useful if you're building your base in a POI, and there's no real reason to stockpile anything since the traders sell what you need, it's abundant in the loot, and/or it doesn't really serve much of a purpose. There's no defense of the base, no people management, no wandering hordes, no stakes.\n\nLet's say you looted a good amount, killed a good amount of zombies, got some money and gear, and you're confident and ready to take on the next step. Well, the next step is the same exploration loop you've been doing, but with guns and a vehicle, but the end goal is... making money you won't spend? collecting resources you won't use? collecting cool looking guns just to find out they eat more bullets than you can buy or loot, or they are worse than what you already have? Building a base that is functionally useless and aesthetically a nightmare from having to reuse tons of objects? Complete quests that... just aren't implemented yet?\n\nI did enjoy running through the POIs and managing the radiation while fighting zombies and NPCs (which are just filler people, some vendors, and 'bad guys' to keep things interesting) but there wasn't a goal other than... seeing it, i guess. There's some story fragments you can find via readable notepads, but they blend in with the environment half of the time because they are the ONLY interactible 'item' that spawns like a normal item would. Everything else is in a chest. No guns or ammo on tabletops, no decorations. The stack of papers acting as the fragment, and that's it.\n\nDon't get me wrong, this game has SO MUCH POTENTIAL!! It's like a healthy blend of 7 days to die, project zomboid, dayz, and probably other games i'm not thinking of or haven't played, and it's definitely in my wheelhouse... but the problem is that the only thing this game offers are unfinished similarities to the unique aspects of those games - zomboid's exploration and melee combat, dayz's grid inventory, 7 days' focus on guns, etc.. I'm loving the melting pot of vibes this game has for those titans of the genre, but it needs more work. I'm just afraid of this game falling into the early access hell.\n\nLastly, I know this game was made by one person, and I give them all of the props in the world for the effort they have made, so I'll still have my eye on this game for a while, but right now it feels like one of those old xbox 360 games that were an imitation of another popular title but without the comittment to make one thing really good and instead opting for a tiny bit of everything.\n\nI know my words can be a bit abrasive but I do like the game's potential, but i'm having a hard time putting any significant time into it because it feels like i've hit the endgame after 20 hours. If there's more quests, better building, or better/more unique gear implemented, then I'll be able to sink more hours into it.",
      "voted_up": false,
      "votes_helpful": 103
    },
    {
      "review": "REALLY overrated. After about 5 or 6 hours I was completely kitted out and had experienced pretty much everything the game had to offer, and was bored out of my mind doing the mindless loop of kill, loot, kill, loot. Unless there is a substantial overhaul to the content (and judging by the fact this has been in early access since 2022 I find that unlikely), avoid. Not worth your time.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Not a game you can sink your teeth into at the moment. It's basically State of Decay except with no NPCs (except for a small spot) and nothing to really build towards. Zombies and loot re spawn every time you go to sleep and always spawn around development. The most you can do right now is build a base in the middle of the woods and run down to old buildings to bring loot back day after day. There's a trading system with the survivor town, but you find plenty of good weapons and ammo just searching buildings.\nDevs need to:\nGive some progression that actually effects the world. Otherwise it's just singleplayer DayZ.\nMake loot matter! At standard settings, I should not run into so much stuff that I never worry about scarcity.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "Just watch a youtuber play it for now. The loot respawns every 10 minutes. You run to the traders and come back, half of the pois are refilled. There is a setting for the timer but it doesn't work.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really enjoyed playing for a few hours with permadeath and didn't encounter any major bugs, but now the game crashed and apparently corrupted the save, so every time I open the game, it crashes again. \r\n\r\nAfter some research, I think you can fix this by deleting the save in %appdata%, but I'm not going to bother.\r\n\r\nMaybe I'll give it another try when I have the patience to \"fix\" this issue.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "For sure checks a lot of boxes in zombie survival. But PLEASE dev, fix your stunlock zombie mech, makes the game on higher diffucitles literally impossible to play 3 taps to a t pose sidestepping jesus zombie gets old after death # 3000",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I saw surroundead and thought it might be a fun game to mess around with for a while. The game has potential but needs alot of work and at this point in time i wouldn't recommend it. \n\nMy biggest frustration is that the base building is pointless because your items are constantly dissapearing. The whole point of the game is to kill zombies, collect materials, build a base, and hoard gear. But considering every time you go back to your base large amounts of items are missing from your storage or fell through the map I just can't recommend it. \n\nI spent a few hours running around looting towns and got back to base to notice half of my items were gone. This isn't just a one time thing either I noticed it a few times but thought I was crazy. But then 100% confirmed it happens relatively often. \n\n2/5. I'll try again in a few years maybe.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Too many bugs in game to make this enjoyable. Whole base disappeared after i saved and left the game. pretty broken piece of the game if i can't build anything",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Best Unreal Marketplace asset flip around. \n\nZombie survival game about everything at the same time about nothing. \nOver cluttered with all the things about survival games and at the end nothing makes sense.\nFeels like everything is slapped in just to have it, from food and water (which just a annoying and basically does nothing) just to fill that survival theme. \nIn 8 hours I played basically reach and find everything, top tier loot, a car, killed boss monster (sorry zombie).\nBasic loot hoarders game, game at this point doesn't have point, it tries to be every zombie survival game. \nafter 4-5 hours on max difficulty after you get gun with silencer everything becomes easy mode. \nToo many items in the world to collect that doesn't makes sense at all. \n\nThe most Sad part is majority of reviews talks how it is mix of Day-z, Zomboid and 7 Days 2 Die. But at the end game doesn't have identity , it tries to be every zombie survival game, but copies a lot of things from State Of Decay. Which is sad because it's just another zombie survival asset flip.... \n\nGame is EA and I don't judge who made it, it's a good start, but eventually its just a asset flip. \n(vehicle mechanics, gun play, survival elements, loot, etc...) are boring/broken/terrible... \n\nBut from the good side.... I would let my kids to play it due it's so cartoonish and baby level game with no gore in it...",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Surroundead is close to having something special, but right now the experience feels empty and unbalanced. I have played around six hours and the difficulty curve collapses as soon as you find a decent ranged weapon. Zombies only react within a very small radius, so simply stepping back a short distance allows you to pick off entire groups without risk. Add a suppressor and you are practically untouchable.\n\nThe world itself feels abandoned in the wrong way. Instead of a chaotic apocalypse, most of the map is calm and uneventful. Zombies only gather in specific points of interest and there are too few to create any real tension. Of the limited enemy types, only the sprinters add excitement and force you to change how you play. The game needs more variety and at least one ranged threat to keep players on edge.\n\nBandits appear in the world and they do shoot, but they are extremely rare. In my entire time playing I only encountered four. On the other hand, zombie AI is the bigger issue. If you climb on top of almost anything, they simply gather at the base and stare. Cars, low roofs, boxes, any elevation at all keeps you perfectly safe. That means base building away from major locations becomes a peaceful creative mode where nothing attacks you or even notices you exist.\n\nThe description promises an apocalyptic catastrophe, but the current experience feels far too safe. It is more like wandering through a huge open landscape with a few isolated pockets of danger that are easily avoided if you want to.\n\nThis is early access, so there is room and time for improvement. With stronger AI, more threatening encounters, and a world that feels alive and dangerous at all times, Surroundead could become a compelling survival title. As it stands today, it needs more development before I can recommend it.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Getting this game on sale provides a decent amount of value. SurrounDead is not a bad game, nor does it feel like bloatware or abandonware. But it does feel dead, and you can tell that the game is made by a solo-developer. There are many small issues that may add up, turning potential players away from this title to other, more polished zombie survival games (and there are *a lot* of those!). \n\nThe two most glaring issues as of right now include the world feeling empty, and combat being dreadfully easy. Zombies are mostly limited to preset spawn points and you can walk from one POI to another without any worry of being in danger. There is little decor save for grass, rocks and trees to keep your senses stimulated as you trudge through the world that looks nice mostly because it's developed with UE5. When you do come across a zombie, the combat is painfully easy. Even ignoring the well-known fact that you can stand on top of a car, surrounded by literally *every single* enemy on the map, killing them all from the safety of your perch—taking a \"realistic\" approach to combat is just as easy. The player can swing a melee weapon faster than enemies can attack; fast enough to repeatedly stagger enemies, preventing them from hitting you in the 2-4 hits it takes to kill them. With the right weapons, like a common baseball bat likely to be found in the first few minutes of gameplay, it is even possible to take on groups of zombies less than 30 minutes into your save. This was my experience, looting the mall POI when suddenly I was swarmed by about 10 zombies. That should have been it— I should have died, but instead spamming left-click without any strategy let me take them all on with about 20% health remaining, and *no* status effects applied *whatsoever*. It feels like different medical items exist solely to have items that are \"harder\" to craft and therefore heal marginally more HP. The settings do offer gameplay customization sliders, but making combat more challenging shouldn't lean on the tired trope of bullet-sponges. As a small aside, the game gets *DARK* at night. You will need to increase the gamma to at least 2 (out of a maximum value of 3) if you value seeing anything but a monitor that looks like it could be off. \n\nPositive aspects include the game's looting system, loot is distributed in a manner that is neither scarce nor overly-abundant, with a decent amount of variability in weapon types, rarity, and cosmetic items. However, weapon rarity needs balancing as (so far) higher-tier weapons only offer small differences to their common counterparts. Health, energy, hunger, thirst and energy meters are a feature that offers the potential for more immersive, life-simulator-y character management, but so far feels shallow. Just as there is a skill point that allows for passive health regen, there should also be status effects or scenarios where health naturally degrades. Items restore an unsatisfying amount of hunger compared to how quickly the meter degrades — but the basics are there. The vehicle system is satisfactory, if a bit simplistic. Like many of the game's core mechanics and aspects, it feels like a State of Decay inspired title that was dunked into a vat of DayZ— only without any community or world-building features. \n\nGiven that the developer is still active (though as of writing this review is currently grinding out hours in Battlefield 6) I have hopes that updates will continue to flow, and eventually a more clear vision will start to emerge from the overly-ambitious roadmap. Given the game has been in Early Access since 2022, and hasn't even breached the First phase of the roadmap, it's clear that this is a passion project that the developer will have to actively fight with, such that it does not eventually become abandonware.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The graphics I had to get over a bit, but quick getting used to. Pleasantly supprised by the game lot of content and really fun to play. \r\n\r\nStill negative review for now because to the total mess with the savegames. For example repaired vehicle loaded up with loot and next login its gone, loot gone and waisted playtime. Overwriting savegame also didnt work and got rown back to the original savegame Showstoppers for me till this is fixed. Dev if you want happy costumers this is one of the first tings which should be ok.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Put an extremely rare sniper on a mount to admire in my base, took the mount down to move elsewhere, extremely rare sniper vanished... Next I found I drop with a fancy generator and extremely rare backpack, spent 15 mins. rearranging my current backpack to fit the generator I desperately needed, got in my car and then everything froze. I couldn't move... lost the generator, lost my current backpack and the 15 mins. it took me to do all that crap. After than I decided to finally use the 7 laptops I'd saved the whole game (very rare items). Got in a fire fight, character got stuck in the terrain, couldn't move, character died... I reload and all the laptop locations disappeared along with all the laptops... Uninstalled the game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unreal Asset store flip. I really don't get why this has the reviews it does. It's just Unturned in 3rd person, but worse.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Pretty boring in the current condition. There's seemingly nothing to do in this zombie survival game aside from slowly dying or quickly dying. It's DayZ minus everything that makes the game entertaining (the multiplayer aspect).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not a great attempt at being a 3D Project Zomboid. I do appreciate that you, unlike PZ, can save the game if you want to, but the combat feels way too wonky, the objects that says \"Blocks Spawns\" don't actually keep zombies from appearing nearby the next day, and the most immersion breaking feature is that all the lootable objects gets reset every day which means you can get so much more loot than what seems fair",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i really dont get it, looks and plays like a really bad unity engine game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This needs to cook for a loooong time. I'm not sure why it is reviewed so well.\n\nIt's basically the unreal engine framework easy survival RPG with some custom assets.\n\nEverything is full-on jank, from weapons not hitting at the reticle, broken animations, empty world, lack of depth, bad UI etc. Compare this title to the trailer for Deadpoly which is essentially the same thing. They even use the same plugins share a lot of the same assets on the same frameworks.\n\nBecause this is a solo developer and they're relying on an unreal engine plugin with poor multiplayer support... I can't see this ever exiting early access unless the developer hires a dev team to assist them.\n\nPass on this for at least a year, unless you have a very high tolerance for bugs and problems.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even though it's Early Access, I still wouldn't recommend it. It doesn't seem to do anything different or better than other games in the genre and does a lot of things worse. Controls are clunky and don't always work as expected and enemies are pretty broken.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Interesting idea, but everything in this game is janky.  \r\n\r\nNeeds a LOT more time in development.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "i just noticed this game has been out for 3 years. hence the not recommended tag.\nit also came out shortly after ( https://store.steampowered.com/app/1621070/DeadPoly/ ) Deadpoly was released.\nand oof the similarities. that being said. both seem to be putting out \"updates\" continuously. Deadpoly being updated monthly.\nyou decide.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "pretty fun until you realise there isnt much point in playing past a sertain point",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please add controller support.  The game experience would be improved greatly with controller support. Mapping multiple keys for specific things that could’ve be worked better with full controller support.  Please add that in one of you phases.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game after some friends told me about it ( like many do lol ) and figured i try it out! i kinda slightly regret buying this now!! After only 17.2 hours ( yes only that long ) i noticed and finally realised how much of a rinse dry and repeat this game honestly is.\ni 100% understand its one person working on this and i give HUGE MASSIVE PROPS and CLAPS for this person. i love how this game looks and everything about it but its lacking sooo much that its hard to look at it and go \"do i really wanna play right now?\" or \"do i honestly feel like doing the same thing over and over and get legit nowhere?\".\nNow hear me out yes there are games out there that are the same thing but least they offer a little more.\nThis game gives me unturned vibes with how fast i found stuff right off my first day playing.\nLooting is pointless cause your legit selling everything back to traders that already have what you have.\ni gotta base already whats in my base 10 tents whats in those 10 tents USELESS STUFF I DONT NEED CAUSE I CANT SELL TO THE TRADERS!!!!!!!!!!!. i got so much stuff like bruh why. CANT DO ANYTHING WITH IT. dust collectors my friend would say. i legit just shoot zombies collect EXP and leave everything there cause legit no point. i got 2 wallets full of cash i cant spend why cause i already have the stuff thats being offered and then some. i should be the traders and set up shop LOL.\nNow i did see somewhere that co-op is coming and honestly i think that would so turn tides on this game and make it actually worth that i think it should have been in first place a co-op/MP game.\nBut meh thats my 2 cents worth. if i had to scale the game on a MEH to HELL YEAH rating for me its more MEH EH MEH ( in english 1 to 10 its like a 4.6 )",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashed 5 times in 30 mins during the tutorial, crashed again during the radiation zone so I couldn't add the rad filter, died & respawned to only then fall through the map. I had high hopes for this game based on reviews :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used the last hour to sucide so i could get clsoer to where i died, it keept spawning me the same palce out in the end of the map, just because the save point didnt work... A little sad a bought this one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs an in depth overhaul on how the inventory management system works. Either limit \"containers\" within \"containers\" or allow for item stacking with no limit on \"container depth/sub containers\". Haven't spent long playing and really enjoy the game. I want to play more, just don't enjoy 50% of my gameplay being inventory management.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a broken game that has a garbage melee attack mechanic and broken fall mechanic. when i slide, i received fall damage. i'm not recommending this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i CAN see this game become somthing fun and good in the future, but as of right now its pretty barebones and lackluster, doesnt really hold any interest for me in its current state. needs to cook quite a bit longer. 2/10 as of 11/9/2025.. maybe in a year or so an update will come out to where it can be re-visited.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At least at this point in Early Access, I'm going to say I'm not really into SurrounDead. I've played Project Zomboid, 7 Days to Die, and plenty of other great survival games like NeoScavenger. For me, the game play is too arcade-like for a post-apocalyptic survival game.\n\nMaybe arcade combat and boss killing loot mechanics are a plus to others, but I wouldn't suggest this game to any of my friends. I had a few hours of fun so I don't regret my purchase, but I found the combat and survival aspects a bit too shallow.\n\nNote: This review focuses on the current state in Early Access. I will change my review in the future if updates warrant it.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}