{
  "positive": [
    {
      "review": "Absolutely worth the wait. 100% completed a few weeks after release.\nOne of,  if not the best relaxing tycoon / resource farming game I've ever played. Theres always something to do.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "What I like about the slime rancher is the zen experience of running around and doing errands and exploring and I find it to be a relatively passive experience. This game has a lot more platforming and exploring going on which in the early game and even in the late game your lack of energy means lots of waiting around for your energy to recharge. \n\nI wish the game did better job at letting you know what writing mattered and didn't matter. The vast majority of dialogue is NPC saying a quip giving you decorations so I ended up skipping most of the dialogue but in the ending the is some plot reveals that I did not resonate with I assume because there was some key dialogue I skipped/skimmed. I found the writing in the first game to be more appreciable.\n\nOverall the crafting system I was not a huge fan of since the lack of inventory feels like there is lots of backracking that really hurt the flow of exploring.  There a lots of blueprints and crafts I never touched even after I 100% the game. I might be interested in the decorations system if there was a way that it impacted gameplay but it just feels like clutter to me. I would say the first game is more concise experience where this game try's some new things that don't fit into the bigger picture.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☐ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☑ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "love it just as much as the first one nice a chill and fun to play it",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Slime Rancher 2 is a lovely sequel that scratches the slime-ranchin itch just as well as the first game!\n\nI played this game at least a year or two ago and put it down since then. I picked it up again recently, and seeing the updates to the map and some systems in game (like weather, I don't remember having it back then) is amazing to see. \n\nThe team puts a lot of passion and love into their game ♥",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I haven't completely finished the video game yet. However, I must recommend this title. Basically, it's the same as Slime Rancher 1 but with many improvements. In fact, it feels superior in terms of map design. The environment is super beautiful in every aspect, along with a soundtrack that fits perfectly. I love how you can read information about each resource and slime. If you don't read it, you might have problems on your ranch later haha. On the other hand, I must say that this video game is excellent just for enjoying after work. It's one of those relaxing games where no special skills are required to complete it. Also, even if Tarr slimes are a challenge for you, you can disable them. Overall, a very good video game; if you're thinking about buying it, don't hesitate to do so.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "SUCH a great game--i recommend fixing the graphics if the game hurts your eyes, but then just playyyyyy it's so much fun and i am loving it",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Absolutely a blast! I tried playing the 1st initially when it came out and thought it was okay but this sequel is so much more! I love the slime types the are super adorable! Exploring is fun. The blueprint system is a bit frustrating but still I give it 4 out of 5",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's a very fun, cute game! It's fun to see what slimes have been added since the first game, and all the combinations you can make!\r\n\r\nIt's very apparent how much love and care they've been putting in to the game!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "hello my little insects eat up with this, this game is absolutely breathtaking and i playing slime rancher on the steam deck while eating spagetti and meatballs in the toilet makes it come out like slime goo uh erm where was i, oh yes they should add the super rare slime that gives you a big kiss and you cant get it off for a few seconds and it pops out plorts for every second and then gets off and leaves lip marks on the scree- sorry that wasnt me but basically this game is super duper good and you should buy it straight away and please make this post popular and make my dream come true",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's an incredible step-up from the regular Slime Rancher without changing any of the original feel. It has absolutely gorgeous visuals and tons of new slimes.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's cute. I haven't played a ton on it so I'll add more later, but I love it just like the 1st game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Loved the first one, love the second one too!\nLot of Slimes, lot of exploration (some metroidvania style with playces to come back to later and unlock them with resources), some cool QoL Updates on the farm.\nOnly thing that still is runnig out to quick is room on your farm.\nEven with all the additional spaces you can aquire, its not enough to house all the slimes and their favorite foods.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'd say it's easier than the first game, but the lore is important. The style of the game is very pretty and the graphics are better. \r\n\r\nOne thing that I'd say wasn't the best was that the puzzles were quite complicated and after some time I had to search up the solution but that was a minimal amount of times.\r\n\r\n[h1] Overall a 10/10 [/h1]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "cant stop sliming i love sliming. all day, every day , i love sliming. my husband is going to leave me because i cant stop sliming. i love sliming!!!! :steamhappy:",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The slime rancher series will always hold a special place in my heart. I bought this when early access first dropped, but waited to really dive in until bugs were a bit more fixed. Now that the finished product is out, I've been spending a lot of time exploring the new island and seeing all the brilliant new slime designs! I'll never get sick of this game, and look forward to completing all the achievevments",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tippy top game for collecting lil guys! I accidentally became a chicken farmer though. 200 chickens on my farm at any given time...plenty of food for the slimes though :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "builds off of the original game and improves.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun as a game to play and relax with, however is basically the same as the original one with way less story, all the same slimes with a few added on top, recommending it for those who just enjoy the franchise and somewhat improved graphics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely love this game, and while I do have some small frustrations, I want to acknowledge what has made me love and play this game for [at the time of writing this] ~100 hours;\nWhat's great though is the ability to place gadgets and decor anywhere you want-no pre-determined/designated spots, which gives you a lot of creative freedom at your ranch and, for me, allows the building of cute little nooks in various places around the map. \nThe map is huge and a lot less linear which i do enjoy, the colors and music are amazing, the \"biomes\"/areas are lovely and new, the slimes are as adorable as ever, and while the UI was definitely different from the first game I quickly came to like it.\n\nMy main frustrations have stemmed solely from the grind of materials and the final section of the game. To avoid spoilers I won't talk about the final section besides saying that it is very grindy. \nMaterials are no longer gained from pumps and gadgets, instead they are found throughout the world, which is fine except they can take quite a bit to renew, and while there are plenty of locations they can be in, not all will be available at once. This is fine most of the time, however it can be frustrating spending hours looking for specific ones and struggling to find any.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With the exception of a few world-related features that I think need improving, this game is a total blast, especially if you're looking for something relaxing but not boring or too repetitive\n\nI agree with another reviewer here who said that not adding new, more interesting (gameplay-wise) slimes - and instead sticking with 80% of the ones from SR1 - wasn't the best choice. On one hand, it doesn't add that much new content for those of us who've played the first game, but on the other hand it feels like there's a stronger connection to the prequel, and it makes it feel familiar (instead of throwing you in a completely new environment -- which wouldn't be a problem, really, if they still keep the same mechanics). That and the conservatory being hell to walk through and not having anything interesting past the decorations to make it your own\n\nBut yeah, other than that, it's just a fun game. One thing I see with some \"relaxing\"/\"farming\" games is that they lack action, which most players are still looking for (because after all, it's not fun to just sit around and do the same monotonous thing over and over again without a goal). And SR2 managed to add some really interesting gameplay parts (for lack of a better term), that don't make you feel like you're rushing to beat The Boss(!!!) or that there's a ticking time bomb that is going to end the whole universe once it goes off. The grind for materials is real, though\n\nI also wanna add that I really, really like the aesthetic of this game. It feels... sparkly? -- without it being too much. It's fantasy and yet oddly familiar. And compared to the environment of SR1 (referring mostly to the base), SR2 feels so much more lively with all the greenery. And the conservatory itself feels very cozy, and being practically huge, it doesn't make you feel like you're \"trapped\" inside\n\nOverall, nice game. You can see clearly just how much I've enjoyed it myself",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Such a good game, I've played the first one and I instanly knew I wanted more. there is always stuff to do and the many ways to breed the slimes remained a fun part of the game. I love the new ways you can customise your base adds so much more to the game now. I still haven't finished it but I'm looking forward to it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun sequel, very pretty colours, good story, fun gameplay. However, this game is so unoptimized thats its not even funny, and I hope that they fix it sometime down the line, because although the art direction is really good, the graphic themselves dont warrant my 4060 struggling",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is visually beautiful, with colors and scenery that captivate instantly. Its atmosphere creates a sense of calm and tranquility, making it a perfect experience to relax.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very refreshing experience that thankfully has the same vibe as the original game! \r\nI enjoyed the new addition of slime's and the new behaviors associated with each one making them feel unique. The game play was smooth and so was the progression, very dependent on vac upgrades but i understand why that's the case. The only thing that i dint really pay attention to was the story or lore behind Gigi funnily enough, it just didn't really make itself too appealing or interesting to follow.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the story. IT's so much better than slime rancher 2. Story has me in a choke hold, i want MORE. I don't realise how fast the day goes when I play this, it's too addicting!\n\nI wish it was easier to automate the bees and stuff though! Too many corrals, too many slimes, not enough food or space to get the plots!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the slimes. Just everything about this game sparks joy, the music, the colors, the gameplay. Even though I only have 15 hours on the game currently, I am still very much in love with this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played this game when early access first released back in 2022 (on xbox). Honestly, the difference from playing early access on day 1 to release doesn't feel like much. For major areas, they added the gray labyrinth and powderfall bluffs (two areas in three years). If you asked me what they were doing for three years, I wouldn't be able to give you a proper answer. Development over those few years was rather slow, and I feel bad for anyone who had to wait ages for any updates. I'm aware that they're a smaller studio, but months between updates? There's smaller studios that put out less updates more frequently.\r\n\r\nGathering slimes is slightly different as opposed to the first game (for some species). In the first game, you just run around and grab up the slimes whenever you want. But in this game, specific slimes will only happen at certain times / weather events. Take the tangle slime for example. For slime rancher 1, you'd just run to the glass desert and grab a few. Now? You need to wait for a pollen event. Not just any pollen event, a level three pollen event. There's 3 possible levels, and they happen at random times (level 3 being rather rare). It took me ~80 days to get my first level 3 pollen event without sleeping a bunch to skip days. Super unlucky, but slimes shouldn't be based on an rng system like that. Tangle and dervish are currently the only slimes that spawn in rare weather events. \r\n\r\nSome resources are extremely rare and hard to find, the hardest in my experience being sun sap. It only spawns on specific trees in two areas in the game. Unfortunately, this resource is used in quite a few upgrades and a few decorations, so have fun hunting for it.\r\n\r\nThough I have my complaints, the game is still fun. It's definitely a lot grindier compared to the first game. There's no more drills/pumps where you have to wait for your resources. Instead, you go out and find them yourself - or make a drone do it for you passively. If you dislike grindy games, this is not the game for you. In the gray labyrinth, you need almost 800 plorts to open every plort door, and the slimes you get them from are similar to quicksilver slimes from the first game. The slimes are abundant, but the plorts are still annoying to gather. I don't expect this game to get many more updates (considering how long it takes for them to do smaller updates). \r\n\r\nAnother thing, the storyline of this game is extremely forgettable. You're dropped off on a new island by a mysterious boat, there's a new character... and it really just wasn't memorable. Personally, slime rancher was never about the plot for me, so this didn't exactly bother me. Wouldn't suggest this game for the storyline at all, just skip the dialog.\r\n\r\nBut, at its current state, it's a fine game. I'd suggest grabbing it on sale. For me, I'd say it's a solid 8/10 game due to the graphics, gameplay, and music. It's fine if you ignore the time it took to update the game in early access (don't expect frequent updates either).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Prefer the original, but still a great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game a lot. The cutest slime combinations and such pretty sceneries <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just like the first game, its a very chill and fun game to play when you just want to unwind and relax. Watching the silly little slimes bounce around and just do their thing, of course you do want to take care of them. Especially the largos unless you want your ranch to be filled with a bunch of hangry slimes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Slime rancher, a relaxing wonderfull game but improved! The slimes? Even cuter and more adorable! A lot more to choose from. Chickens were not producing fast enough In slime rancher 1? Well here they repopulate fast! No need to worry, This is a amazingly designed game and brought back even better than before",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game, loved it ever since the first early access version in 2022 (got it the day after it came out for my birthday). It improves on the core mechanics, visuals, story, gameplay of the first game perfectly. Doesn't get repetitive and boring(which is a problem for a lot of farming sim games I would say). The story while not being that big of a focus is a great touch too with the ending being actually really touching. I hope you play this game even if you didn't play the original. This is a masterpiece.\r\n (ALSO BATTY SLIME I LOVE BATTY SLIME OMG HIIIII BATTY SLIME HIIIIIII AAWWWWWWWWWW SO CUTE BATTU SLIME YES BATTY!!!!! SLIME!!!!!)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have I done everything I can do in this game yet? No, not at all. But still, I think my opinion after playing lots of Slime Rancher 1 and watching my girlfriend play both games for countless hours, I can confidently say that these games are really relaxing, and actually tons of fun. Very nice to just mess around at your own pace, taking care of what might be my favourite version of slimes in any piece of fiction, by far.\r\nHonestly, the design of the slimes alone is enough reason to give this game a positive review. Now stop reading this and go play!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After playing to the point that the game is finished/developed. It is proving to be very fun and a good successor to Slime Rancher 1. Looking forward to what it will become.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really relaxing game ngl good graphics and its peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you liked the first game, you will probably like this game. Plus, the drones have better battery.\r\nHOWEVER, I do feel like plots produce less fruit and veggies meaning I could never fill my auto feeder when it is set to normal speed :(",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "First game was good, this one is even better.\r\nIt's good to be back ranching slimes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In love with the Bat slimes, super comfy game. Option of Tar or no Tar if you don't wanna worry about those feisty guys :) Feels just like the first but smoother, it's a lovely 2 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It’s wholesome chaos. You tell yourself you’ll play for ten minutes. Suddenly it’s three hours later and you’re rearranging corrals because your phosphor slimes keep committing “accidental flight.” The story exists, technically, but let’s be honest, you’re here to hoard pink blobs and feel joy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Slime rancher 1 is better, and this gets somewhat repetitive too quickly. \r\n\r\nBut its not a bad game, good not great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played the first Slime Rancher and I loved it, I saw that the second game was in early access and thought “YES! More slime rancher!!!”. \nThis game is an absolute blast and playing out the rest of the story once it was fully released was such a delight, with a surprising ending (no spoilers). \nEven after finishing the story I find myself coming back every now and again to look after my ranch and complete the achievements that are now available in the game - I have one left! The gold slime evades me. But I will continue to search. \n\nAddictive gameplay, smooth mechanics, beautiful art style and story is lovely. If you like farming sims, cosy vibes or collection games this is one for you!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I gave a pretty glowing review of the original Slime Rancher and since Slime Rancher 2 is just Slime Rancher but better there are no prizes for guessing how this review is going to go. \n\nIts great. Plain and simple. Adorably, Cozily, Visually spectacular. \n\nNow why do I like it you might ask? Well there's 5 things in particular I liked. All of these are just straight copied from the first game because hey - it was good then and its still good now. The added stuff? Its all visual, or extra content, or just little automation benefits - all of which is great to have but great is still great even if you add extra. \n\n1) Its fun to make a farm and get money. Its been fun for ages actually, oddly enough. Ever since Harvest Moon, and then to Rune factory, I've liked the whole farming/economy simulator type games. Were they a bit repetitive? Yup. Did they manage to let me unwind and work at regular challenges and tasks? Yes, and as odd as it sounds its quite fun.\n\n2) The game is adorable. They have a cat slime. That you can mutate with several other genus (?) of slimes. That also somehow makes them larger. Why is that? Because its adorable, that's why. And the cat slime isn't even the cutest one.\n\n3) You get a vacuum cleaner gun. Color me biased, its fun to use and I flipping loved Luigi's Mansion.\n\n4) Upgrades feel meaningful. Early on, your pretty strapped for cash. Get some money? Neato, time to upgrade that pen with a Solar shield so the little glows don't disintegrate at daybreak (like vampires). Got some flyers? They can fly, ya'll need a higher wall. Got a solar shielded, giant walled corral? They are hungry, grow them some food. And so on. Money is not impossible to come by (far from it), and makes life a lot easier for you in noticeable bounds with every penny you pour back into your farm. Higher walls offer more containment, fertile soil grows plants faster, silo upgrades give you more space. Also almost every upgrade has a aesthetic associated with it. That's quality right there.\n\n5) Its a game that just wants to be a game. Honestly its a real problem nowadays with economic styled games - they force you to suffer until you can get better off. And I don't mind that, in fact I enjoy that in Rune Factory and Harvest Moon. Working to get your feet off the ground and be successful with less work isn't just fun, its actually basically the most human desire I can think of in gaming (besides sex). And this game is hard at the beginning to get off the ground. But getting off the ground is fun, and its not ever a grind to do it. Jetpack? Buy it in 1 day, easily. Ranch upgrades? Each one might be expensive, but the essentials are incredibly easy to get. The game lets you have fun with it, and it feels like a real game the entire time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Slime Rancher 2 is slimier, cuter and even more addictive than the original game. It offers a much wider range of activities to engage the player: farming, research and even automation. Although all this could quickly become boring due to the huge number of monotonous gameplay cycles and constant grinding. However, if you enjoyed the original Slime Rancher game and you like chill farm games I suggest you try this one too!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As someone that played both the first game on both pc and Playstation, I feel like I qualify for this review haha,\n\nSlime Rancher 2 is a cozy game with innovative new slimes, and new creative spaces.\nThe story was interesting to follow and it brought a new way to look at an already loved franchise.\nSlime Rancher (both the first and this one) is one of the best games out there, according to me\nIt can be the coziest gaming sesh you have or a mildly infuriating one because you didnt have any food to throw at a Gold Slime. . . \nNo matter, I think Slime Rancher 2 was worth the wait, I played it since release and I'm curious to see what they'll make of this franchise even further!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Slime Rancher 2 is one of those rare games that instantly melts away stress the moment you enter its world. With the soft pastel colors of Rainbow Island, the game exudes a comforting atmosphere. It's the type of experience where you can pour yourself a warm drink, settle into your chair, and simply relax.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played through the first game and absolutely loved it. This one is just as magical, amusing, and fun! Thanks, Monomi Park <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In the midst of my dull daily life, I found myself longing to rediscover the joy of childhood. Then I stumbled upon an adorable little rabbit that led me into a beautiful fairyland… There, I found surprises I had never felt before, along with a breathtaking awe for its artistry, whose unparalleled fantasy style illuminated the world I’ve always dreamed of.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "it got really annoying when I had to grind for a lot of stuff, and when you get the drones you've already beaten the game pretty much so they don't help but its still really cute and pretty much the first game with upgrades",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Slime Rancher 2 is an amazing, relaxing, and fun game. The world is colorful, the slimes are adorable, and exploring the new areas never gets old. The graphics look great, and the gameplay feels smooth and satisfying. If you loved the first game or just want something chill to play, this is a perfect choice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun casual game with a great art style. I think the game overall looks very pleasant and it matches the lighthearted feel of the game very well. The story is good and I think the overall core gameplay loop is very fun yet casual. Great choice if you are looking for a relaxing and visually appealing game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The original Slime Rancher is one of my favorite games of all time. Slime Rancher 2 is a bit disappointing in the endgame and I wish there was a neutral rating option. \n\nSR2 does a lot of things right, like new slimes, gadgets, secrets, and puzzles to solve. All of that goodness starts to become tedious when you have to scour multiple maps ad nauseum for crafting materials because equipment like 2-way teleporters and drone stations cost a crazy amount of rare resources and Monomi Park decided to do away with things like drills from the first game. I get wanting to pad the playtime to justify the price, but it's way past the point of being ridiculous. \n\nOn the plus side, it's more Slime Rancher and it runs great on Steam Deck. But the decision by Monomi Park to pad the play time with tedium instead of giving players even more ways to automate ranching feels disrespectful to players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice cosy game but dosent fell as completed as the last one (for now)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I may not have finished this game but the story, mechanics, graphics and art style are PEAK",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game over all and not bad compared to the first one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved the first game, and i was honestly excited to play this one. Its a relaxing experience compared to what i usually play. So far, its as chill as before and I'm glad to finally have the full release. Can't wait to see what it all holds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty fun game- not as good as slime rancher 1 but still pretty decent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "beautiful and relaxing. took away my breath while keeping the nostalgia of the first game :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slime Rancher was my favorite game I ever played. Now it has been dethroned by its sequel. \nI adored the original, how fluid it feels, and as the only FPS game I continue to be good at, it accrued many offline hours on my janky laptop in my parents' basement. As an \"adult\" with an upgraded setup and a better living situation, Slime Rancher 2 continued to bring me those hours of joy, tinged with nostalgia and squishy slimes. \nThe world of Slime Rancher continues to be original and colorful while still feeling alien and alive, with a catchy soundtrack that breathes life into your surroundings. You will find yourself humming the Rainbow Fields theme by the way. Actually, it's the only video game soundtrack I listen to aside from ye old classic Undertale. The wide variety of plant life being available to decorate your areas and home in the sequel is a welcome joy, along with the ancient ruins that pepper the world and speak whispers to its history. The storyline is very cute and comes to a satisfying conclusion, and is motivational without interrupting gameplay in a significant way. \nI just... I really love this game, guys.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't play this game much anymore, but I used to during early access, and I definitely prefer this over the first installment. The graphics are very great and this is my go-to game for relaxing if I'm really having a rough couple of weeks. I would even dare to say it relaxes me nearly as much as Stardew Valley. Recommend it, especially after the 1.0 release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to relax, no rushing and great gameplay. Also cute slimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played the first game and cried over the puddle slimes. \nplayed this game and also cried over the puddle slimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly loved this game still didn't 100% it but its super good for a chill day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i loved the 1st game and when i came to the second one i fell in love i loved all the small details the new map and slimes still sometimes gotta go back but if you wanna sit back in an amazing world this is the perfect game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved the first game, this one doesn't add much in the way of gameplay but adds a lot of neat new gadgets that can make it more fun to explore and set fun things to bounce around slimes. The weather system has some fun effects on  the world and the silimes that can appear.  Music as always is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super cute and fun game. Pretty with lots of cute slimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and the one before it. The Slime Rancher games both are a nice cozy relaxed game with a wonderful views and enjoyable little slimes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, it may need some good patience but thats the point of it. Sit back, relax, and make a slime ranch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slime Rancher 2 is a very relaxing and cozy game. I recommend that everyone should try out this game. Also AMAZING DEV TEAMM :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good sequel to the first game. I wish the vacpack didn't take up half your screen though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excelente jogo, tem uma história interessante. Não é bem uma continuação do primeiro, mas é bem legal e tem novos slimes *-*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In many ways, it's both just more of the same game, but also an upgrade. \r\n\r\nIt's the same in the sense that the general casual core loop from the first game is still present, and that's good considering that's what a lot of people found endearing about the first game.\r\n\r\nIt's an upgrade in the sense that they took the ideas they had from the first game and iterated over it, allowing certain mechanics to be integrated more fluidly with the rest of the game. One of my main issues with the first game was slime science. Compared to every core mechanic, it was introduced to the player relatively late and it always felt kind of tedious. This was such a shame considering that some of the best quality of life improvements were stuck behind the system, such as warp portals or the bee drone automations. In here, the mechanic of obtaining materials is much more integral, not just for accessing said quality of life upgrades, but as well as just base upgrades be tied to it. The way materials are implemented in the game provides another reason for exploration and helps distinguish each area in the game; You're not just exploring for the sake of progress or finding a new slime, you're also looking for the best spots to get certain materials. \r\n\r\nThe game also gives the player more reason to reexplore areas. What felt lacking about the first game is that each area always felt like a one and done: you go in, explore, get the new slimes, get the new food for each slime, maybe come back for secrets, and rinse and repeat for each area. Here, the weather effects, the caves and passageways that loop back round and create shortcuts, as well as some materials being more abundant in some areas give more variety for the gameplay.\r\n\r\nOne thing that did feel kind of lacking were the story. At first, I felt intrigued at the mystery and how the characters were connected to the story. However, after a certain part of the game, they all get swept under the rug and relegated as random decoration fabricators all in favor to have all of the story and intrigue be pumped into one character who exposition dumps. I know it's not mandatory to read them, but I felt there was missed potential in having more environmental story telling or maybe even cutscenes. Show, don't tell is all I'm saying. Also, snooping around areas and finding the one treasure you didn't find would have felt more rewarding half of the time if they didn't give me a bush or a tree or something. It didn't help that some of the treasure pods DID have useful stuff in them such as materials for upgrades, since that just meant you HAD to look for the one treasure pod you didn't find only to get a tree.\r\n\r\nOverall, I enjoyed my time with the game and if you enjoyed the first game you'll probably enjoy this too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the style and overall feel of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cute,  easy to learn, and fun to explore. It's a great little game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's that nice game you would play after a long day at work; with its nice soundtrack, it melts the stress right out of your muscles, and if that doesn't, the cute jiggly slimes will! I'm yet to finish the story, but that's mostly because I don't want it to be over, but that's all from me. STAY BRAVE, BE BOLD, STAY WIGGLY!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great sequel to slime rancher 1, Amazing and highly recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really cute farming/exploration game and builds off of the first one really well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mmm... cute slimes. Come here, you buggers! Mommy wants to hug you.\r\n\r\nI remember seeing how Slime Rancher 2 is inferior to Slime Rancher because of how much the original has more content. That is no longer the case. Now 2 has more content, and I'm pleasantly surprised at the new content. They're well worth the purchase even if you already have the original (like me.)\r\n\r\nI just want my slimes, okay? That's more than enough reason to buy this game. More smiles = more good. Don't like it? You must hate cute slimes. DO NOT QUESTION ME.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game, best youtube combo oat possibly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely a great little sequel to the original game. The new slime species are super cute and well designed, and the world is just stunning overall. Definitely worth a buy if you enjoyed the first game and/or you're looking for a chill game to sit back and relax with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice alternative to most competitive games i play and its similar to slime rancher one just with way better visuals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect game to relax with after a rough day. It’s full of lovely and colourful details! ( • ᴗ • )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it, definitely a continuation of the first one. Could have been more chill on the rainbow/pride stuff, but is what it is. I enjoy it and have a good time just vegging out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, was great to play as a long-time fan of slime rancher :> definitely would recommend if you're considering buying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game! It has all the familiarities of the first game, but a lot of new and exciting things to find and places to explore too. The music is so cute and it's such an amazing cozy game. You don't need to have played the first one to play this! <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great successor to the original that is both beautiful and adorable! With improved visuals and mechanics, this game is everything Slime Rancher was and more. Anyone who enjoyed the first game will surely love this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing sequel to the Original but the very end of the game can get a little to grindy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it has very good graphics and many places to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really fun game about slimes and its great to finally have the sequel to on of my favorite games. \ngameplay is fire",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "real good game to relax and play with music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jigglier and even more colorful than the last.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A worthy successor to a game that I have loved for almost a decade now. It has a lot more mechanics that I love, so much more to explore, lovely visuals with a great soundtrack to go with it, the works! \r\n\r\nMy only complaint is that I suck at the game and keep getting lost, lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good change from the first game while sticking to the core of slime ranching.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slime Rancher 2 is an absolute gem, offering a gameplay experience that is both incredibly fun and deeply relaxing. From the moment you step onto the vibrant shores of Rainbow Island, you're greeted with a world bursting with color and charm. The art style is simply breathtaking, with lush environments, whimsical slime designs, and a visual flair that makes every moment a feast for the eyes. The core loop of exploring, collecting adorable slimes, and managing your ranch is incredibly satisfying and never feels like a chore. It's the perfect escape, allowing you to unwind and enjoy a peaceful, engaging adventure at your own pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ngl, the EA launch for me was a little underwhelming but man, 1.0 did not disappoint. My only hope is for more content in the future, awesome sequel to an awesome game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for steam awards\nI liked the art style of the first game better but its still cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun really relaxing game that you can play for houers and just get lost in the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game, it doesn't match the gameplay of the first Slime rancher, but it is still a very enjoyable experience with a simpler story. the visual were certainly improved and the slimes look as cute as ever. would recommend if you liked the first one :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing gameplay. Very pretty graphics and amazing story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After having over 300 hours in slime rancher 1 i can confidently say im impressed with slime rancher 2, i bought this game when it wasnt even fully released and completely forgot about that fact until they said it was fully released finally. The style remained the same and kept its charm while also sticking out and showing its not just the same as the last game.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Nearly exactly the same as last game, different slimes (sometimes), less interesting story, and no extractors. I was setting out to gather my next slime pair, favoured veggie to grow knowing I'd be back quickly since I only had four inventory slots only to realise.... I've been here before. many many times.\nThe lack of ambition, innovation or change in this game is bloody astounding to the point where many things are just \"changed\" a bit rather than improved. I'm actually impressed they basically \"remade\" the initial game almost beat for beat and put it out there as a sequel. \n\nBut I'm ranting so here's a list of things better or worse than the last one:\nSlimes: half of them return and the are a few new ones. Surprisingly pretty much none of them are interesting. You get a bunny skinned slime, a bat slime, flying butterfly slime, angler fish slimes but compared to the dervish or tangle slimes these feel just like basic skins.\nResource gathering: You have to gather resources from points that respawn rather than put down extractors. This is a huge downgrade and you'll find yourself marking resource points to go on gathering runs in order to build what you need.\nUpgrades: being able to buy progressively more expensive stuff in SR1 was dope and gave you a sense of progression as well as somehwere to throw your coins. In sr2 there's no equivilent. You buy individual decorations and thats it. Your ranch feels \"Finished\" from the get go.\nExpansion: Exactly...EXACTLY the same as previous. North, West, East, each upgrade gives you five more plots, walking between them is annoying and pointless but probably there to limit slimes in one area and lag. Just wildly unimaginative. \nPlots themselves - exactly the same as previous\nDrones - Unlocked way to late in the game to matter. Expect to do a lot of micromanagement, even more so than the last game since you have resource collection now. You also have to find 18 drone parts hidden around which admittedly is kind of cool but it also limits you to 18 drones if you grind, and yeah.... the micro management is a feature not a bug. \nInventory - My F'ing god 4 slots, with potential to upgrade to 6 much later on. WHY? Expect a hell of a lot of running back and forth between your base to drop off slimes, resources, and food. But I guess that's the point, there's so little to do they need to pad the game out by adding much more running back and forth.\nLevels - Umm.. they're much more colourful? Lots of bright pastels enough to make me vomit from my eyes after awhile. Nothing so much as interesting as the ruins with the quantum slimes or the glass desert or even the wilds. \nGordo's - Still annoying and you'll be running back and forth with your limited inventory space to get them food\n\nAnd so on. After awhile I realised the loop just wasn't fun anymore. \n\nConclusion - Monomi Park really hit a fantastic loop but then decided to milk it to death. While the first game ended at just the right point, playing the second just feels like it you kept on playing right after the end of the first one. Reflecting on the experience I can't even think of one thing it does to improve on or introduce as an exciting change to the formula. How about new pen types? no. Slimes with interesting mechanics? no. Increased inventory space so you're not running back and forth collecting two-three things at a time or mule-ling food to Gordos? no. \n\nPlay the game if you really want to scratch that itch, but otherwise a really pointless and dissapointing sequel. \n\n\nEdit - Just wanted to add one thing, the music is genuinely amazing.",
      "voted_up": false,
      "votes_helpful": 199
    },
    {
      "review": "Welcome to Slime Rancher! Would you like to ranch some slimes? I bet, especially if you enjoyed the first game! Don't you worry, we have (most) of your favorites here looking better than ever, and a bunch of fun new wiggly friends to- what's that you say? Where are the Mosaic slimes? ....uh. Well. About that- so, look- now don't be mad- why did we bring back Tangle and Dervish slimes and lock them behind random weather events, but not Mosaic slimes? Uh, well... ssssomething something plort economy...?\n\nBut nevermind all that, look at these beautiful maps with interesting and diverse biomes we made! They're huge! Absolutely enormous, with gorgeous vistas and tons of places to parkour to and- ...what's that you say? Getting around these massive maps is really inconvenient considering your limited storage space, the fact that you STILL can't fill up multiple tanks with the same item for no legitimate reason, and the lack of teleporters? Oh don't you worry about that, we've addressed one (1) of those issues by giving you a teleporter for free very early in the game! It's one-way! :D ...what's that you say? This doesn't address anything and you badly need to be able to craft two-way teleporters? ......sssssso, how mad would you be if I told you they were all locked behind end-game crafting resources and you could only get the recipes in randomized phone calls from one of your friends...?\n\nBut nevermind all THAT, check out the dozens upon dozens of new decorations we made! You can place them anywhere! Just like the first game, there's tons of random trees and grasses and rock sculptures and whatever other clutter you like to spend all your plorts and money on, and now there's EVEN MORE! We made lawn chairs! You can build a merry-go-round! Aren't these golden statues cute!? You can- ...w...what's that you say? Where are the USEFUL craftables, like the resource-gathering pumps and drills, and the drones needed in order to not spend every single waking moment managing your ranch the minute you start buying the expansions...?\n\n...w...well...now, don't be mad-\n\nAlright look here you little s***, we needed to put SOMETHING in here to pad the runtime, so resources now have to be gathered by hand. From across the map. With no overworld map markers. And drones are now only available after you clear the entire rest of the game and slog through Puragtor- I mean, the Hypercu- I mean, a bad acid tr- I mean, the never-ending nightmare that is the Grey Labyrinth, Y'KNOW WHAT, I SAID IT, FINE! THERE!!! YOU LITTLE MONSTERS HARASSED US ALL THROUGH EARLY ACCESS TO PUT THE DAMN DRONES IN THE GAME BECAUSE IT WAS UNPLAYABLE WITHOUT THEM, FINE, *FINE*, HAVE YOUR DAMN DRONES- AFTER YOU DO EVERYTHING ELSE! HA! HAAHAHAHA!!!!\n\nAhem.\n\nHey so, before you bludgeon me with that Vac-Tank: people definitely still like time-travel plotlines in Year-of-Our-Lord 2025, right?",
      "voted_up": false,
      "votes_helpful": 268
    },
    {
      "review": "For right now I don't like the game. \n\nIn every aspect visually and mechanically the game is an improvement over the first slime rancher. I know list format reviews can look exhausting but this might read better.\n\nThe Good:\n- Visuals, across the board every aspect of the game looks better and added to the experience.\n\n- Resources, you now go out and gather them instead of using drills. Being able to use drones later.\n\n- Slimes, some aren't in the game like rad and mosaic's but several new ones are added, so more slimes technically.\n\n- Decorations, you can now place anywhere if it has the space and isn't too close to something. I really wish they allowed clipping options for better building but since gadget stacking was patched you're free to build with limitations.\n\nThe Bad:\n- Story, specifically the writing in most if not all character bubbles. The drones weren't as bad but I was turned off fairly fast because of the new communications station. Millennial writing to it's peak that I genuinely rolled my eyes. I stopped reading slimepedia data a couple in because of the writing being so uwu quirky. I also couldn't care less about this new character, she's super boring and has nothing going on. No character development. I at least felt some emotion reading things in the first game and liked the characters. \n\n- Map Design, to me it feels so spaced out and confusing. It takes so long to get progress going that you can barely spend any time at the ranch. I do enjoy the later end game areas more but a major portion of my playthrough was a slog. At first sight being cool, then blankly looking at the same area over and over again as I need more honey, ash ect..\n\n- Money, No point later in the game. There's no base upgrades. I genuinely feel you could spend more in the first game outside of I guess decorations. Right now with about 95% of the game done I have 2 million gold and almost a full amount of plorts in the refinery. I buy most decorations when available too, having an average of 20-30 each besides the obvious expensive ones. The first slime rancher I'd get done with a playthrough having around 150k gold. I have 1 slime left to unlock but I doubt theirs more money to be spent as the new shop unlocked uses a different currency.\n\n\ntldr; It's an improved game over the first but I don't think it's better. The first one was really chill with mini game side options and late game grinding for silly things. Now the game is much more of a grind, the gameplay is more involved but the end game mega grind doesn't spike as high because the whole game was a boring grind. I've been able to play the first game several times, I might play this one again in a couple years after i beat it but I doubt it. I had fun, but I had more fun with the first slime rancher.\n\nEdit: Looks like my brother gifted me this game as I gifted it to him so It won't count towards the page % or potentially get seen by somebody who needs to see it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Very tedious and very grindy. Taking care of your slimes and making money does not feel rewarding. Playing SR2 past the initial feeling of wonder and discovery feels more like doing work rather than playing a fun game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Proof that bigger isn't always better.\n\nEverything I liked from SR1 is here, but overdone to the point where there's more bloat than game. SR1 had a very simple and effective gameplay loop: find slimes, ranch slimes, earn money, buy better tools and more space to ranch slimes more effectively, repeat. The story was very simple: a rancher has come to the ranch to ranch slimes. Simple but effective, literally all you need.\n\nThe maps in SR2 are bigger and extremely beautiful, but you'll get sick of them very quickly, because a lot of this game is sprinting back and forth, and after a while it becomes clear that these pretty maps are just there to add distance to your many, many sprints. You can't just use your earnings to buy upgrades for your tools anymore, you need special items to create them. These items are hidden on these huge, multilayered maps, with zero hints as to where they are. Along with cosmetics.\n\nI think about 75% of all hidden treasures are cosmetics. If you care about those, cool, you'll have a better time than I did. I do not care about cosmetics, and having tool upgrades mixed in among them had me reaching for a guide almost immediately. Looking for an upgrade part and finding nothing but flower pots and rocks is very discouraging. This becomes especially frustrating in the endgame, where you need a rare resource to even open a treasure that may have the upgrade part you desperately need, or a blueprint for a flower pot. No way to tell until you've grinded out those resources.\n\nThere's a LOT of grind throughout the game. Everything that's worth building requires a lot of materials, and those materials can only be acquired by running around those huge maps and hoping you spot a handful of them in a very visually busy environment. Eventually you'll get access to gathering drones, but sure enough, those also require a ton of resources and hidden parts to build.\n\nThe story is no longer about a rancher who wants to make money on a ranch. It now includes time travel, chosen ones, galactic disturbances, a quest to save the world in the future I think... It's very overdone and nowhere near as touching as the extremely simple story of SR1. There's a comm station where you get calls from your friends. They call every five minutes. They give you more cosmetics.\n\nThe only thing I haven't mentioned yet is the ranching, but don't worry. You won't do much of it.\n\nSR2 is SR1 but every aspect of it is bloated to bursting. If, like me, you just wanted more of the same, you'll get it. You just have to take on all these frustrations along with it. I did have fun with it in places, I did finish it, and I wish I could give it something better than a thumbs down. But this is SR1 with all the effective elements replaced with blueprints for doilies.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It really upsets me because I think this is such a cool idea with so much potential.\n\nIn reality it ends up being very shallow. I love the idea of breeding and growing my Slime Ranch, but those mechanics are paper thin and instead the game is more about exploring this big map full of random stuff. Rather than a creature collecting ranching manager, it's just awkward fetch quests and exploration.\n\nI would so love for a game like this but with some deeper mechanics around slime ranching. The most fun I had was realizing that some slimes preferred being in the dark, and then putting them in a cave, but that's about as deep as your decision making will get.\n\nI think these devs should focus on their talent and passion for exploration games and lean into that. This has barely anything to do with ranching slimes.\n\nTo clarify, the world they built and the exploration is really good. These are talented devs. It's just I think this game fails at being a 'Rancher' game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TL/DR: Game looks better and has some good QOL changes but is super grindy and Dervish Slimes are myth created by Illuminati.\r\n\r\nGod, I would never suspected that Slime Rancher 2 will frustrate me so much, to the point of uninstalling the game. If you want something cozy and wholesome like the first game of this series you'll gonna be dissapointed. It's not like this game is utter garbage - there are plenty of good changes and new stuff, but it can't fix all the new problems that Slime Rancher 2 provides.\r\n\r\nFor a plus side - the game looks beautiful, has dynamic weather, has more advanced physics (e.g.: many objects react to weather change) and the music is as good as in previous title, even if for me has kinda somber tone. New slimes in most cases looks awesome and some of them have funny new gimmicks like Ringtail Slime that transforms into stone statue under sunlight. New biomes also looks cool and very distinct from one another. Some QOL features (upgrades) are absolutely great like additional slots or the fact that you can carry more of the same stuff. I like the motive of Rainbow Island being this weird color-changing isle (mostly 'cos NPC's refers to that phenomen like if it was some lovecraftian shit).\r\n\r\nSo what's the problem? Well... There are many of them. First of all. Slime Rancher 2 is for some reason super grindy if you want to upgrade all of your stuff, unlock new stash and new paths in later phase of the game. The amount of some resources and plorts neccesary to do that is astronomical. Would be cool if you can just farm them... But you can't. [spoiler] Shadow Slimes are uncatchable - they work in the same way as Gold Slimes [/spoiler] - and resources spawn in semi-random pattern across biomes. There are no drills or pumps like in the first Slime Rancher so I hope you are patient 'cos you'll be running across all map to collect them.\r\n\r\nNew world map looks cool and all but is huge without any point for that - most of the locations you'll visit only once for a collectible. It also makes walking unnecessary long so better invest quickly in some teleports. This is also a good place to mention that collectbles that were I would say mostly optional in previous game from this series here are nearly mandatory if you want to craft every upgrade.\r\n\r\nThe story is plain as hell - you'll meet NPC's from previous game, but for a time they'll just do an exposition dumps and after that they'll constantly nagging you with mostly garbage presents (decorations). [spoiler] The new person that you will meet - for me at least - is boring. I didn't even finish the game and I have a feeling that she is probably a time traveller that somehow contributes to the whole mess of prismatic colors etc. [/spoiler] The new plot is dragged out to the point of it being so obvious that you don't have to finish the game to get the idea of what's going on.\r\n\r\nI know that in first Slime Rancher if you sell the same type of plort constantly it loses a value over time. It's the same in this game but somehow worse. Slime Rancher 2 actively punishes you for having an optimal farming strategy. In my save I have only Largos and they produce a ton of plorts. The game economy crashes so much that it takes literally 10 game days of not selling anything to raise the value of every plort to more than +-10 gold. \r\n\r\nBut the absolute best/worst thing in this game that break the camel's back is the fact that 3 of the Slimes are locked behind RNG. You can obtain Yolky Slime at random (they just sometimes spawn without any rhyme or reason) and Tangle and Dervish Slimes are locked behind specific weather condition. It wouldn't be that bad if that weather guarantees you these Slimes. But I don't know who though that it would be a great idea - as Tangle Slimes in my save appear always when pollen hits cat 3 - it's not the same for Dervish Slimes. Not only you need to have cat 3 wind (with cyclones) for them to occur - the fact that they will occur at all during this weather is also random... So you have RNG within RNG... Fucking great. I had cat 3 wind with cyclones like maybe 3 or 4 times during my +30h of playing this game and during them I met Dervish Slimes a whole of ZERO times!\r\n\r\nBut there are snares in the game - you scream at the monitor - and I say yes. I used them... All of them... I started with basic and advanced one and have no luck for 20 game days straight. After that I've got so fed up that I finally found and catched [spoiler] Hyper Slime [/spoiler] to built the master one. But alas... Even the Master Gordo Snare that according to the descripion GUARANTEES the Gordo that you want if you provide their favourite food (Yeah... Guarantees my ass...) didn't give it. I provide Prickle Pear... And I've got a FUCKING PINK GORDO. WTF? After trying to catch this motherfuckers 'cos big \"?\" mark across Plort Market screen bothers me so much I still didn't get a single Dervish Slime. The problem with catching Dervish Slime was known since Early Access.\r\n\r\nAfter that I just uninstalled this game 'cos it frustrates me so much. Seriously - if you want a cozy game with cute slimes and great story buy the first Slime Rancher. Because Slime Rancher 2 has bland story that is long for sake of it and wants you to constantly grind for resources, locks some of the Slimes behind RNG wall and make some of the previous game features that were optional mandatory.\r\nI have only one question to the developers of this game - who hurt you?",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h1] In short, I feel like the game does not respect the players time. [/h1]\r\n\r\nGoing back and forth to your farm to pick up plort to open a door is annoying, but it's even more annoying to discover that there was another door that needs a different plort behind the first door and now I need to travel back to the farm to get that one. Everything that helps you move faster like teleporters and drones are grindy to get and don't show up till much later. Managing the ranch became annoying more than it became like something I enjoyed doing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While I did quite enjoy my playing experience overall, there are quite a few issues or as I'd like to clarify one main issue. The addition of weather events was for example quite fun.\nThe game is quite fun at times and exploration of the pretty expansive map does give one a sense of acomplishement. It has gotten quite the graphic update since Slime Rancher 1. There are a few new and interessting slime varieties(My personal favorite being the yolky slime). The cosmetics are also pretty cool and the story feels in depth enough, interesting and engaging. But this is sadly where this game seems to kind of missunderstand something. I didnt play Slime Rancher to endlessly farm for Ressources. That should never ever be a given in a game. \nIt feels like this aspect of the game is designed to keep players in the game, but with really no other purpose. It feels like an absolute disrespect of my time. Having to scoure the map for ressources for more hours than I would like to admit just to get one goddamn teleporter is an absolute pain in the ass. AND do not get me started on the quantum drones that were released as a feature for the full release. While they are nice and I've been anticipating them since I bought the early acess version. I sadly yet again had to realise that this game does not value the players time at all. The ressources needed to craft even somewhat basic things(such as rare diamonds specifically and a whole lot of other ressources to be compleatly frank) are a pain to farm. In additon to that if you wish to fabricate just about everything you can, good luck to you: expect to spend a whole lot of time just mindlessly running around the entire goddamn map just to find some rare diamonds or other ressources. Because and I wish to emphasise: this game does not value the players time. Once you compleated the story there is nothing else to do. No real other goal. I thought that maybe I could idk unlock another farm or something, the way you could in what i would describe the end or post-end game of Slime Rancher 1. But it seems that even that was not done. Even while the game was in early acess I have struggeled to find anything to do that didnt feel like a mindless waste of my time and energy for little to no payoff. \nIt seems that after you compleated the game there is literally only one thing left to do: decorate your farm apperently. Just wow. What great content. \nIn the original you at least had to the objective of farming money to buy some upgrades for the ranch. While those were, as far as I can remember, cosmetic for the most part, at least they didnt require you to spend a disrespectful amount of time and energy just mindlessly running around the map trying to find some damn rare ressources. What an absolute pity. I had high hopes, but instead I got left with a feeling of just having wasted quite a bit of my time for nothing. While the story was nice and I did enjoy quite a bit of the game the continues wasting of the players time is absolutely unacceptable and quite frankly just incredibly disrespectful. \nJust to emphasise my point of time wasting:\n-A lot, and really do mean a lot, of the recepies need strange diamonds. Strange diamonds are spawned at pretty random locations on the map, they do not have a distinct sound from normal ore that can spawn. So have fun running around the map trying to find a ton of them if you wish to fabricate most things.\n-A lot of recepies need gold plorts. While those are somewhat randomly spawned and aquired, these at least can be farmed a little more efficiently after upgrading the vacpack. \n-You need to farm so many shadow plorts and due to them loving to jump into the void that gets really annoying real fast. Yes, i am aware you can corner them in certain spots of the map, that doesnt make this a great feature regardless. \n-You need quite a lot of prisma plots, which if you've ever wanted to feel pure stress in a game, try farming that stuff. I cannot even begin to imagine how much time i spent farming that.\n-The general ressource farming has been changed conceptually from the previous game: sadly not in a good way. Everything is now made to spawn more or less randomly...While there are set areas where certain ressources can spawn, you again have to walk around the entirety of those areas to find enough ressources to just fabricate one or two things. That's fun, isnt it? Don't you just love running around aimlessly, just hoping for some luck with spawns, and then of course, rinse and repeat until you begin to wonder why the hell you are even playing this game to begin with. Is it to relax and have some fun? Nope, apperenlty you just love wasting time, now dont you? Or at least that seems to have been what the developers thought, or should i rather say lack of thought perhaps, has led to such a sour experience. Again: Slime Rancher 1 got this right, you had to place your extractors, let them do their things and then come back to get the ressources. That is an acceptable level of grind and doesnt seem that the developers wish to keep you in the game for reasons that arent just keeping you in the game for the sake of honestly what? Just why?\n-There are so many recepies (upgrades included) and they all need a ton of ressources if you wish to craft them all. Here you can go to my previous points to find out why that is annoying.\n-A lot of recepies call for strange diamonds for what i thing is the same reason I've already mentioned to a point where even I am getting sick of saying it: wasting time to keep you in the game.\n\nTLDR: It has some cool concepts, but massivly disrespects the players time and seems to wish to keep the player playing, not for some cool goal or achivement: nope, just for the sake of wasting time it seems. The original had already struck a good balance, where this game decided to kick it just for the sake of it. The end game content is honestly non existent. What an absolute shame. Try it if you wish, but when a game does not respect your time, you have to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's fun. I'm probably going to finish it. But this feels like it takes steps back from the first game as much as it takes steps forwards.\r\n\r\nThe writing is meh. We're told that this game is a special story and how important that is but none of the writing feels like anything but filler. NPC gifts are just blueprints for rock pillar #7 or flowerbed #2. The drone diary entries are all written as small rambles that don't really mean anything.\r\nTL;DR: All the writing is tell don't show.\r\nEven the first game was better about this even though it was still a lot of tell don't show. NPC rewards were meaningful, exploration was less of wandering a huge samey map with shortcuts you have to open from both ends very awkwardly to the point that they aren't even useful.\r\n\r\nThat being said: I love that chickens breed like mad now. I like changes to how slimes work. The maps look pretty even though they're way too big and don't feel very distinct. Slime science is still a bit awkward but feels less awkward than in the first game. Also the chickens. Did I mention the chickens? Justice for my chickens to actually be a viable food source. All my slimes eat chickens. Chickens!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Don't get me wrong, SR1 is one of my favourite games ever and SR2 would probably be one of them too, but the dialogs in any language other english are....... well..... I guess they've been done with Google translate because not even an ai can do this bad of a job.\nI didn't care about translations on SR1 since it was an indie game after all, but seeing how SR2 translations didn't improve at all is just disappointing.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really enjoyed Slime Rancher 1 but cannot recommend SR 2 in its current state. Very quickly after you establish your farm and do initial exploration your gameplay will turn into circling the same 3 areas combing it for resources so that you can craft one, maybe two QoL items. When you hit the end game areas you'll need special plorts that cannot be farmed traditionally. They made getting these plorts easier in a recent update and reduced how much you need, but the grind is still ridiculous. Spent 2 hours wandering around the area grinding these plorts, only to find that not even 50+ plorts was enough to open the door I found. Grinding these plorts is not fun, and the in-game map is not very good for areas with several levels which leads to going in circles several times. \n\nIf they allow players to craft resource extraction devices similar to the first game on top of the resources found naturally in the map this would go a long way to reduce the tedious grind. Additionally, the slimes needed to open these special doors need to be able to be brought back to your base. If Monomi wants to keep these plorts high-value they can introduce some special way of farming them, maybe something similar to how water and fire plorts are gained. But the way these plorts are obtained right now is just obnoxious and brings my desire to 100% this game to zero. I'll keep an eye out for updates to reduce the grind, but for right now I cannot recommend.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love SR1, it is one of my absolute favorite games of all time. \nWhen I found our SR2 came out I was OBSESSED, I spent 30 hours playing this game and trying to convince myself it's good. \nYes, the map is huge however most of what made SR1 good was the exploration but being able to automate things as you go late game so you don't have to still do tasks you were doing day 1 and could spend the late game enjoying the story and the exploration. SR2 failed that in every aspect. Even late game you're struggling to get to key parts of the map because... you can barely make ONE way teleporters. Yes, one way. \nThe grind is too insane and honestly I think it's to pad play time because it definitely doesn't help story wise or help a player stay invested. \nI've came back to this game time and time again to try SO HARD to get myself to even tolerate this game and I can't. \nIt's a shame because visually it's gorgeous, they really expanded the map and added new slimes. Sadly, actually playing it though is just so grindy and unbearable that it doesn't even matter.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I really wanted to love this game, love the ability to build anywhere, but the grind it just too much for too little reward and honestly, how do you not add more slimes then 1? just changed them up which really isnt as fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Put off almost entirely because drones aren't able to interact with warp depots, walking is my least favorite thing in this game and i'm bummed automation of mundane things isn't worth the effort",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "just the same as the first game with more map area but nothing to actually do or see in them that makes it worthwhile. they also didnt expand on the automation at all. \n\nthe first game is more enjoyable honestly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely loved the first game and couldn't wait to try the full release of SL2 but I instantly realised this game has this weird blurry look to it that instantly hurts my eyes. Looking at anything that's not right in front of me makes me squint. I spent longer than the tutorial looking at forums just to try and solve this but adjusting the settings in any way does not remove the weird filter. I would try and play again if there was a classic graphics option but until then it is totally unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My kids and I love Slime Rancher to pieces, and I did not hesitate to buy into Slime Rancher 2 on (or close to) day one of its Early Access release on Steam. I have had concerns with the game throughout the development process, but held my tongue until I got to immerse myself fully in the \"finished\" product.\n\nSteam's question for these reviews is, \"Do you recommend this game?\" As of the date of my review, my answer is no.\n\nThe short version: Slime Rancher (1) is a substantially better game that provides more fun in a more logical gameplay loop, at a much better price. Indeed, Slime Rancher (1) is worth the full list price today. As long as you can buy/play Slime Rancher (1), there is simply not a compelling reason to buy Slime Rancher 2. \n\n[b][u]Now for the (very) long version, which is FULL of spoilers:[/b][/u]\n\nSlime Rancher 2 is not a bad game, but it is a marked downgrade from the original Slime Rancher in terms of gameplay and the fun factor. This still surprised me because Monami Park clearly poured so many resources into the graphics and level design. It would be a step up if they had simply left the actual gameplay alone.\n\nInstead, they wholeheartedly downgraded the Slime Rancher experience.\n\nThe core problem is with how this game conceptualizes resources versus how Slime Rancher--and, frankly, most farming sims/animal-raising games--conceptualizes them.\n\nIn Slime Rancher, your primary resource is Plorts (slime poop, basically). You get Plorts by feeding your slimes. Plorts make you money, and money buys you early- and mid-game upgrades. In the late game, you are tasked with finding additional resources in order to fund more advanced upgrades. This process is largely automated and does not substantially interfere with the core, fun part of the game: catch slimes, raise slimes, profit.\n\nIn Slime Rancher 2, your Plorts are a minor resource at best. Instead, the game locks even the most basic early-game upgrades behind a resource \"paywall.\" You cannot even get the Jetpack or Dash Boots without hunting and pecking for a relatively large number of extraneous resources, some of which are not even available in the first area. \n\nIn SR2, collecting these special resources is a fully manual process. You have to find the resources in the wild, where they are placed largely at random, and you have to extract them manually (assuming they don't just fall into the ocean or into lava before you can). Since these resources eat up your Vac Pack slots, that's space you cannot use to capture slimes or collect their food. And since you cannot even reach most areas of the game without the early-game gadgets, this means your ability to grow your ranch depends on how much time you spend grinding away hunting and pecking for these resources.\n\nThis problem gets worse and worse as the game goes on, and nowhere is it worse than the game's approach to automation. In SR1, at a certain point, you can build drones to automate tasks so that your slimes are well taken-care of while you explore distant lands and complete higher-end challenges. \n\nIn SR2, not only is your ability to automate your ranch locked behind the \"resource paywall,\" but drones also require a specific resource that only appears completely at random, the Strange Diamond. Other key late-game gadgets require Strange Diamonds, including gadgets necessary even to access the game's big \"feature area,\" the Grey Labyrinth. I have gone as long as ten hours in my playthrough without seeing a single Strange Diamond. \n\nYou can see that I have about 81 total hours in the game as I write this review, and I have been able to build exactly ONE drone, for a ranch with a dozen different slime habitats across five game areas. \n\nWhich leads me to the coup de grace, the Grey Labyrinth. Progressing in the Grey Labyrinth requires you to spend A LOT of time there just waiting for certain slimes to appear and random events to occur. But without sufficient access to automation, you cannot spend much time away from your ranch before your slimes get hungry, your chickens overrun the whole place, your food rots, and chaos generally ensues. \n\nI do hope the folks from Monami Park see reviews like mine and take it as constructive criticism. I hope it gives them an impetus to improve the game post-release and, if there is a Slime Rancher 3, to focus on what got them all the good will from us Slime Rancher fans in the first place: the slimes. But I am not optimistic since everything I have said here echoes feedback players gave Monami Park throughout Early Access and it seems they not only did not listen, but tripled-down on the neverending resource hunt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game is way too grindy and turns the chill slow pace of sr1 into a stressful and overwhelming experience. things like the new decorating system and the shop are nice improvements but they come in hand with step backs like the nerfs the drones received or the obnoxious resource gathering. this game wants to waste your time and doesnt want you to automate your chores. the labyrinth is way too convoluted, exploring it isnt fun, and who is out there asking for more puzzles? why do we have to grind thousands of prisma plorts (which even with a cheese takes hours, never mind without)? the story in theory is interesting but is told in the least engaging way possible (through periodic exposition dumps). all in all the game just feels incredibly overcooked and is a disappointing sequel.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I did not read any Reviews for this game because its on overwhelmingly positive so I thought this game is just the first one with some improvements or whatever. After playing for a couple hours I noticed that Im not having any fun but remember liking the first one so I read some reviews and noticed that this game is actually a downgrade from the first one. They did not improve on anything and made the game more tedious and filled it with even more micromanagement bullshit instead. Its the exact same game but slightly worse in almost every gameplay related aspect. So unless you really feel the need to scratch an itch and dont want to play the first one again its totally fine but personally Im still good from the first one even after like 5 years and thats coming from someone that plays almost every season of path of exile so Im used to repetitiveness. There is another review here that put it into much better words but I felt the need to leave a negative review for such horseshit. How the fuck is this on 97% positive??????",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tedium, the video game. At every possible place the devs could have made a cool QoL feature, they decided, \"to hell with the players, lets make this game really take forever for all the WRONG reasons\".   \n\nSo many good/cool things about the game truly spoiled by some baffling choices made, including but not limited to. \n- Inventory Limited to 6 SLOTS (meaning 6 TYPES of things can be carried at once).  In a game with 100's of different items, many of them often slight varients of each other, this is a wild and STUPID choice. \n- instant death pits, any water source deeper than a puddle instant KO's you and teleports you back to home base, which wouldn't be so bad if not for.....\n- Drop all inventory on death, with no way to recover.  I will note there is a mechanic to keep some of your inventory on death, but that is EASILY more than 9 hours into the game, and it's still only SOME.  (this is un-forgivable in a game marked \"relaxing\" and not \"souls-like\"\n- Inventory being so limited means a TON of back and forth to the base, and you do NOT get teleporters that go 2 ways early at all, (at my 8.5 hours i did not have more than 1 one way teleporter yet). \n- Limited sprint \"energy\", just why?\n- every crafting task takes a lot of resources that you MUST go into the field to grab like 2-4 at a time, and how many do you need? most things take at LEAST 10 or 20, but i imagine it gets worse.\n- the refinery link and markey take a minute to setup after deploying... again,  WHYYYYYY  IT'S JUST WASTING TIME. \n\ni played this game so you don't have to.  Pass this and go to something more fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "really dogshit compared to first game, no teleporters so you have to walk everywhere, way grindier, just complete ass",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Love the first game, this second one feels alright but I can't help feeling the waste of time to inefficiently find and transfer resources. It loses the fun factor and feels tedious. What's up with all the pointless decorations? Sad to say I feel disappointed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoyed the first Slime Rancher, but this one just doesn't hit the same. I'm not sure why they wanted to focus so hard on grinding instead of just the exploration aspect, but my god do you have to do a lot of it. Especially if you want to decorate the conservatory.\r\n\r\nI found the Grey Labyrinth to be really frustrating. I learned to navigate it, but again you have to do more grinding to open everything. \r\n\r\nThe graphics are cute, but the story and NPCS are flat as a pancake. I'd give this one a pass unless you are really obsessed with the first game, and even then I'd wait for a discount.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Despite some revised balance, new slimes and additional content, it ultimately feels shallower than the first.\r\n\r\nOnce again ranching plays a backfoot to exploration, but here it's even worse. There's almost no reason to ranch slimes, as upgrades and important items will usually only require plorts from areas you're currently exploring, rather than having scaling requirements. Alongside the need to constantly gather crafting items that cannot be farmed, the ranch is basically a time-waster.\r\n\r\nFinancially shadow plorts are the easiest and fastest way to make money, which cannot be ranched and must be obtained through exploration and the other end-game plort you'll need to farm can also not be gathered outside of its specific biome.\r\n\r\nThe game cuts numerous slimes from the previous game, which leaves even the UI feeling unfinished with space for nine more plorts on the market board that don't exist. Late game slimes have fewer quirks and difficulties in raising them, leaving the progression feeling wonky, unlike the Glass Desert of the first game which was notably harder and with more difficult slimes.\r\n\r\nExploration is also lacking. Gone is the big interconnected open-world with lots of interesting skips and shortcuts that players can discover. Enjoy being teleported to a biome, with a few paths that you can follow, each with maybe one useful resource along the way. Once you discover the final biome, also enjoy never revisiting the earlier biomes, as there will never be any reason to ever return, given the game's incredibly linear progression and exploration.\r\n\r\nSlime Rancher 2 is a better looking and worse version of the first that still manages to feel unfinished after releasing from early access.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A different user by the name, KoshLovesYou, already made a fine overall good review on this game. I cannot write it better myself. \n\nSomehow this game just feels so empty compared to the first one. If this is your first one in the series that you are getting, I can maybe see that you could have some fun, but as someone who played the first one, this is just the same but less. \n\nWhen you are unlocking new areas I am not taken away like I was in the first one - some areas even give off a sameness like \"I have been here before\" - I dunno if this was an actual decision they made or laziness.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "For the price ive only played 8 hours and i feel like ive seen everything the game can offer twice over, its fun and still cute its just not anything necacaraly new and the old game if you can get a key for a dollar or play on xbox game pass is pretty much the same with just with easier progression and overall easier to understand machanics but still with that cute artstyle and farm simulator gameplay",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the first game but this.\nSadly just feels like more of, exactly the same but emptier somehow... or hollow?\nThe location is new but that's really it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Underwhelming, cute but childish, the ending is also bland. Fun to explore, not to complete.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I could recommend this game, however it just feel so grindy. \nI have been playing for 12 hours but I feel like I hardly progressed in the game, and everything is a chore to upgrade.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just not as good as the first game\n\nthe entire sense of exploration is gone because they basically just copy pasted the same slimes as in the first game and put them on a new map. There's very very few new slimes. For the first 20h of gameplay you're mostly just going to see 1 or 2  new slimes depending on how fast you play. It takes way more time to grind money for upgrades and I don't feel like there's a payoff for it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't recommend Slime Rancher 2 not after running into egregious and arduous grind not even a quarter of the way into the game. Early Access wasn't this grindy and progressed more evenly and pleasantly like the first game but the full release the devs did some things that just made it really grindy and unpleasant not to mention locking a major progression element behind an NPC event trigger.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought it in EA and had fun with it at first, but as time went on the game got more and more grindy, and slime farming (which also felt grindy and time consuming compared to the first game) became secondary to resource hunting for upgrades. I stopped playing when the first half of the Grey Labyrinth dropped due to the grind for its exclusive resources. The story is there but it didn't grab me like the first game, and the NPC interactions are essentially non-existent (\"Hi, here's a thing, later!\"). \n\nI booted it up today to try the 1.0 release, took a look at my farm and the resources needed for the new equipment/upgrades, and decided it just isn't worth it to keep going.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL:DR If you want to play Slime Rancher and ranch slimes, you're better off playing the first game. This one is more like winding your way through an Ikea for five hours only to realize you forgot your wallet in the car.\r\n\r\nIt feels like they forgot to make it about ranching slimes. Everything is so far apart and you're always running around and back tracking to gather stuff. You'll find a hidden door that needs a plort to open, which is fun, but you have to remember where to find that slime and then go all the way there and back, just to find out that it's hiding a treasure pod with a useless decoration blueprint. Which would be fine and dandy if you didn't have to grind even more resources to use any of the decorations.\r\n\r\nSpeaking of gathering resources, they do have flags to mark resources nodes. However, those nodes are always moving and you know what you need in order to make the flags to mark the resources you need? THE RESOURCES YOU WANT THE DANG FLAGS TO MARK IN THE FIRST PLACE.\r\n\r\nDrones exist and can supposedly alleviate some of the resource grind, but they take so many resources that are such a tedious pain to find and gather themselves that I've completed the game and never got to make one. \r\n\r\nThe environments are all so complicated and confusing. Sure there's plenty of nooks and crannies to explore and secrets to discover, but it feels like EVERYTHING is a nook or a cranny. I played for 40 hours and didn't feel like I knew where I was going for a single moment of it. I'm looking at the map constantly to reorient myself and figure out where to go.\r\n\r\nNow that I'm done with the horrendously painful to navigate grey labyrinth I feel like I can finally actually ranch some slimes, but...... there's just no reason to. I've already completed the game without even getting to half the upgrades and I've had more money than I can use for the last 25 hours of it. Plus getting around the ranch is just so tedious itself that I don't enjoy ranching the slimes. Why do I have to run down a thirty second long corridor TWICE to get to every area? I can't even remember which side of the ranch leads to which area half the time. The side that looks like a cave? Nah, that leads to the field. The cave is on the [I]other[/I] side.\r\n\r\nI hope there are plenty of people enjoying decorating their conservatory, but I cannot be bothered to gather so many tedious resources just to engage in a cozy side activity after I've already gone and finished the game.\r\n\r\nI'm going to play for a bit longer to at least experience the drones and see if I can find any more enjoyment here, but if you want Slime Rancher I feel like you're better off playing the first game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll say this - if you're a fan of the first one, this game isn't for you. Now, I'm no automationist or anything, I don't strive for maximum efficiency, but this game really made me wish I could be. It requires ungodly amounts of mindless grinding for the same handful of resources to make one-off gadgets that you don't really need afterwards, not to even mention the lack of endgame. Once you've completed the story - great, you've had your fun, now go do something else with your life. I didn't spend a LOT of money on it by any means, but I expected a lot more and, I'm sorry to say this, but I was left disappointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The map is very disorienting and takes me too long to get around, maybe its just a skill issue but still it's impossible to get around without unlocking the map part thingies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically the same as the first game, not enough improvements.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun but stale.\r\nA fun game to turn your brain off and relax, until you get soft locked due to the games horrible progression past unlocking the jetpack.\r\nStory is stale and a massive downgrade from the previous title, just talking to pngs is not interesting. There is no incentive to build up your ranch because of how expensive they made everything, another bad change in comparison to the previous game, you are better off coasting from the abundant plorts found on the range instead, not even needing to use the base past warp tech apart from crafting upgrades, which in themselves are tedious to make.\r\nLag, stutters and load times galore, want to go to a new area, load zone, want to go to your ranch, massive frame drops, want to do anything in the background, you better not.\r\nReally unfortunate, would rather play the original, not to say this game doesn't have it's merits, but I never felt this negative about the prequel, so take from that what you will.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Okay first of, they seem to have addressed the most common complaint about the 'end-game grind', you get more special plorts and it costs less of them, that's a positive.\n\nBut this game is one of those where you really want a middle thumb again.\n\nFor this comparison I replayed the first game a bit again, and the Graphics are a bit smoother sure, and the UI, and the controls of the Vac-pack also seem to be slightly smoother, that's all positive, but...\n\nBig but, the rest of the game world doesn't have the same charme to it as the first, which to me, made the first game much more special, I really thought we would get another Wow factor set piece, or some more interesting lore and story bits, but I don't remember any wow-factor set pieces and the story and lore in this game, I figured this out kinda early what was going on, which was kinda meh, and after like you've gone and collected 4 or 6 of those lore drones the NPCs at the terminal even completely stopped giving you any more info, they would just send you random gifts.\n\nIn this game, I felt the entire time, that I had to go out there into it's world not for exploration or doing fun things, but because I needed to grind more resources, because NOW your vac-pack is also a resource collector at the same time, inventory space while a bit more than in the first game in terms of slots, is still limited early on in terms of stack size, which you ofc need to grind resources for to upgrade it, but I never really felt like I was making good enough progress on that front to 'stay ahead' of new tool upgrades.\n\nSo with you now being the resource collector (it even took me a while to realize I had to collect the resources from those water fountain things etc myself, since there was only one tiny pop-up bubble explaining that to you, it went by too fast at the time, until I randomly tried to get water from one of those fountain things and saw that's how I get resources), they also removed those cute handy resource pumps and they are 'technically' included into the collector drones from the first game, I say technically, because I really have no clue how they work exactly, I tried to place them around stuff in the world, but I think they just collect stuff based on arbitrary random values over time, it's not very clear on that front.\n\nOn the note of helper drones, I find them a bit of a downgrade, I don't know what exactly feels wrong with them, but they seem to be worse somehow, it's hard to explain, but I was more frustrated with them this time around, either they just worked too slow, or it was more difficult to set them up properly, there's also still not enough of them, I could do with at least 4 to 8 more of them if they really wanted me to automate most of it.\n\nChickens... so, chickens are insane this time around, in the more fossil digsite area of the base, every time I enter it , it lags, because there's like a thousand chickens there, fun. But because I don't have enough drones, it's kinda difficult to control their spawning, so I just left them alone.\n\nOh right I haven't even talked about slime ranching, it's just worse feeling, I mean it's the same as the first game, it just feels well not special, this is one of the major critique points I have really, those gardens for fruit plants etc, in the first game they had like one or two more upgrades that made them look more full with extra trees and maybe they just increased the base spawn rate of fruits, but it just feels you get less, for the Corals, I think they are literally just the same, but because of that I really wished there was more... like bigger corals, or round corals, or anything really, I wish there was just more ways I can interact and ranch slimes, but there isn't it's the same means as the first game and since it was similar I already knew I look for some easy fruit/veggie option to get and make largo slimes that give good returns and aren't too volatile, there was nothing new and nifty, nothing that made me make new plans to try and ranch slimes, so I can't really say it became any better.\n\nA lot I've read from people on the forums they mentioned this felt more like a DLC and I can probably agree there, at least it doesn't come close (to me) to a similar experience I had with the first game, the environments were really cool in the first game, in this one you have like one place that's just full of tar slimes, which you can then travel to two more areas either being a different flavour of cotton candy and then you got one extra area and the final zone, it just feels so much less.\n\nEven if there was post-launch extra zones to come like with the first game, the base of this game alone is just feeling much smaller in what you can explore and do, that those extra zones need to be big bangers for me to say I have seen more and had a great fill of this dessert.\n\nI would've wanted to give it a good review, but as I was playing I was just never getting the same feeling as I got when playing the 'more janky' first game, it felt like it had more charme to it, this one felt more formulaic, 'we need to have this, we need to have that' but you can't force a good game like that. \n\nAs I said many times in this review, this is all based on the feelings I had whilst playing this game, obviously I don't know what the intentions were behind the game during the creation process, but it ended up making me feel and experience these. \n\nTo recap: \nPositives:\n- Looks of UI and Textures, Improved\n- Gameplay feel, Improved\n\nNegative:\n- World Exploration lacks interesting areas and Wow-factor\n- Story and Lore are easy to figure out and lack depth (and just more)\n- Resource Management and Inventory are more tedious\n- Slime Ranching is the same, nothing has been added\n- Confusing Drones at times, that could do with more explanation",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just plain worse than the first one, also the system requirements for \n[i][b]those[/b][/i] graphics are just insane",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For new players, yes, for older players that played the first one, no.\n\nIt completely feels like the exact same game with some new content.\n\nDoesn't deserve to be called a sequel, there isn't nothing that big to be called a sequel, could have perfectly been a DLC for the first game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels overly grindy even during the story of the game, was never really an issue with the first game along with that just feels less focused and has weaker map layout it's just kinda meh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Go play the first one instead. The islands feel empty and monotone. They lack distinctive features, which makes you rely on the map a lot. The first game was designed without a map in mind and it shows. It was very easy to remember changes in terrain, because each small area was slightly different. I love slime rancher, but cannot reccommend this one. Not in its current form.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ATTENTION! The SNOW ISLAND is hidden extremely well, I only knew of it from the trailer and somehow finished the game without finding it.\n\nIt would honestly be on par with SR1 if the in-game resource economy wasn't so extremely stingy, you can hardly afford to build or upgrade anything that doesn't cost money, and it's a shame I had to skip most of the shadow plort gates as well.... \nBacktracking became a bit of a pain too, especially in the maze area.\n\nI enjoyed it nevertheless, though I can't exactly recommend it compared to the first game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There are some good ideas and fun things to do in the game, but the resource grinding starts out pretty bad and only gets much worse later in the game. There's little explanation for why many of the resource grinding design choices were made the way they were aside from simply trying to pad the game's playtime. This was actually after an update specifically to improve the resource grind, so it was even worse before, but it's still really annoying how everything requires a bunch of resources to make and there's no good way to gather them in the quantities needed. I think it would be better if things required significantly fewer resources and more money instead, then there would be more reason to actually farm slimes in this game that seems like it should be about that in the first place.\r\n\r\nA lot of the game world wasn't too bad to explore despite feeling unnecessarily large, but the last dungeon was terrible. It was miserable, tedious, and confusing to navigate, and at no point in navigating the entire area was it anything resembling fun. It seemed to be specifically designed to be an awful experience. I'd spend a while climbing up to get to where I think I'm supposed to be going, only to find it blocked by an invisible wall (sometimes glass, which is basically invisible at a distance). Once you finally get going in the right direction, there's often a locked door requiring a specific plort to open, and it's not one that's available from any of the slimes in the area, so you have to leave to track down one of those plorts and then go all the way back just to open the door.\r\n\r\nTo put into perspective the difference in my experience with the Slime Rancher games, the first game was so much fun that after finishing it, I got into speedrunning it for a bit because I wanted to keep playing it. With Slime Rancher 2, I considered quitting multiple times before finishing the game and regret that I didn't, because the ending wasn't worth the torture required to get to it. The games feel the same in terms of controls, but 2 just has so many design choices that make it worse to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Drains my steam deck battery very very rapidly more so then any other game I’ve encountered. It’s relaxing but can be a bit boring as well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's deeply inferior compared to the first one. All it adds is flair and grind",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dunno...maybe I've changed since the original or maybe they've changed something that I can't quite put my finger on.\n\nBut this? This is really dull and unsatisfying to play this time around.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gets really boring, slime rancher 1 is better dont recoomend",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A promising start fades into a tremendous amount of grind and lack of direction.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I forgot i even owned this and havent considered opening it for 3 years, thats how little of an impression this left on me. I just remember running around and getting all the plots to realize there was literally nothing else to actually get and it seems like that didnt change based on the other reviews",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot support a game that has a terrorist group's flag in.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Should've been an update, not a whole separate game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A waste of money , boring and not fun unlike slime rancher 1.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not bad, but a definite step down from the first game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I’ve really enjoyed Slime Rancher since the first game — its bright colors, sharp contrasts, and crystal-clear visuals gave the world so much personality. Every area in the original popped with life, and the art style made exploring feel magical.\n\nThat’s why I’m honestly a little disappointed with how Slime Rancher 2 looks in comparison. The new world is still beautiful, but the art style feels washed out and foggy. The heavy use of haze and soft lighting mutes what used to be such a vibrant, high-contrast look. It makes the environments feel less distinct, and sometimes it’s harder to tell different biomes apart.\n\nI understand the developers might be going for a dreamy or atmospheric vibe, but it’s lost some of that punchy color that made the first game stand out. I really hope the team considers releasing a DLC or graphics update that brings back the old look — something with the same bright, colorful, high-contrast style that defined the original Slime Rancher.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its a good game but not as good as the first one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Desperately needs a quality of life update[/h1]\n\nTL;DR: No drones or automation and walking literally anywhere takes between 15 and 30 minutes to get almost no progression. This doesn't feel like Slime Rancher 2; it feels like an alternate reality Slime Rancher 1 where quality of life features are replaced with different slimes.\n\nSlime Rancher 2 puts all its focus into rewarding exploration. This is great in theory, but the execution is...unforgivably repetitive. Around the five hour mark I stretched in my chair and looked around my ranch, and it dawned on me that despite having been very busy for the last several hours, I hadn't accomplished [b]or explored[/b] much of anything because the game demands you run back and forth between areas you've already explored for hours to gather resources you already have hundreds of...\n\n...With no automation, an infuriatingly small inventory, and a plort market that is, much like Slime Rancher 1, always trending down. I am told Drones are in the game, but they come way too late to solve the core issue of highly repetitive gameplay: Harvest crops one at a time. Feed slimes one at a time. Harvest plorts one at a time. Sell plorts one at a time. Then go back and do it again because your inventory is too small to hold a full stack.\n\nI can not stress this enough-- you will meet milestones (unlocking an upgrade, getting a new structure on your ranch, etc) on average every 45 minutes [i]if[/i] you put all your focus into repetitive tasks to grind out resources.\n\nThe new slime types look really cool. If all you care about is different slime species, you will probably like Slime Rancher 2. The new slimes are everything I wanted from a Slime Rancher 1 DLC. Also, base decoration has been significantly improved from Slime Rancher 1. \n\nThe maps are colorful, if frustrating to navigate. Their layouts...kind of blur together? I find myself getting turned around in them because the terrain doesn't have enough landmarks, and the color palette makes everything, how do you say, \"not look like a landscape\" and it messes with how my brain processes the 3D space. It's kind of like being put in a maze where the walls are the color of the floor and vice versa. All the areas also kind of look similar. In Slime Rancher 1, different zones had distinct visual styles, but because SR2 is going for the pastel vibe, most of the areas I've seen so far (that aren't literally on fire) look homogeneous.\n\nThis game NEEDS [b]two-way[/b] teleporters and drones in the first two hours. Period. I can't in good faith recommend SR2 until it gets a major quality of life update, because no matter how cool the new slimes are, the game around it doesn't respect your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Making drones more powerful on the ranch would save this game for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think the game is cute and is a good game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels boring after first game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I mean just play the first one if you havent",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's basically the first game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just pretty boring overall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "IM SLIMING (needs more optomization)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to sticky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "goida Sasha gay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The provisions shop has a pride flag.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}