{
  "positive": [
    {
      "review": ">be me\n>buy deltarune\n>coincidentally, get sick around the same time\n>sneeze all the time\n>play chapter 3\n>the first save point says \"You are filled with the power of not sneezing\"\n>thanks, Toby.",
      "voted_up": true,
      "votes_helpful": 442
    },
    {
      "review": "Good game, miserable fandom., The truest indie experience you can have",
      "voted_up": true,
      "votes_helpful": 362
    },
    {
      "review": "Deltarune is one of the greatest games of all time.\nThe music in each part of the game is a complete masterpiece, and each chapter keeps improving the amazing immersive story.\nWith ingenious characters that improve on those from Undertale, even with some Undertale characters returning in similar or new forms.\nThe Gameplay is incredible and improves on the formula used in Undertale.\nThis is 100% a game worth having if you love to play video games.",
      "voted_up": true,
      "votes_helpful": 112
    },
    {
      "review": "I want to cry every time a new Deltarune installment comes out. Toby Fox just gets it.",
      "voted_up": true,
      "votes_helpful": 73
    },
    {
      "review": "toby fox out here doing absolute peak pixel art games with the most random ideas out there. This entire game is a fever dream, it's amazing. Now with actual controller support!\n\nCan't wait for the next chapters!",
      "voted_up": true,
      "votes_helpful": 72
    },
    {
      "review": "I'll try to write about this game, but i dont think anything i'd say could do it justice.\n\nI dont know if the episodic format is a blessing or a curse. One one hand its a blessing because i'll have a reason to continue & have something to look forward to in life or its a curse because something unexpected could happen that would hinder me from experience the full thing.\n\nOne thing is for sure though, this game didn't just surpass my expectations, it took my expectations out on a fancy dinner date before showing me the world. I seriously thought it couln't get better than Undertale as i loved that game to no end & originally wasnt hyped about a AU setting, but after experiencing this, i dont think i can return to that game.\nNot many would even dare to attempt to beat themselves after setting the bar so high.\n\nThe silly but wholesome humor is still here. Pretty much all characters are likeable and distinct. \nThough i would strongly advise avoiding all lets plays or streams of this game like the plague because this is the one game i would want everyone to experience blind. \nNormally i dont mind being spoiled as long as the gameplay is fun or as long as i like the tone or setting, but going into this with prior knowledge really isnt fair to all the attempts to play with your expectations.\n\nI dont think i need to introduce anyone to the soundtrack. Even the \"worst songs\" are absolute gold!\nThis OST kept me alive & motivated during one of my most depressing jobs & is to this day the only OST i bought seperatly from the game.\nIts just so full of energy, pure joy, sillyness (in a good way) & innocent childish beauty that just makes you wanna live, make friends & explore the world even when you're in your darkest moments.\n\nhttps://www.youtube.com/watch?v=q-5cXVcCOUs\n\nhttps://www.youtube.com/watch?v=N117e1Ub39A&list=PLKXdyINOQYsaHwm4rJ0QDFzsaZQNQjF0U&index=11\n\nhttps://www.youtube.com/watch?v=tBdLO8u-0L8&list=PLKXdyINOQYsaHwm4rJ0QDFzsaZQNQjF0U&index=58\n\nhttps://www.youtube.com/watch?v=RKQUblO-iCs&list=OLAK5uy_kADMv-61zFDA5jOl2rTBQpqaa8celjh54&index=3\n\nSeriously, this OST is so good that i no longer fear death, knowing Toby is Mozart reincarnated in modern time, probably as the long lost child of Michael Jacksson & Astrid Lindgren.\nThe man is as unprofessional as he is skilled in pretty much everything (writer, programmer & comedian) & sending a healthy message of pacifism to mankind. Is there anything he CAN'T do?\n\nThank you for giving me hope for humanity, you absolute god among men. It dont matter if the full game is released tomorrow or never. It will always be worth the wait in my heart.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "Really good fun RPG with branching narrative options making for fun replayability with cute graphics and a funny storyline.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "i've been excited about this game pretty consistently for the greater half of the past decade and i don't anticipate that changing any time soon. incredibly inspiring game for me",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "It is said that there are three types of people in this world; those who make things happen, those who watch things happen, and those who question what happens. When you, the player, realise that you hold enough control over your avatar to go off-script, what do you do?\n\nDeltarune is a game that invites players and onlookers alike to partake in a test to see which category they fall into.\n\nit's oddly cathartic managing to really resonate with and Get this game after years of being called \"The Friend Who Doesn't Like anything Undertale\" (although I have since replayed it and finally come to appreciate it). dunno if it's just indicative of my tastes and what it is i exactly look for in video games shifting but i love the metanarrative and the idea of there being a disconnect between the player and the character that, in any other game would serve merely as an avatar for the player to project onto. do feel a bit of it kinda leans into \"Spooky Scarey dot exe Game\" territory at times but it still managed to make me feel empathy and lament that I had taken over the life of someone who, prior to the game's events, was their own person who simply just existed in its world. but i also watched other people do the snowgrave stuff on youtube lol so i'm not exactly innocent\n\nalso susie gaster is my goat",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Having really liked Undertale with its music, characters and emotions-filled story and also considering that this game does not currently have all of its chapters out, I can confidently say: \"Toby was just practicing with Undertale, this time he got serious.\"",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "great game i just got stuck on chap 3 since it was kinda hard getting S rank as im kinda bad at dodging",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "What can I say? It's Deltarune.\n\nTobyfox has a unique flair when it comes to his games from the meta elements, the amazing music and storylines. It's just a labor of love as far as I'm concerned and everyone should play this one.\n\nHonestly I feel it's much better than Undertale and I say this as someone who adored that game.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "the best narrative game I've played in recent memory. The cast are charming and I love running around the overworld. Tbh I wasn't really a fan of Undertale because I felt like there was too much walking, the OST was hit or miss, and the puzzles were boring; but everything I found weak about Undertale's game design has been significantly improved upon in Deltarune. \n\nThe music is a delight. Everything is snappier. The characters have more depth. And the boss fights! Every fight was perfectly tuned difficulty wise such that every single one felt like it might be the one to break me--and yet, with every attempt, my improvement was palpable and when I finally beat the boss, it felt well earned.\n\nSo, yeah. 10/10. This is a game for the history books.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Amazing soundtrack, great story and nice art. Really enjoyed it",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "acompanhar o lançamento de cada capítulo desse jogo é como ver um cometa que só vai passar uma vez pela terra. sinto muita sorte em poder estar aqui pra ver isso e compartilhar esse jogo tão querido com os que eu amo. obrigado toby :)",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I'm glad there's so much time between the release of each chapter, so I can properly obsess and overanalyze every detail in each one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Deltarune is one of the best game i have ever played, while i like Undertale a lot i like this battle system much more.\n\nThis game have many great and funny moments you don't expect, great characters and soundtrack\n\nHighly recommend this game for everyone who wants to try something new and anyone who played Undertale\n\nAlso would recommend to play Undertale too if you haven't yet.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has amazing and creative gameplay, the boss fights are very easy, some challenging and are very fun. Characters and game design is fabulous, the characters are so iconic and the art/animation is breathtaking despite being a pixel game. The OSTs are also so good, toby sets an otherworldy standard toward music composition. Story and plot is also simple yet complex, keeps you guessing about the near end of the game and shows you the consequences of your actions, like UNDERTALE.\n\nOverall a life-changing, inspiring, and heartwarming 10/10 game. Same thing for UNDERTALE.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "this game will make you laugh and cry and cry from laughing and cry from crying. ut/dr has changed by life in many ways and the story is absolutely immaculate and will always leave you begging for more",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "bordering perfect game, amaizng sound strack, amazing story, still on going, great humor, amazing characters, great visuals.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ABSOLUTE CINEMA the game's only halfway finished i didnt even finish it yet and ive been loving it so much this game you WILL love itrs a must play \n\nrory nite and jevil are revolutionary to my life please play this guys",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily without a doubt one of the most cherished gaming experiences I will ever have, I love all of Toby Fox's work and this was a thee absolute peak of it, Temmy is the goat too, Together they made the most peak experience that I literally find myself burying the thought of because I just get too excited waiting for it, I just want to play more so bad! That cut off left me wanting so much more! I cannot wait for what is next.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "so this game features may favourite things.\n\n1. queer characters.\n2. trauma.\n3. child soldiers fighting epicly.\n\nso all in all a very fun experience, would recommend it, fanart is just the cherry on top",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I's a joy to play, the story in the latest chapter had me questioning myself and my role in the story \n.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Story rich, humorous and great music.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I guess you could say when writing this review I… took too long.\n\n*Slaps knee and guffaws*\n\nHonestly I’ve been trying to stay away from joke reviews recently but I can’t resist a good game of inside baseball. If you’re looking for an actual recommendation, then what are you waiting for? Go buy it. Its funny, heartfelt, and all around kicks ass.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best story-telling RPG I've ever played and it's not even finished!! :D\n\nI really encourage anyone who's hesitating on buying it, to REALLLY do!<3\n\nNot to mention that the story is based on an alternative universe as the game \"Undertale\", so if you're also a fan of it, you'll love it even more.<33",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't know what to say about this game, exept that it is the most PEAK game I played all year. It is funny and Story-Rich which aren't that many games today, but of course this is only MY opinion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really incredible game! At this point, it is way more than a sequel to Undertale, it has it's own story and theories. I honestly enjoy the gameplay more than Undertale. I highly recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good music and the gamepaly is peak. there is still some glitches like the game not saving you want to play with wasd instead of the arrow keys",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun game for any fans of lore or meta narratives, bringing up many complicated thoughts in regards to player and player character interaction. Very curious to see where the story goes next.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Lets say, €24 for 7 albums of the best game music ever created, count me in!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Feels weird to review an incomplete game but for £20 this game is already a steal. Not counting the upcoming chapters.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game for people with a decision problem.\n\nwhy?\n\nit doesn't matter!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Deltarune is proof that the character writing in Undertale wasn't a fluke. Toby Fox and his collaborators continue to make characters I can't help but love. So far the game is up to chapter 4 and it has been a great time. I am looking forward to more as it comes out.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Chapter 1-4 were so peak, this game is so great and i can't wait for the three last chapters coming in the future",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "DELTARUNE to gra, którą znałem gdy miała swoje początki. Sam pierwszy chapter to jest wybitne cudo. A patrząc na to, że jesteśmy (prawdopodobnie) w połowie rozwoju pełnej gry. To tyle dostaliśmy contentu, warto było czekać te kilka lat na te nowe chaptery, ale stare i tak są ikoniczne. Ta gra będzie na zawsze w moim sercu <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game.. Is perfect!!\nLots of reminders of undertale characters and.. the most important.. This amazing TobyFox's style of the game that you want to play over and over again because the story is heartwarming. Every character is unique and has it's own soul.\nThere are variety of things you remember for a really long time just for its perfection.\nThe music, the style, the developer.\nI remember how everyone wanted the continuation of undertale and now it's finally out!\nCongrats to everyone who waited and believed!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Genuinely such a lovely game, Susie Ralsei Lancer I could literally just fill the list of my favorite characters here, it’s such a step up from Undertale, There’s so many references to that i’m already on chapter 4, and I can’t wait for the future for this game, I just wish the updates didn’t take so long lol! 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I am a BiG fan of Undertale so it was a no-Brainer to get Deltarune! Normally id be a bit confused about the many Credits after each chapter- but in this game U feel the Love that had been poured in in every corner- after each chapter end it feels like I ended another Season of my most favourite Show. Its crazy how every Chapter almost feels like a Sequel considering all the new Gameplay mechanics that get added making it feel fresh ever start of each chapter. \n\nI was abit Dumbfounded when I saw that there are 7 chapters- then again that the others are still in development…and here I wanted to binge the Game…\n\nQuality Takes Time.\nTake as much time as you need…\n\nIll be waiting here in the Dark~ (Maybe make my Own Dark Fountain to bridge the time)",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "IT is my Favourite game, a very very good story\nAmazing Characters\nAnd the music is the best\nAnd theres even more chapters on the way!\n4 more\nBest game ever!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Deltarune isn’t just a good game for me – it’s the best game of all time.\nHonestly, it’s the best thing I’ve ever played, and it genuinely changed my life. >-<\n\nThe atmosphere, the characters, the music, the story… everything feels handcrafted with an unreal amount of love. Toby Fox somehow manages to deliver more emotion with a few pixels than some studios do with entire blockbuster budgets ;o\n\nEvery moment feels meaningful. There were times I didn’t even want to continue because I didn’t want certain scenes to end — but at the same time, I couldn’t stop playing ;T\n\n<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3\n\nIf you haven’t played Deltarune yet: do it.\nDeltarune is funny, emotional, surprising, weird, heartwarming — all at once. And once it gets its hooks in you, it won’t let go.\nI finished it and just sat there thinking: “Wow… this really changed something in me.”\n\n<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3<3\n\nIf you haven’t played Deltarune yet: do it.\nIf you already have: play it again >:3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can't wait for the last chapter!\n\nToby is genius.\nI wish deltarune be a phenomenon and bestseller even more famous than Undertale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game :)\nYou have pretty much everything you'd want from an indie RPG\nIt's not flawless tho, and the first chapter kinda pales in comparison to the other chapters\nStill, buy the game\njust don't interact with the fandom too much if you don't like cringe stuff",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy this game enough to nominate it for an award. Its fun, and funny, and the secret bosses are actually fun to find and fight. Thank you, toby fox.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the longest-lived games so far that still keeps on impressing with each new chapter.\n\nThis indie game hits relatively close to most people for its imagination that every youth relates to in every world they are in and the reality that surrounds them.\n\nThe only twist to the story is how far you're willing to force the character you control to go against the grain. Don't get me wrong, this is no UNDERTALE. But it carries a similar and equally extraordinary way to see the story through than what you're usually accustomed to.\n\nWhether it's through a typical route with hilarious moments along the way with your new-found friends and familiar faces in the franchise, or pushing to find something new and unveiling secrets about them than just how they and you see each other. Yet, despite the many ways you can interact with the world and its characters, the box ominously states that there is still only just one ending.\n\nToby Fox hits every time with his varied, yet organic, chiptune soundtrack, really roping you into humming along with each one and knowing which character or scene it belongs to. It can't be stated enough that you can't not forget most of these.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is literally the best game ever made, and it has changed my entire life.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I liked this game a lot, it's funny and cool.\r\nI liked the story, and the characters.\r\nTotally recommend to everyone.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Turning Berdly into frozen chicken was certainly an experience.\r\nFantastic game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Крутая игрушка, отвратительное (за исключением мемов) комьюнити.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Words cannot describe how amazing the story is in this game. Loads of quirky funny humor, deep compelling stories, and amazing characters! It has it all!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Only complaint is, you can't sex the Titan. Rest of the game was pretty good though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My all time favorite game. I love everything about it, from the characters and the story to the music, art and humor. I eagerly await each new update on this game, and I think I'll be a Toby Fox fan for life.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Out of my list of top games to eat chalk to this is at least a [Egg in this trying time]/[[It Burns! Ow! Stop! Help Me! It Burns!]]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you dug undertale, this is everything that was but 10x better. Help your group of goofballs solve silly puzzles and make friends with quirky weirdos, or commit acts of violence and turn the happy little creatures into dust. The soundtrack is peak, the writing is wonderful, and each chapter just makes me want to play the next update even more than the last. Definitely a big recommendation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best game I have ever played, showing such story, deep character development, it is so nice I can recommend it to everyone!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Man, I dunno what to write here. Words can not describe how incredible this game is.  It's not even done yet. Anyway. I'll come back when it's done and write a real review.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The less said, the better.\r\nIt's good. [i]Peak[/i], even.\r\n\r\nIf you liked Undertale, play this NOW. If you never played Undertale, play this NOW, and then play Undertale (it's slightly relevant I swear.) If you're still undecided, check out the demo (which is the first two chapters in full,) witness [i]peak[/i] and play the full game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is soooooo good and its better than undertale",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I will write a proper review when the game is finished, but for now, i´ll just say this is already one of my favorite games of all time and a very very very special work of art.\nI will remember this experience until the end of my days",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A game that's 9% game and 91% everything outside of the game. You play this and you become addicted to the stuff people who love the game create. It's so enjoyable to read theories and comics people post on forums, watching video after video on the lore and stuff.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah, it's good. Really good. Gripping story, beautiful soundtrack, compelling characters, engaging gameplay, and phenomenal game/level design - every chapter feels just about the perfect length; and the RPG mechanics never overstay their welcome. \n\nIf you haven't played this game yet, it's probably because you're not sure if it's for you. And that's fair: this game isn't for everybody. Here's my pitch for Deltarune; and if it doesn't sound like something you'd enjoy, feel free to walk away!\n\nDeltarune is a tight, well-paced indie RPG. It has fun gameplay and bullet hell combat mechanics, but the real core of the game, much like its predecessor Undertale, is the story. The characters are interesting and immediately loveable, but there's also several mysteries and unsolved questions floating about. Mysteries that make you wonder what's really going on in this game. As the game unfolds before you, you'll take on ever-increasing combat challenges, find secrets buried deep within the game, and get just a little bit closer to unravelling the mystery plaguing the narrative.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A genuinely breathtaking game. There's nothing I could truly say that hasn't been sung as the highest of high praises already. And it earns those praises with every step.\n\nChapter 1, although being the oldest and far different from the proceeding chapters, is a beautiful introduction to the world.\n\nChapter 2 is absolutely smashing with its mix of comedy and commentary on internet culture. The [spoiler] weird route of CH2 and beyond [/spoiler] presents a sinister yet amazing take on a story gone wrong that was hidden in plain sight.\n\nChapter 3 is a blast with the board maps and battles, and the appearance of [spoiler] the Roaring Knight [/spoiler] ties it all up neatly narratively. Also, we love Spam-Tenna.\n\nChapter 4 is a huge tonal shift, all in the right direction. I can't even point any specific parts out because every second of it is amazing. [spoiler] I fucking LOVE the Titan showing up here. [/spoiler]\n\nArt style? Perfection.\nMusic? Some of the best ever made, especially for boss themes.\nCommunity? Insane, but loveable.\n\nChapter 3 & 4 make this THE Steam Game Of The Year for me.\n\nUpdate: Well, would you look at that! You can nominate this game for several categories in this year's Steam Awards, and Game of the Year is one of them. Take one guess at which I voted for. :]\n\nBuy it. Experience it. Be immersed. You won't regret it.\n\nExperience the legend of the DELTARUNE.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "this game is so story rich and so many things to do in it for such a good price and over all just so much precious story and content just a overall 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, Toby Fox absolutely cooked with the OST again, 10/10, would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if youve ever played undertale you should buy deltarune, id say its on the same level as undertale but its not as appreciated as undertale. the style of the whole game is amazing( by style i mean everything so storytelling soundtrack artstyle etc.). if you love good game osts you will enjoy this game even more because toby fox is an amazing artist. some of the songs have amazing collabs like Lena Raine(Celeste ost) or Laura Shigihara(PvZ ost)\nid recommend everyone whos intrested in either undertale or indie games overall should atleast try the demo because chapters one and two for free is an absolute steal also the rest of the chapters are supposed to be updates so i would say thats the reason for the game costing 25euro youre essencially paying for all 8 chapters even though only four are realesed as of Nov 2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DELTARUNE starts out light and heroic, but by chapter 4 all of that has faded away as we face the end of the world.\n\nThe gameplay is varied, and the difficulty is implemented in such a way that anyone can follow the story and it's direness.\n\nThe OST does not just compliment this game, it is a vital component, as Toby \"only made one melody\" Fox's songs follow the game and situation perfectly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the soundtrack is one of the best i had ever eared of my life the naration is beautyfull is honnestly one of the best game had played in my life",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far one of my favourite games I have played from the story telling, to the character writing, to the character developer, to the insanely good OST, to the art design. I could go on and on however I look forward to what else Toby Fox and his insanely talented team cooked up for the upcoming chapters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing. The characters, amazing. the music, amazing. the battles, fun. the choices i make, don't matter. lovely.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loved undertale, loving deltarune now as well. Music is fantastic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Undertale is still my favourite one but Deltarune comes pretty damn close to it. Deltarune is an experience, you talk to friends gain new friends lose friends play minigames fight monsters and much more its a game that doesnt bore you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game. i think its so cool that [spoiler]des is a fcking villain [/spoiler]! cant wait for the new acts!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deltarune has got to have some of the best storytelling, battle mechanics, lovable characters, and an absolute BANGER of a Soundtrack! I’ve been paying attention to and following along with Toby ever since I played Undertale (The absolutely amazing RPG where nobody has to die!) like 9 years back or so. And I’ve been following (and playing) Deltarune since the first ever Chapter released!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing Undertale, all I can say is buying and playing this game won't disappoint. \nA 2 Chapter Demo is also waving for you to try if for whatever reason you're hesitating. \nThe music, the art, the story, everything was just so good and well done.\nThe fandom may be chaotic at times but don't let it put you off playing this absolute peak of a game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Where to even start...\nAbsolutely one of the best games I've played throughout my lifetime.\nAn incredible story full of emotion and action.\nA banger soundtrack that I listen to on the daily.\nAn amazing world.\n\nThis game is absolutely stellar, and we're only halfway through the story.\n\nToby fox, Temmie and the entire Deltarune team did an incredible job. Massive thanks to everyone who helped to create this wonderful experience.\n\n100% worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's always a blast to play this game whenever a new Chapter comes out. I can't wait to cry and replay this game forever when it's finally done. Toby Fox and the Team really know how to cook with this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When the new chapters came out I stayed up til 3AM (if not later) playing this.\nThe last time I did that with a game felt like so long ago.\nToby just continues to create games that touch my soul.\nThank you.\nI'm very excited for what's to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Toby Fox is such a good cook when it comes to games and music. You may say he's quite the... big shot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having already played (and beaten on every route) chapters 1 and 2 on the demo, i came with high hopes, and sure enough, like all Toby Fox games, it did not dissapoint, filled with exiting visuals, captivating gameplay, interesting puzzles between main interactions, all alongside a comically unserious nature, with occasional moments of seriousness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there's just no doubt in the damn world, this WILL be the most important game of our lifetime",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I cant really say anything that hasn't been before but I'll say it anyway because Deltarune is an unforgettable experience!!! The game itself is really fun, controls are easy and bossfights are also fun in my opinion, especially the secret ones. I won't even start talking about the music because Toby Fox is a music genius and we all know it. The story is deep but you kinda have to look for it, which some may like some may not. And the visuals are amazing!!! This is my first review ever so I guess sorry if it's not that helpful- Deltarune is a game I recommend to people who enjoy stunning visuals/pixel art, amazing music and really cool story ^^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Deltarune is simply the best game ever created. \nThe best part of playing this game was seeing myself grow throughout the years alongside the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Thoroughly enjoyed, and looking forward to seeing it develop going forwards. While it's unique art style, sense of humour, and hands-off story may not be everyone's thing, I would still recommend giving it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The journey of it releasing in chapters is half the mystery of this game, if you even slightly liked any part of Undertale, you should get this game. Chapter 5 soon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Togore Dreemurr is one of the best Deltarune and Undertale characters in the Undertale and Deltarune cast. My reasoning behind this is because of the writing that goes into them; they interact so well with all the characters in Deltarune, and their arc with Gerson Boom in the dark world was possibly one of the best arcs for any character in gaming history.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game I've ever played, without a doubt; and it's not even done yet.\r\n\r\nThe characters are so good, the gameplay and battle mechanics are very fun and has SO much potential, and this just may be the best story ever written. I can't wait to see what they new chapters may bring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I might be able to experience what is basically undertale without spoilers and blind playthrough...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the most engaging and intriguing stories to come out of gaming. And its not even close to being done. This one is truly one of the ages. If you're thinking about giving it a try, please do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean its just a great game. To be fair it is not ready yet, so you will only be able to play some of the chapters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this game ruined/fixed my humour. Best soundtrack of all time. PLAY IT PLEASEEEEE, DONT BE PUT OFF BY THE FANBASE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some of the most fun I've ever had with a video game. Completely overflowing with greatness.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly outstanding game. Everything to the soundtrack to the gameplay is so so GOOOOD, you could 100% play this game on repeat over and over again with choosing different endings and more content. I can't wait to see what more this game offers with the next chapters, 10/10 game for me (Edit: Chapter 3 & 4 are OURSTANDING, such an amazing work of a game dude)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the combat, the animations are amazing, this game is awesome, i love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game from the music to the story and everything in between and i cant wait for the next chapter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game for its price. The mix of goofiness and calm getting stopped by sudden danger makes it both out of the ordinary but also gives it a great experience. Everyone should play at least the demo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is so fucking peak i swear despite playing ch. 3 and 4, five months later i luckily didnt spoil myself anything, and playing this in a blind playthrough was so exciting and awesome, the narrative is probably one of the best ones there is for an rpg i bought this full price without hesitation once i could. First game to make me shed a tear honestly, and it isnt even fully done Im hyped to see whats next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredibly good. every step of the way a fantastic rpg, through and through. And I damn well hope I live long enough to see how it ends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The soundtrack is amazing and one of the best parts of Deltarune. I am very excited to see the ending of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this game ever since the demo for the first two chapters dropped and have been obsessed with undertale and toby fox for years since undertale this game is amazing and had the best ost in my personal opinion. The humor is great and the story is addictingly good the price is too low for how amazing this game is",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I can't even be bothered to finish it. Not because the game is bad or anything, it's actually good - But the community and constant people spamming hype for this are the most broken ill-minded losers I have ever seen in my life. Just for a safety check, don't play this game.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "hawk tuah man game about kids playing in the closet and man i tell you i aint to diddy blud to like ts",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I replayed through Chapters 1 and 2, which I adore. I am now in Chapter 3, and honestly, I regret having replayed the previous chapters, because it has meant I can not refund the game.\r\n\r\nHonestly, I am not sure what the living f*ck Toby Fox and team were smoking to think this was a good continuation of the game. For someone who enjoyed, even though she struggled with the first two chapters (and undertale) due to some accessibility problems, this chapter is f*cking appalling.\r\n\r\nI might be lucky and be able to get a refund, but I doubt it.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Take this with a grain of salt:\r\nI used to love Deltarune, I enjoyed the premise that Chapter 1 brought, it set stage for this grand RPG that would give Undertale justice, and show how far Toby Fox has come. Yes, it does do that, in its art, music, etc, but I feel like as the chapters progress, the story seems to... melt. Chapter 2 was a huge twist, but 2 seemed to focus more on Spamton and things happening in the background. Chapter 3 got shafted heavily, as so many things were cut that it leaves things to be left desired for Tenna, Kris' family, and nudges towards the Dark Knight. Chapter 4, brings back the strength of Chapter 1's atmosphere, but it still seems to struggle with the story progression. There's a good progression for Susie's character there, and some things about Ralsei. (Who I lost interest in after Chapter 1, Ralsei's design was best when he had the darkened fur, and the witch's hat) Chapter 4 also had plenty of interesting story movements there too, relating towards the Dark World, the things going on in the background of Kris' Hometown, and also the mayor too. Yet, I still feel like there's a lot left to be desired despite all of these good things.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "(First time ragebaiting :3)\nGame too difficult,\nno story,\nmusic is mid,\nlazy writing,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nugh, \n     I hate lying this game is peak.   \n\n\nStop trying to find reasons to not buy it. \nOne of us - One of us - One of us.\n[spoiler] Just Buy it [/spoiler]",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is the biggest disappointment of my entire life. (Exaggeration)  \nI'm happy if you or someone you love enjoys the game but that doesn't make the game good. I felt like it was a snooze fest of characters you couldn't possible enjoy beyond surface level. Factually, this game obviously had time put into it. If you're bored, play if you want. If it was free, it would be worth your time... it's not worth your money. Very repetitive, meaningless, and disconnected. \nSusie is the only character with effort put into her story, if you enjoy who she is or what she represents- then, yes, I recommend the same. If you don't enjoy that character, I highly doubt you'll enjoy any other part of the game. This is meant to be disconnected from Undertale yet hinges on the idea that you'll enjoy the last game enough to stick through this one for the quips. \nI won't be wasting my time, I don't recommend wasting yours. If you like burning your money and leaving your remaining sanity, spend away.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Hard to enjoy this game. It's an good game for what it is. A lot of old throwbacks to SNES games etc which is dope, but it's the kind of game you would play on your own, I would not recommend it for streaming as there is a LOT of dialogue and it dragssss. The puzzles are decent difficulty. Worth playing. Overall way too long, can't recommend.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The story isn't exciting, you don't get the nostalgia, and very childish.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is literal garbage. F*ck you for making me sit through 3 hours of chapter 1 only to realize how dogsh*t this game is and refuse a refund. Eat sh*t.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Genuinely unfun, unfunny, and has a terrible creator",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "please Dess i need this! Kris's dad is kinda homeless. they live with thier mom and im trying to help him out",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "chapter 1,2,3'de sans var 10/10\nchapter 4'te sans var 0/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is great I just fucking hate the roaring knight",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Nothing left from Undertale",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}