{
  "positive": [
    {
      "review": "The reviews for this game are mixed because frankly, the game launched in an extremely buggy state. However, the developers have demonstrated that they care about this game and have consistently addressed issues as they have arisen. If you enjoyed For the King 1 the game is now in a state where I would be happy to recommend.\n\nIt is a significant improvement over the first game, significantly more content and a much deeper combat system than the previous. While I believe some of the initial poor reviews were warranted, the developers have shown that they care about the game and their players. Do not be scared off by the initial reviews, this is an excellent co-op game and is worth picking up!",
      "voted_up": true,
      "votes_helpful": 55
    },
    {
      "review": "📝I thought the first For The King was a great beer-fueled game with friends, but it turns out it's the second one that takes the cake.\n\n🧠The sequel is more linear and is in a way stricter with the plot. However, some missions provide enough time for exploring, particularly if you slow down the chaos in the settings of difficulty. \nThe fighting has turned out to be much more appealing, with an implicit tactical aspect added. Though it doesn't blow the mind, it was certainly absent in the first installment. At the beginning, it does not look much different but gradually you realize how the engagement of the game is increased so much by it.\nAnd the signature dice continue to be present, together with the shouts of \"what the hell,\" the swearing aimed at the unpredictability, and the cheers when you unexpectedly one-shot someone. The game has become less casual and more mobile-like, which is a credit to it.\nFor The King 2 has truly become deeper, more self-assured, more interesting, and most importantly, more fun.\n\nThe game features several character classes: blacksmith, mage, archer, shepherd, and others - each with their own unique abilities and skills.We can personalize the heroes in various ways by selecting different combinations of weapons, armor, and accessories, thus giving them a unique playstyle.\nThis is a role-playing game with tactical elements. The player controls a group of heroes traveling through locations in search of adventure and treasure. They must fight enemies, solve puzzles, and interact with the environment to achieve their goals.\n\n✅The Good.\n+ Great alternative to board games\n+ Engaging storyline\n+ The visual style has been beefed up\n+ There are now 4 characters instead of 3\n++ Perfect with beer and games with friends.++\n\n❌The Bad.\n- Very minor improvements compared to the initial release\n- In the multiplayer mode, there is a battle for the spoils\n- Early game is tougher compared to late game.\n- The time limit in some missions makes it difficult to enjoy the exploration of the map, thus killing the fun.\n\nIt's still the same For The King, only now it's bigger and has mechanics missing from the first game. One of the major things is the option to have a maximum of 4 players in a party, which can now be played in groups of 2 (2x2) or 4. The shop is also very much extended with the addition of the new classes. You can recruit mercs in the town that help you to eventually have a party of 8 people (mercenaries act automatically during the fight). You can also pick up items for your starter at the start, and as you progress through the game, more pleasant perks become available. The combat system also now features the concepts of first and second lines, something missing from the first game. Of course, this doesn't mean everyone will kick the sole character in the front row.\n\n🧾Summary.\nFor The King 2 is a game that is at a crossroads between the past and the coming era of the franchise. It keeps a large portion of the previous game’s visuals, mechanics, and story but at the same time brings in its own innovations. However, the game, despite its innovations, is unable to create its own personality and is forever tied to the first game. This identity crisis along with the loading times which happen too frequently to be just minor inconveniences lead to a game that had to go through the pain of being uninteresting and irritating before it could ever be enjoyable.\n7.5/10🔚\n📝The changes the developers have implemented have positively affected the game and made it a real successor to the classic. For those who were disappointed back then, it is definitely worthwhile to try again now.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Genre - Turn based rogue or adventure game with optional Co-op\nIt's a 6.5/10 game for me, but still fun for a few games, so maybe get on sale.\nThere are 3 distinct ways of playing. The rogue mode, the adventure mode, or co-op mode.\n+ It has hot seat mode\n+ The characters and enemies are varied.\n+ The rogue mode can be fun up to a point.\n+ Loads of weapons, items to find (in small quantities).\n+ The mini-boss fights can be well balanced.\n+ Permanent upgrades and characters to unlock (but limited to keeping game at a similar balance).\n- Rogue (Dark Carnival) - The difficulty and balance is silly. On rogue mode the enemies get too hard, too quickly and healing and treasure is too limited. With loads of negatives to pick up that counter act any positives. Also someone had the bright idea to always put a party of 5 enemies against your party of 4. Literally if it was 4 enemies as standard, the balance would be a lot better. Especially as party members can die and not be replaced.\n- Adventure modes - You will need to play on the easiest mode to progress. Similar issues as above, but in this your party can get split too easily, even though you might be fighting smaller numbers of foes. There is a map, so you can be more tactical, but you are working against the clock.\nI haven't played co-op, but it's not going to give you any advantages, if anything it's more likely to mean the party are working against each other. I'm sure it'll be fun. But progress will be hindered by bad balance again.\nA shame, as if this game was balanced fairly, it could have been a lot more fun to play and progress.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Personally I love FTK2 even more than FTK1, and I really really love FTK1. I feel like FTK2 does everything even better! I have a few buddies that don't like that you can't rotate the camera (which is a valid complaint), but it doesn't bug me too much and I still think this is a great game for playing with friends.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I honestly didn’t expect the game to impress me this much 😄. The visual style, overall presentation, and the way everything is delivered feel genuinely top-tier — you can clearly see the developers put a lot of heart into crafting this world. The atmosphere pulls you in right away, and every location looks polished and full of detail ✨. Even though the gameplay felt a bit unusual at first, it quickly grew on me, and I found myself enjoying the challenge and the variety it offers.\n\nThe more I played, the more I appreciated how well everything fits together 🎮. The pacing, the combat flow, and the small touches in animations and sound design really helped keep the experience engaging. By the end, I could confidently say it was absolutely worth my time 😊. If you enjoy strategy adventures with personality and strong visual identity, I genuinely recommend giving it a try — it’s a surprisingly rewarding journey 🌟.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i tried the free week, it didn't take a week i enjoy this game. if you need a break and a good way to relax this is for you. if you don't enjoy games that don't require a lot of thought, you might want to pass it up. there's no voiced dialog, and its a hex crawler but the story is good enough to keep you entertained and the gameplay keeps you engaged.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "For The King 2 has a more visually appealing look than its predecessor. Instead of the cubic style so beloved by indie developers, characters and environments have taken on more form, and the level of detail has increased significantly. The game feels the same, but better in every way. The interface has been significantly improved, making many features simply more user-friendly and intuitive and yes i am gay.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Very silly but fun game... turn based shenanigans, stat abuse, and hilarious ragdoll physics combined with the accessibility features (blood is instead confetti, also arachnophobia mode turns spiders into essentially floating loaves of bread (no legs) which both are just silly and fun while addressing the needs of people who need no spooders or no blood) make this a game that is great fun with friends. It's getting regular updates, and while things are not perfect, I do recommend it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "💬Following the success of For the King, IronOak Games has returned with a sequel, immersing players even deeper in the world of strategic combat and cooperative gameplay. For the King II seeks to not only keep the main traits of the original game that fascinated us, players, for hours but also to go deeper into the mechanics to provide us with an even richer experience.\n\n🎮When one looks at FtK II for the first time, they see the well-known features of the previous game: turn-based fighting, exploring, and playing together. Nevertheless, everything has been redone, made more interesting with new classes, equipment making, and the addition of a fourth character who is supposed to add more tactical depth to the game. The combat system is the remarkable alteration that attracts attention mainly. The fights are held on a grid now, and with the extra party member, new strategies can be devised. Players have to think of every move as in a chess game, as unit placement on the board will be very important.\n\nHowever, the range of new classes is kind of disappointing though. The developers have tried their best to add new functionalities but sometimes it feels like they are just repeating what is already there. The loadout system, while seemingly allowing for customization, doesn't fully fill this gap.\n\nExploration is the second foundation of the game, which is a mixture of map reading, resource management, and strategic decision-making. Each campaign has a certain amount of variation thanks to the procedural generation of maps, but the visible differences are often just cosmetic and not much of an impact on gameplay. This shows another unexploited potential area.\n\nThe narrative of the game unfolds in a captivating manner, instantly throwing the players into the scenes that happened after the first game. Even though the storyline is not the main focus and the character interactions are limited, the game world is not lacking in charm. The characters while charming and friendly, are nonetheless, deprived of complete development and interaction with the world, which, in a way, takes the depth from the story that could have been the case.\n\nThe game's visuals and audio are superb, immersing the player in a fairytale world full of color and detail. While the music is pleasant to the ear, it may not be memorable. FtK II adds the player experience with a more challenging difficulty level compared to the first game. The fights with enemies have become harder, and players have to think well and control their resources to win. This higher difficulty level introduces an additional dose of excitement and tension, giving each decision a significant impact on the game's outcome.\n\nWhile fate plays a role in combat, the Focus system gives players the ability to manipulate fortune to their advantage. The limited-focus points that can be restored by either resting or using healing items are a tactical instrument. They mitigate the negative impact of randomness and increase the chances of survival. This system not only increases combat but also motivates the players to make the right choices and plan their resource allocation in a smart way.\n\nThe progression system has its pros and cons. On one hand, going through the campaign and gaining access to the new character classes, places, and items that will encourage continued play, the available options in the Lore Store can feel somewhat limited. This can have a negative effect on replayability, more so because a lot of the new classes are just slight changes to the basic characters.\n\nThe game excels in multiplayer. Co-op play allows you to invite friends, further enhancing the game's tactical appeal. While managing multiple characters in single-player mode can sometimes feel monotonous, the presence of friends significantly enhances exploration and combat. The whole process of adding friends and going on an adventure together is simple and easy to use, which makes multiplayer a perfect way to experience the game completely.\n\nWhile FtK II is an engaging and rewarding game, a weakness is the inability to view your party's stats and equipment while acquiring new items or loot. In the case of obtaining weapons and armor, the problem is very clear, the interface does not allow comparing statistics and picking the best counterpart to use the items. The introduction of that capability would not only make the process much easier but also enhance the game in general.\n\nAnother missing key element is the power to deploy your team on the board before the fight, which looks very important in the games that rely on tactics and strategic deployment. This restriction can cause unpleasing feelings and also the loss of positions that might have been good for you in combat. It is certain that the pre-battle deployment would considerably improve the tactical aspects of the game and make the fighting much more interesting.\n\n👍Strengths.\n- Hard to master…\n- Intuitive and Addicting Combat System\n- New combat system\n- New polished visuals\n\n👎Weaknesses.\n- Annoying Loading Screens\n- Imbalanced Metagame Progression\n- Lack of Distinction From The Previous Game\n- …hard to master\n\n🏁Summary.\nFor the King 2 is a basic turn-based game that offers great experiences, albeit with a simple design: It is in fact a good game with a beautiful graphics that is also a mixture of challenging and funny quest fantasy RPG that can give you new experiences either alone or with others during first, second, or tenth playtime sessions, with lots of character in the process. The graphics are a bit tired but the bad ones are still present in the user interface that hinders what should be a very fluid gameplay. The puzzles of where to go, how to find a dungeon that is missed and how to kill a strong enemy are the pleasant ones; the puzzles of how and when your Farmer makes a scarecrow are rather unpleasant ones.\n🎯7/10",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Best one out there. I've been gaming since '90s and this is as far as rpg/adventure dungeon crawler should be. Amazing single player experience that scales perfeclly with multiplayer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After its alpha and full release. I am currently playing the new age update. I have to say, the game isn't as hard as I thought it would be compared to the first game. The equipment you earn through quest, loot, and battles are quite forgiving in terms of boosting each type of class/ playstyle. I like to think that this game has improved what the first game lacked in terms of power creeping, although it still has that die trying feel or intensity. My favorite part about the game is the action economy amongst the primary and secondary actions which allows you to be self-sufficient in battle. Overall, its a huge thumbs up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "То же самое, что и первая часть, но с дополнительными фишками и улучшенной графикой. Цена, правда, не такая гуманная, как у первой части, особенно с учётом DLC. В остальном - отличный рогалик с приятным балансом, хорошо подходит для кооперативных посиделок.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Neutral review. Enjoyable, but gets repetitive and tiresome moving all 4 players and manually solving even trivial combats.\r\nThe loading screens and wait times around combat don't help.\r\nUI is clunky and requires passing items around, but has mass sell function.\r\nCompared to FTK 1 it finally has nice graphics instead of Minecraft-style.\r\nRandomness can be controlled quite a bit and they have good safeguards so you don't miss 95% chances.\r\nBuzzing sounds considered music :(\r\n\r\nIt's a proper game of balancing decisions - do you have time to go get that treasure or could it lose you the run?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really enjoyed the first game, this one adds a bit more. Lots of variety and replay value. DLC doesn't lock content just adds characters which are pretty solid. Id like a sandbox mode where you can customize the map or something that would be cool.\r\n\r\nRecommend to anyone who liked the first game, apparently it didn't have a great launch my friends didn't recommend but I finally picked it up and have been in love. Small dev team actually fixes things and care.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game if you have a pal or two to play in coop! Very comfy. Reminds me simultaneously Eador, King's Bounty and Darkest Dungeon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game, easy to get into, fun to gamble and play with RNG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the first game on play station when it was free game of the month. as soon as i seen this game came  out i bought it for me and my two closest friends and we have played it constantly with it being the best \"DnD-esk\" rougelike game ive ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game play is good, art and graphics are great.  I like being able to set game parameters .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game a lot and I'm very impressed with the amount of new content that's being added to it. The balancing in the new(er) DLCs feels a bit off but I can tell that the team is active and patching constantly so it probably isn't something that will last. I wish I could keep a pet alive for longer than 5 turns.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, imaginative, and a great game to relax and play with a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun, wish there were more tooltips to make it easier to understand damage combos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great adventure games with friend and great solo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Usually not a huge fan of turn based games but this game/series really gives me a new love for them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's this tendency for games to not have working in-game chats:\n- Chat is blank when opened, even if there are existing messages. You have to scroll to see the existing messages.\n- Chat keeps minimizing itself.\n- Everything locks when you enter chat, including camera momentum. Why? Locking keyboard hotkeys makes sense but why everything else?\n- Chat exits text box while things happen for other players, even in the middle of typing (I have to re-enter the chat box several times to type a single sentence). So the chat has now entered a new unique state where it's visible but not usable.\n- Chat locks up if you type too many characters. You can no longer use the chat unless you restart the game.\n- And if you enter even more characters, the game freezes completely. An unlikely scenario, but it feels like this should have been tested more for a $33 game (it's fine on sale)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so good my wife told me to stop playing because i stop existing while playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well, yeah, its kindof the same as first chapter but it feels fresh\nand still replayable as much as first game\npeople say its buggy and things like that but I have not experienced any of those",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has given more joy then the money I could have spent else where. Good times and fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a great time with FTK1 & FTK2. Not sure about the hate that was put on this game at its launch.  Best that I can tell, the argument against it was \"the only things it improved above the first game were UI, balance, amount of content, number of playable characters, MP stability, loadout choices, and classes\".  That is more than the developers were given credit for! Maybe it could have been an update to FTK1, but its better in every way than FTK1, and is therefore a great sequel.  As it stands now, a great game! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Besides a rough launch its the same formula soon to reach the heights of the first game. With time we'll see it meet or beat our expectations!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worthy sequel, very fun to play with a buddy. This game lets you pick four characters which means my friend and I can each take two",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun rougelike rpg with 4 player multiplayer and a neat board game aesthetic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It s good enough for the price + the devs are still supporting it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent improvement from the first game! The expansion of mechanics such as the grid based combat, companions, and 4th party members warrent this being a sequel. The only main issue I have after several runs is the UI still isnt fluid and easy to manipulate. So many button presses to tag items for selling/transfer which only got worse with an extra party member. If there was a \"tag all\" function for a given item tab that would be great. Overall a fun experience with alot of rng and thinking to succeed in. Probably not as worth it at full price, but on sale this is game worth trying out if the genre appeals to you. The free weekend really helped to solidify my purchase will all the extra time to experience what game has to offer. I doubt the 2hr refund window would be enough to see if the game clicks for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really solid. I've never played the first game; I'm just a fan or roguelike/lite and RPGs. It does have some weirdness to it. Learning the mechanics takes some time if you're coming from DnD or other more traditional RPGs. That said when you get it, it clicks well and becomes very fun. My only gripe about it is the way it handles attacks. So to attack your character has to make X number of rolls related to one of their stats and you can spend focus to guarantee rolls. So you spend your focus or get lucky/have high stats to make that perfect roll and oh enemy dodged it. This makes no sense to me coming from a DnD perspective. A perfect roll should mean I not only performed my attack really well but actually landed it, other wise what's the point? If the enemies evasion is good that should make it harder for me to land my rolls rather that a perfect roll going to waste at least for me. That said, other than that personal gripe, I'm very into the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the first one briefly; Came in fresh after many years to the second instalment thanks to the free week that just occurred. Have enjoyed my time through to the 3rd campaign mission and purchased to continue on to see what else there is. Thoroughly enjoying my time and recommend this game to those that enjoy both Tactical RPGs and Tabletop RPGs. Yet to try out the new DLC, but eager to. Have heard that some of the community prefer the first iteration of this series, so maybe try that one first - they are adding new content to this one more so though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hits the perfect spot of being appealing to both new and experienced players.\nGreat game to unwind and play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The UX is particularly not great, and so many design decisions seems to obfuscate clarity on purpose? But it turns out its just bad UX designers.\n\nSuper duper grindy unlock system. You get lore books in-game to unlock literal classes, items, traits, etc. \n\nThis is super dumb, and super slow. What you start with is like a single hand of cards in a deck of 52 of them - and you get no card draw, which you cant touch until you play, and then maybe you can buy 1 or 2 unlocks after a campaign or 2.\n\nThat aside, the game is solid. Great fun for 1-4 people. You can manage who plays who in a session and also re-map it later, if you need to change your real life players but continue the same campaign =)\n\nJust huge con: the predatory unlock and dlc system. if you can play without engaging or caring about this, you will do fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really great game simulating Dungeons and Dragons lite",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Admittedly I did not give this game a fair shot when I first played it. However, after playing the first part of the campaign with my good friend, it turned out to be extremely fun and charming. This game feels like Torchlight and Gloomhaven had a baby. Would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only game casually but I loved the first For The King, and I thought this was a solid sequel. It expands the game (more characters, more mechanics) but also manages to be more beginner-friendly with a good tutorial and a campaign mode that's split into several shorter but still satisfying chunks.\n\nThere are also things I didn't like though. I feel like there may be too many characters now with nothing particularly new to offer, and this version of the game somehow feels slower (perhaps because there's 4 characters?). With these new additions, the game gives you new things to take in and learn to play with, but it may also be a little bogged down by all this. The more minimalist original was lightning in a bottle.\n\nI hear the game had a buggy release and that put a lot of people off but I can recommend the version I played. I may not find it amazing like the first one, but it may actually be a good way into the franchise, and I definitely also recommend it if you're a fan of the original. This sequel really gives you that sense of revisiting an old friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty solid game. gameplay is fun, you just have to read a bit. otherwise you're gonna try and stun an enemy that is immune to stun... might have done that more than once... \n\nendless mode is honestly more fun than the other campaigns. 9/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game that took a lot of inspiration from it's predecessor and made it more forgiving and scalable for those who want a lot of difficulty, while not giving up core parts of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good multiplayer game for four people, the ragdoll physics are hilarious.  Not a fan of the original campaign where you have to start over every single part of it but there's a lot of interesting combos to love, and they keep adding new classes and mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game very fun but very laggy for my broke pc friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I pre-ordered it way back when it first released and it was a buggy mess back then, safe to say it has improved a lot since then and has actually become a fun an unique experience to play. I like the changed meta-progression and the new combat system as opposed to ftk1 took some getting used to but i do enjoy the new dimension it brings.\nIt does still have some bugs, at least when run on a linux system. These don't make the game unplayable if you just don't trigger the bugs, but they are annoying and I would like to see them fixed,\nSo far I've ecnountered two:\n1. you cannot alt-tab into a different tab because then the visuals of the game will freeze and you'll have to restart the game\n2. if you click on a textbox with your mouse your mouse will disappear and if you want your cursor back you'll need to restart the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming from someone who really enjoyed FTK 1, this is a solid game. The overall reviews aren’t great because the game launched in a rough state, but the devs have clearly put in the work and introduced a lot of meaningful improvements. If you liked For The King 1, the current state of this game will definitely intrigue you.\n\nThe main gameplay remains very familiar, but the combat improvements have genuinely won my heart. The addition of tiles, the extra row, and the ability to reposition your character during combat add a whole new layer of strategy and give you far more control over battle outcomes. Fights also feel much less RNG-dependent now. Plus, the addition of pets and companions is a very welcome touch.\n\nHowever, the UI is not that great and definitely needs work. I’m confident the devs will polish it up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay was greatly improved, \nGraphics and design were greatly improved,\nPlayer Agency was greatly improved, game is less based on RNG,\nMultiplayer and Progression Systems were greatly improved,\n\n10/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the combat is a big improvement over the first one. \n\nbut holy moly does the UI sucks fucking ass. in multiplayer it keeps opening the inventory of whoever is currently taking a turn, when you inspect an item in someone's inventory it compares to the items THEY are wearing, not yours. the inventory window keeps closing all the time whenever anyone does anything, same with shop windows. these are my the major gripes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun game with friends. I would say, though they need to make the UI better, a lot of things feel clunky and difficult to use. Example: when selecting an attack, you can use focus to make it have a better chance of hitting. However, you need to click or select the attack, since just hovering will make you stay to the default action, which is usually the basic attack, while it wouldn't be too bad most of the time, my friends and I had some issues where the focus and attack plan got derailed by the fact the attack we wanted didn't get selected correctly. Another issue we faced was that we found the UI both too small and cluttered, as it made things that were important for continuing the campaign very hard to see or not important things took up way too much space. As well as the camera angle is usually pretty bad, so it makes the fights just unpleasant to look at. In conclusion, the game is great fun. If you liked the first one, you'll most likely enjoy this one, but the problems with the UI can get annoying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a lot of fun with friends. I bought the entire game and all DLCs and have yet to get past the starting game yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best doomroller to this date. The rougelike mode is now sadly not possible to extend forever aka win as in part 1. But there are lots of new interesting characters and items. There is pets as well now. My personal favorite is the Shepherd on Vitality. However the alcoholic monk is best on both INT and VIT as of now.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I purchased this game near the release date.  It was a little clunky and the UI was a little different.  But.. figured I'd return one day after some patches and when I had an itch to play FOK.  Well I got the itch back.. booted up FOK2 and its a good time!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Honestly I don't get the hate, yes it is not as good as FTK1, but it is still fun. I actually like the story and how the devs made it in a chronological order, also the addition of pets is kinda of a cheat code. I believe FTK2 is fun on its own, people need to stop comparing things.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "You can ignore the bad reviews. The devs have already addressed the ones that actually have valid critiques. I literally read one review that was poor because the player couldn't beat one of the bosses. For crying out loud, your bland, callous, and disinterested lack of awareness does nothing but harm.\n\nI only ever played single player, but completed all campaigns and unlocked everything from the lore store. I cannot attest to the multiplayer. in my eyes everything has been approved upon from the first one. More Skills, another party member, more types of encounters, and new enemies.\n\nI love this sequel and its killing me that the reviews for this really well put together game are mixed. It is getting bashed for negligible reasons imo. Its a fully developed turn based strategy RPG for $25 that has added on to its original product in variety, strategy, and length.\n\nIf you're complaining about cost, $25 USD for a fully developed game without game breaking bugs is literally the standard we should hope for. If you're complaining about difficulty, they literally allow you to adjust the difficulty like nearly every game ever.\n\nHere's a developer that engages with the community, finishes their games before launch, and addresses concerns and criticisms. If you love games at all you should be cheering on this developer and not bashing the hell out of it because it doesn't fit you're hyper-specific niche requirements for every game to have.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "Great turn-based co-op to play with friends. My partner and I are having a blast, and the pets addition is great! Highly recommend for group play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a lot of fun with friends. Highly recommend if you've got nerdy friends who just want to chill.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "rocky start that def pizzed me off but its all good now and a great game just like the first one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very cool game, I don’t understand the negative comments.\nI only dislike some camera angles, but that’s OK.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Las traducciones en español siguen igual 10/10. Tambien muy buen agregado ser 4 jugadores y que te puedas enfrentar hasta 8 enemigos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Buen juego. Mejor que el 1. Más balanceado y más contenido.\r\n\r\nEl unico punto negativo que le daria es que la interfaz y menus al igual que en el 1er juego podrian estar mucho mejor.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game play in line with the previous game with an upgrade.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wordy tutorial TLDR\nnot my type...of background music, sorry~\n\nthanks for the free weekend to try it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think for the king 2 greatly expands on the first game in many ways, most ways good, but occassionally I still find the same frustrations here and there. I enjoy playing on the medium difficulty, I think the game gives not only a huge challenge, but also it remains flexible enough that you do need to pay attention to your moves and actions to find success in a run. \n\nI enjoy that there seems to be a larger story role over arching in this game, the campaigns are slightly shorter than the first, which is great, the games UI seems a tad more flushed out and easier to work with. Some hiccups are still there but its much easier to navigate on mouse and keyboard for sure. \n\nMy biggest frustration is the hardest difficulty, it cripples you so much right from the start, but for a game thats based on chance rolls, it can become hugely frustrating when it almost seems unfair at times. \n\nAside from that I would recommend its pretty solid, if you enjoyed the first, this one you will most likely love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great to see the labour of love and the latest updates adding content.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For The King 2 strikes a great balance between the freedom of a D&D campaign and the feeling of a Dungeon Master who really, really doesn’t want the party to go off-script. It can be punishing sometimes a “learning opportunity” costs you the entire run. Overall the difficulty curve feels fair once you understand how the systems fit together.\r\n\r\nFor your first few adventures, I strongly recommend sticking to the Apprentice difficulty. It gives you room to experiment without instantly getting wiped for every mistake. Once you’ve grasped the mechanics and the flow of encounters, you can confidently move on to the tougher campaigns.\r\n\r\nThe replay value is fantastic... which is good, because every time you bring in a new friend, they’ll inevitably want to start from the beginning so everyone’s on the same page. Thankfully, the game’s design makes those do-overs feel fresh rather than tedious. The game keeps the same broad strokes and quests each run, but the constantly changing maps and unpredictable encounters ensure every campaign still feels unique.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is good. my only complaint is that it is narratively jarring that the campaign makes you change characters several times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gekoppt & als gut befunden, vor allem mit den Homies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game gave me good loot and gear. Even if I was not in a fight. It gave to my friends so they could give to me. I am satisfied and had good gear for end game. \n\nOtherwise, pretty fun with friends :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rough around the edges.  Swingy.  Amusing with friends, but can get old VERY quickly.  The UI Is a bit of a pain when playing in multiplayer.  There's a lot of content here, though, and a good sense of fun at times.\n\nYMMV.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay and Strategy\nMany reviewers praise \"For the King II\" for refining turn-based roguelike mechanics, offering deep tactical combat, new quest types, and supporting up to four players in co-op mode. The procedurally generated worlds and the addictive gameplay loop have kept fans returning for more, with challenging battles that require strategic use of resources and planning.\n\nCritic and User Ratings\nThe game has averaged a score close to 78 from critics, with most reviews marked as \"Mostly Positive\" on Steam, reflecting fan enjoyment. Some call it a near-perfect sequel, especially for groups of friends playing together, and appreciate that bugs are gradually being fixed.\n\nDesign, Controls, and Bugs\nHowever, enthusiasm is tempered by criticisms: the game’s controller support is described as buggy and poorly tested, leading to user frustration especially for those coming from the first game. Issues include difficulty navigating menus, camera angles that detract from combat enjoyment, occasional freezes, and lack of clear information about abilities and mechanics. These problems are compounded for solo players or those expecting smooth local co-op like the original.\n\nChallenge and Accessibility\nDifficulty is a constant theme, with some players finding the punishing mechanics rewarding, while others struggle and attribute negative feedback to steep learning curves and lack of robust tutorials. When played online, bugs may interrupt gameplay, but the community generally agrees balancing and the core gameplay loop are strong, once the controls are mastered.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game playing with friends, same as first game but with new mechanics.\n\nPlease, who can give me a key for this game 🔑🙏😉?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay this seems like cheap copy of HOMAM but probably for kinder garten kids.\nI am too old grandpa for this click and wait chinese copy.\n\nBut maybe one time i will returng and make good game play on this.\n\nI CAN RECOMMEND TO MY GRANDMA BUT NOT MY FRIEND.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I very love this game but please add more maps or map generator.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i liked most of the changes, even if some of them feel weird\nthe only thing i truly dislike is the chapter focused story, as opposed to a normal campaign with the same heroes doing the same stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually finished a fucking run in this one which, hasn't happened in the first one yet so I'm absolutely giving this one a thumb's up. XD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bear witness that there is no God but Allah, and Muhammad is the messenger of Allah.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Much better than the first and the first was good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wish the rolls were better sense wise but other than that its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game. only thing disturbing me is the split story. in my opinion better than FTK1 even.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is so much fun to sit down for hours and just mindlessly play after learning the mechanics and tricks. I have definitely played this more than the average person should play a game but I have no regrets and still play it frequently. Highly recommend to anyone who loves fantasy and turn based combat!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun maps. combat is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is easy enough for most people and has enough strategy to keep most experienced player interested.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, had fun with my friends. I played the first one and I think this one is better with many new improvements along with more to do. I would recommend you try it while it's free and buy it on sale!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you want Co-op based TBS game, this is it. A wonderful sequel following FTK1. Really enjoyed all of the content. The addition of Combat rows and the ability to have four toons so you and a friend  can both play two classes is awesome. Pets were also much more fun than i anticipated. They keep releasing free content for the normal title even while launching DLC. Finally the ability to play with console friends and if i own all DLC my friends can enjoy it. 10/10 worth every penny.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is honestly a lot of fun online with friends, but I enjoyed it a lot more just playing some couch co-op with my fiance. The mechanics seems daunting at first when you get bombarded with the tutorial tooltips but after a few rounds of exploring/combat, you get the gist of everything. It is a slow paced game, so for those who are looking for non-stop action; you will not find it here. This runs like a TTRPG, which is a huge plus for me since I am a HUGE nerd lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, I play with my kids they enjoy making their own character and playing with me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a more well rounded and complete version of the first games, good new classes, good new combat system, some UI and server issues remain from launch but still a very fun game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the game a lot. It is a new feeling to FTK1 and it takes some getting used to at first, but it is Refreshing to have 6 times the content than FTK1. FTK1 had the length of one campaign of FTK2. Easily one of my favorite Roughe-likes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very rarely is a sequel game better than the first but this one managed to do it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A lot of fun to be had with friends on multiplayer!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you liked the first one, you'll like this one too. Fun game to play with a friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down the best roguelite tabletop RPG out there, get it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Lots of fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun to play with friends, highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I woulda never tried it if it wasnt free for a week. Def gonna pick this one up.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "recommended for turn based combat players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its one of the best co-op game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "magic missile magic missile magic missile",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. i played it for 10 hours straight when it first release.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I can't actually believe how bad this UI is. The game itself is pretty fun (more of the same from the first really), but the UI makes it such a drag to do anything or find things out (look at BG3 devs, you can pull up tool tips on literally anything via a click of a button. Chance to inflict RANDOM SYMBOL, and also not explain the effect, is a choice). \r\n\r\nIt's just honestly embaressing that a team of developers made this UI, tested it and thought 'yeah, this is really good'. It ruins the actual fun game hiding behind this interface.\r\n\r\nObligatory - \"I don't normally write reviews but\"... but this UI is so grating that it's inspiring me to do try and actively convince others (for their own sanity) to not play this game because no one should have to subject themselves to this war crime of a UI.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Basically very little changes compared to the first game. And all the changes made are terrible. The game has one of the worst UI I've ever seen, it's buggy as fuck, the pace of a game is abusively slow, and multiplayer is HORRIBLE with lots of de-sync. One of the first time in my life that I consider the devs ripped me off.",
      "voted_up": false,
      "votes_helpful": 75
    },
    {
      "review": "Gave it a shot during the free weekend. Found it to be incredibly confusing and absolute sensory overload with how much information it immediately hits you with. It has all of the elements of TTRPGs, but lacks the elements that make those kinds of games fun. It's just a bunch of numbers you have to keep track of and a bunch of clunky UIs that are hard to keep track of. If you're a fan of turn-based RPGs, this is not that. If you're a fan of TTRPGs, this is not that. If you're a fan of roguelikes, this is not that. It's a fine game to try, but if you really want a game like this, just buy the first one. It's at least a little easier to consume.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Liked FTK, started a game with my friends during free week, we each saw different things on the map, and first battle didn't pull everyone even though they were in the fight, their character was still in the over world. Label it early access ya dopes.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "buy first ftk on discount and don't even bother trying this one it's awful comparing to the first game. worse ui, worse fps, worse graphics(immo), unintuitive ui whatsoever",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I want to like this game. I've tolerated some bad UIs, but this one is baffling. Like, I get that some of it is that I'm playing single player, and the UI was clearly built with multiplayer as the priority. Outside of that, I spend way to much time looking at items. It's a lot of comparing differences that feel like they don't matter. When comparing, it only shows the stat for the new item, not the one that's currently equipped, so if it comes up in loot, you have to distribute all the loot, remember that there was an item you needed to check, open the inventory menu (which is 2 button presses for some reason), navigate to the correct character, go into the information tab to look up both the relevant stats, then compare the item. Every action in this game feels like this, and it's just exhausting after a while.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Tried out the free trial after playing through the first game's campaign with some friends with online co-op. The game is buggy, for example I was seeing a Bronze Statue my friends could not see on their clients, and they could see mobs that I was unable to see. They started a battle with one of the mobs but on my screen I was still in the overworld, so when my turn came up in battle the game pretty much froze with me being unable to take control. Also if you have a multi monitor setup and want to scroll the overworld to the left/right your mouse cursor will exit the game leaving you unable to. I can't believe this isn't Early Access.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A game for people that really enjoy closing textboxes. Why introduce gameplay elements over time to a new player when you can dump everything on a new player at once and totally ruin the flow of the game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Really enjoyed the first FTK and wanted to play this one during the free week. The UI is so ugly and looks like its still an early version. Too much text everywhere and lost a lot of the charm that made the first one so fun.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "7/10. Maybe i'll revisit this game another day, but I'm 3 months sober and this game makes me want to relapse.\n\nIt's a fun game to play for a few hours but nothing more than that. If you and your friends are bored and have nothing else to do... then maybe, JUST MAYBE, might this game be worth it. \n\nTired of playing first person shooters? Understandable. Can't justify buying an expensive RPGs? We've all been there. So go ahead, buy it on sale, pay $10 dollars and get your money's worth with dollar-an-hour gameplay (because trust me, you wont get past 10 hours in this game without wanting to rip your head off). Just don't forget to save your character customization -- because losing progress after completing a chapter isn't for the faint of heart.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Hi,\r\nDespite the bad reviews, I thought I’d give this game a try, as I truly loved For The King 1.\r\n\r\nUnfortunately, this feels like a shadow of the original—a truly disappointing experience. After defeating the Bandit King, all of my characters suddenly reset in front of me so I could “move on” and start over. It was genuinely jaw-dropping to see all my progress wiped. And it wasn’t even a significant boss encounter; this boss was barely a nuisance in the first game. I honestly have no words.\r\n\r\nI would not recommend this to anyone. The negative reviews are completely justified. Truly shocking, and I will not be continuing. \r\n\r\nGood luck.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really loved the first game, but the second one looks really bad, and game itself annoys me from the beginning. I do not recommend it, and I doubt it's worth the time for anyone in 2025.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I liked FTK 1, but honestly, the 1,000,000 tutorials and disgusting UI made this very unpleasant. Would rather go back and play 1 again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Buy FTK 1, much more fun imo. Was really hype to play the second one after putting 500+ hours into the first one but the fact the campaign is so split up was a deal breaker from the get-go. Not to mention the UI being worse than FTK 1.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Writing having briefly played during the free weekend, so read this as my first impressions from someone who loves FtK1.\n\nFTK1 to FTK2 is a textbook example of the importance of visual clarity and UI design to gameplay experience. I can only speak for me and my FTK cohort, but we were baffled by a UX that is best summed up as annoying.\n\nThe changes to combat are interesting. The system has more room for depth and decision making than the first game, and some may greatly prefer the new system. In multiplayer, we found these changes a slog as the bloated initiative tracker, combined with the cluttered UI slowing us down, had us begging for combats to end. To put it simply, it was too much of a departure from the simple and snappy combat that we loved from the first game.\n\nPerhaps we are just getting old and are too stubborn, but by the end of the night we were back in FtK1 laughing and having fun.\n\nAll that is to say, when it comes to For The King, less is more.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring, bad graphics, slow. Cannot understand why characters in a party move in the world seperately...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The rougelite progression isn't satisfying, they seemed open to adding a non rougelite mode at one point but it hasn't manifested. Even if the game play is satisfying the progression is tedious and slow.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played the free trial for 30mins.  I'm sure it's fine for it's intended audience, but the UI and controls could use some polish.  A couple of undoable mistakes where the game did something I didn't want it to turned me off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Free weekend experience - FTK 1 was cumbersome to navigate but sufferable yet not enough to play a substantial amount; I might revisit later. This game is insufferable with pacing and I could not not even get past the tutorial. The tutorial tells you where the health is and treats you like an infant. That is fine to be more wide reaching and the oh-so-overused-and-tedious \"accessibility\" but feels like it's trying to make money on inviting new audiences rather than creating a fun game for the most likely player. I wish we could return to the days when games were made by gamers to be fun rather than being a medium to chase the dream of owning mansions and lambos. Oh, there's microtransactions everywhere.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I had a mostly good time with for the king 1, and so I got this game hoping it would smooth out the aspects that I thought were not so great, and at first it looked promising. All of the new systems they add give a lot more to strategize around, and that's good, but there are so many little anti fun speed-bumps throughout this game that culminate into many things feeling like a chore. Moving all of your charachters around on the map often feels miserable unless you are spamming your focus to get that one extra tile of distance you need, managing all of the inventories, positions, and skills of your four different characters results in a slog unless you waste all of your gold on a vehicle instead of scaling your party,  and every single level starts with hours of slogging through samey grindy fights until you can actually get enough gear that your party feels like it isn't constantly fucking up every roll. I know plenty of people like this kind of grindy experience where you have to sink multiple minimum 3 or 4 hour attempts into a mission before they can continue, but not for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1) Less fun than the first game\n2) Uglier than the first game\n3) Stolen Realm is what this game should have been\n\nI would refund this dog water if I didn't waste so many hours on trying to find even the slightest speckle of enjoyment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly I cannot recommend this game in its current state. For a game with hours-long sessions, it simply has too many bugs, and too many balance issues to be as enjoyable as the first game. I would love to change my review to positive once these bugs (whiffing on perfect rolls, mead not protecting etc) are sorted, and some of the difficulty scaling is reduced. It's not enjoyable to have to farm gold early game while you are on a 5 health timer and feel too rushed to even explore the map. Also nerf royal droll",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game crashed, then it hijacked my pc and wouldn't let me close it.\r\nUnity slop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lets see, where do i begin with this game. garbage ui, Very Hot garbage UI. It just gives me eye cancer looking at it. And I cannot count how many times, I misclicked because of how confusing/tiny the ui and the lack of tooltips . If this was a thing that was set by the developers by default, why I ask you? why?  It is also notmade clear what areas  are affected by aoe atks, you just have to guess or memorize the pattern formation from playing. Noway to even check of status affects of what your weapons can dish out because apparently mouse-over tool tips are not supported even for the king 1 had this. :BIgFacepalm:. I actually had to look up the for the king wiki for that. Highly unintuitive. The ping system is also ass, i dont know how they made it worse in for the king 2 but it is.  And this may not be a big deal to most, but why does mouse cursor while out of the application also move in-game too? There were many times when i was alt tabbed to tab back in to the game auto-scrolling away because my cursor was to the edge. And Its so fucking annoying when during someone elses turn i cant even inspect my items info without the screen interrupting, Say also youre browsing the map because youre waiting for your party tonish taking their turn, nope! cant do that! every action your member does, like move or roll on the map, auto forces your camera to center on that member every time.  This is such a brain dead feature. Who even developed this? Sorry devs, but this is a hot dog water game compared to the first.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want a For the King game, I'd recommend the first one. This one just has way smaller item variety, especially for late game. And no \"Bronze\" vs \"Silver\" is not different items... The new row mechanic and everything is amazing, I wish they had brought the variety from the first game for it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like it, In many ways I do. But the UI is frustrating, no stats when you float over characters etc. There is some tactical play with RNG, but the part I like the least is the pure gambling encounters. They can ruin a good run, and there's no reload to forgive brutal RNG rolls. I guess this is the game they wanted to make and they made it, but the gameplay just isn't for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't usually leave reviews, however I played the demo and was really excited by my first impression.  The gameplay has the potential to be really fun, however it falls short in game pacing and the <3 economy is frustratingly punishing to replenish.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "seems sloppily made, especially with one of the tutorial texts being \"Combat: TUTORIAL_COMBAT_INTRO_2\"\n\nthe tutorials annoyingly tell me everything i (and other people who play video games) already know, and explain nothing of all the confusing other parts of the game (e.g. the ui)\n\nthe ui is bad. in battle, at the bottom left, you see all of the characters' health and and stats. on the actual character models in the middle of the screen, you see their health, again. and on the bottom middle of the screen, you see that same health-and-stats of the current (turn) character. redundancies galore!!!\nand as well as seeing enemies' health and debuffs on their characters in the middle of the screen, you sometimes(????) see it on the top right of the screen, too??\n\nalso, to add to the confusing tutorial stuff: after i was thrown into the world, i immediately got a popup explaining how to refund 'focus,' when i never got a popup telling me what 'focus' was... ok, i can refund it, woo, what in the world does that do\n\nand there is so much screen tearing when i move up and down in the world!!! there's no vsync setting and no info online for this game so i have no idea how to fix it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "instantly encountered a bug during the first combat encounter with friends. Also whoever was in charge of designing the UI needs to find a new job, it really makes the game 100% less appealing and super overwhelming especially when you're thinking about the first game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There might be a good game in here, but the UI feels significantly clunkier than unanimated 2D tiles.  Not worth the struggle.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really like this game, lots of fun!\nUpdated: still like the game for the most part, But, and it's a Big But, there are some mechanics in the game here and there, that feel Very CHEAP and Cheaty even!!! for instance, during chapter 5 i had a full party, all 4 characters and each had a pet, that i had put much work into, then the hangman scourge shows up, his base is WAY across the map from me so no chance of stopping him from showing up, and he curses the party with a ghost follower, didn't seem to do anything, but then i noticed! the ghost follower moves from party member to party member each turn and dismisses your followers / pets! no chance to protect your pets, no chance to fight for them, no chance to roll or any thing! all that hard work just GONE!! \nDeveloper, what kind of CHEAP, CHEATING, SCUMMY, tactic is this shit?!?!?\nThis may keep me from supporting or even playing this \"game\" anymore!!!\nWill Not Recommend until this crap is sorted out!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically the same game as the first one with a different story to follow. Gameplay seems a lot more confusing too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is. Review for Free trial game provided by Publisher team and would like to thank for that as well.\n\nGame is very very complicated with lots of tutorial in every aspects of the game, however I am familiar with turn based games but this one is VERY VERY EXTREMELY SLOW PACE game, so for me this game is not even worth on sale $6.79 price, it should have been around $3 dollar game only, not clear how many campaigns are they I have just played for like 10 minutes and got instantly bored.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Man, this game sucks a lot! Never got so angry with bad UI as in this game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed FTK 1, and put 80+ hours in playing a few hours every Friday with a couple of friends. This sequel feels like a real downgrade in comparison. The classes feel less fun, and the combat system is not fun at all. I'm not sure what inspired the move to a grid based combat, with front line and back line, but it's probably the thing I dislike most about this game. Also, the 3 player co-op, but 4 character party is a design choice that is pretty terrible in my opinion. My guess is the data from FTK1 showed a lot of duos playing with one person controlling 2 characters, and someone had a genius idea to just make it 4 so the duos each played two??? That, or the grid combat just played that much worse with only 3 characters.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have never played a game with such a frustating introduction tutorial. It throws at you a million mechanics, at once, like why the F should I pick starting items for my team, based on which knowledge? How do I even know which team composition to pick? This needs come come LAAATEEERRR, start first with one dude with a hammer. PERIOD. Then make it more complicated. Then also in the map navigation it gets more confusing, no clue of how the F to get the characters to move, when I use Right Click it seems to consume something to move more, it is not clean that characters move separately, also there is a super short animation with some rolls for movement speed that are not clean at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have never played a game with such a frustating introduction tutorial. It throws at you a million mechanics, at once, like why the F should I pick starting items for my team, based on which knowledge? How do I even know which team composition to pick? This needs come come LAAATEEERRR, start first with one dude with a hammer. PERIOD. Then make it more complicated. Then also in the map navigation it gets more confusing, no clue of how the F to get the characters to move, when I use Right Click it seems to consume something to move more, it is not clean that characters move separately, also there is a super short animation with some rolls for movement speed that are not clean at all.\nSuper frustrating as F....",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hello people! The game feels like a skirmish after you finished the Campaign , I mean I had to make decisions in the beginning that one does after playing for some hours. The graphics are not for a game in 2025 sorry to say , I've mobile games with better graphics . You move the characters separately and it counts as a round for every character . Why? The combat is like wtf, first fight on easy dead all 4 characters . For me it looks more like a mobile game and very annoying .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game seems good like the first but server keeps disconnecting every literal 5 miniutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after second chapter game crash. what a mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how did they take a masterpiece in for the king 1, and they ruined it so much to point it is one the worst games ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is going to be my first negative review here but I think after 35 hours I can safely say it's not based on first impressions. Now, the experience might be different for someone who only encounters For the King through this second version of it, it's a decent game and if there was a middle option between yes and no that's where I'd put it. Maybe I'd love it if I hadn't played the original. I am however a veteran player - For the King was pretty much the first game I ever played and I've played a lot of it - and For the King II undoubtedly pales in comparison in my opinion.\n\nFirst some good things: I quite like the idea of the new fight mechanics that in theory make your and the enemy's placement more important. In practice so far in my games it doesn't matter nearly enough for me to have to strategize around it except on a very basic level - enemies in a tight group good for bomb or mage stand behind shield bearer. And I don't play on the easiest difficulty. Row and column attacks and so on are nice though! Also I love the pets! Wanting to keep them alive has so far been the only truly motivating and difficult thing for me as you have to think mid-battle about how to place yourself to be able to heal them or keep them safe when their health falls low. There's a few comfort of life changes I appreciate as well.\n\nOther than that I am mostly unsatisfied though. It uses largely the same exact enemies and bosses as the first game so I am rarely surprised and it feels very much like the same game except more 3D in style and with a few extra characters and mechanics dropped in. The progress feels faster which might be fun for some players but for me takes away the challenge of those early rounds where you are weak and squishy and every upgrade you get is exciting - it feels like you get too strong too fast and if my character has died it's been because the ease of it made me lazy and I stopped thinking and did something stupid. And I repeat, I don't play in easy mode! Even though there's visually more noise and seem to be more choices you have to click on, I spend so many fights just hitting the same button on repeat and winning which annoys me more in this case than the first game since it looks more complex but it's rarely necessary to interact with all the options. I guess that's my FTK experience speaking, I saw some other people in negative reviews say it's too punishing - for me it's been the opposite. Not that I'd prefer it to be punishing, but I'd like for decisions to feel more important. Also after a while there's simply nothing more to upgrade or improve on which happened in the original too but I feel like maybe not so fast. Also why cap at 9 levels?\n\nThe challenge mode (Hildebrant's cellar vs Dark Carnival) suffers under the same issue: the characters start out stronger right away, facing stronger enemies, but instead of being more challenging, it's easier. You never get the weakling with a stick phase, and upgrade/level pretty fast into \"none of these enemies scare me at all except if some stupid coincidences overlap and they one-hit me\" and then the enemies just repeat and repeat and repeat with not much change. In Hildebrant's cellar going deeper felt meaningful until you hit a plateau deep enough down, I enjoyed starting it again even if I'd played it a lot already, because the starting position could influence your entire build. In Dark Carnival after you get the hang of it and kit out your characters a bit it's all the same all the way down. At least we didn't encounter anything new in 30 floors or so. We did die eventually but it didn't feel like the result of a challenge, as it didn't really get more difficult, just cut off your healing opportunities and gave the enemies +x amount of health, which I don't find interesting. Just the same fight but longer.\n\nIt very much has the \"second game syndrome\" of making me ask was it really necessary after the first good game to make the same game again? And unlike some where the second game is same but even better or same but more, I don't feel either better or more. I'll keep playing and maybe as the storylines progress something new pops up but so far it just makes me want to play the original again except I've done everything it's possible to do there. It's not like bad bad or anything and whatever bugs there were when it launched seem to be fixed, it's just... fine, i guess?\n\nI think the changes might be geared towards new players who might appreciate getting stronger faster as they're figuring out the game mechanics. Perhaps people craved a faster-paced adventure? Though it's probably not as fast for a beginner. When you already know how everything works (almost the exact same way as the first game) and have seen all the main bosses and encounters and so on you just kinda go why? Did the original game's code break so you can't update it? Did you have to switch programs so you decided to redo it with minimal changes? I do of course still wish all the best to the team :)\n\nI hope as I progress and they add new content things improve for me but I'm not sure how much longer I can keep going before getting too bored and/or annoyed to continue.\n\nPS: all the female body types are so... idk how to say it. Like there's Big Lady and Small Lady but their faces and hairdo look so similar and so nothing compared to the different types of men. I've had to be playing all bearded dudes just because none of the ladies look like a human being. Not from a beauty point of view, rather the opposite. Wish there was a \"what if no gender\" option as well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't really see many changes from the first game.\nbetter off with buying the first one and save your money for the same experience",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Compared to the first there are improvements in the visual deparment, maybe the combat depth, and the might have fixed all the bugs for all i care; what i didnt see mentioned is just how much of a slog this game is to play. Going from 3 to 4 players just means you have to wait even more for your turn and my zoomer brains dont handle it well. I get the turn based combat, but map movement shouldve been speed up by allowing all to move freely, not turn restricted. If that were a thing I might give this another go, but without it the first one is actually better because less players means less downtime between the oh-so-exciting click of where you get to move. Same issue with the combat; more enemies just means its more of a slog to get through each fight and more chances for the enemies to hand your ass to you with bad rng.\n\nThe UI looks nicer but is still plagued by illogical decisions constantly raising questions like 'why is the shop a listview instead of gridview with images?', 'Why is this button so small', 'Where the heck do i gotta click to make it go forward'\nAlso no skip tutorial button",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy, and straight up worse then the first game.\nSad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Костыль на костыле, разрабу в очко ещё костыль. Даже через впн не запускается, тогда хоть убюерите из магазина её.\n\nСпасибо)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played on a free week end... the game is just bad.\n\nNothing makes sense and nothing is explained properly.\n\nYou have stuff to do which you can do... and when you do it it does nothing.\n\nYou get trait and stuff that do stuff except you're never told what they do.\n\n\nThe gameplay is also just bad, and everything is so slow.\n\nThe game just feels unfinished, yet it's been out for 2 years!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The UI is pretty bad. So many times I want to open my inventory (like when we're getting loot after a battle) and I can't. There are many small things like it. It just doesn't hold my interest. It looked promising though! And good on the team for continuing to make so many content updates. It's not all doom and gloom.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "UI in this game, doubly so for controller players it shockingly bad and frustrating to use and navigate around. For instance your character has multiple moves they can choose from a list, multiple enemies they can target, and a special resource called focus to increase hit chance. Every time you start a round your character targets the first enemy by default, and your 1st move is selected. (nothing wrong with this). Now, lets say you select the 3rd enemy, and your 2nd move, and you use 2 focus. \n\nwell here's what happens. first, the moment you use focus your players move menu will shrink down to just icons so you can no longer read it. There is absolutely no reason for this since it's not like it's making room for any other ui elements. Once the menu is hidden like this it's not clear what move you have selected, making it easy to get into situations where your questioning, \"wait did i apply focus before selecting my move?\". Well at least you can hit the back button to unhide the menu again. Except be careful because doing so will change your move selection back to your first move. But even more infuriating, is the second you clicked a to use your ability, it will change the selection back to the first enemy, remove your focus, but keep the 2nd move selected. So now you need to remember to re select the correct enemy a second time and re apply you'r 2 focus in order to complete your move. This make it extremely easy to accidently target the wrong enemy, or fail to apply focus. This is made worse by the fact that focus is a rare resource often used in important life or death situations. The number of times I've gone to attack an enemy with focus, only to fail to apply it, or worse yet remember to re apply it but select the wrong move because the game likes to randomly change your selected move is multiple. \n\nSecondly, lots of info is poorly conveyed or not conveyed at all. So info seems impossible to view unless you use a mouse, but even with a mouse there are bits of information that are not conveyed at all. Take this other example. I chose to play a herbalist since it sounded like a medic and starts with a cure ability. This being a turn based game, wasting even a single move to effectivly do nothing is extremely bad. So while in game, if you hover over cure, there is zero description unlike some other moves. It just says cure. Ok well i tried to use it to heal and alley, it did nothing and completely wasted my turn. Extremely annoying, the only silver lining, I had a suspicion it might only be for healing status aliments, though it would of been really nice to know that before hand. Ok fine, lesson learned moving on right? But later in the game in an intense boss fight were one of my characters is nearly dead, he get's an aliment that called unwell that reduces vatality by 30 points. That sounds really bad, so instead of using my powerful mage attack move to kill a powerful enemy that's about to do damage i decide to use cure on the ally with this aliment. Excepts guess what, It does nothing, becuase apparently cure doesn't even heal all stat aliments just some of them. But again 0 indication in game about what those might be. And because this is a turn based game with each encounter only afew rounds back an fourth, trying to take time to test out stuff like this manaully to naturally increase you're knowledge of what it does and doesn't work on is extremely disadvantagous.  But even if you wanted to play devils advocate and say it's intended game design and they want you to discover that naturally. Well at the very least that should be conveyed in the non existant description for cure. something like \"may cure some stat aliments but not all\". BTW, turns out that aliment I had was a curse, had to look it up online. Zero indication anywhere in ui that that was the case. \n\nI'll end with this though don't be fooled there are even more ui issues. There are various tile effects that can be applied naturally via weather or abilities. But there is zero indication of what they do. For example there is a wet tile. what does it do? who know, it doesn't seem like casting lightning does extra damage to people on wet squares. Maybe it makes you slower and hence lower in move order? But idk for sure. But standing it it evenetually  will make a wet status effect show up. does that mean it does nothing untill your marked wet? Also i could be misremembering this part but i'm pretty sure despite a wet alert showing up, there actually is no status aliment indicator above your character portrat, so i don't think it's a true status aliment the way other aliments exist. However, this also makes it extemey unclear when you character is wet or not. And this is just one of multiple tiles, but as of yet it's unclear to me what any of the different tiles i come across due since they seem to be less obvious stat changes. \n\nThe game otherwise is actually good and i loved the first game, but actually WTF is this interface. It completely ruins the game for no reason, an 95% of it seems like common sense alterations could completely solve the issue.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you hated the first game for how much of an RNG fest it was, don't even bother with this garbage. And that's coming from someone who took the awful time to 100% the first game, this shit is way worse.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a complete waste of time and money. It is poorly designed and has very little replay value. The graphics are terrible and the gameplay is boring and repetitive. Avoid this game at all costs. In addition, because of Steam's Family Sharing, I was unable to invite anyone in my family library to play the game with me, as the system recognized that I \"owned\" it. This completely defeats the purpose of a free weekend meant to attract new players and locks out a key segment of the existing player base from participating with their friends and family. gc",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am apparently not a king nor are any of my friends or 90% of the community because this was not made for us.\n\nPlease get back to your roots in the 3rd one.\n\n4x2 grid is awkward and feels really bad because enemy fights are just \"oh here's a shit ton of guys lol good luck\" and then someone takes 40 fucking damage on the first turn and dies even though this is level 1 stuff and there is literally NO ACTUAL WAY to not be auto killed in that situation.\n\nUnsure who your testers are but they must be people who don't mind having a run end in 25 minutes or don't value their own time.\n\nThank you for the free weekend. We have been scared to buy this game for the last two years and we are glad we didn't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's almost the same as the last game and unfortunately just like before, it's so difficult it's just not fun. For example, the first quest from the first town I entered had 4 bandits to kill, easy right? Nope! The front line fighters were doing 10+ damage to me, meanwhile, I'm striking for 2 and sometimes missing entirely. I enjoy games with some RNG but this one is just too much. I want to love this game, turn based strategy is my fav genre, but the movement is slow, the battles are slow, campaign turns are slow and everything is just brutal.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "More worse than the first game. \r\n\r\nNow introducing a futuristic character in a medieval setting, but their \"gadgets\" are made from the void.\r\nSo what is this game even anymore?\r\n\r\nIf you want to play Time Cop, this is your game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tried this out during the free week with a pal and it's a bit.. ehh? It's not a terrible sequel. It has some nice additions and gimmicks it brings to the table but it's missing a lot of the magic and charm of the original. The combat being grid based now doesn't really mean that much until the later levels, and at that point it's easier to just end the fight as efficiently as you can rather than worry about positioning.\n\nTutorials constantly, and I mean CONSTANTLY, pop up to explain even the most basic features at seemingly asinine times rather than relevant and it got to the point where we just turned them off completely.\n\nThe UI is.. not great. It felt like they changed it for the sake of changing it rather than trying to improve on what was there already.\n\nTo top it all off our final session ended with a nasty desync bug that killed the run entirely.\n\nWait for a sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know what kind of design decision it was to have you roll for your number of movement each turn, but that turned me off immediately.\n\nI had already read the entire tutorial over all the game mechanics and everything and when I took my first turn and realized that movement was variable I uninstalled.\n\nI don't know if it was like that in For the King 1 or what but yeah I don't like not being able to plan out my turns",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Save file broke and no way to recover based on nothing but the game being bad. I feel bad for wasting my money and time on something that takes several hours just to get through one campaign mission. Fix your game <3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Turn based solo or CO-OP(4 player together) multiplayer game. \nThe game`s luck kind system is two-side*X times. \nThis game is our control 4 free move characters(Solo game 1 player for 4 characters / 4 player multi 1 player for 1 character.). \n\n4 characters are need fighting together to each characters are connecting tiles. If 3 tiles characters are connecting, 3 characters are fighting together. If fighting character is NOT connecting tiles to other characters, That character is fighting alone. Why you fighting time to be careful.\nWhy this game is playing little confusing game playing.\nEach game has life hearts to before setting game. Each any character revival time, you are using each life heart.\n\nThis game`s game playing windows setting is NOT Graphic settings. This game`s game playing windows setting is DISPLAY settings why screen settings are effect special desktop setting size.\n\nThis game`s maps settings are CO-OP playing why This game`s maps are changing to irregular an unstably. \nThis game each unrevivable character death is give few know to that character`s playing player.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played during the free  trial since I had a bad feeling it would be more of the same from the first game.\nSadly, I was correct.\n\nFailed two 95% chances back to back. If you've played the first game at all you know this will happen 5+ times in a row.\nBought a 5 tick weapon that would break on all 5 failing. Failed first swing of the weapon, it broke.\nCombat & exploration bugs galore.\nThey somehow regressed the UI making it even more of a burden.\n\nAll of this in the first 40 minutes. I see the writing on the wall and it's looking like a more cumbersome FTK1.\nThis game and FTK1 love to brag how \"difficult\" it is and how \"you won't win on your first try\". But it's all arbitrary and definitely not a real challenge. Though, if you love a bad gambling sim with no payoff, this will be the game for you.\nIf you played the first one expecting this one to be better. It's not. Sorry. I wish it was too.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "bugs and annoying tutor. Same mistakes another game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Refund. \nCannot change haircut or beard, this is super lazy. \nNo thanks, i played the first and i was expecting better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too much text everywhere, NPCs talking too much, just scrolling through text about tutorials, hints and speech, took 15 minutes just to get to first fight. Needs voice acting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "less then 11 minutes to figure out why it's rated mostly positive rating. first fight brand new to the game and 4 people team gets demolished by a guy with a banjo and garter snake nah not interested in lose to win",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy, slow, not much different from the first.\nThe new things are even more bugged.\nMultiplayer connections is bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"For the King II\" is recommended for those seeking challenging, tactical RPG fun—especially in co-op—and who are willing to persevere through current user interface and control issues. Many players are optimistic that ongoing updates will resolve bugs and make solo play and controller support less frustrating in future patches",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "three bug on first battle, and bad UI, hard to find the button",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I make a team of 4 guys. It throws me into combat with one guy. Thats one of MY guys against 3 guys. Before I even get one move he has lost 1/2 his life. This game is stupid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried 3 different times in sake of For the King 1, I just can't get over bad UI and lack of QoL. \n\nIt's not just slow, turn-based walking on the map is not fun either as solo-player controlling four characters or four people controlling each character. Each character takes loot and gold to their own inventory and in order to give it to another character, you have to make them stack on the same hex. \n\nSupposedly you are a party but each character starts their own quest, for example a simple delivery quest, and only that character can deliver and complete the quest, encouraging you to split characters apart and everyone to run their own errands, loot their own, fight their own.\n\nAnd there are events, instead of rolling the dice as a party, whoever reaches first having the roll, and on a bad roll, that character can stuck for couple turns before moving again, forcing others to leave behind or just wait alltogether. It should have be like the Stolen Realm's, you move together, you choose together, in case of rolling dice events, you pick the best character to roll for the party.\n\nA sanctum /buff giving statues can be only taken by one character too.\n\nGood thing that, they seem to keep adding new things, characters, items, contents and mechanics, and I read they have some plans for QoL changes in 2026. I hope it fixes this slowness of solo exploration and adventuring from the co-op game. It doesn't fit neither for single player nor multiplayer experience. Also UI too, I just hated it, definetely not a keyboard/mouse friendly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you like grand strategy, give this a try. I'm sure you'll love being buried in line after line of tutorial text. Remember when games got to the action? That was cool.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "'And you will be defeated'. Why? Another crap algorithm. Whatever happened to the skill of writing challenging, but do-able? Went the same way as enough content to warrant one, I guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worse than the first game in every way. please start from scratch",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "They took away the different sounds of the musical instruments.\nSound effects sound like a mobile phone game.\nNo constant fear of death and having to restart.\nThey have even managed to upgrade the graphics by removing all the soul from the game.\nThe new characters are just weird and there is so much content that just feels so out of place. \nI used to love the first game and have many good memories from it, this one however is just crap. No soul, no fun, just a rubbish rehash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game fails to connect to the online servers. I need to reinstall the game every single time to play with my friends. That's the only way to fix the issue (I tried everything else).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There are some interesting ideas here, the different types of action points and positional combat are additions that increase depth, but the rest of the game is strictly worse than the previous one, with drastically worse UI/UX which obscures important information and is more difficult to use for no reason.\n\nPersonally I also don't like the new art style which is more generically \"3D\".\n\nAlso the tutorial NPC talks way too much.  There are too many tutorial boxes that need to be clicked through at once and it doesn't present tutorials at appropriate times. (Ie. I got the \"Guard action\" tutorial after choosing to make a melee attack.)\n\nDrastic downgrade over the original in nearly every aspect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game doesnt even work can finish the third act before it bugs out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they killed my baby. was looking forward to this for the longest time only to be instantly disappointed at the graphics and new combat system",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "to many awareness weapons\nnot enough intelligence weapons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The only fun campaign is the first rest are boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly a straight downgrade from the first game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game makes me want to play the first one again",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Poo game frfr. Who made this trash?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'd rather play Embers Adrift tbh",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "for the chud two; didnt need a second game its basically the same\nhttps://store.steampowered.com/app/527230/For_The_King/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bretty bad gayme",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "poorly optimized",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Filled with wokeness and RNG.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I like it but I think trying it was enough",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "UI is hell, bugs are hell, i miss being able to play with a party of 2 or 3",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i liked ftk 1 but instantly disliked this one",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pirates can fly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "P8-12 gjgj ))))))))",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My friend whom I played with said if I post a review which gets 96 [b]Likes[/b] and 69 [b]Awards[/b] then he will buy me RTX 3060 and 2 kilos of canned ham. So I'm just gonna leave this here.\n⠁⡼⠋⠀⣆⠀⠀⣰⣿⣫⣾⢿⣿⣿⠍⢠⠠⠀⠀⢀⠰⢾⣺⣻⣿⣿⣿⣷⡀⠀\n⣥⠀⠀⠀⠁⠀⠠⢻⢬⠁⣠⣾⠛⠁⠀⠀⠀⠀⠀⠀⠀⠐⠱⠏⡉⠙⣿⣿⡇⠀\n⢳⠀⢰⡖⠀⠀⠈⠀⣺⢰⣿⢻⣾⣶⣿⣿⣶⣶⣤⣤⣴⣾⣿⣷⣼⡆⢸⣿⣧⠀\n⠈⠀⠜⠈⣀⣔⣦⢨⣿⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣅⣼⠛⢹⠀\n⠀⠀⠀⠀⢋⡿⡿⣯⣭⡟⣟⣿⣿⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⡘⠀\n⡀⠐⠀⠀⠀⣿⣯⡿⣿⣿⣿⣯⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⣉⢽⣿⡆⠀⠀\n⢳⠀⠄⠀⢀⣿⣿⣿⣿⣿⣿⣿⠙⠉⠉⠉⠛⣻⢛⣿⠛⠃⠀⠐⠛⠻⣿⡇⠀⠀\n⣾⠄⠀⠀⢸⣿⣿⡿⠟⠛⠁⢀⠀⢀⡄⣀⣠⣾⣿⣿⡠⣴⣎⣀⣠⣠⣿⡇⠀⠀\n⣧⠀⣴⣄⣽⣿⣿⣿⣶⣶⣖⣶⣬⣾⣿⣾⣿⣿⣿⣿⣽⣿⣿⣿⣿⣿⣿⡇⠀⠀\n⣿⣶⣈⡯⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⣹⢧⣿⣿⣿⣄⠙⢿⣿⣿⣿⠇⠀⠀\n⠹⣿⣿⣧⢌⢽⣻⢿⣯⣿⣿⣿⣿⠟⣠⡘⠿⠟⠛⠛⠟⠛⣧⡈⠻⣾⣿⠀⠀⠀\n⠀⠈⠉⣷⡿⣽⠶⡾⢿⣿⣿⣿⢃⣤⣿⣷⣤⣤⣄⣄⣠⣼⡿⢷⢀⣿⡏⠀⠀⠀\n⠀⠀⢀⣿⣷⠌⣈⣏⣝⠽⡿⣷⣾⣏⣀⣉⣉⣀⣀⣀⣠⣠⣄⡸⣾⣿⠃⠀⠀⠀\n⠀⣰⡿⣿⣧⡐⠄⠱⣿⣺⣽⢟⣿⣿⢿⣿⣍⠉⢀⣀⣐⣼⣯⡗⠟⡏⠀⠀⠀⠀\n⣰⣿⠀⣿⣿⣴⡀⠂⠘⢹⣭⡂⡚⠿⢿⣿⣿⣿⡿⢿⢿⡿⠿⢁⣴⣿⣷⣶⣦⣤",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really enjoyed FTK1 but not this one.\nI dont see much improvements compare to the first game, in fact a lot of thing became worse : \nUI is so bad and difficult to understand, why change it that much ?\nOptimization is bad as well, even though graphics/fx doesnt change that much\nThe pace of the game seems a lot more slow than first one, it is so boring starting a new adventure\nWhen you change character turn, it is so slow to calculate your movement dice, it is slowing the game so so so much\nMoving is slow as well, you lose a lot of time moving around the map, characters should move more fast\nIt is also so boring at the start of each mission as your characters are weak and to be honest this is where i die the most because i want to progress more fast. Game become interesting and fun around level 5 when you get better weapons, but it is so slow to get there in my opinion.\n\nOn the positive side, i like the tile mechanic and the ability to get pets.\nI also like the fact that they divide the campaign into differents missions.\n\nOther that this, nothing much sadly.\n\nI am having trouble finishing all missions because i lose interest quite fast unfortunately and nothing is really making me want to come back to the game.",
      "voted_up": false,
      "votes_helpful": 75
    },
    {
      "review": "As of right now, I would only recommend buying FTK2 if it is on sale. There are many improvements from the first game, such as the ability to play with a party of four and numerous quality of life changes. The overall difficulty is also easier with the addition of pets, mercenaries, changes to healing item scaling, and more plentiful loot. However, the game still has noticeable bugs almost 2 years after its initial release, the UI is a downgrade from the first game, and there are some clearly imbalanced characters.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I can't actually believe how bad this UI is. The game itself is pretty fun (more of the same from the first really), but the UI makes it such a drag to do anything or find things out (look at BG3 devs, you can pull up tool tips on literally anything via a click of a button. Chance to inflict RANDOM SYMBOL, and also not explain the effect, is a choice). \r\n\r\nIt's just honestly embaressing that a team of developers made this UI, tested it and thought 'yeah, this is really good'. It ruins the actual fun game hiding behind this interface.\r\n\r\nObligatory - \"I don't normally write reviews but\"... but this UI is so grating that it's inspiring me to do try and actively convince others (for their own sanity) to not play this game because no one should have to subject themselves to this war crime of a UI.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Basically very little changes compared to the first game. And all the changes made are terrible. The game has one of the worst UI I've ever seen, it's buggy as fuck, the pace of a game is abusively slow, and multiplayer is HORRIBLE with lots of de-sync. One of the first time in my life that I consider the devs ripped me off.",
      "voted_up": false,
      "votes_helpful": 75
    },
    {
      "review": "Feels like a slightly worse version of the first game with better graphics and just, more things? UI is genuinely just a downgrade, some of the characters suck comparatively to others (imo), and actually half of the abilities/perks have basically no explanation or a terribly short and unhelpful one. Not really worth it unless you get it on a big sale.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Gave it a shot during the free weekend. Found it to be incredibly confusing and absolute sensory overload with how much information it immediately hits you with. It has all of the elements of TTRPGs, but lacks the elements that make those kinds of games fun. It's just a bunch of numbers you have to keep track of and a bunch of clunky UIs that are hard to keep track of. If you're a fan of turn-based RPGs, this is not that. If you're a fan of TTRPGs, this is not that. If you're a fan of roguelikes, this is not that. It's a fine game to try, but if you really want a game like this, just buy the first one. It's at least a little easier to consume.",
      "voted_up": false,
      "votes_helpful": 7
    }
  ]
}