{
  "positive": [
    {
      "review": "This game is free, it is really fun to play with friends on, new updates almost every week, BUT there is a lot of ways to use real money. Nothing wrong with that, it's a free game, gotta make money somehow though. Not a lot to say obviously, but they also collaborate with real people, games, movies, heck even youtubers. But, it's free. If you don't like it, it's free. No loss.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Game is way better than fall guys. less people per match, quicker lobby times, havent had longer than 15 sec wait in unranked. Actually get to play a lot of different levels unlike fall guys where you may play the same level like 5 out of 7 times. A lot of skins to choose from obviosuly you may have to pay but there is so many different skins. They still do events and seasons and for me personally i think this is better than fall guys.I play fall guys on ps5 and stumble guys on pc and this is way better, even with playing the game with a mouse and keyboard.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Rating: ★★★☆☆ (3/5)\n\nI’ve played Stumble Guys a lot on mobile, and honestly, I still prefer the mobile version. Even though the PC version is basically the same and just as good, something about playing it on mobile hits differently for me personally.\n\nBut there’s one big W for the PC version:\n👉 No ads!\nThat alone makes the experience much smoother and way less annoying compared to mobile.\n\nI’m really happy to see a mobile game come to Steam, and to be honest…\nI think it’s better than Fall Guys, lmao ;)\n\nIf you enjoy light-hearted chaos and quick matches, this version is definitely worth trying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is pure, chaotic fun—perfect for a quick session with friends. It's totally easy to jump into, and watching everyone wipe out on those crazy obstacle courses never gets old. Yeah, sometimes the physics are kinda janky, but that's part of the charm! It’s genuinely chevous to snag a victory royale after failing 50 times. Highly recommended if you just want to laugh. Best free-to-play party game out there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very fun you can compete in all different kinds of races and you can also use abilitys to hit opponents  to make them fall. You can unlock many avatars, footsteps have fun playing! thank you for your time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stumble Guys é o jogo que responde à pergunta: \"O que acontece se você colocar 32 pessoas desastradas em uma pista de obstáculos desenhada por alguém que odeia a humanidade?\". O resultado é um caos glorioso, onde a vitória é menos sobre habilidade e mais sobre quem cai de cara no chão por último.\nA Realidade Nua e Crua\nO jogo é um banquete de cores neon e física de gelatina. É o Fall Guys com um tempero extra de frustração móvel, mas na Steam ele brilha com a sua simplicidade viciante.\nA \"Habilidade\": Você acha que é bom em jogos de plataforma? Stumble Guys está aqui para te provar que você não é. Você vai escorregar no gelo, ser empurrado por um taco de beisebol gigante, e cair no limbo porque um pinguim te deu um encontrão. A habilidade real é a sua capacidade de rir do seu próprio fracasso.\nOs Mapas (e o Ódio por Eles): Todos temos aquele mapa que odiamos com todas as forças (sim, estou falando de você, Tundra Run e seus blocos de gelo traiçoeiros). A cada nova rodada, a emoção de se classificar é seguida imediatamente pelo pânico de qual será o próximo inferno de obstáculos.\nA Comunidade Competitiva: Não se engane com os avatares fofinhos. As pessoas neste jogo fariam qualquer coisa para te empurrar para fora da plataforma final. É uma guerra psicológica disfarçada de festa infantil.\nAs Skins (O Verdadeiro Jogo Final): O objetivo principal não é vencer a coroa. É ter a skin mais rara e ridícula possível. Um gorila com chapéu de festa? Sim, por favor. Um MrBeast gigante? Claro. A ostentação das skins é metade da diversão.\nVeredito\nPositivo. É o jogo perfeito para jogar 15 minutos e acabar jogando 2 horas. Grátis para jogar, viciante e excelente para liberar a raiva (ou criar mais) com amigos. Instale, caia, levante e tente de novo. A coroa te espera!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredible game but it's pay to win.. if i see another person transform into a bounce ball to outjump me or swing his fists with a paid emote to knock me off the map i might just find them..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game good yes fun very yes good nice fun yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would'nt nececarly say its amazing or great and not even good but its free and does'nt take too many braincells its repetivtive but its proably worth giving a shot cuz its free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very fun especially with friends. I have 4 hours on this game and I can't stop playing! I recommend it to people who just want to have a fun silly time together. This was so fun and I can't wait to see how it turns out in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve spent some time with this game and honestly, it surprised me in a way I didn’t fully expect. I don’t want to sound dramatic, but there’s something oddly satisfying about how everything fits together — not in some perfect, polished “advertisement” way, but more like a game that knows exactly what it wants to be and just… goes for it.\n\nThe first thing I noticed is the atmosphere. Every part of the game — the visuals, the sound, the pacing — kind of blends into this feeling that you’re actually inside its world, even if you’re just casually playing. I know that sounds a bit cliché, but it’s true. Sometimes it’s chaotic, sometimes slow, sometimes you’re just wandering around thinking “ok, what now?” but that’s honestly part of the charm. The game doesn’t try to rush you unless it actually needs to.\n\nGameplay-wise, it has this mix of familiar elements and small twists that keep things from feeling stale. Nothing groundbreaking, maybe, but it all works together in a way that feels natural. There were moments when I thought “yeah, I’ve seen this in other games,” but then the game throws in tiny details or unexpected interactions that make it stand out just enough. It’s the kind of thing you only notice after a few hours, when you start connecting the dots.\n\nPerformance has been mostly fine. A little rough spot here and there, but honestly, show me a game these days that doesn’t have something weird happening once in a while. Nothing game-breaking on my end, at least. You can clearly tell the developers put effort into this, even if a few edges are still a bit sharp. Again — part of the charm.\n\nWhat I really appreciate is that the game gives you space to play the way you want. Some people will rush through every objective, others will take their time exploring or messing around, and both approaches actually feel valid. I like games that don’t punish you for not following some “correct” path.\n\nOverall, I’d say this is one of those titles that grows on you the longer you play. It doesn’t try too hard to impress in the first five minutes — instead it slowly builds its identity, layer by layer, until you suddenly realize you’ve been playing way longer than you planned. If you’re looking for something that balances comfort with challenge, familiar mechanics with fresh touches, and a world that’s just fun to be in, then I genuinely think this one is worth giving a shot.\n\nWould I recommend it?\nYeah, I would — maybe not to everyone, because no game is for everyone, but definitely to anyone who likes getting lost in a game for a bit and discovering things at their own pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game at its core is good, innocent fun with a wide variety of challenging yet satisfying levels. Too bad about the excessive microtransactions and dumb pay to win attack mechanics dragging the whole experience down. \n= 7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im top 1000 champ and got to wave 200+ on blockdash endless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun to play with friends. is kid friendly and a colorful and fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's literally a very good game with the owners actually being active",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really enjoy it becuz all the graphics and especially block dash . i have sg on my other account and im a lot higher but i try to help this account out. i recommend this game becuz i love all the passes and its not inapropiate its a ton of fun i never get bored except when u complete champion and the tournaments other whise i recommend this game and i would say its all ages!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very fun game. The new challenges and events keep me coming back. I am visually impaired and the graphic are easy for me to see and navigate well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, and its free to play which means I judge it differently than other games. To be honest, this is one of the best free to play games based soley on its monetization model, there are tons of things to buy but you get plenty of free opportunities to unlock skins and abilities. My only gripe is there are a ton of bots that are designed to look like real players, I wish that I didn't notice it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stumble Guys is an amazing game because it combines fast-paced, chaotic fun with lighthearted competition that appeals to players of all ages. Developed by Kitka Games, it offers a perfect mix of humor, challenge, and excitement in every round. The gameplay is simple yet addictive—you race against dozens of players through colorful obstacle courses filled with slippery surfaces, swinging hammers, and moving platforms. The unpredictable physics and cartoonish visuals make every stumble hilarious, turning even failures into moments of laughter. One of the best parts of Stumble Guys is its accessibility; anyone can jump in and play within seconds, whether on mobile or PC, without needing a complex tutorial. Its multiplayer mode encourages friendly rivalry among friends, creating endless opportunities for funny moments and shared victories. The game’s regular updates, themed events, and customizable skins keep it fresh and engaging, allowing players to express their personality through quirky outfits and emotes. The bright graphics, cheerful music, and quick matches make it easy to enjoy anytime, whether you’re playing for five minutes or an hour. Moreover, the community around Stumble Guys is lively and welcoming, constantly sharing tips, memes, and creative plays. Ultimately, Stumble Guys stands out because it doesn’t take itself too seriously—it’s about pure, joyful chaos where anyone can win (or fall) spectacularly. Its blend of simplicity, humor, and fun competition makes it one of the most entertaining and replayable party games available today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Epic little co - op game.. should give access to more abilities without having to pay though...... :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this gam was fun and stumbly. wiould recomendf to anyone who wants to have a local splooge sesh with your friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good way to play with others and by yourself I recoomend this game couse i love it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great party game, it's exactly what you'd expect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "while this game is riddled with microtransactions they dont impact the gameplay and it is really fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decent free game. Reminds of fall guys. Good game but very limited courses. Once you play it for a while it gets repetitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for kids game,but sometimes to play isnt that much bad like to do when u dont have anything else",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "But not that good. Kinda shit, but still fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If I were the most famous artist in the world, I would announce to everyone that this is not a game, this is a work of art. Don't you agree?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for a quick burst of fun, or for a few hours of fun with friends and family.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's just like Fall Guys but it's really fun when you play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean, it's not the best game ever. But not the worst. I think it's better than Fall guys though. 6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HOLY GUACAMOLE DUDE. DONT EVEN CARE THAT FALL GUYS CAME FIRST. FALL GUYS IS A CLONE OF THIS FUCKING MASTERPIECE OF DOWNLOADABLE SOFTWARE. GGWP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unironically better than fall guys. don't like that it's pay to win tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good alternative to fall guys. A bit grindy/p2w which is a slight headache.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game to play with friends and even alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a decent-ish fall guys copy for low-end pcs, although achievements need a fix due to them being bugged",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "guys that stumble (peak and better than fall guys)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very fun, especially if u play with ur friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So much fun and a lot of laughs with friends online.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this game has a lot of potentoil but they ccoppid it from fall guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jest zajebista, ale nie jest gdy jakiś bambik cie spycha na block dash nie pozdrawiam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the animation is great the whole game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it because its fun but they should rid of the water Aventure one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent, but too many cheaters and pay to win abilities !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is, byfar the best game i have EVER played, 5 Stars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game :) completely recommend competitive souls to play this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME but poppy playtime is still better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game for distraction but very pay-to-win",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stumble and fall, be better than all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game,had 1000+  hours on my ps4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun top play - and very addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun but you can get very mad cuz people raige bait",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and i recomend this to people pls try it its free :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im six years old i was playing you game when i saw somebody with a name that started with the letter n that im not allowed to say anymore when i asked my mommy what it was and said it out loud my mommy got really mad and slaped me across my butt and sent me to my room will someone say what it means please",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bullying children is the best part about this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2021-2023 the stumble guys prime. now this game is trash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the shortcuts and the maps keep working the maps devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable and decent free game. 7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was good, but only would play if I was bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its good low key! But its hard to get ability keys if your free to play like  me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10\n\nFun; but I believe it's getting quite ptw...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like Fall Guys but the soundtrack makes you wish you were deaf",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stunbli gayz cul gaim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game more fun with family or freind's lol:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game is SUPER fun when you play it a lot. should try it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uh fuckin its better than fall guys.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good enough for some quick fun with ur kids",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tuff but gets boring quick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game guys and is free",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its very cool and fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good but they have so many pro",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hate this game bc my account lost bc of update",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got master in one day, to easy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is better than cs 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SUPER fun would defenetly recommend this games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fall guys but better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its soooooo fun i cannot stop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stinks of fallguys with big five guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game really fun Better then fall guys tbh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Life changing experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun play now or else btw just joking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its just loads of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "being late for bus to school sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game, made me get sendy!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stumble guys i got crown first v2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is perfect",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stumbling instead of falling",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun i won a event",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game it is sooooooooooooooooooo fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like fall guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not a bad game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game oat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "took my family away 0/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "es muy bueno lo recomiendo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "because its like roblox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAGHJKØLJHCXGFNCVHJLK-HGFDSDFGUYDHSTERDFHBNKGHMJN,HGTYRJ7ETJHBDMSNYIF7LUGHDB µU9PHM LB µ€BF DNJVM BNEFØJOKDC VSBHKJQIHBNX VCNSBDWJB CNNJB VDBNLFNE BDMCJNWBM SJWNKDLB N,MB CNFJEN,",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Overall the game is fun for like the first few days but it gets kinda boring and the game is full of bots making it feel dead. 4/10 rating.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "p2w ahh game, i keep getting the same map over and over and over again. I CANT GET ANY GOOD SKINS. Just play fall guys.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "the worst game ever an kids game first it have gambel skulls and this levers are littry inposybal",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm trying to 100% every game in my steam library, and looking at these achievements for stumble guys, their really easy, the only problem is, the achievements have been broken for over a year. The dev's don't care enough to fix it and it's almost impossible to 100% this game without having to re-do everything and hoping and praying you get the achievements. Now for the game itself, its pretty fun I guess, it's a game you and your friends would play for like 20-30 minutes and get off cause it gets repetitive and boring.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was fun the first few days. The gameplay is almost exactly like Fall Guys, and the name, well, you get the point. The gameplay is very repetitive and gets boring after a while. The characters are way overpriced and even get up to $30! Some of the wheels you have to pay to spin give you items you could get for free and if you pay for the battle pass, you can just steamroll your way through the crowds by hitting them off. Never recommend, even if the game is free.\n(Edit:) The game is also full of bots that makes the game feel more empty than it already was.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All the players seem to be bots, not sure if it gets better as you play more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game, two matches, two W's. too easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Casino-type interface. Very difficult to simply boot the game and join friends to start the a game. Stop pushing your cosmetic crap on us.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when i played every player was a bot i don't know why maybe i was flagged as a bot myself if not the game is just full of bots not reccomended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Upsides: Free-to-play and mildly funny\r\nDownsides: gets old very quickly and has skibidi toilet character skins",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't say I enjoyed playing this game too much. But when I started playing it I did not have Fall Guys and stuck with this game. Even tho it was hella Pay-2-Win, I kinda got used to it by then.\nNow, after this Brainrot update or whatever it is, I no longer want to have contact with it. Idk what happened with classic Stumble Guys, but I won't be coming back to it in the future. Atleast it was fun while it lasted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game until it became Pay-to-Win.\n\nYou can't unlock abilities unless you purchase them.\n\nIn ranked, at Platinum level, everyone's just bashing you into lasers or off boats with no way to counter/defend.\n\nReal slop content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is fucking terrible just a terrible rip off to fall guys i bet some little gook made this game fucking ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pls dont rage over the free wheel if you are one place from special its stumble guys  trick to make you rage (its rigged)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Abilità mal bilanciate e fondamentalmente pay-to-win. Pochissime mappe. Peccato, per il resto sarebbe un discreto clone di Fall Guys, ma rovinato da questi aspetti.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aggresive monetization, poor variability, rigged 'RNG' rewards, clunky controls.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game madwe  mre Really upset and I ended up Running over somones Dog",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Liked this for about 2 rounds before my \"son\" threw a controller at my face and now i have a bruise on my face now.\r\n\r\n2/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oohhhhh maybe if the godamn bowling mfing ball didnt get me to clip trough the ground",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "every time i open this damn game it keeps crashing for no reason!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i complete block dash but the achievement wont coming",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First it was decent, but what happened?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad Anticheat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its more bots then players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck that game man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so fun but hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "f!ck@$$ game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Very mid Fall Guys rip off.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it a mobile game man",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy pay to win games then this game is for you.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just 3 words. Pay to win",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fall guys is better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "P2W slop",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "473 hrs in 2021 games dead now",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pinging very much bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i lost to a fucking 6 year old",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ну на час пойдет",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fucking niggers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Slop Fall Guys ripoff",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pretty jank",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "каллище",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "p2win bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i lost 200 dollars and i lost my gf and gained 400lbs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "eh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "L",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stumble Guys feels like a cheap copy of Fall Guys The gameplay is repetitive and lacks originality The controls are clunky and the levels do not have the same polish or creativity It is basically a clone with less charm and less fun Overall it feels like a knockoff rather than a fresh game",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "TS is NOT better than Fall Guys LMFAOOO...\r\n\r\nPeople complain that Fall Guys has pay-to-win achievements but atleast that's for ACHIEVEMENTS. In most gamemodes there's a thing called \"abilities\" that single-handedly give you a HUGE advantage over those who don't, and some of the most busted ones are locked behind \"ability points\" that you BARELY get throughout the seasons, making this game blatantly PTW.\r\n\r\nEven without that, gameplay's straight ass soo! Just stick to Fall Guys..!",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "This game sucks for many reasons. its a ripoff of fall guys, abilitys, and just everything. ive lost so many games because little timmy over there has a level 400 rpg ability. this game sucks, dont play it",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Overall the game is fun for like the first few days but it gets kinda boring and the game is full of bots making it feel dead. 4/10 rating.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "all games are literally AI lol. worst 20 mins of my life, just fall guys but poorly made and with only AI",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "the worst game ever an kids game first it have gambel skulls and this levers are littry inposybal",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "p2w ahh game, i keep getting the same map over and over and over again. I CANT GET ANY GOOD SKINS. Just play fall guys.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I installed this game because I wanted to unlock every single achievement. But the game is so bad and full of glitches that achievements don’t even pop. Can the developers do something about it? It’s clearly a knockoff of Fall Guys, and it doesn’t even take much less space than the original.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was fun the first few days. The gameplay is almost exactly like Fall Guys, and the name, well, you get the point. The gameplay is very repetitive and gets boring after a while. The characters are way overpriced and even get up to $30! Some of the wheels you have to pay to spin give you items you could get for free and if you pay for the battle pass, you can just steamroll your way through the crowds by hitting them off. Never recommend, even if the game is free.\n(Edit:) The game is also full of bots that makes the game feel more empty than it already was.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All the players seem to be bots, not sure if it gets better as you play more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad game, two matches, two W's. too easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Casino-type interface. Very difficult to simply boot the game and join friends to start the a game. Stop pushing your cosmetic crap on us.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when i played every player was a bot i don't know why maybe i was flagged as a bot myself if not the game is just full of bots not reccomended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Upsides: Free-to-play and mildly funny\r\nDownsides: gets old very quickly and has skibidi toilet character skins",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't say I enjoyed playing this game too much. But when I started playing it I did not have Fall Guys and stuck with this game. Even tho it was hella Pay-2-Win, I kinda got used to it by then.\nNow, after this Brainrot update or whatever it is, I no longer want to have contact with it. Idk what happened with classic Stumble Guys, but I won't be coming back to it in the future. Atleast it was fun while it lasted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game until it became Pay-to-Win.\n\nYou can't unlock abilities unless you purchase them.\n\nIn ranked, at Platinum level, everyone's just bashing you into lasers or off boats with no way to counter/defend.\n\nReal slop content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is fucking terrible just a terrible rip off to fall guys i bet some little gook made this game fucking ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They restarted me from the beginning, changed my name and took away all of my achievements. Im upset and rightfully so. Do not install this game if you want all of your stuff to be deleted!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ich hab ja gedacht, Stumble Guys wär so ein nettes, kleines Partyspiel für zwischendurch. So was, was man mit Freunden lacht, ’ne Runde dreht, bisschen Spaß hat.\n\nSpoiler: Der Spaß bleibt meistens auf der Strecke — zusammen mit meinem Charakter, der mal wieder von der Map geflogen ist, weil die Physik sich gedacht hat: „Heute nicht, Bruder.“\n\nErstmal das Offensichtliche: Das Spiel fühlt sich an, als wär’s auf Speed gebaut und dann dreimal zurückportiert worden. Alles wackelt, rutscht, buggt, und du hast permanent das Gefühl, die Steuerung ist aus Gummi. Präzision? Fehlanzeige. Dein Charakter läuft, als würde er auf Butter gleiten.\n\nDann der Ping – der eigentliche Endgegner in Stumble Guys. Egal wie gut du spielst, am Ende gewinnst du nicht, weil du skill hast, sondern weil der Server Gnade zeigt. Du springst perfekt – und wirst trotzdem nach hinten teleportiert. Du rutschst auf einer glatten Fläche aus, auf der eigentlich nichts ist. Und manchmal wirst du einfach so eliminiert, ohne dass du weißt, was du falsch gemacht hast.\n\nDer Content? Wenn du drei Runden gespielt hast, hast du 90 % des Spiels gesehen. Immer dieselben Maps, dieselben Fallen, dieselben Zufallsmechaniken. Es ist nicht mal mehr frustrierend – nur noch ermüdend.\n\nKlar, es gibt neue Skins. Jede Woche. Jede verdammte Woche. Und natürlich stecken sie hinter Paywalls, Season Pässen oder irgendwelchen Glücksspiel-Kisten.\n\nStumble Guys ist im Prinzip:\n\n10 % Spaß\n\n20 % Frust\n\n70 % Werbung, Pop-ups und „Kauf jetzt dieses Ultra-Legendary-Rainbow-Kitty-Paket für nur 19,99 €“\n\n\nIch will gar nicht wissen, wie viele Stunden meines Lebens ich damit verbracht habe, in der Lobby auf „Start“ zu drücken, während das Spiel mir fünf Mal sagt, ich soll mir ein „besonderes Angebot“ anschauen.\n\nAch ja, und dann kommt noch das absolute Highlight: Mobile Port auf PC.\nAlles fühlt sich an, als wäre es nie für Maus und Tastatur gedacht gewesen. Die Menüs sind ein Desaster, das UI schreit Handyspiel, und manchmal erkennt das Spiel deine Eingaben einfach gar nicht.\n\nIch hab’s ehrlich versucht. Ich hab’s mit Freunden gespielt, ich hab’s solo gespielt, ich hab mir eingeredet, dass es ja „für zwischendurch“ ist. Aber irgendwann merkst du: Es gibt kein „zwischendurch“ – es gibt nur „wieder rausfliegen, wieder genervt Alt + F4“.\n\nUnd das Matchmaking? Pure Magie. Du triffst auf Leute mit Skins, die aussehen, als hätten sie das Spiel studiert – und auf Bots, die gerade versuchen, überhaupt zu verstehen, was Schwerkraft ist.\n\nDas Schlimmste ist aber, dass es trotzdem irgendwie süchtig macht. Du klickst auf „noch eine Runde“, weil du denkst, „diesmal gewinn ich’s“. Und dann stolperst du – wieder.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll start this by saying that I'm a completionist. I don't like being left out on unique unlocks and exclusive things. Anyway, me and my fiance both started playing this game at the same time. They have some trophy meter on the right to get special unlocks from a pinata. I don't have that option on my game. I also don't have a market section in my shop like they do. My friend joined yesterday and they too have these features that I don't have. I contacted support and said that it's part of a testing group before they release new features. I asked how I can join that because I'm the only one in my group who isn't a part of that, and they told me they can't. So I'm left behind while my friends and fiance get cool rewards and I'm the one actually winning the games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kind of a stretch to call it \"multiplayer\" if the invite feature never works & there are always server errors that randomly kick you from the game. Also selects the same 5 maps every time you play instead of new ones. Maps are pretty boring, get really repetitive, and the controls for jumping & diving suck. If you accidentally jump twice, you're basically dead, as it takes an entire second to get back up. Just a cheap knockoff of an already free game that has no purpose to be made.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There are all bots. Shame cos the game itself was a nice free version of fallguys but its filled with bots programed to be too easy to beat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it isnt working on arch linux, I tried most proton versions and it refuses to open",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i played this game for a while and had fun with it, but it is verrry pay to win, and its just a worse fall guys, i would not recommend for anyway to play this game tbh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it is fucking pay to win game, i cant increase my fucking rank because of fucking 12 year old jobless creatures who will suck dicks to get money for donating this fucking game. wtf",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game SUCKS, it's pay to win, the gameplay is trash, and that one stage in jurassic rush, MAKES ME SO MAD",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "oh this game is such a marvelous depiction of human need to always come out victorious and how we are ready to sacrifice our brethren just to achieve a win although i despise the fact of the pay to win emotes beating my ass cheeks i must still say that this game is low effort shit impersonified",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stumble guys, is a game not dissimilar to another game fall guys, while it is wrong to critique the game on taking inspiration, this game has certain cons that, as a player, i feel are worth addressing. While the game has issues, it isn't without its own merit, the games visuals are good, the colours pop and the art style of the game is overall nice, the environments are interesting and the levels contained within, are fun and action packed. the game however has many flaws, the matches seemed to be filled with mostly bots, very little human players, while the use of micro transactions is understandable for a free game, i feel they're a bit overbearing, there's very little that can be done without partaking, the frame rate is. in conclusion, the game is a suitable replacement for fall guys, however isn't much more than that, the micro transactions are overbearing, and the gameplay can be sloppy at times. overall i would rate this game 4.5/10, which in a word would be \"alright\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Although its free, I would rather have an Indian scammer fraud my credit and debit cards than to pay a single unit of the cheapest currency that exists.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There are too many bugs and it's not fun \r\nAnd the items are also lacking \r\nI think you shouldn't play the game \r\nWhenever it's fixed, come play it. Thank you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this shit fucking sucks. i only played this cuz i didn't wanna deal with epic's bullshit. but this is just absurd. the amount of crashes and bugs there are is OBNOXIOUS. you can't even go FIVE MINUTES without it crashing. you're not even safe in-game, it just crashes after a single round and you can't do shit. i want a fucking refund, even though this is a free game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is absolute dog shit with 9 yearolds stealing moms credit card",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is HONESTLY the worst game i have ever seen\r\nThis is a p2w mess with a gambiling addiction\r\nif you dont want to spend your lifesavings on this game then DONT buy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mobile-tier graphics, inexistant sound design, full of weird currencies and battle passes and you're not even playing against real people.\n\nNot sure why this game is rated as very positive but I'm very positive that this game sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible game and hurt my mango. 10/10 will reccomend only costs a dollar",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ranked used to be fun, it was competitive and u used to be able to get skills to make yourself stand out and make it fun. Now 95% of abilities are \"turned off\" for ranked, making the only competitive part actually boring as hell.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]# --- MY THOUGHTS:[/b]\r\n\r\nI'd like to mention the fact that I have no issues with the core gameplay of this Fall Guys clone. It plays smoothly and its everything you expect it to be. No, my issues are of a different kind.\r\n\r\nFirst of all, I hate the fact that [i]Stumble Guys[/i] is [i]all[/i] about micro-transactions. You could make the argument that many other games have micro-transactions, sure, but what really bothers me is that you are [i]required[/i] to spend money on these stupid micro-transactions in order to get some of the achievements this game has.\r\n\r\nSecond of all, there are many achievements related to maps that no longer show up [i]at all[/i], or have an astronomically low chance of ever showing up. This locks anyone who wishes to fully complete the game (achievement wise) out.\r\n\r\nLastly, the currency you would get in this game by taking part in the mentioned micro-transactions is [i]way[/i] too overpriced.\r\n\r\nDue to the fact that 1. I am not made of money and 2. the game isn't [i]THAT[/i] fun to excuse the micro-transactions, I am abandoning my achievement hunting for [i]Stumble Guys[/i]. Too bad. I would have really liked to put in the hours to complete it.\r\n\r\n[b]# --- RATING: 4.5/10[/b]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is completely unacceptable that this has Very Positive reviews, this game is genuinely SO horrible!!??\n\nTake Fall Guys but it's made by a 4 Year Old and also it's pay to win... That's what this game is.\n\nNot to mention that the controls suck butt cheeks and the movement is so broken :|\n\nMost of the games are lucky based or just generally bad and unplayable, I'm am flabbergasted at how BAD this game is, the graphics suck, the controls and movement suck, the UI sucks, the level ABSOLUTELY suck and it's just overall NOT fun at ALL\n\nPLEASE do not play this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pls dont rage over the free wheel if you are one place from special its stumble guys  trick to make you rage (its rigged)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Abilità mal bilanciate e fondamentalmente pay-to-win. Pochissime mappe. Peccato, per il resto sarebbe un discreto clone di Fall Guys, ma rovinato da questi aspetti.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Installed it after seeing the Little Nightmares Collab posted 4 days ago, I got in and it was no where to be found in the events tab\n\nIt's supposed to be active from 23rd October 2025 to the 6th of November 2025, and I'm posting this on the 28th of October 2025\n\nMaybe there's something i missed, let me know if you may.\n\nMaybe it was available for 3 days starting from 23rd of October.\n\nMaybe the event itself is locked behind a certain level every player must reach.\n\nMaybe it hasn't even started yet.\n\nI also clicked on the Pop up window that showed the Little Nightmares Awaits Event, it navigated me to the events tab, but it was NOWHERE to be found... get it? ayt I'll see myself out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aggresive monetization, poor variability, rigged 'RNG' rewards, clunky controls.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LOOOOVE LITTLE NIGHTMARES. BUT YOU MADE IT PAY TO GET THE SKINS! YOU ACTUALLY EXPECT US TO PAY FOR THESE?! GEEZ! IM UNINSTALLING THE GAME! GOODBYE!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game madwe  mre Really upset and I ended up Running over somones Dog",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is fucking shit play fall guys not whatever this shit is",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Liked this for about 2 rounds before my \"son\" threw a controller at my face and now i have a bruise on my face now.\r\n\r\n2/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oohhhhh maybe if the godamn bowling mfing ball didnt get me to clip trough the ground",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "every time i open this damn game it keeps crashing for no reason!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i complete block dash but the achievement wont coming",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First it was decent, but what happened?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bad Anticheat",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its more bots then players",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fckass green fn game :steamhappy:",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}