{
  "positive": [
    {
      "review": "Idk why everyone doesn't like COH3.... So far im enjoying it. BUT. there is a few things I do not like...For example: \n\nCONS:\nI Mainly played as the U.S. forces in COH2, so i was massively disappointed that you dont have combat engineers jump out of your tank (or really playing any faction not just U.S.) and are able too make repairs right out there on the field....Now you need engineers hanging around all the time so there is that... And the way they made how you traverse Italy (first campaign...at least thats what I chose first.) It has this weird RISK like battle that you bombard and attack etc, and some of the cities have skirmishes where you can fight. And IDK what happens if you lose a city and come back too capture it if you play the whole mission over or what.... Everything is changed... Everything... so it is a bit confusing.. When you requisition more Units they come from the ships at sea and have too be shipped in which tank a few turns especially if you are kinda far away the battalion needs 3-4 turns and if you needed them ASAP then most likely you lose...The DLCS shouldve been free. hopefully no one paid full price and waited until it was $15 on sale, I did that and was glad I only spent that much cuz like Ive said...DLCS shouldve been included already. \n\nPros:\nThey got rid of that \"your squad only has \"x\" amount of requistion until the whole platoon is wiped out and can no longer play as them.\" You can use both U.S. and British forces as separate units so there is a diversity of ways too play with there own unique fighting and tactics and weapons. The graphics was always one of my favs in this franchise so I can Zoom in and almost read the decals and medals on officers shirts and seeing Ze Germanz blow up its hilarious. Same gameplay with new units and weapons and can still pick up enemies panzerschreck, flame thrower and a light machine gun etc. so pretty much your whole 5-6 man squad basically has one of the above mentioned. Game mechanics are better, hard too explain you would need too watch a gameplay vid too really understand what I mean.\n\nand on and on. sorry for writing a book im 2 years late so Im sure no one will read this but hey. there is my two cents. Ciao\n  \n ,,!,,,__________(0;0)\n\n                                                                                                                                                           \n                                                                                                                        -FIN",
      "voted_up": true,
      "votes_helpful": 129
    },
    {
      "review": "Been playing CoH3 for a while now, and honestly, it’s a solid RTS. The graphics look great — explosions, terrain damage, and unit details are all top-notch. The gameplay mechanics are smooth, and there’s a lot of tactical depth with positioning, flanking, and cover play.\n\nBalance isn’t perfect right now, but you can tell the devs are working on it and improving things with each patch. Overall, it’s a fun, good-looking game that’s only getting better over time.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "Alot better now than in the beginning. No achievements bugs anymore what so ever.\r\n\r\nThe single player portion of this game could use some more extended content. Fact is there's still lots of potential and better don't let that go to waste.\r\n\r\nThese three main story lines of the Italy campaign open up for different strategies, but at the same time you fight the same kind of battles with the same kind of troops. That's the only downside on the replay value.\r\n\r\nIf i would be asked to rate this game from day-1 \r\n\r\npast: 49/10\r\npresent: 77/10",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Even though the second game in the series still feels like the most polished and atmospheric, especially with its beautiful European landscapes, Company of Heroes 3 brings its own strengths to the table. After numerous updates, the game has reached a point where it’s genuinely worth recommending. Definitely grab it on sale, as you’ll likely end up getting the DLCs eventually. Don’t let the negative reviews discourage you; it’s a solid and enjoyable strategy game !",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "Its a good game but not a good successor to previous game. CoH 2 had WW2 visual in evey bit of the game, from menu to the after game reports. CoH3 is has no soul on that regard and in game visuals feel all rainbow and sunshine, not blood and guts.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "Relic really turned around the Company of Heroes 3 ship a lot faster than they did with the CoH2 launch, but the game was also in a better state on launch than CoH2 imo.\n\nOverall its probably my favorite Company of Heroes game now for PvP and the most fun I've had in a CoH game. Not only is it the active one so the meta shakes up once and awhile, but starting with 4 fleshed out factions really makes the game feel complete without needing any DLC. Before DLC this is the most amount of content a base CoH game has ever had both SP and MP wise. (Though it really needs that on the SP side, as it doesnt have any SP expansions yet like previous games.) \n\nThe Battlegroups are are also sooo much better than Commanders from CoH2, with no 1:1 re-used abilities and flexible trees for different playstyles or adjusting to game states in the same battlegroup. They really pack in a lot of gameplay with the 3 each faction gets, way more than CoH1 or CoH2 had on offer even after DLC imo due to no re-use of units and abilities. Tbh Relic has also been cookin' with the DLC Battlegroups too, typical new large patch RTS meta discovery and the balance of unforeseen discoveries aside.\n\nThe direction Relic has been taking the design is fairly good, though I slightly worry that they may get too close to CoH2s infantry lethality with all the DPS increases that they keep creeping into each patch. The game feel is like a mix between CoH1 and fresh CoH3 feel more than it feels like CoH2. Early infantry fights are pretty deadly and positional, but as durability gets acquired by Veterancy they still have good use in the later stages of the game compared to previous titles. The way the factions work and build is a mix of new ideas and some nostalgia with how the game pace and factions worked in CoH1, no weird CoH1 British or CoH2 USF thankfully though.\n\nThe SP content has been my favorite since CoH1, and while theres more on launch than before, though the DLCs for 1 and 2 really added a lot of SP content, so in a way CoH3 does have to catch up still. The linear campaign is about as good as CoH1s and better than 2s, but not my favorite linear campaign from the franchise. The Italian Total-War-esque campaign is a lot of fun though, only Operation Stonewall in CoH1 felt as fun but that might mostly be nostalgia. (Would really like a in-depth Stonewall-like mode for CoH3 with its own units/abilities). The AI feels a bit more fair and does more-player like moves, it is at the cost of being easier to fight though, which can get boring if you are a above average player.\n\nI haven't even gone into all the excellent quality of life the game adds like auto-reinforce, the lowest mouse delay and smoothest pathfinding the games have seen with all the fixes they've done, fully rebind-able keys including double binds and the ability to set up a WASD camera. There's also new features like side-hits on tanks, high ground, many never before done unit types and abilities, and my favorite, towing, with the really cool heavy towed AT guns that centerstage the mechanic. \n\nIs good RTS game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game has come a long way. Visually, it blows the earlier versions away. Gameplay is fun and varied.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "If you're currently having trouble deciding whether or not to buy this game, I would say that they've pretty much fixed all of the problems. This game is now solid and a lot of fun, coming from a 1000+ hour coh2 player.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "🎮Gameplay:\n☐ Terrible.\n☐ Bad.\n☐ Average.\n☑ Good.\n☐ Fantastic.\n\n\n📖Story:\n☐ It Doesn't Have One.\n☐ Horrible.\n☐ Bad.\n☑ Average.\n☐ Good.\n☐ Fantastic.\n\n\n⛺Graphics:\n☐ Potato.\n☐ Bad.\n☑ Average.\n☐ Good.\n☐ Beautiful.\n☐ Masterpiece.\n\n\n🎵Music/Sound:\n☐ Horrible.\n☐ Bad.\n☑ Average.\n☐ Good.\n☐ Amazing.\n\n\n🐞Bugs:\n☐ Game Itself Is One Big BUG.\n☐ Game Breaking Bugs.\n☐ Lots of bugs.\n☐ Few Bugs.\n☑ Nothing.\n\n\n💸Price:\n☐ Full Price.\n☑ Wait For Sale.\n☐ Refund It If You Can.\n☐ Don't Buy It.\n☐ Free.\n\n\n📝Final:\n☐ Terrible.\n☐ Bad.\n☐ Average.\n☑ Good.\n☐ Great.\n☐ Fantastic.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After all the updates and patches, the game has improved a lot and is solid now. Performance is better, balance feels more refined, and the core gameplay finally shows what it should have been at launch.\n\nThe initial release was rough, full of bugs, poor AI(worse than a long time IMO), and questionable design choices.\n\nIt’s a shame, because the current version plays like a proper sequel, so hopefully peeps will give it another chance.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After a rocky launch, i really have to give credit where credit is due. Relic not giving up on the game post partum, and actually coming out with updates, bug fixes, maps, and DLC that gives players fun options and variations to play the game, is really nice to see in a day and age where RTS games come often or not, dead on arrival. \nHaving been an avid RTS player on and off for over 20 years, all the way from the C&C, SC and SC2, Supreme  Commander to now COH, i'm more than pleased to say that this scratches the RTS itch that i've been missing lately. Although the game doesn't have the extensive base building mechanics and resource managing, akin to these other RTS games, it changes it out for intuitive gameplay features and styles, where the battle is won in how you play your units, instead of having to play 5D sim city inside your base with an APM of over 900. \nThis game's \"easy to pickup and hard to master\" playstyle has worked well in getting me and my friends who aren't as experienced in RTS, to enjoy this \"historically authentic\" all out war strategy game. This game has awesome battlefield-esque moments, with explosions, gunfire and limbs being flung all over the place, and it took quite a hold on us. For those saying the game looks \"cartoony\", i have yet to spot that. Although some of the voice lines are a tad on the cheesy side.\nSome of the DLC Battlegroups had early issues, with OP general purpose units (ranger blobs), and sim city bunker playstyles from some of the Wehrmacht BG's, and also just useless units in general (the toothless King tiger, oh how the mighty have fallen), we have after several updates achieved a more \"balanced\" state of play, both in teamplay and solos.\n\n\nThere is an elephant in the room though, and i'm not talking about the Ferdinand. \nThe cost of some of these battlegroups, and also for some of these skins (if i can even call them that), is ridiculous and bordering to egregious. Having fun new units locked behind a paywall can be considered ok, since it's adding to the game in fun and different ways to play, but locking META units and BG's behind a paywall is unacceptable. The period of time where i had to fight against ranger blobs, or entire battalions of invisible mg42 teams, while i was fighting with vanilla units that seem to be made out of paper towels in comparison, was a constant uphill battle. After some time, they finally changed it up and made some of the older BG's more viable, but i'm still holding a bit of skepticism towards the new BG's coming to Scarlet Bison, seeing how insane some of these new abilites can be (laser guided missile for DAK btw :P).\n\nIf you have seen the \"store\" in this game you will be met with lack luster skins that are in different shades of mud and shit, for a hefty price of 20$ on some of these. I appreciate the historically \"accuracy\" in some of these skins, but 20$ for smearing some leaves and kaka on my tank? Really? Might be rose tinted glasses but some of the skins from COH2 were more creative, and the ability to use custom ones from Steam Workshop was amazing, but alas money talks.\n\nIm looking forward to the new upcoming update and DLC, but i will only be getting the DLC now that it will come on sale, since i dont think it's worth 20$. Same goes for the game's current price of 55$. Do i think the game is good and fun? Yes. Do i think the current asking price of the game is fair? Not really, but if its on sale for any price under 40-30$ then i would say that its a good game to cop, seeing especially as how the campaign is quite frankly forgettable and skippable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can say that this game is on good track to being up there with its predecessors and is a a welcome change from 2 in terms of QOL. Most similar to CoH 1 which is a plus for those who love that game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "hard game, not sure if its balanced completely but once you learn to use the map rather than control groups its a lot easier",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the most enjoyable RTS pvp experience I've had in a long long time.\n\nI've been craving a competetive RTS that I could try to master, something that was strategically rich, with a healthy matchmaking pool. StarCraft2 was always too \"twitchy\" for me, and I could never play more than a game before feeling strung out. BAR might be the most comprehensive RTS I've ever seen, but it's heavyweight and feels like you need a PHD to reach basic competency. CoH3 is refined, with enough variety to offer real expression in how you play, and paced just right so each battle is a sequence of meaningful decisions, reactions, and gambits.\n\nCoH3 is relic at their finest. The territory based resource system encourages fun game play. Push and pull across the map, manoeuvring and out manoeuvring, flanking and traps. The limitations on units you can field means you are encouraged to be deliberate about your investment choices, and it's about how you use your units, not how many you have. The crescendo of the battle is excellent. Veterancy means your initial units remain important to your strategy even as the battle escalates. The escalation through light, medium and heavy armour presents very real shifts in the battle dynamic.\n\nThere is a ton of emergent strategy. Line of sight, accuracy, elevation, movement, damage and range, armour and health - it all *makes sense*, and diving deeper into the mechanics and stats of your units can be really rewarding, offering you a tactical edge.\n\nThe allies vs axis dichotomy allows the game to have the variety of 4 factions, but with a much lower match up burden. Choose your favourite, and know that the opponent can only be one of two core options. Battlegroups are a great way to add variety without a huge knowledge burden. I was very happy playing DAK Italian infantry, and branched out to try combined arms when I wanted to. I'm 200+ hours in now and am quite comfortable with most of the DAK battle groups, and am excited to try out an ally faction in a similar way.\n\nI don't really engage much with the cosmetics being sold, and I don't feel I need to. I'll pay for something if I think it looks worthwhile, like new battlegroups if I think they will be fun to use and give me cool new strategies to try.\n\nI am excited for Endure & Defy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I find myself going back to COH 3 whenever I'm looking for a quick battle.  No other RTS has such diverse tactics, great pacing, and rewarding moment to moment gameplay.   \n\nRelic deserves credit for the continuing support of the game.  Balance team in particular makes thoughtful changes keeping meta fresh.\n\nThis game can also be frustrating at times, particularly team games.  A few misclicks or a bad team mate can doom otherwise winning games.  There is only one multiplayer queue and it is frequently full of idlers and ragequiters so it's rare for 3v3 or 4v4 to be competive to the end.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is amazing. As always this is one of the only titles in the RTS genre that never disappoints. And now with the Italian DLC I can play the partisans as I always wanted.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is quite solid.\nGraphic is same tier with COH2 and lean toward different (not bad) setup. Not a huge leap toward nextgen graphic (for what?) but good enough for me.\n\nThe fact that Relic keeps updating the game and releasing new content proves their commitment to the franchise, and I deeply appreciate that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game had a rocky start but they've kept improving things and it's now one of the best RTS ever made.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One the most unique WW2 games in its genre, been a fan of this series for over a decade. COH3 started slow but has constantly improved, and is a lot of fun to play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I got it on sale and it is definitely worth it.  Entertaining yet challenging.  Cool game!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Coop gameplay in this is my favorite RTS in 20 years. Digging in, tank traps, anti tank guns, MG gunners against max difficulty AI. HOLD THE LINE!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played COH3 for almost 260 hours because it has good potential for replayability and experimentation, especially with the release of new battle groups.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this wonderful WW2 game that could help inspired my fanfic stories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is super fun, and only gets better during the mid game. Learn the hotkeys, they will save you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played through the singleplayer campaigns and had a blast. I didn't like the meta-level Italy campaign, but I just loaded each battle individually and played it that way, without the CIV-style overworld, which felt rather joyless to me. Enjoying messing around in the skirmishes. Not a huge multiplayer gamer, so not too bothered by all that. Nice to have a new COH game in the series!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a fabulous game for moment s of fun and enjoyment. I played the first 2 Company of Heroes games and loved those as well. A continuation of what works and the graphical improvements are excellent...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has truly improved over time. The developers have consistently added new maps and fresh content, and you can really see the progress with each update. Little by little, it’s becoming a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its gone along way since the doom at the start. now matured to an amazing game. lots to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'd recommend this is you're a single-player fan I think. I know this game gets a lot of flack and I may be biased as I'm just such a fan of the tactical pause. Makes it a doddle, even in a big battle, to maintain control of my troops (and to soak in the spectacle). I did become disabled a few years back and so this feature is just a godsend. Really frustrates me games like the new Age of Empires lack this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2.2 is finally making this game feel finished. Still a few odds and ends to take care of but at present it feels really good compared to how it launched.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the gameplay and the historical military comanies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has evolved into a great rts game and a good addition to the coh franchise. I wish they'd quit goofing off and make a pacific theater expansion...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A genuinely well-balanced game at last. It shines even more when played with others, so I highly recommend checking it out—especially for fans of Company of Heroes 1 & 2. Definitely worth your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's simply the BEST real time strategy game out there for WWII history buffs, and arguably one of the best RTS ever created, especially when you put weight on sound and graphics quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not sure how bad it was at launch I recently picked up on my Xbox ally x as a introduction into pc Gaming to mainly enjoy RTS which is a genre that is lacking on console I'm enjoying this game a lot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10!!!\n\nCompany of Heroes 3 is a brilliant tactical RTS that delivers intense battles, smart strategy, and a truly immersive wartime atmosphere. Even if you’ve never played anything like this before, the game is easy to get into and hard to put down.\n\nThe combat feels incredibly dynamic - every decision matters. Positioning, cover, flanking, timing, unit combinations… it all comes together in a way that makes every fight feel dramatic and meaningful. Whether you're holding a desperate defence or pushing for a bold assault, the game constantly rewards clever thinking.\nThe dynamic campaign is a standout feature. It gives you real freedom to plan your operations, move armies across the map, and choose how the conflict unfolds. Instead of just following a linear set of missions, you shape the entire flow of the war yourself.\n\nOverall, Company of Heroes 3 is an exceptional strategy game - deep, exciting, and full of memorable moments. A must-play for anyone who enjoys tactical, thoughtful gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good once you get hang of it, i wish you could buy battlegroups with in game currency thou",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've only played the Axis Nortrh Afirican campaign so far. It was fun and took me roughly 8 hours. With the second campaign through the Italian theatre and the 60% off discount I purchased the game for I feel it is great value for money. I've dipped my toe into the multiplayer experience. For those that enjoy both single and multiplayer, this is a great buy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They fix a lot of bugs and improve a lot of gameplay. The game is better now that on release day. I like some of the new generals. I wish the game have more movies on the story like the promo video. Also be great to have some coop campaign like Company of Heroes 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game... Idk why everyone hates on it so much.  Ive gotten alot of fun and entertainment from this game.  I played all of the COHs up to this point and yes the other ones have some really good features I dont think this one is lacking in any extraordinary way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game, some says that CoH2 is better than CoH3 and here i am enjoying CoH3 more than CoH2 due to latency issue that im dealing with in CoH2. The game cover the African campaigns of WW2, some of people asking about French they might be added to the game since they r part of the allies during this campaign, we just have to wait for now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What to write after 300 hours on coh 2, I can say that the initial disappointment remained, especially for the mission, they tried to continue with various patches, but I didn't get the American campaign. Those who like coh 1 and 2 unfortunately have to accept that coh 3 is not as good as far as the game is concerned, the rest is the graphics, the extra units are extra good idea, definitely, 1 to 2 times a week I try to play singles, everything could have been much, much better better overall, I recommend it if you are a die-hard supporter of the coh series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game has improved a lot since launch and Relic is updating, adding new content and balancing the game still. The campaigns are really fun especially the Italian one. MP is fun but can be rough in matchmaking at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game has come a long way. Best in the series and honestly once you play this, it'll be hard to go back to COH1 and COH2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's been over two years since the release of COH 3 and despite the fact that the game is enjoyable in so many ways, I have a big problem with the game that hasn't been solved and that is the Axis forces doesn't have proper anti everything infantry (anti infantry anti vehicle) I wish they would add some extra anti tank gear for the likes of Panzergrenadiers. I definitely recommend the game but mind the fact that if you are playing with Axis and your enemy is using vehicles early in a match, you're done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid CoH game with constant updates and nice playthrough on multiplayer. Campaign still needs to be changed in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relic has some devs that listen and think of new ways to innovate every year. Great games since the first, have played this trilogy for decades and will continue to support each DLC because it is more than just skins and what every other major company is doing right now! Good on them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved one, 2 was amazing, 3 is 3rd best. Still amazing and worth buying if you liked the previous two. I would not say its worse, but it is not the best.\nWith updates and a community that is still active, I would say, give it a shot!\nGood WW2 games can be hard to find.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after so many updates coh 3 has been improving since release well for the multiplayer atleast the campaign is decent with the dynamic italian campaign and the dak campaign i wish it had more like its predecessors none the less i been enjoying the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The contents are still lacking, poor and overly expensive cosmetics, expensive DLC's, consists of players who always complains that the opposing faction is too OP, blob your way out of it type of game. I can say one of the best rts games out there but on a serious note the devs should listen to the community more and give a better balanced content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "COH3 I think is a good successor to COH2. The graphics are good of course but the gameplay is much more faster paced than the second one. While I do love a good match where you just throw hands for 4 hours, this feels like the battles happen quicker and more often. The AI as well has been much more improved than 2. The campaign is ok for me, while I do like it I prefer the level based system they did before in coh2. The biggest thing I hate about this game is the battlegroups and how they are all paid dlcs instead of something you can earn. While I do like this new system rather than the commanders, they should have a lot more content in them than they get and I hope they improve upon. The UI also doesn't feel like a coh game, it feels empty and without the feel of ww2 in it.\n\nOtherwise I think its a solid game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New campaign, new game play and new settings in beautiful Italy and the arid and harsh North Africa, everything feels refresh yet it is still the same Company of Heroes feel. The only downside I feel is the explosions and the way how buildings collapse in this game is not as good as in CoH2. It doesn't feel as real and as authentic. Having said that it is a fun game to play and hope future expansion can include more better single player campaign and more countries and theatres to play like the Pacifics or the not so much talked-about Chinese Theatre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is mostly a return to form. Love the game only complaint is that the dlc is cool but way too expensive for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Certain aspects I like better in this, certain stuff I like better than 2. Still a great play regardless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While COH3 is different from the prior COH games it is an outstanding game in its own right.  It continues to be supported and expanded.  I enjoy the variety of units and tactics that continue to be expanded with new DLC.  Graphics are great and though there are occasionally balance issues the devs are always working to solve them.  Some reviews are negative because this isn't like COH2 but its not supposed to be.  I have 4000+ hours in COH2 and 500+ hours in COH3 and enjoy them both immensely as they are different games which is a very good thing.  Overall this game is great and keeps getting better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is addictive!  Solo, or with teams, it's really fun.  I do miss the second version, but this one makes up for it in graphics.  Give it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im glad the team is supporting the game post-release, even with their clearly limited resources. I've enjoyed playing the game, even with all the flaws. I think the main issue for this game is that the developers tend to listen to a very vocal minority of the playerbase, primarily composed of the top 1% multiplayer players. it leads to balancing issues, unfun gameplay changes, etc. sometimes, the jank and spam and crazy 'tricks/tactics' with certain utility units is what makes company of heroes fun. im giving a thumbs up because i have faith the developers will continue updating and making the game actually worth calling a Company of Heroes title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of a Good RTS World war II and you need to use your 2 brain hemisphere just to strategized your infiltration to enemy and defense maneuvering. Battlegroups are cool and both factions have advantage and disadvantage. All you have to do is to learn how to counter them.\n\nHoping this game will continue to update the game, improve mechanics, balance the game and as much as possible minimize the errors and problems encounter. \n\nlastly please bring new factions (Japan empire, Soviet) <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is good reminds of COH1. the afrikorp campgaign is a lot better than the other one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, best enjoyed with friends. Coming to this from COH2 just felt like a global upgrade. Unit timings, pathing, vision: there are many micro quality of life improvements that make this worth the money. The community will hoot and holler about balance issues until the cows come home, but they are not anywhere near as bad as they make them out to be. Come have fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like my Stalinistic face says, I do appreciate that the 3 balled god has returned from the OG -games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game but wish there was more modding potential dislike that all the vehicle skins have to be bought but its a small thing to overlook",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game essentially combines two styles: a turn-based strategy similar to Civilization and the traditional Company of Heroes gameplay. In the turn-based mode, you occasionally enter battles that transition into a real-time Company of Heroes mission. I can see what the developers were aiming for—it adds variety and perspective, and it’s enjoyable—but I personally prefer to skip the turn-based portion. Thankfully, the developers made that possible by allowing players to use mission select and play the missions consecutively. I find these missions to be well-made and engaging. Some people in the reviews complain about the story, but I don’t think it really matters—it’s fine as it is. What truly counts is the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a good game, experienced from coh1, coh2 and now coh3.  \r\nPros -  better graphics and good maps and mods\r\ncons - needs still better ai for coop or skirmish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing all Company of Heroes Games in the past weeks. Here are some thoughts on how these games compare to one another. This review is soley focused on the singleplayer aspects of the game. I did play skrimishes against the AI, but they tend to get boring very fast, if you dont have the choices of commanders you do from CoH2.\r\n\r\nLoving the campaign style of CoH3. The colors are bright which can put you off, if you're used to battles on the eastern front of CoH2 or the grimey visuals of CoH1. I dont mind as much. The colors feel like Italy if that makes sense. Its quite the contrast to the harsh reality of war. \r\n\r\nGameplay is not as finicky as in CoH1. There is a button to reverse vehicles. Very nice. Veterancy system now has two options to choose from, meaning more flexibility on how to deal with the enemy. E.g. If you play with the US, your rifle squad can either go fast, or do suppressing fire. Running faster is nice, if you encounter an enemy who uses mortars and keeps you moving your troops. If your enemy has more of a static frontline and loves to charge with blobs of infantry, the covering fire gives you a good boost to rate of fire and you deal more suppression damage. In addtion there is a new breach mechanic for infantry, meaning you can storm occupied buildings. I dont use it very often, but it's nice to have that choice.\r\n\r\nCampaign for CoH3 gets a bit repetetive. I would've loved more handcrafted missions. Or at least more dynamic skirmishes. Relic did patch in a few more, but they do tend to be samey. Units on the strategic map are sometimes a bit weird to move around. You can customize each unit on the strat map to be to your liking. However upgrading your units on the strategic map is only really a question of choice in the earlier parts. Taking inspiration from CoH2 US campaign would've been nice. If every unit is unique, it's always a question of how to play it.\r\n\r\nMy favorite unit is the special forces. The SSF Commandos are really powerful, because they do it all. The can hide in cover, the can switch from rifles to bazookas.\r\n\r\nComparing the SP stuff from 3 to 2, I do love the addition of the strategic part, but I miss the whole story element of the soviet campaign from CoH2 (that was really a blast). The comparison to movies and tv shows is not far of. In that sense I would've loved a campaign for the SAS (the tv show called \"SAS: Rogue Heroes\" is fun and a good watch); either with a strategic map in north africa leading up to the Italy campaign, or a campaign in the style of the soviet one in CoH2.\r\n\r\nBut there is no beating the the good campaigns of CoH1. These were some of the best RTS campaigns I've ever played. CoH2 felt too short in that regard, and CoH3 lacks the story depth of both 1 and 2. There are some story elements hidding in CoH3, but it's just not enough.\r\n\r\nWould I recommend Company of Heroes 3 right now? It depends. If your a junkie for Online Matchmaking stay with CoH2 for now. If you like the war stories from 1, also stay away for now.\r\n\r\nIf you want a new strategic experience in the clothes of a game, you are familiar with, then this is the game for you. It changes things up a bit, but not too much. \r\n\r\nI personally love all the Company of Hero games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its vary much the same as before not sure what ppl are complaining about in all honesty the campaign was a bit different but still sorta the same i dunno what the issue is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I come from CoH1 and I was in the top 100 with the British both in CoH1 and CoH2. In my opinion, Company of Heroes is the best RTS ever made, and CoH3 is its best version, because it combines the best elements of CoH1 and CoH2 while adding much more physical realism and some small but important improvements (for example, you can no longer build while capturing a point with the same squad). I would recommend it to everyone.\n\nBut unfortunately, I think the most appropriate name for this game right now isn’t Company of Heroes 3 but Company of Cheaters 3. That’s right — there are cheaters everywhere, many of them Chinese players, doing all sorts of disgusting things on the ladder such as: maphacks, instant destruction of cover, infinite squad health, invincible tanks, and so on. They’re so common that if you play ladder games, you’ll meet one in about every two games, especially if you’re winning.\n\nNo one is punishing these cheaters, and I’ve even read on a Steam discussion that some people believe Relic is doing nothing out of fear of losing a large portion of the player base. This isn’t just offensive and unsportsmanlike — I believe it’s also illegal. It’s my firm intention to organize a class action with all the fair CoH players to force Relic to take serious action, because I paid over 80 euros for this game (real money, not duckdollars), and I expect to be able to play ranked matches without seeing cheaters sitting at the top of the leaderboard.\n\nAm I wrong?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Company of Heroes 3 - Review[/h1]\n\n[b]Playtime disclosure:[/b] ~130 hours\n[b]Platform:[/b] PC via Steam\n\n[h2]Summary[/h2]\nCompany of Heroes 3 is a modern, high-quality WWII RTS that delivers strong campaigns, polished presentation, and reliable performance. The official map roster could be broader for certain modes, but Steam Workshop support and an active community add real depth. With a larger nation lineup, it could become \"the\" WWII RTS to play.\n\n[h2]What CoH3 does well[/h2]\n[list]\n    [*]Visual and audio quality are excellent. Environments, unit models, and effects look great, and units and characters are properly voiced by human actors, which adds authenticity.\n    [*]Terrain deformation and destruction are excellent. Artillery, explosives, and vehicles actively reshape the battlefield, creating craters, breaches, and new sightlines. Deformed terrain provides real defence bonuses to infantry, letting squads use craters and improvised cover to hold ground more effectively.\n    [*]Campaigns are engaging and varied, with meaningful strategic choices that keep the experience fresh.\n    [*]Stability has been strong across ~130 hours. Bugs or crashes were rare, and almost all were related to mods that needed updates.\n    [*]Steam Workshop integration is a standout. Community content is easy to find and install. Recommended mods include Game Modes Plus, AI Plus, and the No Nanny tuning pack.\n[/list]\n\n[h2]Where it falls short[/h2]\n[list]\n    [*]Limited official map selection, especially for 2v2. You can add many high-quality community maps from the Workshop, and Relic has run map-making competitions that produced great results. Even so, more official maps would improve matchmaking variety and balance for 2v2, 4-player, and 6-player games. I have spent at least 80 hours in 2v2, and that bracket needs a deeper pool.\n    [*]Faction breadth. I understand that, given the theatre Relic chose for CoH3, they focused on the current four factions. That choice makes sense for the setting. If the roster expanded to include a Russian nation on the Allied side and a Japanese nation on the Axis side, with their own battlegroups, this game would become \"the\" WWII RTS to play. Relic do not claim it is the best, but with a larger nation lineup it damned well would be.\n    [*]DLC pricing. DLC prices are on the higher side. I was comfortable paying them, and I appreciate that Relic bought themselves away from their publisher and returned to self-publishing. That is worth supporting because it gives the developers freedom to make the games they want to make, not just whatever suits a publisher’s bottom line. With ~130 hours of play and more than A$150 spent across the base game and DLCs, I feel I have absolutely had my money’s worth.\n[/list]\n\n[h2]Wishlist for future updates[/h2]\n[list]\n    [*]Add a Russian faction (Allies) and a Japanese faction (Axis), each with distinctive battlegroups.\n    [*]Expand the official map set for 2v2 in particular, and add more options for 4-player and 6-player matches.\n[/list]\n\n[h2]Closing thoughts[/h2]\nIgnore the negative comparisons from CoH1 and CoH2 players who expect a carbon copy of earlier titles. CoH3 is an excellent entry in the series on its own terms. I have enjoyed it so much that I have bought and gifted the game and DLCs to friends, just so we can play it together.\n\n[h2]Verdict[/h2]\n[b]Score:[/b] 8.5 out of 10  \n[b]Recommendation:[/b] Strongly recommended for RTS fans and returning Company of Heroes players.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The only gripe i have with this game is that most if not all DLC appears to be for skirmish and not extra campaign units. Which is a shame as i do prefer single player in some games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is nothing else like it! The thrill of managing your units in a hectic firefight is unmatched in any other RTS. I like to daydream about an alternate reality where this game is huge like CS2 or DOTA and, as a result, gets massive support from the developer and we get an endless amount of content to sink our teeth into....but we can't have nice things because the Universe is a chaotic mess and nothing makes sense. I thought Relic improved over COH2 in every way. I feel like Relic has been sh*t on so hard by the gaming community that they may never return to their former glory. Yes, their DLC policies are atrocious, however, they are completely in line with their peers in that regard. My 100+ hours in this game is purely from skirmish vs CPU, if that's your jam, you will have a great time. Ignore all of the negative review and give the game a chance, make your own opinion!!! I want to shout out to the Relic developers and say thank you for making this unique gem of a game, I hope success for all of you and I hope these smooth brains stop banding together to heap unfounded negativity on your company.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "COH is my favorite RTS game and series of all time and this adds a whole lot to it. \n\nI hope they can balance it but so far it seems good and has been great fun so I hope everyone picks this one up as I recently did!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Game is a great improvement from COH2 a very diverse campaign and great multi-player experience (with the right team.) \r\n\r\nThe solo campaign is a great and have dramatically improved on the flaws of COH2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome Installment in the COH series, COH was awesome and COH 3 is awesome, COH 2 is utter garbage.\r\n\r\nTotally worth the price, play alone in skirmish to chill or jump in coop vs ai for crazy rushes on VP's, I do with Coop vs AI had annhilation mode available and not just Victory points as it completely changes the entire playstyle of the game. VP is fun but I prefer having to wipe your enemies out completely.\r\n\r\nonline I dont personally play much vs others as with any RTS I just dont enjoy it, old starcraft was great but today I just dont like the community in any of these RTS for PVP, PVE is where its at for me as I like to just enjoy my games and not sweat.\r\n\r\nTLDR, worth the cost, if you like COH , grab COH 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Writing the review for steam awards but i really like it. Relic keeps improving the game and adds new things. I only wish the battlegroups weren't that expensive and there was better way to grind merit, similar to coh2. Still i love the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth buying if you enjoyed the previous games in the series. On sale often, and definitely worth picking up at 20%+ discount.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Company of Heroes 3 is a real-time strategy game developed by Relic Entertainment that continues the acclaimed World War II series with new mechanics and larger-scale tactical options.\n\nGameplay combines traditional squad-based combat with a new dynamic campaign map. Players command Allied or Axis forces in Italy and North Africa, managing both battlefield tactics and broader strategic decisions such as capturing towns, securing supply lines, and deploying reinforcements.\n\nCombat remains intense and detail-oriented. Cover, line of sight, and terrain elevation heavily influence engagements. Infantry, armor, and artillery units must be coordinated precisely to exploit enemy weaknesses. Destructible environments return, allowing for tactical adaptation as buildings collapse and terrain changes mid-battle.\n\nThe major addition is the dynamic campaign system, functioning like a turn-based layer above real-time battles. It gives players freedom to choose missions, plan offensives, and manage logistics. This hybrid structure expands scope beyond previous entries, introducing a light grand-strategy element.\n\nVisually, Company of Heroes 3 runs on the Essence Engine and delivers realistic lighting, detailed models, and strong environmental destruction effects. The Mediterranean settings are bright and varied, contrasting with the darker tones of earlier games.\n\nSound design is excellent. Explosions, gunfire, and voice lines are sharp and context-sensitive, while the orchestral score complements both quiet buildup and large-scale assaults. Voice acting and radio chatter enhance immersion and authenticity.\n\nOverall, Company of Heroes 3 evolves the series without losing its tactical identity. It offers more strategic control, improved visuals, and refined combat depth. While the campaign pacing can feel uneven, it remains one of the most complete and engaging modern World War II RTS experiences.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best RTS out there! I played it again and again with friends or without. Unique playstyle, focused on strategy and tactics. One of my favorites!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best RTS on the market right now.  Gameplay that's easy to pick up and never gets old, 0 bugs, awesome post-launch support, independent studio.  A Mixed rating is just insane.  Rock on Relic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm playing skirmish exclusively, and not terribly well, but it's fun and I'm getting better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has come a long way since it came out, and as a longtime fan of the franchise, I can say that I recommend it.  My only gripe is not being able to zoom out more (but that's a gripe going back to COH2).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's good, the only disadvantage is that you have to play a lot to decrease your ELO so that you play against modest players , and to have a chance to win.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty cool game, definitely an upgrade from COH1 + 2",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "decent every update its better in better can-t w8 for few years to be ultra good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good. Don't trust toxic CoH1 CoH2 reviewers - those guys are stuck in the past and they're beyond saving.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I had a life and family before buying this game, but now i don't remember where are they, I hope they're okey, this games rocks for those who like RTS and RTT's games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "At launch this game needed some work, true, but now it is an absolute MASTERPIECE. Stop reading this bloody review and buy the game already. The people who give this game a thumbs down are clearly idiots. This game is incredibly addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like 2 but better. No complaints on 2 but this blows it out of the water.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Italian campaign - great! North Africa - okay!(don't get the idea about the story for NA)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not bad! It's kinda hard to describe, but it's basically CoH2, on a different front. If you like that, you should like this. I personally wish they had an expanded more generalized \"Conquest\" style campaign like from DoW1, but the campaign is good overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Where is my stumtiger and close the pocket.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its in a much better state these days, would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "We just need Japan and Soviets to be the BEST GAME OF ALL TIME!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so much fun. great tempo. map scenes are not useful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't let the negative reviews stop you from getting this game. it's a solid RTS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game good. Bring more Battlegroups pls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and a big fan of the previous games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing game like always. I've played this game for 100s of hours and it just never gets old",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game, i want new dlc and faction",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Enjoyable. Low skill required for entry. Very high ceiling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game better than i thought it would be. If you get on sale worth it forsure. Two thumbs up",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Good game,\nTerrible player base.\nA lot of antigame behavior, and a severe lack of fighting spirit from many players who are ready to throw the match at the slightest setback from the very beginning.\n\nPeople who refuse to play from the first minute, or who attack their teammates because they lost the previous match against someone who is now on their team, or because of some other offense they think they suffered.\n\nWhy do I have to deal with being matched with the same players again right after having a previous game ruined by someone I reported and blocked?\n\nFurthermore, I’m French; why am I constantly being matched with Asian players who don’t even try to communicate in English, or communicate at all?",
      "voted_up": false,
      "votes_helpful": 120
    },
    {
      "review": "Not Recommended — Great Ideas, Wrong Priorities\n\nCoH3 could have been amazing, but the devs keep focusing on DLCs instead of fixing the core game. We’re getting new battlegroups and random additions like Italian Partisans under America, which makes zero sense and shows how inconsistent the design direction is. If you add irregular groups to one side, then the Axis should get their own equivalent auxiliary forces too keep it balanced and keep it logical.\n\nMeanwhile, the real issues remain untouched:\n\n- Unstable balance — some units and factions dominate while others are underpowered.\n- Recurring bugs — old issues resurface with each patch.\n- Unclear faction identity — battlegroups and units often feel disconnected from their faction’s theme.\n- Weak communication — developers rarely explain decisions or patch rationale.\n- Missing major factions — players have been asking for Soviets, French, Pacific factions, and more.\n- Campaign issues — slow pacing, repetitive objectives, and weak AI make the experience underwhelming.\n- Multiplayer frustrations — untested or poorly balanced units affect competitive play.\n- UI and Quality of Life problems — clunky interfaces, unclear unit info, and missing helpful features.\n- Long-term player retention — constant meta shifts and patch changes make planning and strategy frustrating.\n\nPlayers are asking for improvements, quality-of-life fixes, and meaningful content not more paid add-ons stacked on an unsteady foundation. CoH3 has strong features and huge potential, but until the focus shifts from DLCs to building a stable, coherent game, it’s going to remain a frustrating experience. I feel like the team is prioritizing DLCs over actual improvements for the community.\n\nPlease listen to the community, as we experience and feel the weight of your actions.",
      "voted_up": false,
      "votes_helpful": 100
    },
    {
      "review": "After 415 hours playtime i still struggle with the game. Its only fun because i play with friends every now and then. Too many DLCs and extra cost. At the same time after 2 years (or more i dont keep track) we still dont have USSR forces. Why?! Just why?! We got canadians and australians while USSR is still NOT in the game?!?! i cant make any sense on this being a WW2 game. Just DLCs while the game is still incomplete. Much more i could write but for now the game is nowhere close to COH2 or COH1, its just incomplete... I bought 2 DLCs and they still coming, fix the game if you expect us to spend more money just for a tank or squad. \nI never almost write reviews, and i have been waiting 2 years at least with COH3 to be fixed but no, no fix, just DLCs.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "I dont know how to explain this but, i'd rather not recommending this game to other players due to the recent update and nerfing more on Axis versus in Allies. I appreciate the update and adding new battlegroups but nerfing on the faction even though we didn't ask you to? I dont get it why the devs favored more on Allies than Axis?. After reading your recent update, I read long paragraphs of nerfing Axis and only one sentence of nerfing on Allies. Like what? Before I recommend this game to other players, please make sure not to nerf more on the supposed factions.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Not a 60$ game. COH2 has more content. Hardly gets updates. Map selection is FAR less than COH2.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Your MUCH better off playing COH 2\n\nThis game is absolutely not worth buying at all, even if its on sale i would advice you skip this one.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "60$ for an unfinished game even after two years and a awful community isn't worth it, just buy COH2",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Hey, almost 100 hours player here, don't buy this if you don't wanna play allies all the time. Imo it was kinda balanced before but know its completely broken again like COH2. Land mattress and tunnels... Question for the developers and QA: After this update, do you really believe this game is balanced?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is only acceptable if you play with friends; otherwise, there is no point in buying COH3 instead of the previous games.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "its the third time i try give a chance to this game.\nGraphics are diferent but not that better from game 2. the sound effects are worse. the game is fast paced now. too much \"locked\" content behind \"trees\" of choices and all, all this to try give the sensation of choice but when you go to the game, its the same bad game design of game 2. instead getting inspiration from starcraft 1 when ALL things are free to build on matches. you still have more units locked than you can train. even dark colony have  things right and modern RTS are drifting from the \"basic tools should be avaliable to all\". the \"grid\" hotkeys system  are \"odd\". they try make things better/diferent but fail in the execution. bought the game on sale. only the base game to avoid waste my money and was a wise decision. even with all the flaws the game 2 is still better than this (same problem with total war warhammer 3 and 2...) i really dont know what is going on with studios these days. they have a good base formula of the game and instead making it better. they just \"no!. lets make things -unique-\" and than they forgot to give the basic well made (dark colony by example.)\n\"but the mod x y z give you this... and...\" NO man, i dont want to use mods because if i use mods i cant play against other players because they need have the same mod too and this is a torment. in warhammer its a total single player experiance focus, that works until page 2. but i come here expecting a good game to play 4v4 like i do in game 2. and the game 2 still \"less bad\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The gameplay UI kills it for me.  The HUD overlay takes up a lot of space.  No scaling option.  The camera zoom is obnoxious.  I am always trying to zoom out further.  Mediocre experience.  Glad I only paid black Friday prices.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Deleting criticism comments in the updates. Good luck, bitch.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I should start by saying I love this game and it pains me to do this, but I am pissed because of the stupid anti-piracy software blocking me from legitimate use of a game I paid for. I tried to run it on Linux and was having issues getting it to run because gaming on Linux sucks. I was performing some standard troubleshooting by attempting to run the game using different versions of Proton and I started getting a message. \n\nI'm getting an error from Denuvo saying \n\nYou can no longer authenticate on new devices\nCurrently your game purchase cannot be re-validated successfully, please wait 24 hours and try again.\n\nI bought the game and was doing standard troubleshooting by trying to run on different versions of Proton but go locked out from it. Even when I return to a Windows computer which the game has run on many time flawlessly, it is still locking me out. This is unacceptable to do to someone who paid for the game. I don't understand what the point of this block is since anyone who is set on pirating the game can do it through other means. I am just trying to play the game I bought fair and square but the stupid software is blocking me for no legitimate reason. I get wanting to protect your game from piracy but this just a low effort block which gets in the way of actual customers of the game, and should not be an acceptable practice when there are methods you could implement to protect against piracy than a simple \"have they installed the game too many times\" check. \n\nDon't touch this game if you are trying to play on Linux or if you need to install it legitimately in multiple places. I really want this game to do well, but this is pretty frustrating.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Unbalanced game where all the interesting battlegroups are behind a paywall",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dont buy this game, relic has no clue on how to balance the game, every single time me and my friend play this game we cant understand how relic managed to make it so shit",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Anyone enjoying this sell-out or nah?\n\nStill crashes, still no real mods, still shit DLC and most of all, who the fuck did the design of anything in this game, not even the voice-acting is on par with the last two games",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h1] 💀 DO NOT BUY: Skip This. CoH 1 & 2 are WAY Better. [/h1]\nI have been a huge fan of Company of Heroes for years, but this game is an unpolished, broken mess. It feels like a massive step backward from the first two games.\n\n・The Broken Mess\nThe game is full of problems, making it a frustrating experience:\n-Bugs and Polish: It feels unfinished. There are too many bugs, especially with the sound crashing or units getting stuck.\n-Gameplay is Off: The core battles feels wrong compared to the tight, solid tactical feel of CoH 1 and CoH 2.\n-Graphics are a mess: It looks cartoonish and cheap. Seriously, the graphics are worse than the first Company of Heroes which came out almost 2 decades ago.\n-Weak Explosions: Explosions have zero impact. The visual effects are pathetic, and the sounds are thin and underwhelming. They look and sound like cheap fireworks, not real warfare.\n-Bad and janky animations : Unit animations are noticeably janky and unfinished.\n-And many other issues etc etc\n\n・The Audio Nightmare\nThe sound design is a disaster that kills immersion and tactical control\n-Bugs & Crashes: Audio cutting out or outright crashing is a frequent\n-Cringe spam: Units constantly spam repetitive, cringe lines when out of contact, filling the comms with nonsense.\n-Combat silence: Units spam pointless lines when safe, but when they are actually fighting, they stay silent. You often don't realize they are in a fight until they are already dead.\n-Bad Voice Acting: The voice acting is unbelievably bad and immersion-breaking. The British and German accents are terrible, the worst part is the German soldiers. Why do they speak with a jarring Chinese accent? Why is CoH1 and 2 voice acting so good but this game feels like a joke?\n\nThe only good new features are the infantry mounting and heavy weapons mounting. That’s it. Everything else is a downgrade.\n\nI knew the game is a massive let down when it was released so I waited for updates hoping the devs will fix the game, but even for now (the game was released 2 years ago), it's totally beyond saving at this point.\nCompany of Heroes 3 is a product that needed much more time. It straight up feels like you are playing a knock-off mobile game of it. It fails technically and creatively, offering a worse experience than its older brothers. Don't waste your time or money on this. Play CoH1 or CoH2 instead.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you're looking for something like 1 or 2, look elsewhere. This game just feels empty comparatively.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Without even going into the massive amount of greed the publisher has shown, just look at it.\n\nLooks like a cheap Chinese phone game, play COH2 instead.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Fugg Relic, I want to play this offline because no internet available but it needs a connection. For what? The biggest part of this game is solo playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ehh, single player is ok, but the online multi player is terrible. \n\nLots of AFK players, no-one communicates, campers, etc. If you want single player, its ok, but if you like multi, its not great at all.\n\nAlso online is very biased toward german tanks. If they make it to full tanks you can't win as allies. Now with the new STG 44, you can wipe two riflemen squads with one engineer squad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In only 20 hours I have came to the conclusion of run from this game. It is mental German abuse every match online with halftrack GL or flame squads spam and 88 emplacment spam. Do not recommend until rebalances.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have played the old COH many times. After I bought this COH3, sad to say it was a huge dissapointments.  I am not sure what i was playing, the graphic is nothing compared to the old COH, the game play is rather boring. The maps are too wide and  the control, colors and UI for the selection are bad and not user friendly. I just stop playing after 2 hours play. That's it, no more.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Worst game in the franchise, years into live release and they still can't fix basic issues like pathing! Don't buy, I didn't want to buy it and recieved it as a gift. I still want my money back",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Devs killing fun under the guise of multiplayer balance.  \nPaid for Deluxe Edition so that I as a player have to waste my time and endure a bad patch until they realise they were wrong and roll back the changes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a bad pay-to-win game full of cheaters with no consequences; nobody buys it. It's a shet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game is good but the mission i got annoyed.. how u think we should have deal with enemy the enemy that have tank, in short time and we have only limited resources.. u really get to my nerve in this game.. \r\nand the mission that have turn, please its not good.. wtf is thatt actuallyyy.. very2 limited resourcesss... and the mission we have to cover the whole area.. our troop is also limited due to have to wait for turn for the resources to increasee.. haisshhhhhhhhhhhh very bad for my mental health HAHAHAHA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The reason for my negative review is not because i don't like the game. Ultimately, it is playable, even if it needs work in terms of balance. The point is the content. This is a game that focuses on North Africa and the Italian Campaign, and some people will think, \"Ah, Italy will definitely be included\" but no, Italy is not a faction, there are 4 battlegroups with this new update, the last of which is for the Allies. It feels like playing CoH1, there is nothing new. Relic has created a game about two theatres that feature Italy, and it's not even a faction. What was the point of creating this game if you're not going to include Italy in the end? It's like creating CoH2 without the Soviets and making them battlegroups. It's truly pathetic and shameful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Leider lächerlich schlechte und unauthentische Voiceover!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought this game even after reading the bad reviews, and heard the newer ones saying the game improved. I finally tried this game for myself, and I have came to the conclusion this game was made on Scratch and a $5 programming template pack. This art style is too cartoonish, the voice lines are dull, and the mechanics are far too confusing. Not close to CoH 2 at most. Not to mention the shop looks like the OG Fortnite item shop. \n Overall, Im pretty disappointed, and ill be sticking to CoH 2, & couldn't even finish my first match without feeling revolted.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Worst Company of Heroes game. Play COH1 for the beautiful modding scene or COH2 for multiplayer competitive.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay: It plays like all CoH no real change from previous titles in the franchise.\n\nGraphics: I mean its updated for the times but still nothing over the top.\n\nControls: Same CoH control settings that we are used to seeing in the franchise\n\nPrice: I mean for the initial if you get it under $40 its a good deal, and additional DLC is BS unless you want a specific \"Battle Group\".\n\nDLC: This is where it becomes a negative review. Now we have to purchase DLC for \"Battle Groups\" in CoH2 it was different countries. So we have changed it to Battle Groups now something you could unlock in previous titles of the franchise by playing the game and hitting achievements. Games like this and other AAA titles have for too long taken advantage of loyal players already asking $70 for a game then an additional $40 or $50 for bullshit 2 map limited DLCs. Hell everyone knows the best maps are community made anyways.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Haven't played in awhile so was uninstalling to make some room and this game going to force open a chrome tab to a survey asking why I'm uninstalling.. lmfao wtf who thought that was a smart idea",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After realising that the game is bad from the videos that I've watched, I decided to wait for 2 more years just so they could polish a bit more. After seeing that the game is pretty cheap, I decided to buy it today.\n\nTried it. This is a mobile game. I realised that I won't have a good experience just from the main menu. It is a 720p png with some dust effects :DD I mean, a good menu design was already there in COH2.  A flag waving in the background with an animation, atmospheric scene, with a banger music. Each background animation and it's music changing depending on the faction that you play as. So it was a total of 5 different background animations and 4 different musics (OKW and US had the same music).How cool was that. Now today it's just gray and some dust particles with a motionless png.\n\nOn to the game itself, the graphics, the animations and especially the weight of units feel so cheap in every aspect. I wanted to check subtle details so I zoomed in many times. It is a massive downgrade from COH2. Idle infantry squads do not talk between each other, they don't do anything, they don't have a proper idle animation, all the voice lines feel the same, tanks are like just toy vehicles. In coh2, I could hear it's engine roar, it took a couple of millisecond for it to reach it's full speed, all of these contributed to the atmosphere. None of these details are present coh3.\n\nAlso while playing, I realised how good coh2's music was. This just has musics which are like youtube action video back ground music.\n\nIf this were to be a first new release IP strategy game, it wouldn't be that bad. But the fact that this is almost a AAA game, with two amazing games before this one, this is unacceptable. Because this is a direct downgrade. Even coh1 graphically, 2006 game, looks better than this because at least it has attention to detail and passion in it. \n\nI remember how in Coh2 soldiers used to make jokes, such as the infamous \"someone stole my biscuit! stealing is not the soviet way comrades\" joke. It's just sad how a fantastic game serie can sink this bad. \n\nI will probably refund, it was incredibly cheap for me but I don't want to finance such a company that I've financed for many years with all the DLCS and the commanders of COH2.\n\nhttps://www.youtube.com/watch?v=BCiWxhqcbHs\n\nLike I said, if you're new to the series, you will probably like this game ( although I'd strongly recommend coh2 ) or played it too much and want some differences despite all the downgrades, go on and play this. It is still a action packed online multiplayer tactic WW2 RTS game.Foundation is still there. It's just that it's obvious that they did not care about this game. Or they lost their talent.\n\nTLDR:\n\nIt is not a bad game by any means. But it is a TERRIBLE COH game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Каждый раз, когда ты запускаешь поиск игры, это настоящая русская рулетка по-японски, когда 8 игроков садятся вокруг с мечами для харакири, а у одного из них меч бутафорскй. Я не знаю, как еще это объяснить. Постоянные фризы, проблемы с коннектом, лаги, дисконекты, дропы, краши - ваши верные спутники на пути поиграть в это. С каждым разом ты хочешь рефанд, но рефанда не будет. Не будет как и исправления лагов, багов, не будет балансировки фракций. Каждый патч - это просто насмешка над покупателями. Я понимаю, релики - маленькая инди компания, не способная адекватно настроить работу соединения, но блядь, просто отбивает все желание играть в ЭТО. Даже бесплатно - это слишком дорого для так называемой тактической стратегии под названием Company of Heroes 3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "With each update the game is much shittier.\n\nDo not buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Scarlett Bison 2.2.0 patch - I don't like AI flanking.  The defy reality and run circles around me.  I end up chasing ai all over the map once I recover being overrun.  Not fun anymore.  I will stop playing if I can't figure out how to undo patch.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initially fun,but with lackluster skirmish maps, and an underwhelming campaign, beyond maybe 6-8 hours, its hard to keep interested. \nSuggestions\nMore campaign replayability. \nMake the North African Campaign an interacgtive map like the Italian campaign. Allow the user to be able to play the Axis forces. Way more skirmish maps needed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "COH 2 is more better than this, more balanced and you can choose more generals. I think this game is half baked compared to the previous one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The AI straight up cheats on the campaign. The last one I played, a Heavy and a Medium Tank roll up before I could afford either. Other times I clear all machine guns on the map, yet machine guns start in 3 buildings from the very start covering some of the most important points. Many more issues have been around from the start, meanwhile Relic just wants to SELL you more battlegroups.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really try to like this game. But the biggest problem is the allied overpowered bullshit. All their tanks armour is wayyyyy to strong. The whizbang needs a fucking nerf to a point where it takes longer to reload to fire again and the fucking piece of shit needs to be limited to 1 per army. Treat it like a super weapon. The allied AC's are too fucking strong. How the fuck can an ALLIED AC beat a halftrack in RL? it'll never happen. You are saying that the mg no matter what version, mounted to a halftrack can't tear through a fucking CAR out of all things? So fucking dumb. Pioneers are weaker than royal engis? this shit is insane. Shermans are always going to be strong as they were in real life. But fuck me dead. The germans have to always UPGRADE armour piercing and always have to go for a doctrine that needs more penetration to even make use of 1 AT. THE PANZER IV IS A FUCKING JOKEEEEEEEEEEEEEEEE. They LITERALLY USED THEM TO FUCK THE SHERMANS UP AND THEY DID IT SUPER EFFECTIVELY. BUT APPARENTLY IN THIS GAME THEY FIRE RUBBER ROUNDS ZERO DAMAGE AND PEN, THE TIGER TANK IN THIS GAME MAY AS WELL BEEN MADE OUT OF A LOAF OF BREAD. Are we seriously having to upgrade alllll the way to fucking t3 to get the immobile 8.8? When all the allied cunts get better arty, better AT, better inf with ez free upgrades for rifles? hate this fucking game. Nothing will beat COH 1. Dont play this piece of shit game for it's multiplayer. I can literally, and i've done this a thousand times, get 2-3 stuart tanks out and just make everyone surrender coz of how bullshit quick you can get the other player to surrender in 1v1. In 2v2+ all you need to do is literally keep capping the fuel, and get crusaders, make the enemy think that you are going mass inf, then just roll  the cunts with shitty low tier light-med tanks and it's over. Fucking dumb. this is by far the worst balanced RTS game i've ever played.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm huge fan of COH but unfortunately this one COH3 disappointed because they didn't include the Soviet Union and Empire of Japan i mean there was nations who fought in WW2",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Latest update has absolutely wrecked the AI. Greedy devs too interested in raping money out of their customers than making a decent game. Jews.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As usual locked variety of battle unit behind dlc pay wall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The latest hotfix broke the game on Linux, please fix this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So many issues.... STILL FROM CoH2 THAT WERE NEVER ADDRESSED!!!!  HOW IS THIS FRANCHISE STILL GOING????  It's like they just ported CoH2 to a newer(ish) engine, threw some new maps together, and said: HERES CoH3!  Wish I had never bought this PoS.  Summary in 3 words: CLUNKY, JUNKY, SAD.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crap game, compare to COH1 or COH 2, and main question... How the fuck, Tiger tank gets damage and pen from Churchill or Sherman with high distance... WTF you ve smoked? And Tiger didnt pen sherman and churchill to the front armour plate and givin small damage, how!? 88mm Acht acht gun became In coh3 with PZGR 39 less dangerous ? Absolute unbalanced multiplayer and overpowered USA and Brits units, feels like Heavy tank is worse then light tanks, MG 42 is a crap, Machine Gewer squad is awful, lots of units have extreme small view distance and attack abillity. Brummbar Sturmpanzer is okay, but... How and why its not doing anything to enemy tanks!?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "tragic game...after 6 k hours of coh 2 this game is insult...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Jeden Abend die selbe traurige Vorstellung. Einfach nur schlimm.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Doesn't live up to the second in audio (including voice acting and direction), variety, balance or UI. Has some good ideas and quality of life changes but the main meat of the game is flawed and should have learned lessons from CoH2's own development, i.e. axing commander call-ins not being tech dependent.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've really enjoyed this game, but the latest update has botched multiplayer game balance and disparately needs to be fixed. I'll update this review when it's playable again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "游戏会平衡不nm新dlc盟军弱鸡成什么样nm不会做游戏别做更新不是游戏崩就是卡做的什么狗屎样Nm",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just purchased latest update and all it does is crash my computer, very disappointed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No checkpoints in missions.\nAlso extremely overpriced. Bought it at 60% making it a full game price, then have DLC's still to buy that are also priced way up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "inferior to COH 1 so not really worth it, not even for the modern visual since COH 1 still looks better to this day, yes the texture and polygon count is not as high but the visual style of COH 1 does look more realistic and more grounded.\n\nI completely forgot to speak about audio design and voice acting ! \nIts also wildly inferior.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Premium currency in a full price title\nDLC priced at more than double its actual value",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "My nan with a walking stick has better balance than this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unplayable - capped at 30fps, no fix I try works. Playing on a 4090",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Title: \"What the hell did you do to Wehrmacht?!\"\n\nReview:\n\nI have to say, what you did to Wehrmacht in the latest patch is absolutely ridiculous. There’s literally NOTHING positive added, and instead, you’ve massively nerfed them. The balance changes are beyond frustrating.\n\nUnit stats have been ruined. What the hell is the point of making their units even worse when their win rates are already lower than three other factions? It’s like you deliberately targeted them for a downgrade.\n\nCosts have been increased, which just makes the whole faction even less viable. Why make things more expensive when the faction is already struggling? like king tiger \n\nAnd don’t even get me started on the removal of key features. Why strip the Wehrmacht of what made them unique?\n\nUnits dying to a single grenade is a joke. Literally, just one grenade and a whole squad is wiped out. That’s a massive issue for a faction that’s already underperforming.\n\n\nHonestly, it feels like you’ve completely ignored any feedback and just decided to ruin one of the most iconic factions in the game. This patch is a disaster, and if you don’t fix this quickly, you’re going to lose a lot of players who were still holding on.\n\nGet your act together. This is unacceptable.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "How can it be that COH2 feels and plays better than this? How? Did you not learn anything?",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "no balance whatsoever, wasted 154h on this, don't make the same mistake.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The new battlegroups kinda messed it up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible, retarded even.\ndev a game like this is a lost art. wow.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not nearly as fun as CoH 2, don't waste your money",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Shitty game, all you have to do is spam",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't feel that power and destruction like in COH2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bad remake of CoH1\n\nunbalanced.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Absolute garbage game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Disappointing compared to the first 2 games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "very funny game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trash game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "coh2 is better",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Can't connect to god damn servers.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WARNING ! PU S SY BU LL crap DETECTET! In game intro \"woman solider\" from resitence apear. Avoid like a plage. Potencial DIE woke virus. All dlc are for multyplayer. Dont weast time or money. \n\nNO PUS S YS IN WORLD WAR 2 GAMES !",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "disgrace to Coh2 and Coh1",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Is this COH? No",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "2024-Axis OP\r\n2025-Allies OP\r\n\r\nL Devs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ew",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ooh a $25 DLC so I can use a heavy tank in US? no thanks\n\nthe game isn't bad, for how good COH2 you would expect it to be better. The DLC is really the downside. its gross.",
      "voted_up": false,
      "votes_helpful": 113
    },
    {
      "review": "I decided to purchase this game due to a 60% sale; I was thinking: If I have a similar experience as the CoH 1 or 2, it will be fine! Sadly.. CoH 3 feels feels like a mobile version of the franchise. This game should be named: CoH Lite.\n\nI sadly can't recommend this game if you are a huge fan of CoH 1 or CoH 2, but if you are new to the RTS genre, this one can be a \"decent\" start... then continue to CoH 1 and 2.",
      "voted_up": false,
      "votes_helpful": 142
    },
    {
      "review": "Good game,\nTerrible player base.\nA lot of antigame behavior, and a severe lack of fighting spirit from many players who are ready to throw the match at the slightest setback from the very beginning.\n\nPeople who refuse to play from the first minute, or who attack their teammates because they lost the previous match against someone who is now on their team, or because of some other offense they think they suffered.\n\nWhy do I have to deal with being matched with the same players again right after having a previous game ruined by someone I reported and blocked?\n\nFurthermore, I’m French; why am I constantly being matched with Asian players who don’t even try to communicate in English, or communicate at all?",
      "voted_up": false,
      "votes_helpful": 120
    },
    {
      "review": "biggest letdown ever, DLCs are the most audacious money grabs ive ever seen, no Italy Faction in Italy but two times Germany like the first games. The game itself isnt bad but compared to the first two hell nah",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "You can see all the other reviews and know this franchise has lost its touch significantly with the years. I want to share something about my experience that you might not see here:\n\nWhen I was a kid, my family didn't have a lot of money. We had a computer that could barely run this game. This was my favorite game. If my siblings wanted to play something, we would have to uninstall something to make room. Relic took this game away from me because I installed it too many times off the CD I purchased. Their customer support said I have to buy it again. I didn't have money for it. To this company, you are only worth the size of your wallet.",
      "voted_up": false,
      "votes_helpful": 165
    },
    {
      "review": "I don't know what's worse: the game or the community. Literally the most toxic fan base I have ever experienced in my life. More importantly, the matchmaking is terrible. You'll regularly be matched with pro-level players and if you leave, THEY WILL ACTUALLY TEMP BAN YOU. So you're stuck getting your ass handed to you by pros until you can surrender. Player base will continue to dwindle and they'll be left with nothing but a handful of 1400+ ELO players that are the source of most toxic behavior in the game.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "Not Recommended — Great Ideas, Wrong Priorities\n\nCoH3 could have been amazing, but the devs keep focusing on DLCs instead of fixing the core game. We’re getting new battlegroups and random additions like Italian Partisans under America, which makes zero sense and shows how inconsistent the design direction is. If you add irregular groups to one side, then the Axis should get their own equivalent auxiliary forces too keep it balanced and keep it logical.\n\nMeanwhile, the real issues remain untouched:\n\n- Unstable balance — some units and factions dominate while others are underpowered.\n- Recurring bugs — old issues resurface with each patch.\n- Unclear faction identity — battlegroups and units often feel disconnected from their faction’s theme.\n- Weak communication — developers rarely explain decisions or patch rationale.\n- Missing major factions — players have been asking for Soviets, French, Pacific factions, and more.\n- Campaign issues — slow pacing, repetitive objectives, and weak AI make the experience underwhelming.\n- Multiplayer frustrations — untested or poorly balanced units affect competitive play.\n- UI and Quality of Life problems — clunky interfaces, unclear unit info, and missing helpful features.\n- Long-term player retention — constant meta shifts and patch changes make planning and strategy frustrating.\n\nPlayers are asking for improvements, quality-of-life fixes, and meaningful content not more paid add-ons stacked on an unsteady foundation. CoH3 has strong features and huge potential, but until the focus shifts from DLCs to building a stable, coherent game, it’s going to remain a frustrating experience. I feel like the team is prioritizing DLCs over actual improvements for the community.\n\nPlease listen to the community, as we experience and feel the weight of your actions.",
      "voted_up": false,
      "votes_helpful": 100
    },
    {
      "review": "4/10\n\n2.5 years after release the game is indeed better. But it's still questionable even at a discount. \n\nI came here for the campaign experience. It took me 13 hours to complete it at the highest difficulty. \n\nThe have advertized 2.0 patch as to include many campaign improvements. Well, they did improve it, but it buffles me, how it took them 2 years to realize that defensive spots with 20 damage are not worth it.\n\nAI does spawn occasional armies in their cities, but in my entire campaign (at HIGHEST difficulty) they have spawned armies twice. Needless to say, it was a stomp of the campaign map.\n\nAI used like 1 bombing run in entire campaign (on global map), so fighters are useless. Overall, AI does feel dead, as it barely puts any resistance on the global map. I really liked the idea of having this total war kind of map, but ai needs to do stuff...\n\nCampaign economy balance is just bad. It took me 30 turns for the entirety of the campaign (can be done much faster, as I was exploring the game). But how about investing 60 fuel to get +3 munition per turn? 20 turns ROI on a campaign which lasts 30 kekw\n\nInstead the campaign is extremely snowbally. You get like 2-5x more resources through a city capture, then you get per turn. So if you can get to capturing 1-2 cities per turn, your resources will feel infinite. But at the same time, it's a noob trap, as casual players will go for a slower approach, and suffocate from lack of resources.\n\nLore wise it makes sense that you are capturing local resources, but it could have been 5% of current resources, and a proper economy from cities instead. Also, why do I get resources for defending lol? \n\nCompanies & unit balance is also busted. I get paratroopers with an early skill to have a P-47 straf everything around. No other company skill comes even close. At the same time, having british company assisting is also imba, cause their armoured car is like 5x more effective than the american one (and I mean it with 5x). Churchil is not as good for Antitank but almost as good as a hellcat, while also excels at anti-infantry tasks - and it comes at a cost of 600/100 vs 600/90. \n\nCall ins should feel op, cause they are special global map abilities. But it should be viable to use different layouts, and not just have a 2-3x better one in any situation.\n\nIn-combat AI also appears to be very flawed. Instead of capturing points, they run between them, even if all my units are on the other side of the map. If AI gets cornered into base, they may get stuck in a loop of non stop retreating, the moment they see the army outside, but do not try to go check the other flank.\n\n--------\n\nI do see the effort, and the campaign is better, from what I can judge. But with 2.0 improvements and 2.5 years into release, I doubt we will be seeing any major improvements any time soon, if at all. \n\nIf I am proven wrong, and campaign does get major boost (even if it's a new dlc campaign), I may revisit my review. But so far, it was a meh experience. Also, the entire campaign is about taking Rome, but in the end, you do not even take Rome, instead you capture a random city, and get a cut scene :/",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Honestly, it's worth it if you have nothing better to do or feel like playing the third game in the series — but only if it's on a mega sale. The Italian campaign is pretty fun, but it lacks all the in-game cutscenes and cinematics that help immerse you in the mission and story. I couldn't even finish the North Africa campaign because it's just boring, and the units you're forced to use are so weak it's frustrating.\r\n\r\nI don't bother with multiplayer because I can't be bothered with it. I used to love playing skirmishes in CoH1 and CoH2, but there's no real incentive to play them here — you don't unlock anything, there's no progression, and the fun wears off quickly.\r\n\r\nWhat happened to the mini-challenge modes and in-depth, story-driven single-player campaigns from CoH2? I thought the whole point of making a new game in a series was to double down on what the previous one did well — improving graphics, sound, and overall gameplay.\r\n\r\nThere's no point in paying real money for those \"companies\" to get new abilities when you can’t even use them in single-player campaigns (apart from one British company).\r\n\r\nHopefully, they release some proper single-player expansions and give the modding community full control again. It's pretty disappointing that it doesn't have the same level of support as the previous titles.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "It's a shitty skinsuit wearing false claimant to the title of CoH, while not quite as bad as it was when it came out, the idea of it still being sold at ''full price'' is absurd. Even as egregious as CoH2 pay2win commanders were, it still held a better rating than this piece of trash. The tutorial is forced and insults your intelligence(should be skippable) the campaigns are meh and silly, and for some reason narrated by a bedouin woman? Because we know that in that culture she would have been well informed and knowledeable on the subject of the north african campaign. Italy not being it's own faction but a few units relegated to different doctrines.. Hell if anything they could have gone full in for diversity here, they could have had Italian colonial troops, of which there were many from countless cultures from north africa to east africa, and even german auxialliaries in the african theatre. But they chose a bedouin woman, to narrate things, in quite a silly way.\nThe color scheme is quite meh, the tanks make no sense in their resistance to certain calibers, a light vehicle can tank multiple shots from a LARGE caliber AT gun and so on. Get this only on sale or allkeyshop, it really is not worth the full price, not even half IMO.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "The balance of this game is fundamentally flawed. For example, at the very beginning, there is a battle group capable of calling in an armored vehicle that can deal significant damage with careful control, while the only countermeasure is to upgrade your infantry with an anti-tank gun, which already puts you one step behind. Additionally, there is a unit that is exceptionally tanky and can be equipped with TWO flamethrowers. U could deploy machine guns to counter this but u need to have enough machine guns to cover the entire side. Fuk this game, gooning is much healthier than playing this game. Sincerely, phuk this game.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "After 415 hours playtime i still struggle with the game. Its only fun because i play with friends every now and then. Too many DLCs and extra cost. At the same time after 2 years (or more i dont keep track) we still dont have USSR forces. Why?! Just why?! We got canadians and australians while USSR is still NOT in the game?!?! i cant make any sense on this being a WW2 game. Just DLCs while the game is still incomplete. Much more i could write but for now the game is nowhere close to COH2 or COH1, its just incomplete... I bought 2 DLCs and they still coming, fix the game if you expect us to spend more money just for a tank or squad. \nI never almost write reviews, and i have been waiting 2 years at least with COH3 to be fixed but no, no fix, just DLCs.",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "Company of Heroes 3 is a huge let-down. The game is buggy, audio crashing and to this day, the achievements are still not fixed xD",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "I dont know how to explain this but, i'd rather not recommending this game to other players due to the recent update and nerfing more on Axis versus in Allies. I appreciate the update and adding new battlegroups but nerfing on the faction even though we didn't ask you to? I dont get it why the devs favored more on Allies than Axis?. After reading your recent update, I read long paragraphs of nerfing Axis and only one sentence of nerfing on Allies. Like what? Before I recommend this game to other players, please make sure not to nerf more on the supposed factions.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "TLDR: Long time COH fan. Combat less of a RTS and more RPG for campaign. Refunded.\n\nI finally gave this a shot for $20 . I've been playing COH since the original, both campaigns and multiplayer. The campaign over world map was VERY cool. Thought we finally had a WW2: Total war for a second. The combat was so boring though! They turned this game into a rpg? They forgot it should be RTS. Maybe there is a mod that will/does exist that makes the combat feel more like COH1 or 2. Having riflemen squads that are lower rank not take a whole minutes to kill each other from 5 feet away. Also the DLC looks crazy over priced compared to COH 1&2 that came with whole campaigns including new factions.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I’ve been playing the game for about a year now. I know balancing an RTS is always tough, but at the very least I wish they wouldn’t push out patches that are so blatantly biased. Players paid money to enjoy a game where all four factions are fun and competitive, yet the way they handle balance basically gives two factions overwhelming convenience, buffs, and rewards, while relegating the other two to just getting beaten down.\n\nFavoritism toward certain factions within the community doesn’t reflect the overall player base or good balance. But Relic seems to just listen to a handful of allied players whining on Discord without valid reasons, and then drops ridiculous buff patches for them.\n\nIf balance keeps going in a direction where one side is continually weakened, Axis players are going to feel so deprived that they’ll just quit and be left playing against AI. And when you adjust numbers, do it with some nuance—don’t just slash or boost things by half in one go. If a unit is strong, they end up nerfing it to half its former value. Is fine-tuning really that hard?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't buy this game for multiplayer unless you're willing to dedicate hours towards learning the 'meta'. Casual unfriendly.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Hey, almost 100 hours player here, don't buy this if you don't wanna play allies all the time. Imo it was kinda balanced before but know its completely broken again like COH2. Land mattress and tunnels... Question for the developers and QA: After this update, do you really believe this game is balanced?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's no where as good as Company of Heroes 2. Two years on and I still see bugs and glitches. Multiplayer is often unusable and crashes.\r\n\r\nCannot recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Step up your game, relic, your business model is shit. Make good campaign for the pve money and good battlegroups for the pvp longevity.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a 60$ game. COH2 has more content. Hardly gets updates. Map selection is FAR less than COH2.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Your MUCH better off playing COH 2\n\nThis game is absolutely not worth buying at all, even if its on sale i would advice you skip this one.",
      "voted_up": false,
      "votes_helpful": 11
    }
  ]
}