{
  "positive": [
    {
      "review": "In all my years of gaming and additions to my backlogs, I have completed many few games. I stepped into this game and the Persona series completely blind, snagged it during a sale saying why not. Turn-based games were always a major turn-off for me so I did not expect much and thought I'd return the game after my first hour, and hoho was I wrong.\n\nAbsolutely enchanting experience this game was! I would love to babble on and on about how well it encapsulates everything into this one package, where the characters, relationships, world building, and actions have so much depth and weight to them all. This game has absolutely changed my perspective on a lot of things and also allowed to me to have a newly-found appreciation for time and a lot of things. If I am not recommending this game then I'd be a fool. Have a blast fellow phantom thieves!",
      "voted_up": true,
      "votes_helpful": 57
    },
    {
      "review": "What can I say about Persona 5 Royal, I've only played Metaphor fully from Atlus, and I felt the same level of emotional impact here as well, it's quite a long game, but worth spending, at its final hours I was somehow hoping there would be more!",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "my first and (so far) only persona game and i must say it's an absolute 10/10\nthe story, the mechanics, artstyle, ANIMATION, sound design, character design, world design, progression - everything is perfect. only downside is that i've finished it. it's one of those games i wish i could play for the first time again.\n\ni'll update my rating when i finish another persona game, maybe my opinion will change.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Incredibly good game if only i had more money from my job i could buy the other games to play",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "[b]This is my first turn-based combat Persona game I ever played. And it exceeded my expectations spectacularly. Can't believe I'm so addicted to this game series in just a couple of months, playing Persona 5 Strikers - Persona 5 Royal - Persona 3 Reload back to back.[/b]\n\nI never thought the combination of JRPG elements, turn-based combat, creature collecting (called \"Persona\"), Persona fusion, and social/dating sim mechanics would be this good. The story is good. The soundtracks is good too.\n\nIf you're new to this game series. For the gameplay mechanics sake, I'll recommend Persona 5 Royal first, and then the other mainline Persona games afterwards. There are so many gameplay features that make encountering enemies, etc., much easier (and they're easier to learn/grasp too. So much so that some of these QoL update got brought to the newest Persona 3 Reload and maybe to the upcoming Persona 4 Revival.\n\nFor the story continuity sake, I recommend playing it in chronological order, like P3R - P4G/P4R - P5R - P5S. Even better if you could play it from the very 1st Persona game (although that \"Old\"sona game didn't age well to say the least)\n\nMy biggest pet peeve of this game is AA/Anti-Aliasing implementation a little bit off in this game. I set the resolution scaling to 200%, but sometimes in some scenes it's still a little bit off or shimmery, and I don't know why.\n\n[b]All in all, I really recommend this game.\n\n9.5 / 10[/b]",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "33 hours in and have barely scratched the surface of this game. Endless things to do and i'm yet to hit a point where im bored because there isn't anything to do in game. Masterpiece!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Probably my first JRPG, and i really liked it! The music is fire and the style too. Gonna try another personas ASAP and reccomend it to everyone.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love love love this game, while it can be repetitive if you play it for too long at once, it's extremely fun, the story is emotional, while you do have to do some extra stuff to make sure you're able to get the true ending it's not hard, top 5 games oat that i've played",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a really good game where you can replay it as much as you want and the gameplay is by far the best when it comes to a comparison with the previous titles, would also recommend doing the true ending its really worth in the end.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I’ve played this game starting from the vanilla version up to Persona 5 Royal, and even though the changes aren’t massive, they’re definitely noticeable. One thing that always bothered me in the vanilla release was Ryuji’s Rank 7 insta-kill ability—it triggers automatically and ends up getting in the way when you’re trying to farm properly. In Royal, they finally fixed this by letting players choose whether they want to activate it, which feels much more convenient.\n\nThe story also gets a few additions that help flesh out the characters and make the narrative flow better. And of course, Persona is known for its outstanding soundtrack—Royal keeps that standard high with music that fits the atmosphere perfectly. The menu design is another highlight; it’s flashy, dynamic, and still manages to stand out compared to its predecessors in the series.\n\nIf you enjoy turn-based RPGs or JRPGs in general, I’d absolutely recommend giving Persona 5 Royal a try. It’s a game that genuinely feels worth the purchase.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’m gonna be fr this is one of the best rpg games I have touched in a while. very solid game. I recommend you start with this jrpg as your first.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "what a game, 10/10. the cast, the story, the music, MORGANA!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is the best RPG I have ever played. It's not even close.\n\nI had no idea what I was getting into when I first picked up this game. I knew that it was one of the highest rated games of all time, and that the soundtrack was great, but that was it.\nNow, after playing it through twice back to back (missed the true ending on my first play through), I think I can't truly find the words to express how I feel.\n\nThe characters and the story were as close to perfection as you can get for a nearly hundred hour long game. The gameplay was flawed at times, but mostly tight and satisfying. The world felt alive, and by the end, I really was attached to it all.\n\nWhat else can I say? The Phantom Thieves stole my heart.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game, amazing story and amazing characters\r\n\r\nAn awesome journey and a must play for any Persona series fan",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "P5R is good, but it can be really exhausting. I couldn't bring myself to finish the extra content as I got really bored with the gameplay after 100+ hours, so I watched the rest of the plot cutscenes on YT.\r\nStill felt like a true Phantom Thief - stealing time from myself :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got the game again just to play the Rose & Violet mod, you're welcome Atlus. Give us a fem!protag you cowards.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best Game I have ever played.\r\n\r\nI have been refunded this game twice. on my third try I was mesmerized by the beauty of Turn-Based-Combat (not counting Pokemon)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dude im just after beating danganronpa and i bought this on a whim. Im only 3 hrs in and i know DAMN well Im in for a masterpiece. So far this game is incredible and if your reading this play it NOW it IS worth buying (this game has been in my backlog for ages and im so glad i tried it).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game made me love JRPGs. I always hated turn based combat but when Clair Obscure came out I wanted to know what the fuzz was all about. I read comments mentioning Persona 5 Royal, so I had to give it a try, since I enjoyed CO. \nMan, what a game. Never thought a game like this will have me so hooked. Characters are funny, story is fun, combat and animations are great. \nCan't wait to try Persona 4 Golden next.\nI just bought this game on Steam to compare the differences between this and the version I play on (Switch). Well, I chose portability rather than 60 fps for this game. Would I recommend this game? Absolutely! You should give it a try!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly one of the best games I have ever played to date. This whole game is super stylized with a BANGER soundtrack to boot. I love the characters, the world and the style it goes for. This by far within my top 3 games of all time, and I would totally recommend anyone try this game. But if you do end up playing, let it be known that a playthrough takes over 100 hours at least :P",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Currently just finished the first dungeon and loving it so far! Art style, UI and everything else just so unique unlike anything I have player before. Excited to play more. One thing is that it's going too be too long for me. I am already at 17 hours and just beat Kamoshida , unlocked Thieves' Den , on the path to find 2nd bad guy. I suspect at the pace I play, it will take me more than 200 hours so this will be a marathon. Hoping I can finish this game one day.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a very interesting game. However, I prefer the cultivation aspect rather than the maze-solving part.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Replaying this game 9 years later and opting to date the teacher this time\n\n100% would do again, the battling is also decent",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I hate Persona 5, and I still hate all the parts of this game that are Persona 5, but I love the parts that are Royal. The new story content in this game is really great. It was worth playing even if I had to trudge through 80 hours of playing Persona 5 again before I got to the good stuff.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Awesome game!  So many puzzles, and social links to pursue.  I really enjoyed the story and the dungeon crawling was lots of fun.  The characters all had fun personalities and it was really enjoyable to play through their interactions.  As always, the grinding and scheduling (to do the right activities) is a bit of a pain but i thoroughly enjoyed the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game so much. I played P5 on ps4 years ago and loved it. Returning I'm remembering why this game is so great. Goated writing, absolutely stunning visuals, fantastic soundtrack, compelling characters, and satisfying gameplay. I cannot praise this game enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I haven't finished the game yet, but this is definitely entering my top 5 games of all time, alongside Elden Ring and Red Dead. How did I not know about this game earlier?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Persona 5 is a game that I have always wanted to play. It has always been on my wish list but I only got it after thinking for 2 years and only started playing 8 weeks ago (1 year after i bought the game). \r\n\r\nAnd I am so so so glad that I decided to play this game. I was procrastinating to play this game because I know its a very long game. A bit too long for my short attention span so I decided to play other games first. Once I am used to the length of other games, I decided that its time for me to finally try Persona 5. In this case, the royal version. \r\n\r\nThis game is amazing. It has so many elements that I look for in a game and its definitely my first time playing a game that its timeline is so crucial to the game (social links). Well, when I first started the game for few hours, I didn't know what the heck is social link and honestly it sounds daunting and too much work but hey, it is now one of the things that I love Persona 5 for. \r\n\r\nI have not played Persona 5 vanilla but I have heard that royal has so much more flexibility in terms of planning what to do with your confidants and I would like to seriously agree on that. I had too much free time after maxing everyone of them. That being said, even though the steam achievements of Persona 5 royal does not consist an achievement for maxing the confidants, it was still fun to max everyone to know more about each of them. And I decided to romance everyone, yes so I can see the epic scene happening during Valentines day period heh\r\n\r\nSome of the characters that I really like are obviously makoto (somehow everyone likes her the most too...??), hifumi, yusuke, ann and many others. I am so glad that the game is so wholesome and I love the ost as well.  I also love the fact that I could understand all the terms Futaba used hehe. The story isn't the most mind-blowing one but it does have some plot twists and interesting elements to it. \r\n\r\nThe past 8 weeks of playing the game includes playing the story, collect every mementos stamp and fight a special fight, maxing confidants, maxing technical rank, maxing baton pass levels for everyone, finishing all mementos requests, gotten 9,999,999 yen and leveling everyone to lvl 99. I did mostly what I could (of course 100% steam achievements - the first time for me! ) but there are some things that I missed out such as getting all decorations, hanging out with the twins for rewards and fusing all personas ( i only have until 60% sadly) and thankfully they are not part of the steam achievements.\r\n\r\nI also have taken the last week to just slowly chill and do my other things during my free time just so that I can postpone to play the game's ending but good things must end and it has indeed ended for me. Well, time to hop on to Persona 5 strikers next maybe.\r\n\r\nAlso, writing this review while listening to Le Blanc ost is amazing :)\r\n\r\nThat is all I wanted to say about the game, I am sure I have missed out some things about the game. Well, it is what it is. Also, been wanting to write this review since a week ago when I know the game is about to end.\r\n\r\nAll in all, please give Persona 5 a try. You will not regret it. A solid 90/100 for me :)\r\n\r\nThank you, Atlus. Thank you, Persona 5.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good story, good gameplay, good game, 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If I had one wish, I wouldn't choose to cure world hunger, but rather I would wish to play this game without remembering anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Equal parts harrowing, silly, serious, slapstick, heart wrenching and anime as fuck all wrapped up in a short little 150 plus hours of game time\n\na masterpiece for the genre and a incredible game in it's own right.\n\nwell worth it (for the soundtrack alone)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has been a year since I finished this game over the course of a real life year, and I must say: It's pretty good. The concepts it uses for it's story are interesting, the characters feel like they have a certain depth to them, the music is one of the best I've ever heard in a video game, and generally I still to this day think that this game is really good. Of course you need to like the gameplay and have a bit of patience sometimes, but generally... I wish I could play through this game once again and experience everything again. Words cannot truly exxpress how much I truly enjoyed this game, how much it really meant to me in the end. If you see this game on sale, I recommend buying it. Few games out there have a story and character design as good as this. Either way, thank you for even taking time of your day to read all this. I hope you have a wonderful day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10!!!!\nFirst Persona game that got me hooked on the rest of the series.\nIf you can get past some repetitive gameplay, it gets HIGHLY addicting.\nWith an impactful story and confidant system with your team, it is an truly attention grabbing game that takes you the whole way!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Persona 5 Royal. It's one of the games that help me through some rough times. It gave me a lighter perspective like even the mundane daily tasks could feel a little less depressing, lol. \n\nVisuals are great, soundtracks are bangers, fully voiced. Such an amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played.\r\nIt's story, game play, visuals and music combines into something uniq, that'll linger in your memory, the same way a great book or a great movie will do.\r\nIf you want a truly special experience, than I'll highly recommend you try this game - you won't regreat it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first Persona game! The best game I've played in a really long time. Great characters. Great gameplay. I wish I could play it fort he first time again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100hrs in this game & 53/53 achievements, I can safely say Takemi is the best girl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I stepped into this game and the Persona series completely blind, snagged it during the Black Friday sale. This is blast to play !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Persona game and it's not even close. Best dungeon design, best extended cast, best late game twists, best [i] aesthetics [/i]; god this game is so STYLISH. It also manages to avoid the dreaded slow burn that plagues the other games in the series with a strong opening hook and framing device. I don't recommend you start here for your first Persona game (please check out [url=https://store.steampowered.com/app/1113000/Persona_4_Golden/] P4G [/url] first), but if the other games in the series take too long to hook you in, then you should absolutely give this one a shot. If this game doesn't sell you on Persona, I don't know what will.\n\n(Ignore my total playtime, I initially played this on console)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first played this on PS4 and racked up around 400 hours, and I still couldn’t resist buying it again on PC—especially with all the insane modding possibilities. Jumping back in after a few years has been incredible. The story still feels shockingly fresh, almost like I’m experiencing it for the first time all over again. Absolutely a 10/10 game—undeniably one of my favorites ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first heard about this game, I was very sceptical about it.. but since it was on sale, I decided to try it anyway.\n\nOnce I started playing it, I was immediately hooked and invested, and after playing it for a while, I was pretty much addicted and played it non-stop for a week to the point that when I finished the game, I only wished there was more to do and to play.\n\nThe characters were very well written and unique and I loved almost all of them.\nThe story was very interesting and was barely ever a dull moment.\nI honestly loved the combat and it was even very challenging at times. (I played on hard but you can always turn down the difficulty if you're struggling.)\nI've only come across 1 small bug but other than that, i had 0 issues.\nThe length of the entire game is really surprising as well. It was much much longer than I initially expected. But hey, that's a good thing if you love the game.\n\n\nThis is probably one of the best games i've ever played and I 100% recommend it.\nDefinitely worth the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the most stylish game ever! \r\n\r\ncame for the tokyo high school simulator and stayed for the friends we made along the way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona 5--this game has been remade and remastered many times, but this was my second Persona game ever, after Persona 3 Reload. I have to say, without a doubt, this game is absolutely perfect. I cannot name a single flaw, and while the story is at perfect length, I just want it to be longer. This game is perfect in every single way, I genuinely cannot name a single flaw. I thought that it wouldn't get better than Persona 3, but I was wrong. This game somehow surpasses that game in every single way. The combat, the gameplay, the graphics, the soundtrack, the story--everything is perfected to its max potential--it's simply crazy. I never knew games could get this good, but here I am. You just have to play the game to understand how perfect it is, there's simply not enough words that give this game justice. The story of this game is probably one of the BEST stories I have ever experienced--if not the best. It holds itself among and even surpasses in some ways absolute legends like RDR2. Every character, every aspect in the game, is truly interesting to an abundant amount; It's actually crazy. I could talk about this game forever with how perfect it is, in fact, I would place it beyond perfect due to how insanely amazing this game is. I feel this is up to no debate, this game cements itself as a classic, masterpiece, and legend, and is 100% deserving of its rating--A strong 10/10, 11/10 if I could give it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "guys dont listen to the people saying this is bad this is a great game if you want to get into the persona series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun to play and is great buy on sale. Go for it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am 8 hours in and so far I have nothing but praises. Its one of those games that excel at every catagory of what makes a great game. To top it off the fact that it takes 100s of hours to complete makes it worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "P5R is one of the most interesting and deep games I have ever played. It may look like a shallow game on the surface, but it hides a lot of good stuff in it.\nThe philosopihical questions which the game forces one to think are truly deep and meaningful, instead of being abstract with little relevance to day-to-day life. The thing I appreciate even more is that the gane never tries to be too teaching and commanding in that sense.\nIt features a soundtrack which is second to none, every part of the game has a nearly perfect soundtrack for the moment.\nThe visual style of Persona games are highly regarded for some reason, it is a joy to roam around the city and explore palaces.\nThe turn-based fighting mechanics is really polished with things such as the Velvet room adding more depth to the game.\n\nOverall, the game looks intricately crafted and fun to play. There are only two downsides to playing this game, one is that it is very long, easily a 100+ hour game, the second is the usual, rather cheesy phrase, that once you are done you can never play this game again for the first time :).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have no words. After one playthrough this was one of the best RPG's I've ever played. This was my first Persona game and now I want to play them all. Flawless gameplay loop, great characters, fun story and the time flew by. Up there as one of my favourites of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first JRPG and Persona 5 instantly became one of my favorite games.\nThe story keeps getting better the further you go, and the music is so good.\nThe romance is fine but feels shallow the only good romance was Kasumi the other ones felt forced somehow they start loving you at the end its kinda stupid but overall the characters were well written and I liked the twist at the end but the story isn't that good or that bad.\nI would definitely recommend it,  just don't abandon the game after a couple of hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m not the biggest fan of story games but persona has opened my eyes. I only have 30 hours played so far but I’m super hooked and can’t stop playing 10/10 recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game, also one of the longest single player games I've played as well, so there's plenty of content here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome because it does not feature Teddie from Persona 4, who is comparable to the worst men to ever live such as Benito Mussolini.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is so good, the characters are very funny and cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never into JRPGS, but this game is just... Something else.\nThe characters, the story, everything about it is perfect.\nI think I've never been so involved with a story in my entire life.\n\nIf you are not sure if u should try it, perhaps you've never played a persona game before, I can assure you, give this game a try, it will change your life.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, wish some of the new character stuff was integrated better into the base game story but overall I really like everything this adds to the base P5 experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A JRPG from the PS3 era with a crazy-awesome visual presentation and soundtrack that successfully crosses into other genres. In addition to being a really good Turn-Based JRPG and everything that comes with it, it's also an anime visual novel and real-time social sim at the same time. These are all things I dislike, but somehow Persona makes me want more of these genres spliced like this. I am scared of finishing this game despite being under halfway done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is honestly probably one of the best game stories I've ever played it has gotten me obsessed with persona",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona 5 is amazing. I can spend time on the train playing the game inside a train reading a book to increase my guts stat.\n\nI've played the game before to halfway on Switch but it feels much better on Deck. Especially OLED where the vibrant colours of the game steal the show. \n\nThe game rewards you for the most mundane ass shit ever but that's why it's amazing. You constantly feel like you're progressing in one way or another, giving you a deadline but also rewarding you for taking your time exploring the city and investing in your future game.\n\nIt's a lotta fun scheduling your own priorities and building out your own experience from it. Not to mention with a great narrative and OST on top! \n\nAll in all, highly recommend the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best jrpgs ever made. I've beaten it on xbox and ps4 already but when I moved over to pc gaming it was one of the first games I bought. While I haven't played it much on staem I know it's a game I'll definitly come back to",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beat this game on PS4 when the original version came out, then bought royal on a series S and played it again, now just bought it on sale because I've just wanted to replay it again and its amazing as ever. I recommend to anyone who doesn't like turn based, to try this. I was never a big JRPG guy, played this, now I've played persona 3, 4, a lot of dragon quest games, and ATLAS' newest game, Metaphor, which is also super awesome. Highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona 5 Royal is just insanely fun — the style, music, everything hits right away.\nThe characters feel like actual friends, so it’s super easy to get attached.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my personal favorite game all of time, and for many reasons. It has a super strong combat system, fulled of style, good design choices (like capture the monsters as \"personas\") and great bosses. The overall style and artistic direction is a huge highlight - even the menus are great to navigate through! The music is outstanding, with multiple styles and great performances. The story is great, with memorable moments and characters. And the structure with all the \"confidents\" elements + the management of time, made it a super satisfying experience. Love it to death !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I went into this game completely blind and was mesmerized from the very moment I pressed the start button. Half visual novel and half RPG, so many elements and mechanics come together to form this (what I consider) masterpiece! Combat is fluid and entertaining, flashy and candy for the eyes! The game is intuitive yet deep, rewarding the player for delving in head first into the systems. It's a long game. it's a time investment, but it is OH SO WORTH IT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game on the ps5 and 4 and the og p5 \nand i have over 600h on them i love I just HAD to get it on pc \ni say you should get it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Atlus...\r\nI have nothing else to say than this masterpiece of a game is absolutely thrilling,\r\nfrom the anime like graphics, story, unique combat, amazing characters.\r\nthis review does not do this game enough justice.\r\nThe only 10/10 game i've had the honour to play.\r\nDo yourself a favour and buy this game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I never really got into games like this, but this game is fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i originally planned on getting past the first palace and calling it a night...\n\nive now played this game nonstop for the past 3 days. one of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "friends told me to play this game for months but i kept pushing it away, then i played it and in the literal first palace i realised i was playing a once in a lifetime peak game and i locked in for the rest of it, ever since beating it i've had a persona itch i've tried to quell by playing persona 3 reload, metaphor and the persona 5 spinoffs (im waiting on persona 4 revival's release date before deciding to play golden), and i have recommended literally all of my friends this game (to mostly no avail)\n\nash, play the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Graphics and Great Gameplay, I really recommend getting this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10 Game.\nLots of fun and a very cool story.\nCool Mechanics as well.\n\nThe only point i dislike about this game is that it has managed to both incorporate the most awesome as well as the worst Boss designs i have ever seen.\n\nThere are Bosses that simply soft lock you and force you to go back a couple of weeks because it is impossible to beat them without the abilities for the exactly one viable/intended strategy to beat them.\n\nAnd I do not mean stuff like oneshotting the team or just being god damn strong.\nI mean an endless loop of summoning minions on a time limit and if only one survives for 2 long. Or stuff like full HP heal of the Boss if the minions remain undefeated for more than 2 turns.\n\nAs captain obvious would say: \"just grind more\", however there are phases in the game where one thinks it is easy until that boss appears. So sometimes there is no telling of whether or not one did in fact level and grind enough.\n\nAside from this, the game is definitely worth playing tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] The Phantom Thieves have stolen my heart. [/h1]\n\nonly three palaces in, and this is easily the best game I've ever played. the game's soundtrack being so good was something [b] I never saw coming, [/b] the characters feeling real, their dynamics working so well, the game's humour, and the fast paced writing. This game has [b] Taken over [/b] my nightly routine, and my [b] live has changed. [/b]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with THE greatest cast of characters of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is pretty good. The gameplay and characters are great. Just finished the first Palace and finished celebrating.\n\nWhat I don't like so far is the Story: High-schoolers fighting those evil adults, change their heart and confess, and become well known  by targeting Big shot adults.\n\nCompare to Persona 4 that has deep story about serial murders and them accepting their \"not good side\" in the process is what hooked me in Persona because of it's deep meaning that I saw even from the beginning of the story, despite the graphics of P4 isn't great compare to P5.\n\nBut P5R story will surely sell to teenagers, No wonder it's popular. \nIf you have nothing to do and want to play simple story, This game is pretty good.\n\nMight change my review once I'm far in the story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No words I can really say will justify how good this game is. As one who hasn't played any Persona games before this, this was an amazing introduction to the franchise. The sound, the atmosphere, the gameplay, all of it was so enjoyable that I sit here as I'm writing this wanting to play it all again. Not many games have reached that title of \"if I could erase one game from memory to replay it all again\". If the game didn't take 90 HOURS of gameplay for one playthrough (and apparently that is rushing it, seen some people with 150+), I would replay this every single day. This game has so much style and charm it feels unreal. The story is also amazing, using the main characters as examples of pushing past expectations and battling their own images of themselves. \n\n12/10 cannot explain how much I want to replay this but also have a life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm through the first chunk of the game. I played Persona 3 when it first came out and haven't played a Persona since. This game has a ton of personality with the animation. Some of the same monsters you could recruit are back again too. These games might not be for everyone, but if you vibe with any of the other Persona/SMT games, you should enjoy this too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the characters, stories, game system, music, and graphics... Everything is immaculate as RPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very recommended RPG game with turn based battle gameplay, and the music in this game are all BANGERS, honestly you wouldn't feel like you played it for too long until you look at the clock.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I played persona 4 and I didn't think this could beat it... it definetly did. The game shows the good and bad sides of humanity, don't get confused by the anime style, after finishing it not only will you feel like you lost some friends but it will have you feeling like you should do more with your life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of best persona game if not, it's nice and soundtrack, Lots long story ahead\r\n9/10\r\nfutaba is amazing, worths of lots content ahead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "truly was an experience\ncharacters r amazing, storys great, lots of things to do\nthis game is just incredible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute peak. Don't go to p4, don't go to p3 when you're fresh at this franchise. You will truly savor this game. Its music, art, narrative, design, it's just so peak. You don't even need a hard brick gpu or cpu to run this game well you just need 50 bucks to get this piece of perfect art. Just buy it at sale, anywhen. Just play the game and your life will be absolutely changed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona 5 Royal is one of those games that totally pulls you in and doesn’t let go. The story is emotional, the characters feel real, and you quickly start to care about their problems and victories. The combat is stylish and satisfying, and every battle feels cool rather than boring. The music is incredible too — some tracks just get stuck in your head for days. It’s a long game, but I honestly didn’t want it to end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Persona 5 Royal was one of those games that I'd heard mentioned on and off for years, but it always seemed too quirky or weird for me to get into. However, one night I was bored and on a whim I decided to try it. I was hooked.\n\nP5R is a charming and stylish game with a powerful message. The main cast includes the Phantom Thieves, a group of high schoolers who all come from troubled origins and have trauma to overcome. The gameplay can be divided into two main parts. One side of it is the action sequences where the Phantom Thieves explore bizarre mental dimensions called Palaces in an effort to steal a Treasure that will cause criminals and other troublesome people to change their ways and confess to their crimes. The other side is a calmer, realistic life simulation where the player has to manage their time while improving social stats and building connections with their friends.\n\nWhile I often dislike games that force social connection on you because it usually feels empty or cliched (and some of the social events in P5R definitely *are* cliched), P5R does a great job at presenting compelling social interactions that are also significant for the gameplay, as stronger bonds with your confidants give you enhanced abilities that can be anywhere from mildly helpful to essential for success in the later game.\n\nWhen I say the social interactions are compelling, I mean that the Phantom Thieves don't feel like poorly written characters. They feel like real high school students and the strife they experience is very well written, with each of them having a unique backstory that establishes their character and makes it so that every player can relate to at least one of them.\n\nFrom a gameplay perspective, P5R boasts an extensive repertoire of mechanics that may not necessarily make sense intuitively depending on your gaming experience. That said, it does a great job of gradually introducing new things to you, and the difficulty scales gradually over the course of the game in a way that makes your progress and the introduction of new mechanics feel satisfying. Many of these mechanics, in addition to being well designed functionally, are integral to the game's style. For example, the combat features a \"one more\" feature that allows you to get extra turns after striking an enemy's weakness, but these one mores can then be used as a \"baton pass,\" where that extra turn is given to another member of your party and their attack power is boosted in return. Later in the game, baton passes can be boosted to have various other enhancements.\n\nWhile these mechanics are good for dramatic flair and they can be fun to play with, the game forces you to make full use of them as you get into the later game missions. Using the baton pass as an example, some of the game's bosses are virtually unbeatable without making heavy use of them, which requires you to have a well balanced party that can exploit a variety of elemental weaknesses. While some people grind early on to soar above the game's difficulty level (which can be freely adjusted throughout the game), I think that playing naturally without grinding produces a fairly well balanced difficulty curve.\n\nThe best thing about Persona 5 Royal, however, is its story. Outside of the goofy social situations and the comic book action, a grand tale is being told. From the beginning you're told that the world is facing its impending ruin and that forming connections with others is key to averting that fate. While this sounds fairly generic on the surface, P5R beautifully illustrates its plot in a way that makes you feel encapsulated in every moment, with tension and theatric presentation that I think is unrivaled in other games. The game's central theme revolves around rebellion; fighting against circumstances, oppressors, and even one's own anxieties. And the antagonists that the Phantom Thieves face range from mundane people who only have local influence over the cast, to national and even otherworldly threats.\n\nThis is a long game. I just finished my first playthrough at nearly 128 hours. That said, the game doesn't expect you to rush or make great strides of progress in short periods of time. In fact, much of the gameplay revolves around a calendar system that encourages players to slow down and make thoughtful use of their time. The game also has built in features to review information about your confidants and the plot in case you forget anything after a break (though in my case I was never taking breaks lol).\n\nThe game also has a fairly active modding scene. For my second playthrough I'm planning on playing a story overhaul mod that changes the MC and makes various other improvements.\n\nLastly, Persona's soundtrack is genuinely unparalleled. There isn't a single song in this game that I couldn't listen to for an hour straight, or in the case of some songs, many hours straight. The game combines instrumental music with some vocalized songs that form the backbone of the game's emotional appeal. I think this game's music is some of the best and I think it ties together the game's tone perfectly.\n\nNeedless to say, I couldn't recommend this game enough. The only thing I'd warn you about is that once you start playing this game, there might be no way back for you! I was hooked for over a month on this game, it quickly usurping my free time from all my other hobbies. It's the kind of game that you wish you could experience again for the first time. I encourage you to go in blind and enjoy the game at your own pace. It's the kind of experience you'll never forget.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak music, peak animation, peak gameplay, peak storyline. end of story 1 billion/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being completely honest, Persona 5 may be in the competition for being one of the greatest games ever made, especially in the ways Atlus built the world (like the amazing soundtrack that accompanies every moment) and the allies you interact with to have so much personality, detail, and obvious thought put into every set piece. I know that I'll never forget the Phantom Thieves and their story and I hope everyone gets a chance to experience it for themselves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OKay Let me get this straight\r\n\r\nYou're Joker Allright and you GO around Stealing the Hearts of People all the While Attempting to form a Harem of Anime Women\r\n\r\nAnd I Haven't Played this game Before?\r\n\r\nDid i Mention That Joker fellow was in Super Smash Bros",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "who needs real life?\n\nthis game is phenomenal in every aspect. I usually only get like 20 hours into JRPGs, but persona 5 managed to keep me hooked for 160 hours until I beat it. 9/10 game. would've preferred it being long enough to replace my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice game, good 8,5-10\r\nIs more beginner friendly than p3r, and especially p4g because it's way more forgiving.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most fun persona game. Simply good-looking, nice music and best story overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "has some of the best greatest antagonists really great story well made game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of if not the best story games i have ever played. Would recommend it to any of my family members or to anyone really.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game, although it's not without its flaws. The calendar system makes it hard for you to complete the game 100%. The combat is really great, but at some point it feels like instead of throwing enemies with interesting mechanics at you, instead you get enemies with bloated health bars. That said, I love the characters, setting, music, and the whole personality of this game. I would highly recommend it despite its flaws!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like anime and JRPG and turn based combats with tactical focus, this game will blow your mind. It took around 1 year to beat the game with all the extras, did not completed all extras ,but I think I fulfilled almost everything that the game offered. Nice story telling, options and characters development for an RPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good and very fun but also play library of ruina",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first played this game in high school on ps4 when it first came out at a time where I was starting to fall out of love for video games in general. I bought this game with what little money a unemployed highschooler at the time had on a whim cause I thought maybe trying something new would be the right choice for a new game and after playing it for 100 hours on my first playthrough for the span on three months I was amazed. This is one of the games that made me happy that video games are a passion of mind. Now playing the royal version for the first time after like 6 or 7 years since playing has been such an enjoyable experience. Also something I appreciate about this game is how easy it is to play while watching a baby cause time stops when someone finishes their dialogue lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Appalled I never rated this game. Literally changed my life. Like I'm actually a much happier person and I've made many more friends because this game inspired me. Please play it and give it a chance.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is actually good, I recommend it if you haven't watched the anime or want to enjoy a JRPG game. Persona 5 Royal is the same as the anime CMIIW, but they added new characters in this game, and you can explore and date.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Magnum opus of persona games, can't wait for P6 and see how they're going to step up their game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE BEST GAME OMG!!! it has an amazing story and lovable characters and i love the fighting style (it reminds me of pokemon) and all the different activities ugh its amazing!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gane, the music, the enviroment and\r\nOveral Experience just too good",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I will say this is a very creative and well-thought-out game. I applaud the creators and the artists who poured their love into this. I've taken time to admire it all. Thing is, I can't on good conscience recommend it to anyone.\n\nAt some point, I reached a stage of grief in which I missed when my only task was pressing a button to make coffee and talk about coffee beans with the old man. Thats all I wanted to do at some point. I had to drag myself into those missions just before every deadline so the whole world wouldn't end and I could keep. making. coffee. I can't tell you how much sadder I became with he STOPPED TALKING TO ME until I fixed his father daughter issues.\n\n\nI like the inclusion of all kinds of topics even a tiny bit of politics and social dilemmas and how the government is responding to this yada yada. I love the art, love the menu, the way the dialogue looks, love the plot idea, loved the school trivia and the fact you had to build up a skill to dodge the chalk stick the teacher would throw and smack you in the head with.\n\nOverall, this is objectively a good game. Will you enjoy it? It really depends on the person and their range of preference. You will either love it or haaate it. How I personally felt? Reaaally not my type especially with the fighting, which is why I don't feel entitled to strictly advise against it... but seriously think on it more. You have to be very patient to play this game, have a lot of time in your hands, and really search into the game before making that decision and submitting yourself to it. \n\nIt took me a long time of playing to get myself engrossed in the story with those, respectfully, odd off-looking character models in the majority of the gameplay outside the cutscenes that I understand might go with the game style but I personally just couldn't take it seriously. This was the only game I didn't do better research on before buying it while on sale and I regretted it, but again, the ship has sailed and I've learned to like it... mostly. The FIGHTING system is just SO exhausting and repetitive and you have to farm the same weird deformed enemies in both the person's brain AND the shadow realm or whatever the hell hundreds of times NO auto-fight button but ah... Alas, I spent money and I feel that I want to see it through to the end.  If I were still a child, I'd definitely go ahead and finish it and I'd probably enjoy it a lot more. Unfortunately, I doubt I'll come back for a long, long time if ever. I keep thinking: 'Why am I wasting all this time? I should just watch the rest of the story parts on a gamer's video or something despite my stubborn a$$ haha. I swear it wouldn't be the same though, not after this long.' It hurts but I must for my own good. If this seems like something you'd love after checking through all that, then please, pay me no mind. Enjoy your game! :)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Инфантильная чушь, которую можно похвалить за некоторые дизайнерские решения и музыку, но в остальном является лютым проходняком, как с точки зрения геймплея, так и с точки зрения сюжета, заточенного  на околоподростковую аудиторию.   Социальная часть ,в которую все так любят вмазываться. по факту реализована довольно спорно и скорее вызывает желание дать по носу, тому человеку, из за которого тебе приходится вычищать углы ради нужной активности. Первое же подземелье намекает, что ради некоторых квестовых предметов тебе придется гриндить. Боевка с точки зрения жрпг, так же является посредственностью в красивой обертке. Короче, если хотите проходное подростковое аниме. в принципе оно тут сделано ок, но вот я не хочу.  Хотите посмотреть, как работает норм социалка, не знаю , потыкайте в эмблему три дома, или что-нибудь в этом духе.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Persona 5 gives you a good initial impression with its great characters, the setting, and the beautiful music, but it's way too long and gets incredibly boring and repetitive after 30 or 40 hours. The game is basically a routine/dialogue simulator 90% of the time with only 10% actual gameplay. I tried so hard, but to think I've already played this game for 60 hours and still need another 60 hours to finish it is making me sick.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game is good the only reason why I'm giving a thumbs down is because it's poorly optimized on PC. I get a consistent 60fps on Persona 3 Reload max settings with an rx6600 but somehow 20fps on Persona 5 Royal before needing to do various tweaks to make it playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve fully completed Persona 5 Royal on both Xbox and PlayStation—plus the original Persona 5—so I was excited to run through it again on Steam. Unfortunately, this port has a glitch that makes it basically unplayable for me. I’d absolutely recommend the game itself, just not this version until it gets fixed. Also, fair warning: P5R isn’t exactly challenging. Great style, great story, but don’t expect a tough fight",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy it on some level but this game is a massive brain rot time sink.\nPeople will be like \"haha this dude spent over 100 hours in this game, he must of enjoyed it\"...what can I say, I have a bad gaming addiction and a compulsive nature to get value out of my games and take them through to competion.\nThe whole concept of the game is literally about taking your time.\nSpend your time on real life or something thats a bit more like an actual game than a virtual parody of life...its literally the lesson of the game. You don't need 100+ hours of txt messages and cut scenes in a game for that. There's not really much else rewarding about this, its good but all drawn out and corny.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bought the game and was forced to refund, spent 55 minutes trying to fix the hard crash it was causing my pc (5800x3d 4070ti)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Okumura fight is so poorly designed it actually ruins the rest of the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So this game is tons of fun. Made it through Kamoshida palace with only stutters here and there. But after making to the Second dungeon. And getting the door open inside the palace. I closed the game at 1am to wake up for work in the morning. I get home and clean up and start the game after the 1st scene is stutters for over 4 minutes before loading the next screen. Then it does it again. So now when it does the stuttering it gives me the option to close the game. Now this game is way funner then Persona 5. Many improvements in PS5 Royal. Now most newer games run a diagnostics check on your hardware.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe its too early to make a comment but it's feels like a boring and repetetive gameplay... dialogues are slow paced and so long..... i dont know what people find this game so much ? \n\n3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's been a long time since i felt so bored gaming.\r\nIt's the first game i got a bad ending and didn't care. I love games with story and dialog but this was too much and too repetitive. Even with the skip button some scenes took 10mins of me looking at my phone. I also didnt like how personas worked. They didnt evolve and you had to keep sacrificing them, this way i couldn't even get attached and had to keep using strong ugly ones. \r\nThis game was not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I highley apreciate this game and I love the work that the devs and everyone else involved has put into it, but I can not recomend this game in good hearth. I have adhd and the game is way to hard to put down. This can be chucked to self control but there have been times where I was hungry and I would ignore that just to keep playing. I am not even sure if I enjoyed my time during thoes moments. \r\n\r\nIf you are buying this game, please consider your ammount of self control and take care.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "baited by the overwhelmingly positive reviews. Did not care about your daily life routine simulator portion of the game. It wasn't enough to make me care about any of the characters and their relations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Какая же это тупая убогая аниме п0.б.нь.\r\nБесконечные тупые диалоги расчитанные на малолетних имбецилов и пок3м0нодр0ч.вские бои в стиле пауэр е64ть их в ср.ку рейнджерс...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[b]Game is a glorified VN.[/b]\r\n\r\nPersona 5 has stylish presentation and solid turn-based combat, but the game barely lets you play it. Every time you finish a dungeon, the game forces you into long stretches of dialogue, calendar events, and slice-of-life filler before you’re allowed to have real gameplay again. The pacing constantly kills any momentum the game builds.\r\n\r\n[h2]Dialogue, Fake Choices & Relationship Points[/h2]\r\n\r\nIf it wasn’t for the fake multiple-choice sections, your controller would probably turn itself off. Most of the time you pick an option, get one line of flavor text, and then the game snaps right back to the same scripted dialogue. Every now and then you get a funny line that feels like you're making your own moment in an anime, but those are rare.\r\n\r\nYou can also get those little blue musical-note boosts that increase your bond with characters. I looked this up online, and from what people say, having a Persona of the same Arcana gives you extra points. But the whole thing is pretty inconsistent — the number of notes you see doesn’t always match how many points you actually got. Sometimes you even hit the “max notes” but it still isn’t enough to rank up. It makes the system feel vague and kind of pointless unless you're following a guide.\r\n\r\n[h2]Gameplay Pacing Issues[/h2]\r\n\r\n• Long stretches with no combat\r\n• Forced downtime after every dungeon\r\n• JRPG gameplay comes in short bursts\r\n• Momentum is constantly interrupted\r\n\r\nEvery time I finally got control back, I would rush through the entire dungeon in a single session because I was starving for actual gameplay. After that, the game locks me out again and makes me wait through 20+ in-game days before the next real segment.\r\n\r\n[h2]Side Content Problems[/h2]\r\n\r\nMementos is recycled content with weak minibosses and no real payoff. Social links / confidants can be interesting, but many of them drag on or repeat themes, relying heavily on dialogue that doesn’t meaningfully impact the story or game mechanics.\r\n\r\n[h2]Overall[/h2]\r\n\r\nPersona 5 is good — the combat is fun, the style is polished, and the writing can hit emotional notes. But make no mistake: it is a visual novel first and foremost, and only sometimes a JRPG. If you want gameplay to be the core of your experience, this structure is likely to feel restrictive, slow, and frustrating.\r\n\r\n[b]Not recommended for gameplay-first JRPG players.[/b]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a lot of game in this \"game\". Overly long cut scenese with dialog that has me zoning out",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have played 5 hours and so far I am no where in beating the first boss, not because its hard to or anything, but like its such a drag, like it prevents me from enjoying anything else until the first boss is done and it tethers on giving me tutorials over tutorials over things like - If i compare this to the recent spiderman game i played, i'm not required to know/learn about a lot of stuff and I can just go swinging. This might be also where I draw comparisions with a similar game like \"A Hat like this\" which is somewhat straight forward....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "omg omg wanna know what game is a real Persona killer? A REAL SHIN MEGAMI TENSEI PERSONA KILLER?!\n\nIt's persona 5, this (sub) series died with this game.\n\nThis is hands down one of the worst JRPGs ever made, the gameplay is mind numbing and the story is horribly boring.\n\nAtleast midsona 5 has good music.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is strange.  I got it because it was on sale and super hyped up.  The gameplay is boring as heck and the cutscenes are way too anime coded for my liking.  If you're into Japanese animation and culture you may like this game but if you find anime insufferable as I do stay away from this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "wasn't that interesting of a turn based game although the story is alright",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has a serious stuttering issue that was never fixed til this day.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "SMT 5 clears, cancel Persona 6 and make SMT 6 NOW",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mid game 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't have sekkusu with Goro Akechi",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Okumura",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Uses Denuvo, which means you can't play the single player game you bought at the whims of this piece of software if you happen to be offline. In this day and age where handheld gaming becomes more and more prevalent, this is even more baffling.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "[Linux and Steam Deck users beware]\n\nThe incompetent implementation of Denuvo in essentially all Atlus games will force you to re-validate after EVERY system reboot, which means you will have to connect online each and every time AND you will very easily hit the daily activation limits without even realizing it.\n\nIt's a known issue and neither SEGA nor Valve care. Great game, but it's completely screwed by Denuvo in an even worse way than usual.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Bought it during a sale a long time ago and finally decided to give it a try. I came into it after hearing about how it's the greatest thing ever from both the community and some friends and with an overwhelmingly positive score I had really high hopes. I like to put in a good amount of hours into something or try to finish it before giving it a review but I just couldn't do the latter. For some context i've played various tales series games (berseria, vesperia, symphonia and abyss), i've played metaphor refantazio (still need to beat that one),  paper mario, etc. so i'm not at all new to the genre of anime or turn based. My thoughts:\r\n\r\n[h1] Overall 6.5/10 [/h1]\r\n [h2] Gameplay 8/10 [/h2]\r\n        So having played this game I originally thought the gameplay was 10/10 but after playing Expedition 33, it's knocked it down. you could say it's unfair since it's an older game and I would agree but that's just kinda how evolution goes and hopefully Persona 6 gets even better. Anyway the combat system is very fluid and fun and with the ability to chain combos / stuns with the different characters it feels very engaging. The mechanic of fusing your personas to create stronger ones was implemented very well and the amount of combinations feels endless. I enjoyed the aspect of choosing what you want to do with your day and it felt very rewarding with an almost \"majora's mask\" vibe as the end date got closer. Overall the gameplay is honestly very good but like I said earlier expedition 33 just nails the combat sections, while metaphor refantazio does the activity sections better. Although the fusion of personas is still something I very much enjoyed I look forward to what they will do going forward with Persona 6.\r\n\r\n[h2] Story 5/10 [/h2]\r\n       The Majority of characters are bland or flat out annoying while few others are pretty enjoyable. This game suffers from a mediocre script at best with several dialogue or voice lines being repeated nonstop. The beginning of the story just doesn't make sense to me as it seems very dramatized for the sake of creating a problem. Granted a lot of stories do that, but in the context of \"real world\" problems that it's trying to emulate, it just doesn't seem like a plausible outcome. i know it's an anime game and it's stoked up to 11 but the adults in the game just seem incompetent or douchy for no reason. In defense of kamoshida (who is your first boss) he's taken over by evil so it makes sense he's an irredeemable jerk, but it just doesn't make sense for other characters like the parents, police, or other staff unless it's part of further plot I never managed to see. explained slightly more in conclusion. If you don't mind the trope of incompetent adults then it's probably more enjoyable but I feel like that trope should be reserved for something that is not trying to emulate real world issues.\r\n\r\n[h2] Graphics / Visuals / Music 15/10 [/h2]\r\n         I just love the art style and visual aspects of the game, not to mention the soundtrack. it's immediately recognizable and memorable without being annoying because it's just the right amount of over the top. character designs, VFX, and ambience is a homerun. I think everyone can agree that it's easily the best aspect of the game without much need for explanation. \r\n\r\n[h2] Performance 10/10 [/h2]\r\n      It's an older game with a remaster so unless you have a potato it will run. No bugs or issues ever encountered during a casual playthrough. \r\n\r\n[h2] Conclusion [/h2]\r\n      It may be kinda confusing how the game sounds amazing despite the story and the fact I couldn't finish it. My gripe with the game is the sheer amount of handholding it does. depending on the starting difficulty you set yourself on the tutorial, it alone is estimated around 8 HOURS or maybe ~10 hours on hard mode. I get that there is quite a lot of mechanics with some being very complex but it doesn't need to be 8 hours. A majority of the mechanics you can just figure out naturally or learn later as you play, but the game insists on having you learn 1 or 2 mechanics and then completing the instance or Palace. You then go back to the Palace to learn 1 more mechanic and in doing so you basically just unlock a pea sized section more of the Palace. You then essentially repeat that while back tracking until the game deems you worthy of actually being able to play. It gets better, because even if you can play the game now, it will still hold your hand. The amount of \"babying\" this game does is atrocious and after reading articles on reddit and steam it seems it persists until the 3rd palace. I managed to beat the first Palace aka Kamoshida but I highly recommend watching a let's play before buying the game to see if you actually want to play it. Persona 5 is a heavily narrative game with an absurd amount of handholding so it's probably best to just watch someone else play it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "was fooled by \"Overwhelmingly Positive\" reviews.\r\n\r\nits not a game. 90% of time, its a next>next>next simulator, while listening to same 4 music on loop.\r\n\r\nwould have been a good experience, if the dialogs were animated.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Aggressively mediocre, boring as shit, easy as piss.\nThere's one good bit of story at the very end but otherwise it's not worth the amount of time the game asks you to sink in.\nThe gameplay is worse than other atlus alternatives by a significant margin, the boss design is consistently ass and devolves into a slugfest the majority of the time.\nThe showtime mechanic introduced for Royal is particularly shoehorned in, especially in comparison to what they would do in other games.\nGo play SMT V or Metaphor for gameplay, and don't play anything atlus makes for the story because it's always half-assed.\nAt least we got Maruki. Woo.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I will say this is a very creative and well-thought-out game. I applaud the creators and the artists who poured their love into this. I've taken time to admire it all. Thing is, I can't on good conscience recommend it to anyone.\n\nAt some point, I reached a stage of grief in which I missed when my only task was pressing a button to make coffee and talk about coffee beans with the old man. Thats all I wanted to do at some point. I had to drag myself into those missions just before every deadline so the whole world wouldn't end and I could keep. making. coffee. I can't tell you how much sadder I became with he STOPPED TALKING TO ME until I fixed his father daughter issues.\n\n\nI like the inclusion of all kinds of topics even a tiny bit of politics and social dilemmas and how the government is responding to this yada yada. I love the art, love the menu, the way the dialogue looks, love the plot idea, loved the school trivia and the fact you had to build up a skill to dodge the chalk stick the teacher would throw and smack you in the head with.\n\nOverall, this is objectively a good game. Will you enjoy it? It really depends on the person and their range of preference. You will either love it or haaate it. How I personally felt? Reaaally not my type especially with the fighting, which is why I don't feel entitled to strictly advise against it... but seriously think on it more. You have to be very patient to play this game, have a lot of time in your hands, and really search into the game before making that decision and submitting yourself to it. \n\nIt took me a long time of playing to get myself engrossed in the story with those, respectfully, odd off-looking character models in the majority of the gameplay outside the cutscenes that I understand might go with the game style but I personally just couldn't take it seriously. This was the only game I didn't do better research on before buying it while on sale and I regretted it, but again, the ship has sailed and I've learned to like it... mostly. The FIGHTING system is just SO exhausting and repetitive and you have to farm the same weird deformed enemies in both the person's brain AND the shadow realm or whatever the hell hundreds of times NO auto-fight button but ah... Alas, I spent money and I feel that I want to see it through to the end.  If I were still a child, I'd definitely go ahead and finish it and I'd probably enjoy it a lot more. Unfortunately, I doubt I'll come back for a long, long time if ever. I keep thinking: 'Why am I wasting all this time? I should just watch the rest of the story parts on a gamer's video or something despite my stubborn a$$ haha. I swear it wouldn't be the same though, not after this long.' It hurts but I must for my own good. If this seems like something you'd love after checking through all that, then please, pay me no mind. Enjoy your game! :)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Инфантильная чушь, которую можно похвалить за некоторые дизайнерские решения и музыку, но в остальном является лютым проходняком, как с точки зрения геймплея, так и с точки зрения сюжета, заточенного  на околоподростковую аудиторию.   Социальная часть ,в которую все так любят вмазываться. по факту реализована довольно спорно и скорее вызывает желание дать по носу, тому человеку, из за которого тебе приходится вычищать углы ради нужной активности. Первое же подземелье намекает, что ради некоторых квестовых предметов тебе придется гриндить. Боевка с точки зрения жрпг, так же является посредственностью в красивой обертке. Короче, если хотите проходное подростковое аниме. в принципе оно тут сделано ок, но вот я не хочу.  Хотите посмотреть, как работает норм социалка, не знаю , потыкайте в эмблему три дома, или что-нибудь в этом духе.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Persona 5 gives you a good initial impression with its great characters, the setting, and the beautiful music, but it's way too long and gets incredibly boring and repetitive after 30 or 40 hours. The game is basically a routine/dialogue simulator 90% of the time with only 10% actual gameplay. I tried so hard, but to think I've already played this game for 60 hours and still need another 60 hours to finish it is making me sick.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I'ma keep it a buck. \nThe game was mid. It wasn't bad but it really wasn't better than good. and even saying good is kinda a stretch.\n\nTHE BAD PARTS:\nI finished the game and did the true ending but most of the villains felt so cartoonishly evil that none of them had any impact what so ever. The only 2 villains that actually had some impact were the last 2. (not gonna mention who they are for new players) but the game was alright for some of the social links, but outside of that the main cast doesn't really feel all that special, none of them really made me feel like I SHOULD do their social links to find out more about them, ESPECIALLY ANN. \nThe powerscale and difficulty of the overall game is absolutely INSANE, when I unlocked the increased EXP GAIN for mementos and RYUJI'S INSTAKILL it was lght over. I reached lvl 99 SO FAST, and even before that I was WAY too over leveled for all of the palaces I went into. The DLC persona's were SUPER busted too. I have played Persona 4 Golden so I am used to Persona building and how to correctly use passives for each Persona, but Jesus Christ, If I used any of the DLC persona I don't think I would ever have to build a persona ever again, just fuse it and move on. The difficulties are very misleading. None of them are correct in any way. I played the game on Hard mode because I heard that the \"Hardest Difficulty.\" was actually easier than normal mode, which is INSANE, but even on Hard mode it was still wayyyy too easy, all it felt like was slightly tankier enemies that had slightly better AI when it came to fights.\n\nTHE GOOD PARTS:\nNot to say that the game was ENTIRELY bad. There were some pretty good social links. I loved the Chariot and the Hanged Man social links, they really felt wholesome and fun. I also liked the Emperor, and they have many practical uses after maxing it. \nThe story was So-so in the beginning but near the end it REALLY started to get good, I liked the whole moral choices that it presents to you.\nThe Soundtrack was great, there were a lot of great songs in it (My personal favorite was The Whims of Fate.) Somber music during your free time with bumping loud orchestra music for the casual fights and boss fights.\n\nSummary:\nJust buy another Persona game bro. Idk what else to say other than that. Persona 4 and Persona 3 had a much better plot and the game was more difficult. This game has it's moments but not enough to really make me want to play it again or recommend to a friend or anyone else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This OFFLINE game went completely unplayable for a while due to the DRM.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is good the only reason why I'm giving a thumbs down is because it's poorly optimized on PC. I get a consistent 60fps on Persona 3 Reload max settings with an rx6600 but somehow 20fps on Persona 5 Royal before needing to do various tweaks to make it playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve fully completed Persona 5 Royal on both Xbox and PlayStation—plus the original Persona 5—so I was excited to run through it again on Steam. Unfortunately, this port has a glitch that makes it basically unplayable for me. I’d absolutely recommend the game itself, just not this version until it gets fixed. Also, fair warning: P5R isn’t exactly challenging. Great style, great story, but don’t expect a tough fight",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy it on some level but this game is a massive brain rot time sink.\nPeople will be like \"haha this dude spent over 100 hours in this game, he must of enjoyed it\"...what can I say, I have a bad gaming addiction and a compulsive nature to get value out of my games and take them through to competion.\nThe whole concept of the game is literally about taking your time.\nSpend your time on real life or something thats a bit more like an actual game than a virtual parody of life...its literally the lesson of the game. You don't need 100+ hours of txt messages and cut scenes in a game for that. There's not really much else rewarding about this, its good but all drawn out and corny.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bought the game and was forced to refund, spent 55 minutes trying to fix the hard crash it was causing my pc (5800x3d 4070ti)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Okumura fight is so poorly designed it actually ruins the rest of the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So this game is tons of fun. Made it through Kamoshida palace with only stutters here and there. But after making to the Second dungeon. And getting the door open inside the palace. I closed the game at 1am to wake up for work in the morning. I get home and clean up and start the game after the 1st scene is stutters for over 4 minutes before loading the next screen. Then it does it again. So now when it does the stuttering it gives me the option to close the game. Now this game is way funner then Persona 5. Many improvements in PS5 Royal. Now most newer games run a diagnostics check on your hardware.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe its too early to make a comment but it's feels like a boring and repetetive gameplay... dialogues are slow paced and so long..... i dont know what people find this game so much ? \n\n3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's been a long time since i felt so bored gaming.\r\nIt's the first game i got a bad ending and didn't care. I love games with story and dialog but this was too much and too repetitive. Even with the skip button some scenes took 10mins of me looking at my phone. I also didnt like how personas worked. They didnt evolve and you had to keep sacrificing them, this way i couldn't even get attached and had to keep using strong ugly ones. \r\nThis game was not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I highley apreciate this game and I love the work that the devs and everyone else involved has put into it, but I can not recomend this game in good hearth. I have adhd and the game is way to hard to put down. This can be chucked to self control but there have been times where I was hungry and I would ignore that just to keep playing. I am not even sure if I enjoyed my time during thoes moments. \r\n\r\nIf you are buying this game, please consider your ammount of self control and take care.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "baited by the overwhelmingly positive reviews. Did not care about your daily life routine simulator portion of the game. It wasn't enough to make me care about any of the characters and their relations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Какая же это тупая убогая аниме п0.б.нь.\r\nБесконечные тупые диалоги расчитанные на малолетних имбецилов и пок3м0нодр0ч.вские бои в стиле пауэр е64ть их в ср.ку рейнджерс...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[b]Game is a glorified VN.[/b]\r\n\r\nPersona 5 has stylish presentation and solid turn-based combat, but the game barely lets you play it. Every time you finish a dungeon, the game forces you into long stretches of dialogue, calendar events, and slice-of-life filler before you’re allowed to have real gameplay again. The pacing constantly kills any momentum the game builds.\r\n\r\n[h2]Dialogue, Fake Choices & Relationship Points[/h2]\r\n\r\nIf it wasn’t for the fake multiple-choice sections, your controller would probably turn itself off. Most of the time you pick an option, get one line of flavor text, and then the game snaps right back to the same scripted dialogue. Every now and then you get a funny line that feels like you're making your own moment in an anime, but those are rare.\r\n\r\nYou can also get those little blue musical-note boosts that increase your bond with characters. I looked this up online, and from what people say, having a Persona of the same Arcana gives you extra points. But the whole thing is pretty inconsistent — the number of notes you see doesn’t always match how many points you actually got. Sometimes you even hit the “max notes” but it still isn’t enough to rank up. It makes the system feel vague and kind of pointless unless you're following a guide.\r\n\r\n[h2]Gameplay Pacing Issues[/h2]\r\n\r\n• Long stretches with no combat\r\n• Forced downtime after every dungeon\r\n• JRPG gameplay comes in short bursts\r\n• Momentum is constantly interrupted\r\n\r\nEvery time I finally got control back, I would rush through the entire dungeon in a single session because I was starving for actual gameplay. After that, the game locks me out again and makes me wait through 20+ in-game days before the next real segment.\r\n\r\n[h2]Side Content Problems[/h2]\r\n\r\nMementos is recycled content with weak minibosses and no real payoff. Social links / confidants can be interesting, but many of them drag on or repeat themes, relying heavily on dialogue that doesn’t meaningfully impact the story or game mechanics.\r\n\r\n[h2]Overall[/h2]\r\n\r\nPersona 5 is good — the combat is fun, the style is polished, and the writing can hit emotional notes. But make no mistake: it is a visual novel first and foremost, and only sometimes a JRPG. If you want gameplay to be the core of your experience, this structure is likely to feel restrictive, slow, and frustrating.\r\n\r\n[b]Not recommended for gameplay-first JRPG players.[/b]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a lot of game in this \"game\". Overly long cut scenese with dialog that has me zoning out",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have played 5 hours and so far I am no where in beating the first boss, not because its hard to or anything, but like its such a drag, like it prevents me from enjoying anything else until the first boss is done and it tethers on giving me tutorials over tutorials over things like - If i compare this to the recent spiderman game i played, i'm not required to know/learn about a lot of stuff and I can just go swinging. This might be also where I draw comparisions with a similar game like \"A Hat like this\" which is somewhat straight forward....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "omg omg wanna know what game is a real Persona killer? A REAL SHIN MEGAMI TENSEI PERSONA KILLER?!\n\nIt's persona 5, this (sub) series died with this game.\n\nThis is hands down one of the worst JRPGs ever made, the gameplay is mind numbing and the story is horribly boring.\n\nAtleast midsona 5 has good music.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is strange.  I got it because it was on sale and super hyped up.  The gameplay is boring as heck and the cutscenes are way too anime coded for my liking.  If you're into Japanese animation and culture you may like this game but if you find anime insufferable as I do stay away from this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "wasn't that interesting of a turn based game although the story is alright",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has a serious stuttering issue that was never fixed til this day.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "SMT 5 clears, cancel Persona 6 and make SMT 6 NOW",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mid game 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope. Just play Metaphor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't have sekkusu with Goro Akechi",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Okumura",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Uses Denuvo, which means you can't play the single player game you bought at the whims of this piece of software if you happen to be offline. In this day and age where handheld gaming becomes more and more prevalent, this is even more baffling.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "[Linux and Steam Deck users beware]\n\nThe incompetent implementation of Denuvo in essentially all Atlus games will force you to re-validate after EVERY system reboot, which means you will have to connect online each and every time AND you will very easily hit the daily activation limits without even realizing it.\n\nIt's a known issue and neither SEGA nor Valve care. Great game, but it's completely screwed by Denuvo in an even worse way than usual.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Bought it during a sale a long time ago and finally decided to give it a try. I came into it after hearing about how it's the greatest thing ever from both the community and some friends and with an overwhelmingly positive score I had really high hopes. I like to put in a good amount of hours into something or try to finish it before giving it a review but I just couldn't do the latter. For some context i've played various tales series games (berseria, vesperia, symphonia and abyss), i've played metaphor refantazio (still need to beat that one),  paper mario, etc. so i'm not at all new to the genre of anime or turn based. My thoughts:\r\n\r\n[h1] Overall 6.5/10 [/h1]\r\n [h2] Gameplay 8/10 [/h2]\r\n        So having played this game I originally thought the gameplay was 10/10 but after playing Expedition 33, it's knocked it down. you could say it's unfair since it's an older game and I would agree but that's just kinda how evolution goes and hopefully Persona 6 gets even better. Anyway the combat system is very fluid and fun and with the ability to chain combos / stuns with the different characters it feels very engaging. The mechanic of fusing your personas to create stronger ones was implemented very well and the amount of combinations feels endless. I enjoyed the aspect of choosing what you want to do with your day and it felt very rewarding with an almost \"majora's mask\" vibe as the end date got closer. Overall the gameplay is honestly very good but like I said earlier expedition 33 just nails the combat sections, while metaphor refantazio does the activity sections better. Although the fusion of personas is still something I very much enjoyed I look forward to what they will do going forward with Persona 6.\r\n\r\n[h2] Story 5/10 [/h2]\r\n       The Majority of characters are bland or flat out annoying while few others are pretty enjoyable. This game suffers from a mediocre script at best with several dialogue or voice lines being repeated nonstop. The beginning of the story just doesn't make sense to me as it seems very dramatized for the sake of creating a problem. Granted a lot of stories do that, but in the context of \"real world\" problems that it's trying to emulate, it just doesn't seem like a plausible outcome. i know it's an anime game and it's stoked up to 11 but the adults in the game just seem incompetent or douchy for no reason. In defense of kamoshida (who is your first boss) he's taken over by evil so it makes sense he's an irredeemable jerk, but it just doesn't make sense for other characters like the parents, police, or other staff unless it's part of further plot I never managed to see. explained slightly more in conclusion. If you don't mind the trope of incompetent adults then it's probably more enjoyable but I feel like that trope should be reserved for something that is not trying to emulate real world issues.\r\n\r\n[h2] Graphics / Visuals / Music 15/10 [/h2]\r\n         I just love the art style and visual aspects of the game, not to mention the soundtrack. it's immediately recognizable and memorable without being annoying because it's just the right amount of over the top. character designs, VFX, and ambience is a homerun. I think everyone can agree that it's easily the best aspect of the game without much need for explanation. \r\n\r\n[h2] Performance 10/10 [/h2]\r\n      It's an older game with a remaster so unless you have a potato it will run. No bugs or issues ever encountered during a casual playthrough. \r\n\r\n[h2] Conclusion [/h2]\r\n      It may be kinda confusing how the game sounds amazing despite the story and the fact I couldn't finish it. My gripe with the game is the sheer amount of handholding it does. depending on the starting difficulty you set yourself on the tutorial, it alone is estimated around 8 HOURS or maybe ~10 hours on hard mode. I get that there is quite a lot of mechanics with some being very complex but it doesn't need to be 8 hours. A majority of the mechanics you can just figure out naturally or learn later as you play, but the game insists on having you learn 1 or 2 mechanics and then completing the instance or Palace. You then go back to the Palace to learn 1 more mechanic and in doing so you basically just unlock a pea sized section more of the Palace. You then essentially repeat that while back tracking until the game deems you worthy of actually being able to play. It gets better, because even if you can play the game now, it will still hold your hand. The amount of \"babying\" this game does is atrocious and after reading articles on reddit and steam it seems it persists until the 3rd palace. I managed to beat the first Palace aka Kamoshida but I highly recommend watching a let's play before buying the game to see if you actually want to play it. Persona 5 is a heavily narrative game with an absurd amount of handholding so it's probably best to just watch someone else play it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "was fooled by \"Overwhelmingly Positive\" reviews.\r\n\r\nits not a game. 90% of time, its a next>next>next simulator, while listening to same 4 music on loop.\r\n\r\nwould have been a good experience, if the dialogs were animated.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Aggressively mediocre, boring as shit, easy as piss.\nThere's one good bit of story at the very end but otherwise it's not worth the amount of time the game asks you to sink in.\nThe gameplay is worse than other atlus alternatives by a significant margin, the boss design is consistently ass and devolves into a slugfest the majority of the time.\nThe showtime mechanic introduced for Royal is particularly shoehorned in, especially in comparison to what they would do in other games.\nGo play SMT V or Metaphor for gameplay, and don't play anything atlus makes for the story because it's always half-assed.\nAt least we got Maruki. Woo.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I will say this is a very creative and well-thought-out game. I applaud the creators and the artists who poured their love into this. I've taken time to admire it all. Thing is, I can't on good conscience recommend it to anyone.\n\nAt some point, I reached a stage of grief in which I missed when my only task was pressing a button to make coffee and talk about coffee beans with the old man. Thats all I wanted to do at some point. I had to drag myself into those missions just before every deadline so the whole world wouldn't end and I could keep. making. coffee. I can't tell you how much sadder I became with he STOPPED TALKING TO ME until I fixed his father daughter issues.\n\n\nI like the inclusion of all kinds of topics even a tiny bit of politics and social dilemmas and how the government is responding to this yada yada. I love the art, love the menu, the way the dialogue looks, love the plot idea, loved the school trivia and the fact you had to build up a skill to dodge the chalk stick the teacher would throw and smack you in the head with.\n\nOverall, this is objectively a good game. Will you enjoy it? It really depends on the person and their range of preference. You will either love it or haaate it. How I personally felt? Reaaally not my type especially with the fighting, which is why I don't feel entitled to strictly advise against it... but seriously think on it more. You have to be very patient to play this game, have a lot of time in your hands, and really search into the game before making that decision and submitting yourself to it. \n\nIt took me a long time of playing to get myself engrossed in the story with those, respectfully, odd off-looking character models in the majority of the gameplay outside the cutscenes that I understand might go with the game style but I personally just couldn't take it seriously. This was the only game I didn't do better research on before buying it while on sale and I regretted it, but again, the ship has sailed and I've learned to like it... mostly. The FIGHTING system is just SO exhausting and repetitive and you have to farm the same weird deformed enemies in both the person's brain AND the shadow realm or whatever the hell hundreds of times NO auto-fight button but ah... Alas, I spent money and I feel that I want to see it through to the end.  If I were still a child, I'd definitely go ahead and finish it and I'd probably enjoy it a lot more. Unfortunately, I doubt I'll come back for a long, long time if ever. I keep thinking: 'Why am I wasting all this time? I should just watch the rest of the story parts on a gamer's video or something despite my stubborn a$$ haha. I swear it wouldn't be the same though, not after this long.' It hurts but I must for my own good. If this seems like something you'd love after checking through all that, then please, pay me no mind. Enjoy your game! :)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Инфантильная чушь, которую можно похвалить за некоторые дизайнерские решения и музыку, но в остальном является лютым проходняком, как с точки зрения геймплея, так и с точки зрения сюжета, заточенного  на околоподростковую аудиторию.   Социальная часть ,в которую все так любят вмазываться. по факту реализована довольно спорно и скорее вызывает желание дать по носу, тому человеку, из за которого тебе приходится вычищать углы ради нужной активности. Первое же подземелье намекает, что ради некоторых квестовых предметов тебе придется гриндить. Боевка с точки зрения жрпг, так же является посредственностью в красивой обертке. Короче, если хотите проходное подростковое аниме. в принципе оно тут сделано ок, но вот я не хочу.  Хотите посмотреть, как работает норм социалка, не знаю , потыкайте в эмблему три дома, или что-нибудь в этом духе.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Persona 5 gives you a good initial impression with its great characters, the setting, and the beautiful music, but it's way too long and gets incredibly boring and repetitive after 30 or 40 hours. The game is basically a routine/dialogue simulator 90% of the time with only 10% actual gameplay. I tried so hard, but to think I've already played this game for 60 hours and still need another 60 hours to finish it is making me sick.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I'ma keep it a buck. \nThe game was mid. It wasn't bad but it really wasn't better than good. and even saying good is kinda a stretch.\n\nTHE BAD PARTS:\nI finished the game and did the true ending but most of the villains felt so cartoonishly evil that none of them had any impact what so ever. The only 2 villains that actually had some impact were the last 2. (not gonna mention who they are for new players) but the game was alright for some of the social links, but outside of that the main cast doesn't really feel all that special, none of them really made me feel like I SHOULD do their social links to find out more about them, ESPECIALLY ANN. \nThe powerscale and difficulty of the overall game is absolutely INSANE, when I unlocked the increased EXP GAIN for mementos and RYUJI'S INSTAKILL it was lght over. I reached lvl 99 SO FAST, and even before that I was WAY too over leveled for all of the palaces I went into. The DLC persona's were SUPER busted too. I have played Persona 4 Golden so I am used to Persona building and how to correctly use passives for each Persona, but Jesus Christ, If I used any of the DLC persona I don't think I would ever have to build a persona ever again, just fuse it and move on. The difficulties are very misleading. None of them are correct in any way. I played the game on Hard mode because I heard that the \"Hardest Difficulty.\" was actually easier than normal mode, which is INSANE, but even on Hard mode it was still wayyyy too easy, all it felt like was slightly tankier enemies that had slightly better AI when it came to fights.\n\nTHE GOOD PARTS:\nNot to say that the game was ENTIRELY bad. There were some pretty good social links. I loved the Chariot and the Hanged Man social links, they really felt wholesome and fun. I also liked the Emperor, and they have many practical uses after maxing it. \nThe story was So-so in the beginning but near the end it REALLY started to get good, I liked the whole moral choices that it presents to you.\nThe Soundtrack was great, there were a lot of great songs in it (My personal favorite was The Whims of Fate.) Somber music during your free time with bumping loud orchestra music for the casual fights and boss fights.\n\nSummary:\nJust buy another Persona game bro. Idk what else to say other than that. Persona 4 and Persona 3 had a much better plot and the game was more difficult. This game has it's moments but not enough to really make me want to play it again or recommend to a friend or anyone else.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This OFFLINE game went completely unplayable for a while due to the DRM.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Disclaimer: This review is in regard to everything that happens up to unlocking the 4th character. I don't know if I will ever continue this game much further. If I do, I'll adjust this review. \r\n\r\nWell, up until that point, the game was essentially an Anime. It has good OST and is close to fully voiced. But it also feels like I'm doing nothing. \r\nThe protagonist is silent and just gets dragged along by the story. In a story that isn't written in a way where your choices are always obvious. There are even dialogue options, but they have no impact. It is also entirely restrospective, which I'm not a fan of, also because it further solidifies that my interactions don't matter. Besides that, I found the story itself to be quite generic, predictable and thus, dragging. \r\n\r\nIn regards to the battles - they are rare. Very rare! \r\nOtherwise, it's standard turn based combat. Very basic, without anything special. Also, if the protagonist faints, it's game over, He isn't stronger than his allies and they can't be used as shields, so it's a very annoying mechanic to deal with. But there is a safe mode if you want to play only the story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is good the only reason why I'm giving a thumbs down is because it's poorly optimized on PC. I get a consistent 60fps on Persona 3 Reload max settings with an rx6600 but somehow 20fps on Persona 5 Royal before needing to do various tweaks to make it playable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve fully completed Persona 5 Royal on both Xbox and PlayStation—plus the original Persona 5—so I was excited to run through it again on Steam. Unfortunately, this port has a glitch that makes it basically unplayable for me. I’d absolutely recommend the game itself, just not this version until it gets fixed. Also, fair warning: P5R isn’t exactly challenging. Great style, great story, but don’t expect a tough fight",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy it on some level but this game is a massive brain rot time sink.\nPeople will be like \"haha this dude spent over 100 hours in this game, he must of enjoyed it\"...what can I say, I have a bad gaming addiction and a compulsive nature to get value out of my games and take them through to competion.\nThe whole concept of the game is literally about taking your time.\nSpend your time on real life or something thats a bit more like an actual game than a virtual parody of life...its literally the lesson of the game. You don't need 100+ hours of txt messages and cut scenes in a game for that. There's not really much else rewarding about this, its good but all drawn out and corny.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Bought the game and was forced to refund, spent 55 minutes trying to fix the hard crash it was causing my pc (5800x3d 4070ti)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The Okumura fight is so poorly designed it actually ruins the rest of the game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So this game is tons of fun. Made it through Kamoshida palace with only stutters here and there. But after making to the Second dungeon. And getting the door open inside the palace. I closed the game at 1am to wake up for work in the morning. I get home and clean up and start the game after the 1st scene is stutters for over 4 minutes before loading the next screen. Then it does it again. So now when it does the stuttering it gives me the option to close the game. Now this game is way funner then Persona 5. Many improvements in PS5 Royal. Now most newer games run a diagnostics check on your hardware.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe its too early to make a comment but it's feels like a boring and repetetive gameplay... dialogues are slow paced and so long..... i dont know what people find this game so much ? \n\n3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's been a long time since i felt so bored gaming.\r\nIt's the first game i got a bad ending and didn't care. I love games with story and dialog but this was too much and too repetitive. Even with the skip button some scenes took 10mins of me looking at my phone. I also didnt like how personas worked. They didnt evolve and you had to keep sacrificing them, this way i couldn't even get attached and had to keep using strong ugly ones. \r\nThis game was not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I highley apreciate this game and I love the work that the devs and everyone else involved has put into it, but I can not recomend this game in good hearth. I have adhd and the game is way to hard to put down. This can be chucked to self control but there have been times where I was hungry and I would ignore that just to keep playing. I am not even sure if I enjoyed my time during thoes moments. \r\n\r\nIf you are buying this game, please consider your ammount of self control and take care.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "baited by the overwhelmingly positive reviews. Did not care about your daily life routine simulator portion of the game. It wasn't enough to make me care about any of the characters and their relations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Какая же это тупая убогая аниме п0.б.нь.\r\nБесконечные тупые диалоги расчитанные на малолетних имбецилов и пок3м0нодр0ч.вские бои в стиле пауэр е64ть их в ср.ку рейнджерс...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[b]Game is a glorified VN.[/b]\r\n\r\nPersona 5 has stylish presentation and solid turn-based combat, but the game barely lets you play it. Every time you finish a dungeon, the game forces you into long stretches of dialogue, calendar events, and slice-of-life filler before you’re allowed to have real gameplay again. The pacing constantly kills any momentum the game builds.\r\n\r\n[h2]Dialogue, Fake Choices & Relationship Points[/h2]\r\n\r\nIf it wasn’t for the fake multiple-choice sections, your controller would probably turn itself off. Most of the time you pick an option, get one line of flavor text, and then the game snaps right back to the same scripted dialogue. Every now and then you get a funny line that feels like you're making your own moment in an anime, but those are rare.\r\n\r\nYou can also get those little blue musical-note boosts that increase your bond with characters. I looked this up online, and from what people say, having a Persona of the same Arcana gives you extra points. But the whole thing is pretty inconsistent — the number of notes you see doesn’t always match how many points you actually got. Sometimes you even hit the “max notes” but it still isn’t enough to rank up. It makes the system feel vague and kind of pointless unless you're following a guide.\r\n\r\n[h2]Gameplay Pacing Issues[/h2]\r\n\r\n• Long stretches with no combat\r\n• Forced downtime after every dungeon\r\n• JRPG gameplay comes in short bursts\r\n• Momentum is constantly interrupted\r\n\r\nEvery time I finally got control back, I would rush through the entire dungeon in a single session because I was starving for actual gameplay. After that, the game locks me out again and makes me wait through 20+ in-game days before the next real segment.\r\n\r\n[h2]Side Content Problems[/h2]\r\n\r\nMementos is recycled content with weak minibosses and no real payoff. Social links / confidants can be interesting, but many of them drag on or repeat themes, relying heavily on dialogue that doesn’t meaningfully impact the story or game mechanics.\r\n\r\n[h2]Overall[/h2]\r\n\r\nPersona 5 is good — the combat is fun, the style is polished, and the writing can hit emotional notes. But make no mistake: it is a visual novel first and foremost, and only sometimes a JRPG. If you want gameplay to be the core of your experience, this structure is likely to feel restrictive, slow, and frustrating.\r\n\r\n[b]Not recommended for gameplay-first JRPG players.[/b]",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not a lot of game in this \"game\". Overly long cut scenese with dialog that has me zoning out",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I have played 5 hours and so far I am no where in beating the first boss, not because its hard to or anything, but like its such a drag, like it prevents me from enjoying anything else until the first boss is done and it tethers on giving me tutorials over tutorials over things like - If i compare this to the recent spiderman game i played, i'm not required to know/learn about a lot of stuff and I can just go swinging. This might be also where I draw comparisions with a similar game like \"A Hat like this\" which is somewhat straight forward....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "omg omg wanna know what game is a real Persona killer? A REAL SHIN MEGAMI TENSEI PERSONA KILLER?!\n\nIt's persona 5, this (sub) series died with this game.\n\nThis is hands down one of the worst JRPGs ever made, the gameplay is mind numbing and the story is horribly boring.\n\nAtleast midsona 5 has good music.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is strange.  I got it because it was on sale and super hyped up.  The gameplay is boring as heck and the cutscenes are way too anime coded for my liking.  If you're into Japanese animation and culture you may like this game but if you find anime insufferable as I do stay away from this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "wasn't that interesting of a turn based game although the story is alright",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game has a serious stuttering issue that was never fixed til this day.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "SMT 5 clears, cancel Persona 6 and make SMT 6 NOW",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mid game 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't have sekkusu with Goro Akechi",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Okumura",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Uses Denuvo, which means you can't play the single player game you bought at the whims of this piece of software if you happen to be offline. In this day and age where handheld gaming becomes more and more prevalent, this is even more baffling.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "[Linux and Steam Deck users beware]\n\nThe incompetent implementation of Denuvo in essentially all Atlus games will force you to re-validate after EVERY system reboot, which means you will have to connect online each and every time AND you will very easily hit the daily activation limits without even realizing it.\n\nIt's a known issue and neither SEGA nor Valve care. Great game, but it's completely screwed by Denuvo in an even worse way than usual.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Bought it during a sale a long time ago and finally decided to give it a try. I came into it after hearing about how it's the greatest thing ever from both the community and some friends and with an overwhelmingly positive score I had really high hopes. I like to put in a good amount of hours into something or try to finish it before giving it a review but I just couldn't do the latter. For some context i've played various tales series games (berseria, vesperia, symphonia and abyss), i've played metaphor refantazio (still need to beat that one),  paper mario, etc. so i'm not at all new to the genre of anime or turn based. My thoughts:\r\n\r\n[h1] Overall 6.5/10 [/h1]\r\n [h2] Gameplay 8/10 [/h2]\r\n        So having played this game I originally thought the gameplay was 10/10 but after playing Expedition 33, it's knocked it down. you could say it's unfair since it's an older game and I would agree but that's just kinda how evolution goes and hopefully Persona 6 gets even better. Anyway the combat system is very fluid and fun and with the ability to chain combos / stuns with the different characters it feels very engaging. The mechanic of fusing your personas to create stronger ones was implemented very well and the amount of combinations feels endless. I enjoyed the aspect of choosing what you want to do with your day and it felt very rewarding with an almost \"majora's mask\" vibe as the end date got closer. Overall the gameplay is honestly very good but like I said earlier expedition 33 just nails the combat sections, while metaphor refantazio does the activity sections better. Although the fusion of personas is still something I very much enjoyed I look forward to what they will do going forward with Persona 6.\r\n\r\n[h2] Story 5/10 [/h2]\r\n       The Majority of characters are bland or flat out annoying while few others are pretty enjoyable. This game suffers from a mediocre script at best with several dialogue or voice lines being repeated nonstop. The beginning of the story just doesn't make sense to me as it seems very dramatized for the sake of creating a problem. Granted a lot of stories do that, but in the context of \"real world\" problems that it's trying to emulate, it just doesn't seem like a plausible outcome. i know it's an anime game and it's stoked up to 11 but the adults in the game just seem incompetent or douchy for no reason. In defense of kamoshida (who is your first boss) he's taken over by evil so it makes sense he's an irredeemable jerk, but it just doesn't make sense for other characters like the parents, police, or other staff unless it's part of further plot I never managed to see. explained slightly more in conclusion. If you don't mind the trope of incompetent adults then it's probably more enjoyable but I feel like that trope should be reserved for something that is not trying to emulate real world issues.\r\n\r\n[h2] Graphics / Visuals / Music 15/10 [/h2]\r\n         I just love the art style and visual aspects of the game, not to mention the soundtrack. it's immediately recognizable and memorable without being annoying because it's just the right amount of over the top. character designs, VFX, and ambience is a homerun. I think everyone can agree that it's easily the best aspect of the game without much need for explanation. \r\n\r\n[h2] Performance 10/10 [/h2]\r\n      It's an older game with a remaster so unless you have a potato it will run. No bugs or issues ever encountered during a casual playthrough. \r\n\r\n[h2] Conclusion [/h2]\r\n      It may be kinda confusing how the game sounds amazing despite the story and the fact I couldn't finish it. My gripe with the game is the sheer amount of handholding it does. depending on the starting difficulty you set yourself on the tutorial, it alone is estimated around 8 HOURS or maybe ~10 hours on hard mode. I get that there is quite a lot of mechanics with some being very complex but it doesn't need to be 8 hours. A majority of the mechanics you can just figure out naturally or learn later as you play, but the game insists on having you learn 1 or 2 mechanics and then completing the instance or Palace. You then go back to the Palace to learn 1 more mechanic and in doing so you basically just unlock a pea sized section more of the Palace. You then essentially repeat that while back tracking until the game deems you worthy of actually being able to play. It gets better, because even if you can play the game now, it will still hold your hand. The amount of \"babying\" this game does is atrocious and after reading articles on reddit and steam it seems it persists until the 3rd palace. I managed to beat the first Palace aka Kamoshida but I highly recommend watching a let's play before buying the game to see if you actually want to play it. Persona 5 is a heavily narrative game with an absurd amount of handholding so it's probably best to just watch someone else play it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "was fooled by \"Overwhelmingly Positive\" reviews.\r\n\r\nits not a game. 90% of time, its a next>next>next simulator, while listening to same 4 music on loop.\r\n\r\nwould have been a good experience, if the dialogs were animated.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Aggressively mediocre, boring as shit, easy as piss.\nThere's one good bit of story at the very end but otherwise it's not worth the amount of time the game asks you to sink in.\nThe gameplay is worse than other atlus alternatives by a significant margin, the boss design is consistently ass and devolves into a slugfest the majority of the time.\nThe showtime mechanic introduced for Royal is particularly shoehorned in, especially in comparison to what they would do in other games.\nGo play SMT V or Metaphor for gameplay, and don't play anything atlus makes for the story because it's always half-assed.\nAt least we got Maruki. Woo.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I will say this is a very creative and well-thought-out game. I applaud the creators and the artists who poured their love into this. I've taken time to admire it all. Thing is, I can't on good conscience recommend it to anyone.\n\nAt some point, I reached a stage of grief in which I missed when my only task was pressing a button to make coffee and talk about coffee beans with the old man. Thats all I wanted to do at some point. I had to drag myself into those missions just before every deadline so the whole world wouldn't end and I could keep. making. coffee. I can't tell you how much sadder I became with he STOPPED TALKING TO ME until I fixed his father daughter issues.\n\n\nI like the inclusion of all kinds of topics even a tiny bit of politics and social dilemmas and how the government is responding to this yada yada. I love the art, love the menu, the way the dialogue looks, love the plot idea, loved the school trivia and the fact you had to build up a skill to dodge the chalk stick the teacher would throw and smack you in the head with.\n\nOverall, this is objectively a good game. Will you enjoy it? It really depends on the person and their range of preference. You will either love it or haaate it. How I personally felt? Reaaally not my type especially with the fighting, which is why I don't feel entitled to strictly advise against it... but seriously think on it more. You have to be very patient to play this game, have a lot of time in your hands, and really search into the game before making that decision and submitting yourself to it. \n\nIt took me a long time of playing to get myself engrossed in the story with those, respectfully, odd off-looking character models in the majority of the gameplay outside the cutscenes that I understand might go with the game style but I personally just couldn't take it seriously. This was the only game I didn't do better research on before buying it while on sale and I regretted it, but again, the ship has sailed and I've learned to like it... mostly. The FIGHTING system is just SO exhausting and repetitive and you have to farm the same weird deformed enemies in both the person's brain AND the shadow realm or whatever the hell hundreds of times NO auto-fight button but ah... Alas, I spent money and I feel that I want to see it through to the end.  If I were still a child, I'd definitely go ahead and finish it and I'd probably enjoy it a lot more. Unfortunately, I doubt I'll come back for a long, long time if ever. I keep thinking: 'Why am I wasting all this time? I should just watch the rest of the story parts on a gamer's video or something despite my stubborn a$$ haha. I swear it wouldn't be the same though, not after this long.' It hurts but I must for my own good. If this seems like something you'd love after checking through all that, then please, pay me no mind. Enjoy your game! :)",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}