{
  "positive": [
    {
      "review": "Perfect remake of a classic.\n\nUnfortunately, this marks the second time EA kills this beloved franchise over profit margins.",
      "voted_up": true,
      "votes_helpful": 194
    },
    {
      "review": "What blew my mind most about this game was the attention to detail. I have never seen such realistic looking characters or movements and facial expressions in a video game. Same goes for the world design, and the animations they made for reloading weapons and interacting with save points. Really awesome stuff!\r\n\r\nI don't even like horror but I loved this. This is the the closest to a cinematic experience that I've had with a video game. It's also the best looking game I've played on steam deck so far, and it runs flawlessly, which doesn't make sense but I'll take it. My hats off to this team.",
      "voted_up": true,
      "votes_helpful": 71
    },
    {
      "review": "I give this game a 8.5 overall.\nI recommend it at a 66% or higher sale.\n\nGameplay and visuals and atmosphere is 9.5 BUT technical issues bring it down by at least 1.\n\nGameplay is good ,GFX is good so all fine.\nGeneral FPS perfomance is fine.\nRTAO is not that demanding with a powerful rig and SSAO is very light and both look good.\n\nNG+ has some additonal phantom enemies that are even stronger than the enhanced variants.(basic,enhanced,phantom)\nNG+ also has an optional different ending if you collect all NG+ only collectibles.\n\nIntesity director has some RNG so you can not always know what is going to happen.Reloading save checkpoint can change stuff even going the same route doing same things.\n\nBut usually first time entering the room will have mostly scripted ecounters.\nAnd some backtracking stuff has scripted stuff too.\n\nPeeling enemies flesh of and the enemy dmg model is 10/10.\nUsually comboing enemies are more effiicent than just cutting eg.flaming necros until they stagger or forcegun flesh off and than plasma cutting limbs of likely only in 1 shot.\n\nWeapons are MUCH MORE balanced than in the OG the flamethrower is a finally useful support weapon.(still can not use it in places there is no oxygen+has low range).\nThe plasma cutter is still the most balanced weapon.\nAnd you can easily complete the game with just the PC and get an achievement.\n\nGame main plot is about long as the OG likely 8-12 hours but remake has 3 side quest+backtracking for security stuff for additonal stuff likely +1-3 hours of optional content over OG.\n\nThere are no(visible) loading screens and during 90% of the game you can backtrack to almost anywhere you get a warning at the point of no return.\n\n\nIn contrast to 2008 OG remake is darker and Necros are tankier but also lost some atmosphere and sounds compared to the OG.Still overall it is good enough.\n\nIsacc is also tankier than in the OG likely by around 50% more on hard vs hard......\nIsacc has slightly bigger inventory size than in OG.\n\nIsacc has more tools including special weapon upgrades,kinesis system,Zero-G system from DS2.\nBoss fights are much better than in the OG.\nStill eventually you will deal more dmg and likely kill necros faster than in the OG thanks to the expanded combat system.\n\nSo the combat is MORE polished than OG.\n\nGame has plenty of accesibility options.\n\n\nNeutral:They slightly changed some of the Charater Designs for better or worse and Isacc now rarely speak vs being silent in the OG.\nNicole looks like 20-25 years older than in the OG....Isaacc looks around 5 years younger.\n\n\nNOW what are the primary CONS......\n\nFirst of all perfomance on Steam Deck is pretty bad so do not recommend it.\n\nGame does not fully shader caches so you will have lag issues for first time effects.\nFirst time load does a few minute long shader caching but misses QUITE a few.(tired 3 different rigs happened on all 3).\n\nGame does asset streaming VERY poorly so crossing the invisible loading zones will cause stutters less if you have a powerful CPU and SSD.\n\nOn my RX6800OC AMD 5 5600,Nvme SSD+rebar,anti-lag,VRR,enhanced sync enabled the hidden loading was noticable but not that bad on my weaker rig it was like 1-2 second lag/frezee crossing the loading zones.Aka travestal stuttering.\n\nNaturally this means while general fps is high you will have spikes down.\n(VERY powerful PCs likely not notice it).\n\nGame does NOT support HDDs and many users with slower storage devices had critical mission items,event not load in aka you get soft locked.Have multiple backup saves.\nImpossible diff is 1 save slot only.......\n\nHigh and very high reflections are kinda poor from most angles and Imo look worse then medium.\nDo not use low lights as it turns off most lights and severly affects gameplay......\n\nFSR 2.1(on quality 1080p) is kinda weak in this game and door signs get blurred more than they should.\n\nTurning down motion blur to zero and capping fps seems to help with travestal stutters.\n\nSometimes you need to restart the game so perfomance becomes unbugged can be common after changing GFX settings.....\n\nEdit:As of this writting 22 of november 2025 the game still have Devuno DRM.\n\nIn DSR impossible is\"hard\" but you have only 1 life with unlimited saves in OG impossible was\"very hard\"with unlimited saves,lives.\n\nSo DSR does not have a\"very hard\" mode so it is easier than OG impossible or DS2 Zealot(very hard) difficulty.\n\nAfter a few months in 2023 this game\"only\" sold 2 million copies(better than Sillent Hill) so EA naturally abbandoned it after just a few patches do NOT expect technical issues to be fixed by hahahahahah EA.\n\nFew Notes about the Old games you can check my reviews about them too.\n\nIf you have a weaker PC or lack SSD I recommed the old DS triology but as they are old games they have technical issues so make sure to learn them before playing.(primary capping FPS for stable physic and too many CPU cores.)\n\nJust note while it was reported to EA back in 2016 that old DS game WILL NOT LAUCH with 10+core CPU they are \"still working\" on the solution.\nThis is EA maybe the Saudis will make changes.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "I’m not usually a fan of horror games and I scare easily, but Dead Space Remake completely pulled me in. From the moment I stepped onto the spaceship, I was trapped in a dark and eerie world full of danger. Every sound made me tense up and every shadow felt alive. The lighting and sound design are amazing in this remake, turning simple moments into tense and scary experiences. The visuals make the horror feel real and the ship feels alive with fear.\n\nCombat is smart and intense. You have to shoot the limbs of the space zombies instead of just aiming for the head. Ammo is limited, so every bullet matters. The weapon variety is excellent, and each one feels unique, pushing you to experiment and adapt. Using engineering tools as weapons is creative and fits the world perfectly.\n\nThe story is engaging and adds to the feeling of being alone and desperate. The pacing keeps you on edge from start to finish, and the atmosphere never lets you feel safe. It’s terrifying but unforgettable. Dead Space Remake is a must-play for anyone who enjoys tension, challenge, and incredible design. In the world of survival horror, it stands very close to the greatness of the Resident Evil series.\n\nI would rate it a solid 9 out of 10.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "A very good remake that improves the original in almost every way, it looks prettier, plays better, feels seamless and is scarier. It is debatable whether the original needs a remake or not but it's clear that the Motive team did an extremely good job.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "criminally underrated, one of the best action/horror games eva made :D stunning on oled displays",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I highly recommend this game. I enjoy everything about it, the atmosphere, gameplay, and story.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great remake. I noped out of the original one back in 2009. Shit is still scary, but I 100% the game. Story is enticing, atmosphere is breathtaking (sometimes literally), and game elements are true to the original. Minimalistic (or non-existant) HUD makes the game pop even more. 10/10",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "JESUS CHRIST ON STICK. This game is never ending anxiety, highly recommended",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1]Dead Space Remake — не побег от кошмара, а шаг в его сердце.[/h1]\nСерия всегда славилась атмосферой ужаса и безысходности, и ремейк достойно передал это ощущение — обновлённая графика, освещение и звук заставляют каждый шаг ощущаться реальным, будто ты сам идёшь по тёмным коридорам корабля.\n\nДа, есть и недочёты. Самое заметное — изменения внешности персонажей, особенно Айзека. Другие образцы тоже слегка изменены, но это не так бросается в глаза. Тем не менее, игра не теряет своего духа. Переделанный сюжет сохранил основы оригинала, но Айзек теперь реагирует эмоциональнее и живее, что позволяет глубже прочувствовать историю.\n\nГеймплей стал динамичнее: теперь есть смысл возвращаться в уже пройденные секции корабля, выполнять дополнительные цели, искать ресурсы и секреты. Оптимизация радует, визуал на уровне — чувствуешь весь холод космоса и опасность за каждым углом.\n\nЖаль лишь, что ремейк второй части, вероятно, не увидит свет — потенциал был огромным. Но попытка вернуть серию — достойна уважения. Каждый момент, каждая стычка с некроморфом оставляет след, и ты будто сам борешься за выживание в этой стальной ловушке.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Game itself is pretty good but the stuttering in every door open is make me feel off overall such a great remake",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun game with tight shooting. Plenty of ammo and inventory space is a plus. The only two complaints are clunky flying controls at zero g, and not able to place map markers making back tracking a pain.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've always been a fan of those cosmic horror games, where you have to fight a mysterious alien lifeform. So dead space is definetly one of my favorite games...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is genuinely almost a perfect remake it does does so much in making a better experience and game overall compared to the original. It improves gameplay and difficulty playing on hard mode is a must for this game as it truly puts the survival in survival horror. The game never gets boring as even when back tracking it has a great encounter system that can make you fear every corner it improves on all the main controls and gameplay. 2 the graphics it just looks amazing its visually stunning the art direction is just perfect. 3. lastly the story the story is heavily revamped to improve on a already iconic and perfect story they bring gunner wright to have a fully voice acted and faced isaac they rewrite all the dialogue to give isaac a bigger more important presence instead of the infamous blank slate also adding more scenes, logs and connections to other games to make dead space truly feel like a interconnected universe. although this game does seriously suffer from one FLAW AND I HAVE TO PUT IT ON ALL CAPS IT DOES NOT MATTER WHAT NASA MACHINE YOU RUN THIS GAME RUNS LIKE SHIT THERE IS A ISSUE IN THE GAME REGARDING THE SHADERS AND LOADING IN AND OUT ASSETS CREATING MAJOR STUTTERS DURING TRAVERSAL AND LOADING POINTS",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you want the full experience. I would recommend playing the original trilogy if you don't mind the old controls or graphics. This game does a great job remembering the OG game. Great game, currently at chapter 7 and I'm having a blast. CUT THE LIMBS\r\n\r\nThere is also 2 movies you should watch: Downfall (before the events of the 1st game) and Aftermath (after the events of the 1st game).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Though being a remake, the developers changed quite a few things which makes this remake worth to every DE fan. For example, main protagonist now has a voice unlike being completely silent like in the original. There is also a \"intensity\" director that spawns enemies randomly even in already cleared rooms unlike in original where everything was scripted. The balancing took a hit too and weapons feel like pea shooters (at least at the beginning of the game). I think the game lost a lot from its original atmosphere with this remake (silent isolated protagonist, less action heavy), but improved gameplay. It reminds me DE 2 which I found worse than the first DE.\n\nI recommend playing original DE first and if you liked it, then play this remake.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of my favorite horror games and my favorite schizophrenic engineer, but with a new coat of paint. everything's gorgeous in this game, the weapons feel satisfying to use, and good lord isaac's armor looks so good. i love the gameplay improvements like adding the ability to actually use kinesis to hurl shit at necromorphs and the zero gravity controls.\n\none gripe i do have is i feel like the necromorphs aren't as terrifying as they are in dead space og or 2, they don't scream as loud and a lot of them aren't as jittery (except for a handful) but the game still maintains its tension, still good fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ngl...I thought I was going to refund it because it's made by unreal engine 5 while here I'm using GTX 1660 Super on 1080p res but surprisingly the game is not bad at all in fact it runs really well with custom settings from med to high with FSR on (quality) not even balanced the quality one will handle it with really good fps and I'm getting from 75 to 90 FPS and too rare to see 60 FPS and this is such a nice and perfect experience for this GPU this alone shows  you how optimized that game is <3 didn't refund it and I did really enjoyed it so much",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, looks good, plays good.  There is one minor glitch with the graphics if you change the settings around. It will start to stutter. If you run into this, delete the cache folder. (search google).  Besides that, the game is just as good as it was when it first released!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Unbelievable! Maybe that’s the best word for it. I could tell countless stories about this game, but I’m limited by how many characters I can type here, so I’ll try to keep it short. For me, this is the scariest and most impressive horror game I’ve ever played. For a long time Outlast held the top spot for me, but… to be honest, Outlast relies a lot on jumpscares which of course scared me, and the story is messed up too but here, the atmosphere, the graphics, and the unbelievable sound design together were a perfect hit for me, and it instantly jumped to first place. I’m a seasoned horror game player and I’m not the easily scared type I usually joke around about things  BUT I can immerse myself in games, and… I have to say, the atmosphere in the Dead Space remake is on a level I’ve never experienced before. I literally couldn’t play for more than two hours in one sitting because it was just too overwhelming. And that’s exactly what makes it brilliant. Don’t get me wrong, that’s a positive thing! After two hours I felt completely drained, and I actually felt relieved when I quit the game. Very, very few games can achieve that! The graphics are simply mind blowing, no need to say much more 10/10. The dark areas (and obviously there are many) are so dark that you genuinely fear what might be there because you can’t see anything. THIS is real darkness! The game uses lighting incredibly well. Unreal. The game’s biggest strength is the atmosphere I already mentioned. Brutal! There are no words for it. And the sounds top it all off… I never would’ve imagined I’d like it this much or find it this terrifying. As a newcomer, I’m saying this without having watched long gameplay videos of the original or having played it. I thought, “Alright, it’s on sale, let’s buy it, I know it’s a sci-fi shooter horror, big name, I’ll beat it quickly.” Yeah… sure… It turned out to be the scariest game of my entire gaming “career.” Every minute was a treasure, and I say that not as a fan, but as “fresh meat” in the Dead Space universe.\r\nThere’s only one negative I can mention but… honestly, that’s more my fault technically the start was pretty rough. I blame my not so powerful GPU, so it wouldn’t be fair to blame the game. It doesn’t take away from its value at all. I had to tinker with it to even make it start. Then some areas loaded slowly, and since there are no loading screens, I assume the game had to load a lot of assets at once, which caused doors not to open, or the prompt to open them not to appear even though they should have and I got stuck in places. But aside from that (this was only in the first ~5 hours, after that it ran smoothly), everything was flawless! Here and there an enemy got stuck in a wall or something, but it wasn’t common. I can only recommend it! If you can, BUY IT! It’s worth every penny if you want to be terrified. And the story is pretty good too!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A near-perfect remake of the 2008 survival-horror classic. Which is, despite minor changes that I personally didn't like that much (no cool helmet animation:( why?), still is arguably a better game overall. The things it did change are phenomenal: weapon upgrades, side quests, reworked weapons, the new awesome turret sections and many more.\nSo spread the love for this wonderful game and Motive. It's the least we can do and the least of what they deserve as it very well can be called the best videogame remake ever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best version of a remake in existence of one of the best games ever made, Every other remake out there should take notes on how it's done properly. \nThis remake is incredibly immersive and easily in my top 3 favorite games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The remaster is good, I've had no issues and it looks great.\n\nIt plays exactly how I recall, though it feels like the dialogue and interactions have been tweaked or tuned up - I certainly don't feel as alone as the original, and that's good. Distanced communications from your small survivor group amidst the chaos of what is a corporate space city with thrusters both eases the tension and ramps it up when they're never really tangible except behind glass.\n\nGiven the properties of the marker, it made me wonder who really was alive at which points.\n\nEA please give us the remasters we *really* want with Dead Space 2 and Red Alert 2",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game. Just wish I could have a larger FOV on my widescreen. The character seems to block half my vision most of the time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My first time playing a Dead Space game myself, and I enjoyed it very much! Challenging while still being accessible to a newcomer. Crazy scares and enemies, great visuals and atmosphere. I’ll def be checking out the rest of the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dead Space was truly an amazing game. It kept me engaged all the way to the end, and I genuinely enjoyed every moment of it. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Now THIS is how you Remake a game! I love how immersive the game is, how varied the Necromorphs are, and the uniqueness of the guns (or tools I should say) don't feel out of place at all. What's also very impressive about the game is how the tension never drops off due to the Necro encounters being spaced fairly apart by a few minutes. Keeps encounters scary because you fight these cosmic horror entities far less than you'd expect, perfect for a horror game.\r\n\r\nNow EA, Motive, you better remake Dead Space 2. Because if you don't, I SWEAR TO GOD-",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing this game again realizing I'm still  a grown man who will scream at every pop up scare shows that this game is a timeless classic that will always be forever a generational classic for every fan who loves the horror genre in video games. chiefs kiss 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Dead Space has been my favorite game for years, and I'm glad to say the remake is faithful to its legacy. The reworked story and characters, including the talkative Isaac, are a much needed improvement compared to its predecessor. Sound design and music seamlessly weaves itself into the dark, terrifying and unpredictable atmosphere of the USG Ishimura. However, gameplay aspects that were added to encourage replays, like different dialogues according to your actions, hidden loot and/or abundance of items, are detrimental to the overall horror experience and urgency of the narrative.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's great, better than the original in basically every way. They've stayed so true to the original as well, this is another incredible example of how to do a remake, while adding in some fresh details for new and old fans to enjoy.\n\nI really hope to see a remake of Dead Space 2.\n\nCPU runs a little hot, and the only performance issue I had playing this game was during the finale, apart from that, it ran just fine on my 3070.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is terrifying. Subtle whispers, distance screams and the use of occasional complete silence keep you on edge constantly. Each vent or necromorph corpse could be an attack making you consider whether or not the ammo or credits in that confined and horrific bathroom are worth it. The game is gorgeous in a disgusting and mutilated way and the story changes from the original I think are very welcome. I will say there are some bugs, I had to reload a save due to a game stopping load bug twice. So I highly recommend that you create a new save everytime, just incase.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolute PEAK remake. Beat the game in 2023 and loved it, back at it again for the horror. Game is optimized, and on an OLED... game hits different",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game there is plenty of action & things to find & have to do in the missions to complete including side missions. I won't give much away but I will say you need a decent gamepad though I upgraded to a gamesiir g7 pro for pc this is also compatabile with xbox etc and is rechargeable too or you can run it wired and is fully micro switched for heavy handed duty use.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I feel it does not serve it right to say it's a remake, it's a completely new game. map has been changed, the story, graphics, gameplay, some new characters, side quests.... you name it are all new and all superior to the original. best remake among remakes. 9.5/10. the lacking point is for some minor things like awkward transition between main quest and side quests, too many checkpoints ruining the horror, forced TAA and old FSR2 but you can use the Optiscaler to get around it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best survivor horror games I've ever played. I'd say it's well worth the money on sale, and I was expecting the game to be extremely stuttery after reading reviews, but it's not. There's definitely traversal stutter, and it is frequent, but at least on my setup, running maxed out at 4K DLSS Quality, they weren't enough to ruin the immersion, let alone make it difficult to play.\r\n\r\nTLDR: If you like survivor horror and you either have a nice setup or don't mind some stuttering, definitely get this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m not great at horror adventure games, but damn, this one had me dying constantly. I liked that it wasn’t a total cakewalk, but after a while the repeated deaths just got frustrating. It also takes a while to actually get interesting. I get that Isaac is an engineer and his whole job is fixing the ship, but half the time it literally felt like I was doing the maintenance. There were plenty of moments where I put the game down and had to force myself to come back just to finish it.\r\n\r\nBut around the middle to the end, the story finally hooked me. The lore is solid, not predictable or generic, and it really caught me off guard, in a good way. The combat is fun too, but I kept wishing there was a proper dodge or roll button. And I don’t know if this was intentional, but near the end I couldn’t find ammo anywhere. I’m guessing the devs wanted that section to feel more stressful, and honestly, I respect that design choice.\r\n\r\nOverall, it’s a pretty good game with a strong story. I’d give it a 7.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most uderrated horror gem in the Gaming industry.\nThe best remake I have even experienced so far, totallt recommended!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game for those who enjoy this genre and for those who like slow-paced, survival games.\r\n\r\nThe story is decent. The gameplay is great, and the character is substantial.\r\n\r\nThanks, Dead Space team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Used to play this in its formar original glory.... too bad my potato PC cant handle the remaster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dang, what a game. The UI leaves a lot to be desired but the story and atmosphere were awesome. A few parts that were a bit tedious, seemingly just stretching the game out, but overall I had a blast with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, a really awesome game… IF you enjoy gameplay that basically goes like this:\n\n“Go here and fix this. Cool, you’re done? Great—now something else broke, so walk over there and fix that. Oh, and surprise! Someone betrays you, so now you’ve gotta fix that too. Then walk over here and fix this again. And again. Wait—nope, that didn’t work, so fix this instead. Then you get betrayed again, something explodes, and you fix it… three more times. Rinse and repeat about ten times.”\n\nStill, solid 7/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a good remake! it's really well done visually and fun as heck. My only complaints are I think the game could have been harder. I played on Hard and it was a breeze. Some of the weapons feel underwhelming in comparison to their competition. There are some bugs like menus that can be annoying but nothing gamebreaking. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "solid  horror game if u are looking for a horror game with a good story and horror getting this is a solid choice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The terror atmosphere is really well crafted, it keeps everything from the original and makes it even better. A remake well done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm very happy that this game got remade, the visual improvement is justified and adds to the tension of the environment. Player movement and gunplay is polished, the weapons are very satisfying although the Pulse Rifle is a notable exception in how weak it sounds but there's no reason you have to use it if you don't like it. \r\n\r\nThe one thing I wish was improved was the difficulty of the game, there are limited difficulty modes when I wish there was at least one more higher difficulty. The enemy AI has been changed from the original where they very rarely berserker charge you, more often than not they will speedwalk at you. \r\n\r\nAlso it feels like the enemies have a more limited ability to \"follow\" you between rooms compared to the OG. You are much less punished for running into another room for a breather. \r\n\r\nAdding the ability to kinesis throw blades adds fun but I don't see anything added to make the game harder overall. The game is definitely something I want to replay but if there's no real challenging difficulty, it's hard for me to justify doing that. \r\n\r\nAlso some weapons where changed where I think arguably the game is made easier, the Contact Beam now has \"softer target\" attack which makes the gun a more all-purpose weapon where I think weapons should be more specialised to increase player stategic agency and add more distinct downsides to certain powerful weapons. Because enemies are much slower to rush you, the contact beam charge attack is not really a problem. \r\n\r\nMobility in your player character is improved and feels more responsive but this is at the cost of making it easier to backstep enemies to dodge attacks even when you're most vulnerable such as during a reload. \r\n\r\nWeapon upgrading is less risky, you no longer have to save nodes to reach impactful upgrades, it smoothes out the power curve of the player so the game is easier. You also no longer need to spend power nodes to unlock resource rooms and I doubt the game was changed to compensate this change in game economy. \r\n\r\nVoice acting is a bit awkward at times, but voicework was overall a net benefit to the game. People who complain about \"wokeness\" have an overblown obsession. \r\n\r\nOverall, while I really like the game, it feels like so much of the game was changed, they didn't allocate enough time to make the sure the game was hard enough to be replayed. \r\n\r\n7.5/10\r\n\r\nI would so easily give it an 8 if the game were harder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is simply fantastic. It still is and always will be! Like some others from that era. It's a Hall of Fame game.\n\nIt reminds me of when EA (Origin, Ubisoft, etc.) were still good, serious game developers and almost all of their games were eagerly awaited and actually turned out to be really good. But ok, time is changing...\n\nIf EA has done anything right in the recent past, it the release of this remake! \n\nI often feel like playing games from that era. But somehow, to my shame, I completely missed the release of the remake and only noticed it when a friend was playing it...and luckily for me, it was heavily discounted and available at a good price. Currently €8.99 – an unbeatable price!\n\n\nThe story is absolutely top-notch, the graphics have been greatly improved, and the sound is excellent. The controls are very comfortable and familiar. \n\nYou immediately notice the charm of the games from back then. It gives me that nostalgic feeling that I also get from Resident Evil and others. I really love it. \n\nBUT: I need to adjust the graphics settings a bit, because sometimes it stutters and lags a little. There's a guide in the community that I'm going to try. \n\nPersonally, I love games like this, with settings like this, and the challenge mixed with suspense and horror. \n\nDefinitely grab it while it's on sale, but it's also worth a higher price. \n\nHopefully there will be remakes for the other parts as well, because good games from the past always deserve a good remake or at least a remaster.\n\nSo...Motive and EA, you know what to do, right?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When they released this game. I felt like i was reunited with the love of my life. Dead space has always been a game series i've loved. I started a bit late, but i played the 1st game back in 2010 on my 360, then 2, then 3, and even if 3 was a bit rough, it was still dead space. Even if it was a bit muddy. When i heard about what happened to Visceral games. I was sad, but not every universe needs to drag on. I often think about what dead space would be if it was a puppeted dead corpse (pun intended) like most modern IPs. But honestly, this game felt like a nod to the original. It was fun, it felt respectful to the lore, and the new designs, upgrade mechanics, and open feel of the ship felt perfect. I too had some issues, even running on lower graphics. Fps never felt stable, it would always stutter when i entered a new area. I played with a controller, and i had a few moments where I had input delay. It was uncommon, but still immersion breaking. All in all, I long for the day i can play these games for the first time again. I recommend this to any long time fans, or people who are playing this for the first time. Best horror game out there in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've just finish this masterpice...\n\nLoved every moment of it!\nbought it on a discount but I would buy this even for full price. \nreally worth it IMO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "never played the original, this was cool. good world building and level design. makes you soil your pants near the first half but it gets less scary as you get used to the ship and get better equipment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes gud remake. played original game, good game. played remake, also good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When this game came out I did not play it, so when the remaster came out I had another opportunity to play this game.\r\nIt's a fantastic industrial sci-fi survival horror game, well optimised, a great looking and sounding game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dnt play the original game , just picked the game out of boredom during a steam sale and all i can say is that the marketing team from EA failed this game  , this game is amazing sadly is criminally underrated and we wont get a remake sequel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic Dead Space, very love it. From the gameplay, puzzles, until the story lines. The more interesting in this game is you have to think what you gonna spend each ammo and health pack coz those things really rare to find however the aliens are so hard to kill.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dead Space Remake is truly impressive.\r\nThe atmosphere is tense, the sound design is amazing,\r\nand the improved graphics make the whole experience more intense.\r\n\r\nThe gameplay feels smoother, and the new changes make it even more enjoyable.\r\nThe story hits harder with the added details.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A rare EA W.\r\nIt's a great remaster of a great game and after so many years and with the level design, plot, and other gameplay changes, this felt almost like a new game to me.\r\n\r\nGorgeous visuals, especially the lighting effects. Amazing eerie atmosphere and ambient sound.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect game. Immersive and scary shooter! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best, if not the best survival-horror i've ever played)))\nIt is time for Dead Space 2 to get a remake:}",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dead Space Remake is a good game, but it feels somewhat unnecessary, similar to how I felt about the Resident Evil 3 remake. Most of it is nearly identical to the original, and while there are new features, none of them meaningfully change the experience.\n\nFor me, the original Dead Space left a strong impression when it first released. That feeling is hard to recreate, especially after two sequels that gradually diluted the horror elements. On top of that, it’s been a long time since the last game, so the Dead Space name doesn’t have the same weight it once did. From what I’ve heard, the remake’s sales also weren’t good enough for a new sequel.\n\nMaybe Dead Space could have learn from the Resident Evil approach: release a brand new sequel, introducing fresh mechanics, new story ideas, and modern visuals, and then go back and remake the older games to align with that new direction. You play a new game and have the urge to replay the previous one, and it will make more sense rather than just randomly remaking a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was and still is one of my favorite games ever. I am happy with the remaster. I am not experiencing any stuttering/fluttering  (whatever) other than maybe for the first couple of minutes of initial play. Everything is running smooth and looks and feels great. Nostalgia to the max!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game and everything, love it. BUT if you don't have a controller, you can't go further, especially for chapter 6 when you have to enter the key to enter gravity 0. You can only do it with the controller. With the keyboard it's impossible. Maybe the game is designed for controller only Something that is not specified except on reddit, I was lucky. So be aware if you buy this game, be prepared with a controller.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game: great gameplay and shooting mechanics, perfect graphics, interesting story, genuinely scary ambience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best horror/action gaming experiences I have ever played. I must recommend to anyone who enjoyed games like Resident Evil series or The Evil Within...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EA only made 2 good game in the past 10+ years and this is one of those games.\n\n+ It looks great & Gory.\n+ The new side missions, map parts and re-worked weapons are good.\n+ I like the new voice lines . . . sometimes its 'Hit or miss' but still alright.\n\n- I know it's from 2023 but that bathroom sign was unnecessary changed for the worse\n\n-/+? Why is Nicole looks like she is 40-50 year old? Isaac is into older women now or what? :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I considered to finally play this Franchise I didn't know where to start but with the majority agreeing that this was a fine/better experience I went with this one and I might go and try the original.\r\n\r\nOverall really good experience, good surival horror aspects, love the inventory managment and the fact you have to gib dead enemies to get loot out of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most fun I've had in a videogame. The visuals are amazing, the atmosphere is thick and dreadful. The gameplay, albeit easy, still awesome. They've nerfed some of the scares and rewrote characters and some scenes so the remake doesn't overwrite the original, but it's a worthy rework of a classic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got it during black friday sale for 8 dorra. its more than worth if you get it during the sale. no perf issue no issue",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest over-the-shoulder shooter game I have ever played. Barely runs on my computer but even on low settings, it's fantastic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "why do they spawn 1 small health pack when you're actually oneshot from getting jumped by like 5 dudes it's either that or like 10 bullets no in between but even then you're getting jumped from the back so it doesn't even matter like i'm genuinely gonna run down the road butt naked from this spawn logic!\n\nit does it's job to make you feel uneasy while surviving, great graphics and a plot that draws you in, i like it regardless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 fabulous, spectacular, thank you. A cousin of Prey (2017) and Alien: Isolation.\r\n\r\nWhat can I say that hasn't already been said? Really fun game that strikes the balance between horror and action. The devs were very cheeky making this game. The number of times my gamer instinct was wrong - assuming a broken spinning fan meant danger only for nothing to happen, but a few chapters later to get blasted from a fan vent whilst backtracking. It does a great job of keeping you guessing and on your toes - no encounter is the same. I loved the combat variety, changing environments, enemy types, levels etc. (I hated zero-G though, that shit hurt my brain).\r\n\r\nMy only gripe about it would be the jankiness that I experienced at times. It can get a bit laggy (and it crashed once) which I noticed more in later chapters. In fact, I think the final chapter is also a bit weak and while I appreciate what it was trying to do it fell flat in comparison to the other levels which were far more enjoyable and satisfying to play through.\r\n\r\nGreat game overall though, highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the series and this was a gorgeous Love Letter to the OG game 10/10\r\n\r\nNow Remake the second game. <3 pls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good remake. Faithful and very similar to the original with a couple of touch-ups here and there and still looking snazzy. They made Isaac look horrible, though, and I don't know why. At least giving him dialogue was the correct move.\n\nPlaythrough took me about 10 hours on Medium, it might take longer for you if you're unfamiliar or playing on a harder difficulty. Loading shaders the first time you boot it up takes a while but getting back into it is totally seamless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great survival horror with a great plot and great mechanics. It's definitely one of my favorite franchises because its plot and gameplay. The marketing for this remake could have been better. Still a lesser known franchise within the survival horror genre. Perhaps a better character design for Isaac and Nicole for its promotion would have enticed gamers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game with a lot of character in all parts of its design.\r\n\r\nPlay with an SSD though, I played with an older HDD and although general performance was good, every new environment/room caused a few hitches. \r\n(Tbf, the game did warn me about this on first startup)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great and truly extraordinary horror game in a world oversaturated with the zombie genre of horror.\r\n\r\nThe game is a showcase of the original creative approach and marvelous adjacent artwork contributing the best addition to any type of IP or brand.   \r\n\r\nFrightening and shocking atmospehere combined with great sound design and visual quality making the unpredictability and terror of being trapped in a desolate universe with the unknown within the unknown shines its light in a best manner of any gameplay experience.\r\n\r\nMaybe  EA revisits its creative table and decides that DS2 too get it's remake one day.\r\n\r\nRecommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of glitches but the game is just so good so it don't even matter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just an amazing experience, exquisite sound design, glorious violence, superb writing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very clever game that challenges you in smart ways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Scare scenes and gameplay is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game, probably my favorite horro game of the current console generation. A true shame that we will never get a Dead Space 2 Remake. But the PC version isn't great. There's constant stuttering that never received a patch. For a couple of Euros it is still worth getting but it plays much nicer on my PS5 Pro to be honest. Still, aiming with a controller is much nicer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Performance problems aside with the noticeable stutters, it is a worthy Remake of one of the best over the shoulder Survival Horrors. \n\nIt improves on almost all aspects of the original, bringing more utility and balance for Isaac's entire arsenal, less frustration with the Zero G areas, improved movement and less mandatory backtracking. Facing the necromorphs also demands a bit more strategy since cutting the limbs requires going through skin and meat first.\n\nThe sound design is absolutely fantastic and further enhances the anxiety aspect of facing whatever may lurk around the corner.\n\nHere's hoping that we end up seeing a remake of Dead Space 2. Chances are slim, as EA have never seen the franchise as profitable. Here's a hint towards EA: Sell the franchise to Capcom. A man can dream.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have always loved Dead Space ever since the first release. I must say, that this is a very solid remake. It will make you relieve every highlight of the first Dead Space without diminishing the original experience. It does not matter if its your first time playing the franchise or if you are coming back, this is a solid horror game of the kind we do not get anymore. \nAmazin acomplishment, 100% worth the price! Can't wait for the Dead Space 2 remake if it ever comes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best story games ive played in a while, the OG was good but this one, oof just great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is just a piece of art never had such a experience in this genre the story is good the gameplay is amazing and voice acting is just on point plus the atmosphere is incredible the game is so well done so far loving this game hope for a new dead space game or at least dead space 2 remake overall I highly recommend this game it doesn't matter which type of genre you like in gaming you'll love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another good remake of an original, did some unnecessary changes to the protagonist and some side characters, but overall kept the original plot with a lot of connectivity between zones that the original did not have. Also lets you take the limbs literally anywhere and they seem to stay wherever you leave them forever, if you understand what i'm talking about.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the orginal years ago and thought I can go into this game with bravado... NOPE.\nThis game still got me jumping out of my seat quite a few times. There are areas and enemies that have me on edge!\nAnd giving Isaac a voice is a non-issue, he's not a wise cracking, quip making machine. He's got grit. He doesn't complain, just gets right to work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like bowel-loosening fun, this is the game for you! It's creepy, it's terrifying, it's your worst nightmare come to life. I am sure that there are other games like this that will turn your hair white, but this is the one I know as of right now. If you like jump-scares and unabridged horror, this is the game for you. :()",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome remake. The redesign and attention to detail along with new content are really good.\n\nOnly downsides are the constant microstutters in fps but other than that, everything else is flawless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is how you remake a game! No nonsense, absolutely amazing remaster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Remake. RTX, gameplay and atmosphere are peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enjoyed it goes well with the victus laptop very well scares you great and true to dead space lore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "minimum specs are a joke, other games with these requirements run fine on my system but not this one. 10 fps on menu bug, only 25 fps on lowest settings with fsr2 ultra performance, completely freezes if you change resolution.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished the cutscene got jump scared by a thing falling from the cieling and then immeidately quit the game. 10/10 experience will not play again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still just as scary possibly more scary than the OG, but still gave me nightmares as a 6 year old watching dad play it, this game is what got me in to horror! BUT GOD DAMN IT I LOVE THESE BODY HORROR MONSTERS!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so good, it makes me wish they would consider deadspace 4 or a remake of deadspace 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't like horror games. We should start with that. There were moments that things got scary and I definitely felt like I was in danger. The audio and environment really adds to the immersion. The story was good too. If you don't like horror but want to push yourself - play this game. If you do like horror - you won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "13600k and rtx 4070 @ 1440p 144hz getting 100-120fps ultra with dls.\n\nThere is a bit of stutter which wasnt fixed. I use a controller and its managable\n\nTo get rid of the DLSS ghosting use this link\nhttps://www.reddit.com/r/DeadSpace/comments/10n1ptt/update_dlss_from_25_to_251_to_get_rid_of_ghosting/\n\nTo get the latest DLSS file and drop it into the root game folder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remake felt very faithful to the original with noticeable improvements. Having played the entire series I loved the additions and changes they made to the story. Loved the looks and atmosphere of the game. Personally have not had any performance issues. If you're a fan of the original dead space would easily recommend picking it up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pros: peak gameplay, peak storyline, awesome zero gravity mechanics, ammo eating monsters\r\ncons: needs a good pc, crashes sometimes when changing graphic settings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty faithful recreation of an already pretty amazing game. It improved on the areas where it was more cumbersome to play, and made the game still feel the same as the \"classic\" version. Graphics look pretty modern and performace wise I didn't have any issues.\nPretty neat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic remake to a great game, absolutely worth it. Criminally underrated.\n\nToo bad that EA refuses to remake other games as well, and make us whole again.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Plagued by unfixable stutters the devs refuse to fix.\n\nAt first I thought there was an issue with my new rig. This is one of the first games I bought when I upgraded my hardware this year along with the Oblivion remake. I'm running this with a 4070 ti (12gb vram), 32 ggb of ddr5 RAM and a 13nth gen i9. \n\nThe game suffers from very noticeable micro stutters when moving that I initially thought were just fram drops. Well, after looking into it, I guess there's an issue with the way the game streams compiled shaders. Which can sometimes be fixed or alleviated. But after every time I boot up the game... it's ridiculous. Even on low setting I get constant frame stutters. I'm so unhappy.",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "Classic EA, though just up to an extent:\r\nThe game can't be recommended in it's current state, constant stutters make the game almost unplayable especially that they happen as soon as something would happen (loading areas, enemies etc.)\r\nOtherwise this doesn't seem like classic EA, the remake is one of the best ever made, though I can't recommend it until the stutters are gone (they might never be gone).",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Ok so the game is fine by its content. Unfortunately the technical issues like the need to restart the game after loading a safe or dying and overall bad performance on sufficient hardware (stutters from shaders loading) are really taking a toll on the experience...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A bad remake of one of the best action horror games ever made, at least on pc. Constant stuttering on pc's both mid range and top tier",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Nah, it's a demake. The only positive aspect is the visuals, but even there we get unfixable stutters for that privilege.\nThey've killed the difficulty - Dead Space used to be survival horror, and now it's just a third-person shooter. It's a pretty enjoyable shooter, but NOT what it should be. Or used to be. Never ran out of ammo. Never had to resort to melee, never seen cool kill/death animation because of that.\nThey've killed the sound - the mixing is completely different, incl. no more loud noises (it'll scare kids I guess.. the game is rated 18+ BTW).\nThe message is the creepiest part of the remake's atmosphere by far. Someone was SO insane as to change all these hundreds of little details just to fit their necromorph indoctrination program. Eerie indeed.\n\nIt's still a good game, but no one would remember the original if it had come out in this form.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Stupid ahh game cant even run properly on a 4060, some people claim to be lucky and don't experience lag, I think they were paid by EA to post fake reviews. 9/10 game pushed down to 2/10. Thanks EA",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Total tech mess! Spent an hour on trying to make it run, then gave up and refunded.\nI tried:\n1. Installed on SSD\n2. Deleted cache and allowed game to rebuilt shades (several times)\n3. Tried to change settings to lowest possible and disabling all featrures (incl disabling V-sync, low res, borderless screen, etc.)\n4. Tried to force it to run with dx9 and dx11\n5. Ran install files validation\nInterestingly, main pile of crap takes place in the game menu, while the game is kind of running with periodic stuttering. \nI'd rather re-play good 'ol Dead Space 2008 for 20th time.. Another EA project, another pile of steaming sh..t",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love Dead Space, but this remake *still* has issues after all this time, and I can't excuse that. Every single time I play I run into some audio bug that makes the game really strange to play with very few sounds occuring. The suit changes every time I open the game, so if I want to run the same cosmetic, I have to find a shop every single time I open the game. That's just a few.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Runs Horribly on steam deck. Even with all settings low, different launch commands, and lower than normal resolution it barely stays at a little under 20fps. I could at least try to ignore that,but the picture skips/freezes every time i move my camera so from my own experience that \"verified\" status is questionable at best.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "MY PERSONAL EXPERIENCE:\n\nI was so hyped and ready when I got it near the start of 2025, but the stuttering killed the immersion for me, I couldn't go 10 min without stuttering in every corner of the map. I've tried to get the game again on a good sale thinking maybe it's changed after a year but, NOPE this game STILL isn't working even when I have good PC components it used to have a stuttering issue that would not go away no matter what I did. Now in this year coming to and end 2025! It's gotten way worse! I can't even get in the damn game. It's frustrating because the game looks so good but I can't even play it at all. Such a bummer honestly.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game runs very bad on steam deck. It always glitches/freezes. \n\n\nThe refresh rate for the game on the steam deck always drops super low even on low settings.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Refunding the game.\nApparently it's been a stuttery mess since launch. Nothing you can do about it, it's baked into the game. Refer to digital foundry.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cant even run the game without hitching, stuttering, crashing. Ive spent 3 hours trying to get the game to run properly, steam wont refund because theres no major fault at play. Funny that, considering i cant even change resolution without the game just coming to a complete stop/crash. Not to mention the game always running in the background once you close the game, just sits there at 80% usage even though the app isnt in the foreground of a windows. Audio also crackling on menu, FPS below 10 on menu's. I cant believe their actually allowed to still sell this dribble piss with all its defects. And again, its EA... im seriously done with this company.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Does not work with Razer Tartarus. Basically any device other than standard KBM plugged in at all will make it so you cannot sprint or stomp and are stuck aiming. 2 years after release and this is still an issue...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Still contains well-known framerate stutter issues almost three years after release and uses Denuvo.\r\n\r\nI usually handwave Denuvo as long as the product being sold is actually complete, but since this game was shipped without being properly optimized—containing a framerate stuttering issue seemingly caused by poor environment streaming—it does not get a pass.\r\n\r\nAside from that, the macro changes to the story and structure of the game were very enjoyable; it’s a great remix of the original Dead Space. However, some dialogue, parts of the voice cast, and changes to a specific character’s characterization definitely feel like a step back from the original.\r\n\r\nThe game was never really all that difficult, even on the hardest (non challenge run) difficulty, and it becomes easier as you progress and upgrade your rig and weapons.\r\n\r\nAs a game, it’s probably a 7–8/10.\r\n\r\nAs a product, it’s a 0/10 for being sold incomplete and for including Denuvo.\r\n\r\nI would have refunded it if the original hadn’t been a seminal experience for me when it first came out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful and atmospheric experience ruined by poor optimisation and technical issues. I lost all of my saves when it crashed at a late point of the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is borderline unplayable with constant stuttering.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Control issue make the game unplayable. Should be an option to choose controls.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "data board wouldn't spawn. Had to start the game all over. Fix this crap. Its been almost 3 years. This is my first time playing the game!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A [i]\"modern reimagining\"[/i] is, evidently, the worst thing you can [i]ever[/i] do to a series. I really hope this kind of disaster never happens to something I like again, but I'm sure it will in time. An intellectual property should never be handled by people who don't care about it, and yet that's exactly what happened.\n\nI will spare you the essay-sized review I could easily write and instead be as succinct as possible - this is one of the biggest travesties of a remake in the entire history of gaming.\n\nWhy would you do this?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Horrific frame drops from 100-120 fps without or with FSR to single digits all the time. The game is pretty much unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The original game is an amazing game and one would have expected them to stay true to the story. They altered multiple parts of the story very heavily and not because they needed to. The only viable reason is that they either hired one of the consultation agencies or had a bunch of purple hair kids yelling about being triggered getting to have a say in how to alter the story. \n\nIt would have been better if they had their internal meeting where they decided to bring it back and \"modern audience\" it, that they had just cancelled it instead. The only good news is that it sold so poorly that they won't be touching the 2nd game. Although EAs new owners will likely no longer tolerate the purple hair tribe's tyranny any longer which might be the only benefit going forward. \n\nThe original still holds it own, still has the superior story and typically sells for less on sale. I would recommend you buy that long before buying this. At least at minimum, buy that and play it first so you can see for yourself just how much they altered the story.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a die-hard fan of the original Dead Space I was always going to come into this remake being very critical of it. It's a much more grounded take on the first game; it tells the story it wants to tell more effectively and with a fantastic voice cast to boot. It fleshes out some of the characters in greater lengths and introduces some new ones who I liked. I enjoyed the little side quests they added too, it gives you more of a reason to backtrack through levels and grab any areas and high security clearance loot you may have missed. The gameplay felt more forgiving (I played on Hard, but mouse and keyboard is quite the advantage here) so for newcomers I think this is the perfect introductory to the franchise. If that sounds good to you, you should check the game out when it goes on sale. It's pretty short, 9 to 14 hours for a first playthrough, but it's such a fun game to replay that you'll get your money's worth.\n\nAlthough, I say \"on sale\" because of the performance issues I ran into. I meet the recommended PC requirements, minus the fact I am on Linux and my CPU is a 5600 and not a 5600x. I switched all my graphics settings to Low for my playthrough and I was at a comfortable 120 frames at 1440p, but there was some serious traversal stutter. The first 2 or 3 chapters were absolutely brutal with this, full 2-3 second freezes walking from area to area, mid-combat AND mid-cutscene. The game crashed 4 times, each of them forcing a reset of my system. In Fullscreen mode the game was even worse somehow, so I had to settle for Borderless Windowed. And for whatever reason the game also requires an internet connection? If the game wasn't gifted to me I'd have 100% refunded. It's just an unacceptable state the game has been left in.\n \nIt really soured the experience for me, when I was already going into this expecting to be disappointed... I'm going to get into vague spoiler territory now, but on a more personal note I don't think this remake holds a candle to the original game. \n\nGiving Isaac (our main character) a voice was the worst thing I think Dead Space 2 ever did. Most people forget he didn't have any lines in the original because he played his role so perfectly as the silent engineer, going through all manners of hell himself only to come out the other side with nothing to say. Nothing but guttural screams of a man so sick of being here as he cuts his way through hundreds of former crew. The way everyone around him and onboard the Ishimura acted in contrast to Isaac, their descents into madness, hysterics and insanity added so much tension to the game, you feel like you're the only sane person left and it pays off incredibly so towards the end. In this remake it's so much more on the nose (you know what I'm talking about). The performances from some of the characters like Kyne and Mercer were so crazed and unnerving, and this remake pulls away from a lot of that. It's things like this, all compounding together to take away from an atmosphere Dead Space 2008 so perfectly created. It even gets rid of Twinkle Twinkle Little Star echoing throughout the Crew Deck, instead opting to put it in... an elevator? One of the safest places in the remake?\n\nAnd regarding gameplay; the remake streamlines a lot of areas, taking away the interactivity the original had that made these really tense gameplay moments special. Because yeah it was kinda clunky having to move all those damn beds around in the Crew Deck to escape... well, you know, THAT thing, or having to move Important ObjectTM from the loading zone yourself while being chased from all sides, but those were exciting moments! The dangers felt so much scarier because dying meant losing all that hard work you put in and reverting to your last save! And the Remake throws those out!! It's such a unnecessary change. I don't like the free floating areas, I get so motion sick doing them and floating gives you such an advantage in combat that you really don't feel in danger at all. While the original was much more stiff with its zero-gravity jumping, at least it kept you oriented the right way up, with each jump requiring a set-up it meant you had to plan and even that added to the tension. The real danger in the remake comes from not being able to see the enemies in the zero-gravity areas because of how everything blends in.\n\nAt the end of the day I'm very glad I still own my PS3 and original copy, so I can always play the game the way I like, the way I remember it, from the dev team that put a lot of love and passion into their RE4 inspired sci-fi hit. This remake is fine, Motive made a very pretty game, a very faithful game in their own way, as the steam reviews suggests most of you will not care or notice, new players especially. But it bothers ME, this is MY review, so it gets the thumbs-down. I'd still like to see what they do with Dead Space 2 and 3, if they ever get the chance.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game has an existing bug which might crash the graphic card driver resulting in crushing the game and even BSODs. None of the provided workarounds worked for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I only payed 10 bucks for this game so i ain't mad. But man the stuttering is crazy. They will never fix it unfortunately . idk how all the reviews just ignore these issues. even for 10 bucks this ain't worth it might refund lol. lowkey a rip off its a shame tho looks visually amazing",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Thought it was just another spit-shine cash grab, turns out they completely changed the original game. Good for them for putting in some effort I suppose, but it's not worth paying sixty bucks if you want to relive the terror of the first installment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not playable with the fps drops every 2 minutes when something loads in or a event is about to happen.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A fantastic game plagued by a extremely common and very severe stuttering issue which makes it effectively unplayable - just buy the original.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything pretty, but running smooth 75 fps and each like 10s game drops on less than second to 5 fps ( high end PC )",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe i'm the problem for expecting capcom kinda remake but didn't meet my expectations. Original is way better imo.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "- Poorly Optimized\r\n- Stutters\r\n- Critical Bugs\r\n\r\nBy the time you get weapons and upgrade them to a decent level , chapter 8 / 9  are over and there are not enough enemies to try them on.\r\nI didn't really enjoyed this game as compared to DS2 and DS3",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a joke. Can't even try to enjoy because I'm constantly getting freezes lasting several seconds right at the starting cutscene. changed the graphics settings, deleted the shader cache, and its not working. What the absolute fuck EA? Pull your heads out of your asses.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dead Space Remake: buggy af, cutscenes bugged out, constant pop in from enemies and terrain, cutscenes just straight up not working, audio sync problems, audio not working at all problems, quest items straight up dissapearing from existence which EA said they fixed but clearly they fucking didn't.\nPut this on an SSD, same issues, I have never been so dissapointed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't want to buy this game until it was on sale for dirt cheap. Decent remake, plays and looks almost exactly the same as the original with some glaring exceptions.\n\nCompletely unnecessary race swap of certain characters that can't help but take you out of the game especially if you've played the original. Not to mention they also race swap many of the characters featured on the propaganda posters throughout levels of the game. Devs hate white people.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "genuinely buggy and unplayable, refunded",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game wastes your time with arbitrarily difficult puzzles. It pads out the game. It is so much like resident evil or silent hill.\n5/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kendra is now a lesbian, they added gender neutral toilets, etc etc.\nThis remake is a literal insult to the original game. Just as \"Dragon Age The DEIguard\" was to DAO.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "microstuttering on every hardware and they dont care about it",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "What the hell is it with this way overuse of this 3rd person view crap in vid games. With 1st person I can see the environment unobstructed by my goofy character,  and this is one of the worst implementation of 3rd person I've ever seen, it's like trying to steer a car fron the passenger seat. I already deleteed a first time because of that long drawn-out cut scene at the start, but I gave a second try until actual gameplay and seen this crap 3rd person. so now it's deleted for good.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stutter fest, impossible to play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "DOG SHIT ASS GAME STUTTERS LIKE SHIT FIX THIS PEICE OF FUCKING SHIT GAME I CAN MAKE BETTER SHIT OUT OF MY ASS!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "You spend most of you time slowly wandering around too dark corridors trying to open doors. The map is really hard to use. Thought this was a FPS.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bad optimization. CPU wont stop burning in hell",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rubbish game have to rese all keys to RUN  . . \n\nYou have to go into the Controls/Keybinds settings (in-game) and \"Clear\" every single Controller Button mapped in the Controls options. You press T to clear an action, so just make sure you clear the Controller Buttons and nothing else. Some of the buttons mapped can't be cleared, but clear every single one that you can and the weird feeling should go away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Still contains well-known framerate stutter issues almost three years after release and uses Denuvo.\r\n\r\nI usually handwave Denuvo as long as the product being sold is actually complete, but since this game was shipped without being properly optimized—containing a framerate stuttering issue seemingly caused by poor environment streaming—it does not get a pass.\r\n\r\nAside from that, the macro changes to the story and structure of the game were very enjoyable; it’s a great remix of the original Dead Space. However, some dialogue, parts of the voice cast, and changes to a specific character’s characterization definitely feel like a step back from the original.\r\n\r\nThe game was never really all that difficult, even on the hardest (non challenge run) difficulty, and it becomes easier as you progress and upgrade your rig and weapons.\r\n\r\nAs a game, it’s probably a 7–8/10.\r\n\r\nAs a product, it’s a 0/10 for being sold incomplete and for including Denuvo.\r\n\r\nI would have refunded it if the original hadn’t been a seminal experience for me when it first came out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful and atmospheric experience ruined by poor optimisation and technical issues. I lost all of my saves when it crashed at a late point of the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is borderline unplayable with constant stuttering.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "wannabe horror on rails. Just boring and clumsy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "if youve played the old dead space, youve played this one. its almost a 1:1 remake,",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unplayable techical mess would be generous.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The stutters are genuinely killing the experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Any game dev born after 1993 can't optimize",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "don't like it, i got bored.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is very very very boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "save broke and now i gotta restart yaaaaaaaaay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game runs poorly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stop remaking games that don't need to be remade",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stutter simulator",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "OG is better",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Chapter 9 game breaking bug that is well known. I have reloaded prior saves multiple times and released the nuke multiple times, but it keeps respawning.  If Motive can't be bothered to release a patch, then I can't be bothered to recommend the game.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Plagued by unfixable stutters the devs refuse to fix.\n\nAt first I thought there was an issue with my new rig. This is one of the first games I bought when I upgraded my hardware this year along with the Oblivion remake. I'm running this with a 4070 ti (12gb vram), 32 ggb of ddr5 RAM and a 13nth gen i9. \n\nThe game suffers from very noticeable micro stutters when moving that I initially thought were just fram drops. Well, after looking into it, I guess there's an issue with the way the game streams compiled shaders. Which can sometimes be fixed or alleviated. But after every time I boot up the game... it's ridiculous. Even on low setting I get constant frame stutters. I'm so unhappy.",
      "voted_up": false,
      "votes_helpful": 120
    },
    {
      "review": "After close to 2 years, they still have not fixed the game breaking bug that soft locks you in the \"Find the Captain's Body\" mission.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I wish this game was better optimised... The gameplay is great, combat is fun, the story is immersing and charachters are very good BUT this game runs horribly, I have a strong computer (9070xt and 9700x) but the game stutters like crazy, I have tested it in 4 computers so far and it stutters in every single one of them. This is unacceptable. 9/10 game, 1/10 optimization. Save your money, this is not worth the price.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "I built a new computer this year, Dead Space was one of those reasons as it stuttered on my old rig.\nWhen I can't get 60 frames at 1080p from a 9070XT and a 9800X3D, it becomes pretty obvious that it may just be horribly optimised.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Classic EA, though just up to an extent:\r\nThe game can't be recommended in it's current state, constant stutters make the game almost unplayable especially that they happen as soon as something would happen (loading areas, enemies etc.)\r\nOtherwise this doesn't seem like classic EA, the remake is one of the best ever made, though I can't recommend it until the stutters are gone (they might never be gone).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "tried it for the first time back in 2024 - heavy traversal stutter, uninstall\r\n\r\ntried it now a year later, 2025 - heavy traversal stutter, uninstall again...\r\n\r\nShame, really wanted to experience this...",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Well this is basically my thoughts so far, i don't really leave many reviews.\nFirst of all the game looks amazing and feels good. \n\nI cant recommend the game , it has so much micro stutters that makes the game unplayable, i have done everything in the graphic options from low to high been messing with it on all different settings. Until the devs fix this problem with some update or fix i would'nt recommend it at the moment even if its on sale. \n\nRyzen 7 5700X3d\n32 gigs 3600 ram\nRX6700 XT \nWindows 10 pro",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Ok so the game is fine by its content. Unfortunately the technical issues like the need to restart the game after loading a safe or dying and overall bad performance on sufficient hardware (stutters from shaders loading) are really taking a toll on the experience...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "this is not a good PC port for people that are getting this without a high performance PC the stuttering and frame rates doping If you have PS% or Xbox sires I would get the game on that",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Stutter Space, a great game hidden underneath a lot of performance issues:\r\nTraversal stutters, shader compilation stutters, random performance variability between runs having changed no graphics settings, etc.\r\n\r\nThe game has great visuals and audio, but the constant stuttering make it difficult to enjoy, no hope for a fix now either.\r\n\r\nIt has great ideas and a lot of expansion over the original's setting, sadly the sheer inability to immerse the player given the performance issues make it all for nothing.\r\n\r\nIf you can put up with the constant stuttering, you'll find a great game hidden underneath, but if you value stability even a little bit, you might want to give this one a miss.\r\n\r\nI would have loved to see a remake of the second game, but I doubt we'll ever get that, and if we do, I shudder to think of the technical state it will release in.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nah, it's a demake. The only positive aspect is the visuals, but even there we get unfixable stutters for that privilege.\nThey've killed the difficulty - Dead Space used to be survival horror, and now it's just a third-person shooter. It's a pretty enjoyable shooter, but NOT what it should be. Or used to be. Never ran out of ammo. Never had to resort to melee, never seen cool kill/death animation because of that.\nThey've killed the sound - the mixing is completely different, incl. no more loud noises (it'll scare kids I guess.. the game is rated 18+ BTW).\nThe message is the creepiest part of the remake's atmosphere by far. Someone was SO insane as to change all these hundreds of little details just to fit their necromorph indoctrination program. Eerie indeed.\n\nIt's still a good game, but no one would remember the original if it had come out in this form.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I want to preface this by saying I'm a big fan of the Dead Space games, I love each one for their own reasons (yes even 3.) So it pains me to not be able to recommend this game.\r\n\r\nWhen I finally started playing the game after waiting a while to get a better PC, I was loving it, the graphics look amazing, the sound is great and the gameplay was fun. The first day I had no issues.\r\n\r\nThen as I continued to progress through the game I started getting these weird crashes that make my entire PC restart. At this point I was thinking there was an issue with my computer, but I wasn't having any issues with other games, it was only limited to this game.\r\n\r\nThen I entered chapter 4, and the crashes went from happening after an hour or so, to every few minutes. I looked up any possible fixes to the problem such as changing some settings in the NVIDIA Control Panel or using an older graphics driver that supposedly didn't have the crashing issue.\r\n\r\nSo after trying out these fixes, I start up the game and I suddenly can't load my previous save, even though the saves are still in my documents folder. So I find a post saying to back up one of your previous saves, start a new game, get to the first save point and make a manual save. Once that's been done you're supposed to put the old save into the folder and replace the new save with the old one.\r\n\r\nFine, whatever, at least I'm on the old NVIDIA drivers that don't have the crashing issue right? I'll just beeline to the first save point and continue with the game. Run through the Necromorphs at the start grab the Plasma Cutter and- you can guess what happened next :)))\r\n\r\nAll in all, it's a great game, when I'm able to actually play it, but with the crashing and my saves apparently being gone, I'm done. I REALLY wanted to love this game too, and I was, but unfortunately I won't be able to see it through to the end.\r\n\r\nTL;DR: Game ran well, was good and I was having a fun time, until I started getting issues with the game crashing my entire PC even after only playing for a few minutes. I tried fixing it with various methods until I suddenly can't load my save file either, I try fixing that issue as well when I have one final crash that broke the camels back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A bad remake of one of the best action horror games ever made, at least on pc. Constant stuttering on pc's both mid range and top tier",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Whats the point of remaking the game if you keep bastertizing the art iself in a first place. This is not a remake this is Demake from hell. Never felt so infuriating, sad and betrayed like with this one. But I guess this is not the first time EA killing games left and right-its in their moto. \n\nSo lets start from Ishimura ship itself. Well there is none Ishimura in this game. Whole thing feels small, lacking of purpose and direction. In the original you felt like youre in uncharted territory. Felt like you exploring this huhe huhe ship with many layers of sections that leads you in unwanted nightmares. Every time you boarded train to next location they showed you on Ishimuras map where you are and where you going. It was journey within a journey. Felt good felt real. In this demake there is none of that. Feels like you exploring one smallish map with no destination. When you board train to go see whats next they show you just straight up line: no Ishimura map design no nothing just straight up line. Upon arrival on new location everything felt the same while in original you knew that youre in different place. In this one everything feels so shallow. \n\n“I was born in darkness, molded by it” The biggest problem I saw in this demake is how everything is so damn dark. Like literally game is way way to dark. I know its an horror game but even then this felt so BAD. And please I have played many games with darkness in it and never felt this discomfort like in this one, especially when you navigating through narrow shafts in zero g gravity. \n\nIsaac now moves like sonic speed. Original didn’t had this problem. Everything felt calculated and measured. In this one you move so fast that it removes that special scary part. Now you can feel like you can outrun everything and nothing will grab you which is ironic knowing horror games should not be like this. Tha leads to another broken part is that every Necromorphs now moves also with sonic speed (even faster than original) and the game becomes just another twin stick shooter. Like NO….NO. This is not suppose to be like this. You have to feel tension, weakness and deal with unreasonable measures to counter them. On top of that devs decided to throw at you [spoiler] super soldier with even 3x speed [/spoiler] later in the game. Like you cant make this shit up its just pure comedy. \n\nWeapons and suit upgrades now requires mandatory money grind for no reason. In original if you founded power nod you just go into a bench and upgrade your weapon tree how you liked and when you needed. Now for some reason devs made it even more painful because of f reasons? This upgrade system is so badly designed and not welcome. Why I should suffer in later game if I cand upgrade my weapon because I haven bought some stupid 11K, 12K, 13K upgrade pack. . .\n\nHard difficulty in this game I founded overtuned like hell. Not only that but the economy with dropping ammo is also painfully designed. In original I never felt need to constant search for ammo or I had decent number saved ammo in my suit. In this game you run out of the bullets so fast that its not even funny. The problem is that in later game they reduced drop bullets from enemies that you kill for your specific weapon. Some of the Necromorphs to kill you have to spend more ammo than for anothers even thou they are the same Necromorphs you killed few rooms before. That doesn’t make any sense whatsoever. So if you try to beat this game only with Plasma cutter then good luck because its not going to be fun. Exploders now take more time to kill too. Zero sense to me. In original you just needed one shoot to explode them but now you have to do two shoots. Wowy zooowwyy….. I beated the game but still don’t know how to kill Guardian on the wall. He takes so many ammo and refused to die. Not sure what that bs so I just ran pass them every time I encountered them. \n\nTwinkle Twinkle little stars now used randomly in some elevator section. Why? This doesn’t need to be here. Removes all purpose and tarnish original.\n\nIsaacs wife now for some stupid reason some 70 year old granny. What are we doing brother? And Issac itself is much much older. Dunno maybe this is developers fetish or something? Why we keep destroying what was already a perfection in the first place made years ago? \n\nAnd the last I leave with biggest downgrade from original. Now everyone needs to talk. Just yap yap yap yapping never ending yapping. There are so much talk in this game that it completely misses the point of the original. Sometimes in peace and quiet in your mind when you roam the dark rooms filled with monsters and vision makes it more special. With all your thoughts and fears you push forward knowing that nothing is lost. But how can you be in horror and fear if there is constant yapping yapping.\n\nThese developers didn’t understood what made original so special. They don’t know what horror game is in the first place. Screw them for destroying masterpiece vision for what is original Dead Space 2008. \n\nRIP Viceral Games. Your art will be forever one of the best horror games ever produced.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lovely remake that's held back by performance issues, not sure if its just an AMD issue as i have a 7900 xt but even still; The 7900xt should easily slam this title in 1440p. However with constant stutters while moving on all low settings mind you is just plain stupid, turned frame gen on and even it couldn't save this title.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game stutters like crazy (complete freezes for 5-10 seconds at a time) on my PC with an RTX 5080, an AMD Ryzen 9 9900X and a Samsung 990 Pro 2TB.\r\n\r\nInstant refund!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Bought for 8.99 on sale, was looking forward to playing Dead Space again for the first time in over a decade, and it's hot garbage. Issues, minor and major, in no particular order:\n\n1) Unskippable warning screens at startup about epilepsy and \"scary\" content that you can't skip. It's not to cover loading in the background, they're just mandatory every time you load up the game.\n\n2) EA collects your device info for data mining purposes by default and you have to turn it off manually in settings.\n\n3) No DLAA or native resolution option, only TAA which doesn't look good to me. DLSS Quality shows minor ghosting but apparently the best option.\n\n4) In the first five minutes of the actual game, I notice\n    a) they made Nicole 20 years older\n    b) they completely changed Isaac's face and hair as well\n    c) they got rid of the white male pilot and replaced him with a black female with faddish haircut\n    d) Daniels mentions a girlfriend so apparently is now a lesbian\n    e) The intro is drawn out with unnecessary additions and hammy dialogue during the \"docking\" scene.\n\n5) The stuttering. I have a 5070, 7600X3D, 32GB of RAM, and NVME SSD. I can average over 100FPS on max settings, over 200 on low settings. Yet no matter the settings, I get stutters every few seconds just walking back and forth in a hallway or tiny room. From 200FPS to a microstutter freeze, several times a minute. Ridiculous.\n\n6) Oh and the necromorph screaming sounds like some drunk guy raging at me instead of a half alien menace like in the 2008 version\n\nLooking up the game online, apparently it is notoriously unoptimized, hence the stuttering, and the anti-white pronoun people made a lot more changes throughout the game to \"improve\" it. I'm getting my 8.99 back, I wish I could get my 30 minutes back, these devs should never work again.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Dead Space is a great game. The PC performance issues on this port, however, make it a tough play. I can't recommend this in its current state, hopefully they fix it but it's been two years so probably not.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't recommend this game honestly. I tried to give it a chance, the graphics are gorgeous but my god the stutter is crazy. I tried everything. Stutters on the lowest graphical settings too, which should NOT happen with my rig, especially when I play on 1080p and I even tried it at 60 fps..nothing really helps, it ruins your immersion. The game was abandoned after like 2 patches, they never fixed the performance issues, made my cpu reach crazy temps too. Basically unplayable. Did not expect this at all with the overwhelming amount of positive reviews. I had this refunded, average EA experience.\n\nAMD Ryzen 7 7700X\nNvidia RTX 4070 SUPER\n32gb Corsair Vengeance DDR5 ram\n2TB SK Hynix Platinum P41 SSD NVMe\nASUS TUF Gaming VG249Q3A 1080p 180Hz monitor\nWindows 11 Home",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Despite being listed as Steam Deck Verified, the stuttering makes this game pretty much unplayable. And it doesn't seem like EA will patch this game to improve it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Total tech mess! Spent an hour on trying to make it run, then gave up and refunded.\nI tried:\n1. Installed on SSD\n2. Deleted cache and allowed game to rebuilt shades (several times)\n3. Tried to change settings to lowest possible and disabling all featrures (incl disabling V-sync, low res, borderless screen, etc.)\n4. Tried to force it to run with dx9 and dx11\n5. Ran install files validation\nInterestingly, main pile of crap takes place in the game menu, while the game is kind of running with periodic stuttering. \nI'd rather re-play good 'ol Dead Space 2008 for 20th time.. Another EA project, another pile of steaming sh..t",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love Dead Space, but this remake *still* has issues after all this time, and I can't excuse that. Every single time I play I run into some audio bug that makes the game really strange to play with very few sounds occuring. The suit changes every time I open the game, so if I want to run the same cosmetic, I have to find a shop every single time I open the game. That's just a few.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrible performance on 9070 XT, 7800x3d, 32gb. I'm limited by my monitor to 1080p 60fps, so the GPU can easily do the job at max settings, usage is around 50%-70%. Yet I still get 1-3 seconds freezes when I enter a room, plus random stutters. Pity, I really wanted to play this game, but it's very poorly optimized.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Remove Denuvo pls. Good game, but play on console until they get rid of that malware",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Stick to the original. This game has prettier graphics, but it runs horribly, it's like a slide show at times. The original is still a master piece and the graphics aren't bad at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It looks a little better than the original and the changes to the level layout and story are good/fine, but it runs very poorly. With long screen freezes and bugs. Sometime the cut-scenes have broken visuals or audio tracks and loading into a level with an enemy spawned in will leave them invisible for several seconds.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "stutters (that people will for some reason try to gaslight you into thinking its your fault or your pcs fault) throughout the game, it didnt really interfere with the combat at all, but it did make traversal a bit jarring, and the fact that it was never fixed. \n\nThis game is dark, i dont mean the story, though i guess it has that some, but i mean lighting, its so dark that even on max brightness you still cannot see anything in some areas without your flashlight, so turning your brightness up removes some of the tension in areas that you can already see in, but does nothing for areas you cant see in.\n\nparts where you feel like there really needs to be more dialogue, or isaac just doesnt even try to speak even though he has the chance (example being something like your character going through a surprise cutscene attack, and afterwards saying nothing and acting as if it never happened). \n\ni did get one freeze at the end of the game and had to restart.\n\nforced backtracking if you want to collect all the stuff (pretty standard so not really bad, just a tad bit annoying). \n\na feeling that variety of weapons does not matter, you at most need 2 or 3, and itll be the stuff you actually have ammo and upgrades for alongside the flamethrower to deal with certain enemies way faster.\n\nits not a long game, and visually if fine (and its also ea, so im biased), so definitely never worth full price, there are steep sales a lot so you could get it then, but theres far better games \n\n(supposedly the original is really good, ill get around to that some day if i remember)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "great game but unplayable on the steamdeck. i dont understand why its verified",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Runs Horribly on steam deck. Even with all settings low, different launch commands, and lower than normal resolution it barely stays at a little under 20fps. I could at least try to ignore that,but the picture skips/freezes every time i move my camera so from my own experience that \"verified\" status is questionable at best.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I refunded it and I do not recommend buying it! Unbearable stuttering makes the game unplayable. Shame on EA for releasing a broken unoptimized game and abandoning it instead of patching it. I gritted my teeth buying a game with DRM denuvo anyway. Severely unethical market practice. I bought it at -85% special price but it's not even worth one cent. Matter of fact, EA has to pay me now to stop holding a grudge.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MY PERSONAL EXPERIENCE:\n\nI was so hyped and ready when I got it near the start of 2025, but the stuttering killed the immersion for me, I couldn't go 10 min without stuttering in every corner of the map. I've tried to get the game again on a good sale thinking maybe it's changed after a year but, NOPE this game STILL isn't working even when I have good PC components it used to have a stuttering issue that would not go away no matter what I did. Now in this year coming to and end 2025! It's gotten way worse! I can't even get in the damn game. It's frustrating because the game looks so good but I can't even play it at all. Such a bummer honestly.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game runs very bad on steam deck. It always glitches/freezes. \n\n\nThe refresh rate for the game on the steam deck always drops super low even on low settings.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stupid ahh game cant even run properly on a 4060, some people claim to be lucky and don't experience lag, I think they were paid by EA to post fake reviews. 9/10 game pushed down to 2/10. Thanks EA",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Refunding the game.\nApparently it's been a stuttery mess since launch. Nothing you can do about it, it's baked into the game. Refer to digital foundry.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is really good! *but* it literally breaks if you try to replay it even once",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Does not work with Razer Tartarus. Basically any device other than standard KBM plugged in at all will make it so you cannot sprint or stomp and are stuck aiming. 2 years after release and this is still an issue...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "!ATTENTION!: \nThis is not an updated version of the original classic. It's a 2020s Hollywood-style remake, i.e. a group of mediocre (at best) devs and writers taking a franchise popularized by people with real talent and vision and trying to capitalize on it by making their own 'modernized' version, rather than making something of their own. \nSadly, the modernization doesn't apply to gameplay or graphics. Instead it's a shameless display of Disney/Marvel/Netflix style political preaching, along with dialogue and story writing that actually makes even the cringy writing from the original sound like Shakespeare.\nNot surprisingly, from a technical perspective, the game is buggy as h*ll, and in some parts barely playable, but this has also become common for projects like this, You might have thought that improving on the original, in terms of camera control and the sluggishness of character responses to player inputs, would have been welcome, but none of that seems to have been a priority.\nYes, shame on me for not doing some research about this piece of dung beforehand and just assuming that it was a much needed revamp of the technically problematic original (which was created for the console market and ported to PC as an afterthought).\nOn the other hand, this was a kind of 'first' as far as I know. Someone said \"Hey, see all these badly-made, politically 'modernized', versions of classic popular movies they're making, which nobody goes to see? We could do that with a classic game too!\"\nDon't be fooled. Just because you don't see the characteristic bright pastel colors and generic, glossy, Pixar-style, character design now associated with failures like Concord, or the obnoxiously cartoonish latest COD and Battlefield releases, this is coming from the same types of devs with the same priorities. If you got a technically well-executed and enjoyable player experience in exchange for swallowing the rest of it, that would've been nice, but no such luck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "короче ниче не потеряете если скипнете. я в 2011 играл в дед спейс на мобилке и это АБСОЛЮТНО тоже самое.\r\nвидимо мое проклятье, что я играл в лучший сурвхор в лице систем шок 2 не позволит мне кайфануть от таких замечательных представителей жанра как дед спаче, резидент калыч и копро хилл. а жаль очень хотелось порешать придурковатые головоломки",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Forced TAA.\nEDIT: Going to try hex edit for the first time to see if it can be disabled...\nEDIT X2: So the hex edit works, but still why do I need to use hex edit to disable something that makes games look horrible and hurt my eyes/ make me sick? Horrible choice. Dont force console shortcuts onto us, especially those that get sick from it. So take the thumbs down. Its well deserved. I played the OG game on 360 and it was epic. They did the real work so they get a thumbs up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The performance issues in this game are inexcusable. I needed to do so many fixes to troubleshoot crap yet I still had prevalent frame drops and slowdown. Based on the other reviews, seems like this is very common. Yet, I played through the entire game because I like Dead Space and hate myself. I got the game on sale for $9, yet I still wish I would've never given EA a dollar. This is one of the most pointless remakes ever made and if I ever play the first Dead Space again, it'll be the original.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}