{
  "positive": [
    {
      "review": "6/10 It not terrible but it's not great either. The universe is big and filled with planets but at the same time most are rng instances with the occasional pre-built story location. It looks visual stunning but underneath it's somewhat hollow and empty. \r\n\r\nBasically, it's a big box that looks good and has loads of details but inside there is loads of empty/dead space.",
      "voted_up": true,
      "votes_helpful": 171
    },
    {
      "review": "i don't think this is a bad game, but it's definitely disappointing.\n\ni should preface this with the fact that i do have some bias, as i find sci-fi to be a much more boring setting than their other series in a fantasy or post-apocalyptic world. that said, i still have lots of issues with this game which go far beyond my lack of interest in the setting.\n\nthe gunplay in this game is a major improvement over any previous bethesda games. it still doesn't feel as good as other modern first-person-shooters, but i don't think it needs to. i really feel like it's gotten to a point where the gunplay is as good as it needs to be for what is really an open-world-rpg first, first-person-shooter second. a small gripe i have however, is that the gun designs themselves are a bit uninteresting. in their pursuit of a nasa-punk visual theme, a lot of the guns don't actually make sense in how they would function. which i think is fine! however while the fallout series has plenty of guns which wouldn't make functional sense in the real world, their designs can be really unique and interesting. i found the guns in starfield to be unfortunately really forgettable - i think the corporate dystopia theme of the game played into this in a negative way, i would have liked to have more weapons i could get attached to. there wasn't any \"starting 10mm pistol\" to get fond of, nor was there much in the way of single-appearance unique weapons like the junk jet or deliverer from fo4. all uniques were just name and stat changes (sometimes with a paintjob swap) of an existing, normal weapon type. actually unique uniques do take more work but i feel like they're really important in giving the player something to get attached to over the course of gameplay. also, the really fun weapon (and armour) upgrade system from fallout 4 is back, but i feel like it's implemented far worse in this game. there is not nearly as much visual change with the upgrades in starfield, and overall it just feels like a much more shallow, uninteresting system which is easy to ignore for your entire playthrough. considering the potential shown by the already good system in fo4, i'm really disappointed that the modularity of weapons and armour took a major backstep rather than introducing further depth. \n\na quick touch on character progression perks is that the system feels a little more rpg-ish and encourages specialisation at the start which is nice, but i really feel like far too many perks are simple number boosts, there is not nearly enough unique abilities in the perk trees to feel gratifying enough to specialise into. number-based stat improvements are boring and don't feel rewarding. specialisation as a whole also falls of a cliff, as this game strongly urges the player to spend lots of time on one single character, which means you'll become a jack of all trades at some point anyway. it makes the upgrade system feel rather meaningless.\n\ntouching on clothes and armour, the modular multi-part armour system from previous games is gone, but i feel like it hasn't sufficiently been compensated for. the armour system in this game is so disappointingly inexpressive. you always have to be wearing a spacesuit in this game (unless you're in oxygenated settlements) which is fine, that makes sense. my problem is that the spacesuits are so incredibly samey and boring. they all take up one single equipment slot for the body, along with a helmet for the single head slot, and that's it. what's worse is that the spacesuit upgrades (using the fo4 upgrade system) don't make any visual change to your suit whatsoever, meaning that the only way to get a new look is to find a different type of spacesuit alltogether - of which there are only a limited number of types. the limited amount of equipment slots, and further limited alterations to that equipment means the total number of combinations for your look is really small, and that's just really disappointing as someone who values customising their character a lot. it's a shame when they introduced a genuinely really impressive new character creator.\n\none major gripe i have there however is the small number of hairstyles, with no long-hair options. this feels like more of a cop-out to fit in spacesuit helmets than anything actually reasonable, more hairstyles are needed not just to make your character feel unique, but for npc variation too. the character creator in every other way is a major upgrade though, and the reintroduction of traits and the background system is super cool, i only wish it affected your playthrough more strongly to encourage specialising and trying multiple different characters out. \n\nthe most important parts of these games for me are the quest design, characters, and open world though, and unfortunately, these three aspects are where the game flounders the most. i'll try keep it brief to not hit the character limit, but essentially: \n\ni found the quest design to be an improvement in some ways (the basis of most quests was really interesting), and the game makes an effort to have the player express themselves conversationally in the quests. however these points of expression feel shallow, as one recurrant theme in the quests of this game is the lack of outcome diversity. you constantly feel railroaded into one or at most two outcomes, which cheapens the effect of you expressing anything different in conversation. the most divergent outcomes come from the ending of faction questlines - however even these divergences lack npc responsiveness and integration into the world, which makes it feel like your choice didn't really matter.\n\ncharacters have improved in some ways and fallen flat in others. the follower system in starfield is fantastic, the followers each feel far more fleshed out and grounded in the world, their reactivity is really important, and i think this is one of the best thing starfield does, and needs to carry into future bethesda games. the problems here are that there are only 4 unique followers in this game which have this fantastic depth, and they're all rather samey since they're from the same main story faction. i feel no reason to use the more generic followers when they don't feel like real characters who react to what i do the same way the main four followers do. i just want more of this good system, that's all. \n\noutside of the four major followers, i did unfortunately find a vast majority of characters in this game to be bland and forgettable, even compared to other bethesda games. the innoffensiveness of the four main followers can even include them in this conversation, despite them having the most depth in the game. i unfortunately just did not find there to be any jarl balgruufs or ulfric stormcloaks or nick valentines or mr houses in this game. i wasn't particularly excited to see anyone or learn more about anyone, it's a major point of disconnect between me and this game's setting, there aren't many people in the game's world that i actually care about. \n\nfinally, the open world. or worlds. this is the worst part, unfortunately. bethesda's strengths are in their interconnected open world design. and this game just doesn't have that interconnectedness. they still kill it at the atmosphere and visual design of the environments, but the world (or galaxy in this case) struggles to find meaning when everything you do, and everywhere you go, is so separated from everything else. the world is cohesive and makes sense, i just struggle to find meaning or enjoyment when it doesn't feel like there's anywhere to call home - not even my ship. having a thousand different worlds doesn't make the game feel bigger, it just makes every world feel smaller, and that lack of the human touch in an interconnected world design squanders bethesda's biggest strength. \n\ni do think this game gets far too much undeserved hate, i think it's a good game, but not a great one. 6.9/10.",
      "voted_up": true,
      "votes_helpful": 52
    },
    {
      "review": "This game is weird until you put 20h into it.\nThe main story line is mostly crap, but you unlock an essential feature through it\nExploration is mostly useless and bad. \nBut:\nThe side quests are the best I've played in any RPG ever.\nThe NPCs are the best written that I've ever seen.\n\nYou cannot play this like Skyrim. You pick a quest and see it through. This is the way to play this game. \nAnd once I understood this I absolutely loved it.",
      "voted_up": true,
      "votes_helpful": 111
    },
    {
      "review": "This is a nice relaxing game to turn my brian off and relax with some exploration",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Only if it's on sale for a cheap price. Otherwise, not really. It's the only Bethesda game I jumped straight into modding within the first 7 hours. Even then, it doesn't really help that much.\r\n\r\nTLDR:It's a very mediocre game, I'd recommend buying literally any other game. 5/10 game\r\n\r\nExploring planets has it charm for a good while, then you start to see the exact same locations you saw an hour ago. And that's basically going to be the exploration experience for the rest of the playthrough.\r\n\r\nThe Ship and the ship builder, why being really fun at times, can be equally annoying to the point I want to rip out my hair. No horizontal 1x2,3,4 hallways. Trying to get a ladder to go in a specific spot, because for some fucking reason they don't allow you to place ladders manually (hair ripping part i mentioned earlier). Fuel is just pointless, and turns the game into a fast travel sim. And I don't really care for ship combat, but that's just personal preference.\r\n\r\nStory is well, current Bethesda levels of story telling. Multiple quests that could've just been a damn email. And are way too restricted. I genuinely don't know why they keep adding more and more essential npcs with each game. How does a game from 2002 have more freedom than a game in 2023? And combat is solid. Nothing amazing, but nothing terrible. many possibilities",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Recommended (on sale)\n\nI read the reviews, I held off buying for about a year, waited for a big sale… and honestly? Starfield is exactly what you’d expect from “Bethesda in space.”\n\nIt’s Fallout. It’s Skyrim. In space. There are differences, but nothing game-changing. The gameplay loop is very familiar: wander, loot, shoot, talk, repeat. Exploring is fun at first, hopping from planet to planet and poking into random points of interest. Outpost building becomes pretty entertaining in the late game, especially if you like tinkering and planning little resource networks.\n\nNG+ is actually one of the more interesting parts. No spoilers, but it feels less like a full reset and more like a weird, semi-continuous run that gives the game a bit of extra life if you’re already invested.\n\nOn the downside, the Shattered Space DLC was… pretty meh. The whole game feels like Bethesda *could* have gone back, cleaned things up, and really sharpened the experience based on feedback, but instead they seem to have shrugged and leaned on the modding community to fix and expand the game for them. Pretty typical at this point.\n\nIf you’re looking for a deep, memorable RPG story with rich choices and consequences, this isn’t it. If you want to build cool spaceships, shoot pirates, and play a sort of space looter-shooter sandbox, you’ll probably get your money’s worth. Especially if you grab it on sale.\n\nMan, I really hope Bethesda stops recycling the same formula and actually pulls out the stops for Elder Scrolls 6.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Despite all the negativity around what this game ended up being... It still shows a lot of promise. I came into playing it VERY late compared to its release and I'm not new to Bethesda's formula. I have enjoyed Starfield a ton... sure i've modded the hell out of it... but I've enjoyed it! Shattered Space was fun to stumble upon, it felt natural when i didnt know to even expect it. I havent finished the shattered space DLC yet but ive finished most of the main faction storyline stuff with a first playthrough... preparing to take the leap into NG+ soon. \n\nAs always, Bethesda's vision, for Starfield, ended up with a beautiful open world that can at times feel empty and quiet, repetative even. Settlement's dont really feel... done? Kind of a way to accumulate stuff with a REAL rough system to transport materials for more complex crafting at some central base if you're into the industrial game... otherwise, they dont really feel like they can become like true NPC cities. If only we could have a system that could end up feeling like a destination for the universe instead of just yourself.\n\nDESPITE this... i still enjoyed the heck of out my time in Starfield and would recommend it to anyone who enjoys a fun open world space epic. I love Starfield and will continue to wait and watch what it becomes in the future. Thank you Bethesda, for your hard work on yet another great escape into a brand new universe!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a good game, just watch gameplay first and don't go in with unrealsitic expectations.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "not sure what people are expecting but i absolutely love this game very bethesda in the very best way!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is a good game. If you like open world rpgs, sci fi and making your own fun in a vast game world, you'll love it. It has some issues, bland characters, repetitive planets and locations, etc. but it really lets you explore a galaxy to your hearts content with things to find. There are copy paste poi's but there are so many that there's always something to discover. And it's also one of, if not the most beautiful game aesthetically I have ever played.\n     Yesterday, while I was exploring random worlds to finally set up my first outpost, I got interviewed for a galaxy wide news network, helped some colonists lay scientific tech to test air quality, took back an abandoned mining operation from pirate squatters, and stumbled upon a massive drilling platform that was elevated above the surface of some random moon that was infested with parasitic alien creatures that had wiped out the entire staff. There is some merit to the complaints, but this game is a massive leap forward for all RPGs, for Bethesda, and is an absolute blast. - I really wanted to dislike this game, but I can't. Sure it's not 100% ideal, I wish you could space walk, find more things in space itself, (there's a lot, but you'll see what I mean) but the more I play it, the more I genuinely enjoy it and the more I discover there is to discover, and that's something that should be advocated for much more in this industry. there's so much game here it's well worth the money.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Been playing since launch. It's a fun game to play, even for a game that feels made by committee and plays it safe, undercooked, and generic with certain of its quests and characters. Environments while planet hopping have left me taking it slow to enjoy the sights and sounds (music at the forefront of that). The shipbuilding is easy to get lost in and the ships are fun to play with as your home out in the stars (if you like the light base building, there's some of that too). Flying them is enjoyable. I like the planetside traversal, it just needs better tuning and variety. Photo mode provides lots of fun moments. The gameplay pace generally is slower but I like it for that. For every lacking aspect of the game, another aspect is done decently or well and the experience tallies up to worthwhile.\n\nIt's a solid 7/10. Not terrible, not amazing. If the things I thought were negative got fixed up it's an easy 8/10 (and if it got some major additions there's room for a 9/10 game in here).\n\nIf it strikes a chord with you then that's all there is to it. I do hope that Bethesda gets at least one more major update out for it. I'd welcome more than that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is pretty decent. Amazing performance, decent graphics cant get all the hate on it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Imagine Fallout 4 but much less open world exploration and a LOT more dialogue. The lack of exploration is a big downside but everything else here is really good. The skill system is great, even after hitting level 100 I still have countless things I would like to put points into. Outpost building is pretty addictive it had me hooked for a while. Shattered space has everything on 1 planet and its a shame the whole game isnt that way, its even better than the main game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's what one would reasonably expect from Bethesda with their track record (e.g., lots of irrelevant but illusion-breaking bugs with a decent story line). I don't expect their games to be perfect but I do expect them to be fun and engaging while allowing for a true sandbox experience and they deliver that in spades.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Captain on deck!\n\nTop game. Lots of interesting story lines and well thought out characters. \nDon't let the unfounded hate cloud your judgement.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Yet another Bathesda game, here we go!\n\nAre you still considering this title? I'll share my point of view.\n\nI'm great TES fan, lost ton of hours in Skyrim some time ago. This is important, because I have soft spot and Starfield has many similarities - it's the same engine!\nI'm also casual gamer, 30+y/o with family. That's also important.\n\nI'm 30h in, did fights, exploration, storyline, upgrades. I think I touched most of aspects of the game. It feels fine, but not for everyone.\nGame gives me option - I can set up my own pace of action, change the diffuculty and choose more immersion / more comfort. Are you in the mood to jump straight into shooting again and again? You can do it. Fast quest progression? Sure think! Manage inventory and ships upgrades? Let's go. Slow sightseeing and photo-mode? You're welcome.\n\nIt's not only that you will choose how to deal with adventures, how to approach another \"bandit camp\", but gameplay gives you more option, like more survival if you are into this. It's not only \"difficulty level\", there are more in-depth variables.\n\nEmptiness.\nYes, that's a thing. So think about it - are you ready to deal with it? Space is empty and that's a fact. This is \"NASA Punk\", not StarWars.\n\nSlow-paced.\nMore often, than not. I'm not bothered by loading screens, but they are here. And yes, 20% of the time you will spend in some menu, doing researches, upgrades etc.\n\nEstethics.\nYou like it or not. It's a bit cluncky, not so far away into the future. You've seen the videos.\n\nFurther customisation.\nThere is a lot to do around the game. Not only gameplay option, but creations from other players as well.\n\nConclusion.\nI recommend, but not to everyone ;-)\n\nHope that helped.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Did not live up to expectations but still fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Starfield – A Massive Space Sandbox, But Not Every Toy Shines the Same\n\nI went into Starfield with a big mix of excitement and caution. After spending years in Elder Scrolls and Fallout worlds, the idea of Bethesda finally creating a brand new universe felt huge. But a part of me kept wondering if a game this enormous could really live up to its own ambition.\n\nAfter many long hours, here is the truth. Starfield is huge, packed, beautiful and sometimes genuinely magical. But it is also uneven. Some moments feel like you are exploring the endless frontier of space. Other moments feel like you are staring at menus in a sci fi simulator.\n\nThe World and Atmosphere: A NASA Punk Dream, But a Safe One\n\nThe Settled Systems look amazing. The space suits, the ships, the cities, the planets and all the handcrafted zones show just how much effort the art team put in.\n\nNew Atlantis is clean and futuristic.\nNeon is a neon soaked cyber city full of corruption.\nAkila City feels like a frontier settlement pulled straight out of a space western.\n\nEverything has personality.\n\nThe problem is that the universe is not always surprising. For a sci fi game with billions of possibilities, Starfield rarely feels truly strange or mysterious. It looks great, but it plays safe.\n\nStory and Quests: Big Ideas, Good Execution\n\nThe main story about Constellation chasing mysterious artifacts has strong themes. Multiverse concepts, cosmic mystery and philosophical questions are all here.\n\nBut the actual storytelling is solid rather than unforgettable. It works, but it does not always hit with the emotional power it could have had.\n\nThe faction quests are much better.\nThe United Colonies feel militaristic and righteous.\nFreestar Rangers give you a space western sheriff fantasy.\nCrimson Fleet lets you live a full pirate life.\nRyujin Industries is all about corporate espionage.\n\nThese questlines consistently deliver better drama and more memorable moments than the main plot.\n\nExploration: Thousands of Planets, But Same Feeling\n\nThis is where Starfield stumbles.\n\nOn paper you can land anywhere. In practice most planets feel similar. The same structures, the same enemies, the same loop of scanning and looting. It starts exciting but settles into routine quicker than expected.\n\nThe handcrafted locations are the real stars. Whenever the game takes you somewhere designed with intention, everything improves instantly.\n\nSpace Travel: More Menu Than Adventure\n\nFlying your ship sounds amazing in theory, but most of the time you are jumping through menus and fast travel screens. The game looks like a space exploration RPG, but the spaceship gameplay rarely reaches its full potential.\n\nWalking inside your ship is great. Building it is even better. Actually traveling in it is limited.\n\nCombat, Weapons and Skills: Solid but Not Revolutionary\n\nCombat in Starfield feels good. Weapons have impact, zero gravity firefights are fun and enemy reactions are decent.\n\nThe skill system is fine but not extremely deep. Some skills feel essential, some feel pointless, and build diversity is limited compared to other RPGs.\n\nIt gets the job done but does not redefine anything.\n\nShip Building and Systems: The Brightest Part of the Game\n\nThis is where Starfield shines brightest.\n\nBuilding ships is addictive.\nAdding new modules.\nTweaking engines.\nRearranging the interior.\nCreating something ridiculous but beautiful.\n\nIt is easily one of the best ship creation systems in any game.\n\nOutposts are more divisive. If you enjoyed base building in Fallout, you will find something fun here. If not, you can ignore them completely and miss nothing important.\n\nTechnical Presentation: Beautiful but Interrupted\n\nStarfield is visually impressive. Lighting, interiors, cities and planetary landscapes all look fantastic. Character models are much better than previous Bethesda games.\n\nBut the loading screens break immersion. There are many. Enter a ship, enter a room, land on a planet, leave a planet. These small interruptions add up over time.\n\nVerdict: A Huge Universe, But Still a Foundation for Something Greater\n\nStarfield feels like the first chapter of a much bigger vision. The framework is huge, detailed and full of potential, but not all systems shine equally.\n\nIt is a game you can lose yourself in.\nIt is a universe worth exploring.\nBut it is not the perfect space RPG people dreamed of.\n\nEven with all its flaws, Starfield delivers a memorable journey. It is good, sometimes great, but not legendary. At least not yet.\n\n8.5 out of 10 – A vast and impressive space adventure with massive potential for the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A wonderful game that, after several years of completely losing interest in gaming, brought that spark back to me — along with the amazing feeling I had missed.\nA beautiful journey: from small stories to a grand homage to Mission: Impossible, with adorable companions and countless details you just want to dive into.\n\nYes, the game has its issues — but it absolutely does not deserve the hate or the ratings it gets. Not even close!\n\nThank you to the developers. I wholeheartedly recommend Starfield",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I've played this game on both Xbox and Steam and I enjoy it. I believe the hate for this game comes from a misunderstanding of what it is. If you're buying this game expecting amazing storytelling and deep and compelling characters, you're not going to get that. The stories here are fine, but none of them compare to something like Witcher 3, KOTOR or Baldur's Gate. If you're coming to this game looking for a systems-based sandbox that allows you to fly around in space, fight pirates and explore some relatively interesting areas, then this is a decent version of that. \r\n\r\nAs a fan of No Man's Sky, the emptiness of the planets doesn't bother me. I haven't explored setting up mineral extraction or space bases, but the world feel similar to NMS. I haven't checked to see if there are different regions on the habitable planets. \r\n\r\nThat said, the game goes on sale relatively frequently. It's likely to keep doing that. I recommend buying it that way.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I am and have always been a sucker for Bethesda open world games. I know this game got slammed on release. Just like Cyberpunk 2077. I waited a good long while to play either. Both have been fixed by the devs and run great on my PC. I love the Starfield has no level cap. I love exploration and having plenty of skills to try to master, this game has and will continue to provide loads of hours of fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "downloaded the modpack Genesis Star wars, its making it very palatable :P idk for the og game, not so sure, but the star wars rp has been real awesome",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Starfield is the Worst of Bethesda.\n\n- The \"nothing but the main quest is any fun at all, and even that is garbage\" feeling of Arena.\n- The randomly generated empty world of Daggerfall.\n- The terrible fetch-side-quests of Morrowind.\n- The horrible XP system with unrewarding XP values from Fallout 3.\n- The faces and overlapping voicelines (for city NPCs) of Oblivion.\n- The terrible Creation Club system from Skyrim: Special Edition.\n- The crafting /building outposts (settlements) garbage from Fallout 4.\n-  The dreadful performance of Oblivion Remastered.\n\nPlus (new additions)\n- A terribly boring soundtrack.\n- Classes are back but there are no custom classes.\n- The dungeons felt copy-pasted in Oblivion, now they literally are.\n\nAnd I still am having fun playing it.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Overall, the game was fun. Of course it was not the best game I played, but it was not as bad as others have said. Especially since there are other game that is worse than this one (both in performance and/or story).",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Positive review due to the excellent modding community.\n\nI've played through Starfield when it first came out and got through the main story. At the end, I had felt nothing but regret and disappointment. Yet, I finally  found a mod collection that rectifies this.\n\n\"Odyssey - A True RPG\" -- A Nexus mod collection of 230+ mods.\nI'm 30 hours in and this collection sets itself apart, with it being meticulously balanced for extended gameplay, and enjoyment.\n\nGet yourself a Nexus account, download Vortex, find \"Odyssey - A True RPG\", and follow instructions (MUST DO) on the page for installation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The main quest and many side quests are okay. They have that classic Bethesda feel, reminding me a lot of the vibe from Fallout 3. You'll find some really memorable stories and characters in the settled systems.\r\n\r\n    Companions are a step up. They're well-voiced, have their own personal quests, and actually feel like part of your crew.\r\n\r\n    The core gunplay is solid, and the ship-building is a fantastic, deep system.\r\n\r\n    When the game focuses on its hand-crafted content, it's fantastic.\r\n\r\nThe Bad (Where It Falls Short):\r\n\r\n    The Procedural Generation: It's empty and repetitive. You'll see the same abandoned research lab, with the same enemy placement, and the same loot crates on a dozen different \"unique\" planets. It desperately needs more variation.\r\n\r\n    Shallow RPG Systems: Character building is very basic. \"What ever happened to skill points?\" is a question I kept asking. The perk system feels limiting. And why does every Bethesda game now have to be a crafting sim? It's a checklist, not a compelling mechanic.\r\n\r\n    No Consequences: Your choices barely matter in the grand scheme. The biggest offender is being able to become the leader of every single faction with zero repercussions. I'm the head of the pirate fleet, a decorated UC citizen, a Freestar Ranger, and a member of House Va'Ruun? It completely shatters any sense of role-playing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I thoroughly enjoy the exploration part of this game. I makes me feel like a true space adventurer for a moment.\r\nMy only problem is some rather long loading time whenever I go from one area to another. And that is despite a pretty optimized gaming rigs, so either the game is not optimized, or I am missing something",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "野心很大，至少做出来了。 但是目前制造和各种操作非常的烦琐。\n\n-----\n\n做了一大堆，广而不精，导致乐趣少而烦琐多。\n是不是应该逐步加玩法，保证每个玩法都好玩，慢慢的才能达到1+1>2的境界。\n反之如今一个大框架，里面各个部分达到30%-50%,那么感觉相乘结果会很小。\n-----\n100个小时基本套路都玩明白了，差不多腻了吧.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "70hours in and I am still enjoying the game, Story is good, gun play is good and the ship battles are good. Would of liked a few more options on some of the quests but that is just nit picking. Really don't understand all the hate this has got when in reality its Fallout in space! Only complaint is no ending slides you just get a crappy diorama which makes all those sidequests feel worthless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i wont pretend this game isn't deeply flawed, but its also deeply fun. ive spent 600+ hours hopping around pretty planets and scanning cool aliens and customizing ships and building resource networks and collecting cool decorations and building giant outposts and i look forward to doing another 600 hours of that\n\nplay this if youre looking for a pretty decent story with great sandbox elements, dont play if youre looking for phenomenal story. inevitably anything todd howard touches will be imperfect but this is still a very enjoyable game despite him",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was the death knell for any hype I would carry into a game that had yet to be released.\r\n\r\nThis game fell into the same pit that doomed Cyberpunk 2077 in that the developer promised a genre-defying look on RPGs. An open-world game located in space with a ship-building system, base building, procedurally-generated worlds offering endless exploration, and a newly created universe for you to explore.\r\n\r\nOverall, it didn't land most of what it was promised but I did enjoy the ship building system even though it was limited (and still is) in what it can do. The overall story is rather unremarkable and the best compliment I can give is to call this game Skyrim in space. There are a handful of major cities but not much to do within them and a lot of quests take you on a tour of the universe that offer a one-stop-shop of what the game has to offer. Never did I once feel as if I was in a lived-in world comparable to what Skyrim made me feel, but it is still go in its own merit.\r\n\r\nI still recommend it, at least for the modding scene since you can create whatever your heart desires.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the ship builder and there was a cool space mission where i killed the good guys. but this was not really enough to save this game as a hole\n\ni think 80% of this game was spent in the ship builder.\n\ni think what is was is for me is it does not feel like a Bethesda game.\n\nleaving a later review because - i wanted to download and see if that DLC was any good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing rpg in an open world. Great storys and good combat. Recommend strongly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game once you have tweaked your rig to suit\r\nhas a massive amount of content\r\ntake your time and enjoy the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game, its not what it could've been but its still great nonetheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a bit raw and was obviously rushed to release about a year early. Apparently, they lost their documentation and writing team early on. That said, this is an engaging game with fantastic graphics and so many fun things to do! Spaceship building is such a rush.\r\n\r\nI've played for 2,326 hours, they tell me, so I believe I might like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its slow... but once you get in the rythm of quests, base, sell things, its rich. yeah, the autogenerated maps are meh, but driving around them collecting scans gets easier and there is some strategy to learn about it. Base setup is balky, but again, once you get the learning curve and the right skill loadout, its pretty good. And, of course, you really don't need to pick everything up, but it takes a bit to learn what to grab. Its space. The big, cold, equalizer, and every time you forget to put on your suit to go outside, you remember. Its definitely its own vibe. If you just go after the main quests, its not as boring... but hoping into a hole to an abandoned collapsed mine and just for a bit wondering if you can ever get out is part of the experience...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game i think will always scratch an itch I'm looking for that no other game quite can. I understood on launch why people had issues with this game and all the load screens and such but to me at this point its really not that bad, especially if your someone looking to just put on some chill music or a show in the background and just chill out playing space skyrim without so much npc interactivity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly I love this game I have it on Xbox and PC both I know there is a lot of people that do not care for it. but I think its great a good mix of what I love about the elder scrolls and fallout universes along with many new aspects.\n\nCan't wait to see where they final go with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game overall, but with limited variety. Must admit with over 2000 hours I had become obsessed with trying to reliably get the interplanetary crafting and supply chain working but I don't think you can get round the helium clogging up the system issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starfield Feedback: A Promising Game That Needs Steady Ongoing Development\n\nAfter spending more time in Starfield, I’ve seen both its strengths and areas that need refinement. The foundation is solid, the scope is impressive, and the game has plenty of potential — but like many large RPGs, it continues to evolve.\n\nCompanions & Exploration\n\nCompanions add personality, though AI can be clunky at times. Exploration is exciting, but some planets feel sparse. The concept is strong, and future updates could expand environmental storytelling.\n\nModding & DLC\n\nModding is active even without full plugin support, and the community is eager for deeper tools. I added Shattered Space later on, and while it integrates well, I think the game would benefit from more frequent updates and clearer communication.\n\nStability\n\nI initially thought CTDs in the UC Education Center were part of the base game, but the real cause was a corrupted texture mod (The Eyes of Beauty). Once removed, the game ran smoothly. To be clear: the vanilla game is stable, and Bethesda wasn’t at fault.\n\nFinal Thoughts\n\nStarfield is already enjoyable and continues to grow. With steady updates, community involvement, and expanded modding support, it can become the game many of us imagined. In its vanilla state, it works well, and Bethesda deserves credit for that. I’ll gladly update this review again with more praise if development keeps moving forward.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fundamentally a great game to experience. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely loved the game. Very fun to play, the ship builder is cool to use and the base builder is also fun. The only thing that could make the game better is adding online multiplayer to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well. It's not bad. It's just not what we all expected from a developer this big. A lot of bs talking from Todd and other devs on top sealed it for many people.\n\nBut I came for a space game. And for that it's nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are parts to like and parts to dislike - I absolutely love Bethesda typically, the games they make are par none in my option. Most of this game is enjoyable and not shallow in detail - in so many ways it's fulfilling and immersive - but, having that said, much of the writing and more basic mechanical elements could've been done better. Sometimes, a lot better. Tough field with space, there's so much potential with it and easy to lose focus I imagine. Won't stop me from playing it more and loving it though, just my two cents.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First ever review and i wanted it to be on starfield since i love the game \n\nNow don't get me wrong the game isn't perfect but what i love about it is the lore and world of starfield i love everything about it tbh however the game does fall flat in some things like some quests and exploration but that doesn't mean its the worst game in the world like what some people are making it out to be, the biggest criticism i've been seeing is the fact that traveling in space is just a loading screen and i think people who complain about this are comparing starfield to something like No mans sky or star citizen which starfield isn't trying to be, a space game doesn't need seamless transition from space to planet to be a space game and i think that's what people aren't getting so bottom line is starfield is a good space game story/lorewise but if you're going into it expecting open world space game like star citizen then its the wrong game for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I enjoy this game, it's my kinda of game. Exploring and storey rich. Like a space version of Fallout.  I'm sure it's not for people who don't have patience though.  I can see why there are some bad reviews.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great fun but definitely feels a bit unfinished. boring dead worlds with little to do. campaign is solid as is the lore and story. gun play is solid too as for its customization. the game is probably a 6/10 for me. i think once this game cooks a bit more and they release more expansions to flesh out the galaxy they've created it could be just like how cyberpunk or no mans sky turned themselves around. my advice go into it with an open mind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jogo excelente! Possui uma gameplay variada, ao mesmo tempo que é um jogo para relaxar, jogar sem pressa e apreciar as paisagens.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A crazy amount of effort has gone in to the world building of this game. Yes, some of it is a bit clunky but still overall great fun!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's Definitely not the best or the worst game ever. Given some time I hope they fix and add to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From what I have played, Starfield is not particularly good OR bad, just very mediocre; does pretty much nothing new or innovative and many aspects of it are done better by other games (i.e. flying your ship feels WAY better in something like No Man's Sky), but its aesthetic is pretty cool and so are some of its characters and locations. \r\n\r\nUndoubtedly one of the games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite being a Bethesda fan, I was hesitant for the first couple of years. I finally took the plunge and was immediately and completely hooked. The criticism is mostly valid. This game is compared unfavorably to many other, more focused games that do the same things but better. But by bringing together so many different things, Starfield creates a bigger, more immersive world. So many people say they played like 200 hours and \"beat the game.\" BS. They barely started the game. There is so much to do and see, and so many different ways to go about it. I've played over 1500 hours and there are still many missions I have not done and many game mechanics I have not explored.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "After playing FO4 for a while and other games, I was amazed at how well this game is actually running. No framedrops, smooth motion, it felt so good. I also found no gamebreaking bugs. Technically they have come a long way since FO4. \r\n\r\nUnfortunately, I couldn't get into the story. Also the NPC's made the game feel like I was exploring the universe with my highschool english teacher or a weird uncle (stranger danger...), so I stopped playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I actually quite enjoyed the game, would recommend exploring all side quests and other factions and forget a bit about the main story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game, and while i understand some criticism from concerned fans of bethesda games (myself included), the game, at its core, is a good ol’ classic bethesda game. it’s the same formula from skyrim and fallout, but it’s just in space.\ni understand that the procedural generation, having multiple planets to go to, plus the loading screens for every landing and travel, has its flaws — especially when you mix it with bethesda games — and in my opinion, compared to the single-focused worlds from previous entries like skyrim and fallout, it might have a tiny negative impact on your gameplay pace.\n\nbut still, i can imagine myself getting past that and pouring the same amount of hours into this game as i did into fallout and skyrim, if time permits. the writing style is the same as the other games in the franchise. bethesda’s focus point has never been great writing for their stories, but rather a beautiful open world, role-playing, and astonishing world-building — which they did one hell of a job at again.\n\nthe skill-check dialogue is a bit weird, because the dialogue options it presents for persuading a character are so goofy that most of the time they don’t make sense or feel realistic XD. even more so than fallout 4.\n\nnow to the good things:\none thing i appreciate the most is the new tab for items you recently picked up. because oh boy, how many times have you picked up an item and had no idea what it was? now this new tab has you covered.\n\nanother thing that i should have mentioned at first is that you can fast-travel around locations within the city through your scanner by simply pressing “e” on that specific location’s icon. you can’t imagine how much this improved the pacing of the game for me.\n\nthe inventory management is a hell of a lot better than in previous games. i did criticize the questionable UI design, but the inventory, on the other hand, takes the cake for me. you can actually sort your items by their names and weights, which you couldn’t do in other bethesda games without using a mod.\n\nthe story so far is perfect. i like the different factions in the game. i’m 120 hours in and i still haven’t touched the main quest (classic bethesda game way of playing XD).\n\nTL;DR:\nstarfield is a good game — just what you’d expect from any bethesda game you’ve played. there are some questionable design choices, but they don’t hurt your experience at all. just try the game yourself and don’t bother with the negative reviews.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Amazing game from what it use to be at launch. Highly recommend revisiting this game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "good game reminds me of fallout & skyrim . lots of narrative but needs a little more combat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall I like this game, I feel like it could use a little more fleshing out when compared to the Elder Scrolls &  Fallout, but the basic premise is fine, there are fun characters.\r\nThe ground transport could really be improved upon, likewise the ship building could be improved (i.e. the ability to determine where the connections between hab modules are).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is Starfield Perfect? No. Is Starfield still a great game that can give you hundreds of hours of enjoyment? Yes.\n\nI mostly liked the main plot, but it lacked that feeling of urgency that previous Bethesda games had. I felt no real need to finish the main quest line, and instead felt more engrossed in other quest lines, some of which felt more urgent.\n\nThe weapons are also a big issue in this game. Some of the weapons look good or okay for the most part. Others... no. Just no. The Freestar Collective weapons look like steampunk and sci-fi had a horribly disfigured baby. What I'm saying is, their design doesn't look practical enough to actually be semi-believable.\n\nThe combat gameplay is fun, though I did find it necessary to tweak it with mods. I didn't like that one part of the galaxy was full of high level enemies, while another would have low level enemies. Space combat is amazing. I love the different ship weapons available, and I love customizing my ships.\n\nI don't care for the crafting, so I've downloaded a mod that makes modifying weapons no longer require crafting components. Gathering resources and putting points into perks I really didn't care about was a bit of a buzzkill. Busywork, I guess you could say.\n\nI found some of the characters likable and interesting, others not so much. I really don't have any glaring complaints in this regard.\n\nAs far as DLC is concerned, I haven't really played it.\n\nI love the idea that the space suits are your primary source of armor, but I also hate it too. This makes regular outfits an afterthought, which kind of annoys me.\n\nOverall, I'd give Starfield an 8/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Make certain that your graphic card can handle it., cause if its borderline you  may fell differently.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It really needs mods to fix the UI, performance, and graphics.\r\nI’ve been downloading 4K texture packs, UI overhauls, and a bunch of other mods to make it look cleaner — especially getting rid of those awful vanilla LUT filters.\r\n\r\nBut once you fix all that, it becomes an amazing space game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "with mods available now especially using vortex has become one of if not the best pen world star wars games ever made. The base game can be fun as well tho.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really love the concept of this game.  Is it perfect?  No ,  no game is.  Its been my go to game since December 2024 so I did not play from launch.  Really love exploring planets,  ship building and getting frustrated at outpost building but still do it anyway.  Creations are cool lot of really cool content there to add flavor from indy folks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD? yes! BAD?... yes. the game is a mess, but we can bless ourselfs lucky for the modding comm. they bring out the best of this game. i already knew what i was getting into... a total mess of a game, i directly installed 100+mods and i  have never played such a amazing ''game''(MOD). i  got a  starwars themed ship  with over 10+ hero's /companions /followers who actualy fight and explore next to me when i go into the world of starfield.  I got over 10+ new factions of enemys to play and fight against compared to the vanilla game. i also have 100+new locations to explore and quests equal to 50 mabey 100 hours of new potential gaming time added to the game and ships and houses to make and build, its a game in heaven for modders. just know that before you begin with this and you will actualy have a great time playing.  but i dont know if you realy gonna like the ''vanilla game\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy the open universe and the jumping around the space battles and missions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Fallout, but in space, and less apocalyptic. If you love the Fallout games, and you like space, you'll probably enjoy this game. It has most of the usual Bethesda game mechanics, but everything is a bit more complex. Spaceship combat is a challenging addition. Like Fallout, it's very easy to sucked into resource gathering for hours. My only gripe is that many outposts and buildings are repetitive on different worlds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Space exploration RPG, at first it may seem kind of boring or lacking of personality, but after a while into the main story, it really picks up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game does not deserve all the hate it gets. If you're basing it off of games like fallout or skyrim of course you'll be disapointed. But if you're instead basing it off something more like Andromeda or No Man's Sky then this game is for you. The pace is as fast or slow as you make it, and your choices actually have consequences in the verse. Ignore the hate and give it a try if you have a few extra bucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "don't let the negative reviews deter you it's a good game and bethesda gave you the player the same tool/program they made this game with for FREE so you can make your own adventures people boohooing about paid content or not enough content well whoop dee doo nothing is free and like i said the developers gave the their tool/program out for free and to be honest this game is more developed then the elder scrolls online or fallout 76 no bugs or glitches except maybe if you played the game too long but still...great game and i'm glad i bought this",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a great game, very lengthy so be prepared to spend time with it but it is EXTREMELY fun and has a great story line.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It’s just like New Vegas, where 70% of the map is empty space with nothing to do.\r\n\r\nThat said, there are lots of solid criticisms of it. Lots. So, it’s not for everyone but it was for me. You’ll know after a dozen hours whether you like it or not; I found it gets better the more you play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good story, large open world play, good crafting, fun for hand to hand or sniper.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ignore the naysayers, Starfield is great and gets better with every playthrough.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Starfield is a game that had all the right pieces but wasn't put together right. The main story is sterile for the most part, but has some strikingly interesting sequences distributed seemingly randomly. Starfield is worth a playthrough or two. \r\n\r\nBethesda's main failure with this game was how puny the actual gameplay was. You're telling me there was a galactic war with xenomorphs and gigantic mech titans... and we missed it? The terrormorphs drastically underwhelm me (except that one boss fight), and the mechs never make an appearance other than the burnt out husks on the war-world Niira (or whatever it was). \r\n\r\nThe scene where you track down The First, a group of disgruntled mercenaries and former soldiers, whose military's primary weapon was massive mech suites powered by AI, and you find them INSIDE a mech factory... and there's no mech boss? No secret AI from the war who was working in the shadows??\r\n\r\nThe best story line by far was the undercover mission against the Crimson fleet, and I love the concept of collecting evidence and betraying them in the end. I also respect that Bethesda gave us the option to side  with the Crimson Fleet as well!\r\n\r\nDLC was pretty cool too, although it felt like a Destiny rip-off. Worth the money and time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "World-building shines in the lore-rich Settled Systems—New Atlantis buzzes with intrigue, while Akila City's saloons echo Skyrim's taverns. Ship-building? It's Fallout Settlement mode on steroids: Design your fleet from modular parts, then dogfight in real-time or board like a space Viking. Combat evolves from pew-pew basics to modded mayhem with gravity grenades and companion AI that actually covers your flank.\nSure, the galaxy's vastness can feel isolating at first (hello, loading screens), but patches and the Shattered Space DLC have tightened pacing without losing soul. Mods? Already transforming it into the ultimate RPG playground. Starfield isn't just a game—it's a universe begging for your legend. To all fellow RPG wanderers: Strap in, Constellation awaits",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply put, this is a great game. Many people complain about the main story but I don't think those people are thinking of this game properly. Bethesda games in general kind of force you to create your own motivations. Without them the story of all Bethesda games are lack luster. It's only when you apply your own reasons of why your character acts the way he does or makes certain choices does the game come to life and the story actually impact you. So if you're thinking of giving this game a try or wanting to give it a second chance, you definitely should. Just this time, give yourself a narrative reason to stay and play. You might be surprised at how much fun you'll have.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So for anyone who left a negative review because \"everything is so empty\" I have something to say! It's f'ing space! Space is empty, not every planet is going to be a booming metropolis! Some barren or hostile to life. But as a whole in a Bethesda game, starfield has more locations and more quests than any other previous title. The sheer freedom in this game is awesome. Ships are each unique inside and out. Heck you can disable engines and pirate ships. There are thousands of space stations, planets, civilizations, etc to explore. The world feels alive. I truly can't understand what the complaints are about. This game is the biggest world with ultimate freedom. Plus there are tons of mods and add ons including a Star Wars themed game. I just finished a doom inspired mission which was short but cool trip to hell with a reward being the doom armor and weapon. I think this game is amazing. The graphics the freedom, the gameplay, the infinite variety of weapons, suits, ships and mods. I highly reccomend if you like fallout or elder scrolls games. You can even build bases on planets, not my thing but you can.\n\nMany compare this to No man's sky, while no man's sky is more about exploration and building, starfield actually has a story, factions, and 1000's of quests. NMS got old quick, way too much of the same and those infinitely spawning sentenels being the only real threat gets old quick. It's aggravating dealing with the same enemy. Anyway I liked this way better than NMS, but that's me, games that focus on crafting lose their luster real quick and require too much time investment.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Bethesda makes another legendary game, what more needs to be said. Thanks Bethesda!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent new universe to the Bethesda Roster. Looking forward to how they develop this IP going forward.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Now I am a Legandary Space Explorer as I, finally, surveyed all 1695 planets!!! Damn, I took me 2 weeks to do it, oh God!!! Now I gonna play quests including Shattered Space one, thank you Bethesda and Todd Howard for such a great game Starfield!!!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Game is very enjoyable, you can live everything about starwars and more. I like it so much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're one of the few people who are still on the fence, and the game is on sale, give it a go. It's actually pretty... whatever the videogame equivalent of kino is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far, so Bethesda. Massive and most of the time deeply immersive. See you all in the 'verse.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game so much way better than no mans sky and star citizen!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game is actually fun to play with pretty hefty amount of mods ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall ok, BUT : \n\n- character bland looking ; npc bland looking ; nobody is short or tall or voluptuous or sexy really ; all terribly bland, bodies and clothes ; very boring after a while.... \n- Neon city, the suppose \"hot spot\" of the Known Universe, is ... bland ; take exemple on NightCity to do much better guys ^^... it is rated 18 anyway so get things a bit more adult FFS ^^... \n- the love interest interaction are laughable and ridiculous in every thing (dialogue and terribly BLAND) ; again take exemple on CyberPunk to get that to at least a normal level of love interaction and speeches\n- a good space ship crafting BUT you loose all of it when you go NG+ ^^... your character REALLY should be able to remember enough of how he has done it to just have it done on demand at the ship yard (kind of having the \"blue print\" in his memory and just being able to have it built exactly the same ; for the same price of course ; minus the top weapons and gears you haven't access yet in your current NG+ if necessary yep)\n- need many more long quest lines / stories ; Crimson Fleet or Terror monster like long quests yep. Akila's ranger quest and Tracker's quest too short really . There is some small quests here and there, but nothing special.\n\nI've got 500 hours in CyberPunk and still enjoy it some time to time ; here after 250 hours I got bored very much after one NG+ . So oky but not great ; needs lots of patchs/work to up that game to good",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Just Skyrim in space.\nIt's masterpiece with mods. Without mods it's like 5-6/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a fun game. its no skyrim or Fallout 4, but it can be fun.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Todd please stop, you no good Todd, it boots 1/67 times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game Outer Worlds 2 wishes it was - LOL - I played 80 hours and enjoyed my time",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is amazing!!!!!!!!!!!!!! (if you add star wars mods)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "At current time of writing I am 91 hours through my first playthrough. I will update as I complete the game cycle over time.\r\n\r\nSo, do I recommend this game? Absolutely. Why, when it has received so much negative feedback? Simple. The negative feedback has some merit - but conditionally. There ARE lots of loading screens, yes, but they didn't bother me AND I didn't go into the game expecting No Man's Sky or Elite: Dangerous. There IS a lot of procedurally generated content and radiant quests, yes, but (a) this adds to the wonder of the game, as Gopher notes, and (b) you don't have to engage with it all (and likely can't)! This stuff didn't bother me either. I just focused on the quests, engaged with this stuff some times, and went on having fun.\r\n\r\nSome of the negative feedback Bethesda has already addressed - like the map and some of the loading screens being made into believable content, like the Grav Jump wormhole. But SOME still remains. For instance, without spoilers, it is hard, nigh-on impossible, to be an evil character with your companions. Also, the world IS very sterile, in that it isn't too daring, dark/gritty, or able to really flesh out a 'bad' character. This is somewhat a drag, but did it reduce the fun? Not at all. Will it stop me playing lots of characters again? Not at all.\r\n\r\nAgain, yes there is a lot of nothing out there. But I never expected there to be lots - it is space. And this doesn't detract from my sense of wonder I feel. Is that for everyone? No, not at all. But for me it is still fun to explore. Could it be better to have more content? Yes. But that's what mods and Creations are for. Ok, so the vehicles could do with better handling and the space combat is janky, but I still enjoy both and mods help them be more fun.\r\n\r\nDoes that mean this game is only fun with mods? No. It just means that mods/Creations can extend its life, just like with other BGS games. I have played for 91 hours and I haven't touched the main story much yet. That's what I want from a BGS game, and I DO love Starfield.\r\n\r\nSo, is the game bad? No, not by any means. Is it perfect? Also no. Is it for everyone? Not at all. But if you enjoy BGS games and want to experience them in space, I think this game is fun and delivers a lot of fun for the price. I certainly will play this game over and over. I can see I will play this playthrough for way more than 100 hours, maybe 500+ (again, no spoilers). And I already have other characters to play and have seen others have events - in their first playthrough - that I haven't had yet. So I WANT to explore and play more.\r\n\r\nShould you get it? That is a personal decision. Some have liked it, some haven't. But for me, I recommend this game and have already gotten my money out of it without completing this playthrough. Don't go in expecting perfection or No Man's Sky but Bethesda, just take it for what it is and if you like BGS games you may well enjoy this. The quests are great and the modding scene awesome.\r\n\r\nDefinitely a jewel in the rough for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Although this game seems to have a negative review; I personally think otherwise. It IS a vast game world where you can get into all kinds of things. Its been on my top 5 games of all time since it dropped. I had over 700+ hours in on another streaming service account, so I finally caught a good sale on Steam Store, and I bought my own copy. I HIGHLY RECCOMEND IT!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is really fun and addictive. If you love Skyrim and space sci-fi games I think you will really like this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The world is massive, the atmosphere is great, and exploring new places is genuinely fun.I do admint that some parts of the game can be feel a bit repetitive at times, but you get used to it, and it dooesn't take away from the overall experience. \nOnce you settle into its rhythm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My expectations were low, but I must admit I'm really enjoying it. Glad I gave it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dislikes: A few glitches with some of the quests getting stuck or unable to progress, ship UI sometimes getting stuck and a few others not worth mentioning but nothing game breaking so I'd say that is not too out of the norm these days and luckily they can usually be fixed with a later patch release so it hasn't ruined my game play experience.\r\n\r\nLikes: There are a lot of ways to play the game. You can focus on outposts for a little while and build some fun things, get into space battles with a ship you can customize with a lot of unique styles, focus on the quests or just explore different planets for a while. Granted, too much of any can burn me out but that's why it's great to have options to switch between when ever you feel like it. Also, IT'S SPACE! I like the experience over all. Keep making it better Bathesda!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a Great game people hate on the load screens but its not that bad at all I have lots of fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the game is amazing if you like a casual experience rpg style game",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "i'm just before the end, but now it is full of bugs , i'm stuck and fed up .. probably the first game i bought that i won't finishi  and so disgusted i don't even want to see the end .. i'm uninstalling it .. those days we shouldn't give money for this type of unfinished games , or they will continue to disrespect their customers",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "I wanted to love this game as much as Fallout and the ES series, but the old engine needs to be put to rest. \nThe gameplay loop for me not intermixing bugs was pretty much - obtain quest, load screen to main town or city, load screen to ship, load screen to fly to atmosphere, load screen to warp to new planet, load screen to step off ship, load screen to enter any building in new town/ city. It felt like I was playing Fallout 3 from 2008. Same dialogue wheel and clunky combat. While some of the skyboxes were very nice the rest of the game felt very dated for a 2023 release. The ship building was my favorite part by far. I didnt care for any of the companions except the robot that could follow you around to support. Again I wanted to love this game and had every intention to enjoy it but it just did not capture the same magic as ES or Fallout. With a newly updated engine the setting could work for a new franchise.",
      "voted_up": false,
      "votes_helpful": 72
    },
    {
      "review": "Where to start...my biggest single complaint is there's no space exploration or planetary travel, its all lazy un-immersive loading screen fast travel bs. Go watch any YT essay on why this game missed the mark, it'll be more entertaining. Tragic because I really do love the aesthetic/environments and lighting. RIP bethesda",
      "voted_up": false,
      "votes_helpful": 94
    },
    {
      "review": "In many ways it's like No Man's Sky, but with loading screens. So many loading screens.\n\nIt's just full of disappointments:\n[list]\n[*] The story is meh, and with not much choice, it's closer to a visual novel than an RPG game.\n[*] You can't fly the ship on a planet. It's just decoration there, and there's unskippable cutscene/loading screen every takeoff and landing\n[*] Everything you find on a planet is exactly the same as you find on every other planet. Every mining outpost, every laboratory, every settlement looks the same, and often has exactly the same loot and enemies.\n[*] Bases are such a grind to build for so little gain.\n[*] Leveling is a grind with no clear XP bar\n[*] Some skills are just a massive grind for no gain\n[*] The \"research\" mechanic so shallow it feels like just extra grind to gate stuff even more\n[*] You're guranteed to get stuck in weird places with no way out but to load a previous save\n[/list]\n\nBasically becomes more frustrating than fun too fast.\nHold \"E\" (or TAB or any other button) to do stuff is probably the most frustrating and stupid mechanic:\n[list]\n[*] While flying the ship and fighting other ships, and trying to scavenge parts for \"healing\" your ship? Press E. Hold for too long and you get to watch a an unskippable cutscene of you getting up from your seat, followed by another cutscene of your ship getting destroyed.\n[*] Want to quickly exit the only vehicle the game offers so you can heal yourself? No, you have to hold E for just long enough to die before you can exit.\n[*] Want to quickly exit a menu? No, patiently hold tab and wait to exit the menu.\n[/list]\n\nIn short, I regret buying it.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Bethesda, just like on fallout and skyrim. Dont care about the game once they put it out there. There are horrible bugs in all their games, including starfield. Yes. I play it a lot...just hoping they pull their head out of their back side and fix shit so THEIR PAYING CUSTOMERS can enjoy the game. WE PAY YALLS CHECK, DEVELOPERS!!!",
      "voted_up": false,
      "votes_helpful": 61
    },
    {
      "review": "This game was hugely disappointing. Maybe I am just spoiled and nostalgic for Skyrim, and I just wanted Skyrim - in space.\n\nInstead I just fast travel around doing chores and errands for boring npcs, with seemingly little consequence or effect on the universe at large. Though I guess my choices led me to romance that annoying blond hair NPC kinda by accident, and now she loves me? I left her on a planet somewhere. And skill points feel meaningless, character progression and gear is meh at best - inventory management is annoying. I mean, even the menu is so designed for a controller that trying to 'click' on stuff is so frustrating, why is that?? This game was a miss, very sad.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "In a word: artless. Starfield feels like the natural endpoint of a studio that has been recycling the same approach for twenty years. Everything about it looks ambitious on paper, but the game itself feels like the result of blending scale, procedural generation, and AAA risk-aversion into something strangely empty.\n\nI’ve wanted a proper space game for as long as I’ve been playing games. I love science fiction. I love the fantasy of exploring strange worlds, finding weird little corners of the galaxy, and getting lost in something that feels genuinely unknown. But I think I finally have to accept that this kind of game might never happen at the AAA level. Starfield made that clear.\n\nBecause the moment you load into your first planet, you feel the same problem that No Man’s Sky had at launch. When you rely on procedural generation to fill the gaps between handcrafted content, you end up with a lot of space and not a lot of meaning. A hundred empty planets don’t equal one memorable one. And when you try to balance both breadth and bespoke design, the seams show everywhere.\n\nThe sad part is that none of this is surprising. Not for Bethesda. Not for AAA.\n\nBethesda jank used to be charming because the games had personality. The bugs stood on top of something that felt alive. Starfield has the bugs, but the personality is gone. The worlds feel assembled rather than created. The systems feel like they exist because they were on a production roadmap. Ship building. Outposts. Crafting. Factions. A thousand tasks that all blend together into the same gray paste.\n\nThis is what happens when a massive team tries to satisfy every possible audience. Too many cooks. Too much money at stake. Too many shareholders who want a game that looks ambitious without taking any actual creative risks. \n\nThe only perplexing thing about Starfield is why they made it at all. Maybe it was the classic trap. The scope was too big. The tech wasn’t ready. The premise demanded bespoke content on a cosmic scale, which is nearly impossible to execute in a way that feels meaningful. When you try to simulate an entire galaxy, you end up with something that feels like a diorama of one.\n\nI wanted to like Starfield. I waited years. The problem isn't unique to Starfield, it's AAA in general. You either get a giant open world packed with shallow systems, or you get a highly scripted roller coaster that barely feels like a game. There’s very little in between.\n\nThe silver lining is that indie games are better than ever. Maybe that’s where the real experiments will keep happening. Maybe that’s where someone will finally make a space game worth getting lost in.\n\nIt just isn’t this one.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Everything about this game falls short in some way.  Constant unskippable cutscenes of docking, undocking, landing, taking off, literally everything is fast travel, and I encountered the exact same dungeon at least three times.  There's practically no laser weapons, they never use the zero-G mechanic, the leveling system is a haphazard merger of Skyrim and Fallout in the worst possible way.  Leveling up and getting a perk isn't enough, you have to grind the skill until you can be allowed to purchase it, which is *very* disjointed in terms of gameplay.  The writing is not great, you can't even properly steal ships while working for the pirate faction, I don't care about any of the characters, even mining is unsatisfactory because there's nothing good to make unless you grind crafting and also level up so you can buy the perk, and ores are practically worthless.\r\n\r\nI'm quoting \"Starfield is a Fake Game\" here: Starfield understands that players like space exploration, but it doesn't understand why.  It understands that Neil Armstrong had fun on the moon, but it doesn't understand why.  And Todd Howard and co have repeatedly proven that they understand players are disappointed... but they don't understand why.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This is a time where steam really needs an ok review. I wouldn't say that this game is a do not buy. I would say it's a buy heavily discounted. I have 400+ hours in this and I really don't know how. Not in a \"wow this was so fun I lost track of time.\" but in a I think I must've left it running and didn't realize it kind of way. Starfield isn't all bad. The exploration of space and the shipbuilder are very fun, and the combat is solid. The style and overall theme of the game is great. I mean a retro-futurism focused on NASA, what's not to love. The quests are strictly ok. With the exception of one notable quests involving some historical figures, most are entirely forgetable. That being said, that's where the praise ends. The pacing is odd, the story is weak at best, and the dialogue is abysmal. Touching more on the story, it feels like the entire story was written around the idea of having a new game plus and no thought was put into making it interesting or compelling.  Also, I'm not saying that every story has to be gritty and dark, but it feels like Starfield was sanitized so heavily to try and get a Teen rating to the point of being a bland milquetoast version of a game. Lastly, the \"over 1000 planets\". This was sold as one of the main points of the game. And yes, exploring the vastness of space is very fun, and yes most of space is empty in real life. However, it feels like they spent so much time on creating this vast expanse of space to explore and then they ran out of time to fill it with anything meaningful. There seems to be only a handful of layouts and designs for POIs and the few you find are far between. I think having mostly empty space to get that sense of vast emptiness is great, but the same effect could have been gotten with 300 planets and alot more interesting things to do on them. \r\n\r\nOverall I want to love this game, I really do,  between all other Bethesda titles I have probably close to 3000 hours. And if it just was a few problems overall I could look past it. But there was too much wrong at the same time to say that this was a success. Overall a game that had great potential that just failed to exceed at any major point.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game has many problems and is a big step down from Skyrim and Fallout 4. Here are some of the reasons why:\n\n[list]\n[*] Hacking and unlocking are the same minigame\n[*] Nothing in or under oceans except alien monsters, which are often inaccessible due to the liquid harming the player\n[*] No boats\n[*] Most systems only have tiny populated outposts; there are only a handful of actual towns in the entire game and they are all major cities\n[*] No NPC schedules\n[*] No NPC homes\n[*] Not enough robots\n[*] Cell reset wipes apartment during story\n[*] Main story has no consequences - you cannot even remain in the world!\n[*] Stupid quests (Operation Starseed, Juno’s Gambit)\n[*] Lore is not convincing (fate of Earth, recent faction war with little evidence)\n[*] Neon is too PG for what the lore suggests about it\n[*] No in-world literature\n[*] Only small excerpts of an extremely limited selection of historical literature\n[*] Hardly any (zero?) references in society outside of quests to actual historical events despite being set in the real world\n[*] Earth has historical landmarks but people claim there is nothing there\n[*] Sol is described as a backwater but has several cities and is the closest system to α. Centauri\n[*] Main city is underpopulated, spread out and barren - the two other cities are much livelier. It also directly abuts wilderness with no urban transition or wall\n[*] NPCs have too few voice lines - recruits and NPCs are very repetitive\n[*] Alien lifeforms (including plants) are the same everywhere\n[*] Limited random locations on planets and they have no procedural generation - they are always identical (including full layout, location stories, notes, decor/clutter etc)\n[*] Surface exploration is tedious (vehicles had to be added) and there is little to find\n[*] Outposts are too tedious to manage for resource generation. Shops reset frequently and carry all materials\n[*] Not enough equipment variation/types\n[*] Sneaking locked behind perk and sneak perks are dumbed down\n[*] Too few and underbaked followers\n[*] Not enough romance options\n[*] The music may put you to sleep\n[*] Radiant quests have hardly any variety and there are few sources for them\n[*] Player creation customization sliders are straight-up ridiculous\n[/list]\n\n*[i]I haven't played this game since 2023. This is all coming to mind while playing Fallout 4 in 2025[/i]",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I'm voting No on the recommendation only because I want them to do better, BUT I don't totally hate the game.  I bought this full price at launch and yeah compared to other bethesda games it is a letdown.  \n\nHere's what the game has going for it: \n1. Gunplay when you compare it to fallout is much smoother, has great sound qualities, and the graphics are nice.  \n2. Raiding and docking enemy spaceships is exciting and a great concept.  \n3. Discovering new species on planets is fun at times and amplifies the experience of being a space traveller. \n\nHere is what they missed: \n1. I don't think they have developed the idea of whether the game was fantasy or Space Sim.  There are aggressive space aliens, but no 'intelligent' space species which leads to the game feeling like it was rushed.  Each planet is only filled with a couple of species of creatures which again loses the immersive feeling. This leads to feeling like you are in a digital sandbox.  \n2. The biggest flaw in the game is the Temples.  Every single temple is the same, no variation. Just why? No dungeon experience, no enemies defending, same severely easy puzzle each time.  Just creating unique temples with unique encounters, different puzzles would have saved this game.  \n3. This is beating a dead space horse, but again the planets are also devoid of anything meaningful. There should be rhyme and reason to locating minerals (weapon crafting, saving dying species, etc). Planets with life on them should have diverse species at least 20 (maybe thats asking too much idk, but 3 ain't cutting it). And at least a few planets should have structures from intelligent alien species if you're going to already include other alien lifeforms. \n\nGame is worth a quick playthrough if you get it on sale and beat it once. But it needs much more concept development and intelligent design to gain peoples' trust back.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I want to love it so bad, I really do, but Starfield is a bit of a confusing game to me.\n\nMuch of the themes in Starfield revolve around space exploration, being a pioneer, and finding things on your own. Yet the game is constantly breaking your immersion with loading screens, invisible walls, and repeated 3D assets used in the randomly generated areas. \n\nOn top of that the shallow character dialogue and weird animations make me feel like I am wandering around a beautiful space-themed museum where the animatronics talk to you, and occasionally shoot at you.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Had this been a $20 game at full price, I could get behind it. But the standard $70 USD price tag is obscene for what you get with this game. One review I saw summed it up very nicely: wide as an ocean but an inch deep. They put so much effort into making the game feel \"big\" but forgot to actually put in the content to make it big. It's loaded with bugs still. The $30 DLC offering is a joke for what you get from it.\n\nYou select a solar system to warp to. LOADING SCREEN. You arrive in the solar system in open space. Now you choose the planet to go to. LOADING SCREEN. Next you choose where to land on the planet from the map. LOADING SCREEN. Finally you get out on the planet and get to play but wait... it's not open world. You are playing on a small area that you cannot go outside of without getting in your ship and landing somewhere else on the planet.\n\nWant to spend $70 on gameplay? Buy No Man's Sky. It's a bigger and better experience. Only thing I would say Starfield does better is the combat mechanics, and that's a \"barely better\" situation. In No Man's Sky, you choose a new solar system and warp to it. LOADING SCREEN. Now you're there in space. Want to land on a planet? You actually fly to it instead of fast traveling from a map. Once you reach the planet, instead of choose a landing site from the map and again fast traveling, in NMS you actually fly down into the atmosphere and onto the planet.\n\nNMS gives you that seamless space adventure. Starfield gives you a fragmented space adventure that is primarily broken up with loading screens.\n\nOtherwise, there are plenty of other games that are better than Starfield in the $30 or less price range. I honestly tried to reach 100 hours of gameplay in this game, but it was so painful in the end I couldn't make it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I keep trying to come back to this game, and each time I am reminded that it is buns.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "A lot of my time played on this game has been alt-tabbed in the background, but I HAVE spent a lot of time on this game. But like, it's the kind of time you put in on an open-world game when you're hopeful you're gonna find something fun or interesting. You invest.\r\n\r\nThis game will make you invest and will never, never give back to you. Play AC Odyssey for fun exploration. Play the mass effect trilogy, or Andromeda even, for fun sci fi stories that make you go whoa. Play Hades, or Wanderstop, or Greedfall, or just play Skyrim again. Don't buy this game. It's not fun. The combat's boring, the loot's dull, the exploration is more vanilla than Oblivion, the characters are INSANELY dull, there's less in this universe than in a Borderlands DLC, and the building is frustrating, both ship and house. Just don't play it. \r\n\r\nsigned, frustrated and sad\r\nI gave this game EVERY opportunity to be my new love affair",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "game is just empty nothing to really do and everything is just copy and paste",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Honestly I thought I reviewed this when it came out.\n\nAny and all interest you MIGHT have in sci fi or sci fantasy, will not be quenched with Starfield.\nThe most interesting part of the game is the ship builder and it's not even that good because it's intertwined with one of the most horrible and barbaric \" rpg \" systems I've ever seen. You complete essentially \" achievements \" to increase your perk levels in Starfield and that restricts genuinely everything your character is capable of. Want to use jetpacks? Perk with achievements for upgrades to use the better jetpacks. Want to fly a faster ship? Perk with achievements for upgrades to buy better ship parts. Want to be able to mod your weapons to not be literal dogshit? Perk with achievements for upgrades to make better parts. The entire game is like this, and it's genuinely the least statistic based RPG I've ever seen and it's all the worse for it.\n\nEnemies aren't just sponge-y. Anything over level 30 or so that's not a common rabble is toting enough HP bars ( yes enemies have MULTIPLE HP bars for you to chew through in this trainwreck of a game ) to bore you to death before they actually drop. \n\nThe questlines are a joke, the writing is dreadful and feels like something made up by a 10 year old who just kept doing that thing ( if you're a parent you know ) where they go \" And then a dude in dark armor shows up and attacks the town, and then a portal shows up and a bunch start pouring out, and then you have to run away from it, and then... \" ad infinitum. It's BAD.\n\nPerformance is the worst in any bethesda title so far and the loading screens. The LOADING screens. Even with an SSD in a 40 hour playthrough you're looking at around 4 - 6 hours of load time combined. It's THAT bad. Everything is fast travel, EVERYTHING. There's no feeling of space flight whatsoever and although I personally like the dogfighting, it's still SOOOO barebones and basic. Judging from what others have said it's clunky to use. Idk arma does something to a man what can I say?\n\nPaid mods, garbage DLC, overpriced trash, still no Elder Scrolls 6, still no change in sight of bethesda's practices. What more is there to say? Don't buy this stuff, seriously. Stop funding them, stop promoting it. If that means we lose ES and Fallout forever, oh well dude. At least we have the old games because this ain't it. This is a joke, they deserve to fail as a company for failing to deliver, failing to listen, and failing to show up.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "It lacks a soul, it lacks depth and interest, it lacks... everything that could be good.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've tried 3 times to get through this game and give it a fair shake. Each time I get so immensely bored exploring the vast nothing that it presents to me that I just give up.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game is honestly meh. It has potential but the majority of planets are just empty resource gatherers and the quests are okay i guess. The ship building is great. Honestly go spend your money on a good RPG, this ain't it",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game sucks, and modding will need a good amount of time to fix the underlying issues",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Right then, I'm not entirely sure how they've managed it, to be quite honest. Some sort of secret ingredient, perhaps? But the game is utterly tedious. I couldn't even get past the first few quests for Sara and the Vanguards.\nThe controls are absolutely dreadful and clearly designed for a gamepad. You can't simply open the map and close it, for instance. You have to navigate through a confounded zillion other screens, or else hold the key, which renders the map completely useless.\nIt might have some potential, I'll grant it that. But I'm afraid I've simply run out of patience with it. Sorry!\n(and yes, please make the travel Outer Worlds 2 like, no need for that fake Space \"exploration-navigation\")",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was pitched as Skyrim in space. In actuality it is a boring empty soulless game that they've already abandoned.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Had to come back to this to make sure I voted it down.\nTerrible gunplay, boring quests, horribly annoying NPCs. The only thing slightly saving this game was the ship builder, and No Mans Sky slapped bethesda across the face with their massive cock and did it a billion times better at way less of a cost, and with hundreds of hours more gameplay of use. You don't even fly the ship anymore at some point, making it totally useless as a mechanic. And base building just doesn't matter at all.\nNot to mention, the fus-ro-dah ability unlocks, and I mean this on the full dictionary definition of the word from 10 years ago (2015 and later), LITERALLY have you jumping through hoops to unlock more points in that skill tree. Really?\nAt the beginning of the game, the interstellar star whoever the hell they are group tells you that it's all chill if you do whatever you can to get the whatever they were alien computer something parts. I've totally purged whatever it was from my memory. Then at the end game, they all get pissy at you for ALL of your choices made along the way and just totally lie to you about what they'd think. So when late game when there's a 'tragic' death in the group, I audibly laughed in their face and then closed the game forever. \n\nFuck you Bethesda, and fuck this game.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It is just an awful experience start to finish, not even mods can save it. Can't wait for the anniversary edition in 8 years",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I've completed Fallout 3/4 and Skyrim a dozen times. But this is a boring as hell game. And creepy gentle, for players 0+ years old and for certain Twitter groups. DLC is joke with 0 content other than the main story on 3h. I hope developers of this game not gonna be related to TES6 and Fallout 5 in any way",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I thought I had already left a review for Starfield, but to give the short version the game is shockingly bad.  I held out hope that Fallout 76 was just a cash grab produced by a secondary studio, but it seems that after the microsoft acquisition all of the talent left the studio. If you liked The Outer Worlds, this game is as good at that!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "132 hours on this game and I don't remember a single thing about its story, \"worlds to explore, or characters I came across along the way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a nothingburger. It's like going to Burger King and ordering a burger with bread and meat only. What is there is mostly okay, and it'll fill your stomach at least for a little while, but by the end you'll still be wanting something more substantial.\n\nWhat I can say is it has the best character creator out of all the Bethesda games, bar none. People actually look like real people and you can do a fair amount with it. I had fun messing around in the character creator and I actually, for once, really liked the way my character looked. Good on Bethesda for that, but everything else needed about another decade in the oven.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm sorry to say but this was one of the most disappointing games of my lifetime. If I could, I would have refunded it for wasting my time. The one thing that I really liked and sunk way too many hours in was the ship building. Surprisingly good, definitely wish they flushed it a bit more and got deeper into it. Everything else falls flat unfortunately. It feels like I was egged along believing things might expand and get more interesting but it doesn't. Every quest eventually breaks and soft locks itself and I lose hours of progress. I've never played a game that made me feel so much pain for no reward. Listen... I'm a big fan of what Bethesda was creating aesthetically. I love Sci-fi themes and space ships but no denying this was the second biggest cat-fish of gaming history.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's just not worth time or effort. Every feature half baked, nothing and no one interesting to find. Very soon you start asking why am I doing this as the world is just empty.\nSave your money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "empty game, unsatisfying mechanics. Star wars mods is only redeeming factor",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don’t usually write many reviews, but here we are. I honestly tried to like Starfield — and I did enjoy it for the first few hours , but like many people have said, the storyline just isn’t that interesting. The world quickly feels dull and empty, and overall it comes across as another soulless game made by a big studio. I’m sure passionate people worked on it, but unfortunately, they’re stuck creating something that feels lifeless because of the studio behind it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I used to struggle with severe insomnia, to the point where I had to take strong medication just to fall asleep.\n\nI don’t need those anymore—because no game I’ve ever played is as boring and empty as Starfield. I can’t even explore a second planet for more than ten minutes before my eyelids start to droop and I feel like I’m about to fall asleep on the spot.\n\nI really tried to play and enjoy it for what it is, but I can’t shake the feeling that the game was scientifically designed to be as unengaging as possible.\n\nWhen I was a kid and adults said video games were a mindless waste of time, I never understood their perspective. With today’s AAA releases like Starfield, I absolutely get it now.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "mad i bought this for $70, wish I had realized straight off it sucked and refunded\ndon't be fooled by the 46 hrs on record - I left it running a few times. I definitely didn't get anywhere close to my moneys worth.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Boring quests, too much  generic content. Many systems with good ideas are simply unfinished, lacking cohesion. You can build complex bases, but there is no reason to do it, no connection to the game. Design and build your own star ship, but why when you mostly teleport anyway. Crafting, research, whole systems can be ignored.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Loading Screen Simulator is a better loading screen game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "200hrs on a single save and everytime you launch the game continue is on top which is what you want to do but new game is always highlighted if you accidentally click it you can not exit or skip until all dialogue and elevator ride are over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring game from a terrible company, spend your money elsewhere.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "fuck no, ran into a game breaking bug 3 hours in that wont allow me to be a bounty hunter. look into bug. bugs bin in the game for a year now. what does that mean? that means theres a hole section of the game that players havent been able to play for a year now because of said bug.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In an infinite sea of potential, which shines on the surface like an oil slick, it manages to drown in the mediocrity below. \n\nBethesda is, in theory, capable of better writing than this. \n\nBut when even the linearity of Fallout 4 feels better implemented, and the setting feels so utterly devoid of the depth it demands and could have, I cannot imagine how we should ever expect anything better.\n\nBuilding ships is fun! Good job!\n\nBuilding outposts? Practically useless, boring, and you cannot do anything interesting with them. They have no impact on the game itself other than dull resource extraction and storage.\n\nFactions? Under-explored, and each feels like it's engaged in petty squabbling, lacking any real ideological or ethical complexity.\n\nAnd, like Fallout 4 before it you have no important choices to make, you have no lasting impacts.\nAll is blown away in a stale, dusty wind. Over and over again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Absolute garbage. I want my money back and an official apology. Elder Scrolls and Fallout died for this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Boring and poor gun play and very slow clunky systems overall.  Major L for bethesda.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As there is no mid-thumb I finally decided to give it negative review.\nWhy though after I spent 270 hrs in this game?\n\nFirst I had some fun early game and when I was still exploring the game.\nBut after seeing the direction that Bethesda is taking with this game I can't recommend it to anyone.\n\n- Creations is a cash grab\n- Updates are rare and lack luster\n- Engine doesn't allow the necessary changes\n- Creations killed any meaningful modding\n\nWith the state of Starfield I fear for whatever ES 6 is going to be.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They forgot that the whole reason people like Bethesda games is because of the exploration and the immersive worlds. This game is so bland it's funny, and not in a good way. The good news is that if you turn off your brain and just play the game, you will be entertain, which I guess is something. I still got all the achievements though.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Starfield is just painfully mid. It doesnt even fullfill the bethesda game craving. Theres a lot to like, and the first hours i had with this game were pretty fun, but the facade breaks apart pretty quickly, and you find out, oh, this is all there is. its just not as fun as it seems on paper. A lot of the game design is outdated, clunky, not interconnected, and it all just falls apart in an incredibly unfun way.\r\n\r\nWhich is a shame! I had followed news for this game for years, and was INCREDIBLY excited for it! i watched all the pre release shows and dev interviews and stuff, followed online discussion, and i really genuinely truly thought Starfield would be something special. Something like Skyrim and Fallout 4, while being incredibly flawed games through and through, still had that special something, that Bethesda magic. That feeling of exporation, of having a huge fun sandbox to fuck around in, interesting lore, and rpg mechanics engaging enough to have a good time and become ridiculously powerful after coming from nothing. I have thousands of hours in other bethesda games, yet despite giving Starfield a *genuine* go, disconnected from all the online criticism, and genuinely wanting, craving to love it....\r\n\r\nI walk away after only 30 so hours, not really wanting to play anymore. and its a shame! Its so obvious that a lot of very passionate and talented people worked on it! I see the vision, the old timey sci fi conventions and stuff, the whole nasa \"punk\" aesthetic thing, ooooh mystery and ADVENTURE and being campy and a good time, i was all for that! and the game looks beautiful! the music is pretty damn good too! ship combat is pretty fun! and a lot of the questlines are middling to pretty good!\r\nBut its just loading screen after loading screen after loading screen, meaningless fetchquest that couldve been an e-mail one after the other, and where that sort of thing was fine in skyrim, it just falls apart here. The Starfield doesnt feel like a living, breathing world, due to the way you actually interface with it, mostly consisting of fast traveling and constant loading screens. Sure, in skyrim, you could play like that if you liked to, or you could walk, and find something interesting along the way, a billion new quests, random encounters, whatever. here, its the only way to play the game.\r\n\r\nI want to love starfield, and i have for years, but this game breaks my heart.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Seriously forgot I had this game(purchased on launch) until Fallout 4 recently broke again thanks to Bethesda's inability to do anything right and read the room, so I got frustrated. As a decades-long Bethesda Game Studios fan, this is one of the most boring, uncompelling games I have ever played. I didn't even know it was possible to make a game this boring, but I guess when you base a game's design around PlayStation 1 loading screens and literal emptiness you get this. I can't rationalize why there are so many loading screens when there is seemingly no content to load. This was the first BGS game I could not finish because it felt like an obligation rather than a game. I stopped at the \"big reveal\" because if that was the best the game could offer then it wasn't worth finishing. Sure enough, I looked up the \"ending\" of the game and it ended exactly how I expected, glad I didn't stick around and waste another 10+ hours. That's not even the worst part, they genuinely thought it was a great idea to [spoiler]erase pretty much all of your progress just for some \"haha isn't that crazy?\" kind of BS[/spoiler] at the end of the game. PlayStation fans shouldn't even be upset that they didn't get this game because they missed nothing of value. I can think of probably a dozen other games that do exactly what this game tries to do and more. If there is one nice thing I can say about this game, it's probably the new lock-picking mini-game is kinda fun, but that's the only thing that comes to mind. At this point I have no faith that The Elder Scrolls 6 isn't going to be total dog water.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I keep trying to play this game thinking that maybe it was just me and that its not actually that bad... but after about an hour or so i keep feeling all sad and disappointed that i fooled myself.. again. WHY Bethesda? why? Please dont do the same mistake with Elder scrolls 6.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game started in July 2024. Nice game, a bit boring but good for chilling. After 60hrs the saving corrupted and the whole UC questline was blocked. I dropped the game.\n\nAfter more than one year, I decided to give it a second chance. But simply I CAN NOT. I'm still pissed off and the idea of re-doing the first 30hrs of the game, with all those stupid initial quests, makes me sick.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I forgot I even owned this garbage. Forgot to review it when I got it. So here's the review.\r\n\r\nThe game is trash. Refund before your 2 hours is up. I got this game for free with my GPU. Still not worth the price.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is buns. \nUntoasted Buns.\n\nBethesda owes the collaborators of Star Wars Genesis a big fuckin thank you, only reason I bought this hotdog water.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This should have been my favorite game of all time, but everything is so damn uncanny. It's just creepy after awhile. Old Bethesda jank used to give their games a humorous human quality. That is long since past.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Boring, Mods do not work properly. Boo Bethesda. Waste of Money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fuck this game. The writing is awful, the environments feel dead and lifeless, the massive number of planets with procedurally generated terrain is a stupid gimmick, and the art style is crap. I despise the weapon designs, most of the character and outfit designs are trash, and none of this is helped by how generally ugly this game is. Starfield looks and plays like a PS3 title at best. What a fucking disgrace. I can't believe I wasted 70 bucks on this piece of shit. Fuck you Bethesda",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "From day one this game has being loaded with game breaking bugs it's being 2 years it seems those game breaking bugs are still here don't buy this buggy game waste of money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "These scam artists have again released a money grabbing game. Why add Creation Club if all it does is crash the game!!!! After playing for over 600 hours of vanilla game play, I add some flavor via mods and BAM!!! It does nothing but crash!!! Creation Club is supposed to be safe and workable, but NOOOOO!!! Got my money there buying credits too!!! Perhaps it's time to part ways with Steam, since they says it's all Bethesda's fault and to call them.... Thanks for nothing!!!!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It's just boring. No depth and too much repetition. I was so excited for this game that I think I was blind to how bland it is. I felt like I was forcing myself to keep playing and that just maybe it would get better eventually. It didn't. Then I saw a spoiler online about the end game/story and it immediately killed any interest that I had in continuing to play. I'll definitely be wary of any Bethesda releases in the future even though I really really enjoyed The Elder Scrolls (Morrowind, Oblivion, and Skyrim).",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really wanted to enjoy this game... I love the art direction, the ships, the outfits, even the stupid gun styles, but in 2025, the Creation Kit is just too limited for type of game. The story and gameplay is mostly \"meh\" and I think even the Modding community agrees.\n\nI'm getting really tired of Bethesda outsourcing their games to be fixed by their own player-modder base. It's rude and it's lazy of them to charge $70 for a game that needs to be fixed by their own customers... It was really charming and exciting at first back in 2011 when there was only 100 people working for Bethesda at the time, but they still made games that millions of people were really passionate, and people's expectations were naturally lower. This game just doesn't have the same vibe. It's dull, it's slow, it's under-cooked, and it's heart-breakingly shallow. You are going to spend half of this game in the Fast-Travel UI because of the way the Creation Kit handles loading and unloading scenes and tilesets. \n\nThe excuse / mantra I keep hearing from fans: \"Well, it's a Bethesda game, so what do you expect?\" That nonsense isn't going to fly for much longer. Especially if this studio is still planning to make Elder Scrolls 6. The writing is on the wall. Bethesda Game Studios now employs over 5 times that amount of people (maybe more). and currently has 4 different office locations. They are not a scrappy, underdog, Indie studio anymore... The fact that they've embraced that mantra as part of their brand identity as a AAA game studio is just terrible. and in my opinion they should feel ashamed.\n\nHot take, I'm just gonna say it, because it's true...\nStar Citizen is a more complete Space Exploration game than Starfield. It has actual ships that you can fly, with proper physics simulation, It even has a handful of planets that you can land on and explore that don't all feel like empty deserts. So is No Man's Sky. which also now has ships that you can build like Legos- just like Starfield. So this game ultimately has very little to offer in terms of originality, exploration, crafting, story, or fun. \n\nMaybe one day, if this game cost $30 on sale, I'd say go ahead and give it a shot. But I can't in good faith recommend this game to anyone- unless some crazy mad-lad made a mod in this game, to make a better game than Starfield.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a boring game with no replay value and paid mods that have split the community. Fallout 4 in space but worse.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It delivers nothing a Bethesda RPG should: hand crafted open world with realism elements and truck loads of interesting thing to see in said open world. The only things Starfield has that is sorta OK is ship crafting (insert Reddit moment) and gun play. I remember NOTHING off of the 143 hours of playing about this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I should've really guessed, coming from Bethesda, but this is just another Inventory Management Simulator.  Far too much loot to collect, far too much hassle to sell it, and limited places to store it.  Most of the early game just seems to be either collecting, or avoiding collecting, the massive number of duplicate items that you'll not have room in your inventory for.\r\n\r\nDull as three week old dish water!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A deeply flawed disappointment, troubled by poor writing and unimaginative exploration. Redeemed only by decent action.\n\n--------------------------\n\nPros:\n\nGunplay is satisfying for a Bethesda game, almost feeling like a dedicated shooter in how entertaining blasting opponents can be.\n\nZero-G movement is incredibly fun and implemented really well. By far the best new feature this game adds.\n\nCons:\n\nDespite the focus on the spacecraft, they are largely an afterthought - space combat is far too simple, ship components are horrifically unbalanced, and there is no actual flying to be done. Jumping systems, travel to planets, landing, and takeoff are all merely loading screens. Rather than feeling like an open galaxy, the world of Starfield feels more like a series of rooms with a starry backdrop.\n\nSimilarly, outpost building is an utter waste of time. There is no need to ever build an outpost - no colonies to build up and populate with settlers, no resource incentive (since you would have to build a dozen outposts to get the right combination of useful resources), and the story never touches on the feature even a little.\n\nApart from the problems with the space content, the actual RPG elements are all over the place. There are far too many features locked behind perks, far too many levels for each perk, and the loot system took all the worst parts of Fallout 4's insistence on being able to pick up everything while simultaneously removing any utility in doing so.\n\nThe companions in this game are mostly dreadfully dull people. I liked Sam well enough, but they are all still just a single personality trait personified. They have no nuance in thought, no real differences of opinion, barely any backstory of note. They exist merely to fill crew positions and repeat the same 3 lines of dialogue whenever you switch loading screens. You would think a guild of explorers would be full of bright-eyed, scientific, and curious minds - but you quickly realize that these people will offer nothing of value in the actual act of exploration.\n\nSpeaking of exploration... There is almost none to be had. You can land on planets, scan minerals, flora, and fauna; yes. However, there is nothing else to it other than the same randomly-generated pirate outposts, abandoned labs, military facilities, or mining outfits. There are no hand-placed nooks with secrets to find, no environmental storytelling, no surprises. It's all just an algorithm spitting out random junk and passed off as \"exploration\". The only incentive to even explore at all is selling the survey data - you don't get anything other than money for having done so. Of all my issues, this is the most egregious and the one that really spits in the face of any fan that was once excited for this game.\n\n--------------------------\n\nThis should have been a good game and I am very sad about what we got, instead.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Starfield was a major disappointment. I love space themed media and love Bethesda games despite their flaws. Unfortunately, Starfield takes the worst elements of Bethesda games and a lousy excuse for a space-themed story and combines them in this awful excuse for a game.\n\nThe positives:\nVisually, the game looks good. That is the one plus I found playing this game.\n\nThe negatives:\n- Crashes frequently on multiple machines (tried on a 4080 super and a 3060, both crashed at multiple points in a single hour of gameplay)\n- Bugs (sound cutting out, skipping dialogue, characters getting stuck in geometry, etc.) Seriously, I thought the game didn't have gun sfx for the first 40 minutes because my sound glitched out from the very beginning. I had to reload a save to get it back.\n- Corny, lame voice acting/ dialogue\n- Bland combat\n- Dog fighting/ ship combat is slow, unintuitive, and boring\n- Story makes no sense (oh miner guy, because you saw a mystic vision from a piece of rock I will now give you my ship and send you to meet my space cult brothers. No there was no build up to this. No you can't refuse. Yes all of your dialogue options make you way too enthusiastic for this.\n\nI can't recommend this to anyone. I was bored to tears after the first ten minutes, and after watching someone else play past where I was to see if it got any better... it got worse. If you REALLY like bethesda and anything space-related, you may be able to find something you like from this. However, I doubt most will. My recommendation is give this one a pass (or if you're really into modding you could try it with that but I couldn't be bothered.)\n\nRating: 1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Empty passionless game not worthy to be called a bethesda game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to love this game because it was the most expensive I ever bought. But na. Money wasted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring asf nothing to do outside of a few tolerable side quests but nothing you do matters none of the factions care about what you do for the other its a soulless game with no real content",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is still completely bugged and broken. I'm stuck at Red Mile with no way to progress or leave. Time to uninstall and play a game that works.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "greed thats all bethesda is at this point. the worst part is the game isn't any fun. o kept playing hoping it would get better and it never did. don't waste anymore time and money on bethesda they died long ago and all that remains is a bloated corpse.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not worth the money. DLC doesn't add anything decent. story gets old fast. haven't played in over a year.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They essentially ghosted the game. Provide no updates. The only time we hear from them is when they want to shovel paid mods down our throats. I can't believe this was supposed to be the Star Citizen and No Mans Sky killer.....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have tried over and over and over to get traction in this game and want to actually play it.  Every time I get about 10-20 hours in and it just turns into a complete snooze fest of boredom.  There is so little redeeming quality in it, and it feels like Bethesda made a game, took out everything remotely fun, and released it.  Not even mods or creations save it.  It's just a very boring walking simulator with forgettable characters and boring questlines.  The closest this gets to playable and fun in the Star Wars Genesis Conversion, but even that it still using the same underlying quest lines and system so it just becomes a beautiful....but still ultimately boring slog.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Complete trash. Boring, ugly, repetitive, soulless, scammy, uninspired waste of time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty graphics, boring game. Story fell flat, not a lot to do. Feels big and empty. Somehow other space games make space feel lively and exciting, but this one couldn't do it.\n\nThe space ship builder is the best part. Now that you can do the same in no mans sky there is no reason to ever play this game again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels like it's wasted potential, especially with keeping Fallout 4 in mind. First time I've preordered a game that I didn't have a franchise following towards, and it was for sure regrettable, as well as disappointing. I don't know if it's been introduced, but something as basic as a material sorter with automating transport just bewilders me how not more thought was put into that whole system. It's cool rocket wise, yes, but damn.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When women and children get to decision power that's what you get. Terrible writing, terrible dialogs. Heads that don't fit the vioces and etc. Terrible and clueless main quest. Might as well be doing nothing. Terrible random ladders in every ship. Greatest ship constructor. Unfortinately for me it is the only space saga worthy playing that is open world. 1000 hours+ in game. I can't recommend it, but there is nothing else. Nothing. And don't even get me started on Mass Effect, it is not open world.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Only bought the game to play the Star Wars Genesis modlist. Modlist is cool. The base game tries really really hard to be bland. Props to Bethesda for rigging up space combat in the Morrowind engine, but it is the worst space flight combat I've ever experienced.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after most recent update creations have once again been broken im unable to update my paid verified creations and they keep appering every time i close the game this is rediculous why did i pay money for verified mods if they wont even stay updated after i update them.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "After realizing I never reviewed this, I immediately came to the store page to let you know this game sucks ass and I didn't even bother finishing it because it was so boring and drawn out. Please don't waste your money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Real Reviews from actual players:\n“This is not a game to be dismissed lightly. It should be uninstalled with great force.” Dorothy Parker  \n“Full of sound and fury, signifying nothing.” William Shakespeare\n\nThey rebuilt the engine but not the ideas, making Starfield the best-looking argument yet that Bethesda never learned the right lessons. The new engine soars but the gameplay remains earthbound by design choices old enough to collect a pension, and the problem isn’t the ambition, it’s that the ambition is attached to the same broken machinery.\n\nStarfield proves that you can improve everything except the things you refuse to rethink, and they brought their best effort and their worst instincts. The result is a game that stands as a monument to effort and a memorial to imagination, where every improvement only sharpens the contrast with the ideas that should have been left behind.\n\nIt has the ambition of a space opera and the gameplay depth of a damp paper towel, and never has so much been done to reveal how little has changed. Starfield tries so hard you can almost hear it strain a pity the strain is the most exciting part.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Skyrim with a space travel mod would be a better game then this loading screen simulator",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i'm giving this a negative review for a few reasons:\n\nnegatives: \n\nconstantly having to have to see a cutscene for space flight and travel made simple \"go here, fetch this\" missions 3x longer than usual. hell i even tried timing all of the time i took during this playthrough to see how much time i wasted on space travel alone and it came out to something like 36% or 45%.\n\nthe whole powers thing and not being able to level them up eithout first doing all the temples again is such a BS thing. never used quantum essence once and even scaled up the enemy damage but still the powers were okay at best.\n\nthe ship building looks cool to start but when your like 10 hours in and wanting to get a good ship which for me took around 3 hours to build i found out that the vanilla builder made all the connections wonky/placed doors on the sides instead of right down the middle like i built thus making my sleek battle cruiser a pain to walk around in.\n\nnever went into outposts... never built any cause i just found the research materials lying around in raider ships or raider outposts. when i did decide to build an outpost on a planet that took 4 hours to find the terrain was never flat enough to build anything that would connect so i gave up.\n\n\n\npositives:\n\nsome.... some of the creations give you actual decent ships and or companions. \n\nthe gunplay is sorta okay.\n\nship combat and boarding is fun just gets harder to do when you encounter low level enemies late in the game cuz you vaporize them.\n\nthe DLC shattered space is all on one planet tile so it's vastly more enjoyable and quick. honestly wanted more of a outter impact for va'ruun like maybe the abandoned building to become non abandoned.... but nyope!\n\n\n\nTLDR: the ship travesal is suuuuuper time consuming.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "One of the worst games Bethesda ever made what they were thinking while doing this garbage beyond question but here is the fun fact they did a work that even stays in shadows of a game that they  produced in 2011 and people comparing this garbage to cyberpunk 2077 soulless npcs without any reaction to your actions boring story (understandable if its made by Emil lol) and unsatisfied combat animations i did a mistake by buying this garbage i hoped they improve it but here we are sometimes i expects so much thing from Bethesda i guess",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Instead of The Elder Scrolls VI or Fallout 5—the games fans have been waiting for for over a decade—what we got was Starfield. To me, it wasn’t the bold, visionary return to form we were promised, but a procedurally generated, sterile slop universe that felt utterly soulless. For many long-time fans, myself included, Starfield wasn’t a step forward—it felt like the final, definitive nail in the coffin. The moment where Bethesda’s decline stopped being something we debated and became something we accepted.\n\nThe backlash was intense, especially toward key creative leads like Emil Pagliarulo, who became the face of many criticisms about Bethesda’s writing direction. And rather than leading the charge to restore faith in the studio, he departed X for Blue Sky, where he could have his safe space with all the other blue haired wokesters.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm going to start this off by saying that in the time since this game has come out, I've put 103 hours into it. You would think that means that I'd like it and highly recommend it, but that's not the case. Honestly? The game sucks. It's largely empty and boring, nothing ever really feels all that interesting, the choices they made with the story were bad, the world building is bad, just the whole thing is bad. I run it with probably over 100 mods just to make it interesting enough that I'll play it for a week every 6 months maybe. No matter how many mods or creations i add, it's just boring, bland, and an obvious example of what bethesda gives us now that todd howard runs things. You have a studio known for interesting locations, creatures, factions, and races, and you get none of that here. They said \"skyrim in space\" like we'd have multiple alien races to choose from, or at least interact with like in fallout, but no. All the aliens are alright animals at best, which are rarely even especially interesting designs, all the planets in the \"massive exspansive universe\" they promised are just boring procedurally generated garbage that you have to add mods to actually make interesting. The leveling system sucks, and again, you have to add mods to make it work, all the weapons are forgettable and all the space suits are lack luster unless, you guessed it, you add new ones with mods. Basically every system of this game is a massive let down, made all the more shitty, by the fact that todd howard pushed this at as as hard as he could like it would be the next great game of our age, when in reality, it's just another example of why in the next 10 years bethesda is going to go bankrupt and dissolve, because they keep giving us garbage because todd is their god, even though he has no idea what makes a game good, and hasn't since fallout 3. I have not met a single irl person that enjoys this game beyond something to do to kill time sometimes, unless space is their autistic special interest/Big hobby, and even then, it was only 1 person that actually seemed to like it, and even they had complaints. This game is not worth how much it costs and the time and effort and additional money you have to put into modding it and buying creations. If you TRULY think this is the game for you, please, for the love of god, wait until it goes on a very steep sale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not buy this hot piece of garbage. Bethesda is as trash as they have ever been. Game can't even close correctly. Game is not even worth installing, let alone playing. This game isn't even worth it on sale. Slow, boring, unexceptional. It's crazy that it's even 2 years old. This isn't even worth playing modded. Save your time and your money and get something made by a real developer.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Everyone who joined this company after the release of Fallout 4 needs to be fired. Everyone responsible for the game direction who didn't work on Skyrim should also be fired. This game is what happens when you hire too many people with ulterior motives and aren't out to make a good video game. \n\nThe game is stale and bland. It's just a cutscene simulator. There's nothing to explore. All the planets are empty (I fully expected this but I also expected some handcrafted areas to just wander around in and explore but there's none of that). You cannot kill anyone. I walked into a building and just started shooting. But everyone got back up, where's the fun in that?\n\nIt's hard to say this with a straight face but it's true, there are too many women NPCs in this game and they're all extremely bossy and annoying. Who wants to play a game where you get nagged the entire time? \n\nThe menuing is awful. Getting from point A to point B is just clicking the \"Take Me There\" button over and over because I have no idea what I'm looking at. The star map is the worst piece of shit I've ever seen.\n\nThe Mass Effect series ended 12 years ago, and they were way better games than this piece of shit will ever be. The characters were all unique and interesting. It wasn't diverse by making everyone you meet a woman or a person of colour. It simply just was, and it feels way more natural than whatever the writers were trying to accomplish with this turd.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Terrible execution. They stopped trying to fix the game and went back to milk Fallout and TES. F u Bethesda.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "honestly after playing for 297 hours, this is the best empty space simulator on the market. each factions story is short and kinda predictable, but have their own charms. the ability to play through all faction's quests and make major choices that have no measurable impacts on the galaxy as a whole while you continue playing lets you manage only a single save file and character with ease.\r\nship modifying is somewhat entertaining, and the cut down settlement building aspect leaves me wondering why each world has more that 2 explorable areas and the limited varience in generated locations gets old after doing each pattern more than twice. \r\ni won't talk about the npc dialog because that's been beat like a dead horse, and the dead horse probably has more variety in emotional display than constalation's inability to accept that my character was a pirate after they gave me free reign with their ship. (somehow their only ship, despite daddy straud owning a ship building company) \r\ni'd have loved to finish the quests on the \"planet\" of clones, but my quest giver was soft locked behind a door and i only got that far.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The walking / running is so fucking stupid! I can only walk (fast) / run for like 20 sec before having to stop to keep my CO2 down. and slow walking is just to slow. Is there a fix for this or a way to turn off the O2 drain or something? I cant play this game like this since it seems there's a lot foot travel in this game! I cant waste an hour of my day just trying to walk somewhere!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like the game, but seems to me they were too ambitious.  I use a i7-14700k processor and RTX 5070 tI, graphics card. On high with a few bits turned down the outer regions play ok, but that city really is a pain. My system is getting too hot when in that city. Even turned it to medium in that city it still runs hot.\r\n\r\nI don't understand Bethesda's logic. They would rather fill the game with useless trash items than to have people play the game and appreciate the graphics. It looks nice on high settings, not so good on medium.\r\n\r\nAs for combat, quite liked the ground combat not so keen on the space combat, Space combat is more tricky the ship seems to move all over the place like it's bobbing around in the sea.\r\n\r\nIt's the kind of game you would like to recommend, but you really can't.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "boring and bland, and cheap-ass reused assets from fallout 4 is disgusting\r\n\r\nalso the guns look awful",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "For $69.99, I CAN'T recommend this game. If you can purchase it on sale and you really like Bethesda games, MAYBE go for it.\n\nThe world-building was shallow; it feels like stepping into a very shallow but wide pool. It's large, it's vast, but there's not much there. The depth of world-building and lore that you find in the Elder Scrolls series is not present. The story is \"mid\" most of the time. The new game+ system is creative but very punishing for those who enjoy hoarding loot and leveling up fully. The game can be very repetitive at times.\n\nOverall, the game is alright. Not the best that Bethesda has done, and I really had such high expectations for it. Tbh, I wanted to like Starfield, I really did. However, there are so many better games out there. Go play them instead if money is tight for you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Insultingly repetitive. The traveling through space is lacking of any fun. All loading screens. There are 5-10 different weapons. None of them exceptional. All they needed to do was make a casual Elite Dangerous. The factions are boring. The characters are boring. Being a baddie isn't really viable with the social group of npcs you are forced into. This sucks. Poor showing for Bethesda.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This is the worst game I have ever played.  I payed over $100 and wish i could get $00.001 refund.  as I would consider that a wind.  Bethesda garbage now.  \nfirst there is no story.  literally they stole the plot from the neverending story and twisted it....  next...\nThe lighting in the game is the worst of anything i've ever seen.  You can fly faster than light speed.  have a flashlight that goes more than 10 feet / 3 meters... Cant do that.\nClothing that looks good... cant do that.\nEnjoy gameplay without LGBTQ+ bs.... Cant do that.\nI will never buy a bethesda game again.  this studio is dead to me as they should be to anyone who wishes to enjoy a game without they shoving thier policital and biological views down your throut.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Your choices are meaningless, built yourself around a stealth thief? too bad, kill everyone on this ship because we don't want you to talk your way out of it and even if you stealth past everything you'll be forced to fight because it automatically triggers alarms. \n\nNo other questlines are even mentioned in the main questline and have no affect on the others, do everything and have it all mean nothing.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "In the fashion of Emil Pagliarulo im gonna keep my review simple stupid, because people will just skip over it anyway\n\ngame bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Looking back I can't believe I spent 90 hours on this. Visually beautiful, but there isn't really anything else worth your time here.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not a bad game per see, the issue is more the fact devs mismanaged this and overhyped what was sold. Even though the game is infested with alt left lgbt filth, its more the fact the devs also abandoned it due to low sales that has me annoyed. they could have supported it, but instead milked it with their horrible paid mods thing, then ran. as of this year, there is no support for game except the occasional buy x creations/paid mods advert and a bugfix every so often. i personally expect game to be dead mby 2026, with no new content having been pumped out by devs since their only dlc. this game was doomed from the start, and its all because of devs, mismanagment, and alt left lgbt pedophile propganda/woke polluting an otherwise great bethesda game. That thats a damn shame indeed.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Will not recommend.\n\nBuy the game so you can play paid mods LOL.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game dissapointed me. If I could talk to bethesda, it would not be in a hateful way, but in a way that a father speaks to his son to try and mend a dissolving relationship.  Id sit them down on the porch, wrap my arm around their shoulder, and speak. \"Hey,\" Id say, \"I love you.\" I feel a lump in my throat, but push it down and hide my distain. \"But you have been disapointing me.\" fire in my chest. I love him, but I have to say what I feel. I cant lose the one ive loved for so long, but I feel i dont recognize who im talking to.  \"30 fps? dogsh!t questlines? NPC's that constantly spew MCU dialogue? what is happening?\" I turn away. My face is wet at this point. My cheeks are red and I can barely hide the cracks in my voice. How can i feel this way? I love bethesda. I love fallout. How could I be having this conversation? I push these thoughts away as I look into the eyes of my chud son I used to love. \"You used to care. you used to be something.\" I stare at what used to be my son. I loved him, but i realize I couldn't call him my own because of the dissapointment i feel. A single tear rolls down my eye, and I turn my head to try to hide it. I wanted to be proud, but i have failed to live up to what i had hoped.",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}