{
  "positive": [
    {
      "review": "because of my niece's great enthusiasm for this game, i always assumed it must be a janky-mascot-horror game for young girls and never gave it the chance it deserved.\n\nChapter 1 eventually became free and was added to my library where it collected digital dust...until a few days ago.\n\nI finally got around to trying it out and i was shocked by the narrative, polish, world-building, puzzles, and creature-design - all of which were TOP-NOTCH!  I immediately purchased the rest of the bundle (which was half off at the time) and do not regret it.\n\nIf you were fooled by your own assumptions about this game then please brush those aside and give this game a chance because its not a janky-mascot game for babies...its a magnificent horror experience that doesn't rely on gore, violence, or cheap-scares to develop its truly haunting atmosphere (don't get me wrong, i love gore, violence, and cheap scares) which provides a challenging (but not tedious) and rewarding experience. \n\nIf you have the funds, don't stop at chapter 1 as the game should be played in its entirety.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "it is very fun lots and lots of action but never play alone or if you cant sleep alone",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Pretty good! Graphics are ok, enough for it to me somewhat scary. i'd recommend it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game is scary and when you play it as soon as it comes out there's a lot of bugs that makes it funny.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Jogo muito bem feito, fiquei muito feliz de saber que ficaria de graça, mas fico chateado por não ter conquistas, façam urgentemente conquistas!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is really fun to play the game makes me shake and they have good jumpscares",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It was a good experience, the puzzles were a bit hard but i am probably just not very good at them. The game has a little too many puzzles for my liking. I like the ending sequence, it made my heart pump alot.  6/10 Hugs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Scared game. \nColerfull and happy until the monster.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is such a good am but no D1 glaze there are glcihes with yaraball",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good gameplay! I got scared at the vent chase but overall, AMAZING game series! I CANNOT wait for chapter 5!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This chapter sets up the vibe perfectly—it’s atmospheric, and the scares are legit jumpy. It’s got that indie horror charm and the puzzles are clever enough to keep you engaged between the moments where Huggy Wuggy is chasing you down the halls. It's a quick play, but totally worth the cheap price tag for the adrenaline rush alone.\n\nThe production value is crazy good for an indie horror game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best horror game i think EXISTS because of all the deep lore, frightening charactersm and bonus points for the memes they started",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was very fun however on my second time playing it i got a speedrun time of 9mins and 31 secs, it is a very easy playthrough and does not take much time at all, i was very annoyed as the game shows the other 3 games but you cannot play them without buying then, this was not made clear when i got the game, it was very fun and it had some challenging puzzles but overall i would say it is a fun game but i became very annoyed at the hefty price tag of the other games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such an awesome game, with a amazing ambience\nawesome storyline\nmy favourite monster was in chapter 4 the doctor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow awsome atmosphere graphics are good and yes it is very scary with a best storline recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its an amazing game. However I do have misgivings on Chapter 4 because it feels rushed and should have been released on a later date like in 2026 or 2027 because the lore has to have some importance and reconsideration of representation and the lore itself that is represented in the game, it kinda feels disconnected as many elements like the nightmare critters and The Doctor Boss Fight feel very bland and Doey's Boss Fight feel very janky and weird. But if you want a game for the scares All the chapters are amazing but if you want to know which games are decent and amazing to play I'd say the first 3 chapters are amazing.\r\n\r\nAlso this is my judgement. If you want to see and play the game for yourself you may have different opinions. Even so it's your money and decision. Stay Safe and Enjoy the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So my daughter was obsessed with Poppy Playtime and Huggy Wuggy for a long while and I never really thought much of this game, just another FNAF knockoff, I thought, that I brushed off. Then I saw Markiplier play a section of Chapter 4 and realized this game looked way more impressive than I thought it was. So I got it. Chaper 1 is short, but very nicely done. It's more of a prologue than a full chapter. If you like Chapter 1 even a little, get 2, 3 and 4. Chapter 1 took me 1hr to complete, but after Chapter 4 I have a total of 26 hours of gameplay. They are 10 times longer, well thought out immersive worlds full of horror and puzzles with an actually good story.  This game does a great job with suspense and making you feel creeped out, building tension until something happens that is genuinely scary, and by scary I mean terrifying. I absolutely recommend this whole series. The only downside is that Chapter 4 has some MAJOR bugs. The blue hand glitch is near game-breaking, but you CAN get by it. just drag the saw into where the line is supposed to be and when it bounces up, it will eventually get cut. Other than that, it's worth your money. Just buy it already!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best horror/puzzle game i've played only downside is only 1 chapter is free you have to pay 15$ to play the rest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great horror game creepy and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent game, its pretty good. i just dont like how mob was rushing chapter 4 but the rest they're good except chapter 1, chapter 1 was kinda boring, due to the fact that its small, there isn't really any much to do and its small, you will be able to finsih it in like 2 minutes but other then that and chapter  4, the rest is good...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very scary but very fun with a great storyline. scariest game i have played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was so good when i play for first time in my new laptop... I would definitely recommended my friends to play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game but it was pretty easy and short",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best mascot horror game, good story, good gameplay and graphics are amazing but one thing that could be better would be the scare factor and probably trophies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The end of this game and the gameplay is so perfect it is so perfect the graphics that the producers did was so good and the end is the best with that big cliffhanger is the huggy wuggy real because the red smoke is in the room with us and that we already know that i think leith pierre is poppys dad and how the VHS tapes omg was so heart breaking like when doey kills his parents when he didn't mean to he was just having so many feelings an child souls 3 of them in him at first it is so heart breaking to me at first i already beat this game in 20 minutes sooooo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "outstanding storytelling coming from someone who has been in the community for about 3 years surprised this game is almost done I live this game so much that the story is very amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is just a great series of games maybe abit pricy but sure i can live with that ig.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game just a bug with the cart in chapter 4 with Barry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great and i love the jumpscares but if you don't like scary things i would not recormend this game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game and decently scary depends what you get scared at.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though Chapter 1 is short, it's a great little game for free and simple to follow. Love the series, keep up the great work Mob can't wait for Chapter 5!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "greatest game ever. the lore and gameplay are both amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great experience playing the first chapter it really anticipates me by its environment and concept used in its the best experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played many horror games, and this is the only one that has actually scared me. Would recomend for horror game players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. fun, scary, thrilling, and the plot is great too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is interesting in a good way. The mechanics of the grab pack are great. the sound effects of the hands launching are satisfying and I love how you don't need to move all the way over to something to interact with it. The horror aspect isn't like other games. It doesn't use any jumpscares until the end, instead relying on the atmosphere and emptiness to create an underlaying fear of dread. (I have a fear of abandoned structures and this game touched that a tiny bit.) another good thing is the fact that, if you know what you're doing, you can complete the game in under twenty minutes, making it a good cooldown game for in between larger playthroughs in other titles. I also think that for what it is as a stand alone title, it has a tremendous amount of polish and feels more like an individual chapter than a demo.\n\nTo summarize, this game fits in the same category as the Lego Movie. it looks like a cash grab, but it is surprisingly well done and exceeds personal expectations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Poppy Playtime is a horror game where you voluntarily break into an abandoned toy factory to “investigate what happened.”\nSpoiler: *exactly what you think happened*.\n\nYou:\n\n* Former employee\n* No weapons\n* Armed with a glorified grabby-hands backpack\n* Surrounded by toys that look like they were designed by a committee of sleep paralysis demons\n\n---\n\n### The Setup\n\nYou arrive at Playtime Co., which is:\n\n* 90% dark hallways\n* 9% suspiciously cheerful posters\n* 1% “legally safe VHS tapes explaining totally normal corporate decisions”\n\nAnd then you meet **Huggy Wuggy**—a 10-foot blue tube sock of pure nightmare fuel who really, *really* values personal space.\n\n---\n\n### Pros\n\n* The **GrabPack** is actually genius:\n\n  * Long-distance button presses\n  * Pulling objects\n  * Solving puzzles\n  * And occasionally slapping a demon toy in the face from across the room\n\n* Toy factory aesthetic is *too* good:\n\n  * Bright colors\n  * Big mascot statues\n  * Everything screaming “fun for kids!” while the vents scream “this is where people die.”\n\n* Huggy’s chase sequence is the perfect combo of:\n\n  * “Run”\n  * “No, faster”\n  * “Why are there so many vents”\n  * “WHO DESIGNED THIS OSHA NIGHTMARE”\n\n* Short and sweet. You can finish Chapter 1 in a sitting and still spend the rest of the night side-eyeing your childhood stuffed animals.\n\n---\n\n### Cons\n\n* Your character has the survival instincts of a horror protagonist:\n\n  * Sees 7-foot toy statue\n  * Blinks\n  * Statue is gone\n  * “Yeah, I’ll keep exploring.”\n\n* The GrabPack wires are both your best friend and your worst enemy; half the puzzles are “wrap this around that,” the other half are “why did I tie a knot with electricity.”\n\n* If vent claustrophobia and “loud stompy things behind you” aren’t your jam, congratulations: this is your villain origin story.\n\n* After playing, any merch of Huggy Wuggy stops being “haha funny toy” and becomes “I know what you’ve done.”\n\n---\n\n### Peak Poppy Moments\n\n* Watching Huggy slowly lean out from a dark space and realizing the game went from “spooky tour” to “active cardio session.”\n\n* Solving a puzzle and being proud for exactly 0.3 seconds before the lights go out and the soundtrack asks if your affairs are in order.\n\n* Getting lost in the vent maze, turning the wrong way, and running **directly into** the thing you’re supposed to be escaping.\n\n* Finishing the chapter, triggering that final scene, and audibly saying “NOPE” to your monitor like that will help.\n\n---\n\n### Final Verdict\n\nIt’s short, it’s loud, it’s colorful, and it weaponizes children’s toys more effectively than your childhood nightmares ever did.\n\n**9/10**\nWould once again break into a haunted toy factory for zero pay, trust a pair of sentient grab-hands to keep me safe, and find out the hard way that Huggy does *not* do cuddles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game the lore is amazing and its also really fun I hope this revive will win you the steam rewards and for other people to vote for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great horror game, its game play style is amazing, its scary(most of the time) and has a lot of lore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best horror sagas of the 20th century, keep up the good work!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I been really enjoying the poppy playtime games. I been making videos on these games and so far has been really fun and so very scary, but I will say that chapter 3 was the scariest and chapter 2 was kinda scary, and chapter 4 its...alright I haven't finished it, but it doesn't have that same scary vibes the others had.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Eu joguei todos os capítulos e posso dizer, com todo certeza, o jogo é simplesmente incrível! Todos os capítulos tem seus altos e baixos, e por mais que regem bugs (principalmente no lançamento) a história, mecânica, cenário e personagens te absorvem do início ao fim (para mim, capítulo 3 é o melhor entre todos).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For those who were like me and refused to play this game due to the initial controversy, it’s all been addressed, and they’ve apologized.\n\nThis game is not a ripoff of anything. (I’ve watched gameplay of Venge, and it’s different enough where I can say that it's not an intentional ripoff, it’s really an unfortunate coincidence.)\n\nDue to the backlash, Mob stopped selling those NFTs and donated all the money they made off of them to charity.\n\nNobody was bullied to suicide. From what I’ve read, it wasn’t even a bar brawl, but a playground squabble in terms of scale, and they’ve stopped with the one guy it was really with.\n\nLet it go and enjoy this game, this game is excellent! I love the Grab Pack, both just shooting it for fun, and the puzzles with them. The puzzles can actually be challenging, and the popgun sounds the Grab Pack makes when you shoot its hands are sublime. I could spend an hour just shooting them for fun!\n\nFor Chapter 4, don’t let the negative talk about it deter you from it. It has an excellent story, I just don’t understand how it’s bad like some say. It positively contributes to the story, Dr. Harley Sawyer is probably my favorite villain in the game so far, and his reveal was awesome! Doey is one of my favorite characters in the game because he’s so lovable. There was some tedium in the part where you have to get the power running while avoiding Yarnaby, but it’s not as bad when you figure out what to do.\n\nFor the glitches, they’ve patched many of them. Some I’ve encountered are the battery Doey gives you getting stuck in the ceiling, Yarnaby shaking, and the LOD on the ground in this part you zipline across looking bad. (I’m unsure if that’s a glitch or oversight) I’ve done 2 playthroughs and encountered no major game breaking glitches.\n\nDespite this, I still think Chapter 4 is good, and I recommend it. I’m happy they’ve patched so many of the glitches it launched with within 2 months.\n\nMy point is Poppy Playtime is excellent, this is a former hater saying this, so you know it's good. I missed out on something amazing because I was hung up on the initial controversy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend to play this game while blasting your favorite musical theatre songs (mine was wicked)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun would recommend to people buy the toy box bundle for a good deal love the games and cant wait for chapter 5 overall love the games and the games series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game series.\n\nCrashes at startup for Chapter 1: A Tight Squeeze do to compression software that is \"baked-in\" to UE. Can't play Chapter 1 ATM.  Other chapters run without error.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chapter 1: 7/10 great intro to the game short nice story good decent puzzles and scares to start with.\r\nChapter 2: 8/10 Fun minigames, still scary but not too scary and still enjoyable to play. A bit shorter than I wouldve liked.\r\nChapter 3: 9/10 Great art, better puzzles and scarier moments and the most enjoyable environment to explore. And great ending.\r\nChapter 4: 8/10 Its way longer than previous chapter, the story is still great. It feels like 2 chapters in 1 and is definitely the one that made me jump the most. It would be a 9 or even a 10 if there werent as many bugs as there are now. When you have to reload checkpoint 3 times because you are stuck in the ceiling or falling through the map can be pretty frustrating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good kinda hyped for chapter five the fandom made it for little kids even though its for a horror game but its ok!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hororová séria, ktorú som skoro celú prešiel s pomocou youtubu a vážne bavila. Čo dodať, proste úžasné.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a fun puzzle and story game i think if your gonna play you should get the bundle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been obsessed with this game for awhile, and I'm just now getting to play it. I might be biased but its absolutely amazing, great graphics, sound, models, and it runs nicely on my crappy computer. I highly suggest!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game don't be scared on how the first two chapters look but chapter 4 story is pretty mid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun puzzle game although I wish chapter one was a bit longer although I have seen what they are capable of in chapter 2, 3, and 4 and so I would say that this is a well designed, difficult, and just fun game I would recommend it to anyone who likes mascot horror/puzzle games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best mascot horror game EVER. It's better than Five Nights at Freddy's in my opinion too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished the 1st chapter because it was free but I do like the game and the setting as a fan of good mascot horror games, the game has unique gameplay mechanics and character designs that are now iconic imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game! I recommend it and it was fun playing. Me and my best friend laughed and screamed a lot. Also very nice graphics if you play on best graphics. And creative puzzles! Played all chapters!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Other than the fandom being a bunch of 8 year-olds... \n\nThis game is pretty fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful, eye-pleasing graphics, a cool storyline, and quite interesting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game i played chapter 1 and its short but a bit tricky now im on chapter 2 and stuck on musical memory but its FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good chapter 4 is best but if your new to horror games its perfect btw  check out the full series after this best horror game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mob entertainment has done incredible work with this game, but in an odd way\nchapter 1 was an intriguing foray into the seemingly endless expanse of the playtime co factory\nchapter 2 was alright, but it didnt give nearly as much horror as expected, considering the bar chapter 1 had set\nchapter 3 revitalized and gave an immense amount of hope for the rest of the chapters, bringing back the fear that chapter 2 had unfortunately lost quite a bit of\nwith chapter 4, it felt like mob entertainment lost the plot a bit with them having a bit too much packed into the chapter that feels unnecessary",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good and chapter 1 is free and its like a short and good demo for core mechanics but it gets better with the paid chapter with even more mechanics later in the game if you want to see me play chapter 1 check my youtube youtube.com/@thegamerac3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very good game its like fnaf but the animatronics are toys u should play this its worth the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too much hate its so good and its still creepy and not just r34 and brainrot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, this horror game has great lore, and good gameplay. Overall, not that scary though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and scary and it takes alot of brain and smartness",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started with chapter 1 after seeing a video on Youtube about a year ago. And then ordered the rest of the chapters. I like the story, and I want to see its end. \r\nLots of thanks to the whole team behind it !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice horror game chapter one is free but kinda boring and not giving much andrenaline to me personally idk yet ill be back because right now im installing chapter 2 3 and 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game and franchise. I 100% recommend checking out this game and the other ones as they have became my favourite games, The puzzles, the jumpscares, the lore, the ambience and atmosphere are all very good along with the music, story, graphics, plot twists, and sooooo many other good things about Poppy Playtime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game the Gameplay is wonderful and satisfying the intros and monsters so as the qeusts and voicelines are making this game a banger its so interresting i really would recommend everyone to buy all chapter and check this game out and i hope chapter 5 is comming out pretty soon whit more interresting features Thanks Mob Entertainment this game is a whole new Season of horror and Fun ! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but the fourth chapter is still so buggy. For example, during the \"saw scene\" (where the hand was stuck under the map), and during [spoiler] Doey Boss Fight [/spoiler], I was sometimes flung into the air. With patience, I still could finish this chapter, but my experience was not as well as the other chapters. The third chapter is, by far, the best one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really detailed i like how the 3d models are made and how there is so many unique puzzles there were there were zero glitches and there were so much unique lore and chase scenes overall im not going to put every detail but overall it was a 9.2 out of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, interesting storyline, awesome graphics, villains are hot(doctor), characters have a lot of backstory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bEST Horror game ever all chapters are amazing cant wait for chapter 5 and all the lore is intersting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good in the first 2 chapters but now it's more like a puzzle game than a horror game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, I had an extremely engaging experience playing poppy playtime, from the toys/monsters, (whichever you prefer) and the atmosphere of the environments, to the fun gimmicks and puzzles, you will find yourself absolutely sh*tting out your intestines while you play hide and seek with ' expirement 1222 ' ( if you wanna know what that means you'll have to play chapter two ). As well as that, the intricate LLLOOORREEE spans across decades of tragedy, passion, science, and horror, hope you enjoy! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "no. fuckas s toys. id just go home. burn that shi down. not my business. why should i be an accomplice in poppy's crimes? i dont think the devs have the answer themselves. we're there just to suffer. the same could be said about life. life is a truly insufferable and tormentful experience. i picked this game up on a sale, i paid 10$ for this. I could've went to mcdonalds, order myself a big mac menu and still have spare money. Then I could donate the change I got to charity. Because maybe actual orphans need my help and not virtual orphans from poppy playtime's daycare.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a very good game even tho i have chapter 1 and chapter two and not chapter 3 and 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its very peak. at the top for me. just lots of puzzles but overall very much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and scary game! I've made many inside jokes with my bsf with this game since she watches me play it lol. Some of the puzzles are confusing though like the one in chapter 3 with miss delight before anything happens. I honestly dunno how to get that battery in the cage so some puzzles you might need a tutorial for but either way I still love!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is very hard but very fun and i like the backstories the animations the lore and and it makes me have fun when idk what to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Poppy Playtime is a horror game where you must survive in an abandoned toy factory as you're hunted by the vengeful toys where you have to use your grabpack to solve puzzles in order to survive\nGraphics- Good\nSoundtrack- Ok\nAudience- Teenagers\nDifficulty- Not too difficult, but can be challenging at times \nStory- Okay \nGame time- Decent length  \nPrice- First chapter is free\n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "since its free now, i feel like everyone should try this out, the only time i got a bit scared was when he was watching in the red hand part and that puzzle was a bit confusing tbh, like i just could not grab the green thing then i figured out i have to go to the back of the shelf and then grab it but i think thats just me being stupid",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun horror game to play. Chapter 3 was my favorite chapter out of the 4 chapters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game because the thrill of salving puzzles while also in a abandend play store and i love that there was a chase seen!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game.Is a little bit short but at least it's free.So if you want action in a short time it's a very good game.Well if you play it for the first time it will fell a longer game but after you pass it like 3 times it will fell short.\nOverall:8.3/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game should have its own movie, story its very dark actually. Gameplay is not the biggest deal but it's good enough to enjoy it. Waiting for chapter 5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Where it all began... Chapter 1...\nIt's very short and sweet, not much else to say. Fairly strong foundation with lots of potential to grow. Very good glimpse at the animation talents behind the curtain as well with how well animated Huggy is in the vent chase, easily the highlight of this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool horror game, nice puzzle, need to have something else than a peanut brain :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a scary horror game but it is fun i love the design that is why it is so scary i love the game tho fun and it makes me scared i do not recommend that kids 3-7 shode play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very i mean very good game you mind start thinking witch is helping me think better i dont why but since i strating playing this game everything starting changing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is so good but i hate the little ipad kids that just yap about this. they dont actually know how good this game is they just like the characters. great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great but can you guys fix the doey boss fight it makes me like LAUNCH out of the map but anyway its the best horror game ive played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "despite the glitches it updates regularly and patches all the time and the gameplay isgreat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its an amazing game for a first chapter and random youtubers 1 of the best game i have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun good graphigs and scary but when i playd i already knowd everything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Hate horrors and I mean HATE IT but the game is different its scary and thrilling just like every other however the lore and story makes is so addicting please  buy IF you want a new experience and catch up with the insane lore of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "at the end of the day, its just another mascot horror. but i still recommend at least trying it out. i dont play these types of games and there were times it had me hooked\n\nchapter 1 was okay, nothing more than a preview really (i paid 5 bucks for it by the way, i'm still pissed about that)\nchapter 2 was a BIT better, still being nothing special in my book.\nchapter 3 is when shit starts to get real, it's actually quite good and I enjoyed the puzzles (even if i suck at them)\ni have chapter 4, but i have yet to play it. i will update my review when i play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best scary games ever. Me and my siblings and cousins love this game so much. We learn all about the lore which is very interesting. I DEFINITELY recommend to play this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and interesting lore, would play for hours with no breaks and would definitely recommend if looking for at first sight child-like game but actually a game with a deep lore :) Love the characters and electricity tasks.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Second review of the day.\r\nI got past the first glitch/bug by looking it up, I wasn't the only one who stumbled upon the blue hand bug.\r\nAfter that the game went on, but I lost enjoyment because of the bug.\r\nNow I'm at the fight with Doey, it is impossible to play. The moment I use one of my hands, I jump really high and can't get back down. I tried restarting the game, load an older save file. Nothing seems to work.\r\nAfter some searching on the internet, I noticed I'm far from the only one with this problem.\r\n\r\nI find it just embarrassing that this game that has been out for almost a year still has these major issues.\r\nEspecially considering that there were A LOT of complaints about the game being to buggy on release.\r\nThat Mob released it to soon. Guess you didn't really solve the problem.\r\n\r\nMakes me worry for chapter 5. I really like this franchise and the lore, but if chapter 5 is as unplayable als chapter 4. Count me out, I'll watch a let's play on youtube.\r\n\r\nSuch a shame",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Chapters 1-3 are phenomenal. Great environmental storytelling, they run well even on a nintendo switch or cheap gaming laptop, and it's one of the best mascot horror games I've seen\r\n\r\nHAVING SAID THAT. Chapter 4 is a mess. Bugged to hell and back even though it's been years since release: issues with grabpack hands not working properly, batteries just *not spawning* in the Baba Chops puzzle rendering it impossible, Yarnaby clipping through walls, etc. We spent 30 minutes soft-locked due to the Items Not Spawning issue. Finally decided to look up a guide, and lo and behold, our necessary item was not there. Quit the game, reloaded, and it still wasn't there. We can't continue our playthrough, so I honestly can't recommend anyone spend money on chapter 4. Here's hoping #5 performs better because, yeesh. This has really dampened by enjoyment of PPT :/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game seemed fun and when I saw videos on it I wished I had it, not knowing the first part was free. The game ran fine until after I got the second hand where my game felt wrong, the part after you get the hand you need to open a door but it took me around 20 minutes to get the damn thing open. Than after that painful experience I finally got it opned and the next thing you have to do is go through a vent, but my damn thing wasn't respanding to my keys being pressed. I unistalled and reinstalled trying to fix it but nothing worked, I checked the controls and everything was fine so I finally gave up and unistalled for good. This game was extreamly hard for me to play and its not like I have a bad PC either.\n\n3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "absolutely ass game i downloaded it for the first time and my laptop can run any game smoothly but the second i load a game it crashes and also the day i downloaded it my laptop started acting weird  and now i cant access my google account anymore and it randomly opens tabs or closes apps",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is ok, not worth the 20$ the only part I liked was the Yarnaby part and the Doey fight. I would rather pirate it then spend 20$ on a game were most of the game play is filler",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "chapter2 unplayable with any visual settings, even low",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My graphics card got corrupted by this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked the puzzles but the game runs horribly and is buggy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The first game is probably the best and it's really good and the world is still really imaginative but they focused too much on making the story darker and gorier.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Getting stuck in the Doey bossfight, hands stop working properly and then I get shot up towards the sky out of the map, making the game unplayable past this point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is fun BUT the wack-a-huggy is a nightmare it is fun but hard i made a live video on Youtube my name is Dogo gamer and i was in the minigame for 2 hours and STILL did not finish it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't even fucking start playing it since there is a bug at the tutorial.\r\nTried playing the game from different platforms but still nothing changed.\r\nPissed me off so fucking bad i don't even know if the story is good but i don't care.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay-\n☐ Very good\n☑ Good\n☐ Nothing special\n☐ Okay\n☐ Bad\n\nGraphics-\n☐ Masterpiece\n☐ Beautiful\n☑ Good\n☐ Will do\n☐ Bad\n☐ Awful\n\nAudio-\n☐ Amazing\n☑ Very good\n☐ Good\n☐ Decent\n☐ Not too bad\n☐ Bad\n\nAudience-\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Everyone\n\nStory-\n☐ Lovely\n☐ Good\n☑ Average\n☐ Not great\n☐ None\n\nDifficult-\n☐ Just press a bunch of buttons\n☐ Easy\n☑ Significant brain usage\n☐ Easy to learn / Hard to master\n☐ Not so easy\n☐ Difficult\n☐ Dark Souls\n\nOptimization-\n☐ God\n☐ Good\n☐ Normal\n☐ Bad\n☑ Trash\n\nGame Time-\n☐ Short\n☑ Average\n☐ Long\n☐ Depends on you\n☐ Endless\n\nPrice-\n☑ Just buy it\n☐ Worth the price\n☐ Wait for sale\n☐ Maybe if you have some spare money left\n☐ Not recommended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "in chapter three, you can glitch the ms delight chase, but it won't work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I rather get buttfucked by 10 big black men and be put on a leash and get called a good boy while they are spitting in my mouth and I would swallow there cum.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "chapter 2 is imposible at the mommy long legs chase when you have to grapple up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I remember that this game is not free. After releasing Poppy PlayTime 2, the Poppy PlayTime 1 becomes free and  Poppy PlayTime 2 becomes twice of  Poppy PlayTime 1. They only watch for their self, not for customers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doctor part was broken poppy playtime chapter 4",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game good but huggy wuggy no flash sad emoji",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its way to short chapter 1 like 15 minutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "eh, wdym I need to buy the dlcs to finish the story?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this, its fucking ass cheeks bro",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Samaya b agovanaya igra v kotoruyu ya v zhizni igral",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this game ever\r\ni fell out of my chair from a damn dog",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got to one part where you have to hide from yarnabey yet HE STILL GOT ME THROUGH THE FUCKING WALL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not scary because I am a man and not a little boy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why does my game crash when i try to play it?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is trash i cant seem to beat it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it si ferrry hard at teh last leve",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i couldent load chapter 1 waste of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Es una falta de respeto...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my penis is longer than this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is very positive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dis game is buns",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shit game I’m ngl",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the yarnaby part is too hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it is too laggy!!! >:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ts is horrible :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fortnite dude tried to kill me!\r\n\r\n\r\nThat wasn't very cool of him.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "JUEGO DE MIERDA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad mascot horror",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "how to deleate it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Не очень хоррор",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Made for 2 year olds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games wet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "скушно",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "хуйня",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nuh bluh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initially I was very into this game, the game-play was fun and unique, the graphics were on point, the tension was very solid, music was really rad, and I was happy to have bought it. \n\nThat's the part that stings to me, I bought it, at the time the team that makes it said that they would be releasing subsequent chapters at a fixed price if not free. I really enjoyed the game was was excited for the future chapters, but as soon as Chapter 2 came out they made C1 free and C2 was double the price. \n\nThey will always value their profits over your satisfaction as a customer and player.\n\nDon't trust them.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "FOUND A FIX FOR ANY GLITCH YOU RUN INTO BY ACCIDENT FOR CHAPTER 4\ngo into your savegames folder and just delete recent saved game file\n\nso go to this directory\n%localappdata%/ch4_pro/Saved/SaveGames \nthen delete recent saved game file it will look like this\nSaveGame_2025.09.10-08.34.20.sav    9/10/2025  4:35 PM \ndelete just 1 or 2 depending how far back you want to go. Better then starting at the beginning. Hope this Helps\n\nTWO game braking glitches in both chapter 3 and 4 that you need to get a save file for both of them just to be able to play the game without starting from the very start. without the save file there is NO guaranteing the glitch wont happen again in the same spot. The Dog day broke because I died after the final jump and it didn't reset my checkpoint it made me move forward I go up the elevator walk out the level to a pitch black world with no way to continue. And the doctor freeze room didn't reset the hand on the table so now I'M STUCK AGAIN! the fact I have to download outside files from speedrun.com website just to reset a check point is crazy. FIX YOUR GAME PLEASE! don't buy if your not tech savvy enough to reset save files from AppData folder. before you play have the files ready to swap so you don't get yanked out of your game having to research all this nonsense just to play a game you payed for",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "absolutely ass game i downloaded it for the first time and my laptop can run any game smoothly but the second i load a game it crashes and also the day i downloaded it my laptop started acting weird  and now i cant access my google account anymore and it randomly opens tabs or closes apps",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is ok, not worth the 20$ the only part I liked was the Yarnaby part and the Doey fight. I would rather pirate it then spend 20$ on a game were most of the game play is filler",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My graphics card got corrupted by this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Second review of the day.\r\nI got past the first glitch/bug by looking it up, I wasn't the only one who stumbled upon the blue hand bug.\r\nAfter that the game went on, but I lost enjoyment because of the bug.\r\nNow I'm at the fight with Doey, it is impossible to play. The moment I use one of my hands, I jump really high and can't get back down. I tried restarting the game, load an older save file. Nothing seems to work.\r\nAfter some searching on the internet, I noticed I'm far from the only one with this problem.\r\n\r\nI find it just embarrassing that this game that has been out for almost a year still has these major issues.\r\nEspecially considering that there were A LOT of complaints about the game being to buggy on release.\r\nThat Mob released it to soon. Guess you didn't really solve the problem.\r\n\r\nMakes me worry for chapter 5. I really like this franchise and the lore, but if chapter 5 is as unplayable als chapter 4. Count me out, I'll watch a let's play on youtube.\r\n\r\nSuch a shame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game has so many bugs ı cant play yarnaby ıs teleportıng sometımes and devıces or machıne are not workıng pls dont purchase",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Chapters 1-3 are phenomenal. Great environmental storytelling, they run well even on a nintendo switch or cheap gaming laptop, and it's one of the best mascot horror games I've seen\r\n\r\nHAVING SAID THAT. Chapter 4 is a mess. Bugged to hell and back even though it's been years since release: issues with grabpack hands not working properly, batteries just *not spawning* in the Baba Chops puzzle rendering it impossible, Yarnaby clipping through walls, etc. We spent 30 minutes soft-locked due to the Items Not Spawning issue. Finally decided to look up a guide, and lo and behold, our necessary item was not there. Quit the game, reloaded, and it still wasn't there. We can't continue our playthrough, so I honestly can't recommend anyone spend money on chapter 4. Here's hoping #5 performs better because, yeesh. This has really dampened by enjoyment of PPT :/",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i paid for this and now its free... i would recommend if paid players got another chapter for free.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "chapter 4 is utter dogsh!t the amount of  glitches insane. If u asked me the first time i played this i would have loved it. On my second play through on doeys fight because of a specific glitch that throws u out of bounds u CANNOT play istg",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "chapter2 unplayable with any visual settings, even low",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I liked the puzzles but the game runs horribly and is buggy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The first game is probably the best and it's really good and the world is still really imaginative but they focused too much on making the story darker and gorier.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Getting stuck in the Doey bossfight, hands stop working properly and then I get shot up towards the sky out of the map, making the game unplayable past this point.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is fun BUT the wack-a-huggy is a nightmare it is fun but hard i made a live video on Youtube my name is Dogo gamer and i was in the minigame for 2 hours and STILL did not finish it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't even fucking start playing it since there is a bug at the tutorial.\r\nTried playing the game from different platforms but still nothing changed.\r\nPissed me off so fucking bad i don't even know if the story is good but i don't care.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is quite literally a bendy and the ink machine clone and is actively making some of the same mistakes as the makers of that game were doing. Also it's an incredibly buggy game and I don't find the lore to be interesting enough. I find the puzzles to be very frustrating too it's also just not my style of game. Like there's a few really tense moments in this game, but I don't think it evens out the frustrations I have while playing this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this might just be my pc, but it didnt run very well and teh batteries glitched so i couldnt finish ):",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bug bug and bug... played total 3 hours and the last checkpoint got stuck.. cannot enter the building(school) ~already take key>go inside school>game crash>load last checkpoint>key gone>cannot enter again.. nice",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay-\n☐ Very good\n☑ Good\n☐ Nothing special\n☐ Okay\n☐ Bad\n\nGraphics-\n☐ Masterpiece\n☐ Beautiful\n☑ Good\n☐ Will do\n☐ Bad\n☐ Awful\n\nAudio-\n☐ Amazing\n☑ Very good\n☐ Good\n☐ Decent\n☐ Not too bad\n☐ Bad\n\nAudience-\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Everyone\n\nStory-\n☐ Lovely\n☐ Good\n☑ Average\n☐ Not great\n☐ None\n\nDifficult-\n☐ Just press a bunch of buttons\n☐ Easy\n☑ Significant brain usage\n☐ Easy to learn / Hard to master\n☐ Not so easy\n☐ Difficult\n☐ Dark Souls\n\nOptimization-\n☐ God\n☐ Good\n☐ Normal\n☐ Bad\n☑ Trash\n\nGame Time-\n☐ Short\n☑ Average\n☐ Long\n☐ Depends on you\n☐ Endless\n\nPrice-\n☑ Just buy it\n☐ Worth the price\n☐ Wait for sale\n☐ Maybe if you have some spare money left\n☐ Not recommended",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I rather get buttfucked by 10 big black men and be put on a leash and get called a good boy while they are spitting in my mouth and I would swallow there cum.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "chapter 2 is imposible at the mommy long legs chase when you have to grapple up",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I remember that this game is not free. After releasing Poppy PlayTime 2, the Poppy PlayTime 1 becomes free and  Poppy PlayTime 2 becomes twice of  Poppy PlayTime 1. They only watch for their self, not for customers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cant move the craine to move The dinosaur guy at all even when i Charge it no one should play this Fix your game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "doctor part was broken poppy playtime chapter 4",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game good but huggy wuggy no flash sad emoji",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is buggy as hell, I don't recommend this at all",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its way to short chapter 1 like 15 minutes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "eh, wdym I need to buy the dlcs to finish the story?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this, its fucking ass cheeks bro",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Samaya b agovanaya igra v kotoruyu ya v zhizni igral",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tall Blue man Tried to Hug me For some Reason, he Was not very Scary",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont play this game ever\r\ni fell out of my chair from a damn dog",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "got to one part where you have to hide from yarnabey yet HE STILL GOT ME THROUGH THE FUCKING WALL",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it wont let me play it gives me 2 frames a second",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i couldent load chapter 1 waste of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Es una falta de respeto...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is very positive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dis game is buns",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shit game I’m ngl",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i ate a cheese and i died to buggy wuggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the yarnaby part is too hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it is too laggy!!! >:(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ts is horrible :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fortnite dude tried to kill me!\r\n\r\n\r\nThat wasn't very cool of him.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad mascot horror",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Не очень хоррор",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "games wet",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "diddy blud",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuckass",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}