{
  "positive": [
    {
      "review": "I can play this game vs CPU only all night long hahahaha....Nostalgic experience (Budokai Tenkaichi 2 and 3 player hehe)...overall is a great game...not sure regarding the online content tho, im not really play online matches cuz i know its unbalance..well..it should and must be unbalance tho haha....n i dont really care about that....",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "Price is way too high for what you get, but it's a really solid and fun experience. I'm not even a die-hard DragonBall fan and I still enjoyed the gameplay. Charging up and movement feels good. Sound design for attacks and voice acting is also not bad. Really the major issue is the price, which doesn't include all the DLC packs. The character roster is also lacking a bit. It might seem like a lot at first, but if you take away all the various transformations, you're left with a lot less than you think. The DLC characters are fun and not overpowered compared to the base game content, but it's hard to say it feels \"worth it\". Overall great game but get it on sale if you can.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Dragon Ball: Sparking Zero has amazing visuals, and the story was a ton of fun to play, especially the “What If” scenarios. However, the game was dropped by the developers pretty quickly, and the DLC adds nothing but new characters. This game is a perfect example of how quickly a title can fall if the developers care more about money than the game itself.\n\nIt’s still fun to play with friends, but it’s definitely not worth the price tag—which pains me to say, because I’m a huge Dragon Ball fan.\n\nGame 5.5/10\n100 % 7/10",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I love Sparking Zero. That's why this hurts. This game could've been something incredible. The foundation was there from day one! However the Devs waited too long to fix obvious balance problems, and by the time those updates finally hit, the community had already died out.\r\n\r\nToday in my opinion the game is fantastic... but it's too late. The customisation we were promised was never expanded, the roster all be it big never grew the way fans expected, and online is a ghost town unless you bring your own group. It's wasted potential in the purest sense. Fun with friends, but heartbreaking for anyone who hoped for longevity.\r\n\r\nSolid 7/10",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "As someone who grew up sinking countless hours into the Budokai Tenkaichi series on my cousin's Play Station 2, Dragon Ball: Sparking! Zero feels like coming home after years away — only to find that everything you loved has been rebuilt with modern power while preserving the soul of the originals. Its a nostalgic comeback done absolutely right, with so many characters to play as, you will not know how many hours you have sank in once you start the game. Whether you’re a returning fan chasing nostalgia or a newcomer looking for the ultimate anime fighting experience, this game delivers in every department. It's a solid \"OVER 9000 !!!\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Content is lacking, and PVP is awful. This game has charm though. Don't be fooled, this is a great 30 hours of Dragon Ball, but nothing more.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of The Best Games Of DBZ For sure. If you were ever a fan of Budokai Tenkaichi Series, you would love this one for sure",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "TL;DR - Worth it for fans of arena fighters and Dragon Ball. Gameplay feels good and it features many (but not all) fan favorite characters. Worth it on a decent discount. \n\nNow, here's the thing - I've been a fan of Budokai games since the PS2 era, and they give some nice memories. \n\nSparking Zero is a modernized Tenkaichi (Sparking) game, with updated graphics and combat mechanics. \n\nThe combat feels fluid, with a few game patches it has gotten a lot more balanced so it can be good fun for competitive players. \n\nIt can also be played P1vP2 locally, so the level of fun pretty much depends on you. \n\nThe soundtrack is decent but the anime tracks that you have to purchase individually if you don't buy the Deluxe+ are extremely overpriced.\n\nNow the mixed : Online play is connection and FPS dependent, so if your opponent has 40 FPS and you 60 your game will feel like a slow-motion movie. The story mode is quite basic and some characters don't even have complete sagas for them (e.g. Vegeta doesn't even explore most of the Super anime), and there aren't that many cutscenes - you might get some title cards and some overlaid text - the Narrator is also not there most of the time.\n\nYou can create Custom Battles as well, but it takes a lot of effort and it might be for you, it wasn't really for me.\n\nSo the single player modes are kinda lacking, and the main focus is on multiplayer/online play.\n\nAnd the main problem of the game is exactly there: the competitive community. People will try to do anything for a win of imaginary worthless online points : exploit the game, lag-switch, disconnect so that they don't lose points.. Unless you can handle such levels of toxicity and \"stress\", I recommend playing with friends/family for fun. Every online game mode of the game (even Player/Unranked match) is extremely toxic 90% of the time.\n\nSo why do I recommend it?\n\nAt the end of the day it's Dragon Ball - a great nostalgic feeling comes when I start it up, it looks good, runs good and even against the CPU it can be a fun challenge. On PC you also get the option to add mods to further increase your enjoyment.\n\nIt could've been great, ended up being good. Good enough, I guess.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is very fun and there is a lot o do. If you want to collect all the items in the shop or complete the story, the fun never stops! The only things I would fix is that in story there are a lot of fights missing but the characters are still in the game, A good example is Broly. He is a playable character but you don't fight him in the story mode.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DBZ Budokai 4. Classic DBZ Budokai, but upgraded to modern graphics and smooth gameplay. Tons of fun to be had here, OP combos, and a decent story mode.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "bratushkas. amazing game, better than cs2. no tilt, full tits, C18 <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best dragonball game every it just needs free rome like dragonball z kakorat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun game if like Dragonball Z the character roster is impressive. Wish had some more game modes tho. Also online/ranked play definitely is a learning curve. That's not really a knock just expected this applies to mostly all games especially fighting games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, good modern throwback to the budokai series. Online on pc is a bit dead at the time of writing this, and the online matches are pretty cancerous as everybody just chooses to abuse high tier characters. Other than that i have zero complaints, game is well made and looks amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Could've been the best Dragon Ball game of all time if the devs just did more and Bandai wasn't the most money hungry and greedy company ever. The DLC characters for the game are very cool and i've genuinely had fun playing with most of them, but... is that really it? No maps? No new story line? Just a few characters and that's that i guess. It's like they cut the support for the game after all the main development finished. But despite all of the complaining i've done for the game, i recommend it if you're a Dragon Ball fan. You should just wait until the game's on sale and don't even bother with the DLC",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The battels are exciting and challenging. The story missions are fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't know why people complain, this game is beautiful, makes you feel the battle to the bone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game, but I fucking hate how it framerate locks my game even though at standard, it should be running a smooth 60fps. I have to get a goddamn mod to unlock the fucking framerates, which is horseshit (Bandai you jackasses) but hey, at least I get to play as The Legendary Super Saiyan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game would play again just involves a lot of grinding for the best characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Panders a little too heavily to Super story lines for my liking, but I also understand why they did it like that. Still, the same 2-3 fights done about 2-3 times per character is a little retarded and makes me hate doing those story lines. Still, the game is overall great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visuals and Gameplay are great, it needs more single player content though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't really like fighters and before this had come out, I was very new and barely just getting into DB. This is one of the best 3D \"spatial\" fighters, ever. DB games seem to get prettier and prettier with every new entry. 9/10!\n\nThere are a lot of overly-harsh criticism on Sparking which doesn't feel too warranted. For example, the first DLC was amazing. Of course, a new map would've been great but the characters from Superhero made up more than enough for that. DLC 1 was also a little too expensive but in general, there's more positives than negatives.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a good game with great graphics and mechanic. the only issue for me is the online, it's either dead or filled with ragequitters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game was so fun to play with friends thx for the memories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed spending my time playing this game, it is fun and engaging, the gameplay is fast paced and the graphics and animations are stunning. However you can't help it but feel that it hasn't reached the potential it deserves, for example the story has introduced alternate realities where the events are different from the original story, I honestly think this is very innovative, but the problem is that there aren't enough of them, a lot of stories are just slideshows, and it doesn't look like every character has had the same effort put into making their stories. Online with randoms is not that fun as I personally don't like sweats in party games like this one. CPUs are too easy and predictable except for the occasional limited-time Legendary Warrior Face-Off mode, and the most important thing is that there isn't enough customisation for the characters, if you open character customization menus the vast majority of them have empty slots, and the few that have customization options only have like between 2 and 5 basic clothing options. All in all, i'd say this game can be a lot better if the devs listen to what the players are asking, but it's still good and deserves some love and appreciation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am recommending this game because it is great. The story is good, and canon to the manga and anime. The combat is also good, you need to time some of your moves, which makes it even better! But, I genuinly(sorry if i spelt this wrong) think that this game should not cost 70 dollars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay wise its on par with or a bit of a downgrade from Budokai Tenkaichi 3, the movement feels off but its still fun overall. While the roster is larger than ever in the series the lack of OG DB characters is kinda disappointing. The \"what if\" story mode is fun tho but also kinda lazy and playing against the CPU is definitely a nostalgic experience.\n\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An excellent successor to the previous Budokai Tenkaichi (Sparking) games and this one is also pretty easy to learn but hard to master. Though deep inside I kinda wish it had more refined story cutscenes and exploration from Kakarot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic DragonBall experience! Could use more gameplay tho and I still reccomend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FOR STEAM DECK USERS:\n\nPlease read this carefully. Dragon Ball Sparking Zero is perfectly playable on a Steam Deck with some caveats:\n- we'll be setting it at 40FPS;\n- no online play.\nIf you don't mind it, then let's get to it.\n\nSo the game runs at 60FPS and the frame drops are frequent and very evident. If we lock the game at 40FPS, it runs much smoother. I did it through this YouTube video:\nhttps://youtu.be/FS-axZmssBE?si=0iGASNGVgFyUKZZG\n\nThese are my graphics settings on the actual game:\nResolution scale: 85\nV-sync: Off\nAnti-aliasing quality: Medium\nShadow quality: Low\nTexture quality: Medium\nPost-processing quality: Low\nEffect quality: Low\nDepth of field: Low \nLOD quality: Medium\nGrass quality: Low\nMotion blur quality: Low\nCamera shake: Low\nDestruction effect quality: Low\n\nNow, for the actual review:\nThe game is pure cinema. It is beautiful and the action is exactly what a Dragon Ball game should be. Gameplay is awesome and it expanded on BT3, which is great in my opinion. However:\n- the content is short, as the game seems to be focused more on online gameplay, which is a shame;\n- only 8 fighters per tournament (excluding teams);\n- cutscenes in the \"story\" content are ugly, in my opinion - the way the characters move is off (reminds me of Sonic 06);\n- what if scenarios are actually interesting.\n\nThe first 10-15h were so exciting to me. But now I'm bored of the game. It lacks single-player content and for that reason I don't think the game can be higher than maybe a 7/10. It's a difficult one to rate for nostalgia reasons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Full disclosure, I'm terrible at fighting games so I got my ass beat a lot and my only real exposure to Dragon Ball was the Abridged series by Team 4 Star. Having said that, I still had fun with all the different campaigns aside from the difficulty spikes that popped up every now and then.\r\n\r\nWould've liked a campaign for Cell though, or Trunks missions during the Cell Arc. Bit of a missed opportunity on both of those accounts tbh.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice game with good graphics and it continues path of Tenkaichi saga just better graphics more characters, bigger story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good, the animations are almost the perfection. This game is perfect for some fun battles with friends. The ranked mode could be better there is no doubt but if you really love dragon ball the game is really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Liked the game just the only thing I disliked was the fact that they say its 200 characters plus its really the same character just in different forms I don't think that should count not when there where way more real different characters in the previous games still fun to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sparking Zero is a very fun game to play with friends, it's beaufitul, and it feels like a great representation of fights in Drago Ball. I'm not typically someone who enjoys traditional fighting games, but I really enjoyed this one. \r\n\r\nAs far as negatives go, the UI is annoying to navigate, the story mode is severely lacking, and learning how to actually play the game is challenging. As someone whose never played the original Tenkaichi games, I had to loook up a lot of outside resources to actually learn what to do. The training mode teaches you what each of the buttons do as well as some basic combos, but the game is significantly more in-depth than the training goes into.\r\n\r\nOverall, I really recommend this game to Dragon Ball fans, even with some pretty blatant downsides.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is awesome with amazing graphics and mobility.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good best dragon ball game i played other than xeonoverse 2 top two for sure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fantastic and my favorite dragon ball game of all time! Glad to finally play the budokai/sparking games :)\r\n\r\nHope it gets more updates again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good but just not for me, I like more story than pvp so yeah if you like story more get another Dragon ball game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Controls are a little difficult to get the hang of but its good other than that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so i got this game because i was a fan of dragon ball and there series the stuff that is wrong with this game is its not worth the price the combat is a lil stuffy and the game is really hard when u first get it they dont really explain anything on the tutorial but to block and hit i recommend to make the bot on easy and train with counter if possible but i rate this game a 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent fun fighting game for fans of the anime and Bodukai series from the early 2000's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is one of the most exciting and visually impressive Dragon Ball games I’ve ever played the combat feels fast, flashy, and true to the anime. But as good as it is, it really needs crossplay, more content, and voice chat to reach its full potential. crossplay would make it easier to find matches and play with friends no matter what system we’re on, instead of being limited by platform. Adding more content like characters, maps, and modes would keep players engaged long-term. Voice chat would make online battles more fun and social. The game has so much potential but the Devs are selling so hard. They Need to update this game like Dragon Ball Xenoverse 2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Offline/Single player review: As usual, mods save this game. Really enjoyable to recreate your own what if battles. The story on here seems half baked. \r\n\r\nIt's worth it if you like the Dragon Ball Franchise, but don't pay more than half price for the ultimate edition. You won't need the paid music packs either",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "500 Hours in and I can't get enough. This game is fantastic. But its not perfect, either.\n\nLook, if you played and enjoyed Budokai Tenkaichi 3, you'll feel right at home with this game! This is truly a faithful sequel for the Budokai Tenkaichi series, and I've enjoyed this game since day one.\n\nThere are some serious shortcomings from the Developers, such as lack of maps or single-player content, but to fight other players online and feel that raw, dragonball experience I've been missing since BT3 -- They are shortcoming that don't personally bother me in the slightest.\n\nThis isn't the end-all, be-all Dragonball game that people were hoping it to be. If you want a competitive fighter, pick up DB FighterZ. If you want a more robust single-player experience, go for Kakarot.\n\nIf you want to relive your childhood memories and enjoy some of the most iconic characters, both old and brand new, you should pick up this game. Or wait for a sale. Yeah, maybe wait for a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ranked can be pretty hard, but if you get good its actually pretty fun. i suggest do the in game training (serious stuff in there) then youtube videos.\r\n\r\ngraphics are insane too i feel like im in the anime.\r\n\r\nalso, theres a decent amount of characters now AND theyre gonna add even more so thats really cool.\r\n\r\neverything else is meh.. (story mode (only bc they havent expanded on it), tournaments, Legendary Warrior Face-Off, custom matches)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So there's ten kaichis, but ... there's four of the games series. Four hundred kaichis a bit ridiculous. \nCan't go wrong with the old formula, I miss Raging Blast too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cause youre saiyan i love how strong you are your strength grows after each match shenron couldnt wish a better man i wanna cater to Gokuuuuu W game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "regardless of what you think of the content sparking zero is the best game in the BT series and if lack of content is a problem that's why we have mods.  the game is good obviously isn't perfect but the hate for the game is cope get over it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty fun dragonball game. gets old relatively quick though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of if not the very best in the DBZ franchise, the mechanics of the characters and the shear roster size of the game spanning over 200 characters is legendary.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for the like 2% chance that anyone is reading this PLEASE HELP\r\nEVERY 5 SECONDS THERE IS A FLIPPING BUG I HAVE DONE LIKE 8 BILLION DRIVER UPDATES REINSTALLED TS LIKE 9000 TIMES I JUST WANNA PLAY\r\nEVERYTIME I FIX IT IT BREAKS LIKE 3 DAYS LATER \r\nPLEASE MAN  I LOVE THIS GAME BUT BRO SOMEONE PLEASE HELP ME",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "good.....gets boring fast tho if you dont have any friends to play with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can see myself having fun with this as a huge DBZ fan while playing through every possible 1v1 scenario and fidgeting with the ultimates and other abilities and transformations. I do not see this as a long term investment though, ill probably put in a few dozen hours into it, then come back every once in a while through the year and 2nd year for like an hour or two a month, thats it...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game play with friends and remember old days when u come home sit and chill with BT3 with is now Sparking zero.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love how awfull is the multiplayer matchmaking and the fact that the player VS bot is actually difficult and challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's quite fun to play this but better with another person to battle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the number one dragon ball z like this is right, hopefully we get that last up that makes everything much explosive smoothness",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fighting mechanics are super deep, but it's a lot of fun if you put in some time to learn them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very exspensive very fun overall great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "benjamin netanyahu made me spend $150 on this game on release just for me to play for 4 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Animations are crisp, cutscenes matching the original mixed in with Sparking! episodes keeps you locked in and retrying to hit the objective. Overall, I loved DBZ since Budokai first came out, the mechanics are smooth, every character has their own style through and through. I'm hooked lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a game I find fun and one I've waited my whole childhood for",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "suddenlyyy, life has new meaning, to meee! thats beauty up above, and things we never take notice of..\r\nyou wake up and suddenly, youre in love",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game reccomend to mostly play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have mixed feelings about this. Budokai Tenkaichi 3 is one of my favorite PS2 games and Sparking Zero is a worthy sequel on the combat gameplay and roster size aspects. However, the AI sucks and there are only two offline modes: Story and World Tournament. The story is fine with terrible slideshow cutscenes but interesting what ifs. The world tournament mode is less fleshed out than the previous game as you can only ever have tournaments with 8 opponents  -- 3 matches total. There is no Survival, Mission 100 (custom battle doesn't count), or Sim Dragon. So many characters and fun mechanics yet nothing to do with said characters beyond vs mode... I hope the next DLC gives us more offline modes instead of just more characters and stages. Recommend on sale or if you have friends to play with,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highkey really fun on steam cuz of the mods, im a casual and barely touched rank and i do not reccomend it, but if your not lonely this game is really fun with friends. the story is really cool if you watched the show, and i have never gotten bored with friends. (or just play fighterz its better)\r\n\r\nBEST MOD IS SPARKING OMEGA!!!! https://gamebanana.com/mods/download/609415#FileInfo_1556056",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gran juego. Considero que cumple. Es como los antiguos pero  actualizado, obviamente falla:\r\n- Salió incompleto claramente\r\n- Faltan modos de juego (completás la historia y solo queda el online)\r\n- Faltan trajes para los personajes (áuras, accesorios, ropa, etc.)\r\n\r\nPodrían agregar mas cosas pero a mi me gusta jugar cada tanto con la maquina o meter unas partidas cuando viene algún amigo. El online anda maso, pero cumple. Podría estar mejor el juego, es una pena, pero bueno.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play if you have friends over a lot or another friend to play with online.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't believe the hype, Don't believe the hate. This is a classic edition to the Dragon ball Game series. OG tenkaichi Fighting with overly simplistic game modes. It is fun and the best Dragon ball edition since the originals. Issue is DLC and the content within. You are buying the characters, that is it. Which are pretty powerful for online. Overall, get this when it's on a deal and wait for the next game.\r\nThis is a recent favorite and worth the price of admission.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very epic fighting game lots you can do in this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is very intertaining and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it its dynamic and visuals are sparking",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a what if and it is epic",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ii sucks that the game fell off. it had so much potential",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i VAPORIZED a young child (goten) as emperor of the universe, 10/10 would do again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game that you should atleast try",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stunning game - hope for more content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome and is playable / works on Steam Deck!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is super!! Totally fun! i recemend to my fellow weeb's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "semi perfect cell looks like my dastardly hated stale friend riley",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not bad game to be honest just died after a week of release",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "single player is very good. online is bad. 8/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is Super Saiyan God mode.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best dbz game in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "didnt enjoy at first but is great with mods",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for simulation",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I beat reptvle at this game all the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If your a huge DBZ fan then this is the perfect game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its laggy on steam deck but pc amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best dragon ball fighter game out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game Kool. Got better overtime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly just rip kinda sad it turned out like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty nice. Shame is already dead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes (no explanation needed, W game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game and dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DragonBall Sparkling Water",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Basically Budokai Tenkiacchi 4",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The story mode is good",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I don't regret pre-ordering the ultimate edition of this game, as I genuinely had fun within the first week of its release. I truly believed, at the time, that we had a dragon ball game that would last us a generation, and be a milestone within the dragon ball community. \n\nI, along with many other people who believed in this game, turned out to be wrong. I cannot recommend this game because its developers do not believe in it, because simple tweaks and additions, like costume changes and quality of life updates that would make the custom battle maker actually usable, are still not added even a whole year after release. Instead, what we have gotten since then are DLC characters, and not even all of them either.\n\nIt is not worth the money, even on sale, and if the people who made this game don't wanna put in time and effort into making it better, then why the hell should anybody do the same when it comes to playing it? \n\nThis will not go down as a generational DLC game, it will go down as a generational disappointment, and I am tragically glad that Akira Toriyama is not alive to see what his IP has turned into.",
      "voted_up": false,
      "votes_helpful": 119
    },
    {
      "review": "GREEEEEEED BLACK FRIDAY SALE 40% off and  you raised the price so its $60 youre game is already fucking dead and you pull this shit i had around 6 ppl ready to dl it and you guys fucked it all up FUCK YOU for messing this game up.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They've patched out all the fun from this game. You can't combo into a super attack anymore, they nerfed the the damage too hard for that. You can't just shoot out a super without a combo, the AI will just teleport out of the way.\n\nEven before the patches, the AI was too teleport happy. It's difficult to recommend the game in the state it's currently in. I hope that for season 2, they reverse some of these decisions so the game can be fun again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is fun until you realize how unfinished it is\n\nCombat:\nIt's been a year and this game is still buggy. The game has many great mechanics, but I can't name a single one that works as it should. The controls are clunky and limit the player artificially. You even have to use a workaround to do an emote. The game punishes you for trying do develop your own playstyle. And the playerbase is the worst I've met so far. It's gotten better with recent patches, but as soon as you leave B rank, players still do everything but learn the game to get their win or rage quit if they don't\n\nGraphics:\nThe best any Dragon Ball game ever looked. But some animations aren't finished, which makes this game look inconsistent. Many Super Attacks have weird pacing. And there's lack of detail in some areas. For example the particles on Genkidama are too few and move incorrectly. And many attacks lack impact\n\nModes:\nWorld Tournament mode isn't finished. Characters ringout themselves when too close to the ground. The game added team tournaments with individual eliminations.. but characters don't get eliminated from the team. Overall tournaments are too small. This mode might be great if it ever gets fixed. Being able to customize tournaments is a  great addition\n\nCustom Battle lacks.. customization. The event system is limited. This mode really needs to be extended\n\nLegendary Warrior Face-Off: either make this mode available permanently as a Bonus Battle or completely remove it from the game\n\nThe Tag Team mode from the Switch version hasn't been ported to the other platforms\n\nStory mode is fine. It's not great, but it has its moments. Still better than BT3's story mode. It's not the mode where you spend most of your time. The way it's implemented makes sense for Custom Battle mode\n\nCharacters:\nMost characters move the same, have the same ki blasts and often even reuse animations. Some movesets are incomplete. At launch, the animation of DBZ Broly's grab super was clunky. Instead of fixing the animation, the devs just moved the camera so you can't see it. Goku is the only character who has [his version of] Roasie's Super Attack. She a generic Super, the same Super again with a different cutscene and a reused Ultimate\n\nRegardless some characters are very fun to play as. Roshi, Goku (except Daima Mini), Mr. Satan, Majin Vegeta, DBZ Frieza, Dyspo, DBSH Piccolo, Androids and most 2-3DP characters actually play different than most characters. You just won't see much of it because of the player base\n\nOffline content:\nlol\n\nConclusion:\nOnly buy if you're a hardcore Tenkaichi fan or the game is on 50% discount or more. Or wait another 1-2 years until the game is finished. Most of the patches so far were great\n\nAnd don't buy the Ultimate Edition. It's literally just what it says. The Super Attack isn't even good",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is the definition of disappointment. Between mechanics that rely more on connection than timing, inputs that do not register half the time, the half baked roster, and a lack of game modes, maps, and ESPECIALLY cosmetics, this has to be one of the worst cash grabs ever. So glad my ex girlfriend bought me this game so I didn't waste a single cent on this piece of garbage. Ranked isn't even fun. Half the time the match ends because the timer hits it's limit, and you end up losing when you can clearly still win. No rewards or titles or anything either. Bandai, I hope you go bankrupt you garbage company.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TL;DR: The game is not bad, but THE ONLINE SCENE IS DEAD. Buy it only for local MP or the single player (which isn't anything special).\n\nWait for discounts, not worth 50€, much less 70€. It's barebones Budokai Tenkaichi 2, electric bogaloo.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "DLC is trash only adding Daima character and not worth the price for it, they don't add new maps or costumes or anything. Game get repetitive and stale after awhile; one of the most impactful and influential anime is not given justice with the stories instead its a png slideshow with cut content, would understand if that added more what-if stories but you get a few of them and their not that memorable or good. Roster is mostly just copy and paste character with a little variety and transformation to bloat the character count. \n\nCombat and visual are great but that's it, online is broken/ laggy and mostly dead, no cross-play in 2025, nothing to keep you playing, after a few matches you played them all\n \nWASTE of money, i regret buying not worth the price get it under $20!. Game had great potential but they fumble the bag with half ass support to it post launch",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is so bad the timing on vanishing is so laggy combos are so laggy button inputs are laggy wtf happened to this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I spent 1/6 of my monthly salary on this, to get a game worse than a nearly 20-year-old previous installment. The graphics are obviously better, but the gameplay is not. And online feels terrible, the input lag is unbearable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had so much expectatives, they were not delivered, Budokai Tenkaichi 3 is still better",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "waited 17 years for the next one for it to have less characters, maps, modes, and 0 support avoid until they feel like finishing the game or they make a sequel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game mechanics are horrible db kakarot was 100000000 times better the dodging is never works the counters never work i give this game like a 3 because nothing works like it should they should have used  the same mechanics from kakarot the story mode isnt even a story mode is just a bunch of garbage...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the only thing keeping this game afloat for me is the modding community and even that is slowing down a ton. DONT BUY WASTED POTENTIAL",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Despite playing the previous game, this game is not fun and too repetitive, better to play dragon ball z kakarot",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "general combat is just bad, story is boring af and far too quick tbh kakarot was a better game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly around launch and for a while after the game was fun, while not perfect it had potential that needed fostering. A patch or two fixing a fair few complaints while dozens others lie untouched. The customization is lacking, the story while fun at times, just isn't all that fun or engaging. \n\nPlayer counts are low, as of writing is at about ~650 players. You're lucky to see over 1k on the weekend, and all of those that remain generally have the game down pat. So even when you finally get a match, chances are that if you're new to the game you're going to get obliterated. While common for fighting games this is not FighterZ, this is a party fighting game best played with friends either locally or in a call together. And if you've got friends who are willing to buy and play with you then by all means I say go for it. You'll probably have a good time so long as you play together.\n\nNot to mention the lack of single player content. The story missions skip over large portions of the story for each of the scant few characters to choose from. On top of that in-order to get the \"what-if\" sparking episodes you have to complete it's corresponding main mission in a certain way. The game *will not* tell you what that particular episode needs until *after* you've already done it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Probably gonna sound like ragebaiting but it's not\r\nDon't get me wrong graphic style is lovely but thats not why we''re here, we're here for fighting and eh sure we got that kinda, it's just very MEH, cutsecens that is literally a Powerpoint that just skips quite literally THE BEST PARTS OF THE WHOLE DRAGON BALL LORE STUFF and if there is somewhat a cutscene it is just a frozen ragdoll with only the mouth moving up and down thats all\r\nGotta say Xeno 2 got more animation put in with cutscenes and actual have a well fighting mechanisim.\r\n\r\nMy score to this game: 4.5/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game looks good but continunes bandis weird thing art direction thing where there realsitc ish backgrounds with cell shade characters which leaves this game with a weird feeling. The old games already have issue with how the controls were and they add more buttons and (when I played at least)  there was no way to set up custom controls and both layouts left me wanting. The game is really just a big toy box to smash all you're favorite characters but there no OG dragon ball which keeps being left in the dark. A lot of this template to them of one buff, some kind of beam a chase then their ultimate moves/transformations which leaves a lot of characters even when functionally different feeling the same. The game uses the same difficulty curve as previous sparking games which leads to half fun toy smashing and half \"what the fuck how are you even supposed to do this\" single player content. I do think there is a place for this game/ this type of game but this jsut isnt it for me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you’re a huge Dragon Ball fan, I would only get this for the story. This game is unfair in my opinion, very laggy when playing ranked, and it gets too boring. Save your money for the next project in the meantime, I’ll be on Xenoverse 2.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a casual player with a 9 to 5 job, this game is trash. I’m a big Dragon Ball fan, but playing online feels painful. 95% of the matches are against sweats, and trust me there’s zero fun in that, If you like dragon ball just mod the game and play it offline...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is dead. Shit updates, Half of the players in ranked are spamming some shitty cheese strat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I cannot understand why this game is popular.\nThe controls are sloppy, the inputs have so much lag that it feels like I'm in another room and all the characters work the same.\nThe only good things are that the art style looks nice and it's dragonball. But compared to other dragon ball games this is just trash.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It was good in the beginning, but after waiting 30 minutes to get a rank match against the same 3-5 players in a week, and 95% of the time getting a laggy and delayed game. IM DONE. TRASH GAME.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's not horrible, just boring after an hour or 2. It's marketed and made out to be BT4, but in my opinion if this is a sequel the BT3, it's a downgrade. Only certain characters have alt costumes, rush attacks have been nerfed, beam attacks are nerfed, the AI blocks any and everything to the point it's boring to get through a fight half the time. The roster ranges from nice to meh. I play it and honestly I just wind up hopping back to BT3. Hell, even RB 1&2 are more entertaining even with their whole annoying challenges to unlock characters nonsense.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i played it for a bit but the person who gifted me it got outed as a pedophile  so i dont like this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game was good but overall disappointing a lot of ppl did not get their moneys worth and for that I can't blame them for being mad BUT this game got me into Dragon Ball so I cannot help but thank this game. Only play this if you already like Dragon Ball and The Tenkaichi series.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3 stars base game, 3.25 with DLC. 5 stars if you mod skins on all the characters",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game lacks so much in content, after you finish the story mode of each characters that's basically it from the offline. The DLCs do include extra characters but that's just it, nothing else. Animations, graphics and models do look very good. Other than that, this game just feels like a cash grab, if you wish to play this game, I recommend that you buy it on sale because it's main price is not worth it. :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "stupid  fucking combos that make no sense",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game yet I will keep playing it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "let me refund this goddamn game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Repetitive gameplay",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "a waste of money",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "do not buy this shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "still a waste of money a year later",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not a fun game combat is just dull",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scam babi",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game fell off",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish my friends play this more",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no wkhw",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "man im gonna kms 💔💔💔💔",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't regret pre-ordering the ultimate edition of this game, as I genuinely had fun within the first week of its release. I truly believed, at the time, that we had a dragon ball game that would last us a generation, and be a milestone within the dragon ball community. \n\nI, along with many other people who believed in this game, turned out to be wrong. I cannot recommend this game because its developers do not believe in it, because simple tweaks and additions, like costume changes and quality of life updates that would make the custom battle maker actually usable, are still not added even a whole year after release. Instead, what we have gotten since then are DLC characters, and not even all of them either.\n\nIt is not worth the money, even on sale, and if the people who made this game don't wanna put in time and effort into making it better, then why the hell should anybody do the same when it comes to playing it? \n\nThis will not go down as a generational DLC game, it will go down as a generational disappointment, and I am tragically glad that Akira Toriyama is not alive to see what his IP has turned into.",
      "voted_up": false,
      "votes_helpful": 137
    },
    {
      "review": "While Sparking Zero shows a lot of potential, it’s ultimately held back by a lack of effort from the devs. Simple yet essential features like crossplay, fan-favorite maps, and classic modes are missing, despite being present in previous entries of the series. Because of this, the game feels stripped down and lacking in variety.\n\nThe core gameplay is solid and enjoyable, but it doesn’t make up for the missing content, nor does it surpass its predecessor in overall fun.\n\nFinal Score: 6/10",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "genuinely the biggest waste of potential of all time. This was literally a GOLD MINE if you just updated the game or did live service. Idk how yall f****d this up this hard, but as probably my most hyped game of all time, I'm terribly disappointed in how much of a snooze fest it is.\n\nI don't even watch the dlc trailers anymore because I just honk shoo honk shoo.\n\nThere is no one else to blame besides the people up top who decided to just abandon this game after launch. Seriously. When I'm on my deathbed in 50 years, one of the things I'm going to remember is how badly this game was bungled.\n\nShame on you.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "This game was the biggest waste of money I've ever spent on a game besides Jump Force. The wait for a new installment in this series was definitely not worth what we got as a game. While the game looks nice with an alright sized roster and decent story mode, the problem is everything else. \n\nI have no idea why they decided to even have a ranked mode when this roster is no where near balanced, which leads to players just using the most broken characters for easy wins. The combat is absolutely brain dead with people just spamming ki blasts and their counter buttons while using Power to the very limit with no downsides. It feels like they did this so any person with a pulse can pick up this game without even trying. \n\nA more personal gripe, but ever since Super, it's like og Dragon Ball gets forgotten almost entirely in Dragon Ball games with barely any representation compared to what they got in older games. \n\nIf you really want to waste money on this game, at least get it on sale and NOT full price. It is not at all worth $70. If you're a fan of Dragon Ball and looking for an exciting game, look somewhere else or play Tenkaichi 3 if you have it still.",
      "voted_up": false,
      "votes_helpful": 45
    },
    {
      "review": "GREEEEEEED BLACK FRIDAY SALE 40% off and  you raised the price so its $60 youre game is already fucking dead and you pull this shit i had around 6 ppl ready to dl it and you guys fucked it all up FUCK YOU for messing this game up.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "its probably a good game if you didn't spend the entirety of 2024 being led to believe that this was the equivalent of finding a cure to cancer",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "It is an amazing game, so much potential but ... it needs cross play, the strongest part is to play with your friends and with the  price it has it should be expected to have it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "for the first and last time , this game shouldnt be anywhere near $70 what an absolute joke ? theres about 800 steam players daily who play this game as a whole and that is nothing. devs are AFK or living in ghost town , if you want to play casually and play quick match against some buds ? u can either fight the same 5 people , have 5-10 minute q times , or play against Z ranks , IN QUICK MATCH. i climbed up to B2 rank , and i am forced to fight people who are the highest rank in the game and have 1000+ hours in the game 🤣 dont waste your money my fellow humans , its just brain rot",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "DO NOT PLAY ON STEAM, servers are absolutely trash. I can hardly find a match that doesn't lag. I enjoy the game but you can forget about online. Any other game I play online works great, but this game is almost impossible to play online.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "JUST MOD THE GAME AND MAKE YOUR OWN NEW CONTENT BC BANDAI LEFT THIS GAME IN THE DUST\n\nbandai took all the things players have been asking for in sparking zero, but implemented them into gekishin squadra. now if only they treated the Budokai Tenkaichi IP (sparking zero) with the same love they treat this new IP.\n\nno offline content like the last 3 entries had. they added customization options to every character in this game, but only a few characters in this game actually have things to quip onto them (a halo barely counts). if i didnt have the season pass to this game i wouldnt be getting any new content since the only new content added are characters with transformations. and one new map.\n\nthey made a sequel to one of the best anime fighting games, and somehow released it with less heart, soul and removed content. I find myself playing this game for an hour, then booting up the older installments so i can have actual offline content to play. never getting games day one again. game killed any future hype id ever have for a dragonball game again.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "this game is shallow as a kiddie pool and that kiddie pool has a fucking AWESOME waterslide but also literally nothing else",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I'm still having fun due to mods but if i wasn't I would have dropped this game 100 hours ago barely any new content gets implemented and when it does there is so little its not worth wait, no new gamemodes, barely any maps, no character customisation, if your a die hard fan sure get the game but if your a casual your better saving your money on something else, or just emulate BT3",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Not played in ages, but it's one of the biggest wastes of money I've spent. Only buy if it's on sale for less than 25 and you have friends to play with on it, expect no updates, no DLC and no customisation (which was falsely promised.) This game gets boring very very quick solo. Public online is filled with players who spam the same moves. There's little content. Play Xenoverse 2, FighterZ, or even Raging Blast 2, those games in my opinion are better than this. Xenoverse 2 especially if you're looking for the customisation this game lacks.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "They've patched out all the fun from this game. You can't combo into a super attack anymore, they nerfed the the damage too hard for that. You can't just shoot out a super without a combo, the AI will just teleport out of the way.\n\nEven before the patches, the AI was too teleport happy. It's difficult to recommend the game in the state it's currently in. I hope that for season 2, they reverse some of these decisions so the game can be fun again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is the definition of disappointment. Between mechanics that rely more on connection than timing, inputs that do not register half the time, the half baked roster, and a lack of game modes, maps, and ESPECIALLY cosmetics, this has to be one of the worst cash grabs ever. So glad my ex girlfriend bought me this game so I didn't waste a single cent on this piece of garbage. Ranked isn't even fun. Half the time the match ends because the timer hits it's limit, and you end up losing when you can clearly still win. No rewards or titles or anything either. Bandai, I hope you go bankrupt you garbage company.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I tend to buy games full price if I'm really excited for them, so far this has been the only time I have ever regretted spending the full $70 on anything. Sparking Zero was [b]not at all worth the price.[/b] I wouldn't say it was terrible, cause as a game it's quite alright - it has a large roster, it has flashy animations, neat stages, but everything else is just underbaked and underwhelming to the max. Especially the post-launch support, which frankly has been nonexistent. There are modded characters who are higher quality then the crap Spike has put out.\n\nSparking Zero is a life lesson on why not to buy into hype, just because people are majorly excited about a game doesn't mean it's gonna be good. At most, if you're bored and into Dragon Ball, spend like $15 on this one.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I didn't know how they fumbled the ball this bad. Horrendous post launch support, slide show story mode cutscenes, sweaty online, no cross play, and much more wrong. I regret buying this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Been waiting for this to go on a reasonable sale since over $90 cad for games is insane these days. Loved most of the DBZ games as a kid and was ready to go in with the nostalgia glasses on. 1 hour in and I'm tired of trying to figure out the game mechanics and the single player difficulty. Not so much because it is so terribly difficult but because it's a slog going through the boring tutorial learning all the different systems that go together. Games graphics are great and I'm sure there is a good reason it has good reviews but it felt like I was coming home from work just to do some homework, refunded and got my money back.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "i first bought this game when it was in Pre-Purchase, because :\n1. It's a Dragon Ball Game\n2. I wanted to relive the Budokai Tenkaichi with the new Graphics\n3. It's my favorite anime\n4. It looks fun and exciting. And it looks beautiful\n\nwas excited because this was my first most expensive game that I have ever bought. but throughout the game, it sort of just fell off really hard. With no new map whatsoever, no customizable costumes even though there is a place where you can change some of your outfits, story with some weak ass animation (was expecting some dragon ball kakarot type cutscenes but get dogshit motion capture and power point slide kind of cutscene) and do i need to say more about the horrendous lack of content in this game, like DAMNN...  Even the new DLC can't save this game and get it back up again with the lack of content. They have so many potential if they just added a Super Saiyan 3 Goku Daima outfit so that  goku can transform into SSJ4 Daima but noooooooo... they make it a standalone unit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game has very little content, I would not recommend buying. It's a great throw-back to the amazing Budokai Tenkaichi games, but without any actual substance. It's obvious as well due to the players dropping from 120k on launch to less than 1k players currently. It's sad because the Budokai Tenkaichi games were offline games that would be played split-screen with friends on the couch, where as this, which is supposed to be the successor to the BT games, is nothing but a hollow competitive battler with a short story recap. In short, buy it if you want an online battler, otherwise I wouldn't suggest it. Hopefully if they make a sequel it's better with more actual content.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's not that the game is bad. Truthfully, I've had a lot of fun with it. \r\n\r\nHowever, as someone who enjoys playing alone most of the time, it doesn't have the replayability. Nowadays, I only hop on to try the new characters, and then the game sits untouched for a couple months. XV2 had a grind that SZ does not, which hinders my enjoyment. \r\n\r\nThe story mode was fun, but I'm not running to the game to play those again. It was mostly just for the unlocks and achievements. \r\n\r\nCustom stories can be fun, but not when it's the same stories over and over that people create. Like, if I wanted to do the Broly movie fights, then I'll just make the match in the battle section. Why would I play a custom story that ends in 30 seconds? \r\n\r\nThe customizing is limited as can be also. Why is that the only game in the franchise that allows you to change character's moves from the game that came out on the PS3 and not in the game that has an entire screen about customization? \r\n\r\nAnd don't get me started on the DLC moneygrabbing. The latest one boasts about 6 new characters, but all it did was give 2 characters and 4 skins for existing characters. Just be honest. \r\n\r\nIf you like PvP, I'm sure you'll enjoy yourself for awhile, but even then, you're going to find that the game just doesn't have enough content to sustain long play, especially if you are trying to be a content creator. \r\n\r\nFor the short term, the game is fine. For the long term, I'd rather go back and play XV2, especially since the game is still getting updates and is almost 10 years old.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "DLC is trash only adding Daima character and not worth the price for it, they don't add new maps or costumes or anything. Game get repetitive and stale after awhile; one of the most impactful and influential anime is not given justice with the stories instead its a png slideshow with cut content, would understand if that added more what-if stories but you get a few of them and their not that memorable or good. Roster is mostly just copy and paste character with a little variety and transformation to bloat the character count. \n\nCombat and visual are great but that's it, online is broken/ laggy and mostly dead, no cross-play in 2025, nothing to keep you playing, after a few matches you played them all\n \nWASTE of money, i regret buying not worth the price get it under $20!. Game had great potential but they fumble the bag with half ass support to it post launch",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "remake the story mode... add a real customization, not 200 skins just for Goku and Vegeta... add new contents offline don't focus only on online stuff...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "seeing last daima DLC confirmed this game still bad, no story expansion, 1 stage for 1 year, sound effect still bad, rush still looks bad too, i regret paying full price on release, honestly just go back playing BT3 or Budokai 3 at this point",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I used to love this game when it released but I strongly recommend avoiding this game if you value your time.\n90% of games you play against someone lagging either because they have a low-end system or they are purposely causing the game to lag with exploits or the stupid f11 spam thing.\nNow I can't even get a match every time I go in queue I'm locked behind the \"opponent found screen\" for 5+ minutes before it loses connection.\nThe players and lack of action from spike chunsoft ruined what could have been a very successful game, sad.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is fun until you realize how unfinished it is\n\nCombat:\nIt's been a year and this game is still buggy. The game has many great mechanics, but I can't name a single one that works as it should. The controls are clunky and limit the player artificially. You even have to use a workaround to do an emote. The game punishes you for trying do develop your own playstyle. And the playerbase is the worst I've met so far. It's gotten better with recent patches, but as soon as you leave B rank, players still do everything but learn the game to get their win or rage quit if they don't\n\nGraphics:\nThe best any Dragon Ball game ever looked. But some animations aren't finished, which makes this game look inconsistent. Many Super Attacks have weird pacing. And there's lack of detail in some areas. For example the particles on Genkidama are too few and move incorrectly. And many attacks lack impact\n\nModes:\nWorld Tournament mode isn't finished. Characters ringout themselves when too close to the ground. The game added team tournaments with individual eliminations.. but characters don't get eliminated from the team. Overall tournaments are too small. This mode might be great if it ever gets fixed. Being able to customize tournaments is a  great addition\n\nCustom Battle lacks.. customization. The event system is limited. This mode really needs to be extended\n\nLegendary Warrior Face-Off: either make this mode available permanently as a Bonus Battle or completely remove it from the game\n\nThe Tag Team mode from the Switch version hasn't been ported to the other platforms\n\nStory mode is fine. It's not great, but it has its moments. Still better than BT3's story mode. It's not the mode where you spend most of your time. The way it's implemented makes sense for Custom Battle mode\n\nCharacters:\nMost characters move the same, have the same ki blasts and often even reuse animations. Some movesets are incomplete. At launch, the animation of DBZ Broly's grab super was clunky. Instead of fixing the animation, the devs just moved the camera so you can't see it. Goku is the only character who has [his version of] Roasie's Super Attack. She a generic Super, the same Super again with a different cutscene and a reused Ultimate\n\nRegardless some characters are very fun to play as. Roshi, Goku (except Daima Mini), Mr. Satan, Majin Vegeta, DBZ Frieza, Dyspo, DBSH Piccolo, Androids and most 2-3DP characters actually play different than most characters. You just won't see much of it because of the player base\n\nOffline content:\nlol\n\nConclusion:\nOnly buy if you're a hardcore Tenkaichi fan or the game is on 50% discount or more. Or wait another 1-2 years until the game is finished. Most of the patches so far were great\n\nAnd don't buy the Ultimate Edition. It's literally just what it says. The Super Attack isn't even good",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've never been more disappointed, we were expecting so much more from the sparking franchise and especially the DLC's but it feels so hollow... We've got none of the Tamagami's even though this DLC took the longest to come out, no adult daima goku, vegeta, piccolo even as a skin, only one new map.. The game lacks content, it lacks solo player content, crossplay and customisations. That's so sad from one of my favorite franchise. I still have hope for a free dlc (like shallot) with at 2-3 maps such as hell, kami's look out, glacier and muten roshi's island or even a new player mod like they did with the Boss fight. I wish it was a Riot game sometimes..",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "worst game ever dont buy it insta regret waste of my grandma's retired pay",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TL;DR: The game is not bad, but THE ONLINE SCENE IS DEAD. Buy it only for local MP or the single player (which isn't anything special).\n\nWait for discounts, not worth 50€, much less 70€. It's barebones Budokai Tenkaichi 2, electric bogaloo.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Would not recommend it's the big 25 and still no cross platform, the story was dry and buns their way of presenting the story was through slideshows it felt like they spent only 67 seconds on making the story mode.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is solid, but holy shit, insane price tag for ultimate edition and the only thing you get is few new characters, like bandai had 0 communication between DLC 2 and DLC 3 which took 8 months to even add and lucky you if you bought the ultimate edition because now you can play with 6 new characters and one new map and that is it. 40 extra dollars well spent. If you are planning on buying it, just play with mods, basegame will get reppetitive very quick",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As far as Dragon Ball games go, I would say this one is middle of the pack at best. It's got stunning visuals and a large roster, but the combat feels less interesting than other iterations of DB games. About half the super attacks in the game have terrible homing and the collision in many of the arenas leads to immersion breaking moments in fights and further issues with the already bad homing attacks. A large complaint I saw about this game upon its release was its high difficulty, but I felt it was a bit too easy as a seasoned fighting game player. If you've ever played a DB 3D game before, this one won't feel difficult at all. \n\nThe game gives you the ability to play through story moments as antagonists, but this experience does not lead to new branching storylines and really isn't anything outside of what you could achieve by just setting up a custom battle playing as the antagonist in the first place. \n\nThe big thing that drives this game home from my earlier \"middle of the pack\" sentiment to clicking \"not recommend\" out of the two options is the price. I got this game on sale, but even so, it does not feel worth the money. The story is rushed, skipping over several parts in each arc for an unknown reason. Not fighting every member of the Ginyu Force is a forgiveable exclusion, they are filler sandbags, but not fighting every phase of Frieza is an injustice to the Namek arc.\n\nOverall, I would recommend Xenoverse 2 over this game. Sparking Zero is just that: sparking visuals, zero recommendation. Maybe I'll just use it as a simulator of different characters battling since it is fun to watch, but not to play.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I regret buying this game thinking it was gonna be [i]at least as good[/i] as Tenkaichi 3 but god forgive a game can have content by default noways i guess.\nNo crossplay in a fighting game nowadays also makes no sense, let's not forget we almost get no split screen duels.\nLazy bandai cashgrab nobody is buying your cringe dlcs with 3 slot characters (they will lie saying is 12 new characters or something because they count the transformations).\n\nPD: this is coming from a sad old tryhard metalord from t3",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Nearly a year after launch and I cannot recommend this game at full price, or even 30 dollars. YES there are a lot of iconic DBZ characters, but this is about as casual as a fighting game can get, and yet super unforgiving to casuals. Unfortunately that means trying to play this game online with randoms is going to be hell on earth as you battle lag, players flying up and down, people teleporting behind you, zero combo expression, and meme characters with diabolical moves. Because this game is so casual the game itself is not going to teach you strategies that can secure dubs, and the single player experience is a complete joke. \n\nHowever, if you were able to get this game for 15 dollars or less, and have friends with a crumb of honor and integrity that would play this with you there is a strong potential to have a lot of fun. Just know that playing online with randoms is a hell hole, and the single player campaign is TERRIBLE. \n\nI give this game a 3/10, overpriced friend slop carried by fanservice. If you remove the friends, and aren't a fan of dragonball this game is undeniably TRASH.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Graphics and gameplay are top tier but the lack of single player content and storyboard cutscenes in a game that costs 70$.\nOnly recommend on a deep sale.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Singleplayer gameplay is awful, the CPUs blatantly read inputs at higher difficulties but are abysmally easy on lower difficulties, to the point where they aren't even fun to fight. the \"create your own universe\" branching storylines idea that was advertised is kind of a joke - there's not much agency in your choices and majority of them end up being railroaded to looping back to the main timeline anyways. majority of the story is also not animated and provides almost powerpoint presentations to fill gaps between fights, there are some animated moments but they're few and far between.\n\nthe Multiplayer is fun for a bit if you play with friends but online multiplayer is a mixed bag, some people love it, others find it too sweaty. personally I didn't care for it, and combined with the lacklustre singleplayer experience, this game is impossible for me to recommend at its current price, or honestly even on sale until the price starts getting dramatically reduced.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It was fun, Not gonna lie. But now its like the corpse in the corner of Bandai, CROSSPLAY would've save it at least. Yet no crossplay in sight. Get it if it's on sale for really cheap.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is entirely worthless. The gameplay is far too simple and repetitive to be substantial and there are only 2 unique special moves per character, so it kinda goes without saying that there are basically no ways to personalize your gameplay. There is very little representation from any of the Dragon Ball series besides Z. There are barely any original Dragon Ball or GT characters, and several characters do not return from previous games in the series. There are 0 characters from the Dragon Ball Super Manga exclusive arcs that have existed for several years and they have the nerve to make DLC out of the Heroes movie that came out 2 years ago. This is not a celebration of Dragon Ball or it's legacy, it's a celebration of capitalism and how easy it is to rip off people who just want to play a decent game based on their favorite anime series. What a joke. Releasing entirely worthless Daima characters that should be free as DLC before adding characters who were present in previous games of the series tells you exactly how \"hard\" these devs are working. They do not care at all about this game and delivered the absolute bare minimum in terms of gameplay and content. PLEASE do not buy or support this game in any capacity.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really tried to like the game, i was a big fan of the budokai series and was so excited to get this. But it just isnt the same, the graphics are nice but the fact i have to spam super attacks to even beat the enemy fast enough to get the what if is leaving a bad taste in my mouth. If it was get a combo streak or performing a certain amount of moves i dont think id feel as bad cause then it would just be a skill issue. I did like the concept (in frieza story) that not transforming will trigger one what if is cool but thats it. I get theres supposed to be a challenge but if it is just \"beat enemy before x time\" it would not be as bad if i also had a counter up top like xenoverse.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Most hyped release that led to the least amount of hours played on a Dragon Ball game. The story mode is not narrated, it focuses primarily on DBS and still doesn't go into enough detail on that, let alone the majority of the series' points that most fans enjoy most (DB & Z especially). I wanted it to be great, I even lied to myself for the first month or so. But here I am almost a year later and I haven't played it for months.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Preordered the game with the deluxe edition. I'm very disappointed by the end result. There's little to no incentive to continue playing as there's no single player modes. Particularly disappointed by the Story Mode. I would have prefered something similar to Budokai 3 or even the original Budokai Tenkaichi series with the basic story plus what if. The alternative endings in the base game are very basic - the best one is Gohan Black but you can't even unlock it in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A good game that would be a great game; if it didn't have a predatory spending model. Fun game with amazing battles; but lackluster DLC at best and a character selection that clearly labels others versions (costumes, maybe moves) of the same character as different characters. 180 fighters? You don't even have all of GT; how do you have 180 fighters?\n\nTo cut to the chase: there needs to be more variety in the characters. They have a lot of cool character, and some niche ones, but Shallot can't even go Super Saiyan and you can't transform into SSJ4 Goku or Vegeta. You start as them or you don't play as them. We all know that Dragon Ball nerds love to roleplay. Why make them go all out at the start?\n\nMoreover; we got a glimpse of Super Saiyan Vegeta with his tail but you can't play as him. Nor can you play as the Great Ape version of many characters you could in the old Play Station games.\n\nLike I said; great game. Very fun to play and definitely worth a few dollars. It would even be worth the whole $70 if they fixed this main issue.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "they abandoned this game extremely quickly. the lack of meaningful content, specifically offline content, completely choked the life out of this game. once you have all the characters, expect the exact same fight on repeat no matter who youre playing. the only exceptions that come to mind are the \"weak\" characters who at least have more unique mechanics, but otherwise everyone plays the exact same way. all the content that is in the game is half-baked or straight up just boring after you play it once. doesn't help that the player count dropped by 90% not even a month after release. seriously, all it wouldve taken to extend the games life wouldve been crossplay(which somehow they thought it was a good idea not to implement on a fighting game in 2024) and some offline content like a battle tower or a survival mode.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Little content, and balancing too poor for online to be functional.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is so bad the timing on vanishing is so laggy combos are so laggy button inputs are laggy wtf happened to this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It honestly felt like it under delivered on what it proposed, between the super cut down roster, lack of customization, and terrible story animations. The DLC barely subsided the disappointment I feel for this game. In short, incredible concept, horrific execution. 4/10 nothing but pure regret.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it was fun and i love dbz and this game is kinda dropped the ball with alt story mode win condistions are just beat them quickly it gets boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought the game late. Evidently locked to 60fps. Game just has so much downtime between fights. Trying to do story mode and there is some 5 minutes of boring exposition that has been retold in every medium over the last 25 years.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What's funner than beating that boss you'd been struggling with? I dunno figure out this mystery mission to advance the plot. Now with 1000% more sparkle and EVEN less soul!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game, but NOT $70 good. I got disconnected during literally EVERY online match, even private matches! Good game if you have money to burn, but otherwise just get a couple indie games for the same price and at least triple the content and without micro transactions.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "took way too long just to make dlc 3\n\nstill missing many characters\n\nadult daima ssj4 goku and adult daima ssj3 vegeta arent transformations but instead they are stand-alone characters in a game where one of the main mechanics is transformations\n\nthey chose adding panzy into the game over adding the tamagamis\n\nalso chose promoting the switch/switch 2 version of this game over dlc 3 and its also going to be the last one\n\nlack of transparency and communication between devs of the game and its players\n\nmodders are capable of doing things the devs should have done",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Sparking Zero is an amazing game, hidden in a huge pile of slop. Half-Decent story, virtually zero offline content, online was abysmal last i tried, prob still is, rush attacks never land even in a combo (some characters have it worse somehow) barely any stages. Even the mods arent keeping this alive cause what am I supposed to do? Fight the computer again? Go on the boring World Tourny mode with barely any good customization? The long awaited Tenkaichi 4 needs more than this to become the best. idk how you can release a game like this with the least amount of non-story mode play. Even less customization than the previous games. We don't need more characters, or even stages. We need something to do that isnt just World Tourny or that cruddy raid boss thing. Why not an endless mode where you get a lil health for each kill? (been done) or the challenge road thing where you fight more and more prechosen teams (been done) story DLC added in FOR FREE (as they should have been included with the last few DLC we PAID for) i could go on for a long time about this game but I'm too lazy to keep goin'.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Horrible game. Im one of the biggest DBZ fanboys youll ever meet, but his game was completely unplayable. the story mode was straight up boring, and the games needs some serious balancing. its also not fair that in singles battles theres no brackets or anything?? like, do split it up from DP 1-4, 5-8, and 9-10, that way it encourages you to play your favorite character and not just whats best. theres also no multiplayer, OR SPLITSCREEN. what?? the game is unfinshed, not polished, unbalanced, not enough content... the list goes on. i wouldnt play this game for 10 bucks, let alone 70 damn dollars if i had known it was a rip off.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Please, don't buy. By the time that you've finished the story mode the game feels like a fighting sandbox with barely any replayability, not to mention that the game is somehow still unfinished. A severe lack of maps, cosmetics, story and game modes has led to me feeling very dissappointed in the fact that I spent over 100 dollars on this.\n\nAfter completing the story, the only game mode that exists outside of single battles, online battles and tournaments is cutsom battles. You can basically create your own scenarios for battles and share them with other players. Here are the problems with it: it is way too fucking difficult to use (searching through 1000s of dialogue options to find one you like because you can only filter, but that barely helps) and the things you create immediately get lost in the crowd of things others have created because there are practically no options for searching.\n\nQuickly gonna mention the performance issues: only play if you have a newer PC or something, because I'm using a computer I got around 2018 and the lag is unbearable.\n\nAll in all, you may have a fun time for the first 50-100 hours (like me) but there's no reason to spend 100 dollars on this. It's a game that was rushed and released for profit, even if it seemed like a love letter at first.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It hurts to do this but this game was sadly ruined with not enough singleplayer content and the same health and dmg update",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not as fun as old school PS2 titles like Budokai.\r\n\r\nSome times, simplicity is the best approach.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This was one of the most hyped games for 2024 leading into 2025 after delays. Yet whenever I even look at the title I get disgusted now because of the fact that this game has no content, had and probably still has no balance, and is like a rip off Jump Force but for Dragon Ball. This was just over-dramatized eye candy.\n\nI will never fall for this scam again. Good for Bandai Namco though... ripping off hundreds of thousands of people in a couple weeks, and becoming top 10 on the charts for a couple weeks.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}