{
  "positive": [
    {
      "review": "There is more game in this game than many other games. Then you can buy additional packs to keep putting more game in it. That's about 500% more game per game, than most other games, and it keeps getting gamier. Game this game.",
      "voted_up": true,
      "votes_helpful": 190
    },
    {
      "review": "Instead of distributing crack in the 1980s, the CIA could have airdropped copies of Vampire Survivors to every impoverished American neighborhood and we would still be suffering with the ramifications all the same. Sometimes I break out into a cold sweat while trying to attempt anything productive and start scratching at my neck feverishly just itching for another run. This game is better than sex.",
      "voted_up": true,
      "votes_helpful": 96
    },
    {
      "review": "lacks vampires, but an abundance of ways to become god. if i play enough im SURE i can just make a vampire myself",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Is Vampire Survivors a clicker? No. Is it a game that requires active button-mashing? No. It's a lock screen simulator",
      "voted_up": true,
      "votes_helpful": 39
    },
    {
      "review": "[b] Nominated for the \"Labor of Love\" Steam award 2025. [/b]\r\n\r\nPoncle released the VS wiki completely free of advertisements with an user friendly interface on March, cross saves, online Co-op and content, (paid and free), as recent as October. \r\n\r\n[b] Passion. [/b]",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "One of the easiest games to pick up and one of the hardest to put down. One quick game turns into seven and a few hours of time. And it keeps updating with new content. Vampire Survivors stands high above its peers and countless imitators as the best casual, bullet hell, and rogue-lite available.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Vampire Survivors is a masterpiece, a game so simple yet so innovative and full of love.\nSince I bought it I keep it installed at all times just to know when new content is available, so I can play it as soon as possibile. I also bought every DLC at launch and not regretting any of it.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "A great game to relax to while listening to good music and earning all the achievements to unlock all the powers, maps, and characters.\n\nThe DLCs are good, and they don't make it much more expensive.\n\nI recommend it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Its amazing , There is so many secrets and unlockables and content , It was a suprise to me that this game is THIS good!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Vampire Survivors is the game you start for “just 30 minutes” and suddenly it’s tomorrow. The ultra-addictive gameplay, retro music, and crunchy pixel graphics turn you into a happy zombie glued to the screen.\n\nDevelopers keep updating it nonstop, which definitely doesn’t help break the habit. And with cross progression on ALL platforms, you can stay addicted on your PC, phone, and console without ever escaping.\n\nIn short: it’s pixel chaos, it’s brilliant, and it will steal your free time forever.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Never did drugs in my life but this game has got to be better than drugs, lol. The developer knows how to keep the player engaged and always rewarding you and chasing after the next thing to unlock. So many secrets and just when you thought everything is done the game will blow your mind when it is like \"na uh bruh there is WAY more to do, SUPRISE!\" 20/10 game would highly recommend to anyone of any age!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "BY NO Means am i done with vampire survivors but playing this alongside something like Call of Duty Zombies does get a bit tiring when the only game flavours i'm experiencing is \"try until you die\", which is like, fine! but i think i need a break lol\n\nDONT let that convince you that this game doesnt Rock And Roll. i watched a friend play it for about 5 minutes and thought \"yeah alright\" and knew that there was like, every single castlevania character ever in it so i gave it a try. it is ADDICTIVE as flip i gotta say! every run you go in you have an OBJECTIVE \"okay level up this item survive X time do X thing with X character\" so you are constantly workign towards a goal. over 100 achievements in (not including the vania ones) and there is still a comical amount of stuff that i'm learning and working towards. the stages start out plain and simple then as you unlock the challenge ones they become goofy and strange and interractive and interesting! you learn which characters you like based on their starting items and start to immediately devise a Plan JUST because you know that hollow heart is needed to upgrade the whip so the moment that appears for your level 2 levelup you know what you're skipping and banishing. it's such an interesting gameplay thing to have you thinking ahead so often and so fast. and all you do is walk around a screen! it's so addictive and moreish! there are secrets and ideas to work towards. the enemies look cool and the music is great! honestly i dont really have anything negative to say about it so i cant quite say why i'm not giving it 5 stars but i'm sure i'll get there. i love it, i'll say it! i love vampire survivors!!! just need a break lmao\n\nsadly the achievements on steam seem a LITTLE bugged like not getting achievements for upgrading the alucart sworb despite getting the shield, or alternatively, unlocking space dude in the same run that i unlocked space 54? same with somehow unlocking gazebo when i unlocked da coop at the same time. odd! love it though, great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The update that added online co-op made this game so much more fun! \n\nan already crasy game became even more crasy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I originally put off buying this game because of its retro aesthetic, and boy am I regretting that decision now",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am addicted to this game and I bet I am not alone. One of the best pixel puke I ever experienced presented by top notch casino programmer poncle. Can't wait for the new incoming roguelike. 1000000000% recommended. This is now one of my favorite games if not the most!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game gets as many updates as terraria and costs $6 CDN when NOT on sale. Worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Back in 2022 Vampire Survivors did not invent its genre but it did give it a major boost in popularity, now there are numerous Survivor-likes everywhere.\nBut back thern  its content was pretty damn anemic.\n\nA big part of the major content that has been introduced since then can be found in the DLCs, but there were also plenty of updates to the base game.\n\nThe result of this is that there is at least something to do in this game unlike many lesser titles.\nThere is a sizable number of unlocks, a clear progression path of what to do and unlock next, many different stages with some unique gimmicks and plenty of hidden secrets.\n\nIf you go for full completion you will be busy for a while and even if you arent then the variety can be entertaining for a while.\n\nThat said, this is still the game that survivor-likes come from and therefor does not innovate upon the genre.\nFor the most part it really is just the same eternal loop of pickung up a few weapons and upgrading them until the entire screen explodes and the game becomes hard to look at.\nYou can do this with many different characters and weapons now but the result and gameplay will always be the same.\n\nBut there is a reason this genre got popular and its 5 bucks without a sale, just give it a try, you will at least get a few hours out of it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Vampire Survivors is stupidly addicting. It’s simple, chaotic, and gives you that quick dopamine hit without stressing you out. It’s an easy 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game so good it molded a new genre and the copycats cant even attempt to beat it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Unbelievable game.....I spent over 20 hours on it already! Called off sick from work and got into a fight with my wife and currently going through a divorce because of how good this game is! 10/10 will divorce again!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Vampire Survivors is insanely fun — like a pixel apocalypse you actually want to be in.\nYou walk, everything explodes, and suddenly you’re firing so many weapons your PC starts questioning its life choices.\n\nBut the achievements?\nThere are a million of them.\nI swear every time I finish one, three more spawn like enemies in the dairy plant.\n\nStill, I kept grinding… and grinding… and somehow I actually finished them all.\n\nSo yeah — I’m officially stopping after clearing the entire Steam achievement list.\nI’ll only come back if they drop new updates or events… and then the addiction starts again.\n\n10/10 chaotic fun. 0/10 self-control.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is an addictive dopamine hit of a game :). It's like a low stress version of Risk of Rain 2, you load up, you get your items and upgrade them as you go along to get stronger. The best part is it balances repetitive with just enough 'new' things each round that you can chill out after work, switch your brain off and enjoy it, but still not be bored. You can decide whether you wanna yolo or take your builds seriously, either way you will have fun. There are also lots of cool unlocks and once you get the bestiary (a handbook that describes all the monsters you have unlocked) it's well worth the read for the comical descriptions! The soundtrack is also great and super catchy, you may find it ringing in your head long after playing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is a fun casual game. One to play and just relax for short sessions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Coming from xbox (where i 100% the game and hyperfixated on it forever) the game can be really slow at the beginning (something i noticed having started over on mobile and here) but trust me, once you get into the groove of it that groove never ceases, the want for more vampire survivors grows and grows and they keep fueling it, trust me, 11/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very simple concept but also very addicting",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played on steam deck.\n\nRuns perfectly out of the box.\n\n100% the game requires 2 dlcs (Foscari & Moonspell).\n\nTook about 70 hours to 100% the game.\n\nIt's fun and mildly addictive coming from a 9-5 guy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game will always be fun! Easy and addictive gameplay",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing this for only a week or so and I already have a full 24 hour day's worth of hours in it. The gameplay loop is literally intoxicating, it's so satisfying to collect all the weapons you need and get them evolved and start absolutely stomping enemies. I was first introduced to this genre via the limited time Swarm gamemode in League of Legends, and I'm glad to have finally started playing this game so I can have that gameplay permanently! I've found it to be equally enjoyable solo and with friends. There is a ton of stuff to collect, and I found it to be yet another satisfying feature of the game to collect it all. Highly highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played this game every day since I started my 3rd year of university and it has helped so much in the strangest way possible.\r\n\r\nI have ADHD and struggle very heavy with focusing in class without some sort of visual stimuli, which results in me biting my finger or scrolling on instagram, meaning I either look like a weirdo or don't end up taking in anything from class at all.\r\n\r\nThen I reinstalled this game and became an academic weapon. this is because it is so simple control wise that I don't have to focus too heavy on what's happening on screen, while still having an engaging enough visual that in some roundabout way I am fully engaged in every lecture I participate in.\r\n\r\nI have not gotten a grade under a 72%, which doesn't sound crazy but I almost dropped out last semester due to how poorly I did \r\n\r\nBasically this game cures ADHD (joking)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Vampire Survivors is pure genius. It’s insanely addictive, effortlessly creative, and just downright fun. The gameplay loop hooks you fast, and somehow the music manages to keep you both chill and hyped at the same time.\n\nHuge cheers to Luca Galante and the awesome dev team for crafting such a simple yet masterfully designed experience. It’s the kind of game that reminds you why you fell in love with gaming in the first place.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "unbelieveable game, the content you get for this price is insane, and they recently added online coop and ANOTHER free dlc which made me get it to play with my friend and wtf, if youre thinking about getting it just get it no questions asked",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is super much fun with friends. at first the grafics and many skill effects scared me off but my friends convinced me to give it a try and i am thankful they did. i am very color sensitive but except for 1 level i managed to get along very happily and enjoyed every bit of it not minding the grafics anymore and just having tons of laughs and always chasing for the next character to unlock and skill to raise to perfection.\n\ni bought all of the DLC the same night, haha. i think that speaks for itself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[Old]: Played for 5 hours total so far, game is a lot of fun but crashed on me twice in a good run..\nFor the price it is worth it but it really sucks when u got a good run and it decides to crash -_-\n\n[Current]: Now 150 hours in the game and it seems to be fixed, tons of content with the DLCs and very fun to play COOP. I would recommend!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played this game before there were 5 stages. Playing it now I'm amazed with all of the content both in base game and DLC. It's super cheap so this is the rare time I say you can buy now rather than wait for a sale. Only downside I have about the game is that the Adventure mode feels like an absolute slog and the rewards you get from it for the main game feel lackluster. Also, feel free to look up a guide for evolutions if you don't want to \"waste\" runs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recommended 8/10*\nThe OG Survivor game, cool retro pixel art, addictive gameplay, lot of unlockables(characters and power ups), i must say its not bad, but sadly after playing Holocure save the fans, this one felt not as good, but don't get me wrong the game is still good, but i don't know, i've been playing it and thinking: damn i would like to be playing holocure again instead... some of the things that bother me more is the damn 15 seconds song in a loop for all eternity(of course im exaggerating, not sure if its only 15 seconds song). \nIt has achievements, steam cards, can be family shared, and it goes really cheap on sales, its a must for every steam library.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Better than AAA.\nI'm just sorry that the true humor of this game will never be understood in other languages :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For 3 years, I've waited and yearned for this game to be an Online Co - op and now that we have it, I wouldnt have it any other way (Maybe Crossplay?), but Thank you for this amazing update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The most fun I've had playing games in ages and this game brought back that felling simple graphics (Pixel) yet enjoyable good soundtrack simply Love it . 10/10 <3 \n\nI would recommend . if you don't like my review you can  [quote] Re-roll 🎲 [/quote].",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Fun little game. Fun updates.\r\n\r\nA little all-over-the-place thematically.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "there is nothing I can add that thousand of others haven't already said about this wonderful game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cheap, fun, endless and a lot of content. Recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun. It's never ending. It's a story. It's a never ending story. And it's fun.\r\n\r\nThe controls are so simple, making the game play super accessible even for older people and those with differing needs. There's also a good amount of variety in terms of characters, weapons, environments, and so on. You need to get used to dying. And dying. And dying some more, because that's just how the game works. Also, don't expect to find too many vampires. They're basically in another coffin. You wouldn't have heard of it.\r\n\r\nReally, it's just nice to have a simplistic game where you can choose ahead of time how long you've got to play (i.e. 15 minute stages, 30 minute stages) and just go in to wreak some havoc.\r\n\r\nIt's also pretty fun to explore all the weapon and enhancement combinations, figure out which ones work for your preferred play style. Challenge yourself with the weaker combinations and evolutions or if you're in the mood to simply kick butt, you can pick the good stuff and kill, kill, kill.\r\n\r\nAnyway, so nice that I can put this game away for months, come back and play a few rounds and just enjoy it. No stories I have to remember. No character arcs to concern myself with. Don't have to relearn the controls. Don't have to relearn how to play. Just pick it up and go have fun. At the end of the day, hard to beat that.\r\n\r\nGraphics are obviously old school style pixel art, but with massive numbers of sprites, like if you had a super computer running a Genesis or SNES back in the day. Mostly. I like the aesthetic. Music is also pretty cool.\r\n\r\nOverall, I recommend this. It's not for everybody, but it's so inexpensive to buy, there's very little risk. Also, I\"m not a DLC person, but I got the DLC on sale for this and so far, it's all fun. Really adds a lot more variety.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the game that really started the whole thing. It's a trailblazer, a stimulating title that with every single play session, manages to give you that perfect dopamine rush.\n\nOne of the things I really love about the game right now is that it's genuinely packed with content. The character roster is definitely diverse and fun to jump into. The build divesity is through the roof. And the brilliant thing is that it started as just a solo project. The developer built a team around it, and from that point on, he's been consistently delivering quality stuff. The DLC is reasonably priced and actually gives you real value, plus free updates keep rolling out all the time—like that latest Balatro collab that's just incredible.\n\nIt's a game you absolutely have to own, I'm telling you. And what's even better is that it runs on pretty much everything: PC, console, you name it. But honestly, it's insanely well-optimized for the Steam Deck and other handhelds. It just works beautifully anywhere.\n\n\"Thank you guys, but the vampire is in another coffin!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game be like fk around and find out.\r\nWhy i played for 15 hours, idk.\r\nWhy i am going to play this game, idk.\r\nWill i ever stop playing this game, I don't think so.\r\n\r\nGot as a gift and have been playing occasionally. Not something i will hate, or crave about but something of a relaxing game. Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is simply amazing. Simple yet complex. So many choices to make. and the expansions just make it better. Gameplay itself is a well-designed. The music and sounds are exactly what they should be. The countless hour you WILL play on this game are not wasted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No game comes close in the content-to-price ratio. An immense, sometimes overwhelming, amount of game for what is asked for. Pravo Boncle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty sure that discovering this game after megabonk means you have the benjamin button disease",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it, have all the DLC and am currently getting every possible achievement !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game makes me feel like I’m in the world of Breaking Bad and I’m addicted to Walter White’s Blue Sky. Except the developer is Heisenberg and their drug is called Vampire Survivors. I have this game on my phone, so I have many more hours than shown on steam. It has gotten me through many long plane flights and longer than usual bathroom breaks at work. It is fun and addictive, great game and easy recommendation!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vampire Survivors is a fantastic game with tons of content. I've played for over a hundred hours and have so much more to do. There are some free bits of downloadable content and even the paid downloadable content is very generously priced. It's one of the games that I go to when I want to listen to something. That said, the music is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can transfer progress from one device to another now, absolutely love this game and the DLC, its super addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I gave a chance to try this game on my phone, it was hard to survive 30 minutes, but if you upgrade defense and heal powers I might survive in second level, it was fun until I addicted to keep play until I beat this game. I bought 2 DLCs: Contra and Castlevania. their contents were amazing! You should buy them though! I played this game since 2023, and I bought the PC version at this year. The graphic is great, the pixel is great, and the music from Contra and Castlevania are very interesting! Especially Kazoo songs from the DLC of Tides of something... Anyway 9/10 for this game and 4.5 to 5 stars (From Jurassic Park Operation Genesis's Performance Feedback) and you guys deserve to buy and play this game, Megabonk, and other Indie Roguelite Games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly fun and addictive for a low-res game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a lot of fun. Gameplay is addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like Vampire Survivors, it has kept me entertained a lot of hours, I played a lot on my Switch before I got the Steam Deck but the game is so cheap I didn't mind buying all the DLCs again for Steam.\n\nThere is lots of stuff to unlock and explore (combining weapons, finding relics, new characters etc) and the DLCs add even more!\n\nSo if you are fan of killing monsters and finding which weapons works best for you I can only recommend Vampire Survivors.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's been awhile since I enjoyed a roguelike game such as VS.. I couldn't imagine myself not recommending this game to any of my friends, it's such a fun and expandable game with an infinite cycle of re-runs full of possibilities and variations.\n\nThe amount of content given, whenever it's maps, hidden objects or secrets that we could find within couple of minutes just roaming around is amazing. Not to mention the DLCs that offer so much for such a little price to pay for it, it's baffling.. I , as a consumer wish I could donate or pay much more for them.. it exceed today's generation of gaming when it comes to DLCs , so I never expected to get this much from one pack overall.\n\nRecently I have tried out online co-op with my SO and honestly.. it's been a blast. Some achievements were achievable together in a singular run and some rather we had to do individually in the same run but it gave us a reason to re-run it which is completely fine since it was fun going different builds each time and finding out new stuff together.\n\nOne thing I need to point out though is the unlocks/perks from the lobby section, as a host, you can access the perks that you upgrade but the guest that joins your lobby cannot, thus they have to leave each time to upgrade their stuff and then rejoin a new lobby, since the old one doesn't allow them.. other than that , everything ran flawlessly.\n\nI'm hoping that this game continues to thrive in success, the same with their new upcoming game which is a deckbuilder and I'm very excited for it!\n\nMuch love to the devs, to the lovely and helpful community and also to the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good god.  I have 140 hours into this game?  When I first started playing, it was so intense that my fingers would cramp.  I got obsessed for a while.  This game spawned a whole raft of pretenders, but you have to play the original to really understand.  \r\n\r\nI don't play VS much anymore, partially because it was so damned addictive, but I still quite enjoy an occasional round.  This game remains fun and engaging, plenty to do over and above the basic gameplay.  I won't ever catch up with all the new features they've added, but I've got a good chunk of the achievements done.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, with tons of replayability, no brain strain but not stupid, addictive but not designed to be so, if you think it looks like a game you've already played, don't be fooled, Vampire Survivor is the original and probably the best of it s kind...\n\nBONUS = there is a bunch of secret in it!\n\n5/5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not even really a game. It's more like a single sprite-packed dopamine farming simulator with the aesthetic of a game made on Scratch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. Love doing different builds and now playable with friends!!! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vampire Survivors will consume hours of your time without even knowing, truly the successor to Civilization's \"One More Turn\".\n\nLots of replayability with countless characters and combinations for power.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game seriously needs some progression info.  it's impossible to tell how to unlock half the stuff and how to open new maps and how to progress half the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game!\ni'm now playing again to complete my achievements\ni recommend this and i hope other players will enjoy it as well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not many game developers get the privilege to say that they basically started an entire genre of games. This game is so fun for the small price. I'd recommend buying this game if you want to get into roguelikes, every game feels different and you never have full control of what the hell could happen. You can become a god or be hunted by death himself. 100% a must buy and It's $5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple and addictive game with surprisingly a lot of content for the price.\r\n\r\nBeware, the dopamine hit on your first \"pop-off\" run will hook you and keep you coming back for more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vampire Survivors is still releasing banger DLCs. I maxed out the achievements on my phone and still decided to buy it again. That's how addictive Vampire Survivors is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As an Italian I'm more proud of this game than the 2006 Football World Cup victory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for what it is, though I miss an option to limit/disable weapon graphic effects, as at some point it is hard to navigate in complex maps, especially Castlevania one. Even with non buffed character (zero eggs).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i ever played and i have countless hours on this game between steam and mainly on xbox",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First off, don't trust my current time on the game, I've owned Vampire Survivors on console for over a year at this point and i'd say this is a perfect example of a game I'd define by the phrase \"Just one more run.\" You think you might sit down and go for just a single game, the next thing you realize is that you have just been baited. The brain that thought you just had a little time to kill will be baffled at how the hell four hours have passed, you've died fifteen times, and you know you can somehow get more pew pew death lights flashing all over the screen so you start another run all over again.\n\nThe developer took the already decent sauce of the multidirectional shooter, set your attacks to auto in set patterns, gave it some rogue-lite passive upgrades and unlocks, and added some bizarre secret blend of spices that that makes the monkey brain treat it like crack. And they're STILL cooking with the recent release of co-op. For five dollars this is a worthwhile pickup for pretty much anyone, even better if you've got a friend or two to join in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The first title that has made me truly understand the feeling of \"just one more game...\"\n\nI appreciate that progress syncs between Steam and my mobile device, so I have several ways to access the game for a quick round or a long-term farming session.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of content and more keeps coming. Although I do think the game would benefit from another game mode to spice things up a bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game to kill time and nuanced enough to try out new builds and upgrades on each run",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like retro, or side scrollers, of just want to kill some time (and/or weird things) - ask yourself this one question: \"Why have you NOT already got this installed?\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't explain it it's just good, it's addicting and it's fun and somehow wild DLC ideas like Among Us and Balatro just work alongside more serious and extremely detailed ones like Ode to Castlevania. And even without DLCs this game is amazing and is always getting new free updates! (Also it's an easy 100% if you're crazy about achievements)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first bought the complete bundle, my first thought upon seeing the game in action is \"Oh, this looks like a cheap pixel game. I'll probably just try this out for a bit before I refund it\".\n\nSince then I have killed Death numerous times, defeated God twice, and have found this game to be a perfect thing to play in short bursts for those times when I just don't have a lot of time.\n\nIf you like power fantasies, bullet hells, weapon synergies, and just don't mind when the background becomes completely white because your loadout has gotten so big from Limit Break that it is blotting out the ground, this may be the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everyone was blowing up over this game almost to the point of being annoying. I got this game for free on another store, after playing for 2 rounds, I ran to buy it and all the DLC on Steam. This game RIPS!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, a ten out of ten for sheer fun factor and the fact it keeps getting more and more content added over time.\n\nWould recommend on any platform.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 dopamine generator, just unlocked the black disc from the Ode to Castlevania dlc and had to leave a review after that cutscene. absolute cinema without a single word",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ASMR but its a video game, quite a great one at that. Resets my brain after a hard day of study and work.\n\nThank you, Poncle. You guys reminded my why I fell in love with video games all those years back in childhood. It is not the flashiest of graphics or the bazzilion amounts of dollars spent on development that makes a game great, It's the promise of a good time and its complete and honest delivery crafted by someone with love, skill and passion that does it. And here you did it in the form of a pixelated walking simulator. Hats off indeed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game invented a whole ass new genre, and among all of the new games in it i still think this is the best one. What more is there to be said?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have dozens of hours on the mobile version. Cross saving is a little obtuse, but really adds to the progression. The perfect \"pick up and play\" game. Good for a bus ride into work and good for hours of fun at night. Co-op is so much fun with my 6 year old daughter, who only has to focus on movement and choosing the right items. This game launched a genre for a reason. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly addictive, but do not play it right before your bedtime; you might experience the ``I will play just one more short round`` phase",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Given the task to find the vampire, found addiction and fun instead. Recommended to play with the DLCs especially the Castlevania collab.\n\n[i] It's not a miserable liitle pile of secrets. [/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're good and you're strategic with your weapons you can literally stand in place and NOTHING can touch you.\n\nThis game gives my brain the good scratchies. At 231 hours (at the time of this review) I STILL have things to unlock (The Castlevania DLC has so much game in it). Get this game and be mentally ill about it with me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, awesome DLC, great soundtrack. Keeps you coming back for more. Always pick Garlic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, so much content for the price!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing bang for buck, addicting game that turns into a blackhole for your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive adrenaline rush type of game.  It takes a few rounds to get used to it, but once you get the concept a lot of fun. Go go Kazoo!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only gripe with the game is the fact that some of the DLC doesn't have achievements, and 100% completion is locked behind certain paid DLCs, but besides that, it's a damn fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has an interesting problem where it now feels like it has too much content. There are so many unlockables, that I feel like even though I can get five of them in one run with enhacned speed, it still feels like it is taking forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is incredibly replayable and all the dlc feels reasonably priced without being overbearing; hell, Ode to Castlevania alone is worth three times as much. this game feels like a love letter to a genre it popularized. the soundtrack is impeccable and the characters feel unique.\n\nkeep it up poncle, i love you guys",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The explosions of loot, the wonderful 4bit graphics, the c o m e d y, its...perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. Only issue with it is I cant play it for the first time again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was late to the party. What a game, 50 hours spent in a matter of days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has very good music, creative levels, tons of content, free DLCs, and it’s cheap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing. So fun and addictive, its a game I never thought I would be into. The DLC and the free updates have been awesome. Great work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ngl, Poncle is one of the best indie devs I've seen. Constant content updates, fun collabs with other games, and all already on top of a game with some great gameplay!\n\nSeriously, this game is extremely fun and cheap too. Definitely worth your money!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vampire Survivors is hands down one of the best value games on Steam. For the price of a coffee, you get dozens (if not hundreds) of hours of addictive gameplay. Simple mechanics hide incredible depth, and every run feels fresh. If you care about time played versus cost, this is an unbeatable purchase.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There has never been a game with this high of a value VS cost ratio, ever. This is the kind of game that will suck you in for countless hours of \"just one more run!\" and it doesn't hurt that extremely reasonably priced DLC (dare I even suggest that this game's DLC may be *underpriced*?!) and even game patches add new content fairly regularly.\r\n\r\nSeriously, you really don't need me telling you that this is an amazing game, but I'm going to do it anyway because I'd like to support the developers.\r\n\r\nThis is an amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I wanted to like this.\r\n\r\nI can't play more than a few matches in a row because it feels very unrewarding and... I dunno, unfun. It sucks the joy of playing video games out of me as I try to play it.\r\n\r\nI have no idea what I'm supposed to do to progress. Knowing who to use or what stage to complete for the next unlock you need to continue in the game itself is completely unclear.\r\n\r\nYou can unlock stages well before you have the upgrades to beat them. Exclamation points draw you to stages that have seemingly no objective left to complete.\r\n\r\nAnd worst of all, every match either feels too easy or is frustratingly impossible. You can either walk the map with impunity, as if there were no mobs spawning around you, or you're being hopelessly overwhelmed and were doomed from the start, regardless of choice and skill.\r\n\r\nI had such high hopes for this, but I've been sorely disappointed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bugged. Cannot play co-op. Controller inputs are just bugged - cannot select a 2nd player. I bought the game in bith ps5 and pc and both had the same issue. As soon as any button was pressed on the 2nd controller, the game would just show \"it's not your turn\" in slot 4 and be atuck there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, until it randomly deleted all of my progress after playing for 25h. Can't say I recommend it if this can happen.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Addictive and not particularly fun.\r\nGame abuses dopamine system.\r\nI would not recommend it to anyone, just like heroine.\r\nUnlike heroine it gives no joy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix coop please it either breaks due to bugs which make both players no longer being able to input anything the game accepts until another player leaves or just randomly kicking you due to \"steam losing connection\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poncle, I love your game, I bought it for 3 of my friends and we have all your DLC.\n\nWhile we all understand the new online mode is exactly what it is; NEW. There are many a problem we face. \n\nOpening chests during late games will cause all of us in the game to be hung up and nobody can open the chest forcing one or all of us to ALTF4 and reboot the game.\n\nThis has been an ongoing thing for the past 4 days as I post this comment so it's not a one time thing to complain about.\n\nThree times just on the night I am sending this, our game has frozen during online play and while all our Survivors could move. we could not interact with floor drops, pause or see the other players move at all, all while being immune to damage and dealing none to the enemies.\n\nOnce again, I love your game and understand that the function is NEW so I can't bitch too much, I just want to inform you and others reading that this is a problem we are facing at the moment.\n\nThank you very much for readin",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "cool as a gimmick and has flashy effects, but... ultimately a mindless experience that's only truly enjoyable with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I respect that this game popularized the genre, but it sucks nowadays.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really needs to work on the pacing of early game. It is mind-numbingly slow and tedious to start",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Updates to the game have made the DLC content unfun, requiring  you to re-purchase prevoius unlocks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy playing this game. It is very well made. Even with the retro graphics, it is very visually satisfying. Yet, I find myself feeling disappointed after playing it. It is similar to spending time mindlessly watching videos on social media.\nI prefer games I play to be more thoughtful and engaging. There is absolutely a time and place for games like this. It just isn't for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Loved this game so much but I can't support the developers choice as an indie dev, to go exclusive on meta. Leaving your STEAM supporters high and dry that got you here. Weak, devs. Weak.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Keeps crashing my steam deck and has an annoying bug where it always finds the stram deck as a 3rd player even ifnyou dont want to with no option to not have them there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the game, it is fun, but please, stop adding new achievements. You're forcing completionists to get back to the game. I don't like to be forced, I want to return to the game when I want it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game no longer works after online coop update. Always forces you to team up with an extra player who never selects a character.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much grinding, 30 minutes per run is too long to play a game like this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "all i want is a working mod or cheat to drastically increase the magnet radius. this is my most hated mechanic in any game, and i cannot enjoy the experience otherwise. there is a paltry in-game option for a power up as well as a hidden cheat menu, but even these options are not capable of providing a fun time. oh well.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This retarded ass flash game just crashed my entire computer over a multiplayer networking bug. On the previous patch, playing in windowed mode caused the entire game to crash on start. People will excuse this game being broken garbage because it's $5 but I've played more stable flash games for free.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Pioneer of the genre but the game itself is quite surface level and mundane. Makes sense since games inspired built upon the concept but even then this is way too dated to be enjoyable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I bought this game because of the characters you can set your clubs suit to in Balatro, Potion Craft was the only one I was extensively familiar with. That, and this game was also dirt cheap.\n\nI'm sorry. I really, really tried to like Vampire Survivors, but I can't. The early game isn't engaging in the slightest.\nI really can't understand how this \"dopamine simulator\" is supposed to be hooking me when I've spent the past hour watching my character attack the air for me at a snail's pace.\n\nYes, I tried getting the upgrades. I upgraded Might, like, four times, just as the guides told me. But *I* still get mowed down because my Fire Wand decided to shoot at some borderline invincible zombie instead of the crowd of bats, or my five knives just don't do enough damage. I thought I was the one supposed to be doing the mowing!\n\nWhen I *do* get kills, all the XP ends up pooling within a cluster of enemies that I have to spend what, in this game, feels like a purgatory sentence just to herd everyone away from the loot.\nAnd when I finally get there, I can only pick up a good 30% of the orbs before the horde catches up with me and forces me to run away again. This whole time, I'm flailing two whips around while the bad guys pool everywhere except where my hitboxes are.\n\nI also don't get how casino noises make this game a \"gambling simulator,\" as I've seen some say. In the hour I played, I didn't notice any RNG come up once.\nFire Wand doesn't count.\n\nYou guys have fun, but I don't care what the trailers and end game builds look like. I'm not going to make myself wade through another grinding chore when I can just get my $3.something back and buy my TF2 Medic another obnoxious hat, or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, every minute on this game reminds me that there's a bunch of more engaging games on my todo list.\n\nI get it, I just don't need a time-killer that badly I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My only praise for this game is it really is something you can idly play without having to put any brain power into it.\n\nMy many complains for this game are the forced black bars at the sides which serve 0 purpose, the lengthy grindy approach the game takes to the roguelite genre, the severe lack of difficulty in any of the game's content, a lack of originality in any of the basegame content, all of it mostly being elements stolen from castlevania and the free collab DLC maps being very lazily made, simply being a png compressed and slapped on as a background. \n\nI will continue to play this game solely due to how easy it is to idle, but I'd rather actively play games that copied this and did the formula better in every way, such as Picayune Dreams or Bloodshed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's not for me. it takes so long to unlock a new person. even after i bought the dlc; the game tells me that i have to unlock the person by completing a task. that defeats the whole point of me paying cash to unlock the character to begin with. there is no story, just endless waves of enemies. it's like a get the highest score and try to survive the longest. so you can compared your time/score against other players. my mind problem is the unlockables/dlc. it takes way too long. i bought all the dlc bundle so i can play with the characters now. not 40 hours later :( after two hours i unlocked one person who wasn't even dlc. This game feels like a side mode to a bigger game. there was games like this (side modes) as an afterthought to just mess around with. after you beat the main campaign. the gamkic  of this game is playing the same stages over and over...until you unlock new stuff. if there was a story that goes along with it, then ok. but there's not, heck even arcade games had a little story in them. and you keep moving forwarded. you feel like the game is progressing in the plot. i wasn't feeling it after 4 mins of playing. but i gave it a 2 hour and 30 min try. the characters are just way too slow. i played a clone of this game before..i loved it. it played way faster and i prefer the gameplay of that one. but i'm not feeling this one. different things for different people. there's no filters or graphic options too. so i can't make the game look prettier. i wish the game was faster, gave out rewards quicker (the progress felt so slow), and not having to unlock dlc characters (i already paid for) behind a so many tasks. imagine if a fighting game did this? people would be so mad, heck, any other game. we're welling to pay for dlc characters because we want them now. not paying for them and having to do an ungodly amount of task to unlock them. replaying the same stages in different ways to unlock them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It has that old like retro game feel but the game itself doesn’t feel good. There’s like no cool abilities unless you buy stuff or spent a ton of time unlocking.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Vampire survivors is not a video game.  It is a slot machine masquerading as a video game.  It just employs enough deceptive design to disguise that fact from most of its players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is barely a game and just one step removed from AFK RPGs. \nIf you don't like gameplay and adore looking at flashing numbers, I guess this one's for you.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "horrid UI, multiplayer doesn't work for shit, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played 20 Minutes Till Dawn before this so this just seems like a watered down version of that. The fact there's no attack button and all you can do is move is pretty lame.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game too much fun, will suck your life away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dude put vr mode as a fucking facebook exclusive, actual r3tard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can see why it's well liked, but its one step above a clicker game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "indrecibly boring. Survivor.io does it better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "belki linç yiyeceğim ama hayatımda oynadığım en sıkıcı oyun bu olabilir.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Super overrated.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the progression is really slow",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Stupid snakes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Go play Holocure tbh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLAYING PAINT DRYING",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "REDDIT!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i am quiting my life",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad rng",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the latest update, the max item slots in couch coop were reduced from 4 to 2 per player. This completely breaks the balance and progression for duo play. How are we even supposed to reach the Grim Reaper (30-minute mark) with only 2 upgrades? Some weapons (like Peachone and Ebony Wings) are already useless early on without evolving, and now evolution is basically impossible because you can’t hold both needed weapons. (Maybe with Exdash but do I need cheatcodes to progress?)\r\n\r\nI started playing this game with another person, and we wanted to unlock everything only by playing duos. We put around 10 hours in - having fun, progressing steadily - then suddenly there’s an update, and this massive change hits without any mention in the patch notes. No explanation, no reasoning. Our progress didn’t just slow down - it pretty much died.\r\n\r\nI’m not interested in using cheat codes or having one player sit out just so the other can unlock things. Why even make coop mode if you’re going to cripple it like this?\r\n\r\nI saw people saying online that you can “unlock Party Mode” from the West Wood map by gambling with someone \\ but what even is West Wood? Where do you unlock it? Can I even reach that point playing duo with only 2 item slots each? Also a bit separate matter but the Wiki is zero help with anything regarding couch coop.\r\n\r\nTo make it worse, the game now crashes around the 25-minute mark since this same update. What even changed in the base game if the update was only supposed to add online coop? \r\n\r\nAll in all, this update feels rushed, untested, and uncommunicated. Vampire Survivors used to be a so fun in couch coop but now it's just unplayable.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Not sure what they did, but the last patch/update causes it to crash about 10 minutes into a game every single time now :/",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I wanted to like this.\r\n\r\nI can't play more than a few matches in a row because it feels very unrewarding and... I dunno, unfun. It sucks the joy of playing video games out of me as I try to play it.\r\n\r\nI have no idea what I'm supposed to do to progress. Knowing who to use or what stage to complete for the next unlock you need to continue in the game itself is completely unclear.\r\n\r\nYou can unlock stages well before you have the upgrades to beat them. Exclamation points draw you to stages that have seemingly no objective left to complete.\r\n\r\nAnd worst of all, every match either feels too easy or is frustratingly impossible. You can either walk the map with impunity, as if there were no mobs spawning around you, or you're being hopelessly overwhelmed and were doomed from the start, regardless of choice and skill.\r\n\r\nI had such high hopes for this, but I've been sorely disappointed.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I honestly don't see the appeal to this game. Got this game when I first got my Steam Deck when it came out and only play it when I'm bored and on the Steam Deck. I could be doing something wrong, but I can't complete the game and I end up getting bored way to quickly. Could be the fact that you just control your character and that's it, but there seems to be no strategy and it's pure just luck if you get good items in the game. Seems to have no differences between each character too. Don't see the hype for this game or games like this.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Bugged. Cannot play co-op. Controller inputs are just bugged - cannot select a 2nd player. I bought the game in bith ps5 and pc and both had the same issue. As soon as any button was pressed on the 2nd controller, the game would just show \"it's not your turn\" in slot 4 and be atuck there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, until it randomly deleted all of my progress after playing for 25h. Can't say I recommend it if this can happen.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Addictive and not particularly fun.\r\nGame abuses dopamine system.\r\nI would not recommend it to anyone, just like heroine.\r\nUnlike heroine it gives no joy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix coop please it either breaks due to bugs which make both players no longer being able to input anything the game accepts until another player leaves or just randomly kicking you due to \"steam losing connection\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poncle, I love your game, I bought it for 3 of my friends and we have all your DLC.\n\nWhile we all understand the new online mode is exactly what it is; NEW. There are many a problem we face. \n\nOpening chests during late games will cause all of us in the game to be hung up and nobody can open the chest forcing one or all of us to ALTF4 and reboot the game.\n\nThis has been an ongoing thing for the past 4 days as I post this comment so it's not a one time thing to complain about.\n\nThree times just on the night I am sending this, our game has frozen during online play and while all our Survivors could move. we could not interact with floor drops, pause or see the other players move at all, all while being immune to damage and dealing none to the enemies.\n\nOnce again, I love your game and understand that the function is NEW so I can't bitch too much, I just want to inform you and others reading that this is a problem we are facing at the moment.\n\nThank you very much for readin",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "cool as a gimmick and has flashy effects, but... ultimately a mindless experience that's only truly enjoyable with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I respect that this game popularized the genre, but it sucks nowadays.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really needs to work on the pacing of early game. It is mind-numbingly slow and tedious to start",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Updates to the game have made the DLC content unfun, requiring  you to re-purchase prevoius unlocks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy playing this game. It is very well made. Even with the retro graphics, it is very visually satisfying. Yet, I find myself feeling disappointed after playing it. It is similar to spending time mindlessly watching videos on social media.\nI prefer games I play to be more thoughtful and engaging. There is absolutely a time and place for games like this. It just isn't for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Loved this game so much but I can't support the developers choice as an indie dev, to go exclusive on meta. Leaving your STEAM supporters high and dry that got you here. Weak, devs. Weak.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Keeps crashing my steam deck and has an annoying bug where it always finds the stram deck as a 3rd player even ifnyou dont want to with no option to not have them there.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the game, it is fun, but please, stop adding new achievements. You're forcing completionists to get back to the game. I don't like to be forced, I want to return to the game when I want it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game no longer works after online coop update. Always forces you to team up with an extra player who never selects a character.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much grinding, 30 minutes per run is too long to play a game like this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "all i want is a working mod or cheat to drastically increase the magnet radius. this is my most hated mechanic in any game, and i cannot enjoy the experience otherwise. there is a paltry in-game option for a power up as well as a hidden cheat menu, but even these options are not capable of providing a fun time. oh well.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This retarded ass flash game just crashed my entire computer over a multiplayer networking bug. On the previous patch, playing in windowed mode caused the entire game to crash on start. People will excuse this game being broken garbage because it's $5 but I've played more stable flash games for free.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Pioneer of the genre but the game itself is quite surface level and mundane. Makes sense since games inspired built upon the concept but even then this is way too dated to be enjoyable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I bought this game because of the characters you can set your clubs suit to in Balatro, Potion Craft was the only one I was extensively familiar with. That, and this game was also dirt cheap.\n\nI'm sorry. I really, really tried to like Vampire Survivors, but I can't. The early game isn't engaging in the slightest.\nI really can't understand how this \"dopamine simulator\" is supposed to be hooking me when I've spent the past hour watching my character attack the air for me at a snail's pace.\n\nYes, I tried getting the upgrades. I upgraded Might, like, four times, just as the guides told me. But *I* still get mowed down because my Fire Wand decided to shoot at some borderline invincible zombie instead of the crowd of bats, or my five knives just don't do enough damage. I thought I was the one supposed to be doing the mowing!\n\nWhen I *do* get kills, all the XP ends up pooling within a cluster of enemies that I have to spend what, in this game, feels like a purgatory sentence just to herd everyone away from the loot.\nAnd when I finally get there, I can only pick up a good 30% of the orbs before the horde catches up with me and forces me to run away again. This whole time, I'm flailing two whips around while the bad guys pool everywhere except where my hitboxes are.\n\nI also don't get how casino noises make this game a \"gambling simulator,\" as I've seen some say. In the hour I played, I didn't notice any RNG come up once.\nFire Wand doesn't count.\n\nYou guys have fun, but I don't care what the trailers and end game builds look like. I'm not going to make myself wade through another grinding chore when I can just get my $3.something back and buy my TF2 Medic another obnoxious hat, or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, every minute on this game reminds me that there's a bunch of more engaging games on my todo list.\n\nI get it, I just don't need a time-killer that badly I guess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My only praise for this game is it really is something you can idly play without having to put any brain power into it.\n\nMy many complains for this game are the forced black bars at the sides which serve 0 purpose, the lengthy grindy approach the game takes to the roguelite genre, the severe lack of difficulty in any of the game's content, a lack of originality in any of the basegame content, all of it mostly being elements stolen from castlevania and the free collab DLC maps being very lazily made, simply being a png compressed and slapped on as a background. \n\nI will continue to play this game solely due to how easy it is to idle, but I'd rather actively play games that copied this and did the formula better in every way, such as Picayune Dreams or Bloodshed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's not for me. it takes so long to unlock a new person. even after i bought the dlc; the game tells me that i have to unlock the person by completing a task. that defeats the whole point of me paying cash to unlock the character to begin with. there is no story, just endless waves of enemies. it's like a get the highest score and try to survive the longest. so you can compared your time/score against other players. my mind problem is the unlockables/dlc. it takes way too long. i bought all the dlc bundle so i can play with the characters now. not 40 hours later :( after two hours i unlocked one person who wasn't even dlc. This game feels like a side mode to a bigger game. there was games like this (side modes) as an afterthought to just mess around with. after you beat the main campaign. the gamkic  of this game is playing the same stages over and over...until you unlock new stuff. if there was a story that goes along with it, then ok. but there's not, heck even arcade games had a little story in them. and you keep moving forwarded. you feel like the game is progressing in the plot. i wasn't feeling it after 4 mins of playing. but i gave it a 2 hour and 30 min try. the characters are just way too slow. i played a clone of this game before..i loved it. it played way faster and i prefer the gameplay of that one. but i'm not feeling this one. different things for different people. there's no filters or graphic options too. so i can't make the game look prettier. i wish the game was faster, gave out rewards quicker (the progress felt so slow), and not having to unlock dlc characters (i already paid for) behind a so many tasks. imagine if a fighting game did this? people would be so mad, heck, any other game. we're welling to pay for dlc characters because we want them now. not paying for them and having to do an ungodly amount of task to unlock them. replaying the same stages in different ways to unlock them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It has that old like retro game feel but the game itself doesn’t feel good. There’s like no cool abilities unless you buy stuff or spent a ton of time unlocking.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Vampire survivors is not a video game.  It is a slot machine masquerading as a video game.  It just employs enough deceptive design to disguise that fact from most of its players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is barely a game and just one step removed from AFK RPGs. \nIf you don't like gameplay and adore looking at flashing numbers, I guess this one's for you.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "horrid UI, multiplayer doesn't work for shit, not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I played 20 Minutes Till Dawn before this so this just seems like a watered down version of that. The fact there's no attack button and all you can do is move is pretty lame.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game too much fun, will suck your life away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dude put vr mode as a fucking facebook exclusive, actual r3tard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can see why it's well liked, but its one step above a clicker game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "indrecibly boring. Survivor.io does it better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "belki linç yiyeceğim ama hayatımda oynadığım en sıkıcı oyun bu olabilir.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Super overrated.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}