{
  "positive": [
    {
      "review": "Nine sols was a fun game to play that had very enjoyable boss fights, especially the last boss. The story itself was engaging and the mc was interesting to follow along with. I highly recommend this game if you like metroidvania type games like hollow knight.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I did not expect Sekiro in 2D, but here we are. Nine Sols is an interesting deviation from the devs of Red Candle, but the game surprisingly works quite well and has horror elements on top of that, which is appreciated. While the game is not platform-focused, the combat is the main highlight. You can dodge with invincibility frames, parry, and even do the second phase of parrying against hard-hitting attacks. \r\nThe art style is great as well; the contrast between cute animal-like humanoids and the gore does hammer down that the world of Nine Sols is brutal as heck.\r\nThe game is overall hard and can be frustratingly hard with some bosses, especially the last boss, who kicked my ass so many times. And with the true ending, it is even harder but satisfying, surprisingly. Great game overall.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Deflection feast! Deflection here deflection there deflection everywhere! \nOne of the best in its genre!\nThe combat is quite challenging and enjoyable, the bond between Yi and Shuanshuan is heart warming, the conversations and flashbacks are somewhat bittersweet and intriguing. \nOverall, 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nine sols might be the best 2D souls-like game I've played, with decent combat (outstanding quick & strong parry mechanic for types of attacks and details like where to face) and great story with the theme (which hooked me to the game) of a modern civilization with very advanced technology trying to alternate their world to their benefits with the leadership of all 9 kingdoms. \r\nDespite the solid souls-like gameplay mechanics or great 2D platforming sequences, to me the most impressing part of this game is that the great narrative / storytelling and unique aesthetics choice of introduction of each character. Each NPC you come across mostly changes the gameplay, hence the level design. Especially transition of modern, tech visual fxs into the cartoonish comic pages feels very appropriate.\r\nAlso every music and soundtrack in game is banger and on point, creating soothing home atmosphere to  demon crawling out of metallic robot anus vibes.\r\nExploration is never boring with every new mechanics learned along the story and and each rewards you deeply with hidden treasures, new shortcuts and areas, optional bosses etc. Also discovering the story while traversing everywhere and collecting lore particles there and there while solving puzzles and hack sequences was really fun. Another great tool that changes platforming is that our handy scout drone named \"mystic nymph\", which is needed most of the hacking sequences to unlock sideways and shortcuts. With that drone you may route your way and scout unknown areas without risking your character.\r\nAnother great point is that the safehouse, the base that you mostly chill and upgrade your items is very lively and it gets livelier with each character, every time you progress the main and side storylines. Amidst the dark nature of the story, the balance of wholesomeness is amazing to see and very motivating in player perspective.\r\n10/10 would play the future games from the devs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely fantastic game, if you like fast paced action games with parry focused this is a must play.\n- Each boss fight felt unique, some were easier some were harder ofc, but no repeat of any boss.\n- Great banger soundtracks.\n- Decent level design and exploration feels rewarding good enough.\n- Combat is absolutely the most fun part of this game. It feels extremely satisfying to pull off parries.\n- Boss introductions and the comic style for it is amazing, and absolutely beautiful art style.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nine Sols was very fun to play and had very enjoyable boss fights and an engaging story. \n\nDefeating the bosses requires trial and error to learn the boss movement sets. So it feels really rewarding to defeat the boss after analyzing the movements to act accordingly. \n\nWhat makes the game unique is the parry system, so naturally learning and mastering the various parries is a must! Otherwise it’ll be really hard without it. Simply avoiding all attacks through dashing and jumping around doesn’t always work out, cause you’ll get sometimes damaged even though the boss or an enemy didn’t hit you. \n\nThe soundtracks are peak and makes the boss fights even more enjoyable.\n\nWould play it again 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Masterpiece of a metroidvania, a lot of people like to compare it to hollow knight and even though it did take inspiration from it, I believe comparing it doesn't do it justice and ruins the experience. \r\nThe art style is beautiful, our protagonist, Yi, is so badass and its great to see his character evolve throughout the game, the combat is so fluid, the parries and jades make the combat complex but so satisfying if you get it right, but ultimately the best thing about this game has to be the boss fights. Every  boss fight (except goumang) is constructed pretty well and tests your knowledge up until that point of the game, every exchange feels like a dance and the final boss has to be my fav ever. \r\nThe game isn't perfect by any means, the story, even though good, isn't that complex. The storytelling is pretty straight-forward but I believe anybody who is into metroidvanias or likes parry-based combat should give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have no idea how to place this game.\n\nExcellent story revealed slowly that had me gripped throughout. Nail-biting gameplay that had me up multiple nights trying to do pattern recognition and speed up reaction time.\n\nWatching this little dude do ninja hand signs to control sci fi technology sounds dumb but was the coolest thing I've seen in awhile.\n\nBut I can't recommend this game to most people. If you have difficulty parrying, go story mode. It's rough but especially the last boss. If you found parrying in sekiro fun, I cannot recommend this game enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Peak game with excellent combat and great boss fights.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What an adventure and so glad I gave this game a try. The start of the game is somewhat slow, but once you start getting to your first boss fight, oh boy what an experience. All boss fights and settings, it's 100% a must play metroidvania.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ever since I played Ender Lillies earlier this year, I’ve been playing a number of Metroidvania games, since it got me very interested in that style of video games. Nine Sols was the one I tried after the Ender games, since it was created by a studio I’ve played and enjoyed games from before. Strangely, I know this studio for their horror games like Detention, so it took me until I looked at the developer name on Steam to realise it was the same people. And I’m really happy I did take notice because otherwise I would’ve probably not played this til much later. Which would’ve meant I’d miss out on one of the best side scrollers I’ve played in years.\r\n\r\nNine Sols' main draw is the combat system first and foremost. The combat is surprisingly simple, comparable to Sekiro’s combat system, not just because of the parry system but also due to its simplicity. You parry and attack with either a strike, paper bomb, or projectile and use jumping and dashing for maneuvering. That’s it. But the depth comes from the number of ways you can parry, how well you can time attacks, parries, and use paper bombs effectively while dodging attacks. I adore this combat system because of how much you can do with it. The potential in bosses, enemies, and levels is unbelievable. And thankfully, they utilise their systems well and built a fantastic game around it. They don’t feel unfair, so I never found myself getting angry, just hyper-analysing what I did wrong and how I can play better.\r\n\r\nThe final boss is also a monumental feat. It applies every bit of mechanics and design displayed in the game and culminates them into a phenomenal boss that truly feels satisfying. The regular enemies have great mechanics as well. Usually, teaching the player new attacks or movement that lead into the boss of that area perfectly. There were a few enemies I didn’t like as much as the mutated enemies towards the end, but they were still fine. The game has great build variety in the forms of jades as well. These are equippables that can affect things like slash attacks or parries, or give you a new ability related to them. Challenge runs of this game are especially satisfying.\r\n\r\nThe overall level design is great, with intense platforming and combat that uses enemy placement to its advantage. It doesn’t feel unfair and has specific rhythms depending on the area. As long as you have the right rhythm, then it becomes incredibly satisfying to traverse through levels. Side quests through exploration aren’t frequent, but it feels nice to make the people in your hub happy, as well as to learn more about them. The ones related to the apemen were my favourites. Shennong’s drinking sessions were fun, and I like how the storyline ends. Shaunshaun deserves eternal happiness, so bringing him stuff to try out and learn about is incredibly wholesome. I’d die for Shaunshaun. I also found the message board secret a little emotional. I don’t have many thoughts on the story other than I really enjoyed it. Seeing the cracks in the Solarian's plans and how much they’ve fucked up was deeply frustrating and depressing.\r\n\r\nThe sound design in Nine Sols is excellent. The soundtrack is great, with some excellent boss tracks, but the real standout here is the sound effects. Some of the most satisfying sound design I’ve heard in an action game, which is a massive statement from me. Hearing the perfect parry sound effect is basically equal to snorting multiple lines of coke; it’s that dopamine-inducing. I expected great sound design from the people who made Detention (which you should absolutely check out), but I didn’t expect it to be THIS good.\r\n\r\nFinally, the game’s visuals are great. The game has a very nice art style, and the overall art direction creates a memorable-looking side scroller. The backgrounds and character designs are unique and memorable as well. I NEED to get my hands on a YI plushie and especially a Shaunshaun plushie. Preferably, both made by Shaunshaun himself. There were many times when I had to stop just because of how nice a scene looked. The game also utilises horror in its visuals effectively to creep you out. It reminded me that these developers made two great horror games before they made Nine Sols. I appreciate the cozy hub in the game as well. It’s nice to just sit around, have the ambience in the back, maybe smoke a bowl with Yi while you’re at it.\r\n\r\nI wish there were more content in Nine Sols; some bosses felt like they needed another phase, and it would have been great to have another area and story boss. Or maybe even a secret area with a secret boss. The core game is so good that I felt just the tiniest bit dissatisfied by the end. Even still, it manages to pull off almost everything it wanted to fantastic levels of quality. And I hope they make some DLC for this or a spiritual successor because they have something special with these core mechanics.\r\n\r\n9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Игра в принципе очень даже достойная. Думаю, одной из главных её проблем является её неприглядность — не знаю, как по-другому выразиться. Первые часы геймплея настолько скучные и утомительные, что сильно отталкивают от игры в начале. Даже хк, который имеет в принципе достаточно похожую проблему, за счёт своей музыки и прекрасного стиля лучше справляется с тем, чтобы сохранять внимание игрока, пока игра не закрутится и не станет ахуенной. А тут что? Ты видишь вроде нормальную графику, зато с максимально странными анимациями, будто зашёл во флэш игру десятых годов, тонна диалогов с непонятными китайскими именами и скучным файтом. Но постепенно игра становится всё более разнообразной, интересной и геймплейно глубокой. Если честно, мне так и не понравился дизайн этого мира, он казался относительно скучным, но местами было нормально что уж. Реальный плюс этой игры, естественно, боссы, с которыми в совокупности с геймплеем и механиками гг реально очень интересно файтиться.\r\n\r\nПо итогу я даже не знаю: с одной стороны, мне не понравился стиль игры, ни музыка, ни мир, но зато сюжет неплохой, а босс-файты весёлые.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It is a fantastic title, at first the only appealing aspect from the game might seem to be the artstyle, fortunately the game develops quite fast from the start into a really interesting setup to keep us entertained, still, not much is known from the start and the story becomes clearer as you progress.\r\n\r\nThe gameplay starts simple too, basic attack with a 3 hit combo, a dash and a simple parry. This doesn't stay that way for too long and it doesn't really take much time to fully unlock all the mechanics of the game, allowing it to be really fun early into the game.\r\n\r\nHowever my favorite aspect from the game and one that I wasn't really expecting to shine here was the writing. From the worldbuilding aspect, to the character writing, to the core story, everything is done beautifully. For those people that might've not been interested into a revenge story, as the game promoted itself as lol, don't worry, it is so much more than that and it isn't as edgy as it might seem at first glance.\r\n\r\nAlso the soundtrack? Jeez, truly, it is filled with bangers from left to right but also contains a really nice ambience sountrack that fits each atmosphere beautifully.\r\n\r\nI really loved this game, It offers around 30 hours of content and I really hope that we get a sequel to the game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Highly recomend to anyone who is into metroidvanias, or someone looking to get into the genre in this game's Story mode, I beat the game on standard and have completed both endings. It's a fun spin on the metroidvania genre, with a parrying system akin to Sekiro, and a more linear experience for anyone who is fed up of getting lost on Pharloom/Hallownest. Bosses are insane amounts of fun, and the story is woven around the mechanics and characters in such an amazing way. 10/10, would highly recommend this for anyone interested. \r\nI'll definitley be returning to platinum soon",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is honestly kind of underrated considering hollow knight's popularity. IMO it stands side-by-side with HK in terms of sheer quality.\r\n\r\nThe storytelling here is also a lot more forward and the comic panels really improve the experience by a lot.\r\n\r\nThen there's the combat. Its honestly incredibly well-designed and satisfying to play. The parry mechanics and everything that surrounds it like the jump parries and the charged parries are all very well-designed and interesting to master.\r\n\r\nThis is a solid game and a high recommend for any metroidvania fan.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Somehow managed to make a souls-like without any bad (or even mid for that matter) bosses and only one slightly annoying area. The story is also decent but it's pretty clear what's more important when comparing gameplay and story.\r\n\r\n10/10 maybe the most fun I've had playing a game like this since Dark Souls 1.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best 2D combat I've played, story was really well done, art is fire, exploration was good, almost no bullshit or unfair fights/mechanics.\n\nThe difficulty spike of the final boss was kinda brutal though. IMO the later game bosses should've been harder to match this. 9.9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Decided to check this out while I take a break from silksong as the taopunk theme interested me.\r\n\r\nSo far I'm loving the game, and liking how much more story heavy it is, looking forward to seeing what happens next.\r\n\r\nArt is pretty and gameplay feels good (even if I'm kind of garbage at it), definitely need to take some time to get good at parrying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A masterpiece. One of the best games i have ever played, in my opinion better than silksong, the combat was amazing ,nothing feels better than executing back  to back perfect parry's and dodges (and other stuff that will not be spoiled for you) . Also the story was rich and exiting , every time i found a new item i was eagerly waiting to give it to shuanshuan(loved the little dude) ,the lore betwen yi and the bosses was crazy, you could feel the tension , but even after all the fights and thinking the game started to making you think ,maybe you are the bad guy. Honest review 10/10 definitely worth the price if your up for the challange. Also i think it goes for 20 dollars on sale. Cant recomend it more",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Parry this dick\r\n\r\nI love this game\r\n\r\nParry deez nutz\r\n\r\nGong Noises\r\n\r\nParry this parry that\r\n\r\nApe stronger together \r\n\r\nI'm actually allergic to cats\r\n\r\n10/10 would parry again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I came back to this Game after play it in Game pass and play Silksong. It is a must play if You like metroidvanias. It is demanding and fun, more inclined to parries in combat and don't have to many great plataforma partes but definily a great expierence",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. 9/10.\r\n\r\nParry enjoyers must try it out. Light Metroidvania + Awesome parry based combat/gauntlets/Bosses. And it has a good story to tell. \r\n\r\nNever heard of Taopunk(The setting of the game) before... Looked it up and it is a term coined by the devs of this game. So maybe kinda first of its kind. And I like it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "deserved goty awards, truly a masterpiece, a very beautiful style, great sound design and a wonderful story, would play again 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "SO under apperciated.  Some of the best boss fights that are so fun to replay and master in battle memories.  Game is goreous, I took like 50 plus screenshots.  Just so cool😎",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Metroidvania with Sekiro-like parry mechanics. If that sounds fun to you, you'll love this game. The music and story are also amazing. My only criticism is that there are a few points in the game where it's not obvious where to go next, but story dialogue, key item descriptions, and map data of missing items can point you in the right direction if you pay attention.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really cool and challenging game which can absob you during a few hours. I recommand.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so satisfying to play. The music, the sound effects, the art are all just SO good. I don't think of myself as a super skilled gamer so beating this game felt like a huge achievement, but it also speaks to the quality of the game design because even though it's definitely a hard game, it was fun to learn the mechanics and attack patterns. I'm not the type to repeat boss battles just for the fun of it, but with Nine Sols I can definitely see why others would. I also really enjoyed searching for the collectables, and watching the home base grow and house all my companions felt kind of comforting every time I'd return.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favourite games of all time. The combat which is the main point of the game is so so so fucking good, the best combat in a 2d game ive played. The story is another main focus of the game and it is pretty good aswell but i understand how some people find it annoying considering this is a metroidvania game. The music was a bit weird at first but it grew on me and the artstyle is the cherry on top. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best combat system ive ever seen in a game. I spent 100+ attempts on eigong and i had fun every single attempt. God i love parrying. This game is really really hard but ive never felt that it was unfair. The story is beautiful too, the art also, i love all the characters, most bossfights too. I just love fighting in this game. The music is just okay, often i dont really like it that much though, probably the worst part of the game for me sadly. But oh my god i love fighting in this game so much. \r\n\r\nMy favorite bosses are Eigong and Ji. I love Shuanshuan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This games bosses, sound tracks, level design, story telling, emotional impact its all so amazing I love every little thing that the developers put into this game. I love parrying games with all my soul(pun intended), obviously everybody has different opinions like how they hated the boss fight for the prison but not all games are made perfect but does something really have to be perfect to be enjoyable. Anyways I digress, if you are wondering if you are planning on getting this game then you should know it is quite difficult but that goes without saying if you are talking about a game that fused with hollow knight/sekiro. I loved it 10/10 game for me:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to play understand the story and to get good at",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun, surprisingly not annoying with runbacks and enemy placements, amazing and unique parry system (the lond click parry) and overall highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really incredible experience. There are some boss fights and navigation quirks that are a little obscure and could've used some clearer in-game direction, but the level and fight design is otherwise incredibly well thought out to provide a challenging but not frustrating experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its so fucking good the Story And mechanics are Worth every single penny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is quite interesting, the plot is captivating, and the gameplay is extremely simple and straightforward. I beat the final boss on my first try after seven deaths. 999 dismembered cats out of 999.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game with banger soundtrack and a steep learning curve",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A must-play for all metroidvania and souls-like enjoyers. Wonderful story and themes. Taopunk is fire. I hope to see more of the style and aesthetic out there. Also, more Chinese/Eastern mythos and stories would be nice to see. Very refreshing to see something else that's not medieval European. \n\nAnyways, great game. Highly recommend. Good luck on the final boss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is a great game i love the story even though its kinda sad at times and i hated killing some of the bosses but the character design is great and so is the music all and all great game can recommend this game even at full price and the bundle of the OST and artbook also at full price :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is peak...idk what else to say. its extremely difficult so it feels amazing when you beat a boss you've been trying to kill for a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Immediately upon playing the opening scenes, I thought this would be a cute, Ori-like. Turns out I was dead-wrong... Or mostly. The challenge level ramps fairly quickly, and it becomes MUCH more like a Souls (really, it's in the name) or Hollow Knight type game. The art is beautiful, and connects Eastern elements of martial arts with space-faring technology.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool and visual good but I had higher hopes in this game and wanted it to be more laid back and not that much thinkin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nine Sols is amazing, action-packed, and thrilling game. The story is really fun without being extremely complicated or overbearing. Yi's relationship with the other characters are really entertaining. For someone who played Hollow Knight and God of war, I really loved the combat in this game; it feels so smooth and makes you feel really good at video games when finally beating a difficult boss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "satisfying parry system and amazing gameplay. story is also good so if you like a good metroidvania, buy it.2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every step of this game was beautiful. The characters, the combat, the music, the story. Truly a wonderful game and one i would highly recommend to any player",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best metroidvania I've ever played. It's unique mechanic (unic in metroidvanias) about parring was the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For context: I never liked souls-like games and I never liked platformers.\n\nThis game, despite all ods, I found to be very enjoyable. The art-style, the original soundtrack, the combat, the progression system – everything is so on-point. If you wound up on this game's store page and it feels interesting to you, give it a try.\n\nI think it's also worth pointing out that the game is not punishing to those of us who are new to the genre, while also offering a fair challenge. So, if you haven't played similar games before, this one should serve as a good entry into souls-like platformers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Очень крутая игра чтобы потешить себя тем насколько ты крутой, ведь за каждое точное парирование твои уши ласкает очень приятный звук кричащий, о том насколько ты хорошо играешь.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would be satisfied if my years-long video game journey ended here. Because after years, I have finally found it. The perfect boss fight. Eigong. You raised the bar in ways I thought unimaginable.\r\n\r\nDay 1, I go to bed after attempting you for 5 minutes. At the time, you feel impossible. A part of me feels crushed, but another eagerly waits in anticipation. You visit me in my dreams, insisting that I defeat you.\r\n\r\nDay 2, I am able to consistently beat your first phase. I still get some tells mixed up but I understand what I need to do now. It's just a matter of making it happen.\r\n\r\nDay 3, I struggle against your second phase. I die over and over. Your opening move feels impossible at first... But once the rhythm locks in and my hesitation dissipates... your second phase becomes even easier than the first. I'm getting closer. Just you wait, Eigong.\r\n\r\nDay 4, I make it to your third phase. The attack I've heard horror stories of... is not as bad as I had envisioned. As long as I can get this rhythm down, you'll be a cakewalk. And it was. I defeat you. I feel half triumphant and half empty inside. Because I know that I will never be able to defeat such a magnificent boss for the first time ever again. Not once did you feel unfair. Not once did I want to ball up my fist and furiously slam my desk because of you. Instead, I accepted my error and eventually found the Skill Solution.\r\n\r\nEigong. I feared and questioned you. I thought that maybe you would stop me from completing this wonderful journey, but you instead granted the greatest final impression possible. You are the crown jewel of Nine Sols.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very beautiful game. Perfect for anyone loving games like Hollow Knight and Sekiro.\r\nIt's really hard though. I don't if I'm good enough to beat it. I recommend it a lot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hope this game gets more recognition. Although the story and exploration are mid, the combat is probably the best out of any metroidvania I have played, I feel it is the closest a 2D game can get to Sekiro.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is really worth playing. It took quite a while to get used to parrying, but this was the first time for me to play such game(s). Anyway, no matter how much I suffer, don't regret it xD \nThe dialogues, the plot, the general atmosphere are very good. I don't have to talk about graphics, everything is really at a great level",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy fucking shit, what an amazing Metroidvania the soundtrack is beautiful and the story is so well thought out the game does a great job hooking you on the characters and even has you sitting there wondering if you're in the wrong the entire time you play, like \"Damn I might be the bad guy here\". The true final boss kicked my ass over and over but it was so god damn fun. PLAY THIS GAME.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitivamente uno de los mejores juegos que he jugado. \nLa historia 10/10 al igual que el arte y la jugabilidad. \nEl jefe final me encantó",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game. Love the artstyle and soundtrack. Love that they added baby mode so you can experience the story without having to be good at videogame T0T\r\nYi is a phenomenal protagonist. Love pretty much every character. The story is great nd i loved every interaction.\r\nGameplay is very good but it *is* a harder game so keep that in mind before buying. Well worth the price :]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Это абсолют синема от мира метроидваний или как их там. Понравилась намного больше, чем холлоу найт. Всем советую!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is to Sekiro what Hollow Knight is to Dark Souls. Incredible game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "道龐克相當有趣的風格，不過跟之前玩過的類銀河惡魔城不太一樣，路線都被規定好不能說不想打換一條路，這點比較可惜",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay mechanics were fun, engaging, and excellently developed, but the message and theme of this game stood out far more.\n\nAt first the story was annoying because the player character was a unrelatable genocidal maniac who consistently exhibited his racism, ageism, and transphobia, and he was overall a hypocritical brute. Yet somehow the [i]Catcher in the Rye[/i]-like horrible protagonist of [i]Nine Sols[/i] was used not as a figurehead, but as a guide to what may be my favorite ending to any story game ever. I cannot reasonably explain why the story was so good without major spoilers, but the ending would not have been as powerful as it was without a moronic kidnapping freak to pave the way(with corpses).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game feels SO GOOD to play!!! i'll regularly hop on only intending to do one boss or play for an hour or so and then i blink and like 5 hours have passed. not to mention the gorgeous & distinctive visual design and art. also, i really enjoyed the themes of the story, people always give this game its flowers for the tighter-than-tight boss design (as they should) but they often skip over how well-written it is. additionally, the worldbuilding is really nicely done - even though you only get a few direct glimpses of penglai it feels like a real place with real and deep history, which is really impressive to pull off. lastly, the soundtrack absolutely cooks. buy and play this game NOWWWWWWWWW",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best story telling of a metroidvania. I just love the story so I play in the story mode because the game is in hell difficulty",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolute masterpiece.\nI love parries and this game is all about those.\nThe last boss however has such a huge difficulty spike, but it's definitely worth learning it.\nGoes up into my top 5 games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing game. I sadly got stuck at the end boss, bc she is extremely hard compared to the rest of the game, which is my only complaint. Still definitely worth it though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely stunning art that encouraged me to draw again, the gameplay has you perfect and master the parrying in a fair way, I hold this game dearly in my heart",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I purchased 6 copies of this game for my friends during the last steam sale. That should be more than enough to tell you how I feel about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The thing that actually made me play this game is a silksong tiktok about a guy figjting karmelita and was just parrying her constantly. I have heard of nine sols as part of the great indie games, and that peaked my interest. And boy, it did not dissapoint. It has made me better at parrying than ill ever be (also my fav boss was Ji because shes cool and has a cool attack pattern and rythm). Highly recommend this game to people that wants a challenge for themselves, because man the parrying took me a long time to master but it was so satisfying when i got used to it. Its a 10/10 for me, its so good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Similar to Sekiro in that there'll be a moment when everything just \"clicks\". As a heads up, it'll often take a good 20-ish deaths to each boss just to get the hang of the fights as the timing of the attacks can be weird. Otherwise, it's a wonderful game; I enjoyed the story greatly and the combat felt great once it settled in. Performance was smooth, no stuttering or other weirdness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think this game is very good. I had fun playing it, but not enough fun to justify the price. I think the price can be justified for players who enjoy the game more, but that just isn't the case for me. This game is definitely worth trying tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent Game! Tight controls, good bosses, a bit linear but I'm fine with that. Overall well worth your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incroyable Metroid-like dans un univers hyper original avec des personnages, un lore et une histoire superbes. \r\nC'est par défaut assez difficile (voire très très difficile) mais le \"mode histoire\" permet de doser tout ça à sa convenance sans ruiner l'expérience. (Même en mode histoire on rencontre du challenge). \r\n\r\nPépite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games Ive ever played, it was right up my alley. From the music, to the art, to the characters, the writing, the story, the designs, the combat, the movement, the sound design, the bosses. There was not a single part of this game that disappointed me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember playing the demo a long while back. When the game first came out in full, I bought it, but then it sat unplayed for quite a long time. When I finally decided to play, it was after I had completed Silksong. All I can say to compare the two is: Nine Sols is worthy.\r\nThe story is excellent, starting out incredibly vague as to why the things in the game are happening to begin with, and eventually revealing the answers with plenty of time and clues beforehand for the player to figure most things out on their own.\r\nThe characters are fun, with my only gripe being I kinda wish there were more of them. The cast is very \"efficient,\" with pretty much every character you can talk to being relevant to the plot.\r\nThe gameplay is very fun, with the parry-based combat always being incredibly satisfying when you manage to find the patterns and openings in a enemy's attacks.\r\nThe hand-drawn artstyle is not quite on the level of the Hollow Knight games, in my opinion, but did an excellent job giving the game its own identity. \"Tao-Punk\" is a very good description of the setting, being sci-fi mixed with magical elements and martial arts.\r\n\r\nIt is very worth noting: this game is hard, like REALLY hard. And the final boss (especially if you're going for the true ending) is easily the hardest part of the game, but DAMN is it satisfying to clear each challenge, or to easily take down an enemy you used to see as impossible to beat.\r\n\r\n10/10 would play again if my library wasn't still filled with unplayed games I really need to finally get to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story is really deep and teaches a lesson which might sound cliche but it does a wonderful job. I know I still need to get the true ending and I plan to, but I will definitely ensure I 100% this game first it deserves nothing less.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely peak!\r\nA masterpiece of a game, truly :')\r\nCombat 10/10, Story 10/10, OST 10/10\r\nFavorite Boss: Lady Ethereal \r\nFinal Boss(Ape Ending) was a challenge for me >:(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DISCLAIMER: I'm a huge hollow knight fan so I already knew this game was up my alley\r\n\r\nWhat a game! After being on my backlog for a while I finally decided to actually finish this game and man was it worth it. A truly enjoyable experience in many aspects.\r\n\r\nThe story itself is very interesting with some pretty heavy philosophical topics brought up. It's easy to follow but does not lack depth, if u want to it's very possible to dive deeper by interacting with the world and reading text, but it's in no way necessary to follow the overall plot.\r\n\r\nThe combat takes a little bit to get started as they went with the hollow knight approach of unlocking abilities as you progress, but once u get a few of them the combat really shines! The depth u reach after about halfway through the story is so much fun! Be prepared to spend atleast a few attempts at each boss, but that's exactly what I want from this type of game! It's very forgiving with where u get to respawn each boss, usually a respawn point right beside it!\r\n\r\nAnd the art, oh man the art is beautiful. While simple, it still has so much soul. Each area feels unique, enemies vary greatly, and the bosses are gorgeous. \r\n\r\nOverall an easy \"must play\" for any metroidvania enjoyer!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Es, básicamente, un metroidvania sekiro-like, cuyo combate se centra en los parries\r\n\r\nNine Sols es un juego precioso, con una trama emotiva y muy perturbadora, y con un combate rítmico que se siente muy bien cuando le pillas el truco. Lo único malo, para mí, es que la dimensión de exploración del juego es bastante escasa y simple\r\n\r\nViva el cybertaoísmo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "genuinely such a beautiful and fun game. this game is DIFFICULT but not once did i feel frustrated with it. minimal runbacks (if that). i would say it's barely a metroidvania (no backtracking) but that doesn't detract from it imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Satisfying snappy gameplay mechanics and unique boss fights with equally unique character design and writing with a satisfying emotional story packaged all in for a 10/10 metroidvania.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not waiting to finish the game to recommend. 18hrs in, this is already my favorite metroivania ever, coming from an avid metroivania enjoyer. Its just a homerun on all aspects. I'm just... really impressed!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay and cool story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have only 2 minor problems with the game, but it's really personal and i can see why other people don't see it as problems.\r\nFirst of all, the default difficulty is extremely high. So for people playing this game and getting frustrated i really recommend to lower the difficulty in the options menu. Secondly the story didn't really catch my attention. But as said before this is just a personal preference.\r\nEverything else is very good though. The controls are tight, level design is nice and sound and music are also very good. \r\nRating 8.5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sekiro + Hollow Knight, so yeah pretty good game, the combat is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best end bosses ive ever fought, Story is immaculate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This metroidvania / souls like title delivers an engaging experience. \nThe game’s mechanics are fluid and intuitive, making exploration and combat both satisfying and rewarding. The artwork is visually stunning, with each environment offering unique and memorable designs that enhance immersion. \nCoupled with a interesting story so far (3+ hours) that unfolds naturally as you progress, this game successfully combines “challenging\" gameplay with a rich narrative. \nA must-play for fans of the metroidvania genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing but will NOT hold your hand.  You are going to die a lot, but it never feels unfair.  The music is perfect and fitting, environment is incredible, story is captivating, the platforming is good, and the combat is by far the best 2d combat system i have ever seen.  It flows perfectly and every bossfight feels like a dance between two partners on equal footing.  Overall 9.5/10, must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100000/10 You might compare this game to other metroidvanias but Nine Sols is my fav for many reasons.\n- The worldbuilding blends traditional Chinese mythology with cyberpunk aesthetics. Every environment feels alive with its own cultural history, while the futuristic tech fits seamlessly into the setting.\n- Outside of the satisfying parry combat mechanics, the story is beautifully tragic, layered with philosophical motifs and influence of ancient religion. \n- Lady Ethereal's boss fight design deserves an award!!!!!!!!!!\n- Banger soundtracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is such an amazing game! One of the best metroidvanias of the past few years!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have you ever had the feeling that a game is tailored specifically for you? This is the exact feeling I get from Nine Sols, there's nothing like it! The combat is so dynamic and smooth, to the point you'll hear the \"tong\" every time you hit your \"K\" key even when not playing. It's a bit tricky to adjust to at first, but once you get it, you really get it. It's very reminiscent of Sekiro's fluid combat mixed with the same whimsy I got from Hollow Knight's exploration. The characters are so well written too, every time I see \"can be gifted to ShuanShuan\" on my items, I immediately rush to the pavilion. The storytelling we get too, most of the characters already know what's going on, which leads us the player to have to piece together all the blanks. I'm not gonna lie, I was bawling at the end of this game, it's soooooo good! 10/10 game both story wise and gameplay wise, only complaint is that my 50 hour long game isn't as replayable as I'd like it to be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still hungry for more Metroidvania after Hollowknight and Silksong? Buy this game. It focuses more on combat than it does platforming so its a little different than HK/Silksong but it is a VERY satisfying game once you get use to the combat differences. Bosses are not cheap they are just very tightly balanced with parry based combat and once you get the timing down you feel very full-filled having defeated a boss\r\n\r\nMy only word of warning is there is sort of only ONE way to successfully play Nine Sol's so if your the type of player that needs to use cheesy or EZ boss kill builds in Silksong then Nine Sols may not be for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good overall. Mechanically speaking, this game's biggest weakness is the visual indication for certain actions. For example, it's hard to tell when your character begins the Unbounded Counter and when its effect ends, you have to just keep eating crap until you get a feel for it. Also, lots of enemy attacks give you white flashes or sparks to indicate an attack is coming, but it's not tied consistently to when you're supposed to parry it. You CAN brute force and learn these things, but a slightly better game would just feel consistent and intuitive. I'm additionally not the biggest fan of having to face the attack direction to counter when so many attacks seem to cover a large area.\n\nOutside of what I described, and a few other minor things, it does a lot of things really well otherwise, the music, the world building, the art direction, the platforming. Worth playing if you're a fan of metroidvanias.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I highly recommend Nine Sols if you're a fan of Sekiro (or similar titles), a fan of metroidvanias, or a fan of games with a focus on art and storytelling.\r\n\r\nFrom the striking mix of drawn art style mixed with 2.5 elements, each of the game's biomes beginning to end were beautifully rendered. The OST is expressive and fits the various scenes very well. A few of the boss tracks really stood out to me, including the final boss track.\r\n\r\nThe combat is very polished and more forgiving than you'd think. Parry windows aren't as strict as deflecting in Lies of P, but feel similarly generous to deflects in Sekiro. Once you get comfortable with parrying and dodging the game feels great to play though there can be a learning curve if you aren't used to games like this. There is a 'story mode' difficulty option in case you find yourself needing the reduction in difficulty. Last but not least, the game does feature a boss rush mode that is unlocked after the game's completion which is always a great addition to a game with a strong roster of boss battles.\r\n\r\nThe narrative is well-crafted and was one of my favorite aspects of the game. You play as \"Yi\" who is one of the \"Sols\". Along the way you'll encounter a handful of recurring characters that each have their own charm, and together these characters serve as foils for one another to varying degrees. Throughout the narrative the characters all grow, and all grow together. One word of warning: the game can be quite dark and the depictions of violence can be quite graphic. Nine Sols may not be a horror game like Red Candle's previous work, but there's some its DNA in Nine Sols (I loved it).\r\n\r\nRed Candle killed it with this game. I'm leaving this review just after finishing my first playthrough and I'm definitely going to do a second run to get the last few achievements. Nine Sols isn't just one of my metroidvanias to play, it's become one of my favorite games in general and sits alongside the likes of Sekiro and Lies of P.\r\n\r\nThanks for making this, Red Candle. This game deserves all the praise it has received.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nine Sols is the best narratively driven game I have ever played in my life. The story is absolutely amazing, filled with sorrow and wonder and loss. I won't get into but just trust me with the story, it will all come together in the end. \n\nWhat I really want to talk about is the combat. Nine Sols' combat is genuinely the most perfect combat I've ever experienced. Primarily, you parry attacks which give you a \"Qi charge\" which you can use to attach a talisman to an enemy which will explode after a short delay. The more charges you have, the higher damage your talisman explosion will do. This system creates a really amazing balance between offense and defense that I haven't seen many other games do very well. Then there's the jades and spell types and the bow and new ways to parry which lets you make all sorts of unique builds that highly differ from each other. \n\nThe combat pairs perfectly with the intense bosses. The bosses in this game are a good challenge, especially the final boss (no spoilers). What's crazy about these bosses is they're all decently challenging, but never when I was fighting them did I ever feel frustrated. Every time I died it was truly my fault. The bosses don't have cheap shots or bullshit moves. Really all it boils down to is practice. The only emotion I felt when I was fighting these bosses was exhilaration and adrenaline. The bosses are fun and that's really all there is to it. It's satisfying and rewarding as hell to nail down a boss's move set and perfectly defend against it. \n\nOverall, I can't really put into words how amazing and how much enjoyment I felt while playing this game. The only way to understand would be to play the game yourself. despite some annoying gimmicky sections and a rather large amount of dialogue that some people find info-dumpy, I think that this game is one of the most solid titles to come out of the 2020's and it would be a disservice to yourself to not play it. But please, go for the true ending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having just finished Silksong I was sure there was no way this game would measure up to the quality of that game. But this really impressed me in both its uniqueness of its presentation and the tightness of its mechanics. Once you unlock the movement and combat abilities there is an excellent flow to the game. I was frustrated for a few hours, as learning the parry timing is really essential to success. I do wish there was a little more variance to the locations, I found myself getting lost a lot, but overall this is one of the best metroidvanias I have played, and the final boss fight is one of the most punishing but satisfying culminations of everything you have learned i have experienced in any game. A+",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing story and lore.\r\nThe game is difficult to handle at first though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game bit of gore cool boss fights great story id recommend true ending like the hardest boss in the game is like a 8/10 on difficulty if your competent you can beat every boss but the true final boss in like half an hour would reccommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This goes under the radar for so many people. What an experience. Absolutely amazing game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9.5/10 only cause of one forced stealth part. After 2 100% (Spoiler: except the actual final boss cause i could only restart so many times without wanting to smash my controller) runs i dont really have a reason to play again tho. Wish there was an in-game randomizer, since the third party mod is kinda lacking or at least workshop support for more motivation to do a better randomizer or other cool mods from devoted mod makers. Hope a sequel is in the works, and happy 10th anniversary to the developers :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth every dollar, deserves much more praise and recognition\r\n\r\nFinal boss humbled me and made me discover my final form in order to conquer such adversity\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool\r\n\r\nmore linear than many other metroidvanias, though that's a plus for headless chickens like me who get conniptions when given too many routes at once",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The exploration is pretty decent but the combat and story are phenomenal, especially the last boss. Difficulty is pretty decent since the parries are pretty generous\r\n\r\nMy only 2 complaints are that you can only use 2 or maybe 3 jades until the last parts of the story due to less available slots and that the hitboxes sometimes act weird",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall: 6/10 - Worth Beating\r\n\r\nStory: 6/10\r\nWorld: 7/10\r\nBosses: 6/10\r\nGameplay: 8/10\r\nDifficulty: 7/10\r\n\r\nLearn to parry and the games a lot easier. The characters and world were unique and varied. I enjoyed learning the systems to overcome the increasing challenges. The bosses werent anything crazy (except the final boss jfc). This game definitely has the biggest difficulty spike from everything else to the final boss out of any game I have played.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I found this game to be very uneven, by that I mean the game pushes and pulls against you in a lot of ways that I just don't think are fun. \r\n\r\nMy main example would be exploration. The map in the game lacks some real QoL features that force you to continually toggle between views in order to set a route. You can either look at the whole thing, or a singular portion, and there's no in-between. There is no ability to mark the map, so it's up to you to either take your own notes or just remember that a passage is either unexplored, out of reach, or simply blocked from progression. \r\n\r\nThere is A LOT of story in this game, which isn't inherently a bad thing, however the flow of the game was constantly ground to a halt so that you could have minutes-long conversations. The main character himself at one point gets annoyed with having to have so many conversations. You can bet that before and after every boss-fight, you're in for several minutes of hitting A to progress. \r\n\r\nThe combat had enough jank for me to lose interest a little over halfway through. Attacks that have purposefully animated hit-boxes will hit you when you're behind the enemy (See: Lady Ethereal, Eigong, etc.) even after/during a dodge. For a game that touts parrying/deflecting, there is very little reward it utilizing that technique. Yes, technically you can wear down an opponent with many well-timed parries and use a specific attack to deal large chunks of damage, but that attack also leaves you EXTREMELY vulnerable to the many many combos in these fights. There are also 0 i-frames after receiving damage so it's likely you'll be juggled to death, but it's basically the only way to actually capitalize on the parry mechanic as enemies do not get stunned from parrying. I wanted to DNF and then realized I was about 70% done, so I pushed through until the end, only to get the bad ending which at this point just felt like a spit in the face. \r\n\r\nI didn't enjoy this experience, and I felt like it just kept dragging on.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a few problems with this game. I like challenges, but not challenges with stupid limitations. In Bloodborne (which I got all the trophies in), you have options: you can dash, and as far as I remember no boss requires you to parry to beat it. This is also why I hate Sekiro.\n\nHere’s my problem with this game: dashing is mostly useless and feels like it’s just for mobility. Boss attacks are generally exaggerated in both appearance and hitboxes, leaving you with no real option but to parry. And the parry button is on the left trigger… why?\n\nAnother issue is the stunlocking. Whose idea was it to make the hardest enemies able to stunlock you and combo you to death? That’s not fun or challenging; it’s just fake difficulty. And yes, you can by a perk for it, but why still? The mechanic just doesnt feel, or is fair.\n\nOne more thing: why do I need to hold the right trigger to explode the seal? Why overcomplicate this mechanic? Am I supposed to do some kind of awkward finger “tab dance” while fighting? you like this game good on you, I wont play a game which pad it game time with dificulty for the sake of it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but the last boss is too hard. It sucked all the fun I had in the game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a tutorial simulator. Got a new power? Nice, let's do a tutorial in another dimension for you. Killed 3 mobs? Nice. Let's interrupt the flow of the game and make you talk to someone for 5 minutes. Oh, you know how to jump? Let's put a tooltip again because the player is a dumbass",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It looks good at first glance, but the player doesn't get rewarded well enough for interacting with its core mechanic: parrying. For what equates to forcing me to play patty cake with the bosses, I don't get the freedom to push back against them. \n\nThe bosses get to push me back with their long combo strings and my reward for succeeding is not getting punished for missing an input. Other games would let me break out of a parry string and interrupt their combo, set-up a punish while managing a string, or even ignore the combo entirely and just pelt them with damage. Parrying is a feature you HAVE to use, and it feels more like an obligated cutscene/QTE that breaks me out of the game than anything else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't really like it. If I wanted a game that has nothing to it other than reflex test over and over, I'd just go play baseball",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "finished it (in standard mode). its not a fun game like hollow knight, bo, ori, or anything else in the genre.\r\neverything around the gameplay is high quality, the art is good, the plot is fine when it doesn't get too faux-philosophical, the game is polished enough, but at the end of the day, this is a fighting based 2D platforming side scroller with souls like tendencies, more specifically of the sekiro variety, and its not fun.\r\nbosses are just spammy as hell, not elaborate or smart or requiring actual skill. its just a spam wave with barely any opportunity to chip away at their health.\r\nwhich just makes it a game chipping away at my free time whilst not being enjoyable.\r\ndevelopers should learn to be more considerate of their customer's time if they are going to make a non-fun game. i'd give this a 3/5, which means its not bad, but would i recommend it to a friend? no. no i wouldn't.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Does not deserve the overwhelmingly positive title.\nFix the broken hitboxes, especially on Eigong then we can talk. \"You are not supposed to dodge\" is a poor excuse, they added dodge into the game so I'm dodging bro.\nStory is edgy, gory, and violent for the sake of shock value, which gets annoying real fast. I'm not here for happy tree friends. Lots of unskippable dialogue.\nGame had some cool bosses like Lady Ethereal, and had some very bad ones. Enemy variety barely passes, you will see the same archer and spear guard all throughout the game.\nNot a bad game but has faults.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately, I had to abandon the game midway. It's quite boring, and not engaging at all. Now I came to this game with the expectation of Sekiro, and I have completed Sekiro just fine, and most recently Prince of Persia The Lost Crown. All are hard and fun to play\n\nThe way the game is designed aims to torture players. Now it's probably ok if the save check points is placed wisely. Unfortunately, no, they are MILES apart. Dying from a random enemy while your last save was in the last room means you will need to back track quite far, and HAVE TO CLEAR all of the obstacles again.\n\nStoryline is some dumb Chinese futuristic folklore, that I don't care about. \n\nWhile in Sekiro, deflection is tight but it's satisfying, and spot on, Nine Sols' deflection does not have that engagement.\n\nWasted money on this...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is ok.\nWasted to many hours on lady ethereal. this boss design is absolut terrible and almost broke me. because of this shit design I don't recommend this game. fucking shit ghost mode where you can do no damage and after random blocks or hits of ghosts you have a very short time to hit the real. hated it so much.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wtf IS TIHS game? oh its easy Oh its fun... NO its crazy hard and not fun at all you die in like 2-3 hits",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to like this game due to the graphics and gameplay, but the story is just not doing it for me, it starts of incredibly slow.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Grosse déception..\nUn petit personnage aussi lourd et lent qu'un 36 tonnes, des dialogues tellement long et soporifiques, on sait pas vraiment où aller alors on fait des allers retours car quasiment pas de voyage rapides, on attend, un ascenseur, que des flammes s'éteignent pour passer.. Bref c'est mou ! J'ai joué une dizaine d'heure et j'irai pas plus loin.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game im playing this game out of spite.  I love platform metro games and this game is so shit. \nThe story is also so bland. The enemies have no consistent move sets. The music has to be turned off to hear any audio ques. I all about hard games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "游戏有很多空洞的影子，但战斗系统设计非常生涩，难度又偏高，虽然可以调节难度，但等于是把游戏平衡的工作从厂商转移给了玩家，非常不合理。\r\n\r\n美术看起来还不错，剧情没玩太久，但目前看并没有什么出彩的地方，也导致没什么动力继续品尝了",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun core mechanics. unfortunately like many games some aspects have been engineered to parasitize players, including by intentionally inducing frustration and anger, and artificially inflating playtime without adding fun (eg runbacks, randomness leading to impossible situations, controls randomly unresponsive during boss fights, inflated hitboxes, and unskippable cutscenes before challenging boss fights)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad design, doesn't even pause the game if you controller disconnects among others",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Far, far too difficult for me (and many others). A bit of challenge isn't a bad thing, but this is just really frustrating. The art is beautiful. The story so far was interesting. The gameplay itself is miserable, particularly with bosses. I want to love it, I really do, but it's simply not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The horse boss’s second form was overwhelming. I loved the graphics, but the combat pushed past what I can enjoy. I came looking for fun and left mostly frustrated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wanna be hollow knight.. I hate games that force you to parry.. I lost all my stuff in HK many times, but the game was awesome so I kept going.  Lost them in this game, nope, I'm done.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not recommended. I don’t understand why people overrated this game so much. The hit boxes are terrible — even after an animation finishes, the hit box sometimes stays active, and if you accidentally step into it, you take damage (I’ve also heard the same complaints in multiple reviews and tutorial videos, especially when it comes to bosses like Fuxi and Jiequan.).\r\n\r\nAs you progress and unlock more items, currency, and upgrades, you’re supposed to feel stronger, but instead the game somehow feels worse.\r\n\r\nThere’s also an extremely frustrating issue where if you accidentally take damage, you can get stuck in an endless damage chain. This usually happens when you fall off a platform and the screen goes black to reposition you. Meanwhile, a boss or mob can start attacking, and during that moment you can’t parry or block anything.\r\n\r\nI get that the developers wanted the game to be challenging, but challenge should feel fair, not like a pointless struggle. Right now it feels more annoying than rewarding.\r\n\r\nSouls games are hard too, but whenever something goes wrong in those games, I never feel like it’s the game’s fault. I’ve never felt this level of frustration or the sense that I’m being punished for things outside my control. Here, it constantly feels like the game — not the player — is messing up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A game designed by a brain-damaged retard who does not know that if an enemy attack takes 1.5 seconds to execute, the counter to that attack has to take less than 1.5 seconds in order to execute.  \n\nDuhhhh.   Durrrrrr.\n\nThat way, you can react to tells.  This is beyond basic game design 101.  This is common sense.  Something that the development team of this game is sorely lacking in.  \n\nDerrrrr.   \n\nDuhhhhh.\n\nHow much of a drooling-on-yourself moron do you have to be to not understand this basic concept?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Don't recommend because Red Candle Games is a shitty studio, if I knew beforehand I wouldn't have bought this game. China will be fully unified, no matter what those capitalist racists think.\n\ndecent game tho, combat is tough",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the gameplay in between main boss fights — however, only half the main bosses are actually fun and the other half are flat out irritating. It's also very dialogue-heavy for this genre and the story didn't hold my interest, but there are some charming character interactions here and there. Overall I wouldn't recommend it unless parrying is your favorite mechanic in video games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a garbage prison section. Game becomes incredibly tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i was enjoying it until the stealth section. i don’t know who requested that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rage game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate reading",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THE GAME DOESN'T PLAY ITSELF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ok, you know what, fuck it, I have free will and I'll use it.\nI did not enjoy this. Many elements just ruined the game for me.\nOn paper, it should have been great, but that's only on paper.\nWhile the game is said to be a child of Sekiro and Hollow Knight, it is, in fact, none of that,\n\nWhy it's not Sekiro:\nIn Sekiro, if you perfect parry, you're winning.\nIn Nine Sols, if you perfect parry, you're in a stalemate.\nIn Sekiro, if you perfect parry, you're rewarded.\nIn Nine Sols, if you perfect parry, you're not PUNISHED.\nThe main tool the game gives you doesn't really have the capability to, when used correctly, give you the advantage in a fight. It only gives you more time.\n\nWhy it's not Hollow Knight:\nThe game is very linear and can't really be called a metroidvania. I've felt like I'd never had a choice where to go. I did receive new abilities, sure; (the process of which was the dullest way possible, it's just handed to you at a resting point with no effort on your part and for no apparent reason besides letting you progress) however, they really only let me go in that one area that requires that ability. There is also barely any reason to come back to already explored areas, as mostly you can collect all the stuff with the abilities you already had at that point in time. The jade system is blatantly just Hollow Knight's charms, which would be fine, that's a great system, if and only if the charms themself were useful, and most of them didn't find any use, but that may just be a me problem.\n\nBesides that, the game has other problems. The enemy variety is barely adequate. Few areas have enemies unique to them, and most use an established roster that becomes stale. While it's unreasonable to compare it to something like Silksong's insane 200+ enemy count, this still leaves a bad taste.\n\nAnd on topic of Silksong, this game is very punishing, so much more than Silksong ever was. In other Soulslikes (Silksong, Elden Ring, DS trilogy, Sekiro etc.), I can expect to reach the boss' second phase, learn a bit, and die having gained crucial knowledge. Here, I'm almost instantly executed. The lack of health (or rather the insane amounts the bosses deal) combined with punishing parry system makes for barely any time to learn boss patterns, which is, by far, the most important part for a game that tries to be like Sekiro. Sekiro dealt with that by its namesake: you could die twice. Silksong limits the damage to two masks. Dark Souls and Elden Ring didn't really have attacks this punishing, and, if in trouble, use dodge roll.\nThis game doesn't have anything that'd let you learn the fight. The final result will look impressive, but the path to it will be miserable and unenjoyable.\n\nAnd as a personal gripe, [spoiler]Eigong's Seal attack[/spoiler] has a shit hitbox, and very frequently clips you after you've dashed through it and are a good distance away from [spoiler]her[/spoiler], akin to how bosses in DS2 could grab attack you after what would seem to be a successful dodge.\n\n[spoiler]Oh wow. It got worse.\nEigong's first phase is manageble.\nEigong's second phase trips you up a LOT, but you can suffer through it.\nEigong's third phase... is the reason why gameplay is never cinematic.\nWho the hell thought it would be a good idea to make an average gamer do that fucking Pure Vessel mod.\nYep, using Story mode now. Feeling zero shame in it. No one should put up with bullshit like this.\n[/spoiler]\n\nOn a good note, the art is gorgeous, the music is too, the lore is rich, the story is interesting and the characters are great as well. Shame it's all built on a flawed gameplay.\n\nThe game is still good for some people, especially for ones who don't mind using easy mode, but it has no business being compared to Sekiro nor Hollow Knight.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I finally picked this one up and got around to it after hearing phenomenal things and just getting off a Silksong binge, but it didn't live up to the hype at for me.\n\nCombat was the biggest pain point. Despite claiming to be \"Sekiro-like\", the parry mechanics feel nothing like it. Spin kicks and charge attacks became my staples for the bulk of the game, and I found the base grounded parry extremely finnicky. For some reason the spin kick just felt objectively better at the same job. The charge parry near the end of the game is legitimately one of the worst mechanics I've ever seen in a game like this, and feels extremely counterintuitive. Visual feedback and enemy hitboxes are nonsensical - the white and red flashes hurt far more than they help because they really don't tell you anything about timing a parry or dodge, and most hitboxes are absurd and don't line up with the animations or models at all.\n\nThe final boss is such a steep hurdle compared to the rest of the game that it deserves criticism of its own. I love challenging games, I just completed a 100% steel soul run in SIlksong and I used to binge soulsbornes like nothing. This felt legitimately unfair, to the point I got so frustrated I just turned on story mode to get it over with. The game forces one particular playstyle for this boss, but the rest of the game doesn't encourage building the skillset it expects here - like I said, I relied on spin kicks and charge attacks for the bulk of the game without issue, but that's essentially useless here. Some of the other bosses were phenomenal, a few felt unfair but not egregiously so, but this one is actually absurd and feels incredibly out of place.\n\nSkill issue, maybe, but I can't say I've ever felt this way about any other similar game.\n\nI wish the only gripes I had were with the combat, but unfortunately the rest of the game fell flat to me too. While the aesthetic and artwork are gorgeous, a lot of animations (especially bosses) felt really off. The exploration felt severely lacking. I can't even call this a metroidvania - this game is extremely linear, and most secrets and puzzles pull from the same handful of solutions. Exploring the world just felt boring, and there's little to no room for sequence breaks (though I'm sure there are some, as the game does have a discount version of HK's pogo which was only required for one single puzzle in the entire game).\n\nNarrative didn't click for me either. Granted I was already feeling jaded by the gameplay, but the overall story just didn't really interest me, and the characters all felt flat and predictable with very little real character development. I grew to hate the main character in particular - his motives never felt clear to me, and he never seemed to grow as a character.\n\nI really went into this one expecting to love it, since on paper it sounds like it'd hit so many of the right notes for me, but it just felt like everything was lacking in some way or another.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Here is a 100% spoiler-free review of Nine Sols.\n\nFrom my brief playtime, Nine Sols appears to be a Metroid-vania style platforming combat game with a wholly unique art style and intriguing plot set up that really made me want to like the game.\n\nUnfortunately, I bounced off this game hard. This game is, above all else;\n\nUnforgiving.\n\nThe game is not \"Punishing\", in that failure does not often set you back far. Nor is it \"difficult\" in the sense that what it asks  of you is particularly complex or demanding. It's not \"unfair\" in that it does not deny you the tool-set you need to win. It is unforgiving in that the game has expectations of how you should approach any given challenge or enemy, and deviating from those expectations in the slightest will result in immediate death.\n\nI managed to scrape through to the first boss by the skin of my teeth in my two hours of play, whereupon I found myself so outmatched that I wondered if I had stumbled into the wrong area. The fight, if you play it perfectly, is over two minutes long. The boss though can deplete your health bar in three hits, and you don't even get i-frames. I threw myself at it for about 20 minutes. My average attempt was about 5 seconds long. In frustration, I turned on the \"You can't undo this\" story mode toggle and still died.\n\nWas this a skill issue? ...Yes, probably.\nWhile I'm not new to metroid-vanias, I've not kept up with the recent indie scene (I haven't even played hollow knight) And I felt wholly unprepared for what this game was delivering. Nine Sols was a brick wall of a learning curve that I just don't have it in me to try to climb.\n\nAs previously mentioned, the game DOES have story mode. It gives you Damage taken/damage given sliders that you can tune so generous that a goldfish could win, up to 99% damage reduction and orders of magnitude of bonus damage output. Theoretically, anybody player of any skill could tune story mode to be whatever they deem personally challenging. However, By the time I activated it, the game had beaten out of me any enthusiasm I had to keep playing it.\n\nI am sure there will be people who read this review and think it sounds great. If that's you... you'll probably love it. Enjoy it with my blessing.\n\nBut for me, Nine Sols evokes feelings that I just... don't want in my life right now. Feelings of helplessness, frustration and inadequacy. And if you don't enjoy those feelings... maybe you might want to avoid it too.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game has a lot of good, but so a few major frustrations that I was honestly happy that I was done playing it.  \n- Notable amount of enemies with non-intuitive tracking\n- Lots of bosses and enemies with really poor hit boxes\n- Traversal before the midway point and backtracking to places takes AGES and felt like it was artificially lengthening the game\n- ZERO i-frames when getting hit, resulting many numerous deaths that just felt unfair, which feels worse with early game back tracking... this is even more noticeable when you fall off the map, camera gets whiplashed back into an enemy attack and get hit instantly as well before you can even process where you are. \n- The imperfect parry healing feels way to slow at times, and kinda wished it adopted the lies of p system of earning HP back through getting hits in, but reduced how much you could earn back\n\nThose things really hurt my enjoyment for this game. Outside of that, some good things are\n- The boss designs and movesets themselves are generally good and fun to learn. \n- The setting and art style is nice\n- The story was interesting\n- The levels are almost all very enjoyable with a couple exceptions\n\nUnfortunately for me, unless someone is really okay with lower QoL for in turn was is a generally good game, I wouldn't recommend it. QoL just feels so poor at times for me, but the content is really good. I really wish I could just review as \"neutral.\"",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Listen it's not a bad game, but I can't in good faith recommend this to average players. If you're into rough precise combat that can and will touch of death you in a combo from even normal enemies then by all means knock yourself out. But the combat in this game requires you to really lock in or you will be doing walk backs to bosses more times then you care to count.\r\n\r\nPros: Great metroidvania game outside of the combat, superb level and art design and the music is no slouch either. The story is deep and well though out, plenty of side lore to search and read if you enjoy that stuff. The game doesn't hold your hand for too long and lets you backtrack to pretty much anywhere if you need to. One good thing about the combat atleast is that there is plenty of build options to work around to help you at what you're good at and cover your weakness, just... not for bosses really.\r\n\r\nCons: Again, the combat is very very VERY precise, you have almost no I-frames so you can and will get combo'd. Bosses turn less into weaving attacks in when you can to \"can I parry this onslaught long enough to get something done\". I'm use to playing hard games with hard controls, heck I played this whole game on keyboard because I don't got a controller, but even with an arugably easier parry button (right clicking), I still often found myself getting cheesed and less that I felt like I made a mistake.\r\n\r\nOtherwise this game is fun but if you're serious about trying it, please play in casual (even thou you lose out on an achivement), it will make the game far more fun for you.\r\n\r\nTip: Did you know you can parry even when you get knocked to the ground? you don't even have to get up to parry, you just auto get up and parry if you time it right. Sure wish I knew that info and didn't figure that out accidently on the final boss. Also Hedgehog jade is by far the best jade.\r\n\r\n8/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it's beautiful and weird and interesting, but unfortunately the combat is so one-note that it gets boring very quickly. the only thing you do is figure out when and how many times to click the parry button and then you win or you die and try again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I found this game to be very uneven, by that I mean the game pushes and pulls against you in a lot of ways that I just don't think are fun. \r\n\r\nMy main example would be exploration. The map in the game lacks some real QoL features that force you to continually toggle between views in order to set a route. You can either look at the whole thing, or a singular portion, and there's no in-between. There is no ability to mark the map, so it's up to you to either take your own notes or just remember that a passage is either unexplored, out of reach, or simply blocked from progression. \r\n\r\nThere is A LOT of story in this game, which isn't inherently a bad thing, however the flow of the game was constantly ground to a halt so that you could have minutes-long conversations. The main character himself at one point gets annoyed with having to have so many conversations. You can bet that before and after every boss-fight, you're in for several minutes of hitting A to progress. \r\n\r\nThe combat had enough jank for me to lose interest a little over halfway through. Attacks that have purposefully animated hit-boxes will hit you when you're behind the enemy (See: Lady Ethereal, Eigong, etc.) even after/during a dodge. For a game that touts parrying/deflecting, there is very little reward it utilizing that technique. Yes, technically you can wear down an opponent with many well-timed parries and use a specific attack to deal large chunks of damage, but that attack also leaves you EXTREMELY vulnerable to the many many combos in these fights. There are also 0 i-frames after receiving damage so it's likely you'll be juggled to death, but it's basically the only way to actually capitalize on the parry mechanic as enemies do not get stunned from parrying. I wanted to DNF and then realized I was about 70% done, so I pushed through until the end, only to get the bad ending which at this point just felt like a spit in the face. \r\n\r\nI didn't enjoy this experience, and I felt like it just kept dragging on.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a few problems with this game. I like challenges, but not challenges with stupid limitations. In Bloodborne (which I got all the trophies in), you have options: you can dash, and as far as I remember no boss requires you to parry to beat it. This is also why I hate Sekiro.\n\nHere’s my problem with this game: dashing is mostly useless and feels like it’s just for mobility. Boss attacks are generally exaggerated in both appearance and hitboxes, leaving you with no real option but to parry. And the parry button is on the left trigger… why?\n\nAnother issue is the stunlocking. Whose idea was it to make the hardest enemies able to stunlock you and combo you to death? That’s not fun or challenging; it’s just fake difficulty. And yes, you can by a perk for it, but why still? The mechanic just doesnt feel, or is fair.\n\nOne more thing: why do I need to hold the right trigger to explode the seal? Why overcomplicate this mechanic? Am I supposed to do some kind of awkward finger “tab dance” while fighting? you like this game good on you, I wont play a game which pad it game time with dificulty for the sake of it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but the last boss is too hard. It sucked all the fun I had in the game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a tutorial simulator. Got a new power? Nice, let's do a tutorial in another dimension for you. Killed 3 mobs? Nice. Let's interrupt the flow of the game and make you talk to someone for 5 minutes. Oh, you know how to jump? Let's put a tooltip again because the player is a dumbass",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It looks good at first glance, but the player doesn't get rewarded well enough for interacting with its core mechanic: parrying. For what equates to forcing me to play patty cake with the bosses, I don't get the freedom to push back against them. \n\nThe bosses get to push me back with their long combo strings and my reward for succeeding is not getting punished for missing an input. Other games would let me break out of a parry string and interrupt their combo, set-up a punish while managing a string, or even ignore the combo entirely and just pelt them with damage. Parrying is a feature you HAVE to use, and it feels more like an obligated cutscene/QTE that breaks me out of the game than anything else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't really like it. If I wanted a game that has nothing to it other than reflex test over and over, I'd just go play baseball",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "finished it (in standard mode). its not a fun game like hollow knight, bo, ori, or anything else in the genre.\r\neverything around the gameplay is high quality, the art is good, the plot is fine when it doesn't get too faux-philosophical, the game is polished enough, but at the end of the day, this is a fighting based 2D platforming side scroller with souls like tendencies, more specifically of the sekiro variety, and its not fun.\r\nbosses are just spammy as hell, not elaborate or smart or requiring actual skill. its just a spam wave with barely any opportunity to chip away at their health.\r\nwhich just makes it a game chipping away at my free time whilst not being enjoyable.\r\ndevelopers should learn to be more considerate of their customer's time if they are going to make a non-fun game. i'd give this a 3/5, which means its not bad, but would i recommend it to a friend? no. no i wouldn't.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Does not deserve the overwhelmingly positive title.\nFix the broken hitboxes, especially on Eigong then we can talk. \"You are not supposed to dodge\" is a poor excuse, they added dodge into the game so I'm dodging bro.\nStory is edgy, gory, and violent for the sake of shock value, which gets annoying real fast. I'm not here for happy tree friends. Lots of unskippable dialogue.\nGame had some cool bosses like Lady Ethereal, and had some very bad ones. Enemy variety barely passes, you will see the same archer and spear guard all throughout the game.\nNot a bad game but has faults.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately, I had to abandon the game midway. It's quite boring, and not engaging at all. Now I came to this game with the expectation of Sekiro, and I have completed Sekiro just fine, and most recently Prince of Persia The Lost Crown. All are hard and fun to play\n\nThe way the game is designed aims to torture players. Now it's probably ok if the save check points is placed wisely. Unfortunately, no, they are MILES apart. Dying from a random enemy while your last save was in the last room means you will need to back track quite far, and HAVE TO CLEAR all of the obstacles again.\n\nStoryline is some dumb Chinese futuristic folklore, that I don't care about. \n\nWhile in Sekiro, deflection is tight but it's satisfying, and spot on, Nine Sols' deflection does not have that engagement.\n\nWasted money on this...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is ok.\nWasted to many hours on lady ethereal. this boss design is absolut terrible and almost broke me. because of this shit design I don't recommend this game. fucking shit ghost mode where you can do no damage and after random blocks or hits of ghosts you have a very short time to hit the real. hated it so much.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wtf IS TIHS game? oh its easy Oh its fun... NO its crazy hard and not fun at all you die in like 2-3 hits",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to like this game due to the graphics and gameplay, but the story is just not doing it for me, it starts of incredibly slow.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Grosse déception..\nUn petit personnage aussi lourd et lent qu'un 36 tonnes, des dialogues tellement long et soporifiques, on sait pas vraiment où aller alors on fait des allers retours car quasiment pas de voyage rapides, on attend, un ascenseur, que des flammes s'éteignent pour passer.. Bref c'est mou ! J'ai joué une dizaine d'heure et j'irai pas plus loin.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game im playing this game out of spite.  I love platform metro games and this game is so shit. \nThe story is also so bland. The enemies have no consistent move sets. The music has to be turned off to hear any audio ques. I all about hard games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "游戏有很多空洞的影子，但战斗系统设计非常生涩，难度又偏高，虽然可以调节难度，但等于是把游戏平衡的工作从厂商转移给了玩家，非常不合理。\r\n\r\n美术看起来还不错，剧情没玩太久，但目前看并没有什么出彩的地方，也导致没什么动力继续品尝了",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun core mechanics. unfortunately like many games some aspects have been engineered to parasitize players, including by intentionally inducing frustration and anger, and artificially inflating playtime without adding fun (eg runbacks, randomness leading to impossible situations, controls randomly unresponsive during boss fights, inflated hitboxes, and unskippable cutscenes before challenging boss fights)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad design, doesn't even pause the game if you controller disconnects among others",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Far, far too difficult for me (and many others). A bit of challenge isn't a bad thing, but this is just really frustrating. The art is beautiful. The story so far was interesting. The gameplay itself is miserable, particularly with bosses. I want to love it, I really do, but it's simply not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The horse boss’s second form was overwhelming. I loved the graphics, but the combat pushed past what I can enjoy. I came looking for fun and left mostly frustrated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wanna be hollow knight.. I hate games that force you to parry.. I lost all my stuff in HK many times, but the game was awesome so I kept going.  Lost them in this game, nope, I'm done.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not recommended. I don’t understand why people overrated this game so much. The hit boxes are terrible — even after an animation finishes, the hit box sometimes stays active, and if you accidentally step into it, you take damage (I’ve also heard the same complaints in multiple reviews and tutorial videos, especially when it comes to bosses like Fuxi and Jiequan.).\r\n\r\nAs you progress and unlock more items, currency, and upgrades, you’re supposed to feel stronger, but instead the game somehow feels worse.\r\n\r\nThere’s also an extremely frustrating issue where if you accidentally take damage, you can get stuck in an endless damage chain. This usually happens when you fall off a platform and the screen goes black to reposition you. Meanwhile, a boss or mob can start attacking, and during that moment you can’t parry or block anything.\r\n\r\nI get that the developers wanted the game to be challenging, but challenge should feel fair, not like a pointless struggle. Right now it feels more annoying than rewarding.\r\n\r\nSouls games are hard too, but whenever something goes wrong in those games, I never feel like it’s the game’s fault. I’ve never felt this level of frustration or the sense that I’m being punished for things outside my control. Here, it constantly feels like the game — not the player — is messing up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A game designed by a brain-damaged retard who does not know that if an enemy attack takes 1.5 seconds to execute, the counter to that attack has to take less than 1.5 seconds in order to execute.  \n\nDuhhhh.   Durrrrrr.\n\nThat way, you can react to tells.  This is beyond basic game design 101.  This is common sense.  Something that the development team of this game is sorely lacking in.  \n\nDerrrrr.   \n\nDuhhhhh.\n\nHow much of a drooling-on-yourself moron do you have to be to not understand this basic concept?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Don't recommend because Red Candle Games is a shitty studio, if I knew beforehand I wouldn't have bought this game. China will be fully unified, no matter what those capitalist racists think.\n\ndecent game tho, combat is tough",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the gameplay in between main boss fights — however, only half the main bosses are actually fun and the other half are flat out irritating. It's also very dialogue-heavy for this genre and the story didn't hold my interest, but there are some charming character interactions here and there. Overall I wouldn't recommend it unless parrying is your favorite mechanic in video games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a garbage prison section. Game becomes incredibly tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i was enjoying it until the stealth section. i don’t know who requested that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rage game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate reading",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THE GAME DOESN'T PLAY ITSELF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ok, you know what, fuck it, I have free will and I'll use it.\nI did not enjoy this. Many elements just ruined the game for me.\nOn paper, it should have been great, but that's only on paper.\nWhile the game is said to be a child of Sekiro and Hollow Knight, it is, in fact, none of that,\n\nWhy it's not Sekiro:\nIn Sekiro, if you perfect parry, you're winning.\nIn Nine Sols, if you perfect parry, you're in a stalemate.\nIn Sekiro, if you perfect parry, you're rewarded.\nIn Nine Sols, if you perfect parry, you're not PUNISHED.\nThe main tool the game gives you doesn't really have the capability to, when used correctly, give you the advantage in a fight. It only gives you more time.\n\nWhy it's not Hollow Knight:\nThe game is very linear and can't really be called a metroidvania. I've felt like I'd never had a choice where to go. I did receive new abilities, sure; (the process of which was the dullest way possible, it's just handed to you at a resting point with no effort on your part and for no apparent reason besides letting you progress) however, they really only let me go in that one area that requires that ability. There is also barely any reason to come back to already explored areas, as mostly you can collect all the stuff with the abilities you already had at that point in time. The jade system is blatantly just Hollow Knight's charms, which would be fine, that's a great system, if and only if the charms themself were useful, and most of them didn't find any use, but that may just be a me problem.\n\nBesides that, the game has other problems. The enemy variety is barely adequate. Few areas have enemies unique to them, and most use an established roster that becomes stale. While it's unreasonable to compare it to something like Silksong's insane 200+ enemy count, this still leaves a bad taste.\n\nAnd on topic of Silksong, this game is very punishing, so much more than Silksong ever was. In other Soulslikes (Silksong, Elden Ring, DS trilogy, Sekiro etc.), I can expect to reach the boss' second phase, learn a bit, and die having gained crucial knowledge. Here, I'm almost instantly executed. The lack of health (or rather the insane amounts the bosses deal) combined with punishing parry system makes for barely any time to learn boss patterns, which is, by far, the most important part for a game that tries to be like Sekiro. Sekiro dealt with that by its namesake: you could die twice. Silksong limits the damage to two masks. Dark Souls and Elden Ring didn't really have attacks this punishing, and, if in trouble, use dodge roll.\nThis game doesn't have anything that'd let you learn the fight. The final result will look impressive, but the path to it will be miserable and unenjoyable.\n\nAnd as a personal gripe, [spoiler]Eigong's Seal attack[/spoiler] has a shit hitbox, and very frequently clips you after you've dashed through it and are a good distance away from [spoiler]her[/spoiler], akin to how bosses in DS2 could grab attack you after what would seem to be a successful dodge.\n\n[spoiler]Oh wow. It got worse.\nEigong's first phase is manageble.\nEigong's second phase trips you up a LOT, but you can suffer through it.\nEigong's third phase... is the reason why gameplay is never cinematic.\nWho the hell thought it would be a good idea to make an average gamer do that fucking Pure Vessel mod.\nYep, using Story mode now. Feeling zero shame in it. No one should put up with bullshit like this.\n[/spoiler]\n\nOn a good note, the art is gorgeous, the music is too, the lore is rich, the story is interesting and the characters are great as well. Shame it's all built on a flawed gameplay.\n\nThe game is still good for some people, especially for ones who don't mind using easy mode, but it has no business being compared to Sekiro nor Hollow Knight.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I finally picked this one up and got around to it after hearing phenomenal things and just getting off a Silksong binge, but it didn't live up to the hype at for me.\n\nCombat was the biggest pain point. Despite claiming to be \"Sekiro-like\", the parry mechanics feel nothing like it. Spin kicks and charge attacks became my staples for the bulk of the game, and I found the base grounded parry extremely finnicky. For some reason the spin kick just felt objectively better at the same job. The charge parry near the end of the game is legitimately one of the worst mechanics I've ever seen in a game like this, and feels extremely counterintuitive. Visual feedback and enemy hitboxes are nonsensical - the white and red flashes hurt far more than they help because they really don't tell you anything about timing a parry or dodge, and most hitboxes are absurd and don't line up with the animations or models at all.\n\nThe final boss is such a steep hurdle compared to the rest of the game that it deserves criticism of its own. I love challenging games, I just completed a 100% steel soul run in SIlksong and I used to binge soulsbornes like nothing. This felt legitimately unfair, to the point I got so frustrated I just turned on story mode to get it over with. The game forces one particular playstyle for this boss, but the rest of the game doesn't encourage building the skillset it expects here - like I said, I relied on spin kicks and charge attacks for the bulk of the game without issue, but that's essentially useless here. Some of the other bosses were phenomenal, a few felt unfair but not egregiously so, but this one is actually absurd and feels incredibly out of place.\n\nSkill issue, maybe, but I can't say I've ever felt this way about any other similar game.\n\nI wish the only gripes I had were with the combat, but unfortunately the rest of the game fell flat to me too. While the aesthetic and artwork are gorgeous, a lot of animations (especially bosses) felt really off. The exploration felt severely lacking. I can't even call this a metroidvania - this game is extremely linear, and most secrets and puzzles pull from the same handful of solutions. Exploring the world just felt boring, and there's little to no room for sequence breaks (though I'm sure there are some, as the game does have a discount version of HK's pogo which was only required for one single puzzle in the entire game).\n\nNarrative didn't click for me either. Granted I was already feeling jaded by the gameplay, but the overall story just didn't really interest me, and the characters all felt flat and predictable with very little real character development. I grew to hate the main character in particular - his motives never felt clear to me, and he never seemed to grow as a character.\n\nI really went into this one expecting to love it, since on paper it sounds like it'd hit so many of the right notes for me, but it just felt like everything was lacking in some way or another.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "Here is a 100% spoiler-free review of Nine Sols.\n\nFrom my brief playtime, Nine Sols appears to be a Metroid-vania style platforming combat game with a wholly unique art style and intriguing plot set up that really made me want to like the game.\n\nUnfortunately, I bounced off this game hard. This game is, above all else;\n\nUnforgiving.\n\nThe game is not \"Punishing\", in that failure does not often set you back far. Nor is it \"difficult\" in the sense that what it asks  of you is particularly complex or demanding. It's not \"unfair\" in that it does not deny you the tool-set you need to win. It is unforgiving in that the game has expectations of how you should approach any given challenge or enemy, and deviating from those expectations in the slightest will result in immediate death.\n\nI managed to scrape through to the first boss by the skin of my teeth in my two hours of play, whereupon I found myself so outmatched that I wondered if I had stumbled into the wrong area. The fight, if you play it perfectly, is over two minutes long. The boss though can deplete your health bar in three hits, and you don't even get i-frames. I threw myself at it for about 20 minutes. My average attempt was about 5 seconds long. In frustration, I turned on the \"You can't undo this\" story mode toggle and still died.\n\nWas this a skill issue? ...Yes, probably.\nWhile I'm not new to metroid-vanias, I've not kept up with the recent indie scene (I haven't even played hollow knight) And I felt wholly unprepared for what this game was delivering. Nine Sols was a brick wall of a learning curve that I just don't have it in me to try to climb.\n\nAs previously mentioned, the game DOES have story mode. It gives you Damage taken/damage given sliders that you can tune so generous that a goldfish could win, up to 99% damage reduction and orders of magnitude of bonus damage output. Theoretically, anybody player of any skill could tune story mode to be whatever they deem personally challenging. However, By the time I activated it, the game had beaten out of me any enthusiasm I had to keep playing it.\n\nI am sure there will be people who read this review and think it sounds great. If that's you... you'll probably love it. Enjoy it with my blessing.\n\nBut for me, Nine Sols evokes feelings that I just... don't want in my life right now. Feelings of helplessness, frustration and inadequacy. And if you don't enjoy those feelings... maybe you might want to avoid it too.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "This game has a lot of good, but so a few major frustrations that I was honestly happy that I was done playing it.  \n- Notable amount of enemies with non-intuitive tracking\n- Lots of bosses and enemies with really poor hit boxes\n- Traversal before the midway point and backtracking to places takes AGES and felt like it was artificially lengthening the game\n- ZERO i-frames when getting hit, resulting many numerous deaths that just felt unfair, which feels worse with early game back tracking... this is even more noticeable when you fall off the map, camera gets whiplashed back into an enemy attack and get hit instantly as well before you can even process where you are. \n- The imperfect parry healing feels way to slow at times, and kinda wished it adopted the lies of p system of earning HP back through getting hits in, but reduced how much you could earn back\n\nThose things really hurt my enjoyment for this game. Outside of that, some good things are\n- The boss designs and movesets themselves are generally good and fun to learn. \n- The setting and art style is nice\n- The story was interesting\n- The levels are almost all very enjoyable with a couple exceptions\n\nUnfortunately for me, unless someone is really okay with lower QoL for in turn was is a generally good game, I wouldn't recommend it. QoL just feels so poor at times for me, but the content is really good. I really wish I could just review as \"neutral.\"",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Listen it's not a bad game, but I can't in good faith recommend this to average players. If you're into rough precise combat that can and will touch of death you in a combo from even normal enemies then by all means knock yourself out. But the combat in this game requires you to really lock in or you will be doing walk backs to bosses more times then you care to count.\r\n\r\nPros: Great metroidvania game outside of the combat, superb level and art design and the music is no slouch either. The story is deep and well though out, plenty of side lore to search and read if you enjoy that stuff. The game doesn't hold your hand for too long and lets you backtrack to pretty much anywhere if you need to. One good thing about the combat atleast is that there is plenty of build options to work around to help you at what you're good at and cover your weakness, just... not for bosses really.\r\n\r\nCons: Again, the combat is very very VERY precise, you have almost no I-frames so you can and will get combo'd. Bosses turn less into weaving attacks in when you can to \"can I parry this onslaught long enough to get something done\". I'm use to playing hard games with hard controls, heck I played this whole game on keyboard because I don't got a controller, but even with an arugably easier parry button (right clicking), I still often found myself getting cheesed and less that I felt like I made a mistake.\r\n\r\nOtherwise this game is fun but if you're serious about trying it, please play in casual (even thou you lose out on an achivement), it will make the game far more fun for you.\r\n\r\nTip: Did you know you can parry even when you get knocked to the ground? you don't even have to get up to parry, you just auto get up and parry if you time it right. Sure wish I knew that info and didn't figure that out accidently on the final boss. Also Hedgehog jade is by far the best jade.\r\n\r\n8/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it's beautiful and weird and interesting, but unfortunately the combat is so one-note that it gets boring very quickly. the only thing you do is figure out when and how many times to click the parry button and then you win or you die and try again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I found this game to be very uneven, by that I mean the game pushes and pulls against you in a lot of ways that I just don't think are fun. \r\n\r\nMy main example would be exploration. The map in the game lacks some real QoL features that force you to continually toggle between views in order to set a route. You can either look at the whole thing, or a singular portion, and there's no in-between. There is no ability to mark the map, so it's up to you to either take your own notes or just remember that a passage is either unexplored, out of reach, or simply blocked from progression. \r\n\r\nThere is A LOT of story in this game, which isn't inherently a bad thing, however the flow of the game was constantly ground to a halt so that you could have minutes-long conversations. The main character himself at one point gets annoyed with having to have so many conversations. You can bet that before and after every boss-fight, you're in for several minutes of hitting A to progress. \r\n\r\nThe combat had enough jank for me to lose interest a little over halfway through. Attacks that have purposefully animated hit-boxes will hit you when you're behind the enemy (See: Lady Ethereal, Eigong, etc.) even after/during a dodge. For a game that touts parrying/deflecting, there is very little reward it utilizing that technique. Yes, technically you can wear down an opponent with many well-timed parries and use a specific attack to deal large chunks of damage, but that attack also leaves you EXTREMELY vulnerable to the many many combos in these fights. There are also 0 i-frames after receiving damage so it's likely you'll be juggled to death, but it's basically the only way to actually capitalize on the parry mechanic as enemies do not get stunned from parrying. I wanted to DNF and then realized I was about 70% done, so I pushed through until the end, only to get the bad ending which at this point just felt like a spit in the face. \r\n\r\nI didn't enjoy this experience, and I felt like it just kept dragging on.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have a few problems with this game. I like challenges, but not challenges with stupid limitations. In Bloodborne (which I got all the trophies in), you have options: you can dash, and as far as I remember no boss requires you to parry to beat it. This is also why I hate Sekiro.\n\nHere’s my problem with this game: dashing is mostly useless and feels like it’s just for mobility. Boss attacks are generally exaggerated in both appearance and hitboxes, leaving you with no real option but to parry. And the parry button is on the left trigger… why?\n\nAnother issue is the stunlocking. Whose idea was it to make the hardest enemies able to stunlock you and combo you to death? That’s not fun or challenging; it’s just fake difficulty. And yes, you can by a perk for it, but why still? The mechanic just doesnt feel, or is fair.\n\nOne more thing: why do I need to hold the right trigger to explode the seal? Why overcomplicate this mechanic? Am I supposed to do some kind of awkward finger “tab dance” while fighting? you like this game good on you, I wont play a game which pad it game time with dificulty for the sake of it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but the last boss is too hard. It sucked all the fun I had in the game...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a tutorial simulator. Got a new power? Nice, let's do a tutorial in another dimension for you. Killed 3 mobs? Nice. Let's interrupt the flow of the game and make you talk to someone for 5 minutes. Oh, you know how to jump? Let's put a tooltip again because the player is a dumbass",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It looks good at first glance, but the player doesn't get rewarded well enough for interacting with its core mechanic: parrying. For what equates to forcing me to play patty cake with the bosses, I don't get the freedom to push back against them. \n\nThe bosses get to push me back with their long combo strings and my reward for succeeding is not getting punished for missing an input. Other games would let me break out of a parry string and interrupt their combo, set-up a punish while managing a string, or even ignore the combo entirely and just pelt them with damage. Parrying is a feature you HAVE to use, and it feels more like an obligated cutscene/QTE that breaks me out of the game than anything else.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't really like it. If I wanted a game that has nothing to it other than reflex test over and over, I'd just go play baseball",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "finished it (in standard mode). its not a fun game like hollow knight, bo, ori, or anything else in the genre.\r\neverything around the gameplay is high quality, the art is good, the plot is fine when it doesn't get too faux-philosophical, the game is polished enough, but at the end of the day, this is a fighting based 2D platforming side scroller with souls like tendencies, more specifically of the sekiro variety, and its not fun.\r\nbosses are just spammy as hell, not elaborate or smart or requiring actual skill. its just a spam wave with barely any opportunity to chip away at their health.\r\nwhich just makes it a game chipping away at my free time whilst not being enjoyable.\r\ndevelopers should learn to be more considerate of their customer's time if they are going to make a non-fun game. i'd give this a 3/5, which means its not bad, but would i recommend it to a friend? no. no i wouldn't.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Does not deserve the overwhelmingly positive title.\nFix the broken hitboxes, especially on Eigong then we can talk. \"You are not supposed to dodge\" is a poor excuse, they added dodge into the game so I'm dodging bro.\nStory is edgy, gory, and violent for the sake of shock value, which gets annoying real fast. I'm not here for happy tree friends. Lots of unskippable dialogue.\nGame had some cool bosses like Lady Ethereal, and had some very bad ones. Enemy variety barely passes, you will see the same archer and spear guard all throughout the game.\nNot a bad game but has faults.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately, I had to abandon the game midway. It's quite boring, and not engaging at all. Now I came to this game with the expectation of Sekiro, and I have completed Sekiro just fine, and most recently Prince of Persia The Lost Crown. All are hard and fun to play\n\nThe way the game is designed aims to torture players. Now it's probably ok if the save check points is placed wisely. Unfortunately, no, they are MILES apart. Dying from a random enemy while your last save was in the last room means you will need to back track quite far, and HAVE TO CLEAR all of the obstacles again.\n\nStoryline is some dumb Chinese futuristic folklore, that I don't care about. \n\nWhile in Sekiro, deflection is tight but it's satisfying, and spot on, Nine Sols' deflection does not have that engagement.\n\nWasted money on this...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is ok.\nWasted to many hours on lady ethereal. this boss design is absolut terrible and almost broke me. because of this shit design I don't recommend this game. fucking shit ghost mode where you can do no damage and after random blocks or hits of ghosts you have a very short time to hit the real. hated it so much.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wtf IS TIHS game? oh its easy Oh its fun... NO its crazy hard and not fun at all you die in like 2-3 hits",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wanted to like this game due to the graphics and gameplay, but the story is just not doing it for me, it starts of incredibly slow.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Grosse déception..\nUn petit personnage aussi lourd et lent qu'un 36 tonnes, des dialogues tellement long et soporifiques, on sait pas vraiment où aller alors on fait des allers retours car quasiment pas de voyage rapides, on attend, un ascenseur, que des flammes s'éteignent pour passer.. Bref c'est mou ! J'ai joué une dizaine d'heure et j'irai pas plus loin.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate this game im playing this game out of spite.  I love platform metro games and this game is so shit. \nThe story is also so bland. The enemies have no consistent move sets. The music has to be turned off to hear any audio ques. I all about hard games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "游戏有很多空洞的影子，但战斗系统设计非常生涩，难度又偏高，虽然可以调节难度，但等于是把游戏平衡的工作从厂商转移给了玩家，非常不合理。\r\n\r\n美术看起来还不错，剧情没玩太久，但目前看并没有什么出彩的地方，也导致没什么动力继续品尝了",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun core mechanics. unfortunately like many games some aspects have been engineered to parasitize players, including by intentionally inducing frustration and anger, and artificially inflating playtime without adding fun (eg runbacks, randomness leading to impossible situations, controls randomly unresponsive during boss fights, inflated hitboxes, and unskippable cutscenes before challenging boss fights)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad design, doesn't even pause the game if you controller disconnects among others",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Far, far too difficult for me (and many others). A bit of challenge isn't a bad thing, but this is just really frustrating. The art is beautiful. The story so far was interesting. The gameplay itself is miserable, particularly with bosses. I want to love it, I really do, but it's simply not fun.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The horse boss’s second form was overwhelming. I loved the graphics, but the combat pushed past what I can enjoy. I came looking for fun and left mostly frustrated.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wanna be hollow knight.. I hate games that force you to parry.. I lost all my stuff in HK many times, but the game was awesome so I kept going.  Lost them in this game, nope, I'm done.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not recommended. I don’t understand why people overrated this game so much. The hit boxes are terrible — even after an animation finishes, the hit box sometimes stays active, and if you accidentally step into it, you take damage (I’ve also heard the same complaints in multiple reviews and tutorial videos, especially when it comes to bosses like Fuxi and Jiequan.).\r\n\r\nAs you progress and unlock more items, currency, and upgrades, you’re supposed to feel stronger, but instead the game somehow feels worse.\r\n\r\nThere’s also an extremely frustrating issue where if you accidentally take damage, you can get stuck in an endless damage chain. This usually happens when you fall off a platform and the screen goes black to reposition you. Meanwhile, a boss or mob can start attacking, and during that moment you can’t parry or block anything.\r\n\r\nI get that the developers wanted the game to be challenging, but challenge should feel fair, not like a pointless struggle. Right now it feels more annoying than rewarding.\r\n\r\nSouls games are hard too, but whenever something goes wrong in those games, I never feel like it’s the game’s fault. I’ve never felt this level of frustration or the sense that I’m being punished for things outside my control. Here, it constantly feels like the game — not the player — is messing up.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A game designed by a brain-damaged retard who does not know that if an enemy attack takes 1.5 seconds to execute, the counter to that attack has to take less than 1.5 seconds in order to execute.  \n\nDuhhhh.   Durrrrrr.\n\nThat way, you can react to tells.  This is beyond basic game design 101.  This is common sense.  Something that the development team of this game is sorely lacking in.  \n\nDerrrrr.   \n\nDuhhhhh.\n\nHow much of a drooling-on-yourself moron do you have to be to not understand this basic concept?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I Don't recommend because Red Candle Games is a shitty studio, if I knew beforehand I wouldn't have bought this game. China will be fully unified, no matter what those capitalist racists think.\n\ndecent game tho, combat is tough",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the gameplay in between main boss fights — however, only half the main bosses are actually fun and the other half are flat out irritating. It's also very dialogue-heavy for this genre and the story didn't hold my interest, but there are some charming character interactions here and there. Overall I wouldn't recommend it unless parrying is your favorite mechanic in video games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a garbage prison section. Game becomes incredibly tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i was enjoying it until the stealth section. i don’t know who requested that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rage game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate reading",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THE GAME DOESN'T PLAY ITSELF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ok, you know what, fuck it, I have free will and I'll use it.\nI did not enjoy this. Many elements just ruined the game for me.\nOn paper, it should have been great, but that's only on paper.\nWhile the game is said to be a child of Sekiro and Hollow Knight, it is, in fact, none of that,\n\nWhy it's not Sekiro:\nIn Sekiro, if you perfect parry, you're winning.\nIn Nine Sols, if you perfect parry, you're in a stalemate.\nIn Sekiro, if you perfect parry, you're rewarded.\nIn Nine Sols, if you perfect parry, you're not PUNISHED.\nThe main tool the game gives you doesn't really have the capability to, when used correctly, give you the advantage in a fight. It only gives you more time.\n\nWhy it's not Hollow Knight:\nThe game is very linear and can't really be called a metroidvania. I've felt like I'd never had a choice where to go. I did receive new abilities, sure; (the process of which was the dullest way possible, it's just handed to you at a resting point with no effort on your part and for no apparent reason besides letting you progress) however, they really only let me go in that one area that requires that ability. There is also barely any reason to come back to already explored areas, as mostly you can collect all the stuff with the abilities you already had at that point in time. The jade system is blatantly just Hollow Knight's charms, which would be fine, that's a great system, if and only if the charms themself were useful, and most of them didn't find any use, but that may just be a me problem.\n\nBesides that, the game has other problems. The enemy variety is barely adequate. Few areas have enemies unique to them, and most use an established roster that becomes stale. While it's unreasonable to compare it to something like Silksong's insane 200+ enemy count, this still leaves a bad taste.\n\nAnd on topic of Silksong, this game is very punishing, so much more than Silksong ever was. In other Soulslikes (Silksong, Elden Ring, DS trilogy, Sekiro etc.), I can expect to reach the boss' second phase, learn a bit, and die having gained crucial knowledge. Here, I'm almost instantly executed. The lack of health (or rather the insane amounts the bosses deal) combined with punishing parry system makes for barely any time to learn boss patterns, which is, by far, the most important part for a game that tries to be like Sekiro. Sekiro dealt with that by its namesake: you could die twice. Silksong limits the damage to two masks. Dark Souls and Elden Ring didn't really have attacks this punishing, and, if in trouble, use dodge roll.\nThis game doesn't have anything that'd let you learn the fight. The final result will look impressive, but the path to it will be miserable and unenjoyable.\n\nAnd as a personal gripe, [spoiler]Eigong's Seal attack[/spoiler] has a shit hitbox, and very frequently clips you after you've dashed through it and are a good distance away from [spoiler]her[/spoiler], akin to how bosses in DS2 could grab attack you after what would seem to be a successful dodge.\n\n[spoiler]Oh wow. It got worse.\nEigong's first phase is manageble.\nEigong's second phase trips you up a LOT, but you can suffer through it.\nEigong's third phase... is the reason why gameplay is never cinematic.\nWho the hell thought it would be a good idea to make an average gamer do that fucking Pure Vessel mod.\nYep, using Story mode now. Feeling zero shame in it. No one should put up with bullshit like this.\n[/spoiler]\n\nOn a good note, the art is gorgeous, the music is too, the lore is rich, the story is interesting and the characters are great as well. Shame it's all built on a flawed gameplay.\n\nThe game is still good for some people, especially for ones who don't mind using easy mode, but it has no business being compared to Sekiro nor Hollow Knight.",
      "voted_up": false,
      "votes_helpful": 16
    }
  ]
}