{
  "positive": [
    {
      "review": "Everyone probably knows this by now – although the entire FIFA series is a significant title in the history of sports games, we we're witnessing its end, of sorts. Due to licensing issues, FIFA 23 was the last game in the football simulator series released under this name by EA Sports. What we will receive next, but now under the banner of EA Sports FC, is still mainly a mystery. However, for now, just as basketball fans regularly enjoy NBA 2K2...\n\n🧠Fortunately, EA Sports, the publisher, didn't approach this with the \"end of a legend, so players will buy it anyway\" mentality. The series creators also didn't think that refreshing rosters and adding new items to FIFA Ultimate Team would be enough. Back then, they utilized HyperMotion 2 technology to provide a realistic simulation of player actions, the ball's movement, and even the ground. These improvements, however, might not please all gamers, but it is still good to dig into them a bit.\n\nA change introduced by HyperMotion 2 is the different collisions between players, especially goalkeepers. Nonetheless, a lot of weird things have happened on the internet where players are contorted in impossible ways and keepers smash their heads against... the goalposts. I cannot say what it is, but after playing FIFA 23 for a minimum of twelve hours, I somehow did not come across any of such \"attractions\". What I did see, however, was the effect of turf wear. It's very interesting. And while it sometimes seems a bit exaggerated, it's nice to see the worn out spot on the grass where you made a slide tackle moments earlier.\n\nWhile FIFA 23 naturally focuses on match play, and the player control mechanics are paramount for many, we can't forget about the numerous variations. These, of course, come in the form of familiar modes like Seasons, Manager Career, Single Player Story, the street-style Volta, and the incredibly popular FIFA Ultimate Team (FUT). All of these have undergone minor modifications that make them even more appealing.\n\nFirst up, let's take FUT – it's still EA Sports' money-making machine, thanks to packs that can be purchased with real money. By depositing real money, you can also secure more virtual currency, which will be useful in the transfer market. Of course, all of this can also be acquired simply by playing the game, but it will take significantly more time than securing an advantage with your own wallet. Those who are passionate about tracking card prices and purchasing them can also use a dedicated mobile app.\n\nAnother interesting addition to FUT is the \"Moments\" mode, which gives players short tasks to complete, such as winning a match late in the game from a draw, or scoring a hat-trick with a specific outfield player.\nMany players have complained about the weak storyline in Career Mode. Alex Hunter is becoming boring, and the storytelling of street football in Volta is too cliched. Well, there's no narrative as such in FIFA 23. Controlling your player primarily observes what's happening in the locker room or during training sessions, thanks to new animations and cutscenes.\n\nIn addition to standard skill development, decisions have also been added that influence the player's personality. For example, your player can become a virtuoso who relies on individual skills or a well-liked teammate who always emphasizes that success is the result of teamwork. This is a very welcome addition, which reminds me of the somewhat more limited post-match choices found in NBA 2K23.\n\nIt's also interesting that in Career, you're given a middle ground between automatic match simulation and full time gameplay. You have the option to be involved only in crucial moments that have the potential to affect the result or your player's rating. Besides, if you like to train your own player in Volta mode, the Pro Clubs feature has been incorporated, thus enabling you to do the work on a single account and acquiring the same character's experience in both match types. By choosing the Manager Path, you'll finally receive models of real life characters.\n\nThes changes have also resulted in a greater role for women in football. The FIFA 23 matches include teams from the women’s leagues of England and France, and at the same time, I have noticed women refereeing or showing the numbers of the players who are substituted or replaced during men's matches. But it seemed like the women's games were still the same as FIFA 22 in terms of dynamics, as if HyperMotion 2 had no effect.\n\nAnd lastly, I must mention another change that will surely please those irritated by the commentators' sarcastic remarks. FIFA 23 offers an option to disable negative dialogue. Choosing this option means you will not be able to listen to statements such as, \"How could he miss such a chance? Most likely the coach will have a word with him during the break, and it won't be a nice chat.\" Undoubtedly, it is a captivating concept.\n\n✅The Good.\n- More realistic player dynamics\n- Easier team chemistry in FUT mode\n- Real-life manager characters and Ted Lasso\n- Consistently good soundtrack and commentary\n- Super shots are an interesting addition\n\n❌The Bad.\n- New animations don't always work correctly\n- FUT mode continues to promote microtransactions\n- Many cheaters playing on PC are ruining the cross-play experience\n- Lack of completely new modes\n\n🧾In Conclusion.\nFIFA 23 has marked the end of an era. There will be no further installments of this series published by EA Sports under this banner. That's probably why the most die hard fans of the series will want to have this historic installment in their collection. Everyone else should be interested too. The developers have really put in the effort to improve some features and increase realism.\n\nThe most recent, and actually last, chapter of the legendary FIFA series is just superior to the last one. The alterations are not earth-shattering, yet they still make a difference on the whole experience. In my opinion, there is no point in playing any previous version if I have FIFA 23 on pc. It’s a decent choice for football fans as well as casual gamers who just see it as a competition with friends.\n8/10🔚",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Played this on my xbox and its probably my favourite fifa game.\n\nOn pc i dont really like it. The controls on PC are weird but on xbox theyre fine\n\n\n4 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the last FIFA game I’ll buy considering they have stopped their partnership and the newer games including this just seem to be exploiting players with micro transactions. Still, for the thousands of hours of memories with my buddies over the past two decades I bought the last ever EA Sports FIFA game. I have faced the same problems as others of the game taking too long to launch and having bugs even at this point, but overall with a stable internet connection the anticheat and game seems to run by 5 minutes. The gameplay itself is fine, I cant really gather any notable improvements from the older games but defending seems to be a bit more difficult. \n\nOverall the game provides value for offline local pvp with friends, I dont play career or the online modes so for the basic friendly matches its good enough I guess. A fair goodbye to the FIFA series I suppose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game very fun carreer mode very realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent...idk I probably wouldn't buy it right now. kinda outdated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bad gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes very good if you play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i think i might've liked this game just a bit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last best Fifa",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the last good FIFA by EA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best fifa i ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "last good fifa",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mbappe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mantap kkali",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i miss these days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FaakmlfaFwwdawdw ad  wda",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion, FIFA 23 is overall a good game that seeks to portray football in a realistic manner within a video game setting.\n\nCompared to the previous FIFA titles, this one stands out as it is the final installment to carry the “FIFA” name. However, it does not differ drastically from its predecessors, only in a few aspects: free kicks are easier to score (which, in my view, makes FIFA 23 more realistic), there are HyperMotion and graphical improvements (the most noticeable being in hair detail), career mode has been slightly adjusted, the pre-match introductions have changed, and some players find the AI a bit too strong. As for Ultimate Team, I consider it something of a cash grab; in my opinion, it is far more worthwhile and entertaining to play with friends or in online matches using real teams.\n\nAll in all, one could say that it is not necessarily worthwhile to purchase every single FIFA game individually. That said, a noticeable difference can now be seen between the newer FC series and the “old” FIFA games, so for anyone looking to buy a new football game today, opting for the latest title may indeed be the wiser choice.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "💬The relatively old announcement of Electronic Arts' termination of further cooperation with the Fédération Internationale de Football Association disrupted this status quo and put the future of the series in doubt. It also, willingly or unwillingly, turned the FIFA 23 into a symbolic game, a grand finale, a landmark.\n\n🎮While this production certainly doesn't live up to all of these distinctions, it's hard to deny that it's the most technologically impressive installment in the series. Graphical and procedural innovations, however, can't change the fact that, in terms of gameplay, the \"23rd\" faces demons familiar to all FIFA faithful players. On the one hand, we're dealing with an incredibly realistic title in terms of animations and all the on-field behavior, but on the other, we feel like we're participating in an epileptic short film by Gaspar Noe, not an actual match.\n\nIt was a truly breath of fresh air for the entire franchise, worthy of the new-generation media hype. The gameplay was noticeably slower than i remembered from previous installments, and the HyperMotion system guaranteed many previously unseen player animations, generated based on the current situation on the pitch. I felt not only satisfied but also saved, as the then-competitor, the equivalent of my beloved PES, eFootball 2022, was below criticism. Therefore, I didn't expect FIFA 23 to be a revolution, but merely a safe development of proven ideas and mechanics.\n\nIn a sense, that's exactly what it is. The main system promoted by EA before its launch was HyperMotion 2.0. Not only did it further enhance the realism of player behavior on the pitch, but it also added so many animations that it's impossible to count them (even though we're talking about 6,000 new pre-defined player actions and reactions). This is the result of a constantly evolving machine learning algorithm, thanks to which individual animation frames are generated during movement and depend on the current situation on the pitch, including ball physics, running speed, body position, impact, and many other variables.\n\nHyperMotion works slightly differently for women's matches. During the game's development, a special match of 22 female footballers was recorded using motion capture, which allowed for the capture of movements characteristic of the female representatives of this beautiful sport. I didn't personally notice any significant difference between the men's and women's game, but it's good that EA is/was devoting more and more effort and resources to perfecting the women's game. We also got some top-tier football clubs and referees to oversee the progress of matches. Perhaps by the end of this decade, we'll see a full-fledged manager mode and FUT for the women.\n\nHowever, I didn't notice any significant graphical advancement in the context of other elements. The fans, as usual, look awkward, and the players, despite having their faces and bodies scanned, still manage to be scary – either with an oversized nose (looking at you, Haaland) or with a slightly different, deformed body part. However, this doesn't change the fact that this is an audiovisually impressive production. This is especially true as the audio aspect is still enhanced by the voices rising from the fans' stands, specially prepared match settings with anthems and announcer's announcements, and a fantastically complex soundtrack of unusual world hits, which significantly enhances the time spent in the main menu digging into the transfer market.\n\nHowever, when it comes to FUT, it's precisely here that you'll notice something important and fresh, something regular players will immediately notice, as it upends the way squads are built. When building a team, we must constantly consider the players' chemistry, meaning their shared club affiliation or nationality. For many years, chemistry was represented by a system of pairing players in adjacent positions (e.g., a goalkeeper from the Spanish league benefited when playing with center-backs from the Spanish league). Now, that system was thoroughly redesigned, so a goalkeeper from the Spanish league gains chemistry even when playing with center-backs from the English league, but at least the striker pair belongs to the Spanish league. It sounds complicated, and at first it is, but believe me that in the end, it allowed you to build more tactically flexible and individually diverse teams.\n\n👍Pros.\n- FIFA is/was still FIFA, completely addictive\n- The pitch is as vibrantly green as ever\n- Realistic animations thanks to HyperMotion 2\n- Changes to FIFA Ultimate Team and manager mode\n\n👎Cons.\n- A lack of control over every pass or tackle\n- The faces of some players could have looked better\n- Comical on field situations caused by the player collision system\n- No interesting new features in VOLTA Football and Pro Clubs modes.\n\n🏁Conclusion.\nFIFA 23 shows that EA knows what a successful football game should look like, created to delight the crowds. While it's not a great conclusion to the series history, the gameplay doesn't always work, and the \"Tiktokization\" of gaming reality is disturbing, it's hard not to consider this installment a good one.\n🎯7/10\n\n💬1994–2023\nAlmost 30 years, that's how long FIFA endured under EA's wing, and it`s been a journey full of bumps and extreme emotions, but certainly unforgettable and groundbreaking, both for the sports game genre and the entire industry. The history of this series is material for another time, but I didn't get a tear in my eye, and thinking about the future, I feel not so much curiosity as uncertainty. More football titles will keep hitting the market than the world has ever known, and they will all compete with each other. Free-to-play eFootball will take off, the mysterious UFL will be released, 2K will likely be in charge of the new FIFA, and EA is breaking even with EA Sports FC.\n\nI don't know what the licensing and scale will be like, but Electronic Arts will prpoblably secure its market advantage primarily with a set of proven proprietary solutions. HyperMotion, which mentioned, is a game seller in its own right, and the FUT mode, besides being a microtransaction hell, has a cult following separate from the rest of the game. FIFA 23 may not perfectly culminate several decades of brand building, but it demonstrates that EA knows how a successful football game should look and function, created to please the masses.\nThe competition will be fiercer than ever before.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Everyone probably knows this by now – although the entire FIFA series is a significant title in the history of sports games, we we're witnessing its end, of sorts. Due to licensing issues, FIFA 23 was the last game in the football simulator series released under this name by EA Sports. What we will receive next, but now under the banner of EA Sports FC, is still mainly a mystery. However, for now, just as basketball fans regularly enjoy NBA 2K2...\n\n🧠Fortunately, EA Sports, the publisher, didn't approach this with the \"end of a legend, so players will buy it anyway\" mentality. The series creators also didn't think that refreshing rosters and adding new items to FIFA Ultimate Team would be enough. Back then, they utilized HyperMotion 2 technology to provide a realistic simulation of player actions, the ball's movement, and even the ground. These improvements, however, might not please all gamers, but it is still good to dig into them a bit.\n\nA change introduced by HyperMotion 2 is the different collisions between players, especially goalkeepers. Nonetheless, a lot of weird things have happened on the internet where players are contorted in impossible ways and keepers smash their heads against... the goalposts. I cannot say what it is, but after playing FIFA 23 for a minimum of twelve hours, I somehow did not come across any of such \"attractions\". What I did see, however, was the effect of turf wear. It's very interesting. And while it sometimes seems a bit exaggerated, it's nice to see the worn out spot on the grass where you made a slide tackle moments earlier.\n\nWhile FIFA 23 naturally focuses on match play, and the player control mechanics are paramount for many, we can't forget about the numerous variations. These, of course, come in the form of familiar modes like Seasons, Manager Career, Single Player Story, the street-style Volta, and the incredibly popular FIFA Ultimate Team (FUT). All of these have undergone minor modifications that make them even more appealing.\n\nFirst up, let's take FUT – it's still EA Sports' money-making machine, thanks to packs that can be purchased with real money. By depositing real money, you can also secure more virtual currency, which will be useful in the transfer market. Of course, all of this can also be acquired simply by playing the game, but it will take significantly more time than securing an advantage with your own wallet. Those who are passionate about tracking card prices and purchasing them can also use a dedicated mobile app.\n\nAnother interesting addition to FUT is the \"Moments\" mode, which gives players short tasks to complete, such as winning a match late in the game from a draw, or scoring a hat-trick with a specific outfield player.\nMany players have complained about the weak storyline in Career Mode. Alex Hunter is becoming boring, and the storytelling of street football in Volta is too cliched. Well, there's no narrative as such in FIFA 23. Controlling your player primarily observes what's happening in the locker room or during training sessions, thanks to new animations and cutscenes.\n\nIn addition to standard skill development, decisions have also been added that influence the player's personality. For example, your player can become a virtuoso who relies on individual skills or a well-liked teammate who always emphasizes that success is the result of teamwork. This is a very welcome addition, which reminds me of the somewhat more limited post-match choices found in NBA 2K23.\n\nIt's also interesting that in Career, you're given a middle ground between automatic match simulation and full time gameplay. You have the option to be involved only in crucial moments that have the potential to affect the result or your player's rating. Besides, if you like to train your own player in Volta mode, the Pro Clubs feature has been incorporated, thus enabling you to do the work on a single account and acquiring the same character's experience in both match types. By choosing the Manager Path, you'll finally receive models of real life characters.\n\nThes changes have also resulted in a greater role for women in football. The FIFA 23 matches include teams from the women’s leagues of England and France, and at the same time, I have noticed women refereeing or showing the numbers of the players who are substituted or replaced during men's matches. But it seemed like the women's games were still the same as FIFA 22 in terms of dynamics, as if HyperMotion 2 had no effect.\n\nAnd lastly, I must mention another change that will surely please those irritated by the commentators' sarcastic remarks. FIFA 23 offers an option to disable negative dialogue. Choosing this option means you will not be able to listen to statements such as, \"How could he miss such a chance? Most likely the coach will have a word with him during the break, and it won't be a nice chat.\" Undoubtedly, it is a captivating concept.\n\n✅The Good.\n- More realistic player dynamics\n- Easier team chemistry in FUT mode\n- Real-life manager characters and Ted Lasso\n- Consistently good soundtrack and commentary\n- Super shots are an interesting addition\n\n❌The Bad.\n- New animations don't always work correctly\n- FUT mode continues to promote microtransactions\n- Many cheaters playing on PC are ruining the cross-play experience\n- Lack of completely new modes\n\n🧾In Conclusion.\nFIFA 23 has marked the end of an era. There will be no further installments of this series published by EA Sports under this banner. That's probably why the most die hard fans of the series will want to have this historic installment in their collection. Everyone else should be interested too. The developers have really put in the effort to improve some features and increase realism.\n\nThe most recent, and actually last, chapter of the legendary FIFA series is just superior to the last one. The alterations are not earth-shattering, yet they still make a difference on the whole experience. In my opinion, there is no point in playing any previous version if I have FIFA 23 on pc. It’s a decent choice for football fans as well as casual gamers who just see it as a competition with friends.\n8/10🔚",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "FIFA 23 delivers an exciting and polished football experience, with updated rosters, realistic player animations, and refined gameplay mechanics. The game’s career mode and Ultimate Team remain engaging, though some modes feel slightly repetitive. Crossplay and HyperMotion2 technology enhance realism, making matches feel fluid and authentic. While it doesn’t revolutionize the series, FIFA 23 is a solid installment for football fans.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played this on my xbox and its probably my favourite fifa game.\n\nOn pc i dont really like it. The controls on PC are weird but on xbox theyre fine\n\n\n4 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the last FIFA game I’ll buy considering they have stopped their partnership and the newer games including this just seem to be exploiting players with micro transactions. Still, for the thousands of hours of memories with my buddies over the past two decades I bought the last ever EA Sports FIFA game. I have faced the same problems as others of the game taking too long to launch and having bugs even at this point, but overall with a stable internet connection the anticheat and game seems to run by 5 minutes. The gameplay itself is fine, I cant really gather any notable improvements from the older games but defending seems to be a bit more difficult. \n\nOverall the game provides value for offline local pvp with friends, I dont play career or the online modes so for the basic friendly matches its good enough I guess. A fair goodbye to the FIFA series I suppose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FIFA 23 is a solid football sim with polished gameplay and sharp visuals. It adds minor improvements like better animations and women's club teams, but feels very familiar. A good send-off to the FIFA name before EA Sports FC takes over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a big fan of FIFA series, but this game was more than what I expected it to be. Very nice graphics and well done with the football players faces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game very fun carreer mode very realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's all gone downhill from here, this FIFA is better than all the EA FC crap that has come afterwards.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "in my opinion the best fifa tied with fifa 18 ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent...idk I probably wouldn't buy it right now. kinda outdated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bad gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes very good if you play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i think i might've liked this game just a bit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last best Fifa",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the last good FIFA by EA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best fifa i ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The last Fifa game. Less bug more fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "last good fifa",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "last good fifa",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it was worth the money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY GOOD FİFA23",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perhaps we treated you too harshly",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It Gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "la misma mamada de siempre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nie lubie fify nie wiem po co kupiłem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mbappe",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mantap kkali",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "moi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i miss these days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yeah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FaakmlfaFwwdawdw ad  wda",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "f",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "xccczxqc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "65416451",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nnn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "w",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⠀⠀",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "h",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777777",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣏⡦⠤⣤⠽⠤⡄\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡤⠤⠣⢈⠇⠀⠁⣠⡿⡄\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠂⠉⠀⠀⠀⠀⠀⢀⡀⠈⠀⠀⠈\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡔⠀⠀⠀⠀⠀⡀⠀⡰⣯⡀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⠁⠀⠀⠀⠀⠀⡹⠂⢽⠎⠁⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⣀⠠⠄⠃⣴⠀⠀⢀⡠⠊⠀⠀⠀⠀⠀⠀⠀⠀⠀\r\n⠈⠉⠉⠉⠉⠉⠉⠀⠀⠀⠀⠈⠧⣢⠌⣁⠐⠋⠂⠀⠀⠀⠀⠀⠀⠀\r\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠈⠀⠀",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion, FIFA 23 is overall a good game that seeks to portray football in a realistic manner within a video game setting.\n\nCompared to the previous FIFA titles, this one stands out as it is the final installment to carry the “FIFA” name. However, it does not differ drastically from its predecessors, only in a few aspects: free kicks are easier to score (which, in my view, makes FIFA 23 more realistic), there are HyperMotion and graphical improvements (the most noticeable being in hair detail), career mode has been slightly adjusted, the pre-match introductions have changed, and some players find the AI a bit too strong. As for Ultimate Team, I consider it something of a cash grab; in my opinion, it is far more worthwhile and entertaining to play with friends or in online matches using real teams.\n\nAll in all, one could say that it is not necessarily worthwhile to purchase every single FIFA game individually. That said, a noticeable difference can now be seen between the newer FC series and the “old” FIFA games, so for anyone looking to buy a new football game today, opting for the latest title may indeed be the wiser choice.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "💬The relatively old announcement of Electronic Arts' termination of further cooperation with the Fédération Internationale de Football Association disrupted this status quo and put the future of the series in doubt. It also, willingly or unwillingly, turned the FIFA 23 into a symbolic game, a grand finale, a landmark.\n\n🎮While this production certainly doesn't live up to all of these distinctions, it's hard to deny that it's the most technologically impressive installment in the series. Graphical and procedural innovations, however, can't change the fact that, in terms of gameplay, the \"23rd\" faces demons familiar to all FIFA faithful players. On the one hand, we're dealing with an incredibly realistic title in terms of animations and all the on-field behavior, but on the other, we feel like we're participating in an epileptic short film by Gaspar Noe, not an actual match.\n\nIt was a truly breath of fresh air for the entire franchise, worthy of the new-generation media hype. The gameplay was noticeably slower than i remembered from previous installments, and the HyperMotion system guaranteed many previously unseen player animations, generated based on the current situation on the pitch. I felt not only satisfied but also saved, as the then-competitor, the equivalent of my beloved PES, eFootball 2022, was below criticism. Therefore, I didn't expect FIFA 23 to be a revolution, but merely a safe development of proven ideas and mechanics.\n\nIn a sense, that's exactly what it is. The main system promoted by EA before its launch was HyperMotion 2.0. Not only did it further enhance the realism of player behavior on the pitch, but it also added so many animations that it's impossible to count them (even though we're talking about 6,000 new pre-defined player actions and reactions). This is the result of a constantly evolving machine learning algorithm, thanks to which individual animation frames are generated during movement and depend on the current situation on the pitch, including ball physics, running speed, body position, impact, and many other variables.\n\nHyperMotion works slightly differently for women's matches. During the game's development, a special match of 22 female footballers was recorded using motion capture, which allowed for the capture of movements characteristic of the female representatives of this beautiful sport. I didn't personally notice any significant difference between the men's and women's game, but it's good that EA is/was devoting more and more effort and resources to perfecting the women's game. We also got some top-tier football clubs and referees to oversee the progress of matches. Perhaps by the end of this decade, we'll see a full-fledged manager mode and FUT for the women.\n\nHowever, I didn't notice any significant graphical advancement in the context of other elements. The fans, as usual, look awkward, and the players, despite having their faces and bodies scanned, still manage to be scary – either with an oversized nose (looking at you, Haaland) or with a slightly different, deformed body part. However, this doesn't change the fact that this is an audiovisually impressive production. This is especially true as the audio aspect is still enhanced by the voices rising from the fans' stands, specially prepared match settings with anthems and announcer's announcements, and a fantastically complex soundtrack of unusual world hits, which significantly enhances the time spent in the main menu digging into the transfer market.\n\nHowever, when it comes to FUT, it's precisely here that you'll notice something important and fresh, something regular players will immediately notice, as it upends the way squads are built. When building a team, we must constantly consider the players' chemistry, meaning their shared club affiliation or nationality. For many years, chemistry was represented by a system of pairing players in adjacent positions (e.g., a goalkeeper from the Spanish league benefited when playing with center-backs from the Spanish league). Now, that system was thoroughly redesigned, so a goalkeeper from the Spanish league gains chemistry even when playing with center-backs from the English league, but at least the striker pair belongs to the Spanish league. It sounds complicated, and at first it is, but believe me that in the end, it allowed you to build more tactically flexible and individually diverse teams.\n\n👍Pros.\n- FIFA is/was still FIFA, completely addictive\n- The pitch is as vibrantly green as ever\n- Realistic animations thanks to HyperMotion 2\n- Changes to FIFA Ultimate Team and manager mode\n\n👎Cons.\n- A lack of control over every pass or tackle\n- The faces of some players could have looked better\n- Comical on field situations caused by the player collision system\n- No interesting new features in VOLTA Football and Pro Clubs modes.\n\n🏁Conclusion.\nFIFA 23 shows that EA knows what a successful football game should look like, created to delight the crowds. While it's not a great conclusion to the series history, the gameplay doesn't always work, and the \"Tiktokization\" of gaming reality is disturbing, it's hard not to consider this installment a good one.\n🎯7/10\n\n💬1994–2023\nAlmost 30 years, that's how long FIFA endured under EA's wing, and it`s been a journey full of bumps and extreme emotions, but certainly unforgettable and groundbreaking, both for the sports game genre and the entire industry. The history of this series is material for another time, but I didn't get a tear in my eye, and thinking about the future, I feel not so much curiosity as uncertainty. More football titles will keep hitting the market than the world has ever known, and they will all compete with each other. Free-to-play eFootball will take off, the mysterious UFL will be released, 2K will likely be in charge of the new FIFA, and EA is breaking even with EA Sports FC.\n\nI don't know what the licensing and scale will be like, but Electronic Arts will prpoblably secure its market advantage primarily with a set of proven proprietary solutions. HyperMotion, which mentioned, is a game seller in its own right, and the FUT mode, besides being a microtransaction hell, has a cult following separate from the rest of the game. FIFA 23 may not perfectly culminate several decades of brand building, but it demonstrates that EA knows how a successful football game should look and function, created to please the masses.\nThe competition will be fiercer than ever before.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Everyone probably knows this by now – although the entire FIFA series is a significant title in the history of sports games, we we're witnessing its end, of sorts. Due to licensing issues, FIFA 23 was the last game in the football simulator series released under this name by EA Sports. What we will receive next, but now under the banner of EA Sports FC, is still mainly a mystery. However, for now, just as basketball fans regularly enjoy NBA 2K2...\n\n🧠Fortunately, EA Sports, the publisher, didn't approach this with the \"end of a legend, so players will buy it anyway\" mentality. The series creators also didn't think that refreshing rosters and adding new items to FIFA Ultimate Team would be enough. Back then, they utilized HyperMotion 2 technology to provide a realistic simulation of player actions, the ball's movement, and even the ground. These improvements, however, might not please all gamers, but it is still good to dig into them a bit.\n\nA change introduced by HyperMotion 2 is the different collisions between players, especially goalkeepers. Nonetheless, a lot of weird things have happened on the internet where players are contorted in impossible ways and keepers smash their heads against... the goalposts. I cannot say what it is, but after playing FIFA 23 for a minimum of twelve hours, I somehow did not come across any of such \"attractions\". What I did see, however, was the effect of turf wear. It's very interesting. And while it sometimes seems a bit exaggerated, it's nice to see the worn out spot on the grass where you made a slide tackle moments earlier.\n\nWhile FIFA 23 naturally focuses on match play, and the player control mechanics are paramount for many, we can't forget about the numerous variations. These, of course, come in the form of familiar modes like Seasons, Manager Career, Single Player Story, the street-style Volta, and the incredibly popular FIFA Ultimate Team (FUT). All of these have undergone minor modifications that make them even more appealing.\n\nFirst up, let's take FUT – it's still EA Sports' money-making machine, thanks to packs that can be purchased with real money. By depositing real money, you can also secure more virtual currency, which will be useful in the transfer market. Of course, all of this can also be acquired simply by playing the game, but it will take significantly more time than securing an advantage with your own wallet. Those who are passionate about tracking card prices and purchasing them can also use a dedicated mobile app.\n\nAnother interesting addition to FUT is the \"Moments\" mode, which gives players short tasks to complete, such as winning a match late in the game from a draw, or scoring a hat-trick with a specific outfield player.\nMany players have complained about the weak storyline in Career Mode. Alex Hunter is becoming boring, and the storytelling of street football in Volta is too cliched. Well, there's no narrative as such in FIFA 23. Controlling your player primarily observes what's happening in the locker room or during training sessions, thanks to new animations and cutscenes.\n\nIn addition to standard skill development, decisions have also been added that influence the player's personality. For example, your player can become a virtuoso who relies on individual skills or a well-liked teammate who always emphasizes that success is the result of teamwork. This is a very welcome addition, which reminds me of the somewhat more limited post-match choices found in NBA 2K23.\n\nIt's also interesting that in Career, you're given a middle ground between automatic match simulation and full time gameplay. You have the option to be involved only in crucial moments that have the potential to affect the result or your player's rating. Besides, if you like to train your own player in Volta mode, the Pro Clubs feature has been incorporated, thus enabling you to do the work on a single account and acquiring the same character's experience in both match types. By choosing the Manager Path, you'll finally receive models of real life characters.\n\nThes changes have also resulted in a greater role for women in football. The FIFA 23 matches include teams from the women’s leagues of England and France, and at the same time, I have noticed women refereeing or showing the numbers of the players who are substituted or replaced during men's matches. But it seemed like the women's games were still the same as FIFA 22 in terms of dynamics, as if HyperMotion 2 had no effect.\n\nAnd lastly, I must mention another change that will surely please those irritated by the commentators' sarcastic remarks. FIFA 23 offers an option to disable negative dialogue. Choosing this option means you will not be able to listen to statements such as, \"How could he miss such a chance? Most likely the coach will have a word with him during the break, and it won't be a nice chat.\" Undoubtedly, it is a captivating concept.\n\n✅The Good.\n- More realistic player dynamics\n- Easier team chemistry in FUT mode\n- Real-life manager characters and Ted Lasso\n- Consistently good soundtrack and commentary\n- Super shots are an interesting addition\n\n❌The Bad.\n- New animations don't always work correctly\n- FUT mode continues to promote microtransactions\n- Many cheaters playing on PC are ruining the cross-play experience\n- Lack of completely new modes\n\n🧾In Conclusion.\nFIFA 23 has marked the end of an era. There will be no further installments of this series published by EA Sports under this banner. That's probably why the most die hard fans of the series will want to have this historic installment in their collection. Everyone else should be interested too. The developers have really put in the effort to improve some features and increase realism.\n\nThe most recent, and actually last, chapter of the legendary FIFA series is just superior to the last one. The alterations are not earth-shattering, yet they still make a difference on the whole experience. In my opinion, there is no point in playing any previous version if I have FIFA 23 on pc. It’s a decent choice for football fans as well as casual gamers who just see it as a competition with friends.\n8/10🔚",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "FIFA 23 delivers an exciting and polished football experience, with updated rosters, realistic player animations, and refined gameplay mechanics. The game’s career mode and Ultimate Team remain engaging, though some modes feel slightly repetitive. Crossplay and HyperMotion2 technology enhance realism, making matches feel fluid and authentic. While it doesn’t revolutionize the series, FIFA 23 is a solid installment for football fans.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played this on my xbox and its probably my favourite fifa game.\n\nOn pc i dont really like it. The controls on PC are weird but on xbox theyre fine\n\n\n4 stars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the last FIFA game I’ll buy considering they have stopped their partnership and the newer games including this just seem to be exploiting players with micro transactions. Still, for the thousands of hours of memories with my buddies over the past two decades I bought the last ever EA Sports FIFA game. I have faced the same problems as others of the game taking too long to launch and having bugs even at this point, but overall with a stable internet connection the anticheat and game seems to run by 5 minutes. The gameplay itself is fine, I cant really gather any notable improvements from the older games but defending seems to be a bit more difficult. \n\nOverall the game provides value for offline local pvp with friends, I dont play career or the online modes so for the basic friendly matches its good enough I guess. A fair goodbye to the FIFA series I suppose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FIFA 23 is a solid football sim with polished gameplay and sharp visuals. It adds minor improvements like better animations and women's club teams, but feels very familiar. A good send-off to the FIFA name before EA Sports FC takes over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a big fan of FIFA series, but this game was more than what I expected it to be. Very nice graphics and well done with the football players faces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game very fun carreer mode very realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's all gone downhill from here, this FIFA is better than all the EA FC crap that has come afterwards.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "in my opinion the best fifa tied with fifa 18 ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent...idk I probably wouldn't buy it right now. kinda outdated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bad gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes very good if you play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i think i might've liked this game just a bit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The last best Fifa",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the last good FIFA by EA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best fifa i ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "this game is so bad don't buy it, all fifa games are bad, f-ea",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "adding woman ruined the game. one of the worst fifa",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yes, I know. Game is dead and still suck. Why I writing this review now? Just like that, bye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NAH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You fking scammer. I paid a fortune to buy this game and after one year and a half, you decided to shut down the server to force us to buy your latest copy. We players ground so hard to get the cards we aimed for and after all, you ruined all the fun and hard work. Screw you. You think doing this can force me to buy you shjtty FC 26? Really?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Well, like any other EA game it's full of microtransactions and copy paste of last year. If we consumers want better products we need to STOP buying their games. Only way they listen is when  they lose money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so bad don't buy it, all fifa games are bad, f-ea",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "adding woman ruined the game. one of the worst fifa",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yes, I know. Game is dead and still suck. Why I writing this review now? Just like that, bye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not on the heights of PES 2012 with classical teams :(\nOnce you learn some moves, you can dribble everyone over and over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How is it legal, to sell a product that doesnt work half the time, and  is just  a modified version of the previous product for 70$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game's startup time is too long. Too many bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Treading a fine line between regretting the purchase and telling myself \"it's ok, you had fun\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA launcher is SHIT",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "ragebait ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game still has a lot of bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ribet harus pakai EA sport dulu harus login",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Give me back my money!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Abysmal dogsh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NAH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "xujnia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks balls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You fking scammer. I paid a fortune to buy this game and after one year and a half, you decided to shut down the server to force us to buy your latest copy. We players ground so hard to get the cards we aimed for and after all, you ruined all the fun and hard work. Screw you. You think doing this can force me to buy you shjtty FC 26? Really?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Cant play online \r\nIts stealing its alled stealing its like you pay for a game and it does not work anymore \r\nEA IS STEALINGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, like any other EA game it's full of microtransactions and copy paste of last year. If we consumers want better products we need to STOP buying their games. Only way they listen is when  they lose money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so bad don't buy it, all fifa games are bad, f-ea",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "adding woman ruined the game. one of the worst fifa",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yes, I know. Game is dead and still suck. Why I writing this review now? Just like that, bye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not on the heights of PES 2012 with classical teams :(\nOnce you learn some moves, you can dribble everyone over and over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How is it legal, to sell a product that doesnt work half the time, and  is just  a modified version of the previous product for 70$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game's startup time is too long. Too many bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Treading a fine line between regretting the purchase and telling myself \"it's ok, you had fun\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA launcher is SHIT",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "ragebait ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game still has a lot of bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ribet harus pakai EA sport dulu harus login",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Give me back my money!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Abysmal dogsh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NAH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "xujnia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks balls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You fking scammer. I paid a fortune to buy this game and after one year and a half, you decided to shut down the server to force us to buy your latest copy. We players ground so hard to get the cards we aimed for and after all, you ruined all the fun and hard work. Screw you. You think doing this can force me to buy you shjtty FC 26? Really?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Cant play online \r\nIts stealing its alled stealing its like you pay for a game and it does not work anymore \r\nEA IS STEALINGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, like any other EA game it's full of microtransactions and copy paste of last year. If we consumers want better products we need to STOP buying their games. Only way they listen is when  they lose money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so bad don't buy it, all fifa games are bad, f-ea",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "adding woman ruined the game. one of the worst fifa",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yes, I know. Game is dead and still suck. Why I writing this review now? Just like that, bye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not on the heights of PES 2012 with classical teams :(\nOnce you learn some moves, you can dribble everyone over and over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How is it legal, to sell a product that doesnt work half the time, and  is just  a modified version of the previous product for 70$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game's startup time is too long. Too many bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Treading a fine line between regretting the purchase and telling myself \"it's ok, you had fun\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA launcher is SHIT",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "ragebait ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game still has a lot of bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ribet harus pakai EA sport dulu harus login",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Give me back my money!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Abysmal dogsh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NAH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "xujnia",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks balls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You fking scammer. I paid a fortune to buy this game and after one year and a half, you decided to shut down the server to force us to buy your latest copy. We players ground so hard to get the cards we aimed for and after all, you ruined all the fun and hard work. Screw you. You think doing this can force me to buy you shjtty FC 26? Really?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Cant play online \r\nIts stealing its alled stealing its like you pay for a game and it does not work anymore \r\nEA IS STEALINGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, like any other EA game it's full of microtransactions and copy paste of last year. If we consumers want better products we need to STOP buying their games. Only way they listen is when  they lose money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so bad don't buy it, all fifa games are bad, f-ea",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "adding woman ruined the game. one of the worst fifa",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Yes, I know. Game is dead and still suck. Why I writing this review now? Just like that, bye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not on the heights of PES 2012 with classical teams :(\nOnce you learn some moves, you can dribble everyone over and over",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "How is it legal, to sell a product that doesnt work half the time, and  is just  a modified version of the previous product for 70$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game's startup time is too long. Too many bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Treading a fine line between regretting the purchase and telling myself \"it's ok, you had fun\".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "EA launcher is SHIT",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "ragebait ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage optimization",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game still has a lot of bugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ribet harus pakai EA sport dulu harus login",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Give me back my money!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Abysmal dogsh*t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NAH",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}