{
  "positive": [
    {
      "review": "I'm new in the game, but I can confirm it has huge potential and is well structured already.\n\nMy only problem is Donkey Crew decision of allow mods run free even in the Early Access. This makes me worry that the game will not be developted the way it need to be because the devs could leave to the modders some solutions, improvements or even bug fixes. I hope I'm wrong. \n\nI have bad experiences with games whose developers allowed mods run the show.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Fantastic game to lose a few hundred hours of life in.\r\n\r\nThe only real con, mods disabled in beta & they only post update notes in the discord terror network.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is fantastic. I actually cannot believe it is in early access still. While Medieval Dynasty is more polished, this is deeper, much deeper. Tech tree is excellent, villager concept is new and different from all of the same engines.  Fighting is not deep but for me a city builder it is enough.  If you like city builders with a little bit more than just building a city this is a great option.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Basically Medieval Dynasty, but more dangerous. Instead of bandits being a rare and random thing you might have the misfortune to run into, at least the beginning of the game (where I still am) largely revolves around eliminating the many camps of bandits who are terrorizing the region. But other than that, it's still a game of playing as a Medieval peasant who walks around picking up sticks and rocks and edible things to try to survive and build a settlement. Whereas the devs of Medieval Dynasty have been hinting at some kind of mystery to be solved in the Oxbow but never got around to delivering, Bellwright is very plot-driven. Whereas the whole objective in Medieval Dynasty is just to have a kid (not that hard, and the game plateaus after that), Bellwright also has you arriving as a homeless orphan unraveling a history of a crime against a loved one, but leads to you liberating villages and commanding an army. Bit more exciting than just hunting the same bear once every season.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It has its glitches and frustrations but nothing that cannot be fixed with mod's until the dev's decide to include features in the game... Hours of fun and even some replayability",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Im having fun with this title. At first it can be frustrating but once you move some keybinds around and bring some friends with you its very fun. Your villagers can be quite capable and having a few as bannermen/bodyguards can help combat a lot. The bugs so far seem to mainly be around terrain issues such as cliffs and water. That said i havent been thrown into the air or fallen through the map like in some games. Crashing seems to happen for people joining but after they rejoin it clears up. Other than that the game runs fine and the content so far is rewarding. The tech tree is massive and the mods so far help give you a bit more choice as to how you'd like your experience to flow. It can be grindy but thats what some people like, this can be mitigated with mods so its not a huge issue. I really look forward to new updates and the caravan system they got coming. The map is huge so caravans will be very important. Ill check back after the 100hr mark and give more feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Has elements of several different survival genres that make it tough and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one off if not the best Medieval survival game out there 68 hours into it and not even at 30% completion.\r\nBeautiful, doesnt feel to grindy and feels very much rewardings as the village you build grows.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bellwright is one of the better medieval survival games that actually has a bit of story that feels natural. The combat takes some getting used to since it was tricky at first for me to get down. But overall the game is fun and I have been playing for over 20 hours  in only a couple of days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't wait for actual release, I had \"beaten\" this game twice already but it makes me want to come back and create a new save every few months. Probably one of the best game in terms of NPC management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really appreciate the attention the devs put into this game. I like the building/research mechanic and how many things are real time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a wonderful game.  60 hours in and enjoying it very much.  As an early access game there are still plenty of thing to polish, but the basic game play is there.  The story is solid and there is plenty to accomplish.  \r\n\r\nThere are even cats in the game for you to pet.  Perhaps a future development will have them snuggling up in your bed at night and purr.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loving the concept. Settlement base & community building. Hope they add more game features in the near future especially in Battle / Raid mode. New enemies, horses & etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gift from a friend, enjoy the game. Would recommend.\n\nSadly it is not fully there and they are using AI voice acting so when you are talking the NPCs they are not silent back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game play. \r\n\r\nPlease add knight or warrior guild faction constantly expand and go fighting the bandit and patrol on the liberated map. player can supply weapon and armour to the faction to make it stronger",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. It has lots of room to grow, but right now it is a great game. It has some of the best quality of life features in the genres of building/village sim/small scale battles. Like:\nUsing a priority system for jobs instead of assigning someone to a job like farmer, like in Rimworld.\nAllowing you to instantly have a villager switch to run and guard you, or assigning a group to an army and raising them to guard you with 1 button. Running around ganking bandits with your neighbors is very satisfying.\nAbility to relocate buildings with a few clicks, the villagers dismantle it and move it and its contents on their own. Move your whole village if you find a place you like better later. Or make outposts all over.\nHaving a cat that meows and purrs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you like games that are survival based and base building that takes a long time, in a good way than this is your game . its defenently not a game you just blow right through",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a laid back history at a glance, kinda vibe. its got i's ups n downs like any game but it has it's audience, up to you I genuinly like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game and I'm on the preview branch so there are many more features to the game. Keep up the great work and I'm excited to see where the full version leads.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love everything about this game apart from combat system. Definetly worth 30eur in my opinion. Its been a while since I was addicted to a game this much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely recommend this to people who want a nice-looking building/crafting/survival game.  Visually, the game is beautiful with a lot of detail, and the crafting and building is nicely done (for the most part--there are a few irksome decisions that create some strange bottlenecks in crafting).  The combat, like lot of crafting games, isn't the focus.  It's not all that amazing here, but it's decent.  And you'll equip like a little town of people who join up with you to deal with raids and bandits.  That can be fun.  I haven't gotten to late-game content, so I can't comment on that or the endgame.\n\nThis game likely won't give you the excitement of games that focus more on fighting (like, say, 'Conan Exiles'), but the settlements you can build are really great and look nice.  It feels realistic and very medieval, so if you love games like 'Medieval Dynasty', then this is probably your cup of tea.  There is some micromanaging, which might get a bit annoying, but I think this game handles villager management better than most other similar game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best survival/villaga managing game Ive ever played.. Also the amount of content still being added to the game is incredible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just gonna say that this is what I always wanted in a survival automation game: have my own slaves who can work and fight while I'm taking berrys or just hanging up with my cat in the base\n\nAt a date of 2025 - 11 - 22 the game is in early access so there is a lot of unbalance content and also laks on some progress and constructions (seriously, the only defensive wall right now is a fence that is unable to mantain the chicken in the farm) but still is very funny to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been really enjoying Bellwright so far. The gameplay feels fresh and rewarding, with building, exploring, and interacting with characters all blending together nicely to create a world that feels alive. There are a few small bugs here and there, but they don’t take away from the fun or the sense of immersion. What I like most is how the game gives me freedom to approach things in my own way, whether it’s managing resources, shaping settlements, or just wandering around to see what’s out there. The atmosphere is engaging, the visuals are appealing, and it already shows a lot of promise. Overall, it’s been a great experience, and I’m really looking forward to the full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, keeps me busy, bought it yesterday and has played for multiple hours without getting bored once. I like how it is challenging to progress and how the more people you recruit the more you'll have to provide. One thing I wish this game added though was the ability to ride things. They have animals in the game already, so why not be able to ride them? Ships would also be cool too, being able to customize it with your villages banner, or putting a mount on a pet wolf would be awesome. Especially fighting armies up on top a horse. Customizing your horse, and dock would be such a cool addition. Overall I'm really enjoying it so far, I love recruiting people and armoring them up, and either having them company me on a long journey, defend my village when I'm away, or gather some resources for my next big build.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have enjoyed every bit of this game. its like they took all the good features of this genre and put them into one. i think it would be funny if we could marry in the game so when i play with my wife i can show off my videogame wife lol. i cant wait to see this game in full fruition. I would like to see a inventory system that prioritizes inventory space above bag space, also mounts, different animals, and finally being able to sell all goods and not just what they are willing to buy.\r\nthank you this game is awsome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with good potential. Still some small bugs but overall a very good game to still be in early access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tons of content, not too many bugs. A lot of freedom.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I usually get bored with this style of game after I've reached a certain tech level, but the pacing on this one is somehow keeping me obsessed. Progress is staggered by needing to recruit villagers with certain specialties, which can only be recruited after freeing certain villages, keeping my drive going by breaking up goals into chunks instead of just having a broad main storyline goal. Love the parallel quests of building your own village and also building a fighting force and freeing the other established villages. \r\n\r\nHighly recommend downloading just a few quality of life mods - get yourself a bigger arrow capacity for the quiver, and get a mod that increases yield on ores. Mining ores without it is TEDIOUS. \r\n\r\nCONS about the game \r\n- the AI voices are horrible. Just truly awful. Really hope the mods employ some real voice actors for the full release. \r\n- Really wish the map gave town merchants a different icon than the rest of the villagers so I could find them\r\n- Wish there were more ways to earn gold, especially in the early game (though I am still struggling with gold at over 100 hours.)  An easily accessible merchant that bought pelts or some other resource you have in abundance early on would be SO helpful. \r\n- Not being able to take your companions with you when you fast travel is a real drag\r\n\r\nLove the game! I hope we get HORSES in a future update!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I very much like games that I can build stuff in it.\r\n\r\nThis game is one of the games I would say fit me 100% it got:\r\nSurvival Crafting\r\nBuilding a town\r\nFighting beasts and bandits\r\nRecruiting civilian to automate jobs\r\nDetailed work assignment just like Rimworld\r\nAnd the kicker you can make your own army from those same peasents\r\nThere is a detailed gear presets which you can decide \r\n\r\nThere are so many nuances things in this game and it's quite great.\r\n\r\nThe game has very active devs I don't know how active since well i joined the game less than 2 weeks ago and they have 2 different versions Stable which is how the games comes and the Preview branch which is a bit unstable but still good fun.\r\n\r\nLooking forward to seeing how the game progresses over the coming years like I said earlier this is the first game in a long time that I've liked this much!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It currently has some missing parts and optimization issues, but I think it will be resolved in the full version.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game I didn’t expect much but map is huge and so much to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game with interesting, and well implemented AI (mostly)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the concept of the colony sim and the added stress of a semi survival game with food buffs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best in class imho for this type, mechanics are great. Want it to succeed just to keep the bar raised on games of this ilk. Some rough spots but it's come a long way in EA.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is amazing and very difficult to get started but once you have some followers and figure out how to make them do what you want it is definetly a fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal game. Wonderful immersive environment. Fun combat system.\nSense of accomplishment as you build and evolve through the tiers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly in love with this game, I can't wait to see how it goes further into its life-span.\nThe ability to create your own village and having to go recruit villagers from others is just spectacular, it covers a lot of the strain from games of a similar genre. typically you reach a point where you need to automate to keep up with the resources you are using, but the act of installing automation tends to be very taxing or tedious, or requires more resources than it seems worth, being able to run out into the wilds, find a village and recruit the automation yourself is awesome, logical and feels great in game. I hope to see the game leave early access, and that its as great as I imagine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it, since they improve it it got way better and playable, before was a nightmare walking around and feed thoose soldier",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a masterpiece of a game, I was looking for something similar to Medival Dynasty and this is a great pull.\nI love the fact that is is a very slow and stressful build up unlike other survival games.\nnot sure about the Hunger system only being linked to health and stamina?\ni would love to see a revamp introducing a hunger system/Hunger bar and a villiage hunger management to keep your villiagers fed. The current food system to increase health and stamina is not for me.\nbesides that the game is a must and i highly recommend anyone who loves survival base building games to give this a try!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What I like:\n1. Good task management system\n2. Able to bring villagers to fight alongside with me\n3. A good variety of buildings and gears\n4. A somewhat okay story line\n\nWhat I hope will be improved/fixed:\n1. I know the devs want us to utilize the villagers for all the menial tasks but at the beginning I need to do most of these things myself. Chopping wood and mining takes forever AND I need to hold down the mouse button while harvesting is a pain. I had to create a macro on my mouse for continuous harvesting and running.\n2. This is one of the most down-to-earth type of survival game I played (other than Medieval Dynasty), but a few things don't make sense. Able to teleport from signs and docks kind of broke the immersion. It would be better if I can ride a horse, tell my companions to ride horses, and also build a carriage to transport troops.\n3. Tier 3 buildings are quite disappointing. They hog so much land space yet only do 1 or 2 things. Feels like a bunch of decorative blocks. I was hoping to do multiple things in each or able to build extra furniture/tools to increase productivity.\n\nSome other small stuff I hope gets added in the future:\n1. Tell companions to bring bandages/healing potions\n2. Assign food consumption priority (production buff vs combat buff)\n3. Marriage system\n4. Equipment quick swap button (swap between shield/long sword/bow) instead of opening inventory to swap\n5. Revamp food bag. Currently, villagers will automatically fill up their food bag even though I put 0 food in the gear set setting. I noticed my food pile depleted rapidly because food keep spoiling in their bags.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☑ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a very interesting game, it is unlike what I have played before. I put in 50 hours before buying for my upcomming wife and now I will put probably another 200 hours in it. The game keeps getting updated and the content is just getting better an better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Juego 100% recomendado, no deja de sorprenderme y las horas se pasan rápido sin darte cuenta.\n\nLa cantidad de detalles que tiene no deja de sorprender, y las actualizaciones que van sacando añaden aún más contenido del que imaginaria posible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is off to a really solid development. Very playable in it's current state, don't encounter many bugs, and it doesn't (as far as I've made it through the game) feel like there's any significant unfinished portions. I've not been playing long enough for a patch to come through, but it feels like the devs are working at this point on polishing and refining the game. \n\nIt can be a bit of a slow game, I'm sure a more skilled player, or someone who spends more time learning the game through the community, would have progressed a lot further than I have, and maybe not feel like it's dragging on as much. On that note: the tutorial is a little lacking, and I have more than once found that I needed to google answers to figure out game mechanics. Plus the world is large enough that simply trying to stumble across resources through in-game exploration would probably burn a ton of time. I've been simply looking up the locations of resources I'm missing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game! Can't wait for more content and a full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and cool game.. Little bugs every now and again would recommend checking out tho!! Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am surprised, this game is good.\r\nI was sceptical because of the directional combat.\r\nI still feel it is not necessary, but luckily I can use a bow and my Companions take the heat of me, so I can flank the enemies with some basic stabbing and slashing.\r\nSomeone pointed to this game in the Pax Dei froum, and I am happy I got this game instead of Pax Dei.\r\nThere is a bit of a learning curve, Top Off is your friend.\r\nIt took a while to find this out.\r\nThere is not much explanation how things work in game, but the internet helps a lot.\r\nSome information is outdated, but it is ok.\r\nStill some things to learn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Npc's may need a bit of micromanaging at times but overall very fun and unique game. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and cool game.. Little bugs every now and again would recommend checking out tho!! Enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A superb and huge game. Similar in concept to Medieval Dynasty (which I loved) but with decent fighting and quests, without the tedious relationship stuff. As a city builder it's very similar to MD, but the combat, quests and story are much, much better. Graphically I'd say it's on a par with MD. Better in some ways, slightly worse in others. It is something like Manor Lords was hyped to be, but it actually delivers, and delivers way more. It is at least 100 times better than Manor Lords.\nI've absolutely loved it and I don't think I've ever played a game so intensely, even KCD. There seems to be a fair bit of activity in the beta branch, so to paraphrase the villagers, the game is getting better and better, but to be honest even if they abandoned it as it is it would still be incredible value.\nThe only downsides for me are that it takes a long time to load a save and that building advanced buildings takes a lot of clicking - even more so than in MD.\nIf it hadn't been for Kingdom Come: Deliverance 2 it would have been my GOTY. \nIt's in very good shape for EA. A few occasions where my characters is waist-deep in the terrain, but, really, it's great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bellwright — Review\n\nBellwright feels like someone spliced a village-builder’s brain onto a first-person fighter’s body. If Kingdom Come: Deliverance had a baby with Manor Lords, you’d get this: a gritty, hands-on medieval rebellion where you plan production chains, place buildings, and then personally wade into the mud with sword and bow.\n\nWhat clicked for me\nLiberating villages feeds directly into your city-building loop: free a settlement, recruit townsfolk, assign jobs, and watch your outposts hum while you push the frontier. It’s satisfying how the macro (roads, logistics, tech tiers) feeds the micro (your loadout, your squad). The directional combat has weight; archery especially feels great, and taking on groups carelessly will punish you—so you learn to block, flank, command, and pick shots.\n\nThe builder side\nProgression is clear and rewarding—new buildings, better gear, more efficient production—and the map is big enough to keep that expansion itch going. Co-op is a natural fit: splitting roles between “mayor” and “marshal” makes the midgame sing.\n\nStill Early Access (and evolving fast)\nIt’s still in Early Access, so expect occasional bugs, balance swings, and systems that feel mid-construction. The bright side is active development and steady patching, with more content on the horizon.\n\nVerdict\nI love the hybrid here. Bellwright nails that loop where your settlement empowers your sword-arm—and your victories feed your settlement. If the KCD × Manor Lords pitch speaks to you and you’re fine with Early Access edges, this is absolutely worth your time right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As always with an early access game, there is always the issue of content being added. There doesn't seem to be any road map or schedule (as of 31 October 2025), I do enjoy it for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It took me four starts to get to a playable game, even with raids turned off and damage turned down. I  prefer to learn a new game's mechanics with damage factions turned off. I wish the developers would give us a playground setting with immortality for that purpose. I discovered that for me, the best plan was to research like mad and then individually equip new hires with decent gear and weapons. I also take an escort everywhere. I do think we should be able to donate old gear and weapons to a town for a few points of renown as a charity offering. This was, after all, the time in history when charities actually began. I like the way research and crafting work.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game needs few additions and it would be one of the great games out there:\n1- Mounts \"horses\" and mounted combat! It does not make any sense to run around all the map on foot. \nif the mounted combat is hard to implement at least you could have added horses as a transport!\n2- Mating-marriage system. It does not make sense that a person in the middle ages lives only to fight and all girls in the games are just statues, can only be villagers or companions! You can add romance, marriage, pregnancy system so that the hero can create a legacy!\n3- Better companions order system. Why can't you give an order to your companions to guard this village or that! why they can only be diployed for a short time? why can't you tell them to attack a certain bandits camp or brigands? \n4- End game sucks! Why you kill lord Ashbourne without a confrontation? Some players kill him by mistake! Why there is no dialogue with lord Ashbourne? I think there should be a communication channel between the player and lord of the lowlands! Maybe he tries to recreuit the player? Seduce the player? offer him money and power etc? Then the final confrontation could be a duel for example? \n5- Make more immersions for the queen! Why we only hear of her but never see her? Needs more real content with the queen.\n6- By adding a marriage and romance system in the game, we can see married companions, children in villages and player's settelment. I can't believe that i have seen absolutely no child in the whole game. children playing inside the villages and in player's settelment would not that make the villages more alive?\n7- Siege system. Village siege system and capturing villages. if you liberate one village, the brigands would try to siege it.\n8- Castles! for the player and for other villages!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The updates continue to flow and every playthrough is better and better, well done!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game, needs some work on story line matching up with progression a bit as there will be time waisted when you are being asked to craft or provide when its not unlocked yet.  Hope they can line that up a bit more.  Map in some areas is a bit off and NPC pathing can sometimes be problematic but easily corrected. None of these are to glaring that it would make me want to stop playing.  Only a few crash to desktop issues but not often and could be from a mod for storage not sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, beautiful environment, very enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels like the combination of a lot of ideas that manages to pull off that feeling of being a nothing to King/ nothing to Robin Hood feeling better than any other attempt at the concept. The town building is very satisfying and the worker and storage system all very well designed. It is polished, looks great, and runs well in coop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything Medieval Dynasty is missing and more! Thank sweet little baby jesus for mod support!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely one of my top 5 favorite games of all time. If you like Valheim this is better...Recruit your own vils and build your own village. Got 4 friends turned on and working on more. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "اللعبة جميله جدا اتمني اضافة عوالم زي مناطق في دول عربيه مثل عمان او السعوديه او الجزائر او مصر او سوريا او العراق اتمني ايضا اضافه حيوانات اكثر مثل الكلاب ك اليف يتبعك او يقاتل معك او الذئاب ايضا الخيول للتنقل او استأجار الخيول يوم او يومين",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bellwright: It's simple yet complex. Fun, yet tedious. The mechanics take some time to figure out. The best part is how rewarding seeing your village come to life. Looking forward to future updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once upon a time, The Sims, Skyrim, and Rimworld had a wild science baby that is Bellwright. There's so much content for early access.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "would be great if this game supported a game controller",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pls add sex, pls nerf shields : (\nfor the rest its a pretty funny game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really enjoy this game so far. played this game since day 1. but since the updates this year it has vastly improved.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Valheim and Palworld had a baby it would look like Bellwright.  Build a city recruit an army, get workers, build and empire!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 only issue is co-op is busted",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best survival game ive played in a long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for building a settlement",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Keep it up devs, this will be the best of the best just keep it going!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun just kinda confusing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good month spent well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game,  if you play with friends",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best game in this genre at the moment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game well done",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SOOOOOOOO much potential",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am loving it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "needs pvp 100%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Defense!Defense!Defense!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "How can Blumery be used",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i need a bow and arrow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Need more updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this ish",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yerrr",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Even though the concept is neat and the AI voice acting wasn't as bad as people say, this needs more time in the oven. \nYou'll enjoy it if you're very into the sandbox genre and have played every other title avaiable, if not you'll end up running around disappointed while regretting you bought it.\n\nGathering is tedious, story lacks soul, building is boring and combat is meh. Still, there's potential for growth and I wouldn't be surprised if it evolved to the point where I end up eating these words.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "I really don't know what game everyone else is playing but the game I played for 1.3 hours was utterly terrible.\n\nPlayed with the graphics for about an hour, game ran like my computer was from the 80s.\n\nEverything just felt unfinished and stale.\n\nRequested a refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a fine premise, but even in spite of lowering my expectations for its Early Access status, I was not hooked on anything. If anything, the pace of gathering was sluggish, and especially the state of combat seemed extremely lackluster at the start, with the quest to kill the 3 wolves. With no way to actually determine which of the four directions even block, or if blocking even negated damage or simply reduced it by some negligible amount with the beginner axe and wooden spear, I was quickly chunked down and had to actually just straight up dps race it, and lost. This could be genuine skill issue on my part, but there weren't really any memorable tutorials for combat.\r\n\r\nIf I could suggest a few things, it would be:\r\n1. Adding a separate button to enter a 'combat stance' of sorts. Trying to left click to build with an axe in hand is frustrating when you just swing randomly. At the same time, this could add depth to NPC interaction and reaction. Like maybe some traders would not immediately refuse you service for having a 'weapon in hand', but some might have differing prices based on an intimidation factor, at the cost of negatively impacting your social status or 'fame'; this idea might need a bit of workshopping, though, and could easily become scope creep. Simply focusing on a separate state of merely 'holding' a weapon/tool as opposed to intending to use said implement in combat is enough.\r\n2. Add fists as a 'weapon', since there will be a separate state for combat and non-combat.\r\n3. Add an interrupting segment to the first main quest when you enter the village to talk to the elder, where you find a drunk by the initial gate the player is intended to enter from (thus allowing them to walk around if they don't wish to deal with this), who insults the player and starts a confrontation, where combat (and directional attacking/blocking) can be more intuitively taught to the player.\r\n\r\nThe game wasn't aggressively unfun, and there's not too many good city/colony building games with emphasis on personal involvement/development that I could find, more of a RimWorld player myself, but there's really not a lot in this Early Access to keep playing for me personally.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Loads of great ideas ruined by awful mechanics and poor optimization. If it's 10$ pick it up if you have literally nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "AI voices, AI artwork, AI descriptions of items, terrible combat, plenty of janky EU5 bugs and mechanics with default EU5 animations, poor villager management, desync in multiplayer, slow development, and no \"character\" in any way whatsoever. Anybody can pump out some EU5, AI-supplemented slop now and make a ton of potential playtime out of it, but it'll all be of poor quality and depth.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game has multiple qualities, even unfinished as it is. \r\n\r\nIt's very slow, stam at first is very thin, the food that (insufficiently) helps with it spoils way too fast. All of this is easily fixable - but will they? As such it becomes tedious pretty fast, especially with all the (excessive) amount of running to and from the nearby village thats required to get anything.\r\n\r\nBut the nail in the coffin for me is the combat. I hate directional combat as a rule, but wanted to try this as it was presented as basically directional lite and had other things i wanted in a game. But its still this directional nonsense where, for \"realism\" i have to guess, your swing follows your mouse movement - which also commandes where you're looking at. If you want to make me control my arms as i swing my weapon, you better make my head independent from that movement - i dont want my character looking at his toes once his weapon is pointing down. so stupid.\r\n\r\nWell then, back to Valheim i guess.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Another early access title looking very average.\n\nit looks too early to get my money. if the Dev's actually keep up the work and make it an actual full game.. maybe.\n\nI'm done giving my money for just \"another survival game\" do better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Poor and unfair combat which is forced upon you. Slow game play. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "absolutely not, i love the idea, i love the theme, i love having NPC allies, but the execution is horrid, i feel lost even when i get quest pointers, i keep losing all my citizens every time a raid happens even when i save scum, and there's gameplay hints but not that actually explain how not to die a humilating death against overpowered thugs with clubs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you cant punch. the first quest to build a shelter lets you get attacked by wolves that never stop chasing you no matter how far you run. horrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most frustrating game I've ever played hands down. There is absolutely nothing that makes sense. No element no area no part of it exists that is not confusing and nonsensical in some way...sometimes minor sometimes major. These devs are total morons with no common sense whatsoever. They can code but they cannot design at all. Organization, categorization, consistency, common sense are obviously foreign concepts to them. I find it difficult to believe they have any computer science background or even grade school education at times. They clearly don't understand what basic words like duel mean. Combat sucks, weapons suck, movement sucks, villagers cant fight, UI is a GIANT tangled mess of fishing line with absolutely zero organization, helpers don't help you still have to do everything yourself to get anything done, armor doesn't protect you whatsoever it is useless to even craft it, there are 20 times more items than necessary most of them are useless the rest don't work right or sensibly anyway, broken items you can't use or repair, spoiled food that you can't eat, fifteen different items just for the exact same thing to have different colors instead of one item that you can choose the color of, insufficient inventory space to carry what you need to constantly getting overflowed when you loot or harvest forcing you to leave half the reward behind to despawn on the ground, merchants will not buy the things you craft they will only buy the raw materials you use to craft them or items you can't get (like pearls), graphics are mediocre but acceptable I suppose...looks five years old already, storage boxes have comically tiny capacity you gotta build hundreds of them to store your stuff, fast travel only works to send you where you don't want to go because you aren't allowed to place the damn destination anywhere near the towns thus you can only fast travel to spots two miles from where you want to be forcing you to slow travel half the way there, quality of life is not present...just the opposite, if A makes more sense than B, B happens guaranteed every single time. Example, fast travel that forces you to be half-slow. Does that make sense to anybody? UI again is awful. NPCs walk away in the middle of conversations when giving you quest objectives, you can be attacked during conversations forcing you to redo them, there is a \"codex\" that tells you only the most vital information such as \"raw meat can be cooked for food and is harvested from animals\". I don't think there is a single window in the game that isn't confusing and difficult to use or incomplete with half the information off in some other window you gotta navigate to through six menus and ten pop ups and a dozen overpopulated lists. Ten mouse clicks seven windows thirty lists of a hundred items to sift through then sixteen key presses to accomplish even the simplest actions, the lists are so massively long that it takes twenty minutes to scroll and sift through them every time you want to find anything, gotta do constant babysitting or else your storage will get filled with broken items you can't use or repair and spoiled food you cannot eat or use, every aspect of this game lacks continuity consistency and standardization, there's books you can't read to learn the skills you need, then there's the food OMG the amount of food you have to consume is baffling...amounts to a constant continuous relentless never ending headache, it is so hard to go anywhere you move like a snail, there is a sprint feature but you can never use it due to the massive stamina problem that is constant and continuously preventing you from going anywhere or playing the damn game. All you ever do is run across the map to talk to someone who sends you all the way back across the map to talk to another guy who sends you all the way across the map to another guy...the running around never ends and you have to do it while crawling because the stamina system is so profoundly punishing. It is a game that will not let you play it. It wants you to instead watch it run for hours while you sit there waiting for something without ever touching any controls. Days are way too short nights are way too long. I could go on ranting for another ten pages but I've wasted enough time on this pile.\n\nThe game is a horrible shit show. Worst I have ever seen by far nothing comes close. And I've been gaming since the 70s. Buying and playing it has ruined my retirement. I stopped playing three days ago and I'm still frustrated. All I did was ask why all the time. Why did that happen. Why didn't that happen. Why does this thing work this way while that thing works that way when they are the same thing for cryin' out loud. Always found myself asking WHY. Because it never made any sense. Its one and only redeeming feature is that it runs smoothly and never crashes. Probably because the engine wasn't written by these comically incompetent brain dead \"devs\". There are things that make me wonder if they have ever used a computer...like for example you choose a cancel operation and a window opens up that is completely unrelated to what you were doing and you have to close it. What software does that? Cancel means CLOSE all the windows not open up new ones that have nothing at all to do with what you were cancelling out of. It's nuts.\n\nAVOID AT ALL COSTS until this thing gets refined. It has tons and tons of work to be done before it is playable or even understandable. I don't see it being ready for several years maybe a decade. Seems like just a bunch of random ideas thrown together using dice rolls. A convoluted completely unorganized crap fest. Check back in 2030 on this one it sucks ass. Too bad it has enormous potential as a concept but I question whether these guys can get it done. They just don't seem very intelligent to me. If they are, they haven't showcased it here. If I had to sum up its implementation in one word, it would unquestionably be STUPID. If they gave me this for free I'd still ask for a refund and doing so would make more sense than what I suffered through \"playing\" it. Gotta give it a 0/10. Not fun, is unceasing uninterrupted agony.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "trying to place buildings on anything but 100% flat ground will make you rip out your hair",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Abandoned to mods",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to really rave about this game. \n\nBut in the current state... I can't.\n\nThere's a level of obtuseness in some of the design decisions.. some of which you can bypass with mods. \n\nThe good.\nThere's a real sense of progression. Each win feels meaningful. \n\nCrafting your own fast travel points - big win tbh..\n\nThe bad (much longer list)\nThe game is punishing. There's no way to know that you have limited yourself without failing... over and over. \nCamp placement is a massive thing. Place it wrong and you can't progress - your NPCs/townfolk can't move to the north side of the map, but you can. You can build out there too but there's no indicators this will be a problem until you've committed your resources. Just dumb design choices. \n\nTech tree - on the one hand, it feels like it fits. On the other, you can't research tech because your townsfolk/followers are meant to do this. This makes sense since some of the tech unlocks range upwards of 15-20 minutes, in real time. For a single player focused game, that design decision is DUMB. Make your follower/townsfolk mechanic actually work if you're going in this direction. \n\nThe follower/townsfolk tasking - non intuitive and unfriendly. Reddit is full of posts from players who had massive issues getting their townsfolk to gather/research/craft items.. even when you've met the resource requirements. It is poorly explained and the guidance sucks. \n\nThe fixed camera - there's no first person perspective on this and you can't scale out your FOV either. You are locked into looking over your avatar's shoulder the whole way. \n\nCombat is janky. That's fine. this is early access but it gets old fast. \n\nThe story line - main questline has potential - typical revenge/clear your name fare. Needs more polish - again.. Early Access.\n\nSide quests - the game is full of fetch quests/clear quests. There aren't any dungeons. \n\nThe inventory management is abysmal. There's no sort function. There's no weight mechanic. Instead items take up volume in your inventory. That's fine. What is a major gripe is that you can't optimise your inventory in any reasonable way. A log takes up 9 squares - sure, whatever. But the game doesn't let you organise your allotment of space (30 squares = 6 columns x 5 rows) to move things around. So you get instances where you should be able to fit 2 logs (18 squares) in the first 3 rows and have two empty rows to fit items. But if you already have items that you're carrying, the game will only fit one log and prevent you from making room for the second. Requiring mods to give you unlimited volume to get around this is DUMB. \n\nSome double handed items take up more volume that others which is also DUMB. (Shovel is 6 squares. A bow is 3.)\n\nBuilding - there's no fast disassemble option. Instead as your buildings go higher in tier, you have to dismantle, piece by piece. This becomes necessary because the game lets you build buildings that you can't enter once they're built because the terrain has a gentle slope. No crouch means you can't enter under the doorframe and your townsfolk don't break buildings down, they just build them. So it's on you to break it down or move it. At tier 1 - no problem. At tier 2 - it took 8 in game hours to move a Cabin..\n\nThe game has been out for a year now, they're still working on it (promising) but it still needs work. \n\nMy advice - wait for more content and a sale. Then mod it to make your life easier.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "This one is a weird one for me.\n\nFor every good thing it has, it has some design decision that's just... annoying. Or worse.\n\nFirst and foremost: the AI voices. Stop it. Get rid of them. The game would IMMEDIATELY sound better, and you would lose nothing.\n\nSecond: Setting priorities for your villagers is aight, feels like Rimworld. UNLIKE Rimworld, however, your villagers are the slowest goddamn snails I've ever seen. God forbid you dismiss an armed party anywhere beyond 100 meters from your town, you'll be waiting til the heat death of the universe before they finally get back home to work.\n\nThird: Building your buildings is pretty neat. Problem is as soon as you hit \"Village Hall\", it ain't worth it. It really really sucks. I get that it's supposed to feel like you're building every piece, but when you are actually 'building' every single piece it becomes tedious, boring. \"Oh you can have your villagers do it!\" Yeah, if I want to wait an unreasonable amount of time for it to be done. Let's not forget, they're SLOW. At EVERYTHING. It takes them over twice as long as it would take you to do it yourself, and that's with multiple villagers working at once.\n\nFourth: Seasons are a fun idea, given how impactful winter is for such an old society. Problem is you experience a full year in about 8 in-game days. Winter isn't anywhere near long enough to matter in any capacity. The other seasons aren't long enough to make it even feel like you're trying to prepare for winter. The seasons may as well not exist and the gameplay wouldn't change at all.\n\nFifth: The writing. Some of these quests feel like they were written by AI. And by 'some' I really mean 'most'. You could have the quests actually be engaging, we have the ability to command a small party of adventurers, and yet most quests are 'lol go make/fetch this for me' or similar. It's boring, it only takes away from actually doing something relatively engaging; growing my town.\n\nSixth: I mentioned that you can command a small group of adventurers, and it's true. Problem is they're still dumb as shit. They won't arm themselves if you take them along as companions, none of your villagers will equip armor that's better than their rags, you NEED to micromanage this nonsense. Not that it matters a whole lot, the pathfinding is a joke. If you have a small ankle-high wall somewhere, you can cheese any enemy.\n\nSeventh: Skill books. They exist. Couldn't tell you why they exist. \"They provide a buff to the chosen skill's experience!\" You know what else would do that? Getting a non-awful amount of experience for what you decide to do, or what your villagers do. The books are just another bit of micro that doesn't need to be there. It feels like the books were a band-aid solution to \"wow experience gains are low/slow\" when it would have been far more effective to just increase exp gains across the board. The 30+minute 'reading' time is also a joke, which defeats the purpose of even collecting the books.\n\nBasically, as I mentioned above, the devs had neat ideas, but for every neat idea they did something else that ruins the experience. Not much has changed since Early Access release either. All of my gripes existed on day one, and nothing has changed on either of these points in over a year. I'd stay away until you see some real progress. Watch some YouTube coverage of the game or something. Or go play Rimworld.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I write in early access:  \n\nI find the game to be incredibly frustrating, unclear, and most importantly, unfair to the player. \nThat said, I still do play it - it gets better after 12 to 18 hours, which isn't much of a selling point, in my opinion.\n\nWhat's good:  A large, beautiful map.  A sense of surviving.  A slow sense of growth and overcoming enemies.\n\nWhat's bad:  Frustratingly difficult start, where misplacement of your first home can cause hours of insta-death grief from baddies.  No clear understanding of the natural world.  Clearly trees sprout and animals return each spring, but how do I help that along?\n\nI got stuck in a loop where I misplaced my town, was getting hit by bandits, boars, and wolves.  I had an NPC to help me get weapons, but he was in constant time-out due to his eternal return of death by bandits, wolves, and boars.  I spent hours trying to save him.  Turned out, I was just in a bad spot - who knew?  \n\nThen we chopped down some trees.  They were kinda growing back.  There were some other tress to my north, but no one ever survived. I'd head there and get one-shot killed.  My pal would head up there and get one-shot killed.  Clearly, he became disgruntled.  I wanted to hire some beggars, but because I had been killed so many times, I had no clout with the town.  No one else would move in with me because I had so little clout.\n\nF-it.  Restart.  Same dang thing happened again.  Stuck in a loop of loss.\n\nF-it 3rd time.  Base in a better spot, fewer attacks, tweaked the game to give me buffs.  Still get killed over and over and over.  NPCs still on constant time-out.  I started to get some weapons and armor and did defeat a handful of small bandit troops, but they still keep coming it.\n\nThat said, once I could finally defeat the small bandit troops I felt great.  I had that Dark Souls high.  But, the same pattern happened again.  But that little Dark Souls high kept me going for a dozen hours. \n\nWould I recommend the game?  Not in its current state.  But there is a game in there.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Belwright is amazing but I can’t recommend it yet.\nLooks great, runs well (on a high-end PC), and the settler management/production systems are unique with fun little battles.\n\nThe downside: progression soon gets repetitive, and there’s been no meaningful update in a long time. This raises real concerns about whether it will evolve, especially with claims the devs have abandoned past projects.\n\nI really hope I’m wrong, but until there’s a clear roadmap or steady updates, I’d advise waiting before buying.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I expect I am probably going to refund this. I'm currently waiting for the dev to respond to my email asking how it is that upon buying this game, before ever interacting with this or any other product on any forum, I am \"banned for flaming\" on this game's forum. To be clear, I never had the ability to engage this forum or that of any other game by this dev, since this is the first game I've purchased from this dev....\n\nSo off the bat, I couldn't get through the main menu screen without the game crashing multiple times. The UI stopped recognizing where my mouse was, and I wasn't able to interact with anything on the interface through my mouse or keyboard at all. I force-closed and tried a couple more times, but in these attempts I was only able to get a ghost of feedback on a button when my mouse was nowhere near it. I went to post a bug report, and lo and behold it would appear this dev is pre-emptively banning its players from its forums \"for flaming\" -- something I worry indicates they have no intention of fixing up the game, and instead intend on silencing the forums about what's going on.\n\nBut they can't silence the reviews.\n\nIf they respond and give me an adequate explanation for this strange way they appear to be managing their forums, I'll change my review to reflect the truth of the matter. As it sits, I feel like I fell for a trap and got tricked out of my money by a shady dev....\n\nDon't buy this, not for the fact that it's a crashing mess, but for the fact it's a crashing mess in early access that the devs are actively preventing us  from talking about in the forum here, so we'd be foolish to expect it to deliver on the early-access hype.\n\n<Edit: So I checked the \"ban\"message again, and it says specifically that I was banned from the \"Bellwright Hub\" by a \"Bellwright developer\" and below that, for \"flaming\" even though I never could even access this \"Bellwright Hub\" before buying the game, and up until this point I was even excited about this game. They replaced my stoke with a probable refund.... I'm only waiting for the dev's response now because I emailed them, but they have less than 24 hours to get back to me because I want to make sure I don't get denied a refund for having this game for 48 hours or something stupid.>\n\nDO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Where is the content? Where are the fixes? One update a year? Ya it's like many predicted, just another game these devs make and then abandon.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Even though the concept is neat and the AI voice acting wasn't as bad as people say, this needs more time in the oven. \nYou'll enjoy it if you're very into the sandbox genre and have played every other title avaiable, if not you'll end up running around disappointed while regretting you bought it.\n\nGathering is tedious, story lacks soul, building is boring and combat is meh. Still, there's potential for growth and I wouldn't be surprised if it evolved to the point where I end up eating these words.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "It's a fine premise, but even in spite of lowering my expectations for its Early Access status, I was not hooked on anything. If anything, the pace of gathering was sluggish, and especially the state of combat seemed extremely lackluster at the start, with the quest to kill the 3 wolves. With no way to actually determine which of the four directions even block, or if blocking even negated damage or simply reduced it by some negligible amount with the beginner axe and wooden spear, I was quickly chunked down and had to actually just straight up dps race it, and lost. This could be genuine skill issue on my part, but there weren't really any memorable tutorials for combat.\r\n\r\nIf I could suggest a few things, it would be:\r\n1. Adding a separate button to enter a 'combat stance' of sorts. Trying to left click to build with an axe in hand is frustrating when you just swing randomly. At the same time, this could add depth to NPC interaction and reaction. Like maybe some traders would not immediately refuse you service for having a 'weapon in hand', but some might have differing prices based on an intimidation factor, at the cost of negatively impacting your social status or 'fame'; this idea might need a bit of workshopping, though, and could easily become scope creep. Simply focusing on a separate state of merely 'holding' a weapon/tool as opposed to intending to use said implement in combat is enough.\r\n2. Add fists as a 'weapon', since there will be a separate state for combat and non-combat.\r\n3. Add an interrupting segment to the first main quest when you enter the village to talk to the elder, where you find a drunk by the initial gate the player is intended to enter from (thus allowing them to walk around if they don't wish to deal with this), who insults the player and starts a confrontation, where combat (and directional attacking/blocking) can be more intuitively taught to the player.\r\n\r\nThe game wasn't aggressively unfun, and there's not too many good city/colony building games with emphasis on personal involvement/development that I could find, more of a RimWorld player myself, but there's really not a lot in this Early Access to keep playing for me personally.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Loads of great ideas ruined by awful mechanics and poor optimization. If it's 10$ pick it up if you have literally nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really don't know what game everyone else is playing but the game I played for 1.3 hours was utterly terrible.\n\nPlayed with the graphics for about an hour, game ran like my computer was from the 80s.\n\nEverything just felt unfinished and stale.\n\nRequested a refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too grindy and rebellion party and tax stuff is just not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI voices, AI artwork, AI descriptions of items, terrible combat, plenty of janky EU5 bugs and mechanics with default EU5 animations, poor villager management, desync in multiplayer, slow development, and no \"character\" in any way whatsoever. Anybody can pump out some EU5, AI-supplemented slop now and make a ton of potential playtime out of it, but it'll all be of poor quality and depth.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Poor and unfair combat which is forced upon you. Slow game play. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can only create white characters.  I know that's a world some of you would love to live in. But ...NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Barely played because I couldn't stand listening to the extremely robotic AI voicelines and how generic survival game it was. Doesn't really offer anything over any of the other generic medieval survival games it is a clone of. Not a terrible game for what it is, just definitely not for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "absolutely not, i love the idea, i love the theme, i love having NPC allies, but the execution is horrid, i feel lost even when i get quest pointers, i keep losing all my citizens every time a raid happens even when i save scum, and there's gameplay hints but not that actually explain how not to die a humilating death against overpowered thugs with clubs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you cant punch. the first quest to build a shelter lets you get attacked by wolves that never stop chasing you no matter how far you run. horrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another early access title looking very average.\n\nit looks too early to get my money. if the Dev's actually keep up the work and make it an actual full game.. maybe.\n\nI'm done giving my money for just \"another survival game\" do better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most frustrating game I've ever played hands down. There is absolutely nothing that makes sense. No element no area no part of it exists that is not confusing and nonsensical in some way...sometimes minor sometimes major. These devs are total morons with no common sense whatsoever. They can code but they cannot design at all. Organization, categorization, consistency, common sense are obviously foreign concepts to them. I find it difficult to believe they have any computer science background or even grade school education at times. They clearly don't understand what basic words like duel mean. Combat sucks, weapons suck, movement sucks, villagers cant fight, UI is a GIANT tangled mess of fishing line with absolutely zero organization, helpers don't help you still have to do everything yourself to get anything done, armor doesn't protect you whatsoever it is useless to even craft it, there are 20 times more items than necessary most of them are useless the rest don't work right or sensibly anyway, broken items you can't use or repair, spoiled food that you can't eat, fifteen different items just for the exact same thing to have different colors instead of one item that you can choose the color of, insufficient inventory space to carry what you need to constantly getting overflowed when you loot or harvest forcing you to leave half the reward behind to despawn on the ground, merchants will not buy the things you craft they will only buy the raw materials you use to craft them or items you can't get (like pearls), graphics are mediocre but acceptable I suppose...looks five years old already, storage boxes have comically tiny capacity you gotta build hundreds of them to store your stuff, fast travel only works to send you where you don't want to go because you aren't allowed to place the damn destination anywhere near the towns thus you can only fast travel to spots two miles from where you want to be forcing you to slow travel half the way there, quality of life is not present...just the opposite, if A makes more sense than B, B happens guaranteed every single time. Example, fast travel that forces you to be half-slow. Does that make sense to anybody? UI again is awful. NPCs walk away in the middle of conversations when giving you quest objectives, you can be attacked during conversations forcing you to redo them, there is a \"codex\" that tells you only the most vital information such as \"raw meat can be cooked for food and is harvested from animals\". I don't think there is a single window in the game that isn't confusing and difficult to use or incomplete with half the information off in some other window you gotta navigate to through six menus and ten pop ups and a dozen overpopulated lists. Ten mouse clicks seven windows thirty lists of a hundred items to sift through then sixteen key presses to accomplish even the simplest actions, the lists are so massively long that it takes twenty minutes to scroll and sift through them every time you want to find anything, gotta do constant babysitting or else your storage will get filled with broken items you can't use or repair and spoiled food you cannot eat or use, every aspect of this game lacks continuity consistency and standardization, there's books you can't read to learn the skills you need, then there's the food OMG the amount of food you have to consume is baffling...amounts to a constant continuous relentless never ending headache, it is so hard to go anywhere you move like a snail, there is a sprint feature but you can never use it due to the massive stamina problem that is constant and continuously preventing you from going anywhere or playing the damn game. All you ever do is run across the map to talk to someone who sends you all the way back across the map to talk to another guy who sends you all the way across the map to another guy...the running around never ends and you have to do it while crawling because the stamina system is so profoundly punishing. It is a game that will not let you play it. It wants you to instead watch it run for hours while you sit there waiting for something without ever touching any controls. Days are way too short nights are way too long. I could go on ranting for another ten pages but I've wasted enough time on this pile.\n\nThe game is a horrible shit show. Worst I have ever seen by far nothing comes close. And I've been gaming since the 70s. Buying and playing it has ruined my retirement. I stopped playing three days ago and I'm still frustrated. All I did was ask why all the time. Why did that happen. Why didn't that happen. Why does this thing work this way while that thing works that way when they are the same thing for cryin' out loud. Always found myself asking WHY. Because it never made any sense. Its one and only redeeming feature is that it runs smoothly and never crashes. Probably because the engine wasn't written by these comically incompetent brain dead \"devs\". There are things that make me wonder if they have ever used a computer...like for example you choose a cancel operation and a window opens up that is completely unrelated to what you were doing and you have to close it. What software does that? Cancel means CLOSE all the windows not open up new ones that have nothing at all to do with what you were cancelling out of. It's nuts.\n\nAVOID AT ALL COSTS until this thing gets refined. It has tons and tons of work to be done before it is playable or even understandable. I don't see it being ready for several years maybe a decade. Seems like just a bunch of random ideas thrown together using dice rolls. A convoluted completely unorganized crap fest. Check back in 2030 on this one it sucks ass. Too bad it has enormous potential as a concept but I question whether these guys can get it done. They just don't seem very intelligent to me. If they are, they haven't showcased it here. If I had to sum up its implementation in one word, it would unquestionably be STUPID. If they gave me this for free I'd still ask for a refund and doing so would make more sense than what I suffered through \"playing\" it. Gotta give it a 0/10. Not fun, is unceasing uninterrupted agony.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "SHIT ASS FUCKING GAME IS SO BAD THERE AINT SHIT FOR CONTENT IN THIS PIECE OF SHIT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not yet on this one. \n\nI was worried when I saw only 2 hair styles during character creation but played it off since the other features sounded cool. Even more worried when the inventory system treated each individual berry I picked up the same as rocks, sticks, pelts, books, cooked meals i.e. each one takes up one of your inventory slots and cannot be stacked (unless you drop it on the floor, which you will because you always have no inventory space and no stamina).\n\nEating random stuff you find on the ground will give you more stamina, which means you will run 2 seconds longer and wait even longer for it to come back. I drained a full stamina bar, turned around and still saw the whites of my friends eyes back at base.\n\nI wont get into the combat much more than the introduction to it feels rough. \n(1) Took no damage while running in circles on bandits but attempting the actual combat punished pretty hard. \n(2) Left click and mouse movement didn't always seem to register the movements the way it felt it should and was headache inducing with all the camera shifting. \n\nCan see why someone might get into it though as an easy to learn difficult to master experience maybe. At least archers couldn't hit me for 5 minutes straight while I stood stationary on top a lit bonfire.\n\nBottom line, the game didn't feel like it was inviting me to play it. It was punishing me for starting and not being in the end game already.\n\nI'm thankful it was able to tell me I shouldn't be here before I hit the 2 hour mark.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Abandoned to mods",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to really rave about this game. \n\nBut in the current state... I can't.\n\nThere's a level of obtuseness in some of the design decisions.. some of which you can bypass with mods. \n\nThe good.\nThere's a real sense of progression. Each win feels meaningful. \n\nCrafting your own fast travel points - big win tbh..\n\nThe bad (much longer list)\nThe game is punishing. There's no way to know that you have limited yourself without failing... over and over. \nCamp placement is a massive thing. Place it wrong and you can't progress - your NPCs/townfolk can't move to the north side of the map, but you can. You can build out there too but there's no indicators this will be a problem until you've committed your resources. Just dumb design choices. \n\nTech tree - on the one hand, it feels like it fits. On the other, you can't research tech because your townsfolk/followers are meant to do this. This makes sense since some of the tech unlocks range upwards of 15-20 minutes, in real time. For a single player focused game, that design decision is DUMB. Make your follower/townsfolk mechanic actually work if you're going in this direction. \n\nThe follower/townsfolk tasking - non intuitive and unfriendly. Reddit is full of posts from players who had massive issues getting their townsfolk to gather/research/craft items.. even when you've met the resource requirements. It is poorly explained and the guidance sucks. \n\nThe fixed camera - there's no first person perspective on this and you can't scale out your FOV either. You are locked into looking over your avatar's shoulder the whole way. \n\nCombat is janky. That's fine. this is early access but it gets old fast. \n\nThe story line - main questline has potential - typical revenge/clear your name fare. Needs more polish - again.. Early Access.\n\nSide quests - the game is full of fetch quests/clear quests. There aren't any dungeons. \n\nThe inventory management is abysmal. There's no sort function. There's no weight mechanic. Instead items take up volume in your inventory. That's fine. What is a major gripe is that you can't optimise your inventory in any reasonable way. A log takes up 9 squares - sure, whatever. But the game doesn't let you organise your allotment of space (30 squares = 6 columns x 5 rows) to move things around. So you get instances where you should be able to fit 2 logs (18 squares) in the first 3 rows and have two empty rows to fit items. But if you already have items that you're carrying, the game will only fit one log and prevent you from making room for the second. Requiring mods to give you unlimited volume to get around this is DUMB. \n\nSome double handed items take up more volume that others which is also DUMB. (Shovel is 6 squares. A bow is 3.)\n\nBuilding - there's no fast disassemble option. Instead as your buildings go higher in tier, you have to dismantle, piece by piece. This becomes necessary because the game lets you build buildings that you can't enter once they're built because the terrain has a gentle slope. No crouch means you can't enter under the doorframe and your townsfolk don't break buildings down, they just build them. So it's on you to break it down or move it. At tier 1 - no problem. At tier 2 - it took 8 in game hours to move a Cabin..\n\nThe game has been out for a year now, they're still working on it (promising) but it still needs work. \n\nMy advice - wait for more content and a sale. Then mod it to make your life easier.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "This one is a weird one for me.\n\nFor every good thing it has, it has some design decision that's just... annoying. Or worse.\n\nFirst and foremost: the AI voices. Stop it. Get rid of them. The game would IMMEDIATELY sound better, and you would lose nothing.\n\nSecond: Setting priorities for your villagers is aight, feels like Rimworld. UNLIKE Rimworld, however, your villagers are the slowest goddamn snails I've ever seen. God forbid you dismiss an armed party anywhere beyond 100 meters from your town, you'll be waiting til the heat death of the universe before they finally get back home to work.\n\nThird: Building your buildings is pretty neat. Problem is as soon as you hit \"Village Hall\", it ain't worth it. It really really sucks. I get that it's supposed to feel like you're building every piece, but when you are actually 'building' every single piece it becomes tedious, boring. \"Oh you can have your villagers do it!\" Yeah, if I want to wait an unreasonable amount of time for it to be done. Let's not forget, they're SLOW. At EVERYTHING. It takes them over twice as long as it would take you to do it yourself, and that's with multiple villagers working at once.\n\nFourth: Seasons are a fun idea, given how impactful winter is for such an old society. Problem is you experience a full year in about 8 in-game days. Winter isn't anywhere near long enough to matter in any capacity. The other seasons aren't long enough to make it even feel like you're trying to prepare for winter. The seasons may as well not exist and the gameplay wouldn't change at all.\n\nFifth: The writing. Some of these quests feel like they were written by AI. And by 'some' I really mean 'most'. You could have the quests actually be engaging, we have the ability to command a small party of adventurers, and yet most quests are 'lol go make/fetch this for me' or similar. It's boring, it only takes away from actually doing something relatively engaging; growing my town.\n\nSixth: I mentioned that you can command a small group of adventurers, and it's true. Problem is they're still dumb as shit. They won't arm themselves if you take them along as companions, none of your villagers will equip armor that's better than their rags, you NEED to micromanage this nonsense. Not that it matters a whole lot, the pathfinding is a joke. If you have a small ankle-high wall somewhere, you can cheese any enemy.\n\nSeventh: Skill books. They exist. Couldn't tell you why they exist. \"They provide a buff to the chosen skill's experience!\" You know what else would do that? Getting a non-awful amount of experience for what you decide to do, or what your villagers do. The books are just another bit of micro that doesn't need to be there. It feels like the books were a band-aid solution to \"wow experience gains are low/slow\" when it would have been far more effective to just increase exp gains across the board. The 30+minute 'reading' time is also a joke, which defeats the purpose of even collecting the books.\n\nBasically, as I mentioned above, the devs had neat ideas, but for every neat idea they did something else that ruins the experience. Not much has changed since Early Access release either. All of my gripes existed on day one, and nothing has changed on either of these points in over a year. I'd stay away until you see some real progress. Watch some YouTube coverage of the game or something. Or go play Rimworld.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I write in early access:  \n\nI find the game to be incredibly frustrating, unclear, and most importantly, unfair to the player. \nThat said, I still do play it - it gets better after 12 to 18 hours, which isn't much of a selling point, in my opinion.\n\nWhat's good:  A large, beautiful map.  A sense of surviving.  A slow sense of growth and overcoming enemies.\n\nWhat's bad:  Frustratingly difficult start, where misplacement of your first home can cause hours of insta-death grief from baddies.  No clear understanding of the natural world.  Clearly trees sprout and animals return each spring, but how do I help that along?\n\nI got stuck in a loop where I misplaced my town, was getting hit by bandits, boars, and wolves.  I had an NPC to help me get weapons, but he was in constant time-out due to his eternal return of death by bandits, wolves, and boars.  I spent hours trying to save him.  Turned out, I was just in a bad spot - who knew?  \n\nThen we chopped down some trees.  They were kinda growing back.  There were some other tress to my north, but no one ever survived. I'd head there and get one-shot killed.  My pal would head up there and get one-shot killed.  Clearly, he became disgruntled.  I wanted to hire some beggars, but because I had been killed so many times, I had no clout with the town.  No one else would move in with me because I had so little clout.\n\nF-it.  Restart.  Same dang thing happened again.  Stuck in a loop of loss.\n\nF-it 3rd time.  Base in a better spot, fewer attacks, tweaked the game to give me buffs.  Still get killed over and over and over.  NPCs still on constant time-out.  I started to get some weapons and armor and did defeat a handful of small bandit troops, but they still keep coming it.\n\nThat said, once I could finally defeat the small bandit troops I felt great.  I had that Dark Souls high.  But, the same pattern happened again.  But that little Dark Souls high kept me going for a dozen hours. \n\nWould I recommend the game?  Not in its current state.  But there is a game in there.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Belwright is amazing but I can’t recommend it yet.\nLooks great, runs well (on a high-end PC), and the settler management/production systems are unique with fun little battles.\n\nThe downside: progression soon gets repetitive, and there’s been no meaningful update in a long time. This raises real concerns about whether it will evolve, especially with claims the devs have abandoned past projects.\n\nI really hope I’m wrong, but until there’s a clear roadmap or steady updates, I’d advise waiting before buying.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I expect I am probably going to refund this. I'm currently waiting for the dev to respond to my email asking how it is that upon buying this game, before ever interacting with this or any other product on any forum, I am \"banned for flaming\" on this game's forum. To be clear, I never had the ability to engage this forum or that of any other game by this dev, since this is the first game I've purchased from this dev....\n\nSo off the bat, I couldn't get through the main menu screen without the game crashing multiple times. The UI stopped recognizing where my mouse was, and I wasn't able to interact with anything on the interface through my mouse or keyboard at all. I force-closed and tried a couple more times, but in these attempts I was only able to get a ghost of feedback on a button when my mouse was nowhere near it. I went to post a bug report, and lo and behold it would appear this dev is pre-emptively banning its players from its forums \"for flaming\" -- something I worry indicates they have no intention of fixing up the game, and instead intend on silencing the forums about what's going on.\n\nBut they can't silence the reviews.\n\nIf they respond and give me an adequate explanation for this strange way they appear to be managing their forums, I'll change my review to reflect the truth of the matter. As it sits, I feel like I fell for a trap and got tricked out of my money by a shady dev....\n\nDon't buy this, not for the fact that it's a crashing mess, but for the fact it's a crashing mess in early access that the devs are actively preventing us  from talking about in the forum here, so we'd be foolish to expect it to deliver on the early-access hype.\n\n<Edit: So I checked the \"ban\"message again, and it says specifically that I was banned from the \"Bellwright Hub\" by a \"Bellwright developer\" and below that, for \"flaming\" even though I never could even access this \"Bellwright Hub\" before buying the game, and up until this point I was even excited about this game. They replaced my stoke with a probable refund.... I'm only waiting for the dev's response now because I emailed them, but they have less than 24 hours to get back to me because I want to make sure I don't get denied a refund for having this game for 48 hours or something stupid.>\n\nDO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Where is the content? Where are the fixes? One update a year? Ya it's like many predicted, just another game these devs make and then abandon.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Even though the concept is neat and the AI voice acting wasn't as bad as people say, this needs more time in the oven. \nYou'll enjoy it if you're very into the sandbox genre and have played every other title avaiable, if not you'll end up running around disappointed while regretting you bought it.\n\nGathering is tedious, story lacks soul, building is boring and combat is meh. Still, there's potential for growth and I wouldn't be surprised if it evolved to the point where I end up eating these words.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "It's a fine premise, but even in spite of lowering my expectations for its Early Access status, I was not hooked on anything. If anything, the pace of gathering was sluggish, and especially the state of combat seemed extremely lackluster at the start, with the quest to kill the 3 wolves. With no way to actually determine which of the four directions even block, or if blocking even negated damage or simply reduced it by some negligible amount with the beginner axe and wooden spear, I was quickly chunked down and had to actually just straight up dps race it, and lost. This could be genuine skill issue on my part, but there weren't really any memorable tutorials for combat.\r\n\r\nIf I could suggest a few things, it would be:\r\n1. Adding a separate button to enter a 'combat stance' of sorts. Trying to left click to build with an axe in hand is frustrating when you just swing randomly. At the same time, this could add depth to NPC interaction and reaction. Like maybe some traders would not immediately refuse you service for having a 'weapon in hand', but some might have differing prices based on an intimidation factor, at the cost of negatively impacting your social status or 'fame'; this idea might need a bit of workshopping, though, and could easily become scope creep. Simply focusing on a separate state of merely 'holding' a weapon/tool as opposed to intending to use said implement in combat is enough.\r\n2. Add fists as a 'weapon', since there will be a separate state for combat and non-combat.\r\n3. Add an interrupting segment to the first main quest when you enter the village to talk to the elder, where you find a drunk by the initial gate the player is intended to enter from (thus allowing them to walk around if they don't wish to deal with this), who insults the player and starts a confrontation, where combat (and directional attacking/blocking) can be more intuitively taught to the player.\r\n\r\nThe game wasn't aggressively unfun, and there's not too many good city/colony building games with emphasis on personal involvement/development that I could find, more of a RimWorld player myself, but there's really not a lot in this Early Access to keep playing for me personally.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Loads of great ideas ruined by awful mechanics and poor optimization. If it's 10$ pick it up if you have literally nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really don't know what game everyone else is playing but the game I played for 1.3 hours was utterly terrible.\n\nPlayed with the graphics for about an hour, game ran like my computer was from the 80s.\n\nEverything just felt unfinished and stale.\n\nRequested a refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too grindy and rebellion party and tax stuff is just not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI voices, AI artwork, AI descriptions of items, terrible combat, plenty of janky EU5 bugs and mechanics with default EU5 animations, poor villager management, desync in multiplayer, slow development, and no \"character\" in any way whatsoever. Anybody can pump out some EU5, AI-supplemented slop now and make a ton of potential playtime out of it, but it'll all be of poor quality and depth.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Poor and unfair combat which is forced upon you. Slow game play. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can only create white characters.  I know that's a world some of you would love to live in. But ...NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Barely played because I couldn't stand listening to the extremely robotic AI voicelines and how generic survival game it was. Doesn't really offer anything over any of the other generic medieval survival games it is a clone of. Not a terrible game for what it is, just definitely not for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "absolutely not, i love the idea, i love the theme, i love having NPC allies, but the execution is horrid, i feel lost even when i get quest pointers, i keep losing all my citizens every time a raid happens even when i save scum, and there's gameplay hints but not that actually explain how not to die a humilating death against overpowered thugs with clubs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you cant punch. the first quest to build a shelter lets you get attacked by wolves that never stop chasing you no matter how far you run. horrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another early access title looking very average.\n\nit looks too early to get my money. if the Dev's actually keep up the work and make it an actual full game.. maybe.\n\nI'm done giving my money for just \"another survival game\" do better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most frustrating game I've ever played hands down. There is absolutely nothing that makes sense. No element no area no part of it exists that is not confusing and nonsensical in some way...sometimes minor sometimes major. These devs are total morons with no common sense whatsoever. They can code but they cannot design at all. Organization, categorization, consistency, common sense are obviously foreign concepts to them. I find it difficult to believe they have any computer science background or even grade school education at times. They clearly don't understand what basic words like duel mean. Combat sucks, weapons suck, movement sucks, villagers cant fight, UI is a GIANT tangled mess of fishing line with absolutely zero organization, helpers don't help you still have to do everything yourself to get anything done, armor doesn't protect you whatsoever it is useless to even craft it, there are 20 times more items than necessary most of them are useless the rest don't work right or sensibly anyway, broken items you can't use or repair, spoiled food that you can't eat, fifteen different items just for the exact same thing to have different colors instead of one item that you can choose the color of, insufficient inventory space to carry what you need to constantly getting overflowed when you loot or harvest forcing you to leave half the reward behind to despawn on the ground, merchants will not buy the things you craft they will only buy the raw materials you use to craft them or items you can't get (like pearls), graphics are mediocre but acceptable I suppose...looks five years old already, storage boxes have comically tiny capacity you gotta build hundreds of them to store your stuff, fast travel only works to send you where you don't want to go because you aren't allowed to place the damn destination anywhere near the towns thus you can only fast travel to spots two miles from where you want to be forcing you to slow travel half the way there, quality of life is not present...just the opposite, if A makes more sense than B, B happens guaranteed every single time. Example, fast travel that forces you to be half-slow. Does that make sense to anybody? UI again is awful. NPCs walk away in the middle of conversations when giving you quest objectives, you can be attacked during conversations forcing you to redo them, there is a \"codex\" that tells you only the most vital information such as \"raw meat can be cooked for food and is harvested from animals\". I don't think there is a single window in the game that isn't confusing and difficult to use or incomplete with half the information off in some other window you gotta navigate to through six menus and ten pop ups and a dozen overpopulated lists. Ten mouse clicks seven windows thirty lists of a hundred items to sift through then sixteen key presses to accomplish even the simplest actions, the lists are so massively long that it takes twenty minutes to scroll and sift through them every time you want to find anything, gotta do constant babysitting or else your storage will get filled with broken items you can't use or repair and spoiled food you cannot eat or use, every aspect of this game lacks continuity consistency and standardization, there's books you can't read to learn the skills you need, then there's the food OMG the amount of food you have to consume is baffling...amounts to a constant continuous relentless never ending headache, it is so hard to go anywhere you move like a snail, there is a sprint feature but you can never use it due to the massive stamina problem that is constant and continuously preventing you from going anywhere or playing the damn game. All you ever do is run across the map to talk to someone who sends you all the way back across the map to talk to another guy who sends you all the way across the map to another guy...the running around never ends and you have to do it while crawling because the stamina system is so profoundly punishing. It is a game that will not let you play it. It wants you to instead watch it run for hours while you sit there waiting for something without ever touching any controls. Days are way too short nights are way too long. I could go on ranting for another ten pages but I've wasted enough time on this pile.\n\nThe game is a horrible shit show. Worst I have ever seen by far nothing comes close. And I've been gaming since the 70s. Buying and playing it has ruined my retirement. I stopped playing three days ago and I'm still frustrated. All I did was ask why all the time. Why did that happen. Why didn't that happen. Why does this thing work this way while that thing works that way when they are the same thing for cryin' out loud. Always found myself asking WHY. Because it never made any sense. Its one and only redeeming feature is that it runs smoothly and never crashes. Probably because the engine wasn't written by these comically incompetent brain dead \"devs\". There are things that make me wonder if they have ever used a computer...like for example you choose a cancel operation and a window opens up that is completely unrelated to what you were doing and you have to close it. What software does that? Cancel means CLOSE all the windows not open up new ones that have nothing at all to do with what you were cancelling out of. It's nuts.\n\nAVOID AT ALL COSTS until this thing gets refined. It has tons and tons of work to be done before it is playable or even understandable. I don't see it being ready for several years maybe a decade. Seems like just a bunch of random ideas thrown together using dice rolls. A convoluted completely unorganized crap fest. Check back in 2030 on this one it sucks ass. Too bad it has enormous potential as a concept but I question whether these guys can get it done. They just don't seem very intelligent to me. If they are, they haven't showcased it here. If I had to sum up its implementation in one word, it would unquestionably be STUPID. If they gave me this for free I'd still ask for a refund and doing so would make more sense than what I suffered through \"playing\" it. Gotta give it a 0/10. Not fun, is unceasing uninterrupted agony.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "SHIT ASS FUCKING GAME IS SO BAD THERE AINT SHIT FOR CONTENT IN THIS PIECE OF SHIT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not yet on this one. \n\nI was worried when I saw only 2 hair styles during character creation but played it off since the other features sounded cool. Even more worried when the inventory system treated each individual berry I picked up the same as rocks, sticks, pelts, books, cooked meals i.e. each one takes up one of your inventory slots and cannot be stacked (unless you drop it on the floor, which you will because you always have no inventory space and no stamina).\n\nEating random stuff you find on the ground will give you more stamina, which means you will run 2 seconds longer and wait even longer for it to come back. I drained a full stamina bar, turned around and still saw the whites of my friends eyes back at base.\n\nI wont get into the combat much more than the introduction to it feels rough. \n(1) Took no damage while running in circles on bandits but attempting the actual combat punished pretty hard. \n(2) Left click and mouse movement didn't always seem to register the movements the way it felt it should and was headache inducing with all the camera shifting. \n\nCan see why someone might get into it though as an easy to learn difficult to master experience maybe. At least archers couldn't hit me for 5 minutes straight while I stood stationary on top a lit bonfire.\n\nBottom line, the game didn't feel like it was inviting me to play it. It was punishing me for starting and not being in the end game already.\n\nI'm thankful it was able to tell me I shouldn't be here before I hit the 2 hour mark.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Abandoned to mods",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to really rave about this game. \n\nBut in the current state... I can't.\n\nThere's a level of obtuseness in some of the design decisions.. some of which you can bypass with mods. \n\nThe good.\nThere's a real sense of progression. Each win feels meaningful. \n\nCrafting your own fast travel points - big win tbh..\n\nThe bad (much longer list)\nThe game is punishing. There's no way to know that you have limited yourself without failing... over and over. \nCamp placement is a massive thing. Place it wrong and you can't progress - your NPCs/townfolk can't move to the north side of the map, but you can. You can build out there too but there's no indicators this will be a problem until you've committed your resources. Just dumb design choices. \n\nTech tree - on the one hand, it feels like it fits. On the other, you can't research tech because your townsfolk/followers are meant to do this. This makes sense since some of the tech unlocks range upwards of 15-20 minutes, in real time. For a single player focused game, that design decision is DUMB. Make your follower/townsfolk mechanic actually work if you're going in this direction. \n\nThe follower/townsfolk tasking - non intuitive and unfriendly. Reddit is full of posts from players who had massive issues getting their townsfolk to gather/research/craft items.. even when you've met the resource requirements. It is poorly explained and the guidance sucks. \n\nThe fixed camera - there's no first person perspective on this and you can't scale out your FOV either. You are locked into looking over your avatar's shoulder the whole way. \n\nCombat is janky. That's fine. this is early access but it gets old fast. \n\nThe story line - main questline has potential - typical revenge/clear your name fare. Needs more polish - again.. Early Access.\n\nSide quests - the game is full of fetch quests/clear quests. There aren't any dungeons. \n\nThe inventory management is abysmal. There's no sort function. There's no weight mechanic. Instead items take up volume in your inventory. That's fine. What is a major gripe is that you can't optimise your inventory in any reasonable way. A log takes up 9 squares - sure, whatever. But the game doesn't let you organise your allotment of space (30 squares = 6 columns x 5 rows) to move things around. So you get instances where you should be able to fit 2 logs (18 squares) in the first 3 rows and have two empty rows to fit items. But if you already have items that you're carrying, the game will only fit one log and prevent you from making room for the second. Requiring mods to give you unlimited volume to get around this is DUMB. \n\nSome double handed items take up more volume that others which is also DUMB. (Shovel is 6 squares. A bow is 3.)\n\nBuilding - there's no fast disassemble option. Instead as your buildings go higher in tier, you have to dismantle, piece by piece. This becomes necessary because the game lets you build buildings that you can't enter once they're built because the terrain has a gentle slope. No crouch means you can't enter under the doorframe and your townsfolk don't break buildings down, they just build them. So it's on you to break it down or move it. At tier 1 - no problem. At tier 2 - it took 8 in game hours to move a Cabin..\n\nThe game has been out for a year now, they're still working on it (promising) but it still needs work. \n\nMy advice - wait for more content and a sale. Then mod it to make your life easier.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "This one is a weird one for me.\n\nFor every good thing it has, it has some design decision that's just... annoying. Or worse.\n\nFirst and foremost: the AI voices. Stop it. Get rid of them. The game would IMMEDIATELY sound better, and you would lose nothing.\n\nSecond: Setting priorities for your villagers is aight, feels like Rimworld. UNLIKE Rimworld, however, your villagers are the slowest goddamn snails I've ever seen. God forbid you dismiss an armed party anywhere beyond 100 meters from your town, you'll be waiting til the heat death of the universe before they finally get back home to work.\n\nThird: Building your buildings is pretty neat. Problem is as soon as you hit \"Village Hall\", it ain't worth it. It really really sucks. I get that it's supposed to feel like you're building every piece, but when you are actually 'building' every single piece it becomes tedious, boring. \"Oh you can have your villagers do it!\" Yeah, if I want to wait an unreasonable amount of time for it to be done. Let's not forget, they're SLOW. At EVERYTHING. It takes them over twice as long as it would take you to do it yourself, and that's with multiple villagers working at once.\n\nFourth: Seasons are a fun idea, given how impactful winter is for such an old society. Problem is you experience a full year in about 8 in-game days. Winter isn't anywhere near long enough to matter in any capacity. The other seasons aren't long enough to make it even feel like you're trying to prepare for winter. The seasons may as well not exist and the gameplay wouldn't change at all.\n\nFifth: The writing. Some of these quests feel like they were written by AI. And by 'some' I really mean 'most'. You could have the quests actually be engaging, we have the ability to command a small party of adventurers, and yet most quests are 'lol go make/fetch this for me' or similar. It's boring, it only takes away from actually doing something relatively engaging; growing my town.\n\nSixth: I mentioned that you can command a small group of adventurers, and it's true. Problem is they're still dumb as shit. They won't arm themselves if you take them along as companions, none of your villagers will equip armor that's better than their rags, you NEED to micromanage this nonsense. Not that it matters a whole lot, the pathfinding is a joke. If you have a small ankle-high wall somewhere, you can cheese any enemy.\n\nSeventh: Skill books. They exist. Couldn't tell you why they exist. \"They provide a buff to the chosen skill's experience!\" You know what else would do that? Getting a non-awful amount of experience for what you decide to do, or what your villagers do. The books are just another bit of micro that doesn't need to be there. It feels like the books were a band-aid solution to \"wow experience gains are low/slow\" when it would have been far more effective to just increase exp gains across the board. The 30+minute 'reading' time is also a joke, which defeats the purpose of even collecting the books.\n\nBasically, as I mentioned above, the devs had neat ideas, but for every neat idea they did something else that ruins the experience. Not much has changed since Early Access release either. All of my gripes existed on day one, and nothing has changed on either of these points in over a year. I'd stay away until you see some real progress. Watch some YouTube coverage of the game or something. Or go play Rimworld.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I write in early access:  \n\nI find the game to be incredibly frustrating, unclear, and most importantly, unfair to the player. \nThat said, I still do play it - it gets better after 12 to 18 hours, which isn't much of a selling point, in my opinion.\n\nWhat's good:  A large, beautiful map.  A sense of surviving.  A slow sense of growth and overcoming enemies.\n\nWhat's bad:  Frustratingly difficult start, where misplacement of your first home can cause hours of insta-death grief from baddies.  No clear understanding of the natural world.  Clearly trees sprout and animals return each spring, but how do I help that along?\n\nI got stuck in a loop where I misplaced my town, was getting hit by bandits, boars, and wolves.  I had an NPC to help me get weapons, but he was in constant time-out due to his eternal return of death by bandits, wolves, and boars.  I spent hours trying to save him.  Turned out, I was just in a bad spot - who knew?  \n\nThen we chopped down some trees.  They were kinda growing back.  There were some other tress to my north, but no one ever survived. I'd head there and get one-shot killed.  My pal would head up there and get one-shot killed.  Clearly, he became disgruntled.  I wanted to hire some beggars, but because I had been killed so many times, I had no clout with the town.  No one else would move in with me because I had so little clout.\n\nF-it.  Restart.  Same dang thing happened again.  Stuck in a loop of loss.\n\nF-it 3rd time.  Base in a better spot, fewer attacks, tweaked the game to give me buffs.  Still get killed over and over and over.  NPCs still on constant time-out.  I started to get some weapons and armor and did defeat a handful of small bandit troops, but they still keep coming it.\n\nThat said, once I could finally defeat the small bandit troops I felt great.  I had that Dark Souls high.  But, the same pattern happened again.  But that little Dark Souls high kept me going for a dozen hours. \n\nWould I recommend the game?  Not in its current state.  But there is a game in there.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Belwright is amazing but I can’t recommend it yet.\nLooks great, runs well (on a high-end PC), and the settler management/production systems are unique with fun little battles.\n\nThe downside: progression soon gets repetitive, and there’s been no meaningful update in a long time. This raises real concerns about whether it will evolve, especially with claims the devs have abandoned past projects.\n\nI really hope I’m wrong, but until there’s a clear roadmap or steady updates, I’d advise waiting before buying.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I expect I am probably going to refund this. I'm currently waiting for the dev to respond to my email asking how it is that upon buying this game, before ever interacting with this or any other product on any forum, I am \"banned for flaming\" on this game's forum. To be clear, I never had the ability to engage this forum or that of any other game by this dev, since this is the first game I've purchased from this dev....\n\nSo off the bat, I couldn't get through the main menu screen without the game crashing multiple times. The UI stopped recognizing where my mouse was, and I wasn't able to interact with anything on the interface through my mouse or keyboard at all. I force-closed and tried a couple more times, but in these attempts I was only able to get a ghost of feedback on a button when my mouse was nowhere near it. I went to post a bug report, and lo and behold it would appear this dev is pre-emptively banning its players from its forums \"for flaming\" -- something I worry indicates they have no intention of fixing up the game, and instead intend on silencing the forums about what's going on.\n\nBut they can't silence the reviews.\n\nIf they respond and give me an adequate explanation for this strange way they appear to be managing their forums, I'll change my review to reflect the truth of the matter. As it sits, I feel like I fell for a trap and got tricked out of my money by a shady dev....\n\nDon't buy this, not for the fact that it's a crashing mess, but for the fact it's a crashing mess in early access that the devs are actively preventing us  from talking about in the forum here, so we'd be foolish to expect it to deliver on the early-access hype.\n\n<Edit: So I checked the \"ban\"message again, and it says specifically that I was banned from the \"Bellwright Hub\" by a \"Bellwright developer\" and below that, for \"flaming\" even though I never could even access this \"Bellwright Hub\" before buying the game, and up until this point I was even excited about this game. They replaced my stoke with a probable refund.... I'm only waiting for the dev's response now because I emailed them, but they have less than 24 hours to get back to me because I want to make sure I don't get denied a refund for having this game for 48 hours or something stupid.>\n\nDO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Where is the content? Where are the fixes? One update a year? Ya it's like many predicted, just another game these devs make and then abandon.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Even though the concept is neat and the AI voice acting wasn't as bad as people say, this needs more time in the oven. \nYou'll enjoy it if you're very into the sandbox genre and have played every other title avaiable, if not you'll end up running around disappointed while regretting you bought it.\n\nGathering is tedious, story lacks soul, building is boring and combat is meh. Still, there's potential for growth and I wouldn't be surprised if it evolved to the point where I end up eating these words.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "It's a fine premise, but even in spite of lowering my expectations for its Early Access status, I was not hooked on anything. If anything, the pace of gathering was sluggish, and especially the state of combat seemed extremely lackluster at the start, with the quest to kill the 3 wolves. With no way to actually determine which of the four directions even block, or if blocking even negated damage or simply reduced it by some negligible amount with the beginner axe and wooden spear, I was quickly chunked down and had to actually just straight up dps race it, and lost. This could be genuine skill issue on my part, but there weren't really any memorable tutorials for combat.\r\n\r\nIf I could suggest a few things, it would be:\r\n1. Adding a separate button to enter a 'combat stance' of sorts. Trying to left click to build with an axe in hand is frustrating when you just swing randomly. At the same time, this could add depth to NPC interaction and reaction. Like maybe some traders would not immediately refuse you service for having a 'weapon in hand', but some might have differing prices based on an intimidation factor, at the cost of negatively impacting your social status or 'fame'; this idea might need a bit of workshopping, though, and could easily become scope creep. Simply focusing on a separate state of merely 'holding' a weapon/tool as opposed to intending to use said implement in combat is enough.\r\n2. Add fists as a 'weapon', since there will be a separate state for combat and non-combat.\r\n3. Add an interrupting segment to the first main quest when you enter the village to talk to the elder, where you find a drunk by the initial gate the player is intended to enter from (thus allowing them to walk around if they don't wish to deal with this), who insults the player and starts a confrontation, where combat (and directional attacking/blocking) can be more intuitively taught to the player.\r\n\r\nThe game wasn't aggressively unfun, and there's not too many good city/colony building games with emphasis on personal involvement/development that I could find, more of a RimWorld player myself, but there's really not a lot in this Early Access to keep playing for me personally.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Loads of great ideas ruined by awful mechanics and poor optimization. If it's 10$ pick it up if you have literally nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really don't know what game everyone else is playing but the game I played for 1.3 hours was utterly terrible.\n\nPlayed with the graphics for about an hour, game ran like my computer was from the 80s.\n\nEverything just felt unfinished and stale.\n\nRequested a refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too grindy and rebellion party and tax stuff is just not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI voices, AI artwork, AI descriptions of items, terrible combat, plenty of janky EU5 bugs and mechanics with default EU5 animations, poor villager management, desync in multiplayer, slow development, and no \"character\" in any way whatsoever. Anybody can pump out some EU5, AI-supplemented slop now and make a ton of potential playtime out of it, but it'll all be of poor quality and depth.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Poor and unfair combat which is forced upon you. Slow game play. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can only create white characters.  I know that's a world some of you would love to live in. But ...NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Barely played because I couldn't stand listening to the extremely robotic AI voicelines and how generic survival game it was. Doesn't really offer anything over any of the other generic medieval survival games it is a clone of. Not a terrible game for what it is, just definitely not for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "absolutely not, i love the idea, i love the theme, i love having NPC allies, but the execution is horrid, i feel lost even when i get quest pointers, i keep losing all my citizens every time a raid happens even when i save scum, and there's gameplay hints but not that actually explain how not to die a humilating death against overpowered thugs with clubs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you cant punch. the first quest to build a shelter lets you get attacked by wolves that never stop chasing you no matter how far you run. horrible game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another early access title looking very average.\n\nit looks too early to get my money. if the Dev's actually keep up the work and make it an actual full game.. maybe.\n\nI'm done giving my money for just \"another survival game\" do better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most frustrating game I've ever played hands down. There is absolutely nothing that makes sense. No element no area no part of it exists that is not confusing and nonsensical in some way...sometimes minor sometimes major. These devs are total morons with no common sense whatsoever. They can code but they cannot design at all. Organization, categorization, consistency, common sense are obviously foreign concepts to them. I find it difficult to believe they have any computer science background or even grade school education at times. They clearly don't understand what basic words like duel mean. Combat sucks, weapons suck, movement sucks, villagers cant fight, UI is a GIANT tangled mess of fishing line with absolutely zero organization, helpers don't help you still have to do everything yourself to get anything done, armor doesn't protect you whatsoever it is useless to even craft it, there are 20 times more items than necessary most of them are useless the rest don't work right or sensibly anyway, broken items you can't use or repair, spoiled food that you can't eat, fifteen different items just for the exact same thing to have different colors instead of one item that you can choose the color of, insufficient inventory space to carry what you need to constantly getting overflowed when you loot or harvest forcing you to leave half the reward behind to despawn on the ground, merchants will not buy the things you craft they will only buy the raw materials you use to craft them or items you can't get (like pearls), graphics are mediocre but acceptable I suppose...looks five years old already, storage boxes have comically tiny capacity you gotta build hundreds of them to store your stuff, fast travel only works to send you where you don't want to go because you aren't allowed to place the damn destination anywhere near the towns thus you can only fast travel to spots two miles from where you want to be forcing you to slow travel half the way there, quality of life is not present...just the opposite, if A makes more sense than B, B happens guaranteed every single time. Example, fast travel that forces you to be half-slow. Does that make sense to anybody? UI again is awful. NPCs walk away in the middle of conversations when giving you quest objectives, you can be attacked during conversations forcing you to redo them, there is a \"codex\" that tells you only the most vital information such as \"raw meat can be cooked for food and is harvested from animals\". I don't think there is a single window in the game that isn't confusing and difficult to use or incomplete with half the information off in some other window you gotta navigate to through six menus and ten pop ups and a dozen overpopulated lists. Ten mouse clicks seven windows thirty lists of a hundred items to sift through then sixteen key presses to accomplish even the simplest actions, the lists are so massively long that it takes twenty minutes to scroll and sift through them every time you want to find anything, gotta do constant babysitting or else your storage will get filled with broken items you can't use or repair and spoiled food you cannot eat or use, every aspect of this game lacks continuity consistency and standardization, there's books you can't read to learn the skills you need, then there's the food OMG the amount of food you have to consume is baffling...amounts to a constant continuous relentless never ending headache, it is so hard to go anywhere you move like a snail, there is a sprint feature but you can never use it due to the massive stamina problem that is constant and continuously preventing you from going anywhere or playing the damn game. All you ever do is run across the map to talk to someone who sends you all the way back across the map to talk to another guy who sends you all the way across the map to another guy...the running around never ends and you have to do it while crawling because the stamina system is so profoundly punishing. It is a game that will not let you play it. It wants you to instead watch it run for hours while you sit there waiting for something without ever touching any controls. Days are way too short nights are way too long. I could go on ranting for another ten pages but I've wasted enough time on this pile.\n\nThe game is a horrible shit show. Worst I have ever seen by far nothing comes close. And I've been gaming since the 70s. Buying and playing it has ruined my retirement. I stopped playing three days ago and I'm still frustrated. All I did was ask why all the time. Why did that happen. Why didn't that happen. Why does this thing work this way while that thing works that way when they are the same thing for cryin' out loud. Always found myself asking WHY. Because it never made any sense. Its one and only redeeming feature is that it runs smoothly and never crashes. Probably because the engine wasn't written by these comically incompetent brain dead \"devs\". There are things that make me wonder if they have ever used a computer...like for example you choose a cancel operation and a window opens up that is completely unrelated to what you were doing and you have to close it. What software does that? Cancel means CLOSE all the windows not open up new ones that have nothing at all to do with what you were cancelling out of. It's nuts.\n\nAVOID AT ALL COSTS until this thing gets refined. It has tons and tons of work to be done before it is playable or even understandable. I don't see it being ready for several years maybe a decade. Seems like just a bunch of random ideas thrown together using dice rolls. A convoluted completely unorganized crap fest. Check back in 2030 on this one it sucks ass. Too bad it has enormous potential as a concept but I question whether these guys can get it done. They just don't seem very intelligent to me. If they are, they haven't showcased it here. If I had to sum up its implementation in one word, it would unquestionably be STUPID. If they gave me this for free I'd still ask for a refund and doing so would make more sense than what I suffered through \"playing\" it. Gotta give it a 0/10. Not fun, is unceasing uninterrupted agony.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "SHIT ASS FUCKING GAME IS SO BAD THERE AINT SHIT FOR CONTENT IN THIS PIECE OF SHIT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not yet on this one. \n\nI was worried when I saw only 2 hair styles during character creation but played it off since the other features sounded cool. Even more worried when the inventory system treated each individual berry I picked up the same as rocks, sticks, pelts, books, cooked meals i.e. each one takes up one of your inventory slots and cannot be stacked (unless you drop it on the floor, which you will because you always have no inventory space and no stamina).\n\nEating random stuff you find on the ground will give you more stamina, which means you will run 2 seconds longer and wait even longer for it to come back. I drained a full stamina bar, turned around and still saw the whites of my friends eyes back at base.\n\nI wont get into the combat much more than the introduction to it feels rough. \n(1) Took no damage while running in circles on bandits but attempting the actual combat punished pretty hard. \n(2) Left click and mouse movement didn't always seem to register the movements the way it felt it should and was headache inducing with all the camera shifting. \n\nCan see why someone might get into it though as an easy to learn difficult to master experience maybe. At least archers couldn't hit me for 5 minutes straight while I stood stationary on top a lit bonfire.\n\nBottom line, the game didn't feel like it was inviting me to play it. It was punishing me for starting and not being in the end game already.\n\nI'm thankful it was able to tell me I shouldn't be here before I hit the 2 hour mark.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Abandoned to mods",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to really rave about this game. \n\nBut in the current state... I can't.\n\nThere's a level of obtuseness in some of the design decisions.. some of which you can bypass with mods. \n\nThe good.\nThere's a real sense of progression. Each win feels meaningful. \n\nCrafting your own fast travel points - big win tbh..\n\nThe bad (much longer list)\nThe game is punishing. There's no way to know that you have limited yourself without failing... over and over. \nCamp placement is a massive thing. Place it wrong and you can't progress - your NPCs/townfolk can't move to the north side of the map, but you can. You can build out there too but there's no indicators this will be a problem until you've committed your resources. Just dumb design choices. \n\nTech tree - on the one hand, it feels like it fits. On the other, you can't research tech because your townsfolk/followers are meant to do this. This makes sense since some of the tech unlocks range upwards of 15-20 minutes, in real time. For a single player focused game, that design decision is DUMB. Make your follower/townsfolk mechanic actually work if you're going in this direction. \n\nThe follower/townsfolk tasking - non intuitive and unfriendly. Reddit is full of posts from players who had massive issues getting their townsfolk to gather/research/craft items.. even when you've met the resource requirements. It is poorly explained and the guidance sucks. \n\nThe fixed camera - there's no first person perspective on this and you can't scale out your FOV either. You are locked into looking over your avatar's shoulder the whole way. \n\nCombat is janky. That's fine. this is early access but it gets old fast. \n\nThe story line - main questline has potential - typical revenge/clear your name fare. Needs more polish - again.. Early Access.\n\nSide quests - the game is full of fetch quests/clear quests. There aren't any dungeons. \n\nThe inventory management is abysmal. There's no sort function. There's no weight mechanic. Instead items take up volume in your inventory. That's fine. What is a major gripe is that you can't optimise your inventory in any reasonable way. A log takes up 9 squares - sure, whatever. But the game doesn't let you organise your allotment of space (30 squares = 6 columns x 5 rows) to move things around. So you get instances where you should be able to fit 2 logs (18 squares) in the first 3 rows and have two empty rows to fit items. But if you already have items that you're carrying, the game will only fit one log and prevent you from making room for the second. Requiring mods to give you unlimited volume to get around this is DUMB. \n\nSome double handed items take up more volume that others which is also DUMB. (Shovel is 6 squares. A bow is 3.)\n\nBuilding - there's no fast disassemble option. Instead as your buildings go higher in tier, you have to dismantle, piece by piece. This becomes necessary because the game lets you build buildings that you can't enter once they're built because the terrain has a gentle slope. No crouch means you can't enter under the doorframe and your townsfolk don't break buildings down, they just build them. So it's on you to break it down or move it. At tier 1 - no problem. At tier 2 - it took 8 in game hours to move a Cabin..\n\nThe game has been out for a year now, they're still working on it (promising) but it still needs work. \n\nMy advice - wait for more content and a sale. Then mod it to make your life easier.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "This one is a weird one for me.\n\nFor every good thing it has, it has some design decision that's just... annoying. Or worse.\n\nFirst and foremost: the AI voices. Stop it. Get rid of them. The game would IMMEDIATELY sound better, and you would lose nothing.\n\nSecond: Setting priorities for your villagers is aight, feels like Rimworld. UNLIKE Rimworld, however, your villagers are the slowest goddamn snails I've ever seen. God forbid you dismiss an armed party anywhere beyond 100 meters from your town, you'll be waiting til the heat death of the universe before they finally get back home to work.\n\nThird: Building your buildings is pretty neat. Problem is as soon as you hit \"Village Hall\", it ain't worth it. It really really sucks. I get that it's supposed to feel like you're building every piece, but when you are actually 'building' every single piece it becomes tedious, boring. \"Oh you can have your villagers do it!\" Yeah, if I want to wait an unreasonable amount of time for it to be done. Let's not forget, they're SLOW. At EVERYTHING. It takes them over twice as long as it would take you to do it yourself, and that's with multiple villagers working at once.\n\nFourth: Seasons are a fun idea, given how impactful winter is for such an old society. Problem is you experience a full year in about 8 in-game days. Winter isn't anywhere near long enough to matter in any capacity. The other seasons aren't long enough to make it even feel like you're trying to prepare for winter. The seasons may as well not exist and the gameplay wouldn't change at all.\n\nFifth: The writing. Some of these quests feel like they were written by AI. And by 'some' I really mean 'most'. You could have the quests actually be engaging, we have the ability to command a small party of adventurers, and yet most quests are 'lol go make/fetch this for me' or similar. It's boring, it only takes away from actually doing something relatively engaging; growing my town.\n\nSixth: I mentioned that you can command a small group of adventurers, and it's true. Problem is they're still dumb as shit. They won't arm themselves if you take them along as companions, none of your villagers will equip armor that's better than their rags, you NEED to micromanage this nonsense. Not that it matters a whole lot, the pathfinding is a joke. If you have a small ankle-high wall somewhere, you can cheese any enemy.\n\nSeventh: Skill books. They exist. Couldn't tell you why they exist. \"They provide a buff to the chosen skill's experience!\" You know what else would do that? Getting a non-awful amount of experience for what you decide to do, or what your villagers do. The books are just another bit of micro that doesn't need to be there. It feels like the books were a band-aid solution to \"wow experience gains are low/slow\" when it would have been far more effective to just increase exp gains across the board. The 30+minute 'reading' time is also a joke, which defeats the purpose of even collecting the books.\n\nBasically, as I mentioned above, the devs had neat ideas, but for every neat idea they did something else that ruins the experience. Not much has changed since Early Access release either. All of my gripes existed on day one, and nothing has changed on either of these points in over a year. I'd stay away until you see some real progress. Watch some YouTube coverage of the game or something. Or go play Rimworld.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I write in early access:  \n\nI find the game to be incredibly frustrating, unclear, and most importantly, unfair to the player. \nThat said, I still do play it - it gets better after 12 to 18 hours, which isn't much of a selling point, in my opinion.\n\nWhat's good:  A large, beautiful map.  A sense of surviving.  A slow sense of growth and overcoming enemies.\n\nWhat's bad:  Frustratingly difficult start, where misplacement of your first home can cause hours of insta-death grief from baddies.  No clear understanding of the natural world.  Clearly trees sprout and animals return each spring, but how do I help that along?\n\nI got stuck in a loop where I misplaced my town, was getting hit by bandits, boars, and wolves.  I had an NPC to help me get weapons, but he was in constant time-out due to his eternal return of death by bandits, wolves, and boars.  I spent hours trying to save him.  Turned out, I was just in a bad spot - who knew?  \n\nThen we chopped down some trees.  They were kinda growing back.  There were some other tress to my north, but no one ever survived. I'd head there and get one-shot killed.  My pal would head up there and get one-shot killed.  Clearly, he became disgruntled.  I wanted to hire some beggars, but because I had been killed so many times, I had no clout with the town.  No one else would move in with me because I had so little clout.\n\nF-it.  Restart.  Same dang thing happened again.  Stuck in a loop of loss.\n\nF-it 3rd time.  Base in a better spot, fewer attacks, tweaked the game to give me buffs.  Still get killed over and over and over.  NPCs still on constant time-out.  I started to get some weapons and armor and did defeat a handful of small bandit troops, but they still keep coming it.\n\nThat said, once I could finally defeat the small bandit troops I felt great.  I had that Dark Souls high.  But, the same pattern happened again.  But that little Dark Souls high kept me going for a dozen hours. \n\nWould I recommend the game?  Not in its current state.  But there is a game in there.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Belwright is amazing but I can’t recommend it yet.\nLooks great, runs well (on a high-end PC), and the settler management/production systems are unique with fun little battles.\n\nThe downside: progression soon gets repetitive, and there’s been no meaningful update in a long time. This raises real concerns about whether it will evolve, especially with claims the devs have abandoned past projects.\n\nI really hope I’m wrong, but until there’s a clear roadmap or steady updates, I’d advise waiting before buying.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I expect I am probably going to refund this. I'm currently waiting for the dev to respond to my email asking how it is that upon buying this game, before ever interacting with this or any other product on any forum, I am \"banned for flaming\" on this game's forum. To be clear, I never had the ability to engage this forum or that of any other game by this dev, since this is the first game I've purchased from this dev....\n\nSo off the bat, I couldn't get through the main menu screen without the game crashing multiple times. The UI stopped recognizing where my mouse was, and I wasn't able to interact with anything on the interface through my mouse or keyboard at all. I force-closed and tried a couple more times, but in these attempts I was only able to get a ghost of feedback on a button when my mouse was nowhere near it. I went to post a bug report, and lo and behold it would appear this dev is pre-emptively banning its players from its forums \"for flaming\" -- something I worry indicates they have no intention of fixing up the game, and instead intend on silencing the forums about what's going on.\n\nBut they can't silence the reviews.\n\nIf they respond and give me an adequate explanation for this strange way they appear to be managing their forums, I'll change my review to reflect the truth of the matter. As it sits, I feel like I fell for a trap and got tricked out of my money by a shady dev....\n\nDon't buy this, not for the fact that it's a crashing mess, but for the fact it's a crashing mess in early access that the devs are actively preventing us  from talking about in the forum here, so we'd be foolish to expect it to deliver on the early-access hype.\n\n<Edit: So I checked the \"ban\"message again, and it says specifically that I was banned from the \"Bellwright Hub\" by a \"Bellwright developer\" and below that, for \"flaming\" even though I never could even access this \"Bellwright Hub\" before buying the game, and up until this point I was even excited about this game. They replaced my stoke with a probable refund.... I'm only waiting for the dev's response now because I emailed them, but they have less than 24 hours to get back to me because I want to make sure I don't get denied a refund for having this game for 48 hours or something stupid.>\n\nDO NOT BUY!",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Where is the content? Where are the fixes? One update a year? Ya it's like many predicted, just another game these devs make and then abandon.",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Even though the concept is neat and the AI voice acting wasn't as bad as people say, this needs more time in the oven. \nYou'll enjoy it if you're very into the sandbox genre and have played every other title avaiable, if not you'll end up running around disappointed while regretting you bought it.\n\nGathering is tedious, story lacks soul, building is boring and combat is meh. Still, there's potential for growth and I wouldn't be surprised if it evolved to the point where I end up eating these words.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "It's a fine premise, but even in spite of lowering my expectations for its Early Access status, I was not hooked on anything. If anything, the pace of gathering was sluggish, and especially the state of combat seemed extremely lackluster at the start, with the quest to kill the 3 wolves. With no way to actually determine which of the four directions even block, or if blocking even negated damage or simply reduced it by some negligible amount with the beginner axe and wooden spear, I was quickly chunked down and had to actually just straight up dps race it, and lost. This could be genuine skill issue on my part, but there weren't really any memorable tutorials for combat.\r\n\r\nIf I could suggest a few things, it would be:\r\n1. Adding a separate button to enter a 'combat stance' of sorts. Trying to left click to build with an axe in hand is frustrating when you just swing randomly. At the same time, this could add depth to NPC interaction and reaction. Like maybe some traders would not immediately refuse you service for having a 'weapon in hand', but some might have differing prices based on an intimidation factor, at the cost of negatively impacting your social status or 'fame'; this idea might need a bit of workshopping, though, and could easily become scope creep. Simply focusing on a separate state of merely 'holding' a weapon/tool as opposed to intending to use said implement in combat is enough.\r\n2. Add fists as a 'weapon', since there will be a separate state for combat and non-combat.\r\n3. Add an interrupting segment to the first main quest when you enter the village to talk to the elder, where you find a drunk by the initial gate the player is intended to enter from (thus allowing them to walk around if they don't wish to deal with this), who insults the player and starts a confrontation, where combat (and directional attacking/blocking) can be more intuitively taught to the player.\r\n\r\nThe game wasn't aggressively unfun, and there's not too many good city/colony building games with emphasis on personal involvement/development that I could find, more of a RimWorld player myself, but there's really not a lot in this Early Access to keep playing for me personally.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Loads of great ideas ruined by awful mechanics and poor optimization. If it's 10$ pick it up if you have literally nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I really don't know what game everyone else is playing but the game I played for 1.3 hours was utterly terrible.\n\nPlayed with the graphics for about an hour, game ran like my computer was from the 80s.\n\nEverything just felt unfinished and stale.\n\nRequested a refund.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too grindy and rebellion party and tax stuff is just not fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI voices, AI artwork, AI descriptions of items, terrible combat, plenty of janky EU5 bugs and mechanics with default EU5 animations, poor villager management, desync in multiplayer, slow development, and no \"character\" in any way whatsoever. Anybody can pump out some EU5, AI-supplemented slop now and make a ton of potential playtime out of it, but it'll all be of poor quality and depth.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Poor and unfair combat which is forced upon you. Slow game play. Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can only create white characters.  I know that's a world some of you would love to live in. But ...NO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Barely played because I couldn't stand listening to the extremely robotic AI voicelines and how generic survival game it was. Doesn't really offer anything over any of the other generic medieval survival games it is a clone of. Not a terrible game for what it is, just definitely not for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "absolutely not, i love the idea, i love the theme, i love having NPC allies, but the execution is horrid, i feel lost even when i get quest pointers, i keep losing all my citizens every time a raid happens even when i save scum, and there's gameplay hints but not that actually explain how not to die a humilating death against overpowered thugs with clubs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you cant punch. the first quest to build a shelter lets you get attacked by wolves that never stop chasing you no matter how far you run. horrible game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}