{
  "positive": [
    {
      "review": "Really interesting and good made game with nice graphic. But ITS HARD TO HAHNDLE WiTH! \nAlso there is a lot of pro gamers who already played 500+ hours, so good luck to start.\nBut other aspects are okay as to me.",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "IQ is an indication of the mechanical efficiency of the brain and does not mean one necessarily will make good or bad decisions in life. Video game performance therefore correlates with IQ. As I'm fairly stupid, naturally, my performance in this video game is very mediocre. After hundreds of matches, my average score and position on the leaderboard has settled in the 3rd, 4th, & 5th place range and there's next to nothing I can do about it. Sometimes I get 1st, or get to play as the special MVP characters and it's interesting for a moment, but I'm aware that the rest of my team sucks when it happens. Queuing for a match has now become for me like the way boomers paw at slot machines. They want to win big, but really, they're just getting little dopamine hits from the bright colors and funny sounds. It can be said that I'm so simple-minded that I can be satisfied with pretending to swing a sword around in the virtual world for hours and I couldn't argue, since this is the way I just behaved for an entire month.  \nIt is not possible for man to avert that which God has decreed shall happen, but I am constrained by the path of least resistance; to do as the dopamine-spam-machine bids. Verily 'tis the sorest of all human ills, to abound in knowledge and yet have no power over action.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Not beginner friendly in the slightest, but once you get the hang of it, its very fun.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "One of the best like duel combat systems I seen, this game is worth a try, its fun, immersive and makes you feel like if you were in Medieval Europe on a crusade like era, if you are into medieval stuff too is a gem worth trying and not missing.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "pretty fun game with lots of cool cosmetics and a very fun and interesting combat mechanic *sad its been forgotten*",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "THE DEMON MALRIC TERROWIN COWERS WITHIN!!!! THE REIGN OF THE MASON ORDER ENDS HERE! ONCE MORE TOGETHER, FOR AGATHAAAAAAAAAAAAAAA!!!!\n\nChivalry 2 kept these hands away from Hentai for almost 3 months. Highly recommended game for those who want to ween off their Hentai addiction.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Head go bye bye rock go big boom boom shteel go clingggg 10/10 better with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "game never gets old super fun to play while high off da penjamin",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I only like this game because I can first person sword fight duel real people and that is a lot of fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game. quick hop on and have fun kind of experience. great setting, gameplay and the classes all play very differently. doesnt feel unfair and is rarely annoying. easy to learn, hard to master. simply well designed",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game. Chop some heads, and slap some cheeks my friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best medieval combat game. Unfortunately the devs have wrapped up updating the game but the community is still going strong. Customization is slightly buggy but the combat and mechanics are fluent. Easy to learn, hard to master",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Big medieval battles, high skill ceiling, funny highlights due to being able to literally throw almost any object. Overall just a fun game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Extremely fun and funny game! Has a real Monty Python feel that I wasn't expecting. The combat mechanics are top notch, easy to grasp but hard to master.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "300 hours in, I’ve got to say the game is a lot of fun\nThat being said, it’s a shame that hackers are really starting to ruin it\nThe game even flags you just for being on the same team as the cheaters, and you get kicked at the end of the match :/\nHappens too often to overlook, yet nothing’s been done so far",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "7,5/10 fun slasher, From my perspective it lacks of depth. More difficult mechanics, customizations that matters, or why not to make it pure fantasy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically crazy Battlefield in Medieval times.\n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second live for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10\n\n---{Important Tips }---\n1. DON'T SKIP the Tutorial\n2. First train combat mechanics on bots for few hours\n3. REPLAY the Tutorial, don't mash buttons - try to think what you're doing. \n4. Get angry casue you still get rekt in online lobbies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is a chiv 2 game mode called shiv 2, where a lasrge man named requis wants to scramble your bunghole, and you're trying to get him to scramble the other players bnungholes instead by shiving them. And you can shiv requis but it breaks your shiv and he gets temp stunned. there is a way to escape the prison, but its insanely tough and I have never see anyone do it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth a bash, but I do have to say that it gets boring quickly when you've played several incarnations previous.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chivalry 2 is an absolute blast when you’re in one-on-one combat swords clashing, arrows flying, it’s all epic. But the second you find yourself face-to-face with a 1v3 situation... well, let's just say you might want to start praying to whatever medieval gods you believe in.\r\n\r\nNothing quite like swinging your sword like a hero, only to get sandwiched between three dudes with axes, spears, and a level of coordination that feels like they’re in a synchronized swimming team. One moment, you’re living your knightly fantasy. The next? It’s a full-on gang bang and you’re the star of the show and you’re getting hit in the face with three different weapons. It’s... tough. Real tough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game play is straight forward. I would one down fall is even though you bought an amor set you cannot use its ledgendary sword. You have to unlock certain things and it not that straight forward on what you have to do to use your new found weapon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, you die, you get good, you die less, you emote more, you notice same players, you learn to hate archers. Would Recommend. *thumbs up*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cant stop playing it, feels as good as Battlefield games, just up close.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, but it's sad that the developers don't work on the game anymore. there are many cheaters lately...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "chop the head off I pick it up I throw it at the bad guy then spam C to battlecry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amaizing and you cant stop killing the ppl and bots boring part is you have to purchase the game itself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most fun and entertaining game that I've ever played. Best fun to tilt ratio",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good if you take the time to learn the combos and the odds of the game, I enjoy the quick LARGE maps too. lots of action , your gonna die a lot in this game . keep going ! whats your favorite class and load out so far !! im knight with main spear and shield , with just about any sword/axe/mace 1h as a back up. happy hunting !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grabbed a dedicated server with the guys, zero regrets. This is a game we always circle back to. In terms of laughs per session, Chivalry is easily top 3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shooting game eat da poopoo. Zombie game stoopid. Sword and Fist gooood.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games Ive ever played. I have so many good memories and with the bad playing this game. The only thing that made me get rid of it is focusing on myself, but any other day I would gladly reinstall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game and love it since Chiv 1.\nThis one is even better but devs dont care about their game and cheaters take it over.\n\nI can't play a singe match without a flying one puch kill cheater, not even thinking about less viasble like auto counters, stamina hax, health hax etc.\n\nSo don't buy it, but if you have it: enjoy until it is not rotten to the core.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall was a wonderful game in its peak, combat mechanics are nice, a pretty high skill ceiling is absolutely present but you don't have to be a pro to have fun and do fairly well. Had several hundred hours of really good fun, and on sale for dirt cheap you can still find servers to play on. Maps are pretty balanced and fun. A few still pretty significant bugs and optimisation is really quite laughable, but it's fortunately very playable.\n\nHowever, the game studio has completely ceased development. No new content will be added. Moderation and bug fixing is near non-existent. Hackers free roam the few active, low-ping servers that are still up at peak times and they have the ability to no-clip and instant kill with god mode. They can also completely crash a server. The developers do virtually nothing to combat this. The community can also tend to be extremely toxic at times. \n\nI only give this a recommend now due to how much good value i got out of this game, even with it's previous ridiculous delays in new content, radio silence from devs for half a year, poor moderation, finishing up with us being told out of nowhere that the devs \"consider the game to be finished\" and dropping it completely.\n\nAbsolutely don't buy unless it's on 90% off or better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny and horses and candle sticks and fish and boxes and wheels and barrels and ballistas and horse dungs and stupidity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very fun and have a lot of funny moments when you can actually play the game. The game frequently says can't connect even though I have great internet. Matchmaking will pause often after 10 seconds preventing you from joining any game. Game is very finicky meaning it works when it wants too, other times consistent connection errors. Only recommend to buy when its very cheap on sale, this game is worth about 5 dollars at its current state which is sad to say because I enjoy the game play when it works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chivalry 2 is a first-person multiplayer melee combat game developed by Torn Banner Studios and published by Tripwire Presents.\n\nThe gameplay centers on large-scale medieval battles where players fight with swords, axes, spears, bows, and other period weapons. Matches feature up to 64 players across sprawling maps with objectives like castle sieges, town raids, and open-field skirmishes.\n\nCombat is physics-based and skill-driven. Players can slash, stab, block, feint, or parry attacks, and timing is critical. The system rewards precision and awareness rather than button-mashing, but it maintains accessibility for newcomers through intuitive controls.\n\nThe tone balances gritty realism with chaotic humor. Limbs fly, soldiers shout exaggerated battle cries, and the combat feels both brutal and absurd. This mix gives the game personality and keeps large fights entertaining rather than grim.\n\nVisually, Chivalry 2 runs on Unreal Engine 4 and delivers detailed environments, realistic armor models, and strong lighting effects. The scale of battles is impressive, with hundreds of characters and dynamic action unfolding simultaneously.\n\nSound design is excellent. The clash of steel, explosions, and screams create an immersive battlefield soundscape. Music builds intensity during pushes and retreats, complementing the pacing of each match.\n\nOverall, Chivalry 2 refines and expands the foundation of the first game, offering smoother combat, larger battles, and better performance. It captures the chaos, intensity, and absurd glory of medieval warfare better than any competitor in its genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best purchases i ever made and enjoyed playing every bit of it. Yes, it has less players now but back when it was released, stuff was booming & eitherway this game is really fun. Perhaps maybe in another decade I'll get to play chiv 3 with my children. Hopefully.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very addictive, impossible to get good at, and fun sometimes. please devs just take care of this game and you will make the money you beg for. stop abandoning us.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, I recommend the game. It's a really fun medieval combat game.\nBut I may only recommend it if you haven't played Chivalry 1, because as a Chivalry 1 fan, I feel as though this game is one step forward and one step back. Here's why.\n\n- Lack of explicit Duel mode. Instead, there is \"1v1 Arena\", which really sucks. You have 30 seconds of matchmaking queue in the main menu, followed by 30 seconds of loading and warmup, just to fight one random person in ~5 rounds. As far as I can tell, the matchmaking does little to ensure a fair matchup. So it's 50% waiting and 50% fighting the same person over and over. Whereas Chivalry 1 duel mode was 5% waiting and 95% fighting random people each time.\n- There are cheaters. For example, players moving and attacking unnaturally fast. To a Chivalry 1 player, this is shocking, because to the best of my knowledge, Chivalry 1 had no cheaters. I've never even heard of cheaters existing in Chivalry 1 in 1200 hours of gameplay. On the other hand, in Chivalry 2, I've seen at least one blatant cheater myself and players accusing each other of cheating constantly. Not an hour goes by without someone calling cheats with all seriousness. So it's a staggering difference between cheating being non-existent in Chivalry 1, and between cheating infesting Chivalry 2 quite severely.\n- Lack of map variety. ~10 hours are enough to learn all the maps. It's mostly the same 5-10 maps over and over. It'll feel repetitive way too early. I don't quite think I should feel like I've seen everything after 25 hours of gameplay - that's not a very good sign.\n- Atrocious map balance for Team Objective mode. This manifests itself by a particular objective having very predictable outcome. E.g. in Darkforest, Masons typically do all objectives except the last one, resulting in Agatha victory. Almost always. Takes you 2-3 playthroughs to notice and understand why. I really don't think this was so bad in Chivalry 1.\n- Some lack of technical polish here and there. For example, I managed to clip through the floor twice in 25 hours of gameplay. This never happened to me in 1200 hours of Chivalry 1.\n\nObviously, there are good things too. Together with all the new features that you surely already know about, what I like the most is the much better handled lore and atmosphere. The game world is more fleshed out and it all feels more plausible, though it still has lots of room for improvement in that aspect.\n\nIt's not exactly fair to review the game purely from the lens of a Chivalry 1 player, but it's hard to forgive seeing the game struggle at aspects that were already handled well in Chivalry 1. For the sake of remaining open-minded about that, my review verdict is positive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can push C to yell. In game lore is that everyone sweats gasoline, If you touch any flame you ignite until death.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like if battlefield was set during the 1500s, 10/10 i love throwing decapitated heads at people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright ig, its basically just a console port of mordhau so thats p cool but on pc its decent enough just not quite there though imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it. pretty overwhelming at first, and the menu UI fucking sucks ass, but once you get the hang of it it's loads of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had a great time playing!\r\nI tried most of the classes and settled on vanguard and knight. the weapon combat is extremely fun, once you get the hang of it. When I am playing it, it felt like SW battlefront but with a medieval setting and i loved it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game is AMAZING! Really worth your money. NO pay to win at all and really fun since the first minute. Buy and come play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chivalry 2\r\n.\r\nAn amazing game with a unique fight mechanic.\r\nBeautiful music.\r\nLand a hit before taking one.\r\nAttack blocked characters to destroy their defense.\r\nThere is a counterattack (attack during block).\r\nNice handpaint cinematics.\r\n.\r\nControls:\r\nP - change perspective\r\nRMB - defend\r\nLMB - attack\r\nF1 - control map\r\n1 - 5 choose weapon\r\nWASD to walk\r\nQ - special\r\nE - use\r\nR - jab\r\nF - kick\r\nG - throw\r\nShift - sprint\r\nCtrl - crouch\r\nAlt - attack\r\nZ, X, B - emote\r\nV - cancel\r\nC - battle cry\r\n] - in-game menu\r\nF10 - suicide\r\nL - loadout\r\nN - team select\r\nY - all say\r\nT - team say\r\n.\r\nMouse wheel:\r\nClick - flourish\r\nScroll up - stab\r\nScroll down - overhead\r\nWheel down + hold LMB - heavy overhead\r\nWheel up + hold LMB - heavy stab",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, chalked full of action and glory, what i don't like though is that everyone who plays it is suddenly a nerd in the friend eyes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great visceral silly fun.  Easy to get to grips with... Hard to master...  The gameplay itself is extremely exciting and that itself carries what in lesser hands would be a lack of content.\n\nThis rules. \n\nEverybody should play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is basically no moderation, because when i was playing some racist and sexist stuff was said in chat. \nBut the core gameplay is pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems good, i play with my son. I believe they don't support or update the game anymore but i could but wrong. \nLots of die-hards on here, also a few hackers like any other online game. People just cant help themselves and gotta cheat cause they are awful. Other than that its pretty fun once you get the weapons you like the most than build from there.\n\nWe got 3 copies of the game so that tell's ya its alright! Also if you got Epic-Games it goes up for free sometimes. I have it on there also along with 300+ games I paid zero dollars for.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game and gameplay is really good. However: You will encounter server issues which will render whole game unplayable; Swings and every kind of weapon play is heavy and slow. We all know heavy armor doesnt make you slow as you would expect it to be. It needs to be quicker.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better than mordhau\r\nhit reg is ass 30% of the time (AS A NEW PLAYER) maybe im just getting diffed but i swear it doesnt look like you get hit but you do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "خیلی بازیه جالبیه من از بچگی که جنگ های صلیبی بازی میکردم میخواستم اینجوری کنترل کارکتر رو به عهده بگیرم",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Chivalry is a team first person shooter, except with medieval weapons. Despite it going about as well for me as I imagine that charging in with weapon in hand would go for me in real life, it was fun for a time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An absolutely fantastic medieval brawler packed with chaotic battles, weighty weapons, and hilarious moments. Whether you’re charging with allies or dueling in the mud, Chivalry 2 delivers some of the most entertaining melee combat out there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Due to their apparent training with Mike Tyson, opponents' swings are intertwined like those of a former ballet dancer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "dont trust Daxberg, he tried to stomp my cat down the bathtub drain when i didnt give him 50 dollars for his birthday",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like medieval hacking slashing games its a solid one. Also has a good player base with clans if you're into that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like first person sword combat with big muscle men. This is the game for you.\nBuy now pay later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Burying a sword into the chest of my enemies is a satisfying feeling...now i can do it without getting arrested!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very high skill ceiling however it is still very easy to jump in and have fun and get kills as a noob.  Best $8 dollars ever spent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've seen sentences in chat I didn't know you could create with the english language\n10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bear the Jerusalem Cross and ride my war horse into battle as I bear witness to a crusade for the Lord.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chivalry 2 is the only game where I can go from feeling like a heroic knight to a complete medieval clown in about three seconds. I’ll land a beautifully timed parry, follow it up with a flawless counter… and then get instantly deleted by some guy named “Sir Loin of Beef” throwing a wagon wheel at my face.\n\nCombat is surprisingly deep, which is wild considering half the time I’m just panic-swinging like I’m trying to swat a bee. But when things click, it feels amazing. Winning a duel in Chivalry 2 is like solving a complex math problem—except instead of being praised, you get screamed at in five different accents.\n\nThe real entertainment is the chaos. You’ll see a majestic knight riding into battle, sword raised high… only to trip over a rock and get dog-piled by peasants. I once watched a teammate charge into battle holding nothing but a fish. He got three kills. I don’t understand this game and I don’t think I want to.\n\nMatches feel like 50% skill, 30% luck, and 20% screaming. The voice lines alone are worth the price. If you’re not yelling “FOR THE KING!” while sprinting directly into your own team’s catapult shot, you’re not playing correctly.\n\nPerformance is good, the maps are fun, and the chaos is unforgettable. It’s messy, it’s loud, it’s stupid—in the best possible way.\n\n10/10 – Lost an arm, kept swinging. Got kicked off a bridge. Laughed so hard I forgot to respawn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I threw a 10ft long spear through some dudes head. Then had a 30ft spear from a giant crossbow shot at me and luanching me across the map. 10/10 would buy again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "insanely fun game\r\ntoo bad TB doesn't really care about it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm waiting for the entire playerbase to eventually abandon this game so I can update my review to \"I guess Chivalry is dead\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play lots of games and very rarely leave a review. Middle aged and have been gaming since before I knew how to read. I tend to favor single player strategy games. With that boring lifestory out of the way, I have to say that this is my favorite game of all time. It's going to be a nightmare for new players as you have to learn the mechanics but I swear to God to you that you'll never find something as funny and entertaining as this game. Easy to get into but incredibly high skill ceiling. The over-the-top emotes/VA, gratuitous violence, and balance between humor, action, and skill make this game an absolute treat. Fkn 10 out of 10 and it breaks my heart that the devs moved onto some run-of-the-mill zombie slop game. Will sell my nut to get a Chiv 3.\n\nAs a noob your concern is swinging your weapon and blocking, but as a \"pro\" you'll be timing weapon swings, learning animations, learning weapon ranges, mastering the counter system, speeding up or slowing down your weapon with drags or accels, feinting, counter+feinting, the \"triple feint,\" all sorts of techs. You'll start trying to bait, being predictable only to switch technique to confuse opponent, all sorts man. ALL SORTS SO MANY SORTS OF METHODS TO CUT PEOPLE'S HEADS OFF FOR THE GLORIOUS RED AND BLACK\n\nFOR MALRIC!!!\n\nAGATHA IS FOR FEMBOIS",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] FUN GAME [/h1]\r\n\r\nThe player collision box, [u] IT'S WAY TO BIG [/u]. The problem is you get stuck on everyone and everything. It would also be nice to have a \"play again\" and \"back to main menu\" button after a match ends. Training with a advanced bot on different combat mechanics would be nice. On the plus side, the look of the game is good, the pickups are hilarious (chickens, peasants, pigs, dung etc.) The overall combat is very good for casual people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect game to turn your brain off and parry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, though it takes a little while to get the hang of it. I'd start in custom servers because they teach you how to fight better and are more fun in my opinion, while also still giving you XP and coin. Great game, would recommend, though custom servers do tend to disconnect and crash a lot (and no my WiFi isn't bad).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game has its flaws, but I haven't found anything better than this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like swords and fighting game on steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If there are hackers... i haven't ran into them... or if i did, they're now without a head... *shrugs*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good just kinda limited content but u can  get down with severed heads",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit hard to control at first but is fun once you get the hang of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good but hard to kill with 8 ppl attacking me at once",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I killed 7 men in a row using just my head as both my arms got chopped off",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yo mama’s so poor, the ducks throw bread at her.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I chopped both of a mans arms off and he proceeded to headbutt me to death 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Swing weapon, hit dude, ptfo, & win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i bought it 10 euro so for a game that they say its dead its vfm",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addicting.   Great Team play aspect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good but hard, as all things should be",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "AAAAA AAAAA AAAAAAAAA  AAAAAAAA AAAA RAHHH HHAAAAA HAAAAA HAAHAHAAHA RRRRRRRRRR AAAAAAAAAAAAAAA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shing shing slash sword game, also makes me mad a lot :>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IF you have a Nub finger you will be so good at this game :) Dont buy it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2]This game is so very good even though I only kill 5 people per match.[/h2]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fortnite but only knights no forting",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Come Closer Come Closer-NE  Yo I do not have any opinion on anything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its kinda hard but not bad so far",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its no mordhau but its ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "random bullshit, feels like you're high af",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funny melee game. Hackers not so fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Suck at Melee? Go Archer.\r\nSuck at Archer? Go Melee.\r\nSuck at both? Go Archer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its perfect. Never change it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best medivel game i have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this game while you're violently high>>>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best gaame for dads",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "love this game but its riddled with cry baby hackers that have access to instant kill, instant heal, and can even crash your server if they're being kicked, and the devs dont do anything to stop them or punish them.",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "Lots of hacking/cheating, the game has become entirely impossible to enjoy (as of Nov 2025). What happens is someone will join with a weird-color name tag, then they starts no-clip floating around the map at fast speed and insta-killing anyone they touch. Why would I want to play or recommend a game like that? My advice is don't purchase this game until they fix it - it will simply be an upsetting experience so why bother?\r\n\r\nI don't know what they do to hack (or which platform they use), but for the record I'm running steam on linux, so if devs' response to hacking is to make the game unplayable on linux - then it would be doubly-unfortunate :( let's hope that this is not the case and that they can fix it. Until then - strongly suggest not buying. It happens in all modes. Otherwise this was a very fun game, which you could play for 15 minutes or for 3 hours - I loved it before the hacking overtook it.\r\n\r\nTL;DR - fun game but blows hard because of hacking. Don't buy until devs fix it.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "At the end of the day, Chivalry 2 will no longer receive updates or support. We have to assume that what we're seeing now is a blip on a downward trajectory. If no improvements are going to be made, then with each day passing from this review I strongly encourage a skip. \n\nA list of a bunch of cons:\n- Game is 8 dollars frequently, DO NOT BUY FOR FULL PRICE. IT IS ON SALE FOR 80% OFF REGULARLY\n- Playerbase is constantly declining, now at the lowest its ever been. Leads to high ping and long queues for players in regions that the game is already dead in.\n- Hacking problem is getting worse every day and there are zero plans to address it. If you see a hacker they are almost never going to be banned so assume you will see them until they get bored\n- Community has a lot of really racist people. Several of the biggest clans in the game have a long history of it, one of the biggest clans has a slur in their name and constantly uses them.\n- If you start now you're essentially cannon fodder. Your skill gap between you and a person who has played since release is so huge that you will not be able to tell if they're cheating or just better. This sucks, because there are a LOT of cheaters.\n- Game will no longer receive updates. Game will no longer receive support. If you buy this, assume it will only be playable for another year or two.\n- Ping can make this game entirely unplayable. If you're above 100 ping when playing other games I'd autoskip this. \n- REPEAT - DO NOT BUY FOR FULL PRICE. IT IS ON SALE FOR 80% OFF REGULARLY\n\nI'll probably keep playing, but that's more out of some compulsion than genuine joy. Highly recommend skipping,",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Abandonware with the devs staying silent and mods of both discord and reddit trying their damnest to silence it all",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Very difficult game in terms of playing againts experienced players. There is no matchmaking system that would set up games based on player's rating. After 20 hours of playing it's still very difficult to compete. I can't imagine how much time it takes to learn the game in order to get enjoy from playing it. My experience is 95% of play time is suffering 5% joy. The game is extremely unpleasent for the newcomers",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The negative ratings will continue until moral improves, Hackers are ruining this game. Torn Banner do better please.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "one of the buggiest games and launchers I have ever has the displeasure of using",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Overall, a fantastic game. However, as of last month (october), it's become riddled with hackers and plagued by server issues, rubber banding, etc. In it's current state, it's hardly playable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There a lot of cheater running around, game seems to lack Anti-Cheat. So its left to the community to maintain.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If its not blatant cheaters ruining the games in both public and private servers its your own team mates intentionally killing you just to troll. Report system does nothing, If you try to votekick in game they will just crash the server. If you do what Torn Banner asks you to do on reddit, discord, etc. and share a clip with the player ID you will be the one banned. Torn Banner is an absolute joke. Fix your game before its perma dead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Abandoned, hackers, can't join friends in ongoing game, tons of blatant hate speech in the chat too - no wonder they had to mute mics in this game. No more fresh content, either. Really weird decision to abandon their best game in favor of other projects. It's like they actively don't want to acknowledge how great this genre can be.\r\n\r\nChiv 2 should have at least been opened up for modding like chiv 1, to extend it's life.\r\n\r\nIt sucks too, because so far, nobody can compete with them. Mordhau is already dead and there has yet to be an answer by another developer for this genre.\r\n\r\nI really hope someone puts this game to shame one day, because I really love chiv, but torn banner needs a good kick in the pants.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good game, a hell of a lot of fun. But you can tell from lack of updates that this team doesn't want to care for its community. Its infested with hackers, from lots of burner accounts that keep reappearing, to high rank players that have them occasionally on for \"the trolls\". It seems to be easily available to everyone and it's always the same hacks. Superspeed + flight + swinging 1000000 times per second. \n\nIn the state it's in I can't really recommend it since the only way to play this game is through the multiplayer, the very same that is infested with hackers. And while I'd be excited for sequels, I'm genuinely worried future games will get same treatment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I used to love this game for its addictive gameplay and silly humor, but recently the game has had sporadic stuttering during close quarters combat that makes it impossible to play, even on the lowest graphics settings. I don't have this problem with any other game, whether they are online or offline and with any conditions. I see a lot of other players have this issue as well. Until these issues are addressed by the developer, I have no choice but to uninstall because it's just unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This and the original game was one of my favorite PvP games. Now I will refuse to play until devs address hackers ddosing servers and keeping games hostage. Threatening to ddos servers if they are kicked from the game. The devs have to know at this point, and the ignoring is going to just kill the game. Unfortunate. First time loading up the game in weeks, and I have infinite health hackers chasing me riding horses :)\n\nUPDATE: After realizing I can complete all the achievements for this game through offline bot mode, I decided I will hide it from my library and never play it again after having completed all the achievements. Fix your game and might revisit it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT BUY THIS GAME. the devs do not give a singular fuck about it. people blatantly hack all the time flying around instakilling people and the community is so toxic they just let it happen instead of kicking, theres zero anticheat in place, the report system doesnt work, and on top of all of that its not even that fun. DO NOT BUY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Perhaps the only review I'll ever make. One of my favorite games ever. The first game was up there as well, especially the Deadliest Warrior DLC. Unfortunately, TB has moved on to focus on different projects, and they haven't tended to this game or the community in a couple years. Servers will sometimes randomly disconnect, or suffer from severe lag. Hackers ruin 1/10 games, and are rarely votekicked successfully. Both issues that will probably only get worse in time.\n\nGameplay/combat (even the communicty every so many games) is hella fun though, with a really neat skill arc that's accessible even at low levels, and there's still room for them to do more with it or make things interesting. But, they won't. Buy if you want to endure those inconveniences, but I can't say it would be a smooth experience consistently.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lmfao torn banner really abandoned this game for generic zombie game #939482789 that nobody plays. unbelievable",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this game buttttt\n\nHere are the negatives.\n\nTorn banner, the devs, have stopped content updates to the game. So what is there now is all there will ever be. \n\nThere’s loads of toxic players, I might be included in that, servers can be jank & there’s even more hackers & griefers now than ever.\n\nThe hacker problem is awful. Vaughn Payne & ??? Are ruining matches every day on NA EAST as of 11/03/25. It’s embarrassing & Torn Banner needs to hardware or IP ban. \n\nGriefers like penilo openly team kill & are sheltered by people they are in party with. Many games like siege ban those who play with cheaters/griefers so why can’t TB do the same?\n\nTB killed duel servers, now it’s just griefer filled “social” servers.\n\nTeam death Match removed from 64 player team objective playlist due to a very very very small vocal minority. Hippodrome, fighting pit, warden glade & tournament grounds are amazing maps. It’s a shame they’re hidden away 99% of the time.\n\nHorses just suck.\n\nDid I mention griefers and hackers?\n\nEverything about soter Dave. Look it up on your own time \n\nBut like I said I love this game. Which is what makes TB’s negligence so infuriating. \n\nIt’s the only game on the market that not only does medieval combat well with a wide variety of truly balanced weapons, there’s also a tremendous community within the game. 98% of the player base is very kind and just wants to have fun..\n\nThe emotes & voicelines keep this game unique & fresh, every game I find myself in a new situation or dying in a way I never thought possible…\n\nYou can set people ablaze with a burning chicken, lop their head off & line dance on their corpse. You can take said head and THROW IT AT ANOTHER PERSON… \n\nThis is a Fun and unique game & one that still has very healthy player base. Yet torn banner has abandoned it for a game that hardly hits 300 unique players a day. \n\nOn sale it’s a 10/10 purchase just be aware of what you’re getting into.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do you want constant berating about how minorities are horrible and should be exterminated?\n\nDo you want constant mistreatment and harassment due to your existence?\n\nDo you want bots who spam chat with constant racist/N*zi epithets with no repercussions?\n\nDo you want hackers who teleport all over the map and instakill everyone because it's \"funny\"?\n\nOf course you don't. Stay way from Chivalry 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game used to be so fun. I played it on xbox originally, but we purchased on steam recently to scratch an old itch. They do not care at all about this game anymore so I would not waste another cent on it! The tutorial lobbies are riddled with hackers who are over lvl. 1000 and you can't even get out of spawn.  It is not fun anymore. Waste of time on something that used to be great.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my team is always so ass it just makes the game horrible and i'm not even good people are just stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even tho this game is very fun don't get me wrong, I don't think its worth the 40 dollars plus Torn Banner drop this game. Rip",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game and have spent nearly 400 hours playing, but two big problems have become routine:\n1. Cheaters who give themselves superpowers (literally flying or instakilling) to ruin everybody else's fun\n2. Cheaters who somehow crash entire servers when they get votekicked or just because they feel like it\n\nTorn Banner needs to start moderating their game if they don't want it to die, because they seem to have pretty much abandoned it as of late 2025. And that sucks, because Chiv 2 has deep combat and customization, it can be insanely fun to play, and there's very few alternatives for this type of game that aren't either dead or Mordhau.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun for a first few hours, but the more you play it, the more you feel like controlling an NPC mob that only one job is to run at the enemy, deal some damage, maybe kill someone and die, rince and repeat. There is no sense of true skill progression, just mindless slaughter. You will also constantly get hit by your teammates, and they will constantly run in between the enemy you're facing and you making your sword swings hit them instead of the enemy. What an annoying game... For Honor, while much different than this game, is much better choice if you're looking for something that requires a skill and tactics.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game would have been great if the people who played were less toxic and better at the game than the mode against bots. Seriously people have major issues in this community with skill issue and being civilised humans issues, which 15 hours into the game already made me tired of playing it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gam if fun but if ur easly ragebaited dont play ts i may or may not have broken my 5000$ gmaing pc while playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game status for deck being playable, but just got banned because anticheat doesnt recognize proton",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, very bad community. So much hate every round. Tons of people just insulting others. People are getting kicked randomly and nothing you can do about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was great, pretty dead now and most players play this game like an rpg, not a fighting game, constantly running, throwing shit and backing off, etc. It's nothing like the game it once was, oh well, lasted long.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is absoloute garbage and un playable for new players the combat system is way to chaotic and not balanced at all",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Screw easy anti cheat bruh had to refund cause it prevented me from even launching the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is shit and the devs are clearly the biggest dumb fucks in developing history",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is simply not worth it in 2025, its fun and pretty, but its abandoned by its devs, cheaters are running rampant and they simply dont care anymore, dont waste your money, dont waste your time and most important dont waste your sanity for this game.\n\nIn case the devs will acknowledge these problems i will change my review.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuckin shit of a game, controls are unfair and teamates are shit people, not worth the money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TornBanner abandoned it and is now ruined by cheaters. RiP SoterDave",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is ridiculous. I REALLY wanna play this game but the cross play will NOT let me play with my friends. How am I supposed to enjoy this game if it won't let me play with my friends. So I'm not touching this game, again, until they fix the cross play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "+ Fantastic realistic  graphics with no flashy effects\n+ Weapons feel like hey have an impact when you hit an opponent, Better feeling than in Mordhau.\n+ Okey amount of multiplayer servers online\n\n- No Flails ;(   (They had it in Chivalry 1 and I sorely miss it)\n-Arcadish messy mp combat, Chivalry 1 also feels arcady but in a better way\n- Can´t see your knight when you want to choose armour or weapons, just icons or names for them.\n- Broken bots in objective mode. (Better in Chivalry 1)\n-Unfortunatly you can´t turn off the UI/HUD or damage numbers, it says its possible in the options but its broken)\n- Only 32 bots in offline mode\n- Can only earn money to unlock new items in multiplayer mode (Same as in Mordhau)\n- No mod support\n\nRather play: Mordhau & Chivalry 1",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "really wanted to like this game.. but as a new player its pointless.. no skill based matchmaking.. lvl 1 going against a lvl 400 on my first game? i understand this game is dead but damn.. got a key for $4 and still feel robbed.. wait for chivalry 3 when the game is fresh i think it will be worth it then.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hackers and cheaters rule the day and you can't even progress offline. I just wanted a fun Medieval battlefield that I can instantly get into matches for and I can't even have that. Game dead now, I will thank anyone and prob pay them to make a offline progression cheat for this game since devs don't care about security anyway",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No support, cheaters killed the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game but goddamn do something about the ddos attacks on duel servers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game wont even launch without crashing, completely unplayable and steam wont even let me refund it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after hours of playing this game and spending way too much money I can confidently say that this is just a worse mordhau",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awful game, Devs dont care about the community and everyone on this game is a sweaty level 1000 or cheater. Dont buy its a cash grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth playing anymore , game is dead , hackers in all lobbys.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "F**** auto balance  when I try to attack from begin but suddenly change side to f***** ff****ff*** sh****",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WARNING!!!!!! DO NOT BUY!!!!!!!!\n\n\n\nTHIS GAME FREAKING SUCKS BUTT. ITS RIDDLED WITH CHEATERS!!! DO NOT BUY!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Devs bullied their top content creator to off themselves, disgraceful.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "wish they'd bothered to fix this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Kid : Mom i want mordhau . \r\nMom : We have mordhau at home . \r\nMordhau at home :",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wish it was a good as it could be",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "devs gave up on this game too much cheaters dont waste your time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I hate chivalry 2 i hate archers fuck tenosia fuck askandir",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game makes no sense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This was great until they added the saracen faction. I want to play a game about cool knights fighting. Now like 75% of matches are the LI LI LI LI LI LI LI people screaming in their sand world.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfun garbage. Abandoned by devs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much talking",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good !",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TOO HARD.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT BUY THIS GAME \nfull hackers",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "garbage",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT BUY THIS GAME\r\n\r\nThis is my favorite game all time. Amazing gameplay, crazy learning curve that's fun at every stage, whether you're a noob in your first game or have played for thousands of hours.\r\n\r\nTorn Banner has abandoned this wonderful project in favor of some terrible zombie game no one plays. As a result, hackers actively ruin any lobby you might begin to enjoy. The reporting system is broken or ignored. Hackers run free, running up to you at 100 miles an hour and killing you in an instant. Lately they've been using hacks that instantly kill players without even walking up to them, or literally crashing the lobby and sending everyone to the main menu.\r\n\r\nDO NOT BUY THIS GAME, DO NOT GIVE TORN BANNER ANY MONEY AT ALL.",
      "voted_up": false,
      "votes_helpful": 106
    },
    {
      "review": "Love the game, however I don't endorse the devs for what they've done. The blatant ignorance on the developers baffles me, let alone that they can't even finish No More Room In Hell 2. They can't even solve a simple issue, let alone listen to their community when it comes to feedback or positive changes.\n\nTheir careless and reckless actions led to a content creator named Soter Dave to take their own life for just merely suggesting a solution to a problem for those who played Chivalry 2 on the Xbox Pass before Torn Banner perma banned Soter Dave's account with no reconsideration. They are now censoring any mentions of him on their discords and forums, however they have no control over the steam reviews. Please look up Soter Dave on Youtube\n\nedit: Alright I messed up about Killing Floor 3 but it still stands",
      "voted_up": false,
      "votes_helpful": 158
    },
    {
      "review": "Hackers CONSTANTLY crash the servers on this game now, and Torn Banner makes no effort whatsoever to do anything about it.  The game is actually, by far, my favorite game I have ever played in terms of its  mechanics. It has truly deep and satisfying combat with a high skill ceiling that kept me coming back endlessly... but I really can't stress enough how regularly the servers are crashed by hackers.   I haven't had a single session without an eventual hacker in a months now.  \n\nThe problem has gotten worse and worse, but Torn Banner's response has been non-existent. People who PAY for private servers have reached out repeatedly, and received nothing but form-letter/AI responses.  This game is mechanically good enough to sustain a far-beyond-normal lifespan, because the combat is just that satisfying -- but that doesn't matter if the devs won't step in to address the EXTREMELY prevalent problem with hackers.  They aren't willing to ensure their servers function, but they are more than happy to continue charging for them.",
      "voted_up": false,
      "votes_helpful": 104
    },
    {
      "review": "i've loved this game, and put in what hours i could from when i purchased.. after their last major update then kind of let the servers go free, and thats ok. but then hackers came in.. my very last game i think 2 days ago as of this post. i joined a game large 64 player mode, and there was a hacker in that game, running around killing everybody. we all suggested to ban him and report him for cheating, he didn't get banned or i should say kicked from game is was i meant, however all the sudden i just came back 2 days later, today. and I'M BANNED?! WHY?! I'VE NEVER CHEATED ON ANY ONLINE GAME IN MY LIFE! LET ALONE THIS ONE THAT I ENJOY! SOMETHINGS GOTTA GIVE< FOR NOW DO NOT BUY THIS GAME UNLESS THE DEVS SAY THEY'VE FIXED THE ISSUE.",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "love this game but its riddled with cry baby hackers that have access to instant kill, instant heal, and can even crash your server if they're being kicked, and the devs dont do anything to stop them or punish them.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "I have prob 100+ hours on Epic, and I do love the game. I downvote because the devs here are wildly incompetent and while the core gameplay is great, the devs have just done so many stupid things and failed to fix issues before moving on that I can't honestly recommend it.\n\n1) Took the devs well over a year to add horses (something they promised at launch), and when they did, they were so terribly implemented that in order to get them to work they had to *lower the player count on the server to make room for the horses.* No I'm not kidding. Not to mention they are utterly terrible to play with and nobody cares about them or bothers to play on the maps with them.\n\n2) Devs wanted to fix crummy animation exploits: then didn't fix them. Dueling was great for a time, but people have gone back to all the same nonsense in Chivarly 1. Rainbow swings, 360 feints, toe jabs. Not fun. Visually repulsive. Low skill. Devs didn't address any of it and the duel scene suffered for it. Not to mention they never even bothered to add actual duel servers, so every FFA \"duel\" server is reliant on honor system. Better cross your fingers there's no griefers!\n\n3) Archers have never been fun or interesting for this game. Javelins? Fair enough. But being involved in a heart-pounding, chaotic melee, only to get randomly insta-killed by an archer from 100m away with 0 counter play besides \"don't get shot by the guys randomly firing arrows in the crowd\" is not just anti-fun but outright cancerous. And no, not \"skill issue.\" I played competitively in Chiv 1 and with/against the best players in the Chiv 2 scene.\n\n4) Game suffered and still suffers from one of the worst and most buggy party systems I've ever seen. It was quite literally non-functional for the better part of a year, and even recently I had difficulty staying in a party after leaving a match. It's honestly baffling how it's been so long and they can't even get their party system to not have failures when doing basic functions.\n\n5) The devs wasted a year implementing horses that nobody cared about, but no worries, because they doubled down by also wasting a ton of development time adding a 3rd faction that nobody cared about, which came with a whole 2 weapons that i can remember, neither of which was viable or interesting to use. In reality, all this meant was new voice lines and cosmetics, while the gameplay remained totally identical, except instead of Team Red vs Team Blue, sometimes you get to fight Team Yellow which plays exactly like the other two teams. The new maps were also bogged down on release by the devs adding in the pointless horses, which lowered the server counts and just made them worse overall.\n\nAll-in-all, I actually do think the core melee combat here (when not being heavily exploited), is fantastic, and the chaotic melee brawling is some of the best you can experience in an online game. If only the devs hadn't been so awful. It's fine though, because they've moved on from Chiv to make No More Room in Hell 2, another game with great core gameplay, bogged down by weird design choices, lack of content, and terrible systems that do nothing but subtract from the fun of the core gameplay, just like this game!",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "Lots of hacking/cheating, the game has become entirely impossible to enjoy (as of Nov 2025). What happens is someone will join with a weird-color name tag, then they starts no-clip floating around the map at fast speed and insta-killing anyone they touch. Why would I want to play or recommend a game like that? My advice is don't purchase this game until they fix it - it will simply be an upsetting experience so why bother?\r\n\r\nI don't know what they do to hack (or which platform they use), but for the record I'm running steam on linux, so if devs' response to hacking is to make the game unplayable on linux - then it would be doubly-unfortunate :( let's hope that this is not the case and that they can fix it. Until then - strongly suggest not buying. It happens in all modes. Otherwise this was a very fun game, which you could play for 15 minutes or for 3 hours - I loved it before the hacking overtook it.\r\n\r\nTL;DR - fun game but blows hard because of hacking. Don't buy until devs fix it.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "I need you to understand the hours played on Steam are dwarfed by the 1100+ hours I have in this game on Epic.\n\nTo say I really enjoy this game is an understatement. There's a fantastic community built around the game, and the game itself is great. I'd easily recommend this game to the highest possible degree under good circumstances.\n\nThese are not good circumstances. The developers have essentially abandoned this game for the better part of a year now to focus on another project. The reporting system, which previously was one of the most effective I've seen, was through Discord, and now those reports are re-directed to the website. The reports sent through the website are then canned messages instructing you to use the in-game reporting mechanism.\n\nNeedless to say, nothing happens anymore. Why is this an issue?\n\nBecause hacks for this game became easily available and hackers have come through in waves and terrorized the game. Some use it to cheat, some to grief, and recently, some use it to crash the already inconsistent servers. There's no one to bring this up with anymore, and the in-game reporting is impossible to use when a user joins and immediately crashes the server before anyone can do anything about it.\n\nThey still sell this game at full price, and while us regulars play around with it and enjoy the game, I cannot fathom newer players paying full price for an online game that doesn't function because the developers have abandoned it.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I have an unhealthy love for Chivalry 2. It's my second most played game on a 17 year old Steam account, and all of that has been from the last ~2 years.\n\nUnfortunately, Torn Banner is too busy with their zombie game, and Chiv 2 is infested with hackers who crash the servers relentlessly. As far as I know, not one dev has been working on fixing the exploit after almost a year now. Nor is anyone answering the hacker reports and banning these people for good. The largest and most popular duel community in Chiv 2 - who's server used to be full at almost all hours - is 0 pop, because a single hacker has spent the last 6 months crashing it over and over again over some personal vendetta. Server owners are literally being blackmailed to keep their RENTED servers online. And tonight, all player run community servers are crashed out and <5 population because someone named DS Kev is just going down the list..\n\nChivalry 2 is the best game in the genre, hands down. Don't buy it. Screw the sale, and screw the good reviews from 12+ months ago. That money isn't going into making the game fun for you, let alone playable. You'll be disappointed. You'll have nights where you log off because you're tired of being hacked. And Torn Banner won't spare ONE SINGLE DEV to changing that outcome, because to them the game is done. That's what we're worth after all this time, and after their (sometimes [i]fatal[/i]) mistakes. If the studio manages to survive the zombie apocalypse, they're going to find a player base so repulsed that Chiv 3 won't even be a chance to keep the lights on. RIP.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Used to be my favorite game.  Hackers are rampant now.  Ruins the the whole thing. They fly around, one hit you, crash the servers. ...etc.  Worst part is the Torn Banner seems to be ignoring it.  Total shame.  Great when its fair and hacker free. That's few and far between now.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "a fantastic game, one of my favorites of all time. unfortunately in this stage of its life (coughing in a hospital bed terminally ill neglected by its caretakers) i cannot in good conscience recommend it to anyone who hasn't already been enthralled by it. this is because of a blatant cheating issue the torn banner studios refuses to address. they will ban you from their discord, delete your posts in their subreddit and ban you from there too with the excuse of a \"no witch hunting\" rule they claim any exposure of these cheaters is in violation of.\n\nthese cheaters can fly around, 1 tap kill you, spawn entities, flood chat, respawn in place, disable their turn cap, and as of about a month ago, many cheaters have a keybind to CRASH THE SERVER. torn banner has been notified of this by hundreds of players and refuse to take action in nearly any way. if you play email tag with them for 2+ weeks, you may eventually get an individual account banned after providing ample proof. ALL of these cheaters have many alt accounts from previous free to keep deals on epic games and/or will just buy steam accounts with the game for a few bucks. oftentimes banning one from a community server will result in their return just minutes later to say some slurs in chat and crash the server.\n\nthe game is being killed and torn banner won't fix it and won't pull the plug, presumably until their contracts with sony, microsoft and nitrado run out.\n\nit's a great game and there's nothing like it. unfortunately it is crippled by this problem no one can do anything about except TBS who seem pre-occupied with their massive failure no one needed, NMRIH2. hopefully they're secretly working on chiv 3 behind the scenes and we can do this whole song and dance again from the beginning in a couple years.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "At the end of the day, Chivalry 2 will no longer receive updates or support. We have to assume that what we're seeing now is a blip on a downward trajectory. If no improvements are going to be made, then with each day passing from this review I strongly encourage a skip. \n\nA list of a bunch of cons:\n- Game is 8 dollars frequently, DO NOT BUY FOR FULL PRICE. IT IS ON SALE FOR 80% OFF REGULARLY\n- Playerbase is constantly declining, now at the lowest its ever been. Leads to high ping and long queues for players in regions that the game is already dead in.\n- Hacking problem is getting worse every day and there are zero plans to address it. If you see a hacker they are almost never going to be banned so assume you will see them until they get bored\n- Community has a lot of really racist people. Several of the biggest clans in the game have a long history of it, one of the biggest clans has a slur in their name and constantly uses them.\n- If you start now you're essentially cannon fodder. Your skill gap between you and a person who has played since release is so huge that you will not be able to tell if they're cheating or just better. This sucks, because there are a LOT of cheaters.\n- Game will no longer receive updates. Game will no longer receive support. If you buy this, assume it will only be playable for another year or two.\n- Ping can make this game entirely unplayable. If you're above 100 ping when playing other games I'd autoskip this. \n- REPEAT - DO NOT BUY FOR FULL PRICE. IT IS ON SALE FOR 80% OFF REGULARLY\n\nI'll probably keep playing, but that's more out of some compulsion than genuine joy. Highly recommend skipping,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Abandonware with the devs staying silent and mods of both discord and reddit trying their damnest to silence it all",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I would've recommended this game 2 years ago, but the cheating has gotten out of hand and TB has created more routes to enable it. Discussion about how bad the situation is gets moderated with a heavy hand, so new players are largely left in the dark until they buy the game and see it for themselves.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game itself? Fire. Graphics are awesome, gameplay smooth, skills fun to use,  literally feels like a top tier medieval. But the community? Man!! absolute garbage. You clap someone fair and square, and boom, they rage, report, and you’re kicked like you’re the bad guy. 😂 Like bruh, I’m just playing the game. Still giving it 5 stars ‘cause the game slaps, but the players? Nah, they need a patch too. COMMUNITY IS SO BAD ALL CHINESE SHI...",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Really love this game, but it's no longer supported. It doesn't work with newer versions of windows 11 without turning off security features. All they need to do is update the EAC version but it's been broken for months.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game has been completely abandoned by the devs. There's too many cheaters and there's nothing being done about it. \nIt hurts me to leave a negative review because I've been a fan of Chivalry for a long time, but I can't recommend this game in its current state.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Very difficult game in terms of playing againts experienced players. There is no matchmaking system that would set up games based on player's rating. After 20 hours of playing it's still very difficult to compete. I can't imagine how much time it takes to learn the game in order to get enjoy from playing it. My experience is 95% of play time is suffering 5% joy. The game is extremely unpleasent for the newcomers",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is completely unplayable, cheaters in every game. Administration don't really care. \r\nAbsolutely DO NOT recommend to buy!!",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Don't get me wrong: gameplay is amazing. But I've been arbitrarily banned for a year, apparently due cheating, and have been unable to contact support since then. My Steam account is 18 years old and I've never been flagged for hacking at any other game, nor I hack of course.\n\nSo just saying: you can get and enjoy this game, as much as they can simply revoke your access and neglect further explanations. So get it if you want to have a sh*tload of fun, but can cope with being wiped out just because.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I hate to do this but rip chiv, its plagued with cheaters, matchmaking only is getting worse. its a good game but i don't recommend  you play it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "one of the buggiest games and launchers I have ever has the displeasure of using",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A fun game that I can't recommend, full of hackers, and no matter what they tell you, the vast majority won't show you it, but probably do\r\nThey usually use a speed boost and an infinity block/spike or other special ability, and i see it in action as they fight. The others will probably just fly around the map, move quickly, and play with AIMBOT, and even with more stamina.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Chivalry was at one point a great game, probably my favorite game, and it still would be. Were it not in a destitute, decrepit state.  Recent reviews should reflect the current condition of the game. Which is poor. I won't spend time on a general evaluation because there is one, singular issue that absolutely needs to be addressed by the developers.\r\n\r\nCheaters. \r\n\r\nThey are now running rampant in the game. For many months they were present but not ever-present. Obvious cheaters would insta-kill players in one hit, teleport around the map, or fly/run at ridiculous speeds using a god mode. Sly cheaters would have things like infinite stamina or a slightly faster weapon swing speed. But they would get vote kicked from the server. Usually. Now they just crash the server. Every player is booted to the main menu. Or they will spontaneously change the map, thereby resetting the match. \r\n\r\nAs far as I have been able to see. The developers haven't made any effort to curtail this behavior or their ability to implement cheats in-game. The game unfortunately seems to be in an abandoned state. As it stands, if you're playing today, then you will most likely run into a cheater. Essentially being at their mercy. And the cheaters will troll and threaten to kill the lobby.\r\n\r\nIt's a shame because this is, (or was) a great game. A medieval melee battlefield with a side of silly. Easy to learn, hard to master. Now it's just hard to play. \r\n\r\nLook at the players leaving reviews with a lot of hours. They all love the game, as do i. All of the reviews are negative because we are watching this beloved game die.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The negative ratings will continue until moral improves, Hackers are ruining this game. Torn Banner do better please.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Overall, a fantastic game. However, as of last month (october), it's become riddled with hackers and plagued by server issues, rubber banding, etc. In it's current state, it's hardly playable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is good, but the anti-cheat just simply prevent me to play with this game, tried to fix it, did not work.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this game. Do not buy this game.\n\nTorn Banner and Tripwire have lacked either the resources, ability or desire to properly manage this game from day 1. They have deemed the game content complete and will only touch it if it breaks completely.\n\nLast I heard there is one single volunteer responsible for handling every report submitted.\n\nIncreasingly, hackers run the lobbies, or crash them entirely. The aggressive toxicity of the playerbase has thrived, largely unmoderated.\n\nAt this point there is no sign this will ever improve, we've been written off.\n\nDo not beg for Torn Banner to fix this, they have no intention to.\n\nDo not beg for Chivalry 3, it'll be the same shit again.\n\nScream for a new sword game, one made by a developer that can manage it properly.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "These guys are complicit in suicide of Soter Dave and their game is a cheating mess. With players soaring through the air like birds, spawning endless barricades, or simply not dying, ruining fun for everybody.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I WOULDN'T BUY THIS GAME FOR 50 CENTS \n\n\nThe developers have abandoned the game, not just in the sense of not providing continuous content updates, but by COMPLETELY abandoning the game. \n\nCheaters run free rein, crashing servers, and killing players without even touching them. Torn Banner turns a blind eye to the very ones who supported them from the beginning.\n\nAll of their attention and funding was taken from chivalry, and put into a failing zombie game. \n\nThey do not moderate the game at all, the report system is not monitored anymore. Through the discord, the website which directs you to report via game, OR through the game. \n\nInstead of focusing on the very close-knit, niche community they had that were loyal, they fumbled... and dropped the ball. \n\n⚬──────────✧──────────⚬  ⚬──────────✧──────────⚬    \n\nAll in all, if it weren't for the developers ruining the game, then I would have stayed around for Chivalry's life. I have often made this comment to close friends I've made along the way. \n\nThey often found me insane, as the community is a problem too. (maybe if the report system or sending proof worked right?) \n\nI have 1284 hours at the time of this review. All of my other games have 99.8 hours or less... (new steam account)\n\nChivalry 2 was my favorite game that I had ever touched. It is truly engaging in the sense that you have to tune micromovements, rhythm, and constantly adapt to the changing environment. \nLearning through observing other players, and through tweaking your own play style.  \n\nNow all I am left with is me drowning out my inner voice of, \"Is it worth it?\" or perhaps, \"Do I even want to deal with this?\"\n\n⚬──────────✧──────────⚬  ⚬──────────✧──────────⚬  \n\n\nIN THIS CURRENT STATE- I COULD NEVER RECOMMEND THIS GAME. \nWAIT FOR NEXT YEAR, FOR A CHANCE AT A REAL DEVELOPER.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "There a lot of cheater running around, game seems to lack Anti-Cheat. So its left to the community to maintain.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Everyone and their mother are well over level 100 and know every game mechanic so they jump you and bully you making it extremely difficult to even think about enjoying the game without utterly trolling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Save yourself the money this game can barely reach 2000 players a day and sometimes gets below 1000. The devs gatekeep updates for the game and pretty much made the only guy willing to make content for this game off himself",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'd love to encourage people to play this game, but the community has no moderation and actively engages in blatant sexism, racism, ableism, constant political talk, and griefing. It's to the point where chat is just a cesspool of bigotry and spewing propaganda. Any amount of basic moderation tools could fix this, but they clearly haven't been implemented.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If its not blatant cheaters ruining the games in both public and private servers its your own team mates intentionally killing you just to troll. Report system does nothing, If you try to votekick in game they will just crash the server. If you do what Torn Banner asks you to do on reddit, discord, etc. and share a clip with the player ID you will be the one banned. Torn Banner is an absolute joke. Fix your game before its perma dead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Abandoned, hackers, can't join friends in ongoing game, tons of blatant hate speech in the chat too - no wonder they had to mute mics in this game. No more fresh content, either. Really weird decision to abandon their best game in favor of other projects. It's like they actively don't want to acknowledge how great this genre can be.\r\n\r\nChiv 2 should have at least been opened up for modding like chiv 1, to extend it's life.\r\n\r\nIt sucks too, because so far, nobody can compete with them. Mordhau is already dead and there has yet to be an answer by another developer for this genre.\r\n\r\nI really hope someone puts this game to shame one day, because I really love chiv, but torn banner needs a good kick in the pants.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is an amazing game that the devs abandoned over a year ago. It still had so much potential but they left it for another game that nobody even cares about. That wasn't that big of a deal because the servers were still fine and play count is still high. However over the last few months the game has been overtaken with hackers who can cause tomfoolery in the game, messing with spawns, flying around one shotting people, etc. But the worst part is that the hackers can crash the servers now. They've done something to prevent servers from filling up, and then when they do, a hacker can just crash every single game. \r\n\r\nAnd the devs & mods of the Chivalry 2 subreddit will straight up ban you for even talking about it on reddit. It's ridiculous. The mods of that place are a bunch of weenies, and I hope they read this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Abandonware to the point there is an issue that prevents the game from being playable. Every windows update you have a chance to get this unfixable error. Devs are gone and dont care. Game should be removed from steam.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Plenty of Cheaters, They just teleport around and do the objectives or are immortal. If you get into a game that has no cheaters, the balancing of players is as terrible as expected. \n\nGeneral player base isnt terrible but you do have the occasional Ahole like most games though so that isn't a huge issue. I mean half the players don't talk though.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}