{
  "positive": [
    {
      "review": "Great software! I first tried using this 3 years ago, but I was quite confused using this, but now since I now have a bit of experience with 3D animation, this was so straight-forward. However, it is still beginner-friendly, as I am still a beginner myself. I even made a cool car animation where it repairs itself. (Totally not a reference to my most favorite horror movie lol)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i have only used the app for 4 hours and i learned a lot but i learn quickly, so if you have at least 500 hours to spare for learning to use the app then yea i think you should get it but if you have a full time job or cant spare the time then this might not be the app for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i have always been obsessed with animation and becoming really good at it. i even learned i had a bit of talent at the start, managing to do walk cycles that didn't look like poopy in my first month of animation. but the challenge of animation needs a lot more than talent, especially when models have flex decay (fmllllllll). but even with the errors, crashing, flex decay, occasional audio issues and glitches that add movement that shouldn't be there, when it works it's unbelievably rewarding. i've heard many say it's too much struggle for not enough reward, but to me, the reward is there, every subtle motion is a shot of dopamine, every jump or step that transitions smoothly to the next is like a soiree in my frontal lobe. it's something i can hyperfocus on and before i know it, i've been on the software for like 9-10 hours straight. i wouldn't recommend this unless your patient, willing to learn, and understand thaat when you're frustrated, use that time to breathe, and relax, think in your head how you can fix the issue, or look it up online, there are sources everywhere that have nearly every aanser for sfm and it's \"issues\".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is really a nice software making different posters and animations. it's like not that hard compared to blender XD\n\nthis one is more chill and very old. but still usable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's fun but very confusing getting to know what everything does",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Doesn't work for linux, and sometimes you need to figure out some settings so it doesn't get screwed up, but it's amazing for a free software. Quite beginner friendly I'd say. currently looking to get it working on linux though. Heard it's possible.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Even know it is a very old software it is still very good. It sure crashes alot so 4/5 stars just perfect!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy to learn and streamlined, but also very limiting in what you can do\ncant fully utilize the source engine exactly as advertised either",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "source filmmaker is a great and free app to use if you want to animate this was really fun to play around with and make some animations although every time i want to change the tf2s skin to team blue or anything else it wouldnt really work and i couldnt really use the f11 button to switch game modes but i think its only because of the computer im using anyways this app is great for animations and you should try it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite possibly the most fun animation program to ever use. It can make very high quality animation very easily. Although the quality might not be as good as things like Blender, it's VERY fun to animate with it and the quality in some animations is GORGEOUS. It is very fun to use it and while it will take some time to learn how to use it, once you learn it, it's easy. Overall, my favorite animation program EVER. And best of all, it's FREE. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a really good game that you can animate that can teach you like im new and i played it a bit and im good at animating now try the game is fun and will teach you how to animate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this app, it is actually my favorite app on my pc and I rate it 9/10. The only issue about this is that at some points when launching it, the entire window is just a white screen and the top of it says that sfm is not responding, but that is at some points though. I recommend this software to people who like making animations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool, can be confusing at first but once you get a hang of it , its gonna be hella fun// nice community 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very useful / fun to mess with at times. But god it makes me want to destroy my whole computer and pc setup. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for storytelling! still getting used to all the editors and figuring out movement but its super fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very easy to learn, although pretty hard to animate as well as people like lazyP and Soundsmith lmao, totally recommend for people who want to start 3d animation. Also, renders require proper lighting people remember that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun, hard but worth it and has some annoying problems but solvable \"most the time\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for art reference, recomending for every artist very much",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better not f***g crash again sfm...im watching u\r\nWith more practise u can make animations better than blender quality....nothings that impossible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soo good for animating. There is SOME bugs tho! Buuut, thats because its kinda old, bugs ain't that bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "shit makes me wanna blow my brains out but the particle editor is pretty fun sometimes>\r\n8/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ancient Software that hasn't been updated in years, but that also means that nothing will change and there are plenty of tutorials online to learn how the basics. Amazing for making shitty posters if you're like me, or making masterpieces of animation like any other talented person.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it may be buggy, it may be stressfull but as a beginnig point it's one of the best there it if you just wanna animate what your heart diseries",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good animating software, relatively easy to learn but pretty janky, but if you get use to the jankiness\r\nyou could make some pretty good masterpieces.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W program, miss messing with this shi but imma lock in and start using it again soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A little hard to master but easy to get the basics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its keeps crashing out. but i love it anyways",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really wish the developers update source filmmaker, because a lot of creators are leaving because some the bugs are almost unfixable to fix and they kept coming back without a noticed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fucking hated every hour, of every minute, of every second using this application",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it runs insanely perfect no lag or crashes at all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great, expect sfm to crash a couple times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun even though im not good at animations I still had fun with this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good animating and awsome community 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "REALLY fun when you get the hang of it. (downside: having to place EVERYTHING before animating)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sfm is fine for Source related stuff but blender is better overall. blbllblb",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very nice! This program is very useful for making arg's!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good i highly recommend to anyone wanting to start 3d animation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SFM, is a very well put together animation software.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It does the job but because it's fucking ancient it likes to kill itself from time to time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]PERSONAL REVIEW[/h1]\n\n[h3]Negatives:[/h3]\n[list]\n    [*]Manual Update [spoiler]Because Valve seems to forgot this[/spoiler]\n    [*]Sometimes Crash [spoiler]Due to Models[/spoiler]\n[/list]\n\n[h3]Positives:[/h3]\n[list]\n    [*]Posters / Background [spoiler]Profile Pictures, Etc.[/spoiler]\n    [*]Simple Mechanics [spoiler]Unlike Blender[/spoiler]\n    [*][spoiler]Making ████[/spoiler]\n[/list]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 i can make scout figth gman while heavy is eathing sandwitch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Any time i use this program at least 1 tear will fall from my face..   10\\10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sfm has stood the test of time as one of the best animation softwares outthere",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i accidently set my computer on fire while trying to learn how to use this\n\n10/10 i have no idea what im doing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'LL NEVER TURN TO THE DARKSIDE!!! NOOO!!! YOU CANT MAKE ME YOU CANT MAKE ME YOU CANT MAKE ME-RRRRAAAAAAAAAAAAAA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HAVENT QUITE FIGURED IT OUT BUT STILL ENJOY WHAT LITTLE i CAN DO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is cool. But it's mean game for 3D animators..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like gmod but you animate instead",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "W Software, this is helping me a lot, Thanks for Valve for making this software 🗣️🔥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's good but i have no idea how to use SFM",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you want a ez cool animating use this free and there is free models",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it do Source work and it films. Very Filmy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for makign animations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can crash sometimes but still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing creative outlet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have no clue how to use this program, but it seems nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for simple hobbies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny animator software",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "breaks but is overall good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very amiai software +rep",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it may kick me out alot but its peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i dont know how to use it but to those who know this is a easy 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This thing really needs an update like i need this my mom is kinda homeless",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too complicated",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty fun, just needs patience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like to use sfm I never used blender",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HAAAAAAAAAAAAAAAAA!!!!! I AM BULLET PROOF!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best ever used old 3d render.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "crash one more time and i kill myself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for Modeling Images (:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "id say i spent too much time making fnaf shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool lil bug though..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome movie-making software",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "твердые 10 бутербродов из 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice im bad at animations soon ill get good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good to use really hard to learn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Animation feels nice as an ice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love it ive only spent 230 hours i need to learn more",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this app its easy to animate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its EVIL but good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its super good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rat bitch bata male",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "how the fuck do i start using it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "u can make tf2 and l4d yaoi its peak",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I fear no man.. but that thing.. it scares me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its sfm so gud",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a cool animating software",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "all of my hours are spags",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i do recommend this if you like posing  or animating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "baptism by fire :,)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "let me out of this never ending hell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awsome helping me with my channel",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can make cool crap in this thing!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "How did I make it 1000 hours with this thing",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Sfm is great in general. Except that it's buggy as hell and every other click is almost guaranteed to crash it. I often place one object for two hours",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "SFM is crashing for a lot of AMD users right now. Adding in a single light can cause crashing after the October driver update. \n\nIf you're suffering from this, try rolling your drivers back. But if you don't feel comfortable doing that- Then that's probably a GGs.\n\nNot sure if it'll ever get patched considering how old SFM is. Best advice is move on to blender. You wont regret it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so bad it does not support my screen size and makes everything small takes 5 hours to learn anything and is not compatible at all\nfuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate this program on jesus and on god but it is an eternity easier to use then blender or any other animation software.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "all i see is a screen with words on top that says \"files\" and stuff like that, i want the old SFM back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I almost finished with posing and sfm fucking crashed again and now everything is fucking reset",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Laggy excuse of a program. Embarrassing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just use blender instead, for your own good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please open source SFM or fix it this hurts me inside to use",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "there is nothing to do the sfm is blank",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I fear no man. But this thing, it scares me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it won't let me use it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gee whiz maps just won't load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck  this bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT GOOD!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ITS TOO LIMITING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Если честно, это кал.[/h1]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "janky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sfm is great in general. Except that it's buggy as hell and every other click is almost guaranteed to crash it. I often place one object for two hours",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "honestly its a amazing software to use but i just recommend blender due to how unstable this software is it crashes 24/7 and loading can take a while if you import tones of custom models maps or sounds it is great for learning basic modeling and animating but i will most likely change my review if they fix the bugs and the crashing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SFM is crashing for a lot of AMD users right now. Adding in a single light can cause crashing after the October driver update. \n\nIf you're suffering from this, try rolling your drivers back. But if you don't feel comfortable doing that- Then that's probably a GGs.\n\nNot sure if it'll ever get patched considering how old SFM is. Best advice is move on to blender. You wont regret it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so bad it does not support my screen size and makes everything small takes 5 hours to learn anything and is not compatible at all\nfuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate this program on jesus and on god but it is an eternity easier to use then blender or any other animation software.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it keeps glitching and beibng ike its kothers cunt it wont let me put more models in when im trying to make something",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all i see is a screen with words on top that says \"files\" and stuff like that, i want the old SFM back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh, it crashes anytime I play even after verifying and uninstalling + reinstalling. It's probably a good tool but not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I almost finished with posing and sfm fucking crashed again and now everything is fucking reset",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have no idea what to do and i am too impatient to watch a tutorial but i hear its really great",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im trying to animate after i watched majority of their vids but my screen is stuck grey ts so annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just use blender instead, for your own good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please open source SFM or fix it this hurts me inside to use",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glitchy program. Gets the job done, but feels neglected..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there is nothing to do the sfm is blank",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I fear no man. But this thing, it scares me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it won't let me use it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gee whiz maps just won't load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck  this bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT GOOD!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ITS TOO LIMITING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Если честно, это кал.[/h1]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "janky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sfm is great in general. Except that it's buggy as hell and every other click is almost guaranteed to crash it. I often place one object for two hours",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "honestly its a amazing software to use but i just recommend blender due to how unstable this software is it crashes 24/7 and loading can take a while if you import tones of custom models maps or sounds it is great for learning basic modeling and animating but i will most likely change my review if they fix the bugs and the crashing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SFM is crashing for a lot of AMD users right now. Adding in a single light can cause crashing after the October driver update. \n\nIf you're suffering from this, try rolling your drivers back. But if you don't feel comfortable doing that- Then that's probably a GGs.\n\nNot sure if it'll ever get patched considering how old SFM is. Best advice is move on to blender. You wont regret it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so bad it does not support my screen size and makes everything small takes 5 hours to learn anything and is not compatible at all\nfuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate this program on jesus and on god but it is an eternity easier to use then blender or any other animation software.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it keeps glitching and beibng ike its kothers cunt it wont let me put more models in when im trying to make something",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all i see is a screen with words on top that says \"files\" and stuff like that, i want the old SFM back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh, it crashes anytime I play even after verifying and uninstalling + reinstalling. It's probably a good tool but not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I almost finished with posing and sfm fucking crashed again and now everything is fucking reset",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have no idea what to do and i am too impatient to watch a tutorial but i hear its really great",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im trying to animate after i watched majority of their vids but my screen is stuck grey ts so annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just use blender instead, for your own good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please open source SFM or fix it this hurts me inside to use",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glitchy program. Gets the job done, but feels neglected..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there is nothing to do the sfm is blank",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I fear no man. But this thing, it scares me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it won't let me use it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gee whiz maps just won't load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck  this bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT GOOD!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ITS TOO LIMITING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Если честно, это кал.[/h1]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "janky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sfm is great in general. Except that it's buggy as hell and every other click is almost guaranteed to crash it. I often place one object for two hours",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "honestly its a amazing software to use but i just recommend blender due to how unstable this software is it crashes 24/7 and loading can take a while if you import tones of custom models maps or sounds it is great for learning basic modeling and animating but i will most likely change my review if they fix the bugs and the crashing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SFM is crashing for a lot of AMD users right now. Adding in a single light can cause crashing after the October driver update. \n\nIf you're suffering from this, try rolling your drivers back. But if you don't feel comfortable doing that- Then that's probably a GGs.\n\nNot sure if it'll ever get patched considering how old SFM is. Best advice is move on to blender. You wont regret it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so bad it does not support my screen size and makes everything small takes 5 hours to learn anything and is not compatible at all\nfuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate this program on jesus and on god but it is an eternity easier to use then blender or any other animation software.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it keeps glitching and beibng ike its kothers cunt it wont let me put more models in when im trying to make something",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all i see is a screen with words on top that says \"files\" and stuff like that, i want the old SFM back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh, it crashes anytime I play even after verifying and uninstalling + reinstalling. It's probably a good tool but not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I almost finished with posing and sfm fucking crashed again and now everything is fucking reset",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have no idea what to do and i am too impatient to watch a tutorial but i hear its really great",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im trying to animate after i watched majority of their vids but my screen is stuck grey ts so annoying",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just use blender instead, for your own good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please open source SFM or fix it this hurts me inside to use",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glitchy program. Gets the job done, but feels neglected..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there is nothing to do the sfm is blank",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I fear no man. But this thing, it scares me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it won't let me use it!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gee whiz maps just won't load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck  this bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOT GOOD!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ITS TOO LIMITING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Если честно, это кал.[/h1]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "janky",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sfm is great in general. Except that it's buggy as hell and every other click is almost guaranteed to crash it. I often place one object for two hours",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "honestly its a amazing software to use but i just recommend blender due to how unstable this software is it crashes 24/7 and loading can take a while if you import tones of custom models maps or sounds it is great for learning basic modeling and animating but i will most likely change my review if they fix the bugs and the crashing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "SFM is crashing for a lot of AMD users right now. Adding in a single light can cause crashing after the October driver update. \n\nIf you're suffering from this, try rolling your drivers back. But if you don't feel comfortable doing that- Then that's probably a GGs.\n\nNot sure if it'll ever get patched considering how old SFM is. Best advice is move on to blender. You wont regret it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so bad it does not support my screen size and makes everything small takes 5 hours to learn anything and is not compatible at all\nfuck you",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate this program on jesus and on god but it is an eternity easier to use then blender or any other animation software.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "it keeps glitching and beibng ike its kothers cunt it wont let me put more models in when im trying to make something",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "all i see is a screen with words on top that says \"files\" and stuff like that, i want the old SFM back",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Meh, it crashes anytime I play even after verifying and uninstalling + reinstalling. It's probably a good tool but not for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I almost finished with posing and sfm fucking crashed again and now everything is fucking reset",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}