{
  "positive": [
    {
      "review": "I enjoyed playing Dragon Age: The Veilguard, but it comes with a set of caveats that echo elements found in the many negative reviews. Such is the nature of this very binary way of reviewing. I'd give it about a 7-8/10 based on fun playing, but within the context of Dragon Age and through a critical lense more like a 5-6/10\n\nThis game is best understood when taking into account its troubled development. The original concept for DA:V was scrapped when EA wanted to turn the sequel to Inquisition into a live service game. And that decision, even though it was reversed after Anthem utterly flopped and EA backtracked, reverberated through the final version of DA:V we got since Bioware did not get to start from scratch. \n\nEA gave them only about a year to remake it into a traditional singleplayer RPG. It ultimately still took 3-4 years, but working with constant short-term extentions limited the scope of what the game could have been. If they had been given the 3-4 years they actually needed upfront, they could have been more ambitious. \n\nMoving onto the actual game now. Visually speaking it is stunning. There are many, really cool ideas here. But it all feels underutilized. Rarely do these ideas transcend window dressing. That makes sense, since a live service title puts less emphasis on the link between the narrative and visual design. Some areas also look a bit overdone or don't feel like they fit, especially with the older games. It's all a bit too vibrant. The dark fantasy setting of DA:O and DA:2 was reinforced by their oppressive visual style and it worked. Despite the stakes being the highest ever, it doesn't feel like it. The more lighthearted tone of a lot of dialogue also undermines it. This often feels a lot like the Guardians of the Galaxy (the game). That's not to say it can't be enjoyable, because GotG is fantastic, but choosing this route means losing a bit what made Dragon Age stand out.\n\nThe narrative also heavily suffered from development choices. Because they lacked time, they went for a very traditional and safe good versus evil story. That contrasts heavily with the older titles where there was a lot more room for grey morality. Or evil in general. I never did it but you could be a blood mage in this franchise once upon a time. There were multiple ways to approach dialogue and choices depending on background. Now backgrounds have no impact whatsoever. More importantly, they fumbled the set-up of Inquisition with Solas, which would have been a very interesting antagonist. He's still involved of course, but a lot less than could've been. Perhaps with more time to write a story...?\n\nWorld building, which includes companions, factions & other side quests suffers from the same issue of rushed writing to just get something out of the door. The Lords of Fortune have no substance whatsoever and appear to only exist to justify the work they had already put into Rivain-related assets as a backdrop. Minrathous is relegated to Dock Town and everything goes through the Venatori, the subfaction they invented in the last game. Nothing new got explored in the first time we ever come here? The Qun is completely absent, replaced by their military arm that serves as nothing more than goons for the villain. The crows have also been sanitzed. Remember when Zevran talked about being bought as a child slave to be trained as a crow? Where have all the interesting factions gone?\n\nLikely due to time constraints we explore the factions through the companions. Without their quests, the factions have no substance. This is different from the past. You didn't need Oghren or Mynne to experience Orzammar or the Circle in DA:O or Blackwell to experience the Grey Wardens in DA:I. You had faction storylines and companions treated seperately. That's not the case here, with a loss of depth for both as a result. The villains of the subplots were cool, but felt underbaked too.\n\nAnother casualty of EA mismanagement were choices, a core pillar of Dragon Age. You have 1 really small choice about 5h into the game. Another big one at the end of Act 1. Then virtually nothing until the final 10h when you're wrapping up all companion stories and the game itself. In fact, the game lacked choices at all because of time constraints and because a live service version didn't need those. So most choices here were shoehorned in late in development to check the box, and most pertain to companions and have no impact on the world. A stark contrast to the legacy of the franchise.\n\nThe game also suffers from a flawed design choice. All storylines run at the same time and conclude at the end. Unlike DA:O, where you could go to Redcliffe first and wrap that up before moving on, or the various Acts in DA:2, nothing really gets concluded in the first 50 hours. That introduces a lot of tedium in the bulky middle section of the game. I felt burned out by hour 30, but liked the final 10-20 hours. It's a slow burner. \n\nAll of that said, the gameplay is vastly more enjoyable than any of its predecessors (although it lacks depth). It also runs well, looks fantastic & feels very polished. I did like the companions and their arcs, and there are multiple main story sequences that are genuinly very well done. Weisshaupt & the ending sequence are highlights of the franchise and there a few plot developments at the end that deserve praise too. But it is not enough to salvage the game.\n\nSo I'd say the game can be a fun and enjoyable adventure, but with the warning that it's not a slam-dunk success on all fronts, with wasted potential as possibly the final game in (this chapter of ) the franchise (?). \n\nYou can thank out-of-touch EA-executives for that. Special shoutout to braindead EA CEO Andrew Wilson for claiming after release that this game failed commercially because it lacked live service elements. The whole reason it flopped was because of your earlier decision to go for live service & unrealistic deadlines, which kneecapped the potential this game had from the very beginning.",
      "voted_up": true,
      "votes_helpful": 106
    },
    {
      "review": "Really and honestly, the game doesn't look or play like Dragon Age. \n\nIt just doesn't. \n\nHowever, what IS here is a fun and engaging gameplay and story. \n\nif you can leave any expectation at the door, you'll have a good time and enjoy the ride. If not, well, it might be better to pass on it, as it really doesn't feel like a follow-up. \n\nThough, if I'm honest, I've been saying that about every Dragon Age game after Origins/Awakening. \n\nNeither 2, nor Inquisition felt anything like the previous game(s) so this one being different is, ironically, on brand. \n\n\nIt IS a fun game, just not as deep or consistent as previous games or stories. Its the Saturday Morning Cartoon version of the original.\n\nEdit: I've put about 3x as much time into the game now as when I wrote the review. Honestly, still really liking it. But going to revise it. Its less Saturday Morning Cartoon, more Marvel Movie. \n\nIs it as good as Origins? No. But I like it better than 2, and honestly, I like the gameplay more than Inquisition, though I feel Inquisition's story was better. \n\nOne of the things I like about it is the content feels Dense. The game doesn't feel like it wastes my time. \nI have a lot of open world fatigue these days, and playing Veilguard feels rewarding on a moment to moment basis. I don't love all the characters, and some of the areas feel iffy, and the gameplay has some weakpoints, but overall it fits together into a game I'm consistently coming back to and already planning my next playthrough. Something that doesn't happen much these days.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "I understand the sentiments behind the criticism for this game, but I personally am enjoying it wholeheartedly - no matter the teenage superhero-based sense of writing and overall black and white good-versus-evil narrative. Origins will always remain the best Dragon Age to date, but there is something to like about all instalments of the series, at least for me.\r\n🟢 \r\nThe graphics in this game look incredible, both when it comes to character models and viewscapes and landscapes. The sound quality of the sound effects and ambience are overall from 7 to 9 out of 10. The combat in this game diverges from the tactical-oriented micro-managing real-time turn-based combat the previous instalments in the sense that it's mostly an action game now, where the only application of time-oriented tactics is when you open the spell menu to produce chain-combos with your companions. Plainly put, the combat is quite similar to Mass Effect 3, minus the whole shooting and taking cover mechanic. Imagine Dragon's Dogma 2 intertwined with Mass Effect 3 and you get Dragon Age The Veilguard in the sense of combat. \r\n🟡\r\nThe music isn't bad, but it's a bit too superhero-themed, which goes against the said narrative of the first game of the series. The plot and sense of progression is linear, since the game follows a said narrative and isn't an open-world rpg like Inquisition. Specific gamers have specific tastes, so this change of storytelling might not be to everyone's liking.\r\n🔴\r\nUneven storytelling writing quality. Specific said lines and moments are mind-jarring, while others - not as much. Sometimes it can even get quite good. Prevalent black-and-white ''good guys save the world from evil'' sense of narrative. Your choices mean literally nothing in this game. Barely any of the choices you've made in Inquisition matter here (which are all handpicked, rather than transferred through a save file, because they are literally the only ''choices'' that bear fruit in Veilguard). Hawke and the Gray Warden protagonist from Origins are simply not relevant to this game, which sucks, even if their arcs are concluded. Dialogue options differ from temperament modality. 1 = ''I agree with you completely!'' 2 = ''I agree with you sarcastically'' 3 = ''I agree with you contemptibly''. Proper roleplaying is simply not possible here due to the lack of adequate variety to the dialogue wheel, unlike the Mass Effect Trilogy (1 and 2 mainly). \r\n\r\nTo conclude my personal overview of this game:\r\n\r\nIf you buy it without it expecting to live up to Origins's standards, then you may not be entirely disappointed by it. If you buy it after finishing a run on Baldur's Gate 3, then buckle your seatbelts towards the grand road of disappointment and boredom ahead of you. If you just want a cool action game, where you can make a pretty prince or princess to kill evil demons as, then this game might just be your cup of tea unironically. Make sure you assess the game for yourself before you buy it, rather than go in blind, and know what your expectations are.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "I've been a DA fan for years and have played all the games. The hate this game got at launch was totally unwarranted, in my opinion, and while I don't like everything they did with the game, I'm very happy with what was made. (I actually have hundreds of hours in this game on PS5, but due to circumstances bought it on Steam, too.) \r\n\r\nThe graphics gave me pause initially, because I expected something that looked more like Inquisition did, but they grew on me once I gave them a chance. I find the combat incredibly fun and engaging, though I've only played rogues and mages (sorry, warriors are boring). Some of the specializations for each class are better than others, and I've found that there's at least one weak one for each class (both in the sense that the specialization abilities/ultimates actually do less damage than others, but also they're just not as interesting/flashy). That's not a huge issue for me, though, so I don't really care all that much. \r\n\r\nThere are certain binary choices that irritate me, just because I'm someone who wants to save everyone if I can, so I wish I was at least given the option to do that if I wanted. That, again, is something I don't hate, however, and is therefore not an issue for my enjoyment. I LOVE the companions, all of them. They feel more alive and real than many of Inquisition's did, more like how DA2's companions did. Some of the romances are better than others, but again, not a dealbreaker. (That's what fanfiction is for.)\r\n\r\nTL;DR I love this game! The combat is fun, the characters are interesting, the graphics are pretty to look at, and the story is entertaining. It's not quite the game I wanted or was thinking about for the last 10 years, but I'm happy with it how it is. I only wish it did better so the chance of another one being made was higher.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I loved it. I think it could have been darker and the relationships could have been a little deeper, with more freedom of interaction with them as well. But overall I loved the game and think it was a interesting addition to the storyline of Dragon Age.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "The game was enjoyable and fun to play but it was also overly simplistic with basic dialogue and linear exploration. If you're wanting to play something like the old Dragon Age games then you'll be very disappointed. I was glad I played it but I won't be replaying.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Very enjoyable experience overall! The combat was fun and engaging, I loved all the companions, and found the storyline to be relatively solid. \nFinished the game and immediately went in for another playthrough, enjoyed it even more the second time around and noticed lots of little details and foreshadowing I missed the first time.\nThe writing definitely doesn't quite reach the level of the previous games and does feel a bit clunky at points, especially some of the dialogue. I found the relationships with your companions feel a bit more shallow in this game as well. \nIt is far from being the best game in the series (which is obviously DA2), but regardless, it was still highly enjoyable to play. \n\n*Edited to add more detail*",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This is an incredibly smooth action adventure game with some interactions that matter depending on what choices you make. All in all, its a very good story driven game. \n\nI've been taking my time with all the side missions and this is a game I keep coming back to. Currently playing a rogue on my first play through and will likely do another with a warrior. \n\nYes its a departure from the other entries but it still is a really good game and I'm having a lot of fun with it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Starting with what it does well:\n\n++ This game has some of the best level design I've ever seen. The many different areas look incredible, are very detailed, invite you to explore and set a very fitting mood/atmosphere.\n\n+ Combat is very action oriented and I like it. It feels a lot like God of War, always keeping you on your toes, you need to dodge and parry a lot.\n\n+ Perfect balance between fighting and exploring.\n\n+ Graphics/animation and music/sound/speakers are very good. The intonation of the speakers is sometimes off a bit though.\n\nNow to the bad:\n\n-- Writing. It's 90% just horrible. It get's a bit better the more you progress but this is the first rpg I coudn't stand the dialogue (or the companions) so that I now mostly skip it completely.\n\n-- Companion design. There's one companion (Lucanis) I feel neutral about, maybe I even like him a bit. The rest ist just an annoying, unlikeable and dull bunch of forgettable and uninteresting characters. \n\n-- \"Crafting system\" and crafting mats. It's so forced and superflous. Crafting mats are placed literally everywhere and picking them up just destroys the flow of the game. You got an intense and dramatic segment? Be prepared to have crafting mats littering all over the level. It's nothing special finding them, you just run there and press \"E\" and it becomes an annoying trudge very quickly.\n\n--> I didn't mind the \"wokeness\" of the game. It was presented by many at release as the worst but besides all characters having a slightly gay touch I can live with it. I will not get used to black dwarfes and elves and the usual forced diversity that just feels unnaturally but I can live with that as well. \n\nI enjoy the game because it's very well crafted, but the terrible writing just pulls it down into mediocrity.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Talk about a game that’s massively over-hated, huh? The way people were talking about this game before I started playing it, I assumed anything less than the game pissing in my breakfast cereal, slapping my mother in the face, and melting my PC into molten slag would have been a blessing. Then I sit down to play the game, and the entire thing is just fine? It’s exactly what a BioWare RPG is, except it’s also the first BioWare RPG that looks good and is fun to play. Yeah, sorry to the version of you stuck in 2010 who thinks [i]Mass Effect 2[/i] and its love of gluing you to a wall to play a pop-up shooting gallery is the peak of BioWare’s game design. \n\nAnd that’s sort of the crux of the issue with [i]Veilguard[/i]’s. People are treating it like it’s some affront to an old standard of BioWare games and writing. Go look up the cutscene where Shepard and their two companions see Sovereign for the first time and talk to it. This is from the period people consider to be BioWare’s creative heyday, and the first interaction with Sovereign is considered one of the coolest story points in [i]Mass Effect[/i]. Your companions’ dialogue sounds like it was written (and acted out) by a bored teenager. Sovereign has some cool lines, but it’s essentially reading off its copy of a generic villain thesaurus. The point is, BioWare games from the studio’s heyday aren’t written as well as people like to remember, and [i]Veilguard[/i] isn’t any worse than that level. Legitimately, the worst it gets is when a few characters say “non-binary”, which is jarringly out of place in a fantasy game, but let’s be honest, that’s all people are really getting mad about here. They’re just using it as an excuse to dump on [i]Veilguard[/i] when they wouldn’t do the same for the games they played when they were teenagers because those games didn’t “have pronouns”. \n\nMoving to the gameplay, yeah, it’s the first BioWare game that’s actually fun to play. Every game they released feels kind of bad at best and [i]really[/i] bad at worst. Seriously, it’s wild to know that [i]Mass Effect[/i] came out in the same year as [i]Halo 3[/i] and [i]Mass Effect 2[/i] came out in the same year as [i]God of War III[/i]. It really puts into perspective how far behind BioWare had been when it came to making video games that felt fun and interesting to play. While other studios that made fun games were generally able to catch up to—and often surpass—BioWare in writing quality, BioWare struggled to beef up its biggest development weaknesses. \n\nThat issue that’s been spanning decades has finally been addressed in [i]Veilguard[/i]. The combat is fun, flashy, and has simple enough combos that it doesn’t feel like I’ve suddenly been transported to playing [i]Street Fighter[/i]. The game’s primers and detonators work well, and my AI companions were always great about setting up primers. It all flows in combat well. Even pausing the game to pull up your companions’ abilities didn’t feel like it pumped the brakes too much, and with the token attempt at “squad management” that had been an annoying “feature” in past BioWare games pleasantly gone in [i]Veilguard[/i], it doesn’t feel like I have to babysit what my companions are doing every few seconds. \n\nAnother thing I’m glad they moved away from is the weird, semi-open world design from [i]Inquisition[/i]. Those semi-open world environments made the game feel like sections were cut out of an MMO and placed into a [i]Dragon Age[/i] RPG. They always felt weirdly empty with their enemies barely scattered around huge swaths of nothing. It felt like BioWare was pressured to take advantage of the new console hardware at the time, and the result was a bit of a boring, sloppy mess. \n\n[i]Veilguard[/i]’s areas can feel a little disconnected from each other thanks to the game’s hub-and-spoke design, but functionally, it’s not any different than a forest biome magically turning into a snow biome like most other games. While they feel disconnected from each other, each area is richly detailed and pretty to look at, with plenty of loot to find tucked away in some hidden chests. Whether that loot is any good is a matter solely determined by the gods, and it was a little disappointing whenever I went out of my way to unlock a chest full of garbage. As someone who goes out of his way to look for secrets and engage with side content in a game, this gradually gets more and more annoying since most of the gear I was finding wasn’t better than what I already had. \n\nWhile some of the side content irked me, the story does its job. You accidentally release a pair of gods, those gods want to cover the world in goop and tentacles, and you’d rather they didn’t do that. One thing I appreciate is that the player character, Rook, is essentially just a normal dude who horrendously botched a mission they were hired to do. This, apparently, means Rook is completely responsible for the fate of the world. You gather your party of characters gradually through the game, which is pretty standard for a BioWare RPG. \n\nThe companions were all fine. They all have their own distinct voices, which is a testament to solid characterization that’s unique to all of them. As anyone who has played a BioWare RPG would expect, they have their own side quests that flesh them out more, and I appreciate that they’re not fully spilling their life stories right out of the gate like in [i]Mass Effect: Andromeda[/i]. More importantly, I was interested in their backstories and how their quests ran parallel to the main story. \n\nActually, I [i]really[/i] liked how that part of the questing was structured. You aren’t blasted with ongoing side quests and content right out of the gate. Those quests unlock gradually as you progress through the main story, which makes them move alongside the main story at a reasonable clip. Instead of being able to blitz through a side character’s story in a few hours, leaving them feeling like they’re hanging off the overarching narrative, they sort of move along with the overarching narrative, which helps everything feel a little bit more connected together instead of multiple quest lines feeling like they’re happening in a vacuum. \n\nThe game’s an easy enough recommendation at the end of the day. It certainly wouldn’t have broken my top games of the year in 2024, but it wasn’t anywhere near [i]Black Myth: Wukong[/i], which was the miserable low for the year. [i]Veilguard[/i] ticks all the boxes it needs to be competent across nearly every level of design, but is also almost remarkably unsexy and doesn’t push any boundaries whatsoever.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "With all it's flaws and backlash from others, I enjoyed the game and the storyline. Although there are definitely areas of improvement I still highly enjoyed it and think if you are continuing your Dragon Age journey to give this one a play~ Also this is my first ever posted review which shows how much I love this franchise!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Amazing game, can't believe all the negative comments.  Now I'll have to play origins to see why.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I do not hate it, but it is definitely not my favorite Dragon Age. The world still looks amazing, the characters still argue like they are trapped in the world’s longest group project, and there is enough magic flying around to power an entire fantasy city… if anyone would actually agree on how to use it.\n\nCombat feels exciting, even though half the time I am not sure whether I am saving the world or just aggressively redecorating it with fire. The dialogue is fun, though occasionally someone says something so dramatic that I need a moment to recover from the secondhand stress.\n\nI enjoy the game, truly. I just sometimes pause and think, “Was this the plan all along, or did someone improvise halfway through and now we all have to pretend it makes sense?”\n\nStill, I am absolutely going to finish it. Because if Dragon Age has taught me anything, it is that even when I am confused, overwhelmed, and questioning every decision… I will be back tomorrow for more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I started playing this game with a lot of apprehension because of the criticism it received, so perhaps it was because I expected the worst and didn't get it that made me actually enjoy the game quite a bit. \n\nFirst, here is what didn't work:\n1) A lot of the exploring is soft locked until later in the story when you get specific quests. In itself, that's a great idea, because it means that even regions you've already been to feel fresh and exciting until the very end of the game. My gripe is very specific. WHY show me chests and collectibles that I cannot obtain until much later in the story on the map? With so many puzzles in the game, it is reasonable to assume as a player that if something is locked behind a barrier of some sort, perhaps you simply have to figure out how to get rid of that barrier. And in about half the cases that's true, so it doesn't really help that when it isn't, I wasted a good 20 minutes on trying to get to a chest, only to give up and be given access 10 hous later. This might not be a major complaint for most, but I'm a completionist and this was extremely annoying to me. \n\n2) The storytelling has some major problems. \nFirst of - the main story isn't the issue, it's fine. Like all DA games, it's about saving the world from a terrible, magic and mystery induced evil. Problems only arise when you zoom way in.\n \nBad Dialogue: You mostly have three dialogue options a la Dragon Age 2. But while all of the dialogue options were pretty well written in that game, in this game I can only described some of the lines you get with the \"funny\" dialogue choice as deeply millenial and painfully unfunny. When it isn't that, the \"positive\" options sometimes make me feel therapy talk. \nShoutout in this regard to Bellara, who is just the amalgamation of every \"quirky neurodivergent girl\" stereotype, (call is coming from inside the house).\n\nWhich leads me to my next issue: The companions, their interactions, their stories. \nThe fundamental flaw with nearly all companions is that they start off their journeys pretty much already a great person with some inner insecurity or struggle they have to overcome. They and the faction they belong to are sanitised to an insulting degree. Insulting because it is clear the writers thought the players cannot be trusted to approach difficult topics with any sort of nuance. As an example: You meet Taash, a Qunari belonging to what looks like a pirate faction, but don't worry, because Taash reassures you that unlike actual pirates, they make sure that they approach grave robbings with the appropriate amount of cultural sensibility, and that any artifact with cultural significance end up with the people it belongs to. And they of course keep in mind the power dynamic of oppressed peoples while they're doing so. So. instead of having Taash have some realisation that maybe grave robbing hurts some people and have that be part of their story, don't worry, because they never have to question anything, because all the moral quandries that come with being a pirate have been magicked away. Which makes their character that much less engaging. \n\nEvery other topic they mention - sexuality, slavery, discrimnation - is given much the same treatment. For a city run on slavery, you barely see any slaves or the impact of slavery in Minrathous. You never experience discrimnation as an elf, even though we learn that massacring entire elven ghettos was a done thing in Thedas not too long ago. You're a mage? Well don't worry, because even though we locked you up your entire life outside of Tevinter just a decade ago, no one has any issue with you at all anymore. \nThis is all very frustrating because again and again, the game demonstrates that it can be engaging and well written, and there are so many really really amazing moments, and then it gets undercut by the constant reminder that everything in this world is black and white and that you don't need to think about the consequences of the black stuff that much either. \nIt really feels like the writer's room just collectively agreed on just paying the bare minimum lip service with remarks that would do well on twitter ca. 2018. Instead of even trying to get the story right, they just don't do the story at all. The story is superficially progressive while failing to engage with the people and the topics it supposedly cares about. Sure, every companion is bisexual and we have a superficially diverse cast of characters overall, but what does that matter when the game refuses to tell the stories of the people it supposedly represent? Sure there is Taash, but honestly their story was so flat and basic, it doesn't deserve a mention. The game got a lot of shit for being too \"woke\", but if anything, is isn't interested in exploring these topics at all.\n\nSo why would I recommend this game with all that being said?\n\n1) The combat system is a massive improvement from what it was in Inquisition. It's fluid, fun to play, and has a decent amount of different combat styles. It is not overly challening, since the type of enemies are limited, (e.g. all dragons have basically the same move set), and thus the combat can start to feel repetitive towards the end, but playing around with different skill tree options´and armor sets is still fun. \n\n2) The world of Thedas is stunning. They did really well in making the regions have their own distinct style and mood, and I had a lot of fun just running around and exploring every nook and cranny, especially because you get a ton of rewards in forms of chests or little secrets while doing so.\n\n3) While I have a lot of criticism for the story telling in this game, there were some things they did supremely well. Mainly everything that didn't touch upon a sensitive issue.  The two stand outs are Solas and the Grey Wardens. Solas story is what you make of it. You see him as a villain he becomes one, you see him as an ally and he becomes that. The talks with him are the highlights of the whole game. Even beyond that, entire areas of the Fade reflect him as a person. You find and fight aspects of him, his regrets, his failures. You get fragments of the past, showing his rebellion, the choices he had to make. Hundreds of little clues about who he really is. A lot of it is optional content, which makes it even more impactful when you do find it. The Solas story is also incomparably more subtle in what it wants to say than anything else in this game. Also his VA did so so well. Bless this man.\n\nThe Grey Wardens, while not reaching the level of Solas, felt grounded and let you explore the impact of the blight in a way that felt personal. You have the choice to play as a member of any of the factions you end up working with, and I highly recommend playing as a Grey Warden, because you end up feeling much more connected to your order's struggle for surival and hope for the future. The Warden's main NPCs - the dwarven warrior and her French twink boyfriend - feel much more alive than comparable NPCs of different factions. I loved them and their story. The companion quests of Davrin, your Grey Warden companion, fits in so seemlessly with the story of the Grey Wardens that it might as well not have been a companion quest at all. Davrin really grew on me as well as a character. Great guy.\n\n4) Manfred, the skeleton companion. I love him. He's so precious. Also Emmerich, the necromancer who he accompanies and one of your companions. Loved his story, one of the best. \n\nIn conclusion: Whether you will have fun playing this game or not depends on the approach you take to it. The storytelling is worse than in the previous games overall, but has some stand out moments that I wouldn't want to miss as a Dragon Age fan. The gameplay is mostly fun, if a little repetetive, and the world is done well. \nI think many of the bad reviews are justified, but for those of you that are at all interested, you will probably still have a lot of fun playing.\n\nThanks for reading, have fun.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Bastardization of Dragon Age and better to be written off as a fanfic of the main story.\nBut the game play is solid and world is beautiful (if abit linear) \nI'd give it a 6/10 on Archive of Our Own.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dragon Age Veilguard. When you look through other reviews, what you will see is probaby some variation of \"this game is woke\" or \"it changes the whole DA canon!\". The first, i will not address, be an idiot if you want to, but the second is not really helpful in a review. I dont know anything about dragon age before DA Inquisition (one of my favorite games of all time), so this really isnt helpful to decide if a game is good or not. So: should you buy this game? \r\nDepends. If you like action rpgs, beautiful graphics and have a goofy sense of humor, I think you should give this one a shot. I think the writing isnt as terrible as people make it seem on here. Its not great, sure, but its not atrocious. If you turn off your brain and focus on enjoying the experience, its a good bit of fun, like a marvel movie. The characters all feel like teenagers in their banter and their awkwardness sometimes, which I find very entertaining (since, and thats something that gets lost when people say that, they are all very young. With a few exceptions, there are very little adults over like 30 in the story) \r\nLook, Im not saying this is a masterpiece, Im not even saying its a better game than Inquisition, but it does not deserve to sit at mixed reviews. I had a lot of fun with this game, my two or three friends that tried it had fun, so if it looks interesting, go ahead and try the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Is this a good game? no not really. Is it a bad game? not really. \r\nThis game is really and honestly just meant to be an almost final tie off to the Dragon Age series, and that's okay.\r\nIt does it's job and has cool graphics, If you want it to be that tie off and you're not expecting perfection then I recommend it.\r\nbut honestly the fact they kept it as THE Veilguard is dumb, they shouldve just referred to it as Veilgaurd and not THE Veilguard",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have really enjoyed every moment of this game. I started with this one and it opened up the world of Thedas to me, and this is the one I keep coming back to. I love all the characters, the combat is really fun and engaging, and the visuals are STUNNING.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I actually loved this game, although there are many bad reviews, people have different tastes in games (and in general). But don't yuck someone else's yum.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I kinda like this game to be honest, it is a good action RPG, the artstyle kinda reminds me of point-and-click adventure games and interestingly, Fable, making it a bit too cartoonish (however, the game does lean towards a more realistic style, like the mmo New World, rather than being too heavily cartoonish). This game is actually solid: it has romance, choices, great cinematic cutscenes and a good story. It is not as bad as many people claim it to be, definitely should check this one out",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is the poster child for the mixed status on steam. It's nowhere near as bad as some people say but also not even close to being a 10/10 masterpiece. I enjoyed every minute of the nearly 80 hours I played of it, BUT it's not much of an RPG. You can create a character in a really good character creator, choose a class, and choose good to neutral options through out but that's it. You can't be evil or even an ahole really, only the good guy. If you enjoy Marvel style quipping with fun characters, some really cool moments in a decent story, and a flashy but shallow combat system then this is a game you would probably enjoy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a fun game, nice combat system and character creation. The writing is pretty meh, but whoever did Emmrich saved the day, he has my whole heart <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved it! The story was great. The characters were engaging. Already plotting my next replay.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, while this game was vastly different than other Dragon Age games, I loved it. Is it as gritty as the original? Absolutely not. Is it as insanely long as Inquisition? Not that I found. But the characters were compelling, the graphics beautiful, and the ultimate conclusion to the story was impactful. If you go into this game wishing for Origins reborn, you will be disappointed. If you are going in looking for a new spin on a game series you love, I couldn't recommend this highly enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite what you may have heard, this is a really good game. After reading the mixed reviews, I went into it expecting to have negatives, and was surprised at how good it was. What I think people felt, or at least I did, was that although it was a good game, it could have been great but veered away from classic Dragon age in that  Dragon Age is dark fantasy,  and this felt like Dragon age for all ages, like it  had a chaperone and human resources hanging out in the development and writing room.  Dark fantasy, classic Dragon Age has complex characters. It's not for kids.  I hope they correct that in the next go-around. They listened to us when we told them Inquisition had boring side quests. I hope they listen to us when we tell them to revert back to the dark fantasy story for adults. Other than that, it is a really good game and visually beautiful. Play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I havent done much on it but so far Ive run into no issues once so ever. Its a pretty good game imo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love the Dragon Age franchise then you'll love this instalment in the series. It is story-rich with charming characters and fulfilling romances. Don't let negative reviews stop you from playing this gem!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Game... Sucks you only get to use two companions instead of three like all other dragon age games..but still loving it so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10 Combat, 8/10 Story and it's beautiful, definitely worth it if you can get on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful graphics, great story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very story-based, but it’s an amazing story. So far, I’d say it’s about 50/50 gameplay and narrative split. It’s a beautiful game with characters you’ll love, and some you’ll love to hate, but I'm not complaining; it adds depth, honestly. If you enjoy character-driven RPGs, I strongly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looking beyond the trash Character that is taash or whatever her name is ... The game is quite fun. I wasn't actually planning to play this one but one day I downloaded it since I forgot that I bought it once on sale and now I am 40 hours in. I mean, production is good, you can see that they worked hard on how the game looks and gameplay loop is really fun too, story is interesting especially if you played DA; inquisition. Only gripe is the character taash ( albeit a character that is very unlikable, edgy who hates the world she lives in) and dialogue where it feels like you can't really be rude to anyone for some reason.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Don't believe the haters.\n\nStarted this game when it came out, didn't feel good about it at the time because of all the discourse surrounding it so I never finished.\n\nStarted from the beginning again about 2 weeks ago or so and man, I do not know why I stopped playing to begin with. Yes this game is very different from other Dragon Age games but it was still a very enjoyable experience throughout. The game is beautiful, the action rpg combat is really fluid (at least as a mage) and the characters are pretty fleshed out, voice acting is overall great, and many of the characters have actual gripping sub-plots. Not to mention, the game is optimized very well, although this could be the result of a years worth of patches. \n\nThere is one character specifically that is the target of a lot of hate. I don't think this character is deserving of this hate, but their storyline is probably the only part of the game that felt forced, but it resolved that with a great ending to that chain. \n\nThis game is not the same as other Dragon Age games, but I can honestly say I'm glad that I came back to it. I really enjoyed returning to Thedas, even in a different sort of way. 100% Recommend.\n\nedit: anti-woke \"people\"- please provide jester emoji so I can award positive reviews for this title. I know you are lurking and reading these reviews daily as you love the anger it makes you feel and you literally have nothing else going on in your bleak existence. \n\nWith love,\n\n- Z",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Absolute masterpiece of a gaming history, incredible story, breath taking scenery and great fighting system. Closure for all unanswered questions in other Dragon ages.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Tone and dialogue too cartoonish for a DA game, sometimes outright silly. But gameplay is engaging, exploration feels rewarding and writing is not bad. Story is a decent follow up to Inquisition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played every DA game since its inception and this ticked every box for me. Was thoroughly invested in the characters and highly interested in how their arcs played out. Genuine immersion and hugely satisfying.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Drop the unnecessary pointless hate and play the game. This game is very well made and really good. The fact that the hate this game received because of some gender variety in the game is insane. Like get out of your room and grow up. Such a small thing in the game is making people go crazy and abandon or hate such a good game. Ya'll need to check yourselves in the mirror who hates this game because of \"that\". You're NOT a GAMER! Drop the act.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I enjoyed this game. I found the combat easily to pick up and the graphics are stunning. Some of the story/narrative suffered compared to previous entries in the franchise, but I would buy it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grifting ruined the perception of this game. It's not groundbreaking but...it's something a lot of games miss this day which is [b] fun [/b] . It runs well, it's silly and badass and that is all that matters to me. \n\nand kids, always remember! [b] you control the buttons you press! [/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dragon Age still has soul—and Veilguard proves it. 🐉✨\nThe continuity is handled for returning players— and newcomers won’t feel fully lost.\n\nFor fans of the series I recommend viewing Veilguard as its own adventure. The previous games in the series spoiled us, so it had big shoes to fill. Is it flawless? Nope. Still liked playing it, so I give it a thumbs up.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Veilguard: It’s an RPG more “inspired” by Dragon Age, than an actual Dragon Age RPG. It’s still fun to play and the combat is pretty smooth, but there’s little to separate it from the other stuff",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Is it a great dragon age game? Kinda, it isn't the best one but it is decent. is it a good fantasy game? oh yeah. Don't listen to others, it is fun and has a lot to offer for adventuring favored players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So it took time to get used to the art style, but it grew on me.  Like Blight.\r\n\r\nPROS:  The story is for the most part very well done.  Yes, some of it follows typical tropes, but others do not.  I very much enjoyed the ride.    COMBAT:  There isn't as much 'thought' as there was in Origins, obviously - but the  harder the difficulty, the more combinations and runes will come into play.  I actually very much enjoyed my spellblade playthrough.  Big booming combos and weapon sequences were great.\r\n\r\nCONS:  Even in November 2025, there are occasionally times when the game seems to stutter.  But otherwise, it is very well optimized and I had very few issues.  Strangely, most stuttering occurred in cutscenes, not actual gameplay.  So A- is the grade I give it on that.  I did really HATE the default coloration, so I ended up using Reshade to make it fit the 'gloomy' vibe the game has - and that fixed almost all art problems for me.  As for story cons?  Well I don't want to get into spoilers - but let's just say that the attitude of Taash took some getting used to, and I wish that Shathaan had been a father figure instead of a mother figure.  Those are personal gripes, however, and don't necessarily say the story is bad.  I felt that almost all of the characters had a very well crafted journey, except strangely... Harding.  \r\n\r\nHarding's just kind of... ends.  It had awesome potential, great climax... but no followthrough like everyone else's did.  So that was mildly disappointing.  That being said - in my playthrough Harding dies, and strangely, this salvaged her story for me.  \r\n\r\nI did cry multiple times in this game - especially in the last half.  So well done writers.\r\n\r\nP.S.  Emmrich was far better a romance than I expected.  Very Addams family on the vibe.  Loved it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "they have revamped it a little, better the second play through also archer gameplay is much more fun then Tanky",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "*Warning: slightly and vaguely spoilerish*\r\n\r\nWriting an unbiased review for a game that basically concludes a series of long-beloved now tetralogy is never a breeze. Well, we are not writing here fancy critical reviews pretending to be industry-leading magazine review giants, right? \r\n\r\nBut!\r\n\r\nAs a Dragon Age veteran and an ardent fan of the previous entries, I just want to express how grateful I am to the people, the team, every person behind this magnificent and enchanting world - the name is Thedas - Andraste bless you! So many players have trailed their self-tailored journeys to see how it all plays out in the end. Strangely as it may sound, that's what matters right now. The Veilguard might not be the closest station to the promised land, but it nicely does the job at the end of the day. That's the first reason you should try playing it. It's worth your time, believe me, my dear fellow. \r\n\r\nTo be more specific yet not overcomplicating things, the fourth part of the series seems to be a successor of Dragon Age: Inquisition and thus might feel more spiritually distant from the first two. That's why what you get in the first place is, by all means, a gorgeous and quite dynamic environment that captivates your mind from the get-go. Optimisation and graphics are on another level, so no complaints from me, except for the uneven frame generation thing. Yeah, overall, it doesn't seem like a dark fantasy anymore, though it's not a problem at all. The only thing it means is that comparison between the first and the last games will always be an effective clickbait. Every Dragon Age has its own taste, so does the Veilguard - it tastes like a romantic epic story.\r\n\r\nThe gameplay and combat are quite pleasing. I love how they learnt the lesson from the Inquisition and moved from this \"middle ground\" between \"action\" and \"tactical.\" Deep down, I gravely miss the DAO's tactics, but I pretty much enjoyed DAV's one, too. It's just that the progression through the maps feels quite rapid if you know how to level your character and gear properly. It also means that your low-level character will be able to defeat high-level bosses and enemies with a painful number of dodge rolls without much chemistry - it now depends on your reaction speed rather than your planning & preparation skill. That's the sad part, hehe.\r\n\r\nAs for the exploration part, it's pretty much a classic RPG experience that never fails to succeed. One thing I want to state, though, is that the progression feels so polished (which is so great on the development level) that it kind of loses its spark and negates a component of mystery and adventure. All this makes it a wonderful game for completionists, yet somehow makes the whole journey a bit linear and straightforward.\r\n\r\nThe story and the characters, the cornerstone of every Dragon Age game, are a metaphoric roller coaster for me because so many great ideas were implemented, yet they were not revealed to a tee. At its core, the main story is decent. I love how it begins, makes you feel elevated and trapped, sad and happy, even genuinely baffled sometimes. Even the longevity is fine. What I slightly dislike is how it makes these plot leaps, which create a distorted sense of reality. It feels as though they had to cut 5-10 hours of the initial main plot. It's not a big deal since the narrative is still balanced and rewarding; the pace of the narrative is, though, a problem for me. Talking about the side quests, they are just not the most exciting part of the game, for most of them share the same pattern: the attachment to a specific ally. A bit boring.\r\n\r\nOh, and characters! I loved them. Dragon Age never disappoints in this regard. You get to spend enough time with your sidekicks, but there is one but. Your pals are such sweethearts that you sometimes think they all pretend. Maybe it's just me and my kindhearted Rook, so I will try to create one with a more rigid mindset next time. Again, some events are a luxurious one-to-one experience: your companions share their feelings, show their different sides, talk about the pain, joy, etc. They feel real!\r\n\r\nAt the same time, some trivial events (you know, some leisure time where you visit a cafe or a bar) could be much more meaningful, not a one-minute story or tale - those kill immersion. The romance part is subjective, since I only romanced one particular character, but it ended up being the biggest letdown for me. I felt as if my Rook was in the well-secured friend zone all the time. The final scene was sort of nice, though, but they didn't even add a good old sobby happy ending part to the aftermath screen. And the worst thing is that I'm damned sure they could do it much-much better. An idea about cutting the content continues to haunt me.\r\n\r\nFinally, what I genuinely dislike is how they almost abandoned the idea of world state import, except for some merest hints and the presence of the Inquisitor. I am well aware that this way has its limitations, but it has always been that one thing that entices the mind and makes your soul glow like the most potent red lyrium. Even if it is a faint illusion, let me live through it. Bruh.\r\n\r\nSo many opinionated thoughts! If you have read it, cheers to you. When all is said and done, all that matters is how you feel it. I choose to think that even though the Veilguard didn't live up to all my expectations, it is still an uncommonly fine game and singular Dragon Age experience. I just expected the plot and the character building to be thicker and denser - the ones the final entry of the franchise should have. Apart from that, it's still 80+ hours of wonderful role-play experience. Still not sure about the hinted sequel since such a scenario will plead for a whole separate story in the same universe (something like a Mass Effect: Andromeda thing). The time will tell!\r\n\r\nBy the way, the OST of the game is, IMHO, the least memorable among all of the Dragon Age games. That's the hard truth I spontaneously want to share.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "People who gave this a bad review cause of pronouns and being trans is insane. Thankfully I didn't know ANYTHING about this game when i was getting into it. I only saw a concept art of Lucanis (I know of Solas' existence)- and i saw trailer for it and i was interested. I've never played any DA games in my life, and this is my first one. HONESTLY THIS GAME FUCKS HARD gameplay, is soooo fun!!! It reminds me a lot of the newer God of War which i love :D \r\n\r\nAnother thing people pointed out is the use of modern language/speaking which i don't really mind, again, this is my first game. And the previous games used high fantasy verbage, which i can understand how it'd be a slap on the face for old players. I think it comes from the success of GOW, who also went thru the same patch- evolving thru time. What I do find awkward and at times odd, is the way the dialogues flow. I don't mind the modern tongue, its just how the dialogues are constructed and how the companions react (example, i liked how Bellara comments on neve's kidnapping if you lose her, but Neve doesn't express the same length of sentiment for Bellara)\r\n\r\nAnd I wanted more from Lucanis- i think i wanted more from the characters but i can understand the constraint by EA and maybe time, overall...GAME IS AMAZING. People made it sound like this was a failure- like it was SOOOO bad, but man i love it. If you love BG3 you'll enjoy this game! I love the fleshed out companions and how they talk like- well, like us, like they have more personality and feelings...I got so attached to them and i was in love with the story. Made me wanna delve into the lore of DA and maybe play the previous games!! OVER ALL LOVE LOVE LOVE \r\n\r\nI need more lucanis.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a fantastic game. It game me the chance to do what I've wanted to do for over a decade (but alas, no spoilers as to what that was for you). I've been a fan of the franchise since the first game. Each game has been a bit different from the ones that came before in gameplay style. I know some were cranky that this wasn't exactly like the previous ones, but that's been a norm in the franchise. If you like a great game that actually released in a completed state with no bugs (that I encountered) and no season passes, give this one a spin.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game!  I don't understand the hate.  Not sure how far I'm into the game, but I've put close to 20 hours in and so far I'm loving it. I think people just need to hate everything these days.\r\n\r\nVisuals are spectacular, solid story.  Combat is satisfying.  Highly recommended.  Not sure how this game was a \"failure\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visuals are terrific. Having some trouble with stalling where screen goes black and have to log out but for the most part, I have two characters playing well. The story draws you in and so do the other characters in the game. Best Dragon Age yet by far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly fun and decent game, despite the hate. Although the cartoonish design is weird at first, all maps offers a satisfying diversity of contexts and most of them have a great \"high-fantasy\" feel. Some vistas are some of the best fantasy settings, both in technical and design terms, I have seen. \n\nThe story is generally good and the core game is pretty similar to ME2 : build your team up and resolve their personal problems to maximise your chance of success when facing the final \"boss(es)\". At first, some characters seem bland, but they get better as the game progress. The non-binary character story is not as bad as the now infamous cutscene suggests. On that note, a few dialogs are indeed bad, but most are good and some are even great. The world-building feels not as fleshed-out compared to DAO or DAI, but it offers an interesting takes on the DA world. In particular, the Necropolis and Treviso were both pretty fun to discover. My main critic is that Veilguard feels too \"literal\" : previous games left some rooms for uncertainty, so that players (and characters) could express different beliefs or understandings, but this game does not (I can't say much more without spoilers). \n\nFinally, as someone who have played a mage in every DA games, I have to say that the combat in Veilguard is so much more dynamic and fun. Being able to switch between staff and blade/orb, which can both use different elements, makes the class really adaptable and offers the possibility for an aggressive mage play-style that I have rarely seen in RPG. The movements are generally fluid, both in combats and during exploration. On that last point, exploration feels slightly \"loot-ish\" and yet balanced; loot is not fundamental (but it helps a lot) and puzzle are not hard, but they are not too easy either. \n\nFinally, I must add that the game runs well, without any stutter or notable glitches, which is pretty rare this days. I have never encounter any crashes either.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not perfect, but definitely WAY better than the consensus led me to believe. If you liked the prior Dragon Age games, you'll probably hate this. But if (like me) you struggled with the older games or didn't play them at all, then this is a very fun and more than serviceable fantasy RPG. Story is compelling enough to keep you playing, characters are mostly likable, and the combat is VERY fun, blending a great mix of abilities and action for a good time. Buck the trend, give it a chance at a discount, and see where it leads you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Dragon Age still has soul—and Veilguard proves it. 🐉✨\nThe continuity is handled for returning players— and newcomers won’t feel fully lost.\n\nFor fans of the series I recommend viewing Veilguard as its own adventure. The previous games in the series spoiled us, so it had big shoes to fill. Is it flawless? Nope. Still liked playing it, so I give it a thumbs up.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Perhaps a controversial take, but Veilguard got WAY too much negative press coverage and fandom toxicity. It's a highly entertaining and well polished single player RPG that does a fantastic job of balancing the open world freedom of Inquisition with some of the deeper lore and character storytelling of the first two games in the series. I am now starting a third playthrough (first as Antivan Crow rogue/assassin, second time as Grey Warden warrior, and now doing a Shadow Dragon mage run) and have put nearly 150 hours into the game so far, and have started to play with mods (of which there are a good number). The game's visual style might not be everyone's cup of tea, but I personally love it, and there are some truly stellar cinematic sequences, easily the best of the entire series. I recommend it for anyone looking to sink a lot of time into a deep, enriching world.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "They made a good game for those who think its bad they could've not made a game at all and all our lives would've been even more dull then it is so thank you bio ware and i hope you'll continue to make games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it Inquisition? No.\n\nIs it good anyway? Yes.\n\nAre there places you can see the skeleton of the forced free-to-play EA tried to make them do and some writing errors from a young team since all the original crew basically left? Yes and yes.\n\nIs this the first game that made me bawl my eyes out in a long time? Also yes.\n\nAm I writing the first novel-length fanfiction that I have in ten years because this game inspired the crap out of me (Something that not even Inquisition could manage)? Yes again.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Please take all reviews with less than 100 hours of playtime with severe caution. This game oozes polish, quality, and care out of every corner, and it takes multiple playthroughs to see it. One of the most  replayable games I've ever enjoyed running through multiple times to see everything it possible has to offer, and beyond fun, they've made it very easy to so. The game has incredible pacing from set piece to set piece. So much flexibility making it easy to get through someone's story/romance if you're doin a run to simply see how a path plays out. The game has a many options to fine tune combat. The game play is incredible. I put it right up there with Devil May Cry 5 in terms of fun and polish. Animation work has so much love put in to it. Warrior is definitely my favorite class, followed by mage, and then rogue. You don't need to be a fan of the series to enjoy the story. If anything, this game will encourage you to play the prequels. Safe to say you should ignore 99% of the opinions on the lore/writing. Those opinions come from people who are heavily influenced through nostalgia, and lack an objective lens unclouded by the past, and how edgy it was. If that edge is what does it for you, more power to you. If you're unable to enjoy a game because its not outdated, then you shouldn't be writing reviews. This game has a wealth of content that stands on its own, but is simply made even better if you have a common objective understanding of the story, and lore from the prequels. Being able to strike a balance between having more than enough for players new to the franchise, and players deeply familiar is beautiful to see. Not many games pull it off this well. Lastly. This game has one of the best, if not the best, character creators ever made. It alone has been a major part of replayability for the past 12 months. This game is honestly one of the most complete packages you could ever ask for. *Chefs Kiss*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would like to say 1st of all there is no place for politics in games, There should not be a LGBTQ+ tag for no games as it does not matter what your sexual preferences are to enjoy a game.\n\nThat aside its a good game, great graphics and game play the story is OK nothing special.\n\nForget the silly LGBTQ+ debate, get the game on sale and enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "perfect combat loop , rich storytelling , nice rpg mechanics , not recommended if u never played any dragon age before",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think this is getting  more hate than it deserves. It's a fun game! The combat is pretty fun and the loot is cool. Skill tree is great too. Some downsides are the dialogue and the walking speed. For a pretty lore-heavy game, the dialogue lacks. The walking speed is painfully slow. Toggling the sprint on and off is clunky.  Definitely worth the sale price!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good fun, the fighting mechanics are kinda wack but once you get used to them it's fun and who can resist Emmrich Volkarin??",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Not too shabby. Pretty excellent actually, except for the DEI and lovey dovey stuff.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good story and memorable characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game but I was looking for a meaty RPG. Thus far it's a flashy on-rails action adventure. Production quality is top notch. This entry should have been branded differently and it would have been better received. If they called it a spinoff action RPG lite, review score would be higher. \n\nCombat has the prime and detonate mechanics from Andromeda and Anthem. Combat is polished and feels good.  I cant stand real time with pause so no complaints from me.  \n\nNot much in the way of exploration. Game looks amazing though. \n\nSound design is great. Bioware has a great sound team.  \n\nI don't think a publicly traded company can afford to sink AAA money into an RPG.  Maybe EA's sale will have a silver lining in a return to quality over  ever growing  expectations of return on investment.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best game in this franchise, in every way, the new Dragon Age was better than the previous games. I don't know why there are so many negative reviews for the game. What do you want from an action and RPG game that this game doesn't offer you? I'm not saying it's a masterpiece, but it's a very good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the game is great and i love the story. those who complain about all the other crap, aren't true fans",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "so far feels like ME2 in a lot of ways; hoping the challenge is similar too; it feels a lot like it so far, which really works well for me, or, I expect, for other Mass Effect 2 fans",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun! Characters are hot. Voices are well made. Combat is engaging. Nice graphics and monsters. Finally it hit the price sweetspot to give it a try. My first Dragon Age game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game play. However, the companion system is so annoying like bruh, wtf, taff? Talves? Talve? Whatever, she/they is annoying af. Who wrote this characterrrrrrrrrrr.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is epic..just jkeep stupid politics and hate out of it ;-) .. im happy i got this the fighting system is wow stuning  same the world looks Epic..you can sink here alot of hours..by the way the voice synchro and acting are a master class like alway bioware shows they are true masters in this art of story telling you isntand feel like in mass effect youa re part of a big adventure and story Coooooooooool:D absolute worth a buy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It isn't DAO which is a shame.  It isn't DA2 which is good.  I like it about as much as DAI but they are different games.  This one is more on the ARPG side of the house than any of the other ones.  Be prepared to dodge, parry, and control more than DPS.  The plot is serviceable and the companions mostly fine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The plot has some needs but the characters are fun and great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great continuation of the story where you can explore more of Thedas, get to know new characters and unfold the Dreadwolf's plot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm so happy to step back into Thedas again! It's been fun discovering new cities, characters and styles of combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Alright,[/h1] \n[h2]this is going to be a very long and very personal take on Dragon Age: The Veilguard.[/h2]\nNO BIG SPOILERS AHEAD\n\nThe Dragon Age series has a special place in my heart, I have played all the games many times, saw the shows and movie, and read some of the books, yet I have come to play DA:V without any expectations due to the bad reviews I heard everywhere. I did try to remain objective, but when it comes to DA series it will always be all about my subjective opinions and feelings. \n\nDA:V has all the ingredients to make up a great DA story. Lovable companions who form a found family, who you have to help with all sorts of personal problems, Thedas in danger only the main character can somehow save, references to the characters and events happening across the many media DA story has touched, and of course a sprinkle of romance. \n\nEvery DA game has brought something different. The fighting system has changed, the art style has changed, the lore was expanded, and some loose ends were tied up. DA:V is trying to tie up a lot of them. The revelations in this game aren’t always what I would expect, sometimes in a good way, and many times I have to remind myself, that it doesn’t have to be wrong just because I would have done it differently. [spoiler]I might not agree that the Crows are suddenly a happy murderous family and an elf from Arlathan forest has somehow read about a Tevinter detective, but who am I to dictate that DA history has to be static and globalization cannot touch Thedas.[/spoiler] I'm not gonna talk about the lack of important decisions being imported from previous games, because I honestly get it. I’m not happy about it, but I get it.\n\nWe’ve got to talk about all the nostalgia strategies they throw at us, the model BioWare players, because gods they are not very subtle. You get a lot of references to both DA and Mass Effect series, whether it’s the visual similarities (darkspawns to husks for example), the polar decisions, the countless references, or the use of Varric’s storytelling. I love Varric, he is without a doubt my favourite character, but even I found the passages where he does the ominous foreshadowing sloppily stitched into the storyline, to make the player nostalgic about DA2. DA2 is my favourite game in the series and yet I still think it was a bit on the nose. \n\nTo give it some credit, the game pulled one of the biggest cliches and I didn’t see it coming, which took me by surprise and left me feeling torn, I had to stop and think about whether I am mad, weirdly gratified or just sad. But exactly that is what makes the game memorable to me. That and finally seeing the characters from the whole series coming together in a big cinematic fight. DA for me is about characters and moments. DA:V has both, even though honestly it could use a bit more of the moments especially when it comes to the romantic storylines. I expected an equivalent of the singing scene from DA:I, which made me fall in love with the series, but got none. The game tries to sooth you with cozy lighthouse and beautiful sceneries, but they just feel a bit shallow sometimes. \n\nIt has come time to address the thing many people complain about: the writing. My biggest problem is not with the writing overall; the game has some good dialogues and even a few epic monologues but is very inconsistent with the language. Taash might not be one of my favourite characters, but I do get she is a teenager looking for her place in the world, the problem is the language she and even the people in her storyline are using is too out of place. You won’t convince me the language shifted so much in the decade or so it took from events of DA:I. Or that Thedas wouldn’t develop completely different dictionary based on their languages. On the other hand, there’s Emmrich, whose extensive use of bookish terms makes the character more believable as an academic necromancer. In conclusion, sometimes the writing is scratching my little linguistic heart and sometimes it makes me want to plug my ears and pretend I didn’t hear that. \n\nSo there you have it. I was not expecting much when I started to play DA:V, but I was genuinely looking forward to starting up my computer and playing the next part. Try it, you might be disappointed, but you might also be surprised. Give it a chance and you might come to like it, it might even make you cry, for various reasons. I definitely cried. \n\n[strike]It is not that bad; you people are just mean.[/strike]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the story and the team a lot, really enjoyed the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can't understand all the the hate, Had a great time with the Veilguard",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game on PC, stunning visuals and game world, story is a lot of fun and combat is really good! writing my only minor gripe but still 6.5/10, but still really enjoying the game. Overall a solid 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a little different from the other Dragon Age games. It's almost a mix of Dragon Age and Mass Effect.  Lots of replayability.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "3/5 stars aside from the obvious social commentary thats constantly rammed down your throat the game isnt too bad i like the game play and the abilities are interesting but the story just feels generic at this point after 3 games ''the chosen one'' plot is boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked the storyline and a lot of the new features to it but dislike Rook's run, that there weren't more long hair choices for the hairs I did like and wish there was better armor cosmetic looks but otherwise I am enjoying the game so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with plenty of quality of life type features. Combat was fun and never got boring. Music was good and so was the voice acting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS GOOD 8/10 \nif you enjoyed the earlier games even just a little bit. the lore here BOOOM mind blown dude!\ni dont know what happend to the colective unit called Youtubers but they can all go BiiB themselvesiv waited over a year to play this game cos it got so much hate. \niv played 65 hrs so far im half way don with main story (just finnished part 7/14)there is so much stuff to do.. its well made runs well (now anyways) its fun. looks amazing little cartooney but i prefer that, im playing a warrior most boring class there is normally but nope so fun.\ni have 2 minor issues with the game Gpu crashes 1 or 2 times a day... RX 9070XT seems like its a windows problem... \nAND again this game is so focused on being good for consoles that camera controll seems a little goofy sometimes.\ni hope Every reviewer that said this game was bad cos of some stupid american gender issues has eternal Warm pillows issues (on both sides)\nto keep myself honest i must say i did NOT love the loot system, but it grows on you.. i kinda like it now.\nfirst run took me 100+ hrs 51/52 achivements and 92% \"codex\" so im fairly content with my opinion on this game and i stand by the rating.  2 more classes to go . :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "How to enjoy Dragon Age: The Veilguard:\r\n1. buy on sale\r\n2. forget about the previous Dragon Age games\r\n3. play as a \"new\" action RPG\r\nFollowing the above steps, I found the game to be a reasonably fun action RPG with decent story, characters and combat. With class choices and team combos, it also has good replay value. I think I paid around $30.00 and have 81 hours thus far, so good bang for the buck (if you get it on sale), Unfortunately, it is not really an \"open world\" game. Each area is small, compartmentalize, and convoluted, and lacked the exploration value of games like Dragon's Dogma II, but it was still fun overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not a great fan of sword and sorcery role-playing games but this one is fun! There are great characters and fans of action games benefit from navigation assistance. \r\nThe graphics are beautiful. I managed to run it on Ultra with no problems despite it not being on a SSD.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So I have quite a few hours in the game now, so I thought I'd give my thoughts. To preface, I also have played all the previous games. I bought them all and played through them (multiple times) when DAI came out as I was too young to play them when DAO and DA2 were released. I do recommend this game for others to just give a try for themselves. If they don't like it, fine. If they do end up liking it, great. If they hate it with a passion, your choice. Please keep comments civil as these are my opinions alone and I have no intention of trying to change anyone's love, hate, or indifference for DAV.\n\nMy first playthrough was as an Elven Mourn Watch Rook who romanced Emmrich and my Inquistitor romanced Solas (because that was my OG and favorite playthrough of Inquisition). This will be the playthrough I go over as it was my initial experience with the game.\n\nEmmrich, Bellara, and Davrin were by far some of my favorite parts of this game. I think the voice acting was great and their story arcs were very interesting and engaging while the others lacked good writing for me, personally. Harding didn't feel like Harding (I had read somewhere she was originally supposed to be Dagna?). Taash (while I didn't mind them) had awkward dialogue and I wanted more with the Dragon King and their fire-breathing, which we only really got at the end of their arc. Lucanis was fine but I desperately wanted more from Spite (I saved Treviso, so I did have his full quest). For Neve, I just didn't connect with her. The whole detective thing was meh for me. She had some good moments but overall, I just didn't really care for her. Maybe that'll change if I experience her romance, but for now, she's my least cared for companion.\n\nThe writing for this game is definitely lacking but it didn't take away my enjoyment of the game overall. It was awkward and downright cringe in places (Harding specifically for me, even moreso than Taash... though the Bharv scene made me have to stop playing for a bit lol). Combat is fun and smooth but gets VERY repetitive throughout the game. I wish there was more variety of enemies. But, then again, I didn't really vibe with combat in any of the Dragon Age games. Maybe DA2?\n\nSome of my favorite parts of the game were the big main quests like the Siege of Weisshaupt, Fire and Ice, Blood of Arlathan, and everything from To Act as One till the end of the game. I also loved Regret of the Dread Wolf and the ending with Solas and my Inquisitor as a romance was extremely satisfying for me, personally.\n\nVeilguard is also very visually beautiful. I turned off bloom and the difference in just turning that setting off is INSANE. It gives the game better texture and even brings back the more gritty visuals that the other games had more of. I also LOVE the photo mode. I don't even know how many screenshots I have of just the environments in this game. I do have some mods for character creation and have some gripes about that (sliders, complexions, the weirdly thick necks, etc) but character creation is overall pretty good to me with a few tweaks.\n\nI feel for the developers of the game and the shit-show they went through with EA execs and the incredibly tone-deaf CEO. A lot of the developers and writers have spoken out since DAV's release and revealed some of their ideas and intentions for DAV (including the art book being released as well) that makes me sad for what DAV could have been if suits had stayed out of it and given the devs enough time to create the Dragon Age game they initially wanted. EA trying to turn it into a live service game and getting rid of the Keep completely killed opinion and trust in the IP.\n\nAll that being said, DAV was and is still enjoyable for me but I am disappointed and grieve the what-ifs. It had great ideas that I found myself desperately wanting MORE and felt saddened when they didn't delve deeper. Perhaps in the future, another Dragon Age will come out and regain fan trust. However, if that doesn't happen, Dragon Age will always have a special place in my life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you ignore all the political stuff, it's actually a pretty good game. Same level as inquisition, not a masterpiece but pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its actually a really good game despite the bad initial reviews. I feel if you take the game at face value without bias its a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i do like this game but like why did they paint the elves like they did all of the bad things in the world\n\nand most of the time i have on this game is just idle",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having played through the three previous Dragon Ages, liking the story, worldbuilding and conversations, etc., it was very exciting to open up into new part of the series, right back into the world I'd just left in the previous game. Modern graphics are a nice addition, making some sceneries and vistas very inspiring.\r\n\r\nWith this fourth in the series it feels so nice having a more sensibly balanced, action-oriented combat system that has great promise in maybe solving my biggest problem with the series so far: combat has always been fun at start, but in the earlier trilogy of games it very quickly became a \"solved problem\" and the only challenge started to become enemies with higher and higher health pools for the vast majority of the games. Maybe this action-oriented gameplay can avoid that or at least be less dull to repeat in the end-game. I'll reserve my right to update this review if my optimism is proven wrong, naturally.\r\n\r\nOn technical side things look and feel good except for the one little thing: plugging in a PlayStation 4 controller gives me Xbox prompts no matter what I try. It's the darndest thing, too, 'cause for the first two days of playing this I had the correct PS input prompts showing just as I'd expect, and then it just changed at some point and I can't make it work again. Well, lucky that I am able to remember the Xbox gamepad layout, too, but it's a bit of an annoyance - to know that it could work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, combat and story. Should have a quick save and an always run toggle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A V.good Experience 🫡 i was Connected to the story for the whole game it was a Great exp for me 😄",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really don't know what people were complaining about? I think it's a pretty solid game sure it may still not compete with what we now regard as AAA Games but its a great effort from Bioware.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good addition to the Dragon Age series. The visuals are terrific once you get used to the style. The story, I thought, was a good continuation of the others while adding a lot on its own. The combat style is different but satisfying (as a warrior, can't comment about the others). It is not as long as DAI, but that is probably a good thing. If you have and enjoyed the previous games, you will likely enjoy this one as well. It IS different, but if you want the same, play the other games again.\r\n\r\nA lot of initial reviews complained about the writing, particularly with the non-binary character. As a dad of two girls, I found a lot of that dialogue was representative of a child trying to find their way in the world; nothing more. Most of the dialogue was overly simplistic and seems to be the bit that suffered most with the severe change in direction of the game during development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Starts out fairly well, then goes downhill pretty rapidly as you notice all the flaws. Thankfully it picks up steam again for the finale.\n\nPros:\n[list]\n[*] Genuinely liked most of the companions and their side stories\n[*] Combat feels great, the best in any DA game to date IMO\n[*] Lovely visuals and a stable framerate (on a 4070Ti)\n[/list]\n\nCons:\n[list]\n[*] Poor dialogue choice design - a 'choice' to say the same thing in one of three slightly different ways is not a real choice\n[*] Often doesn't 'feel' like a Dragon Age game - the darker tone has been scrubbed clean\n[*] Similarly, it's impossible to play Rook as anything other than 'cheerful but determined'\n[/list]\n\nThe discourse around the game is massively overblown. It's good. It just isn't great, and if this turns out to be the last ever Dragon Age game as a result? That would be a shame.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love it, lots of unanswered lore finally gets told. Landscapes are beautiful, fighting style is fun and balanced. Lots of different places to go, and returning already visited places are not the same BS that DA 2 was. Sometimes it feels like things are repeatedly told because game makers things we are stupid or just don't listen. And I definitely Hate the woke Taash companion story line with forced/unskippable tasks about non-binary whining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such an amazing game to play.. i just love the entire franchise",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "At the story level it tends to be a little slower than most people would like.  It slows you down and prevents you from running when you are near something to pick up.  I guess that's good for beginners, but sometimes you don't need coin.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lucanis should be able to get pregnant but otherwise its rlly fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ok - I'm a big Dragon Age fan.  Romanced Morrigan...Aveline was my bestie whilst I snogged Isabella.  I lead the Inquisition whilst getting naughty books for Cassandra.  I love it all.  \r\n\r\nThis was my first dragon age game after becoming a father of two young ones - so I had to take it slow (an hour or so every other night and so on).  It did feel different - but it grew on me.  It does take a while to pick up pace and for the companions to 'lock in' - but it did work and grow on me. \r\n\r\nRecommended - not the same as the old dragon age - but enough of the magic to be worthwhile and enjoyable.  Last narrative section of the game really 'snaps' it into focus and ties a lot of the threads together.  Excellent voice acting throughout.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was good. Play the others first, thou.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I grew up playing Dragon Age DA:Origins, Dragon Age II, and Inquisition. Sure, Dragon Age II was a bit of a hot mess, but after replaying Origins a million times, it still blew me away in its own way. Even if it wasn’t the best, I’ve got a deep love for the trilogy. Honestly, these games got me into storytelling and made me want to become a writer.\n\nIf you’re someone who loves RPGs like Skyrim or story-rich games of any kind, just don’t get this one. As someone with a literary degree, I’m telling you this game’s story is as flat as a fart. It’s not worth your time if you’re looking for depth or a solid RPG experience. The developer and publisher basically took something I loved and wrecked it.\n\nTo be honest the biggest thing that ruined this game was the social and corporate politics around it. They wanted it to fit a certain agenda so badly that it killed the soul of the game. And yeah, as a gay man, I find it frustrating that some people defend it just for the reason of inclusivity. Dragon Age was always inclusive; you didn’t need to butcher the writing to prove a point. The result is a game with FLAT characters, SANITZED dialogue, and no real player choice.\n\nJust to give you an idea of how much I loved Dragon Age; I was the guy ordering Dragon Age novels before The Veilguard came out. I’d fall asleep listening to lore videos. And this game just wrecked that love for me. I can’t even comfortably replay the old games knowing this is where it leads. It just turned something I cherished into something I can’t enjoy anymore.\n\nI’m sitting here a year later, and I had to tell myself to have some self-respect. I spent MY MONEY on this game, and I’ll never willingly go back to it. If you’re still going to try it, I hope you find something to enjoy. But as someone who loved Dragon Age, I’ve turned my back on it because they turned their back on fans like me first.",
      "voted_up": false,
      "votes_helpful": 649
    },
    {
      "review": "An inoffensive game, but certainly far below the quality you'd expect from past Bioware. Lots of grating characters and Sunday morning cartoon-style dialogue that tries to be witty but not quite getting there. Combat is ok, but not particularly deep. Overall, tone feels very much at odds with the style established in previous games.",
      "voted_up": false,
      "votes_helpful": 116
    },
    {
      "review": "As a die hard fan of Dragon Age Origins, this game did not appeal to me on many levels. The tone of the world itself is radically different from earlier installments, which might not necessarily be a problem if it felt at all impactful. \r\n\r\nChoices are rarely meaningful, character stories were predictable at every turn. At the core these people just don't feel anywhere near as human as the cast of Origins and its DLC or Inquisition. It's hard to put into words exactly the way in which this game seems to fail to understand interpersonal relationships but I imagine most functioning adults will find many of the interactions.. uncanny, to some extent. \r\n\r\nGameplay itself is alright, graphics other than character designs are quite nice. I didn't encounter any bugs in my playthrough so to that end it's very easy to pick up and play. For a generic fantasy game it's just fine. For a Dragon Age game it is, in my personal opinion, absolutely creatively bankrupt. \r\n\r\nNot sure where this leaves the franchise. For my own part I will stick to replaying Origins and Inquisition",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "I didn't finish it.\r\n\r\nToo many stories I just don't care about, that I don't relate to, that don't matter to me.\r\nAlmost nothing from my previous adventures, a mediocre combat system, a \"home base\" where you can fall off the map and it's all huge for no real reason. \"Companions\" who sound like zoomers and are generally annoying to listen to.\r\n\r\nMeh. Probably shouldn't count as canon.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I’ve never seen anyone praise something just for being woke. So I really wonder what kind of logic thinks ruining a mature franchise like Dragon Age to make it cringy, kiddy, and woke will make money. I’d love to understand it.\n\nAt first, I actually liked the game, but as soon as I got into the first quests, the characters’ dialogue hit me with pure cringe. I can’t even continue. \n\nThis game feels like an INSULT to anyone who grew up playing Origins",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Imagine being handed one of the best RPG worlds ever and then releasing this pile of poop. It's like they took everything that made the previous games enjoyable and just tossed it out the window. The worldbuilding is meh at best, combat can be fun but is horribly imbalanced, just playing it is tiresome. The graphics are nice enough with some adjustment, the characters are alright except that everyone is godlike from the get go, choices don't matter, and I haven't seen a RPG this linear since like 1997. I bought it for 20 bucks, as a long time dragon age fan, and I'm ehhhhhh on whether it was worth it. I wish I'd just played Dragon Age 2 again.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Whoever designed the scenery honestly deserves an award as the settings are absolutely stunning. The Voice Acting is also very well done although most of the characters are HORRIBLY written, ultimately that is not the fault of the VAs who still put a lot of effort into trying to make the characters feel to have depth (most of them at least)... sadly every other part of the game from the plot, to game play, again... how the characters are written, character and equipment design, combat, etc allllll of these fields are lack luster at best. This game had literally a license to print money and somehow the studio found a way to shoot themselves in the foot and turn out one of the biggest disappointments in recent gaming history.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not a huge fan of this one, unfortunately. I grew up playing the previous Dragon Age games and absolutely loved all of them. I had heard mixed reviews on this one but went in with my hopes up, just to have them crushed. \n\nThe story telling sucks, the rpg aspects are terrible, dialogue is repetitive/shallow/dumb, and the mechanics are the worst of all.\n\nIt really feels, overall, like a crappy mobile game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Sat on this for a year after finishing the game - I honestly don't think I can recommend it though sadly. I really did want to like this game so bad and it's such a shame it didn't hit the mark.\n\nIf you love the original 3 DAs, don't play Veilguard just because it's a DA game - the essence of it just isn't the same as the originals. \nNo effort feels to have been put into the world building, the dialogue, or fleshing out any characters. Most conversations felt like an exposition dump and the story just kind of dragged on for me personally. The writing overall felt quite juvenile, and not the level of maturity I would have expected from a DA game.\n\nIf you're going into it blind, you might have fun, but go in with very very low expectations and just enjoy the pretty maps/character creator I guess.\nOr just don't bother cause it's not really a Dragon Age game.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "There are games that leave you wishing for more — this one leaves you wishing for less: less unnecessary chatter, less filler quests.\n\nTo be fair, it does have its positive sides: it’s visually great, with good sound design and voice acting, fighting is fun for the first several hours. You can clearly see how much effort the artists put in, and it’s a shame that their work was dragged down by the writing and overall direction.\n\nI went in with zero expectations, and somehow still walked away a bit heartbroken. It’s not a totally bad game on its own, but it feels more like a caricature of a DA title than a true continuation of the franchise. It leans on familiar character and location names rather than the soul that made the earlier games memorable.\n\nThe final missions were fun and I honestly wish the rest of the game had learned from them. In the end, this whole experience just made me appreciate the previous games even more.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I played all Dragon Age games, and this is clearly the weaker entry.\n\nDialogues feel childish, and the plot failed to prove engaging in almost 20h...\nCombat is OK, but get tedious after a time. Enemies at high difficulty are just spongy, not worth the hassle.\n\nAt one point, a seemingly major choice [spoiler] choice between two cities [/spoiler] came out of nowhere after a recruitment mission. But nothing really ties you to either of them, so it feels shallow and poorly done.\n\nSo yeah, I could not find the strenght to finish it.\nI used to love Bioware, but after Anthem, Mass effect Andromeda, then this... They clearly have lost the magic that made them unique. Lesson learned.\n\nEdit : and deletion of World States... what a mess...",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I've played every Dragon Age game on release, and for the longest time I would've said \"Dragon Age 2 is the weakest in the series\". Now that this has come out I can definitively say that this is the weakest for the series. Does that make this a \"bad game\"? No, the gameplay is fun and the environments are interesting and as a Dragon Age game it falls short but as a standalone it's fine. If it's your first Dragon Age game, you'll enjoy it, but if you have an experience, you probably won't. Buy it on sale, play for a while and figure out for yourself.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This isn't an RPG, it's a cinematic heavy action game with a \"press X to win\" mentality. It's closer to Shadows of War or even Assassins Creed than it is to Dragon Age.\n\nIt's pretty, surprisingly so with how garish I expected the colorful bloom effects to be, but the environments are odd with massive backgrounds but cramped and small corridors connecting cinematic sequences. The \"puzzles\" are more like tasks, mindless at best, a waste of time at worst. EDIT: There's a little more \"game\" than I originally thought, with a ton of collectibles and \"stuff\" to do, so that's nice I guess.\n\nThe combat is alright, but basic with no need for tactics, strategy, or builds - it's all the same spongy enemies, \"hit X to win\" regardless of class, and the skill \"tree\" is just a big flat upgrade path masquerading as something deeper. EDIT: After getting through the rest of the game I can say that I did not enjoy the bigger fights or bosses. The wild camera and attack spam is so bad it's nearly unplayable. I, like many others, just reduced the game's difficulty to get through it.\n\nThe writing is OK, but very juvenile and overly heroic, like the writers thought they were making a Marvel movie. The exposition is infuriatingly circular like I'm a child that needs constant reminding of what I'm looking at. There's also no pacing and no sense of scale - stuff just \"happens\" and characters just \"appear\" - I can't tell who they are, why I should care, or if its been 5 minutes or 5 months since the last scene. There's not much role playing at all, dialog options and choices are arbitrary, ending with the same result. I feel as if I'm being shown a story already set in stone rather than engaging with it.\n\nFinally, they got freaking Hanz Zimmer to do the soundtrack but there's barely a central theme and nothing memorable or unique about it, honestly an AI could make it. Compared to the unforgettable themes of Origins and Inquisition, there's no contest. \n\nBig, big steps back from the previous games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Not a bad game at all, but just very... \"meh\". The graphics are great and the combat was fun for a while, but for some reason I wasn't able to make myself keep playing. The writing and characters were not as great as past DA entries, and the moral \"choices\" I faced boiled down to the good guy choice vs the [i] slightly less [/i] good guy choice. I'd say it's worth a try while on sale, but lower your expectations if you're a Dragon Age fan.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "\"lemme get a dark fantasy game and remove the dark, and make it horribly written characters, and make none of the choices from the previous game matter\" \nLiterally Dogshit and I hope EA shuts down for what they did to this series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have been a Bioware fan since KOTOR, loved just about every release up until Dragon Age Inquisition but it is clear this is not the studio it once was. I really wanted this to be great and I didn't want to join the internet pile on that I feel is fuelled by some of the worst parts of gaming media. However, this game just did not feel like a Dragon Age game.\n\nIt was too shiny, too happy, too plastic, it's characters are designed to be quirky, humorous and get along with you and wanted you to 'win' in every situation. That sound nice but it added up to characters and situations feeling like they were inches deep which is such a far cry from the way this universe has been in the past and what I loved about the tone of the previous games in the series.\n\nI'll probably try this game in the future and I hope I can change this review but for now it will remain a no.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I didnt even finish it, I dont think i got all of the companions. It was a very disappointing game that was definitely not Dragon Age. It was Disney Marvel Presents: Dragon Age",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "With a heavy heart, i think dragon age is dead, the interactions between characters is always \"yes\" and the companions have zero issue with anything you do, the gameplay is a joke in comparison to any other DA game, zero difficulty, zero depth, it plays like a mobile game, and what the heck is the deal with changing the visuals of the enemies to look like spooky aliens??? if your going to change the lore on a dime, at least give actual lore reason too it. I'm overall very very disappointed at veilguard, i wish dreadwold actually launched instead of this gross game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Why on earth did I play this for 80 hours of my life? I guess it was because lots of reviews said the game wasn't bad. A Bioware-game that isn't bad... could that mean they are back? Well, no. I mean, it is true, the game isn't bad, but it's not good either. It is designed to offend nobody and to excite nobody. It exists only because of it's reputation and that of it's creator. Bioware, the legendary game studio that turned rpg's from a nerdy tabletop-passtime into a gaming genre that is loved worldwide. Perhaps we all should stop pretending this company still exists. Perhaps we should let go of our hopes and dreams and face the music. Pull the plug. Bioware is not going to wake up from it's suspended animation and be the same it once was and this game is the exclamation mark behind that sentence. I don't want to go through this again with a poorly made Mass Effect-lookalike. Let's just... say our goodbyes and say: Thank you Bioware. It has been great to have you with us, but the king is dead...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Four words; SHAME ON YOU BIOWARE!!\nYou took an amazaing series and then removed everything that made it good.\nNothing (apart from 2 choices) in previous games matter, companions are bland with questlines that mostly follow the same predictable template. Combat is repetetitive and utterly without strategy, and feels more like a generic hack-and-slash game than anything else.\nI waited 10 years for this game and the utter dissapointment i feel when playing this is hard for me to describe.\nI would happily have waited 10 more years if only they had made a worthy successor and not this cringey, boring excuse for a game.\nSadeyedchild Greatly dissapproves!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Been almost over a year, and the game is STILL unplayable due to an audio/frame rate bug. Any hours I have on this game are mostly me going back and forth, digging through files, trying to fix this mess of a game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hands down one of the worst video games I have ever had the displeasure of playing. Forget the story, I couldn't even get remotely invested in it because of the technical issues that prevented me from playing the game. So my PC isn't a cutting edge gaming PC by any stretch. But I like to think it can play most new releases. I thought wrong. The game is practically frozen on a black loadscreen with the blue glyph at the bottom right hand corner. The screen remains black but flashes and never boots up the game. Previously I played this game under a frustrating and migraine inducing spitting, spattering and stuttering performance as deleting the shaders is seemingly the only way to get this infernal pile of trash to actually boot up....which results in severe performance issues. And the graphics settings are the lowest they can be. At this point...I really don't care anymore. Bioware is probably dead now and Dragon Age for certain is dead. Good riddance.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Dragon Age began as a tactical RPG.  Further sequels have diluted any strategy or roleplaying aspects down to practically nothing.  None of the descriptions or reviews of this latest sequel had prepared me for quite how shallow, dull and uninspiring it is.\n\nThis is not an RPG any more.  It is a third person shooter.  The game play goes as so:\n\n- Follow a specific path to a specific destination\n- Every now and then, fight a few identical enemies by spamming your basic move and then using a slightly more powerful one when your action bar has recharged\n- Don't bother looking for loot or items, the only thing you'll find is some gold\n- No inventory management or significant character development\n- Watch a cut scene of generic people making dull conversation.  You'll probably skip all these after sitting through the first few\n\nScores and comparison:\nDA Origins: 10/10, genre-defining strategy RPG\nDA 2: 2/10, Dull, claustrophobic grind fest\nDA Inquisition:  5/10, More interesting environments but limited strategy\nDA Veilguard: 2/10, like DA2 but even more dumbed down\n\nAvoid unless you are looking for something to kill time and don't want to risk being challenged or inspired",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Shallow game and if you want a real RPG, look for something else.\n\nEnvironments LOOK wonderful and game runs smooth. That is about only positive thing I have to say about the game.\nEnvironments are not good \"levels\" to play, but they really look 10/10.\n\nStory is weak, mechanics are bad (combat gets boring rather quickly) and dialogue is atrociously bad.\nIt is so bad that it is not even cringe funny (like some horror movies are so bad that they are funny).\n\nAs huge fan of RPG genre, I think it is extremely misleading calling this game RPG just because it has inventory and skill screen.\nStarted OK-ish, wanted to like it, but more I played more I disliked it.\n\n\n[b] Game feels like it was designed for 8-9 year old kids who are a bit on slower side and for some reason they put 18+ rating on it. [/b] \n\nSkills tree serves nothing.\nSimple staff attack spamming path in tree was much more effective than proper mage \"use many abilities\", especially if increasing difficulty and I tried all combinations in tree with optimal gear for each \"build\".\n\nAnd I have to repeat: Dialogue is absolutely terrible. Some scenes are OK, some are even funny but so many are really bad.\n\nIf your child is rude to someone, make them play this game as punishment.\nThey might empathize with other characters being insulted and your kid might rethink how it interact with others in real life.\n \nIf you want to mindlessly play easy game for some 20 hours and not intend to finish, consider buying it, especially if you like nice environments.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I couldn't care less about this game...\nThe gameplay is an improvement in terms of action RPG, they also improved the movement, now you get to your goals faster compared to Inquisition, but that's it.\n\nThe rest is mediocre to bad, exploration is boring as hell, the story is repetitive and lame, the animations are boring and very cartoonish, and it has no integration with Keep, even though it's based on events and stories from Inquisition, nothing that was done there matters.\n\n4/10.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[b]Dragon Age: Inquisition[/b] was one of my favourite games from childhood. I loved the lore, the NPCs, and their stories.\nSo I decided to give this new game a chance. But it is absolutely awful. I feel like my heart is broken by it.\n\n[b]First of all, the battle system.[/b] How am I supposed to fight when I’m a mage, and all I can do is dodge attacks and hope my team defeats the enemies without me? Team commands only ruin the experience, because it’s too much information to keep in mind. And combos — why do they appear? I don’t even know. I’d prefer something like the old [i]Inquisition[/i]; it was really nice because you actually [i]experienced[/i] your whole team.\n\n[b]Second — inclusivity.[/b] I agree that Dragon Age was always about that. When I was a child, the idea that NPCs could have their own preferences absolutely blew my mind. But now it feels like a bad Netflix film, with an overly simplistic way of pushing inclusivity onto you.\n\nCreating my character was nice, and the world looks pretty. But it’s still really hard to play.\n\nI remember how interested I was in Cullen’s romance. I replayed the game several times, and the last time even with a guide, just to get everything right. But now all characters feel way too simple. I don’t believe they will deliver anything as deep and complex as they did in [i]Inquisition[/i].\n\nSo I’m just happy I bought it with a big discount. Buying it for the full price would be a disrespect to the entire game development industry.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Just not worth it. The world, writing and characters all feel... lesser. The game is dumbed down to a point where it should have been it's own game, not a sequel to a beloved trilogy. They even took away proper RPG party mechanics in favour of Mass Effect style combat/ability units. If you enjoyed any of the previous Dragon Ages, don't play this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game is for kids, not for adults.\nThe only not that bad thing in this game, is battle system. Oh, yeah and graphics.\nThe rest is just bad. Boring plain characters, boring plot with zero intrigue, long boring conversations game forces you to start and then skip,skip, skip + They add anti-immersive things like 200+ similar boxes with loot no one owe, levitating coins like in Super Mario Bros. Because of these trash I do not feel history and characters are real.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game is a very sad ending to a beloved IP. I have tried to play the game but between game breaking bugs and save games getting corrupted its just impossible. It is just terrible and I wouldn't recommend for any reason.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it took ten years to make and it would have been better if it hadn't been made at all. anyone who tries to tell you it's okay as a standalone is lying, it fails both as a sequel and on it's own. go play/replay baldur's gate 3.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Very generic action RPG with twitchy dodge and parry mechanics that I personally did not enjoy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "THIS IS NOT DRAGON AGE! \nThe only thing it has in common is the title on it, every choice you carefully crafted from each previous game does NOT matter at all when it comes to this game. The characters that come back from previous games are either completely different characters that are empty shells of themselves or they just stand and don't do shit other then \"I'm a cameo for the fans\". The companions in this game have no interesting flaws or views about the world instead they mostly talked about what their favourite food is (I wish I was kidding) and it sucks because you can see the potential of these characters but the writers either have no guts or soul to make these characters complicated. Speaking of complicated characters they botched Solas the most promising villain of Dragon Age franchise. The only positive thing I can say about this game is the hair customisation.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I wanted for so long to love this game as a long time fan of the franchise but unfortunately, this game threw away the identity its predecessors built. Changes to the combat and gameplay were something I was willing to get on board with and even tried to get excited for. The lore built around this game made it almost too easy to deliver an amazing narrative experience for fans who followed the story but instead they filled it with \"your decisions don't matter\" style gameplay. Your previous game saves have no impact, unlike every other entry, you can't play as morally grey, good, evil, or anything in between. The dialogue options are simply an illusion and you can't change the way you handle situations other than the order in which you do them. You can't condemn horrific acts, agree with tough decisions that would label you a monster.. you can't even be slightly rude to a character who cares more about her gender identity than they do about an ancient god who is altering the relationship between the world and the veil. It's political in all the wrong ways, narrative in all the wrong ways, and takes the game out of the players hands in every way except for combat which feels so unfamiliar that it might as well have been a stand alone game under any other title than \"Dragon Age\". Thoroughly disappointing and I've played roughly 20 hours on and off, starting new characters, trying to find something that gives me any kind of joy or enjoyment and I've found nothing outside of seeing old characters which the game changes so drastically that it's not even them anymore. Buy at your own risk but even on sale, it's not worth the time, let alone the money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While it's a decently fun game with its shining moments, I cannot in good conscience recommend this game to anyone who even vaguely likes the other Dragon Age games. It takes 20 years of lore and established culture and absolutely rips it to shreds. It's decent fun as an action game, but the roleplaying aspect is sorely and painfully lacking. Don't expect your background and race choices to change ANYTHING about roleplay.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "To be blunt, it's tiresome. Dragon Age Inquisition was an awesome game. This is not it. Yes, the graphics appear souped up, but the freedom, the choice, all feel lacking so far. Sure I'm barely in, but it feels really linear, scripted, kinda boring. Makes you feel a little like you're just there to click the buttons when prompted, building nothing, just witnessing a scripted story where your choices don't really mean anything. I got it on a big sale, but it isn't really giving me any incentive to continue. As for the amazing review scores on the video start.. it makes me doubt their credibility, every single source.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Huge fan of the first game, big fan of the second, solid fan of the third.\nThis one has let me down in a way no game before has managed to do yet. The writing, the lore, the story, the characters, just... it's so bad. It's cliché and foreseeable and boring and exaggerated and contradicts things established by the previous games for the sake of \"ohhh plottwist!\" and even the banter you listen to during your travels is... cringe. And I hate to use that word, but it really is the best-fitting one.\n\nGameplay, eh. Alright-ish.\n\nVisuals, pretty good, if you ignore the stutters and lags caused by them (during which you can still move the camera, though).\n\nMusic, good, i guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think I'm just gonna call it Veilguard, and not Dragon Age.  Because it's aggressively not dragon age.  It's like a fan fic, but by someone who had no media literacy or had a thinly veiled contempt for the established lore and rules of the setting. they're breaking established norms on a whim left and right with little to no explanation.  If I stop thinking of it as a dragon age anything.  It's decent-good.  The combat is a high point which is nice because its been a point of contention since origins.  I'd be shocked if the franchise isn't completely dead, especially given the potential sale of EA but on the off chance it survives or the IP is sold, it requires either a reboot, or just striking VG from the record like that season of community no one likes.\r\n\r\nEA's meddling is evident everywhere and live service vestigial remnants are strewn throughout the game in both the UI elements, the way combat plays out, and the broken up select mission go to mission nature of the game.  The game is better than it has any right to be considering what Bioware was put through, but that doesn't make it a good game.  Only not as bad as it could've been.\r\n\r\ntl;dr:\r\nIf you can disconnect it from DA 1-3, or even better haven't played them, it's a fun romp on a discount.  If you're hoping for a continuation of the series post inquisition, this isn't it.\r\nAlso the game really scales with hardware and can look really pretty with everything turned to 11.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Man this game just flat out sucks. The first one had a great story, but has aged badly. The 2nd one sucked. I don’t know why I bought this, this sucks too. Not worth it even on sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ea play deal for $2 your first 30 days, this game is on the pass and I got to say it was the worst $2 I ever spent.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I regret playing for more than 3 hours because I can't refund this mid game.\n\nThe characters feel bland, and while their designs are pretty nice, that doesn't negate how uninspiring they are. How they managed to make Varric feel different is beyond me.\nThe graphics are painful to look at, too. There's this blur around everything that wouldn't go away. It looked like the noise in AI-generated videos, if I'm being honest. I couldn't find a way to fix this issue at all, and adjusting the graphics settings did nothing either.\n\nCouldn't even bring myself to play partway through the first act because the spark of the previous games just wasn't there. It felt like walking through knee-deep water with cement blocks tied to my ankles. \n\nIt's a shame because I adored the previous three games, especially the second one. This one is a stain on the legacy of Dragon Age. Don't bother wasting your money on this when you could either save it or buy a better product.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "okay, this isn’t a terrible game, but [strike]dorian’s twink death[/strike] the super cringey, stereotype-heavy queer representation isn’t even the worst things you’ll see. so it’s not a good game either, but what really matters is that it’s not dragon age. i don’t have duckling syndrome, but it honestly feels like a game that’s only loosely connected to DA, both in looks and in how it plays.\n\nthe characters are badly written, the antagonists (except solas - he’s okay, though he was better in inquisition) are boring, and the story is set up so you instantly know who’s bad and who’s good - which makes the whole thing feel like one big cliché, and everything in the plot gets solved way too easily - they literally added a girl who can fix any eluvian like she’s just installing a graphics card, which is kind of hilariously stupid. there’s no logic and details, and the ones that existed before are ignored in this game. there are a ton of cutscenes you get tired of watching because, yeah, they’re pretty, but they’re also really boring.\n\non the plus side, the combat is actually fun, and I unexpectedly liked the fight mechanics, the companion ability combos, and the faction leveling through trading.\n\nso, to sum up this lazy review: the game is okay, people can love it, but i don’t recommend it, because - again - it’s not dragon age, and even as a standalone game it can be really boring if you’re not into clichés and stereotypes. BUT if you really want to try it, here’s a small tip - just get the EA Play for cheap, play it, and then cancel it. trust me, I’d be upset if i bought this game only to realize it’s not worth the money.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I bought the game on sale several months ago and have played for a total of 3.7 hours if that tells you anything.  I was a huge fan of all the previous games, even Inquisition, but I have very little desire to pick this one up again.  Some games take some time to kindle that yearning to play, but at least you feel the itch enough to want to keep trying, this game feels dead from the start, very sad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was ready to give an honest review.\n\nBut after losing my main save and having absolutely no workarounds work and seeing just how commonly this happens, all I can say is:\n\nDon't buy this game unless you enjoy potentially restarting from scratch all because something corrupted your files. It's insane how many people have gone through this and how EA has not once acknowledged this issue nor made a patch fixing it. \n\nSave your money, go buy another game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to like this game so bad. I really do. the dragon age series is one of my all time favorite games right next to the elder scrolls, kingdoms of amalur, BG3 etc. But I just can't accept this game as being a part of the same series as origins and inquisition. Another review here put it best. As a stand alone game, it isn't bad. But as a part of the dragon age franchise it falls short on multiple fronts. For starters, I have no problems with female characters. I usually play female characters. But when the only male party member is immediately wounded and out of the fight, the rest of the party feels like the female avengers take on the world. You are in a full chick squad right out of the gates that feels forced to check every DEI box. The dialogue options are horrible. No matter what you say, it basically turns into we will get through this with the power of friendship. You cant be a dick like in BG3. There are no options that question your morality. You and your whole party are meant to be cookie cutter heroes. It just lacks depth. With that being said the world is beautiful, the character creation is good, and the combat is fun. I'm going to keep playing and hope that the positives are enough to warrant an entire play through. But for a company that gave us origins, this game falls short several leagues.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wish I didn't have to write this. There are many things wrong with this game. I love Dragon Age lore and most of all I love DA: Inquisition and only recently started playing the first one (as I have been afraid of the fight system - and rightfully so I have to say). So, I came into this with high expectations, and I can only say those have been crushed and trampled over. It took me a year to get the courage to finish the game only to get a bad ending, because I am honestly not willing to spend more time on this game. Part of me wishes I would, but the writing is just so bad, all the characters are unlikeable, I HATED my own character the most. How can you play a game where you detest the character you make and play as? It's horrible, let me tell you that. \n\nWhat crushed me the most was how the Inquisitor is being represented in this game. Who is this happy go lucky person that supports you with a smile? Where is the fierce leader of the Inquisition that has done everything in their power to stop Corypheus? Only for there to be a bland and boring person who tells you \"You got this! :)\". For all I care the Inquisitor didn't even have to be in this game and it would have been better.\n\nAll the agenda and simplicity of the writing aside. I don't think there is a single thing I liked about this game. I don't even want to know how many hours I would have to spend on this to get at least the normal ending. No real interaction with characters, most of all it didn't even feel like what the Rook said had any impact. Honestly the best characters in this game, hands down, were Assan and Manfred. \n\nI really, really wanted to be able to say something positive about this game, but from the very beginning until the end, there was nothing. I'll just go back to reading the books and playing the previous games. And a reminder to my future self who might think it couldn't have been that bad. It was. Don't do it. Just... don't.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "dragon age are my favorite rps. if i must have only 3 games, i would chosen the origin for sure. ( isnt just a game but a masterpiece)\n\nfor the dragon 4, guard my @##, first of all, i want to thanks bioware because when morrigan, dorian, a darkspawn, a demon, they made their appearance in the game, always someone informed me who they are, or else I wouldn't recognize them.\n\nthe veil my @## dares to try to mimic origin. the camp becomes the lighthouse. in origin you travel in different areas to get help for the blight. here you do the same for recruit companions. what did you say? you dont want all of them? i have news for you. its mandatory to recruit all of them and the bonus is that you dont have any control to them . (you have 2 in party).\n\nthere isnt an open world also like origin. and the similarities stop here. in origin when you travel in a new area, an amazing adventure started. circle, brecilian forest, etc. in dragon age 4 (sorry, this game doesnt deserve to called dragon age) when you go in a new area to recruit a companion its  like an mmo quest. enter, walk, fight mobs, unlock doors, boss, back in base. the writing is very flat. of course as a modern game, the graphics are very good, for the environment only, because all characters its like to used a potion of ugliness\n\nyou visit maybe the most intrigued region of thedas, tevinter and you get nothing. if you imagine, magisters, blood magic behind closed doors, archon, conspiracies, oppressed elves, slavers, black divine and your involvement in the games of power in tevinter, then keep imagine because you dont get anything of these. the tevinter is just a decor, a corridor who you pass doing an mmo quest. if you loved origin, its sure that you will hate this game. if you search for a game without deep and immersive story, but only for the latest graphics, dont search anymore, you found it.\n\nps. the funny or tragic thing is in dragon age 2, if you do the fenris companion's quests, you have better contact with tevinter than d.a. 4\n\nSPOILERS. DON'T READ IF YOU DON'T WANT TO KNOW THE END.\ncongratulations. you finish the game. you be informed that \"the worst and the LAST blight defeated\" what do you understand from this? the grey wardens will be farmers and the series ended",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "While I am going to see this through to the end for closure's sake and will probably rack up hours ingame to do so, this feels like a big departure from previous games. It feels like the worse cousin of DA2 and I'm one of the outliers who loves DA2.\nThe scenery is beautiful, it's cool to see Minrathous and the north of Thedas, and that's kind of where my enthusiasm ends.\nUnfortunately, everything else suffers from the issues this game underwent in the development process and the devs seemingly writing themselves into a corner and deciding to nearly entirely discard previous game lore and decisions. I hope one day I can come back to this game with kinder eyes, but for now I'm playing it in a way you would watch and enjoy a terrible B movie. It's the Shock Treatment to dragon age's Rocky Horror.\n\nEdit after 30 more hours, having experienced enough cut scenes to add this critique. The characters feel juvenile, like I'm watching a Disney movie. With the exception of Neve and Lucanis if I squint, these characters do not feel like grown, tax paying adults interacting with one another. I'm fully expecting them all to link arms and skip into the fade to defeat Solas with the power of friendship and talk therapy because He Just Has Some Big Feelings!\nI don't expect a violent, grimdark, edgelord game of thrones narrative for our companions. I do expect the grit and tonal continuity to match previous games.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "None of the classes play like they did in past iterations of the game. The story is just awful. The gameplay is awful.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "meh. kinda upset i bought into the hype and paid full price for this. even knowing it wasn't a true Dragon Age story/game, I still expected more.\n\nI left the game running when i left town for over a week hence the 300+ hrs. I probably played this for like four before getting bored. Hopefully I can revisit in a couple years and it'll be better, somehow, but I think the issues with it are too fundamental to actually change.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It just isn't a good game. I wish so badly it was a good game, but it isn't. I love the Dragon Age series, and I genuinely enjoyed aspects of DATV, and I am deeply fond of some of the characters (or at least the potential of some of the characters; even the ones I like are woefully underwritten and underwhelming). But the game is bad. It's just bad. I am not saying this in a \"go woke go broke\" way, culture war bullshit is stupid, I am saying it in a \"no aspect of this game is worth the price tag regardless of your political opinions\" way. \r\n\r\nThe writing is clunky and doesn't fit the setting, at times seeming actively disinterested in the worldbuilding that predates the game. Why is Tevinter a queer safe haven? Remember how the Qun was accepting of trans people and Tevinter has conversion therapy blood magic?? Why are we using modern terms instead of responding to the genuinely really interesting things the previous games had to say about gender in Thedas? Why does no one react to my kossith character waltzing around Minrathous? Why can I play an elf Crow and it never even gets touched on that the Crows literally buy and groom kids, including elves, into indentured servitude as assassins, as was made evident by the very first Crow we ever meet in the series? Why does only one choice from the previous series impact this game, and WHY is that choice did you kiss Solas or not? Why can you just be casually Blighted as a game condition and you're not even a Warden? \r\n\r\nIt's optimized so unbelievably poorly that I always have to go into task manager to edit my core priority just to avoid major audio skipping even this far after lunch, that my shaders have been verifying for near an hour now, and that, despite my PC being able to run much more complicated games with much bigger maps and much higher graphic fidelity with absolutely no issues, I keep this on low just to keep the performance manageable. Near manageable. \r\n\r\nThe combat is...fine. I have fun with it, but it's a clear downgrade from previous games and doesn't really work on its own merits. I tried multiple difficulties in case that was a balancing problem but it just never felt engaging or fun. The companions, my favorite part of the game, are incredibly one-dimensional with questlines that seem thematically disconnected from the overarching narrative and also are really dull. The maps are kind of interesting but mostly just...disappointing. I can't believe I ever talked about the Hinterlands in Inquisition. The Hinterlands are so beautiful and full of so many quests that yeah, were busywork, but were fun or silly or narratively interesting, and meanwhile we're in LITERAL ARLATHAN and it's like um. You can line up some beams. Does that sound fun. The kids love puzzles where they line up beams, right?? None of the maps are BAD, per se, but I don't think any of them are actually good. \r\n\r\nThere is literally one choice in the game that I thought was interesting to think about and weigh my options for in a way where my opinions and the opinions of my character mattered; the others all did not matter to me in the slightest. One. ONE. That choice didn't even have consequences in this game, and God knows we're not getting another game in the series. Of all the things that piss me off about this game, of which there are MANY, that's absolutely the worst. This is supposed to be a roleplaying game!!! Why do none of my choices matter at all? Why am I a plucky YA protagonist with no discernable personality besides \"happy-go-lucky\", \"snarky\", or \"socially awkward but in an endearing way\"? In Dragon Age: Origins, you could be a naive idealist, a ruthless pragmatist, a power-hungry despot in the making, a strictly principled hero, an actual CHARACTER and not an archetype. Not even a good archetype!!! I didn't make up a Rook before the game and was mad about not being able to roleplay a hyperspecific character, to be clear. I tried to genuinely engage with the worldbuilding and character options of this game and found there simply wasn't anything to work with. There was, what, one choice with consequences and the rest is all based in a \"bond\" and \"faction strength\" system that is so clearly signposted that you immediately know the \"right\" thing to do? Give me complexity!!! Give me problems without easy solutions! Give me characters who both despise each other for the ways in which they are inexorably opposed, and make it so there isn't an obviously right one! Give me more than \"pick which companion dies teehee\" one time! Give me disapproval that matters so that the approval means something! God, I remember befriending Vivienne in Inquisition and finding it so meaningful since I also had runs where she despised me. When I got tot he scene where I can punch Solas, I realized just how far I'd pushed my luck. Companions used to leave your party if you pissed them off, and now I can't even really be mean if I TRY!\r\n\r\nRemember Fenris, who despises magic for entirely understandable reasons and can do heinous things to mages who have done nothing wrong if you don't show him enough compassion and understanding through the game? Remember how he was there with Anders, who genuinely tries to bring awareness to the plight of mages in a city that grinds the magical and the nonmagical alike to nothing at all only to decide there is no option but violent resistance? They're both wrong, and they're both right, but most importantly, they're both believable. Their experiences have shaped them into the people they are now, and your decisions as a player shape them into who they can be. That ruled. This is TWO of the eight companions you can get in DA2, and I don't even think DA2 has the most interesting interparty conflict in the series. I can tell you which has the least! It's Veilguard. Lucanis and Davrin are the closest the game attempts to it and they get over it...offscreen?? Or something? It was so half-assed I truly didn't notice, and I was romancing Lucanis. I was genuinely trying.\r\n\r\nThis game was a gift from one friend; someone whose writing I deeply admire wrote something for this. If not for those two reasons, I would not have finished it. The main thing I got out of this game were characters I could reimagine as if they were written to the quality I'd expect from the first three games, and the extra hours I spend on it -- including now, when I am STILL actively verifying the shaders as I have been the entire time I write this review, and yeah, Steam takes up a little memory but come the fuck ON, it's been an HOUR -- are driven by that affection and not by genuine enjoyment. \r\n\r\nFrankly, the more I play it, the more I get frustrated with how bad it all is. Perhaps one day I will be free of the curse of actually really liking the concepts of these characters so that I can go back to better games, like Dragon Age: Origins, or Dragon Age 2, or Dragon Age: Inquisition, or any of the Baldur's Gate games, or any of The Elder Scrolls games, or some random free shovelware game on here that at least you can have fun laughing at with a friend because you didn't waste anything but your time on it. \r\n\r\nIf it goes on sale for $20 or less, I think it's worth that price tag. I genuinely would not spend more on it. I know Bioware already wanted Dragon Age dead, but shit, man, I wish we'd just let it sit after Inquisition rather than this. They did give me Isseya, though. I think what they did with her was stupid and poorly executed, but I did get Isseya. Credit where credit's due. That's why the game's worth $20 instead of $10.\r\n\r\nTo the staff that worked on this: I am sure this is a product of mismanagement and crunch and whatever other corporate nonsense happened there. I can see where there is love and passion in places. The problem is that only serves to highlight the rest of it, and the rest fucking blows.\r\n\r\nMy shaders have finished verifying at last. I'm going to close Veilguard and play Origins.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "It's a bit too mid overall, a bit too expensive and not Dragon Age enough to warrant the name or what one would expect from picking up the title. If I could give a mixed review, I would. Someone will balance this one with a positive one.\n\nI also feel some sources, including Steam tags, claiming it's a CRPG are a bit misleading. If you're looking for your next CRPG, look elsewhere, this is as ARPG as DA has ever been, and you don't have the type of party control I'd expect from the former tag.\n\nThe Good:\nWhen scenes, dialogue and lore are good, they're quite good.\n\nRogue is fun to play. There's not too many combos you can string together, but they're well animated and fun to execute.\n\nThe vibes are there in maps.\n\nThe companions have banter, and it mostly lands. Their side quests delve into their character well enough, and the player gets to connect with them well enough.\n\nThe Bad:\nWarrior (Fighter?) and Mage just feel like they have separate attacks rather than anything I'd call  combos. Some specials are fun, but I'm glad I tried Rogue first, because I would be a lot harsher on the combat if I had not.\n\nWhen the writing, dialogue and lore are bad, they're quite bad. It takes too long for the story to pick up, and when it does it just can't balance out the slog from before.\n\nThe choices aren't really choices most of the time, they're quite limited flavour text. The ones that matter felt a bit too contrived for me, or a bit too obvious as to what is the optimal decision. I don't say optimal as a binary or \"good\" and \"bad\", because you can't be evil in this game, I quite literally mean the decision that is more successful and saves more characters. (except if you don't wanna off someone in the party, that is)\n\nA lot of interesting themes are tackled, but they're not tackled well quite often. It's a very superficial exploration of them, which is insufficient at best and a bit insulting at worst. This is most noticeable when talking to companions.  \n\nPuzzles are abundant and clear as day. They feel like padding. I'd rather they just weren't in the game.\n\nWhile the vibes are there, you don't really get to explore a lot of cool looking parts in the maps. There's pretty minimal interaction with the NPCs inside them.\n\nThe mid:\nCombat overall is pretty simple compared to other hack and slash games. You can't string very many combos, and they all serve the same purpose, a.k.a deal damage and stun lock. There are some fun things you can do with i frames on skills and some skills do look like combos, but it doesn't quite work well enough to compete with similar action titles. You're limited to 3 skills, so it's not like you're getting the CRPG experience either.\n\nWhile decent in their personal quests, companions are just kinda mid when involved in the main plot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lazy programming makes this game unplayable by me. If you have a controller plugged in, you MUST use it, and EA couldn't be bothered to put in a simple tick box to disable some inputs. I've got no intention of taking my PC desk to pieces just to play this.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "One of the most woke games, I have ever played. If you want a game that you have to help characters decide what gender they identify as, this is it! Literally a terrible game. I did not even finish it because it is so unbearable.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Played this thanks to EA Play trial for 1 month for 1€.\r\n\r\nBut this ain't it. This has nothing to do with Dragon Age. This has nothing to do with old school Bioware RPGs either. This is like ChatGPT wrote the script for a Disney diversity version of a once popular franchise. The quips, jokes, general dialogue and speeches in the first 5 hours were all terrible. Absolute bottom tier. The thing that really drove home that this does not understand the prior games or franchise was Morrigan's appearance. Morrigan, who some some remember as a practical woman who was mostly cold towards anyone and who your very first DA character could still marry, neither remembers or mentions the Warden not is she herself. It's like an alien wearing her uglified skin with the only thing remaining being her voice.\r\n\r\nSo, the story is a huge huge disappointment and the writing is absolute shit but how about the combat? Well, it's generic action RPG with very unintuitive janky animations that take forever and made me feel like I accidentally put the game on easy or something because it just doesn't come together well. You have very few abilities you can actually use and most don't feel good using either and then the rest of the tree is just passive bonuses slapped on top of each other. Great. The class fantasy died at character creation. Nothing there looked appealing to me. Build variety? Nope. About as simplistic as DA:I was 10 years ago.\r\n\r\nThe world design is the only thing I can't quite complain about. There are some really beautiful pieces here. The design team did a great job. The gameplay / level design team, sadly did not because traversing it is no fun. Upgrades are all on the main route while pitiful amounts of gold are found by 'exploring' which means run to the left or right of the corridor you're being funnelled through. FF13 linearity might be the best comparison.\r\n\r\nThe companions are all super annoying and I have yet to meet half of them. So much of the game was everywhere that I already knew what seemed to be the 'bad' or even 'worst' scenes involving characters and story but I sort of thought 'what if there is something good outside of that'? There isn't. It's just bad 100% of the time and 100% of all characters are bad. Everyone just smirks and tries to sound clever but fails and you're just left sitting there wondering what idiots wrote this garbage and ruined one of your favourite franchises.\r\n\r\nBecause the cherry on top the shit sandwich is of course the complete disregard for everything that has ever happened prior to this game. Nothing matters, not even your Inquisition you put a lot of time and effort in and might still be attached to after all these years matters at all. You get to choose 2 things none of which you probably chose in the original game. Just a waste of everybody's time this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Transgender stuff aside.... the game is just blunt... Everything is Meh...\r\nStory, gameplay, rpg elements... bleh..\r\nIts not terrible.. almost good for kids, but no becuse of lfgbt stuff. waste of 20€... \r\nI wont even finish it",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "FIx your shit with the dragon fights. after the first phase, the second phase doenst seem to work and im stuck without being able to kill it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fix your game, i cant use dodge.\n\ni had to unplug my keychron m6 mouse, now i can dodge\nwith my mouse plugged in i cant connect a controller or use the spacebar.\n\nnot a good experiance, i recommend the Keycrhon m6 mouse over dragonage the veilguard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Millennial writing is a plague, every dialogue and character is horrible.\n\nedit: Bioware should shutdown at this point",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "What is this? It is only Dragon Age in name... This is a sad, insane, woke garbage. I can't force myself to finish the story.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "the game was almost good and then it forced a certain character and their viewpoint down your throat so far it wasn't possible to enjoy and none of the choices affected how you treated the characters.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Unfortunately, this entry in the Dragon Age series is a disservice to the greater series and to the legacy of BioWare.\n\nThe Dragon Age franchise was previously willing to tackle difficult and morally complicated subjects. But in Veilguard, those edges have been sanded down into a generic conflict with characters who are too agreeable.\n\nThe most egregious example of this problem is in the characterization of the Antivan Crows. In previous entries, the Crows were established as a ruthless band of assassins who regularly enslaved children and had no moral objections to anything as long as the pay was good. But now... they feel like dime store Assassin's Creed protagonists who fight against tyranny. This shift in characterization is extremely jarring for someone who's played the previous three games.\n\nAs for the player character and how you shape their personality... You're not going to able to do much. The dialogue options range from \"accommodating and nice\" to \"slightly less nice.\"\n\nAs for the gameplay... it's fine. It's a decent and serviceable action RPG that shares some DNA with Mass Effect. However, that's not what I come to this series for. For something that rides or dies on its writing, I feel let down by Veilguard.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Very fun to play in the beginning and then they brought pronouns into the game. I dont really care about it irl, but I'd rather not have it in games, it just made me lose interest tbh. Also, the whole push-ups thing after misgendering whatsherface- The secondhand embaressment was very very real.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "10 hours in and so far 95% of characters met are women. \r\nCompletely unimpressed of what I've seen so far. \r\nThey made a PG13 fanfic of Dragon Age. This is not dark fantasy, this is nightlamp fantasy.\r\nThey took DA, put chicks in it and mate it lame and gay",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Will keep it short because I do not like thinking about this subject more than my friends and I did over the years.\n\n1. This Game can be played, does feel less like the cut content plagued DA Inquision (which still was decent and the the final DLCs were such a redemption)\n\n2. I do NOT blame the \"OG\" Devs or others with the same heart we all respect but the Galaxy Brains failing at making wise decisions time after time.\n\nLove to the Devs  whatever they do now hopefully its fulfilling.\nGreetings Wardens",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I want my money back, you can only have 3 skills at a time.... you game is trash and a huge dissapointment, I was a huge dragon age fan i cant believe you did this... If I was a different type of man I'd find who ever deals with the skill based systems and disapear him... Im serious... I loved this game and now its a joke... I have no life so when you ruin something like this is personal...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I dont know where to start here, I have been playing this series for years on xbox. Its still the most played game I own on xbox. There isnt a conversation i have seen in Dragon age one. Not a single one. Now I get excited for this, the hype was real, i took of the day of work to play. I was about 10 hours deep and i couldnt shake the feeling that this sucked. I didnt want to believe it. The story was hot garbage, One of the main citys broke while i walked around. Like, it wasnt even finished and iI walked under the map. I would reload and ya, nothing. I tried to get attached to the characters, besides them all having 0 interesting Things about them made romancing any of them a chore all on its own. They hyper focused on the Woke agenda so much they forgot to make the charters worth your time, one lady is missing a leg, Cool, her romance? felt like I was trying to get with my grandmother. the other female? a dwarf side charcater from inqusition, who was emotionaly engaging as the strone she came from. How about the assassin> dark and broody right? Nah, as dry and uninteresting as the rest. But hey if your playing a chick with man meat or vise versa the game works! im so glad i get to have the woke crap shoved down my throat as much as i have to listen to it in real life. How about we stop trying to be all inclusive and foxus on your actual damn fanbase? inquisition was borderline trash imo. Still buggy even to this day, but hey I can go sleep with a half dead dude as another dude. \n\nThis series always aloud that stuff, one, two and inq all let it slide seemlessly. So why in this one does it feel forced down my throat at all turns. Its shameless cashgrab at its finest. Avoid playing if you like crappy story games, with even worse character interaction. Just go play two or the first one.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Every time I try to play this, It runs perfect for 30 minutes or so and then crashes with a direct x error GPU removed window. All drivers are updated, software is all up to date, and I'm running a 5080 with plenty of RAM and cooling. All values look good on MSI afterburner and every other game, including heavy GPU load games, run perfectly. I've deleted shaders, repaired the file, ensured there are no game overlays on , uninstalled and reinstalled, and, last but not least, restarted my PC. The only thing I can conclude is that it's a software problem that needs a serious bug fix update before the game is playable, which is what many have decided on google/reddit/forums as well. \r\n\r\nNow! If you can get the game to run well, it's an amazing game. Great graphics, fun storyline, and exciting combat. However, I hate that my brand new PC cannot reliably run it. \r\n\r\nPlease fix. This is one of my favorite series of games and I would love to finish this, but I cannot bear the disappointment when the game crashes mid-cutscene or boss fight.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a long time fan of the dragon age series, this was a huge let down. \r\n\r\nThe things I enjoyed:\r\nCombat feels the best it ever has in a dragon age game, no longer must my mage stand in a single place while I watch the same 4 move animation play on repeat for an 80 hour story. Skills feel fresh, movement has drastically improved and I appreciate mages can finally use a secondary weapon aside from the staves they've been relegated to across the franchise. \r\n\r\nYou finally get to see some of the places you've only ever heard about in the other games, like Antiva, Tevinter and Rivain. Settings are beautiful and I had fun walking around in them, though it did feel like there was little to find and explore on your own as paths are pretty clearly laid out for you everywhere you go.  \r\n\r\n\r\nThings I didn't enjoy:\r\nA lot of lore is thrown out, changed or otherwise hand-waved off that been established across the other games. For a game series that was all about making choices and having those choices matter even beyond the title they were made in, developers throwing away the majority of those choices left me feeling disconnected. \r\n\r\nMost of your followers feel too tropey, and the biggest issue I took with all of them was Harding. She was 10 years younger in the previous game and was somehow more confident and capable than she is in Veilguard. She comes across like a totally different person, shy, unsure of herself at every turn, and self admits to agreeing with people purely for the sake of being liked. This was the inquisitions, and Leliana's, best scout? \r\n\r\nThis game got scrapped and restarted multiple times and it shows, line reads feel like there was no direction given in many instances so dialogue comes off as still or not matching the tone of the scenario. \r\nAs a long time fan of the series, I can't say I'm really looking forward to the next one, if that even happens with the sale of Bioware.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Roughly a year after I first played this game, I am considering reinstalling Inquisition so I can experience the world again.\n\nThat should really tell you everything you need to know.\n\nIf you want more, then here:\nI've never seen any company ruin two different franchises so thoroughly and expertly. Inquisition wasn't even that great, but I enjoyed it and I appreciated the story, writing and twists far more than any of the vapid, surface level writing on offer here. You can see the skeleton of a good story but it's consistently ruined by tepid, executive vetted story beats and characters that attempt to summarise themselves instantly upon meeting them so we don't have to bother getting to know them to identify which generic archetype they're going to insist on being for the rest of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Es una  desgracia lo que hicieron luego de la obra maestra de Inquisiton. No hay vista táctica, NO CONTROLAS A TUS COMPANEROS, NO HAY MUNDO ABIERTO, es un simple Devill May Cry donde aparece Varric. Es demasiado triste. el gusto me duró 4 minutos. He tratado de jugarlo y darle tiempo, pero es una mega decepción...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game looked good but thats the only nice thing I can say about it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's like dragon age if someone kinda described the lore of the series to someone whilst they were wearing earplugs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As if Netflix had made the third LOTR rings movie.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Complete and utter garbage. Gaming on rails.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "\"Everything woke turns to s**t.\"  - President Donald Trump",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "So let me start by saying I'm a long time fan of this series. I played all three prior games before this one starting with Origin in 2010. I've been with this series for 15 years and patiently waited a decade between Inquisition and Veilguard. \n\nIf you're looking for a ragebait review screaming about \"wokeness\" then go somewhere else. This series has always been progressive. Real fans know this. So no, nonbinary options don't bother me. I like that they're inclusive of genders and different Afro hair textures. Making a black person in DAO and DAII was impossible. They've definitely come a looong way (more on this later).\n\nShort answer: I recommend this game if it's on sale and only to people already familiar with the series. 2/5 stars. Play inquisition instead and just pretend this game doesn't exist. \n\nSpoilers abound. \n\nWith that out of the way, I will start with saying I was beyond disappointed. With all of the lay offs and key people leaving bioware, I kept my expectations low and BOY was I still disappointed.l For one, I think this game was somewhat DOA. The trailers didn't excite anyone. Okay, fine Bioware always has cruddy trailers. I would say the lay offs didn't inspire too much hope. I would be remiss if I didn't mention the release of a certain DnD themed game being released by an independent company in 2023. Comparisons to Baldur's Gate 3 would be inevitable.\n\nThe pressure was on. This was Bioware's shot at proving to everyone they still had the chops after Andromeda and Anthem.\n\nAnd they did not rise to the challenge.\n\nWhoever decided to make DATVG a puzzle platformer action game? I strongly dislike you. I'm being a little facitious but not about despising the DATVG puzzle platformer vibe. Listen, we all hated the hinterlands am I right? DAII was claustrophobic. I don't find myself liking open world games these days. Back when I was a young, spry 16 year old I had plenty of time to screw around in video games. As a grown adult with a job and obligations, I would rather a game stay on the rails. This is fine in theory, but it was just not handled well. What I hated was the platformer vibes. I do not want to spend my time jumping on roofs or jumping over crap in caves. I especially hated that the game relied so heavily on puzzles. Puzzles are fun, but I don't want it in my DA game. This is not an issue with the game so much as it is with me. None of the areas felt too distinguishable. Minrathous didn't feel like the place Dorian described in DAI. And it didn't feel different from the other places. I don't even remember their names because they don't stick out. In fact you realize you are strapped to the few places they give you on the map. The scenery is beautiful but the scenery is just fancy wallpaper. You see, the game relies more on factions than setting.\n\nWhich brings me to my next issue: factions. God I hate these. This is some stupid harry potter crap and I hate it. People kept reminding me that I'm a shadow dragon every three seconds. It made no difference in the story, but man did I get so tired of hearing that I was \"good for a shadow dragon.\" I have never liked factions in games and this one is no different. I don't even recall there being a questline specific to my faction. Again, it was wallpaper designed to make you think anything you do in this stupid game matters. It amounts to a few dialogue options that mean nothing and some character bits.\n\nAnd oh god the characters. Do not get me started. We were spoiled by previous DA characters. Spoiled by characters not written by AO3 Dragon Age Coffee Shop AU enthusiasts, but people who took the time to craft a character that you would love and care about. It's not a given. I don't care how much you try to tell me Lucien is a bisexual disaster, the narrative needs to show that. I will say that part of this is due to lay offs. I assume the half decent writers were no longer in the room. But these characters can be defined by one trait and one alone which is not good writing. You may be able to convince a fan fiction reader this is good,  but I expect a little more especially from bioware. I think a character who got most of the hate was Taash mainly for their hamfisted line of \"I'm nonbinary.\" This ties into the writing.\n\nThe writing is crap. I wouldn't be surprised if bits were generated with ChatGPT. Nothing, and I mean, nothing is subtle in the writing. The most egregious example is what I talked about above which I'll loop back to. I do not care at all that Neve likes khachapuri. Why is this crap in the game as dialogue? Why do characters only exist to echo what's going on? If you're in a cave expect the characters to bring it up ad nauseum. Any lore? Expect it to be dropped on your head like an anvil. Bioware. This is a game for adults. Let us *think*.  A game released in 2024 literally said \"It's quiet. Too quiet.\" And they wanted $60 bones for this? The writing is what makes a Bioware game a Bioware game. Everyone had issues with DAII but you cannot say the writing was nearly as bad as this. At least the characters were well written. At least there were motives. What is there here? Fluffy dialogue about coffee and the occasional \"Blank will remember that\" like I'm playing a Telltale game. We get dialogue like \"I'm nonbinary.\"\n\nThe most frustrating this about Taash being nonbinary is that it works for the Qunari society. Qunari have very rigid gender roles. Men traditionally fight. Women traditionally pop out babies. This is reiterated throughout the series. All the way back in Origins, Sten refuses to believe a female warden could be a woman because women do not fight in Qunari society. He assumes you're a man. You can tell him you're a woman but he'll insist it's impossible because women can't fight so you must be a man. Taash rejecting not only their assigned gender but both genders could have been a reflection of rejecting Qunari values. But we don't get this. We get nothing. Which leads me to my next complaint that DA seemed to have forgotten its own lore. And speaking of lore, none of the decisions you make in the other three games mean anything so you can just play this one. Your inquisitor is on screen for 3 seconds.\n\nIf there's an issue it was ancient elves. No matter what it was the elves. How is this engaging at all? It ruins the complexity of the lore when you can just point to it and say \"haha those whacky elves.\" The story can be boiled down to Ancient Elves ruin everything. And it's not a good story.\n\nMy last complaint is the character design and art direction. If you played the other games you will see it's always been grounded. This time we get very cartoonish looking characters like I'm playing a rated T game. The darkspawn look cartoony and goofy not at all like they have in previous games. I do like the color. The first two games were a bit very dull. It's become a joke that DAO is very brown. Inquisition we start introducing color and dynamic settings. DATVG introduces a very strong color palette. Personally, I welcome this. I'm tired of fantasy games being muted. I also am in general tired of dark fantasy, so I welcomed the new direction. It just wasn't handled well.\n\nSo what did I like? The character creation is amazing. So many options such as height sliders which I've never seen. Long hair that come with physics in the base game. I wish all games had CC like that. I made the character I envisioned in my head. There's a whole subreddit dedicated to making certain people with base game sliders. There is also hair inclusive of Afro textures and probbaly the most expansive I've ever seen. \n\nAgain, I love the color and the settings. I loved the crossroads. That's it. Hate the story, characters, and gameplay.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Yeah it's not good!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Is no good.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "No thanks, I'm fine without woke slop.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Absolute dogshit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Woke filled trash. Do not buy.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "fuck sb！\nfuck sb!\nsb have no dick!\nfuck sb!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DONT !!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "way too gay",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Garbage",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "mehhhh..... 50/50",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Trash",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "bro.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogwater",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "nah",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't normally post reviews and when I do, they're usually memey and positive. But just this once, I'll break that silence and post my first negative one. \n\nI've been a long time fan of the Dragon Age series. It's been one of my favourites since I first played Origins. I even enjoyed DA2, where others hated it or consider it the worst in the series. It's actually my favourite! Inquisition is a close second for me. \n\nDragon Age the Veilguard does not exist in my canon. This game is absolute garbage. Don't get me wrong. It's not the politics of the game that make it trash, it goes far beyond that. This game is a layered *mess* for multiple reasons, and the politics are only one small part. \n\nThe good: \nI enjoy the gameplay itself. The way the combat plays is not that bad. At first, I disliked it because I was expecting the classic combat style we saw in Origins and that was reprised for Inquisition. It leans into tactical play (which is not my strong suit admittedly) and here, we lean even further into how I feel DA2 played. Ultimately, the combinations are satisfying, it feels punchy enough and I actually play on a higher difficulty than I normally would for a DA game. \n\nThe bad: \n- The camera is jank. Switching from combat to non-combat is weird as hell and it resets the camera in the oddest manner. Worse, if you're in an enclosed space, it becomes a jittery mess that makes me sick to even look at. I had to turn camera shake to 0% just to deal with it. It's awful. \n\n- The lore has been fucked with pretty hard. I could go on and on about it, but essentially, there's a fair amount of established lore that's just been revised, interpreted very strangely or nay-sayed by characters for no good discernible reason. The biggest issue with this is that it's a big slap in the face of old DA lovers like myself. We're essentially being told 'that thing you loved? It's shit so you should feel like a bad person for liking it'. That's how it feels, at least. \n\n- They've removed player agency. Dragon Age was about playing a character who was either good or morally grey, who wanted to save the world (or city, for DA2). You could be an asshole to people sometimes, you could choose to kick companions from your party, you could have intermittent conversations with them whenever you liked AND you could also choose to NOT recruit some. For some unknown reason they've taken these options away. I HAVE to recruit every available companion. I CANNOT kick them from my party anymore. Yes, I can choose not to engage with some, but I no longer have the choice to leave them out of MY story at all. This is very anti-Dragon Age to me. \n\n- Leading on from this one, Taash is an issue everyone has mentioned already. I think things here are more nuanced than most people really care to mention so I will attempt to unpack it at greater length. Firstly, I don't have an issue with a character being non-binary, let alone a person. Disliking a character who -happens- to be non-binary does not make me a bigot no matter what people will tell me. What I dislike about the character is not their identity, it's how poorly it was written and represented. Rather than finding a way to naturally incorporate their identity struggles into the world as it is, the writers chose to be incredibly on-the-nose about it and lore-breaking. My immersion is ruined and that's one of the reasons I take issue with the character. Rather than using 'non-binary' as the language, just find another way to describe it. You don't even have to -give- it a name or label and in fact, if you do that, I think more people will be able to identify widely with the character as a whole. Those who simply don't feel they belong can identify with the character, and not just those who are non-binary. \n\nTo continue from that point, Taash also uses pretty misogynistic language and I feel as if this is really poorly done as well. I understand that the point is trying to convey that this character has an issue with womanhood in themselves and is grappling with that, but the way they speak about womanhood as a whole is incredibly toxic and perpetuates some awful anti-women culture and rhetoric that is already far too prevalent in video games. When women are constantly ridiculed, sexually harassed and given death or r*pe threats online for just participating in gaming communities (I have personally experienced much of this), this is not something that needs to be written in this way. You can do it another way. We can easily understand what's going on when Taash expresses how much they hate dresses or skirts, and how they don't identify with other concepts relating to femininity without the emphasis on 'how awful it is to be a woman'. I happen to like being a woman, thank you very much. In essence, it feels very out of touch. \n\nFurther to that, the way they treat their mother is horrific. This woman has been raised within a very rigid society that dictates who does what for the -rest of their lives-. She broke away from that to protect her child, which already shows a very open mind for someone who was raised within such a structured life. Why, then, do the dialogue options offered not allow us to truly bridge the gap between the parent and child? We can only realistically look like an asshole for agreeing with Taash--in my opinion, at least, because I sympathise with a woman who has left EVERYTHING behind to raise her child safely and is trying to understand said child as best she can in the ways she knows how--or we can look like an asshole for agreeing with the mother, because if you don't agree with Taash you're a dickhead. Why are those my only real options? Can I not encourage Taash to be more understanding and encourage their mother to recognise that without the Qun's structure and ideals, her child has developed very differently? \n\nThere is so much wrong with the way this character was written that they come across feeling like the epitome of virtue signalling and it's uncomfortable to be around. Yes, I do not have to engage with this character but I do HAVE to recruit them. Even if I don't want to. \n\n- All of which leads into my next point. Where is my personality? I can no longer choose how nice or mean to be. Every aggressive or stoic option of dialogue available to me makes me the nicest and gentlest person in Thedas. I can no longer have my own opinions on things like blood magic (beforehand, you could say you either approved or disapproved of it) and now the game has just decided much of it for me. I can no longer BE the morally grey, gritty person I enjoyed playing back in the day. I'm just a sanitised, rainbow happy nice person who wants everyone to get along. There's no interpersonal conflict anymore and you rarely do things that make your companions -disapprove- of you. I hate it. I miss the days where I could choose things for myself. Player choice was always a big thing for Dragon Age and they've removed it pretty much completely. If I wanted to play an RPG where I play as Geralt or some other pre-written character, I'd have played one of those games. This is not what is expected of a Bioware game. At all. \n\n- The tone is completely off. I understand that comes primarily from writing and rewriting issues due to development changes. I won't harp on about it too much but the gritty, dark, moody world I love and know has been reduced to \":DDDDD omg the elven gods are running around let's take them down guys! <insert marvel one-liner here for zany effect>\". Enough said, really. \n\nSEE COMMENTS FOR REST OF REVIEW",
      "voted_up": false,
      "votes_helpful": 1033
    },
    {
      "review": "For  a longtime fan, this game isn't disappointing. It's not bad. It's a *betrayal*. Everything that drew people to this series - the dark fantasy, the grey morality, the choices and consequences. the ROLE PLAYING - they're all gone, and what is left is a sanitised piece of bargain bin shit that attempts to draw people in with flashy fight scenes and quippy dialogue. \r\n\r\nThis is the Game of Thrones series finale of the gaming industry. Thedas had been my favourite fictional world for nearly 15 years. I *adored* the lore. Now? I don't care at all. I have completely lost interest knowing that the world states I made don't exist. Every single choice made in the previous 3 games is ignored. Not in the sense of the devs making their own choices on your behalf, but in the sense that if there was a choice about something in a previous game, it is not even referenced in this. \r\n\r\nIf you have played the first 3 games, and are looking forward to finishing the series, don't. Avoid this travesty at all costs. At this time I am posting this, it is on gamepass for free. Still avoid it. It is not worth playing, EVEN FOR FREE.",
      "voted_up": false,
      "votes_helpful": 523
    },
    {
      "review": "I grew up playing Dragon Age DA:Origins, Dragon Age II, and Inquisition. Sure, Dragon Age II was a bit of a hot mess, but after replaying Origins a million times, it still blew me away in its own way. Even if it wasn’t the best, I’ve got a deep love for the trilogy. Honestly, these games got me into storytelling and made me want to become a writer.\n\nIf you’re someone who loves RPGs like Skyrim or story-rich games of any kind, just don’t get this one. As someone with a literary degree, I’m telling you this game’s story is as flat as a fart. It’s not worth your time if you’re looking for depth or a solid RPG experience. The developer and publisher basically took something I loved and wrecked it.\n\nTo be honest the biggest thing that ruined this game was the social and corporate politics around it. They wanted it to fit a certain agenda so badly that it killed the soul of the game. And yeah, as a gay man, I find it frustrating that some people defend it just for the reason of inclusivity. Dragon Age was always inclusive; you didn’t need to butcher the writing to prove a point. The result is a game with FLAT characters, SANITZED dialogue, and no real player choice.\n\nJust to give you an idea of how much I loved Dragon Age; I was the guy ordering Dragon Age novels before The Veilguard came out. I’d fall asleep listening to lore videos. And this game just wrecked that love for me. I can’t even comfortably replay the old games knowing this is where it leads. It just turned something I cherished into something I can’t enjoy anymore.\n\nI’m sitting here a year later, and I had to tell myself to have some self-respect. I spent MY MONEY on this game, and I’ll never willingly go back to it. If you’re still going to try it, I hope you find something to enjoy. But as someone who loved Dragon Age, I’ve turned my back on it because they turned their back on fans like me first.",
      "voted_up": false,
      "votes_helpful": 649
    },
    {
      "review": "Dragon Age: The Veilguard is BioWare’s departure from the grounded complexity of Origins, trading its layered role-playing roots for a flashier, more simplified adventure that rarely captures the soul of its predecessors.",
      "voted_up": false,
      "votes_helpful": 238
    },
    {
      "review": "It's almost ruined whole Dragon age for me, so i'll just pretend i never played it and it doesn't exist, And i would not recommend spending money on it especially if you are dedicated fan of the series\nIf you want to kill time with a mindless gameplay - go ahead. But you won't find a satisfying continuation of the original dragon age games, neither you' ll find a compelling new story in the universe. It's quite depressing, really",
      "voted_up": false,
      "votes_helpful": 316
    },
    {
      "review": "An inoffensive game, but certainly far below the quality you'd expect from past Bioware. Lots of grating characters and Sunday morning cartoon-style dialogue that tries to be witty but not quite getting there. Combat is ok, but not particularly deep. Overall, tone feels very much at odds with the style established in previous games.",
      "voted_up": false,
      "votes_helpful": 116
    },
    {
      "review": "Lemme start: I know there's already plenty of hate for this game.\n\nIt's justified.\n\nIt robbed the soul of Dragon Age, to make a sloppy story with shallow characters and writing that doesn't care about the previous games, nor the fact Dragon Age was a Dark Fantasy. The thing people loved the most about these games, the gritty characters and world building, all of it.. thrown away for the most uncomfortable experience I've had with a game in a LONG time, and not the good sort of uncomfortable that challenges my beliefs(like previous DA games). Shit, I only FINISHED the game because I'm hopelessly in love with Solas. And you know what? That payoff was crap. I waited a decade to see the end of my Inquisitor and Solas's story. Sure, moments were cool, but it was over all just like... empty and felt undeserved or not fleshed out. Felt rushed and like a lotta bs in the storyline.\n\nShit, I started to skip cutscenes early on and still feel like i missed NOTHING. I knew what was going on, what the next step was, blah blah blah.\n\nPerfect example of this. I'm a part of the LGBTQ+ community, I'm nonbinary. The nonbinary character's story was supposed to be something I could resonate with and follow, right? Wrong. It felt forced, like a shitty stereotype of what a queer character is expected to be, and a shitty storyline where there is no true pay off. It disrespects the world of Thedas, it disrespects the hardships of characters. Veilguard makes everything all neat and friendly and 'hehe we're all besties and theres no conflict ROOOK cant fix :)'\n\nI hate Rook, the bland hero who is inherently 'good' no matter what. Ew. Ew. Where's my asshole playthrough. Where's the chance to do great evils so that our choices MATTER? Why does everyone stroke Rook's ego? It made me wanna throw Rook off a dragon mid-flight.\n\nIt hollows out everything that mattered to anyone who enjoyed the previous games. The people who waited for a decade, and hoped this game would be *okay*. It betrayed those fans who wanted to believe in the hard work and creative team. \n\nWhat we Got was EA shitting in our breakfast, firing Devs left and right, handfisting representation and this weird ass 'found family' shit that was so inorganic, I genuinely got pissed when i got an achievement about it.\n\nIs it the devs fault at bioware? To Some extent, sure. But the thing is, they were dealt, I believe, an extremely wretched hand. By EA, the publisher, and the 'shareholders' who decided \"you know what? make this a campy easy to follow safe non-controversial Marvel Cinematic Universe style game!\" \n\nTo every single Publisher and Shareholder out there who snuffed the spirit of dragon age, I hope you are forced to play only Veilguard for the rest of your life.\n\nTo the devs who tried, who gave up or were lost in the shitstorm: sorry to say, but i couldnt enjoy almost anything in this game, outside of petting cats. \n\nTo the OG Dev team, the people who created and had the spirit of Thedas: Take it to a different studio, take it to a private studio. Your work matters, the legacy of the older dragon age games is still loved by many people, including myself. Your names, your work and passion, I will try to follow along to see what you do next. Thank you for your gifts to the world.\n\nTo people who enjoy Veilguard: I'm shocked, since it's not even a roleplaying game anymore. Is it the action? The environments? I don't understand, but please don't say nothing is wrong with this game. I appreciate that you find value in it, and I'm thankful someone does, but I personally won't be able to agree with you on pretty much anything.\n\ntl;dr: Game is a shitshow that bastardizes everything the previous games did and pretends to be quirky and fun with very little to no actual impact of play choice, the fact EA and shareholders ruled the development is proof enough to me that I won't be sticking around for anything from Bioware ever again. The studio means diddly squat, its the people who worked there, the artists, writers, the staff who worked on the older games, that were valuable and the spirit of thedas.\n\n(edited for minor grammar fixes)",
      "voted_up": false,
      "votes_helpful": 167
    },
    {
      "review": "biggest disappointment of my life, the writing felt so disconnected it's easy to see what parts were written by veteran staff that quit and what was written by... whoever's in charge now lol",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "While the gameplay itself is actually pretty fun at times, its very repetitive. \n\nThe main problem with the game is that they've stripped the game of all \"dragon age\". They basically wiped the game of all established lore. You've got dwarfs casting magic, nobody hates elves or mages. The writing is god awful and the storyline is terrible.\n\nIts not a dragonage game its a modern ea action game wearing a dragon age skin.",
      "voted_up": false,
      "votes_helpful": 43
    }
  ]
}