{
  "positive": [
    {
      "review": "The amount of love that is displayed in this game is something that deserves respect. I honestly didn't had much expectations other than sort of a cozy game with an interesting 2.5D pixel art .. but boy oh boy... what an experience.-\n\nFrom the game mechanics itself, to the whole story, the sushi bar gameplay, the animations, everything, its just excellent.\n\nNot only its a beautiful game, but it feels like a tribute to gamers.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "This is one of my favorite games to play on the steam deck. \r\nAbsolutely rad 2d game with retro mini games all the way through. \r\nAs soon as you think you know how to play, a new mini game comes along.\r\nThe story is simple, but fun. The combat is also pretty simple but also very fun. \r\nGet the extra version just to give the devs more money, seriously. I have almost 80 hours in it \r\nand who knows how many unreported due to playing off line on the deck on flights. I need to hook that thing to wifi here again and see what happens haha. Seriously, no regurts, not a single one.\r\n\r\n10/10 This is peak gaming.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I'm not exaggerating: this is one of the best games I've played recently. I didn't even bother playing it long enough to review it. I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "⭐ Dave the Diver ~ 10/10 After 6 Hours of Pure Joy\r\n\r\nAfter just six hours in Dave the Diver, I am absolutely hooked. This game is the perfect blend of chill exploration, goofy charm, and unexpectedly deep management gameplay. One moment I’m diving through the Blue Hole hunting for rare fish, soaking in the gorgeous pixel art and dreamy soundtrack and the next I’m sprinting around my sushi restaurant, serving customers, upgrading gear, and obsessing over the next menu idea like a proud little ocean chef.\r\n\r\nThe pacing is incredibly addictive. Every dive feels rewarding, every upgrade feels meaningful, and every new character adds charm and personality to the world. The writing is quirky in the best way, and the game constantly surprises with how much variety it packs into each session. It’s the kind of experience where you say “just one more dive” and suddenly an hour has vanished.\r\n\r\nFor my first six hours, I’ve been smiling nonstop. Dave the Diver is cozy, adventurous, funny, and full of heart. If the rest of the game keeps this energy, it’s easily one of my top indie experiences in years.\r\n\r\nFinal Verdict: 10/10 ~ Already obsessed, already recommending it to everyone. 🌸🐺🌸",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I love the story, the animations and art, and all the fun characters full of personalities. The diving, the mini games, and running the sushi restaurant is exciting, fun, and warm and cozy. The downsides? i'm pretty sure the crappy boss fights gave me some type of new mental illness",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I like diving. I like Dave. I liked this game… Is it a valid complaint that there is almost too much content? Some minor frustrations about dying and losing all of my stuff, but that’s probably a Me problem. It was nice; felt like being on holiday.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "An excellent game in every aspect, including a dozen mini-games within it.\r\nMagnificent music, great graphics, enjoyable gameplay, a funny (and most importantly, interesting) story, convenient controls, and wonderful animations.\r\nAs for the cons, I can only point out the overly large number of mini-games, possibly the final boss fight (a matter of taste), and the stealth mission.\r\nAgain, my respects to the soundtrack creators.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good game. It's like The Little Mermaid but with more blood and screaming and less singing and dancing, and the main character is a little obese but he still could use a bra so very similar I think.\n\nDave is a humble people pleasure who is constantly taken advantage of, made fun of and rarely achieves any recognition. He dives for fish at day and serves it at night because who needs sleep when you have profit??\n\nHe catches fish like he's trying to pay off every debt he's ever had and still somehow has the energy to serve sushi at night. He fights giant squids and jellyfish and he nearly dies every day but still shows up to work like nothing happened.\n\nHe doesn't eat and despite the excessive exercise he is still fat. But he is also strong fat and can carry half a ton on his back.\n\nDave is also the only person in the world who has defeated multiple great white sharks using weapons such as a rubber chicken, a tennis racket and a dead fish.\n\nHe is so broke he has to look for ingredients like olive oil, black vinegar, soy sauce, curry, mayonnaise and cat food in the depths of the ocean. I think he lives on the boat and there's this guy there who never ever leaves and who tries to sell him illicit stuff.\n\nDave is underpaid at work, abused by everyone and he never gets a break. He needs to go to HR but he is too nice for that. I just want Dave to be happy.\n\n10/10 hello how are youu I am undar da watar please help me here too much raining wuuuuu",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Harpooning adorable fish by day, serving them as high-class nigiri by night. One moment you are battling a megalodon, and the next you are sweating profusely while trying to grate wasabi. If you’re looking for underwater adventures and delicious management, this is your game! \n\nCaution: This game may cause an uncontrollable, immediate craving for sushi",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "During the day, Dave dives for fish.\r\nHe completes missions to fulfil everyone's wish.\r\nFeed the cat.\r\nAt night, serve the fish from the sushi mat!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Dave the Diver is pretty simple and straight forward. It's in that simplicity that you go from humble beginnings to much deeper depths. Always trying to capture more slices of fish to upgrade your recipes. As someone who wants to upgrade every recipe to max. It usually take me a while to finish one dive. While trying to maximize inventory and hauling up the fish worth the most. The changes in scenery are nice, and also the changes in aquatic life. Never know if you're going to net tuna, marlin, or some other large fish. All in all, Dave the Diver is a fun game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cool game, the idea of eating fish is a cool concept.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game simply because the name sounded funny. I didn't expect anything crazy or out of the ordinary, but boy was I wrong. The concept is simple, unique, fun, and relaxing. It may seem repetitive after a while, but I was addicted nonetheless. I highly recommend this cozy game to anyone who is willing to give it a try.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game based on the reviews and after playing for a while I can say that I really like and recommend this game, the characters animations was something that totally took me by surprise. Recomended for a good and chill adventure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely hilarious, endlessly fun, and impossible not to love. Easily one of the best indie games out there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really cool game. Definitely going up my fav list. One thing wish there were more mechanics to it like in a fight more keyboard pressing more mouse or maybe even a bit more challenging but so far amazing story amazing art everything is cool i love it!.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game is so super fire but i feel like it does have alot of content like bloat.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Reminds me of flash games era of gaming - light, humorous, adventurous, fun, a lot of task management in a no pressure environment (for now)\nRegular patches (balance, bug fixes, etc.) 2.5 years post-release\nGreat find for 8 bucks!\nStardew Valley: Flash Game Diving Edition",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game was entertaining, it never gets boring, plus by the end of the game, you still get introduced to new mechanics, which was cool, plus all the collabs they have, I didn't expect a Balatro mini game when I visited the sea village.\n\n 9/10 is probably not for everyone, but I still recommend this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't believe I never left a review. I had played this game a ton during the first year of my streaming. It's such a calming and fun game. The pixel art is beautiful and it does have it's moments of challenge. I strongly recommend it to anyone looking for a great game that's got a little of everything or are just fans of well crafted pixel games No spoilers from me, discover for yourself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I dive, fish tries to eat me, I catch fish, I serve fish as sushi to happy customers - rinse and repeat.\n\nIt may seem simple but Dave the Diver's such an addictive game, with a great story, lovely music, quirky characters, lots of variety, and I love all the different areas we get to explore with Dave. I also cannot believe how much there is to do!\nJust don't pick up this gam and think you can do \"just one more dive before logging off\", because you will be stuck playing for hours more than intended. You have been warned :)\n\nThe only cons, in my opinion, is that you sometimes get forced into stories or missions that you can't leave unless you complete them. And I'd like a feature to toggle off the comments an animations after seeing them the first time, because after 50 hours, holding C every time they appear, gets a bit old. Don't get me wrong, seeing Bancho creating a new dish is inspiring!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dave, let me dive with you!\r\nDevenu accro à ce jeu, je le lance presque tous les jours pour jouer une heure ou deux. Déconnection et satisfaction assurée",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, if you haven't thought about picking up this game (even when it's on sale), you're doing yourself a disservice. Dave the Diver really lives up to all the positive reviews it is getting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've only 3.6 hours of this game but I can already tell it's one of the best games I've ever played. \nThe writing, the controls, the cut scenes, the characters, the music, the game play ... it's solid and delightful. The introduction to the different components is well timed, slow and steady so that you don't become too overwhelmed with your responsibilities and options.\nI had this on my wishlist for so long, thinking I wouldn't enjoy a diving game because, how could that be relaxing? But this game strikes the PERFECT balance between being cozy, relaxing and challenging. Like Stardew, you will find yourself saying, \"Just one more day,\" at 1 am on a work night.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i finsht the game today and it was purfect i rely enyod the game and i stl pley the game and its very relaxig",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I can't believe I didn't play this game sooner. Had me hooked from the start til the end and even more after that. A well worth $15 and nearly 60 hours spent. Best game I've played this year by far. 9.9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game so much I played and completed it twice on both Switch and Steam... think that says it all hhaha",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Simply Outstanding! The pixel art is great, the content is fantastic and so many mini games and stuff to do. Well worth a buy!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Charming, lighthearted game. 10/10 would recommend this to anyone at any time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The literal only flaw for me is that the hitboxes aren't great. If the concept of this game appeals to you, it is a must buy, 9.8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "stunning pixel art and enjoyable mechanics overall… but the real MVP is clearly Bancho and his cooking animations, by far. really recommend it !",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very relaxing extraction (diver?) game. \nNice retro-style visuals + very good soundtrack.  \nMy only gripe are the dialogues. Though, occasionally the characters can be funny and interesting, most of the time it's blah blah blah listen (read) to me talking about my story which could be summarized in a few words and bring me this, bring me that.. so you end up skipping dialogues because you just want go back diving or work on your restaurant.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on console before but saw offer on steam and wanted to play again on PC this time. Great game and value worth for the price. Looking forward to the DLC next year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I keep coming back to Dave the Diver whenever I need to relax. It is the perfect game for mindlessly fishing and exploring the sea. The cooking part is great too. All the characters are quirky, adorable, and fun to interact with.\r\n\r\nI'm really excited for the \"In the Jungle\" DLC to come out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly just bought the game to swim in the ocean and look at cool fish.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I put this game off for way too long. I bought it on a whim and I've been having so much fun with it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my new favourite games ever! \nBeautiful art, engaging story, so much to do! There's something for everybody! If you like cozy management style games, you've got a sushi restaurant to run, if you like exploration and to have kinda an open world, you dive and fish (and \"battle\" through the waters), if you like a game with an overarching story, you can play it for that alone and uncover the main mystery!\nYou can see how much effort developers put into this, how much they care for their audience's enjoyment and the beautiful piece of art they made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, just be aware like every 2-3 times you dive you'll get locked into a side quest you have to do with dialog you can't skip. That does make the 'relaxing' game rather annoying sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game to play, and doesn't slow down too much even after playing for a long time. Though maybe not the most intuitive and the controls take a while to get used to, I still struggle with scrolling through stuff for some reason.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The guy dives and fishes all day, sometimes fighting off gargantuans, and works at a sushi resturant probably for months just to still have a caseoh build :skull:\n\nMany activities to play with casual and relaxing gameplay. On top off nice immersive cutscenes that are very enjoyable to watch. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game that doesn't get old, specially considering they keep releasing DLCs every now and then. I hope they someday release a sequel, but meanwhile I'll keep running through this game once and again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool style and fun gameplay, ill probably be playing this for a while",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dave the Diver is spiritually one of those games you'd play on coolmathgames (my fav was always learn to fly) if it were given the resources to become an entire game with a mind boggling amount of content. Every time I settle into a routine with this game it, without fail, introduces something new to shake up the formula and give just a bit more depth to the game as a whole. It's a really amazing, really cozy game that you can't get enough of once you pick it up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fun! You can fish and cook your catch at the restaurant to earn a profit and upgrade your tools to make fishing easier!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i might be late for playing this game, but this game literally one of the best game that i ever play! it was soooo fun while playing this game <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun! Not to mention, the cooking cutscenes are (dare I say it? Lol) *chefs kiss*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only played for like 2 days and already have 10+ hours in. i love pixel graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Indescribable Indie Inspiration! \n\nFrom the charming art style to the constant addition of easy to grasp and fun mechanics, this game has something for everyone. Incredibly chill, easy to relax while diving, and an all around great time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game should be one of the top class pixel games.\r\nI`ve played 44 hours, and it`s not enough. the story line could be longer, the area to explore could be more or bigger.\r\nI enjoy diving so much from this game, the design of the game is perfect.\r\nHope more DLC could be made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice love the story and the gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've played lately.. \nLove the ending songs for the story!\n\nCan't wait for the new expansion/DLC The adventure into the jungle one :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absoloutely goated game. Devs make it very obvious that love was put into making Dave the Diver. Also, makes me crave sushi. 👍",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really wish for more of this game, like a sequel or a DLC that adds more to the gameplay loop. Its coziness kind of reminds me of Stardew Valley, you never \"lose\", you just have \"happy little accidents\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the art direction in this game, the tons of content, and how unique and funny the characters are. such a fun and unique experience\r\n\r\nPLAY THIS GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best casual rpgs that I've ever played. From the gameplay, to the soundtrack, to the fishing, to sushi restaurant, Mintrocket outdid themselves with this. I patiently wait for whatever else they do with this game. I gladly recommend this game to anyone looking for a chill/casual rpg that has some management thrown in!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game with lot of stuff to do. Haven't finished it yet but I already sunk 50h in it. \r\nWell worse the price!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played long yet but so far this game has been really enjoyable. I like the art style and exploring the depths too. Honestly there is so much to do in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dave the diver is the most chill bloke. The concept of managing a sushi shop was truly refreshing, I never thought it would be so much fun to catch fish in a video game, but Dave, the missions and the beautiful art hooked me like a little wittle fishy. I love sushi, the game gave me some food to look forward to eating and the narrative was very wholesome. Quite relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game definitely doesn't need my review, but here it is. \n\nThis game is a perfect example of a bunch of tiny little systems and mechanics coming together with great writing to create a game that is approachable to just about anyone yet still very satisfying when you to pull things off just right.\n\nGreat humor, amazing art, fun crossovers, beautiful music. Worth the full asking price and an absolute steal when on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun mechanics, and the story is very interesing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game, it's great for just sitting down and relaxing. The artwork is awesome and the music is just as good. I also LOVE the DLC for this game, I've not finished it but It's been amazing so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to relax, and explore. It's the type of game where you can play without thinking too much, just go with the flow to explore the oceans, and the jokes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game! Used to be a gamer when I was a kid, and MANY years later (and I do mean \"MANY\") I've been able to pick this up and play it on my mac with a budget controller. Hopefully this will warm me up to other games again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting gameplay that mix together a few genre, creating a special chemistry. I really enjoyed the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an incredibly relaxing, stressful, and fun experience this was. You can tell this game is made by people who absolutely love what they do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The love and passion invested in creating this game resulted in one of the best productions I played this year.\nEach character has its unique style, quests are interesting and the difficulty of the game is just in the right spot for me. It's not easy not hard. \nGame is not rushing you into anything, so you can progess on your own pace and learn all the mechanics.\n\nAfter almost 8 hours of gameplay, I feel like I am only scratching the surface, as the longer I play, the more events, mechanics, characters, enemies I encounter. \n\nDo not hesitate, it is a gem",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fishing... wait it's not just fishing... it's not just a fetch quest game... and not just a restaurant sim... Oh it's also a stealth game... and also pokemon??? OH WAIT IT'S A ALSO RHYTHM GAME? AND WAIT IT'S ALSO BALATRO?\n\nThe more I play the more I appreciate the time and effort put into developing this game. It's truly a gem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game. Relaxing music, good gameplay, love all the minigames and extra stuff, and an amazing ending",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun and addictive, although it makes me crave for eating sushi, which I usually can't afford.  It is unlike any other of the games I usually play, which tend to be more serious and warlike, but it has a great nostalgic quality about it that reminds me of old school NES games (yes, I'm that old) but with more in-depth game play and details.  I like the characters, the dialogue, and the relaxing vibe of this game.  I found out I'm terrible at pouring green tea for customers, but I'm determined to become an expert...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it at 1 am\ncontinously played it for 16 hours straight its so good\n\n8.5/10\ncould trim down on the minigames that dont go with the base diving game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would really recommend this game as a game to just sit down and chillax. Can get repetative SOMETIMES. But all the stuff to do and see and places to explore keeps it fresh, while keeping your attention. overall its a really fun game and would 100% recommend. (P.S. it'll take you a while to finish if your looking for a game you can play over a span of days or maybe even weeks or sum. worth the price. lowkey would pay more for it)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and addicting gameplay loop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like im part of scary interesting video clips, but i get to alter the course of my actions so that i live",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful graphics, funny and engaging story, endearing characters, charming blend between pixel and 3D graphics. So much to do but capability is staggered so you don't get overwhelmed by all the functionalities. Lovely game <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a good change of pace from other games that dominate the scene, a labor of love.  Scratches the collection and hunting itch, good progression system and add-ons.  Arsenals, recipes, boss battles, worker utilization, restaurant upgrading ... wish I'd tried it sooner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game, very relaxing but at the same time challenging when it needs to. Great story, lovely visuals. Easily one of my favorite games ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most fun I've had in a long while. Tons to do with a lot of content. I may even go for 100% achievements. I recommend this game for everybody.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I expected something like Dredge, but it actually feels like a mix of Stardew Valley, Overcooked, Subnautica, and more. Such a generous game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got this game back in May and played it thinking it would at least interesting.\r\n\r\nNext thing I knew, I put eight days and over 60 hours into this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought it yesterday. Played 16 hours.\nAt this point Dave isn’t the diver — I am. Send oxygen.\n\n10/10. Would accidentally build a sushi empire instead of sleeping again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly can't remember the last time a game hooked me so completely and unexpectedly as Dave the Diver. What looks like a simple pixel-art game is, in fact, an incredibly deep, charming, and utterly addictive blend of genres that delivers a truly fresh experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay-\r\n☑ Very good\r\n☐ Good\r\n☐ Nothing special\r\n☐ Okay\r\n☐ Bad\r\n\r\nGraphics-\r\n☐ Masterpiece\r\n☑ Beautiful\r\n☐ Good\r\n☐ Will do\r\n☐ Bad\r\n☐ Awful\r\n\r\nAudio\r\n☐ Amazing\r\n☐ Very good\r\n☑ Good\r\n☐ Decent\r\n☐ Not too bad\r\n☐ Bad\r\n\r\nAudience\r\n☐ Kids\r\n☐ Teens\r\n☐ Adults\r\n☑ Everyone\r\n\r\nStory-\r\n☐ Lovely\r\n☑ Good\r\n☐ Average\r\n☐ Not great\r\n☐ None\r\n\r\nDifficult-\r\n☐ Just press a bunch of buttons\r\n☑ Easy\r\n☐ Significant brain usage\r\n☐ Easy to learn / Hard to master\r\n☐ Not so easy\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\nGrind-\r\n☐ Nothing\r\n☐ Only if you care about leaderboards/ranks\r\n☐ Isnt necessary to progress\r\n☑  A bit grindy sometimes\r\n☐  Average grind level\r\n☐ Too much grind\r\n☐ Insanity\r\n\r\nGame Time-\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ Depends on you\r\n☐ Endless\r\n\r\nPrice\r\n☑ Just buy it\r\n☐ Worth the price\r\n☐ Wait for sale\r\n☐ Maybe if you have some spare money left\r\n☐ Not recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hello, it is I, the fish. Swimming around, minding my own business. The ocean is a beautiful place where\nOH NO ITS THE FAT GUY CHILDREN SWIM, SWIM LIKE YOUR LIFE DEPEND ON IT PLEASE OH NEPTUNE PLEASE\n\nFun game, but It got meh kinda quick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a game!!\nThe animations and art style are just awesome.\nA totally relaxing and fun game to play! Charismatic characters and some incredible crossovers!\nI believe this platinum was one of the easiest to get because from start to finish the game was fun without any boring or exhausting grinding.\nPretty sure I’m gonna replay it a bunch more times!🖤",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty amazing and i absolutely loved the concept of this game ,the gameplay loop is fun but feels repetitive at times yet addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not long after starting Dave the Diver it soon becomes clear that there's a lot more to this game than just calmly diving for fish.\r\n\r\nIn fact, it's surprising the variety of other activities you can do. From running a restaurant and elevating its popularity, growing produce for your restaurants, to creating and upgrading specific gear to improve your ability to catch more elusive underwater creatures and even defeat sea monsters.\r\n\r\nI particularly like the creepy night dives, where the strange creatures that lurk in the depths can quickly have you scrambling to the surface before they ruin what would otherwise have been a good nights catch.\r\n\r\nWhatever Dave is tasked to do, whether below the waves or not, you will find there is more than enough to keep you occupied here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dave the diver: A great game about diving into a shapeshifting ocean with all kinds of Fishes, experiences, zones and bosses.\nI strongly recommend this game due to how relax and laid back the gameplay can be, how entertaining it becomes the longer you play it and how the difficulty scales depending on how the player goes around their playthrough, without losing the main story line. From just diving into the ocean, gathering fishes, materials and sometimes even fighting bosses, while discovering more about the whole world it has hidden to managing a restaurant, doing different dishes, hiring people to work on the restaurant, sending them to gather spices, upgrading them and the restaurant, and having chef competitions as well! \nThis game has everything it needs to be fun, relaxed, tense and never boring (as well as easter eggs from different games of diverse franchises)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game packed full of all kinds of adventures, quite addictive in the best way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I thought I was playing a diving game. Turns out I accidentally applied for three full-time jobs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those surprising games. You think, \"Oh, this will be a nice relaxing fishing game!\" Then boom! All kinds of different game modes and a fun interactive story line. Along with the release of some fun DLC. The art is absolutely beautiful and the game play is a great time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. I didnt think it was going to be any good, how wrong I was. Extremely addicting and now that I have completed it and all the DLCs I am sad there isnt another game like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just six hours in...the game is funny, entertaining and the gameplay satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has great humor, easy controls and no unnecessary complex mechanics, just launch the game and enjoy!\nA great game for both Steam Deck or pc, be warned its addicting!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy Stardew Valley, then this game is perfect for you. You can manage a fish farm, a smaller land farm, and go fishing / fighting for supplies to advance quests / stock your sushi bar. Nothing feels rushed in this game, and there is no timer for how long you can stay diving (only oxygen tank timer that can be refilled if managed).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "About 10 hours in and I can confidently say this is one of the best games I have ever had the pleasure to play. Recently, games have felt boring and bland to play to me until this game was recommended to me by a friend, and boy oh boy. I thank him every day for this recommendation because this is genuinely one of the most engaging and fun cozy games to sit back, grind, and explore new things. The whole game keeps you interested with new things to do, explore and work for. I am going to force my future child to play this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The cut scenes are crack up\r\nfun game, good little wind down after a big day of work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best hidden gems on Steam. I'm quite amazed at the game's quality and ability to keep the player engaged. Looking forward to more from this developer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished the game on my switch a couple of months ago. The story is well written with funny bits that come along from time to time. Gameplay-wise it's a mix of relaxing and stressful but it's heaps of fun overall. The music is mostly calming and easy to love, the collab with mxmtoon is a fantastic addition!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a really wonderful and great experience playing this game. It's a really fun and addicting game. I didn't even realize that the game had already finish by this time. If I can turn back time, I would play this game again with the feeling of first time playing such a great and perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally finished it. At times, it felt more like grinding, but in general a very positive experience.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I understand a lot of the appeal for this game: the artwork is nice, every character is brimming with personality etc... but I have put 30 hours into this game and I am beyond frustrated with the gameplay loop. Or rather that the game wont leave me alone so that I can just play the fucking game. After every single single dive there will be a brand new thing to learn or person to meet or minigame shoved in your face that is not skippable. It has been 30 hours of non-stop tutorials. I just want to get fish and make sushi, and even more frustrating is that the new mechanics that are introduced I would actually like usually, but why for the love of fucking christ is something like the farm introduced but you are not allowed to use it at all until like ten real life hours later when otto finally decides its time for you to be able to buy seeds. I would genuinely enjoy 90% of the extra content if it just wasnt constantly shoved down my throat. Dave cant even move from room to room without another text box popping up, just for him to tell you \"its dark in here\". I thought for sure that at some point I could just play the game for a while, but for real, every five goddamn minutes the controls are taken away from the player and you are subjected to a thousand text boxes. Holy shit leave me alone for a while I was doing shit.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "It's OK at first. There's some good stuff here but the fun ran out pretty rapidly for me. The normal game play loop is very repetitive but is the best part of the game. Once you get tired of that it's over. I hated all the mini games, they all felt like a chore.\n\nAlso based on the way the game was described I expected much more procedural generation of the dive maps. It's very much static with minor changes which quickly means the exploration element goes out the window. There are a few map variations but not much. I understand why this is but I was sad on my 2nd dive when it was the exact same map.\n\nThe controls seem to be decided at random and are not assignable. It makes me frustrated. \n\nThe art style is a choice for sure. If you're into pixels you won't be disappointed. Not for me.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "There's nothing strictly speaking wrong with this game. Every bit of it is competently put together. Why negative, then? Because it is ALL tedium. Even what little bits of assistance you get in reducing tedium are soon replaced by a farcical level of additional tedium, all the way into the fucking postgame!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Really fun and addicting game until the mermaid section, after that its really hard to want to play again. Id recommend removing the mermaid section or making the minigames less dumb so that its worth playing afterwards.  I want to give a thumbs up because it was fun, but the fact that nothing will ever draw me back to the game makes it a thumbs down.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game has a great theme, aesthetic and gameplay. The first few gameplay moments were amazing.\n\nHowever, they keep adding more and more things to do that clutter the menus. And I want to play the game! Not the thousand of minigames!\n\nI like this game, but the fact that I can play it less and less the more I progress frustrates me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's pretty good at first, but it overstays it's welcome. The only reason I have so much playtime is it's SUPER long. 6.5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There's a lot of cool and surprising stuff in the game, but the core fishing and restaurant day/night loop is so dull that I just didn't want to play any more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Playing as Gabe Newell and making Sushi was fun, but I ethically won't stand for limited time DLC. Eat shit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't believe the Overwhelming Positive score.  Wildly overrated.  Yet another rouge-lite where you are forced to progress an inch at a time to pad the game.  The actual gameplay harpooning fish controls really poorly and the minimalist graphics make it extremely difficult to identify harmless objects and threats.  You also have to do all of these random things like serve food.  The writing is the typical \"lol random self-aware\" indie game tropes and nonsense.  The biggest problem. and I instantly refund any game with this glaring flaw... the game has non-stop screen tearing and there is no v-sync.  See ya later!!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game has a great theme, aesthetic and gameplay. The first few gameplay moments were amazing.\n\nHowever, they keep adding more and more things to do that clutter the menus. And I want to play the game! Not the thousand of minigames!\n\nI like this game, but the fact that I can play it less and less the more I progress frustrates me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I thought I would be into this game, but I'm really not. Exploring the sea for fish and ingredients is definitely fun. The restaurant is basically just automated, all you do is choose the menu - which started fun, but quickly becomes a quick chore to do.\nThe game then SWAMPS you with things to do. All of a sudden you can't just go fish and do what you want because there's 6 different quests or story elements, or your day being railroaded by a boss event.\n\nI thought it was a game about catching fish and running a restaurant, and they honestly seem like the smallest part of the game. They're a means to an end to do all of the quests and story parts. I don't find it chill, and can't recommend",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Getting stuck and loosing 30 minutes of progress is so fun!!! How is it still this bugged after all this tim",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the absurd amount of brain dead time wasting mini games is insane, defrost the camara lens. How much time dyou think you can waste before you get on the nerves?",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's pretty good at first, but it overstays it's welcome. The only reason I have so much playtime is it's SUPER long. 6.5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not working at all with my Xbox controller, still showing keyboard cues in-game. The controller is connected and works perfectly well for other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is alright, but the story/narrative is really inconsistent and tonedeaf.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bland story, low stakes, a lot of back and forth travel, too easy boss encounters and no ultrawide support.\r\n\r\nIt has comfy and cozy feeling to it, but it did not fit my taste for some reason. I did enjoy it at the start, but few hours in it started feeling more like a chore. Game introduces new mechanics every now and then, but most of them felt undercooked",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The actual fishing and restaurant management is fun - but the story is obnoxious and tedious - every time you feel like you have a rhythm of progression and exploration going on, you get yanked by the collar into an unskippable expository session by some character you do not slightly care about - just let me play the game.\n\nIt's a real shame, because the game is very stylish in its animations and artwork - but every time you get to experience it, it's collared to half an hour of busywork.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was really excited about this game as it seemed to check all the boxes of what I like in a game. Unfortunately, I couldn't play it because the point when it says \"hit *space* at the arrow\", no matter what key I pressed, it never worked. Having such UI issues in the tutorial seems egregious to me. I'm sure I would enjoy the game, I just can't play it because of the UI.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "holy buns bro. Like it's supposed to be a joke right? stupid ass game. wait whoever made this game might be regarded!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mayhaps i'm a hater, but this game is mad boring. the whole thing feels like a tutorial that treats you like a child, and little of what you do matters beyond beelining the main quests.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's Just Not That Great You Pretty Much go back and fourth between going underwater to get fish and then making food at the sushi place and that's pretty much it, yeah there are other quests but they are just boring after you complete the quests you would just be going back and fourth between getting fish and making food it's boring. \nNot Recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I must be one of the 5 people who doesn't really like this game.  It's boring, same thing over and over.  Graphics not so great, sound, what sound?.  Mechanics are pretty bad, game play is repetitive. If I was in a generous mood I would say the game is mid at it's best.\nDefiantly not worth the asking price.  This is a £1,99 budget game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "as a diver, I found the core \"combat\" loop of the game genuinely upsetting. No thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was expecting old-fashioned gameplay, but instead I got useless dialogues, unnecessary statistics, and a boring, unnecessary plot. You play for three minutes, and then you talk to other characters and do boring mini-games",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1] What is this game? [/h1]\nDave the Diver is a roguelite collectathon with a focus on gathering ingredients for your sushi restaurant.\nAs you upgrade your equipment you'll be able to gather larger, and better, quality fish and plants.\n\n[h2] Price/replay value [/h2]\nHorrible - Bad - [u] Decent [/u] - Good - Amazing\n\n[h2] Achievement hunting [/h2]\nOnly 1 missable (eat rations) - most involve grinding and will be post game if you rush the story.\nThe most tedious are definitely all bosses, diamond cooksta, and lvl 20 employee.\n\n[h2] Pros/cons [/h2]\n[b] Pros [/b]\n[list]\n[*]Amazing soundtrack (mxmtoon included)\n[*]Very charming characters and artstyle\n[*]Tons of freedom when it comes to restaurant customisation\n[/list]\n\n[b] Cons [/b]\n[list]\n[*]Mid-game has horrendous pacing\n[*]Combat sucks\n[*]Grinding used as padding\n[/list]\n\n[h2] Overall opinion [/h2]\nHonestly, this game isn't \"bad\" per se. But I'm giving it a negative review regardless due to the glaring issues with it.\nThe early game (what most positive reviews are talking about) - was great. The game starts out with a ton of charm and would seem like a cult classic right out the gate. You explore, you dive, you defeat sharks... The issue starts to arise around chapter 3-5. As soon as you start doing the sea people related stuff you'll be forced into a multitude of escort missions, slowly grinding through fetch quests, and other various things that don't respect your time. If you look at the completion percentage, you'll clearly see how more than 20% of the active players stopped before reaching the glacial area (which just happens to be after these chapters)... Once you get past that point the game honestly becomes a lot more tolerable, but the damage will have been done by that point.\n\nStory aside, this game holds your hand with an iron grip all the way until the post game. You'll be constantly forced into watching cutscene upon cutscene, answering calls from npcs, having to take on side quests you didn't agree to, and overall waiting to be able to play the damn game again. I can understand wanting to add a lot of worldbuilding, but the sheer amount of forced interaction really detracts from actually feeling like the main character. On top of that you'll have to watch unskippable cutscenes before bosses and certain sections, which can be a nuisance if you just want to retry something after death.\n\nThis game also isn't officially tagged as a collectathon, but it very much should be. Getting the steel net gun (required for the full gold marinica dex) - requires you to get [b] 20 topaz and 3 pelican eel skin. [/b] For those unfamiliar - you'll be able to get about 8-12 topaz from the glacial area if you get [i] every [/i] node. Pelican eel skin however is a rare drop from... you guessed it... Pelican eels. [i] There is exactly 1 pelican eel in the entire game [/i] - also being in an annoying to reach section of the map. This means you'll have to do (at least) 3 dives for this specific fish, just to make a weapon that's required to finish the marinica dex. This is assuming you get perfect rng... Same goes for some other weapons which require trevaly fins, shark teeth, tentacles... Though at least these have more than a single fish to grind. This just felt like such a padded upgrade that should not have required more than 1 skin imo.\n\nMy final complaint is the combat. This game has horrendous combat in basically every way, shape, and form. \nSharks have an average of like 200~ ish health. Your max harpoon gun does 40. This means you'll be shooting most sharks 5-8 times to kill them (with aim that only goes in a cone of about 90 degrees horizontally) - against enemies who constantly try to dash at you with the hitbox of a train. Especially on the thresher shark this feels ridiculous, as that thing goes across the screen in 0.5 seconds upon entering its range. The fact dave moves at the speed of a sea slug (even with dash and sprint) really doesn't help this.\nNote that all sharks also hit for about 40-80 oxygen (oxygen acts as health) when your max is about 320. Merely touching a shark counts as getting hit so you'll be losing about half your health if a shark is just turning around and happens to be inside your hitbox (this will happen almost every time as the harpoon range is non-existent). \nNow imagine trying to fight a boss with 500+ hp, and the same mechanics. On top of this you only get 1 heal in the entire arena, and basically need an upgraded weapon to not be hit every few seconds. This means your best bet is usually just taking a sniper rifle, upgrading it to max, and emptying your entire magazine before the boss can even move, just to kill them before they can kill you. Overall - extremely shoddy.\n\n[h2] tldr; [/h2]\nCharming, but horrendous combat and grind.\n\n[h2] Should you buy it? [/h2]\nDepending on what you can tolerate, maybe. The average gamer won't enjoy this enough to finish it however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i refunded 8 minutes in. just pointless dialog and spamming the A button. Almost 10 minutes in and still no actual game to be played",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You can clearly see they put in love but it spreads thin across all the minigames",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I did not enjoy the theme of this game. It was too cutesy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not very fun for long",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh I don't fuck with it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't really want to rate DTD negatively, as there's so much to like here: the art style, the initial gameplay loop, the characterisation, the comedic tone, the beautiful soundtrack. All of it makes the first half of the game a deeply enjoyable experience. However, simply put, the game evolves into a series of mini-games that simply aren't fun. There's not a lot of synergy between them and it pulls you consistently away from the central gameplay loop of catching fish and running the sushi restaurant. It's frustrating, for lack of a better word. I really loved much of the game, but there's no sense in the direction that it takes beyond having that initial sense of charm. It quickly becomes a slog and one that you won't feel compelled to see the end of. You end up fighting through un-fun sections of a game to get to the good bit: its central gameplay loop. But once that's taken away from you, it's basically impossible to get the spark back. A shame, there's a lot to like here (at least for the first act!).",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "I understand a lot of the appeal for this game: the artwork is nice, every character is brimming with personality etc... but I have put 30 hours into this game and I am beyond frustrated with the gameplay loop. Or rather that the game wont leave me alone so that I can just play the fucking game. After every single single dive there will be a brand new thing to learn or person to meet or minigame shoved in your face that is not skippable. It has been 30 hours of non-stop tutorials. I just want to get fish and make sushi, and even more frustrating is that the new mechanics that are introduced I would actually like usually, but why for the love of fucking christ is something like the farm introduced but you are not allowed to use it at all until like ten real life hours later when otto finally decides its time for you to be able to buy seeds. I would genuinely enjoy 90% of the extra content if it just wasnt constantly shoved down my throat. Dave cant even move from room to room without another text box popping up, just for him to tell you \"its dark in here\". I thought for sure that at some point I could just play the game for a while, but for real, every five goddamn minutes the controls are taken away from the player and you are subjected to a thousand text boxes. Holy shit leave me alone for a while I was doing shit.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Wide as an ocean but deep as a puddle. There are too many mechanics and not all of them are equally treated. The sea village is a slog to move around in. Fishing + restaurant loop is fun but the restaurant becomes pretty much irrelevant mid-game because most of the time you're diving.\n\nI almost got to the end but I'm rage quitting because the death penalty of losing all your inventory but one is too harsh because of how long each dive takes near the end game. Random shark encounter that you can't outrun and you have to do dive for another 60 mins",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game can't decide what it wants to be. It is trying to do everything at the same time, and in the end, no part of the game really feels well-developed and worth recommending. I initially enjoyed diving, exploring, and managing my restaurant, but I lost that enjoyment when the focus shifted to following a (very shallow and cliché) storyline, completing (unchallenging, repetitive) quest objectives, exploring dungeons, solving puzzles etc. This is a very ambitious game with a good sense of humour, and it certainly has some good moments, but it is stretched too thin. Everything Dave the Diver tries to do, another game has already done better.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Dave the Diver is a very well-made game with a very unique combination of gameplay elements, a great art style, and a positive laid-back vibe. Despite all this the game just wasn't for me, and I didn't enjoy it. Here's why:\n\nA jack of all trades is a master of none. My main issue with Dave the Diver is that it just tries to do way too many things without ever focusing enough on one element. The first 5 hours were great; all I wanted to do was catch fish, run my sushi restaurant, and ignore the main plot. But as I progressed, they just kept introducing more and more and MORE. Oh here's a fish farm, oh here's a new location with 50 zillion fetch-quests, oh here's a farm, oh now you can dive at night, oh here's a camera to take pictures, oh by the way did you get all the ingredients for the 15th VIP guest we have tonight? Every core element of this game feels like it would have been so much better if they had focused more time and attention on those core gameplay elements rather than the dozens and dozens of smaller, less interesting elements. The game is so bloated that the extremely lackluster plot absolutely CRAWLS along. The most fun I had with this game was when it randomly turned into Balatro, but that's probably a sign that I just need to go buy Balatro. \n\nBut that being said, it was still fun enough for me to willingly finish it (albeit begrudgingly). I think most people would actually have a blast with this game and it's very well-made. It just wasn't for me for the above reasons. If it looks like fun, I would say ignore my review and give it a shot because there's a lot to enjoy in this game and if it's your thing then this game would be a blast.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Starts off super strong. I really like the overall vibes of this game as well as the diving mechanics and sections. However the more you play the game the more it turns into \"work\" you'll have to side manage so many things that it starts getting tedious after a while I simply stopped enjoying the game from a certain point.\n\nMaybe I'll pick it up again sometime in the future. If you're into farming/grinding games then I guess this could be for you, but for me this isn't it.\n\nAlso time gated dlc purchases are predatory shit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I am unsure whether to reccomend this game. I had a lot of fun, but the way the saving system works sucks a lot of fun out of it at times. I don't have the time for hours long gaming sessions that I feel held hostage to because I can't save. There are many fat jokes that seem meanspirited after the umpteenth time. I love the sushi minigame and all the species of fish, but I rarely get to play the restaurant part sicne I take so long in the sea.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game, but there's so much that just stops you from actual playing.\n\nI'm going to start with the positives\nThe art style is incredible, there are quite a few funny cutscenes, Bancho is incredible.\nThe core loop of finding new fish, hiring staff, cooking new dishes is quite fun.\nThe idea behind most of the other mechanics is also fun\n\nThe issue is with how shallow everything is, how poor is the game feel.\n18 hours in and there are still tutorials being presented, the game doesn't let you explore, everything is on tight rails.\n\nIt all feels very constricted, from movement speed (and the lack of upgrades to it) to only unlocking the ability to track ingredients at 12 hours in to the lack of QOL features like being able to sell low quality fish from the Fish Farm (Going 1 by 1 with 10+ fishes is mind numbing, and the actual UI being right stick to select an amount is... innovative)\n\nTaking 5 minutes to swim from top to bottom every single time, where the map is barely randomised (6 weapons in 20 hours), where the layout is pretty much irrelevant (no secrets, little variation), does not feel fun.\n\nAs I said the \"core\" loop, of finding different fishes, upgrading your restaurant and hiring staff is quite fun.\nUnfortunately the game does not want to emphasise it, it's fetch quest after fetch quest, cutscenes every 3 minutes...\n\nThe nail in the coffin to the restrictive nature of the game is how everything you do takes control from you, 5 seconds moving the camera to a point, 2 seconds to actually be able to fire, 2 seconds to skip a dialogue line.\nIt sounds very small but the game just... feels stiff, in every single interaction.\n\nThis feels like a shallow Stardew Valley in the ocean and it's really a shame because it could've been so much more.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's OK at first. There's some good stuff here but the fun ran out pretty rapidly for me. The normal game play loop is very repetitive but is the best part of the game. Once you get tired of that it's over. I hated all the mini games, they all felt like a chore.\n\nAlso based on the way the game was described I expected much more procedural generation of the dive maps. It's very much static with minor changes which quickly means the exploration element goes out the window. There are a few map variations but not much. I understand why this is but I was sad on my 2nd dive when it was the exact same map.\n\nThe controls seem to be decided at random and are not assignable. It makes me frustrated. \n\nThe art style is a choice for sure. If you're into pixels you won't be disappointed. Not for me.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Really fun and addicting game until the mermaid section, after that its really hard to want to play again. Id recommend removing the mermaid section or making the minigames less dumb so that its worth playing afterwards.  I want to give a thumbs up because it was fun, but the fact that nothing will ever draw me back to the game makes it a thumbs down.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very overrated IMO. The beginning of the game is very fun but as you progress it becomes more like Dave the Farming Sim.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "extremely overrated, gameplay loops gets old fast and then game just throws dozen of minigames to keep you interested.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't believe the Overwhelming Positive score.  Wildly overrated.  Yet another rouge-lite where you are forced to progress an inch at a time to pad the game.  The actual gameplay harpooning fish controls really poorly and the minimalist graphics make it extremely difficult to identify harmless objects and threats.  You also have to do all of these random things like serve food.  The writing is the typical \"lol random self-aware\" indie game tropes and nonsense.  The biggest problem. and I instantly refund any game with this glaring flaw... the game has non-stop screen tearing and there is no v-sync.  See ya later!!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "There's nothing strictly speaking wrong with this game. Every bit of it is competently put together. Why negative, then? Because it is ALL tedium. Even what little bits of assistance you get in reducing tedium are soon replaced by a farcical level of additional tedium, all the way into the fucking postgame!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Everything about this game is designed in such a way that makes it so inconvenient to do anything fun. Cutscenes aren't funny the first or the fifth time. You move too slow even for a \"casual\" game, and far too slow especially for mandatory boss fights that beat the abysmal pacing further into its grave. And holding down buttons to loot, to move to a different location, etc. is such an outdated mechanic that only exists to pad out the threadbare gameplay.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a fun concept, but I've never played a game with more padding and handholding.  The puzzles make Pokemon gym puzzles look difficult, and five seconds can't pass without your protagonist commenting on exactly what glowing interactable they have to touch.  Your skill and success don't seem to advance the story meaningfully, and new mechanics seem to just be arbitrarily introduced on the calendar instead of upon surpassing any sort of milestone.  I've spent at least an hour walking from one end of an area to the other with no hindrances on the way for the classic 'walk from A to B and back' fetch quests.\r\n\r\nThe fishing mechanics are pretty fun, but once again the pressures of oxygen or damage aren't the most pressing; the limiting factor in your advancement today is largely your carry weight.  In short, just go play Subnautica again, and pick up a restaurant tycoon game on the side.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not thrilling enough to be that repetitive for more than 8 hours. The gameplay loop is super simple, not bad per se, just very simple. I was having fun for the first 5-6 hours, and then I realized it doesn't get more complex. This is the type of game I'd have loved when I was 14 and addicted to Lemonade Tycoon on my first gen iPod touch.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was trying for a while to get back into the game and had a few stints of trying it for a couple hours but i found myself playing for an hour then going to watch YouTube, the game looks great and the Main game is decent. But I could just not find the power to finish this game and its I'm sad to say that. The game goes off a bit to far in different directions that don't keep to the main story or game play and that might be  plus for some people. I found myself struggling to get back on and i knew that that was the end of the game. This isn't to say that the game is bad, far from it the art is phenomenal and the story is quite fun. I just did not have the same experience that most people share. I would just say watch a video before you buy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has a great theme, aesthetic and gameplay. The first few gameplay moments were amazing.\n\nHowever, they keep adding more and more things to do that clutter the menus. And I want to play the game! Not the thousand of minigames!\n\nI like this game, but the fact that I can play it less and less the more I progress frustrates me.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The base mechanics of the game (diving and restaurant) are too shallow to remain enjoyable in the long run.\n\nMost frustratingly, there are no incentives to change up your fish catching strategy. You can mostly just blow through fish by upgrading your damage output, and survive with better health. I don't think I'll make it to the end of this game as I'm so so bored.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I thought I would be into this game, but I'm really not. Exploring the sea for fish and ingredients is definitely fun. The restaurant is basically just automated, all you do is choose the menu - which started fun, but quickly becomes a quick chore to do.\nThe game then SWAMPS you with things to do. All of a sudden you can't just go fish and do what you want because there's 6 different quests or story elements, or your day being railroaded by a boss event.\n\nI thought it was a game about catching fish and running a restaurant, and they honestly seem like the smallest part of the game. They're a means to an end to do all of the quests and story parts. I don't find it chill, and can't recommend",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay is alright, but the story/narrative is really inconsistent and tonedeaf.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bland story, low stakes, a lot of back and forth travel, too easy boss encounters and no ultrawide support.\r\n\r\nIt has comfy and cozy feeling to it, but it did not fit my taste for some reason. I did enjoy it at the start, but few hours in it started feeling more like a chore. Game introduces new mechanics every now and then, but most of them felt undercooked",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I initially enjoyed the game, but ironically, for me it lacks depth. The problem is that it does not focus on anything really but tries to drown you in content. It mainly switches between the dives and managing a sushi bar, which if they had focused on it would be fun. Instead you unlock a number of additional, very shallow mini games, for instance a farming game, but its just pay to upgrade, get more resources. Same thing with a fish farm, where you invest so you can dive for the more adventury parts of the game. I finally lost interest when the adventury part of the game went the route of \"do a number of tedious fetch quests for the villagers so you can further interact with the most insufferable characters you ever got to meet\". I might have mentioned that the game feels tedious. The diving gets repetitive too after a while, the bosses are not interesting ( so far) the choice between weapon options  largely boils down to which quick time event you prefer). In the end it's dive over and over to make enough bucks to upgrade system XYZ and repeat\n\nMaybe some of the parts I did enjoy: The pixel cut-scenes are highly amusing (your chef studying new recipes, your bar getting inspected by a social media company for instance). Some of the characters are actually very charming dudebros/weapon smuglers/weaboo gunsmiths. Generally the graphics are need.\n\nSo generally, if you like a quirky relexing game that is a more pollished yet worse stardew valley in blue than it might be the game for you but don't expect a lot of complexity.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The actual fishing and restaurant management is fun - but the story is obnoxious and tedious - every time you feel like you have a rhythm of progression and exploration going on, you get yanked by the collar into an unskippable expository session by some character you do not slightly care about - just let me play the game.\n\nIt's a real shame, because the game is very stylish in its animations and artwork - but every time you get to experience it, it's collared to half an hour of busywork.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was really excited about this game as it seemed to check all the boxes of what I like in a game. Unfortunately, I couldn't play it because the point when it says \"hit *space* at the arrow\", no matter what key I pressed, it never worked. Having such UI issues in the tutorial seems egregious to me. I'm sure I would enjoy the game, I just can't play it because of the UI.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "holy buns bro. Like it's supposed to be a joke right? stupid ass game. wait whoever made this game might be regarded!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mayhaps i'm a hater, but this game is mad boring. the whole thing feels like a tutorial that treats you like a child, and little of what you do matters beyond beelining the main quests.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's Just Not That Great You Pretty Much go back and fourth between going underwater to get fish and then making food at the sushi place and that's pretty much it, yeah there are other quests but they are just boring after you complete the quests you would just be going back and fourth between getting fish and making food it's boring. \nNot Recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I must be one of the 5 people who doesn't really like this game.  It's boring, same thing over and over.  Graphics not so great, sound, what sound?.  Mechanics are pretty bad, game play is repetitive. If I was in a generous mood I would say the game is mid at it's best.\nDefiantly not worth the asking price.  This is a £1,99 budget game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "as a diver, I found the core \"combat\" loop of the game genuinely upsetting. No thanks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was expecting old-fashioned gameplay, but instead I got useless dialogues, unnecessary statistics, and a boring, unnecessary plot. You play for three minutes, and then you talk to other characters and do boring mini-games",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1] What is this game? [/h1]\nDave the Diver is a roguelite collectathon with a focus on gathering ingredients for your sushi restaurant.\nAs you upgrade your equipment you'll be able to gather larger, and better, quality fish and plants.\n\n[h2] Price/replay value [/h2]\nHorrible - Bad - [u] Decent [/u] - Good - Amazing\n\n[h2] Achievement hunting [/h2]\nOnly 1 missable (eat rations) - most involve grinding and will be post game if you rush the story.\nThe most tedious are definitely all bosses, diamond cooksta, and lvl 20 employee.\n\n[h2] Pros/cons [/h2]\n[b] Pros [/b]\n[list]\n[*]Amazing soundtrack (mxmtoon included)\n[*]Very charming characters and artstyle\n[*]Tons of freedom when it comes to restaurant customisation\n[/list]\n\n[b] Cons [/b]\n[list]\n[*]Mid-game has horrendous pacing\n[*]Combat sucks\n[*]Grinding used as padding\n[/list]\n\n[h2] Overall opinion [/h2]\nHonestly, this game isn't \"bad\" per se. But I'm giving it a negative review regardless due to the glaring issues with it.\nThe early game (what most positive reviews are talking about) - was great. The game starts out with a ton of charm and would seem like a cult classic right out the gate. You explore, you dive, you defeat sharks... The issue starts to arise around chapter 3-5. As soon as you start doing the sea people related stuff you'll be forced into a multitude of escort missions, slowly grinding through fetch quests, and other various things that don't respect your time. If you look at the completion percentage, you'll clearly see how more than 20% of the active players stopped before reaching the glacial area (which just happens to be after these chapters)... Once you get past that point the game honestly becomes a lot more tolerable, but the damage will have been done by that point.\n\nStory aside, this game holds your hand with an iron grip all the way until the post game. You'll be constantly forced into watching cutscene upon cutscene, answering calls from npcs, having to take on side quests you didn't agree to, and overall waiting to be able to play the damn game again. I can understand wanting to add a lot of worldbuilding, but the sheer amount of forced interaction really detracts from actually feeling like the main character. On top of that you'll have to watch unskippable cutscenes before bosses and certain sections, which can be a nuisance if you just want to retry something after death.\n\nThis game also isn't officially tagged as a collectathon, but it very much should be. Getting the steel net gun (required for the full gold marinica dex) - requires you to get [b] 20 topaz and 3 pelican eel skin. [/b] For those unfamiliar - you'll be able to get about 8-12 topaz from the glacial area if you get [i] every [/i] node. Pelican eel skin however is a rare drop from... you guessed it... Pelican eels. [i] There is exactly 1 pelican eel in the entire game [/i] - also being in an annoying to reach section of the map. This means you'll have to do (at least) 3 dives for this specific fish, just to make a weapon that's required to finish the marinica dex. This is assuming you get perfect rng... Same goes for some other weapons which require trevaly fins, shark teeth, tentacles... Though at least these have more than a single fish to grind. This just felt like such a padded upgrade that should not have required more than 1 skin imo.\n\nMy final complaint is the combat. This game has horrendous combat in basically every way, shape, and form. \nSharks have an average of like 200~ ish health. Your max harpoon gun does 40. This means you'll be shooting most sharks 5-8 times to kill them (with aim that only goes in a cone of about 90 degrees horizontally) - against enemies who constantly try to dash at you with the hitbox of a train. Especially on the thresher shark this feels ridiculous, as that thing goes across the screen in 0.5 seconds upon entering its range. The fact dave moves at the speed of a sea slug (even with dash and sprint) really doesn't help this.\nNote that all sharks also hit for about 40-80 oxygen (oxygen acts as health) when your max is about 320. Merely touching a shark counts as getting hit so you'll be losing about half your health if a shark is just turning around and happens to be inside your hitbox (this will happen almost every time as the harpoon range is non-existent). \nNow imagine trying to fight a boss with 500+ hp, and the same mechanics. On top of this you only get 1 heal in the entire arena, and basically need an upgraded weapon to not be hit every few seconds. This means your best bet is usually just taking a sniper rifle, upgrading it to max, and emptying your entire magazine before the boss can even move, just to kill them before they can kill you. Overall - extremely shoddy.\n\n[h2] tldr; [/h2]\nCharming, but horrendous combat and grind.\n\n[h2] Should you buy it? [/h2]\nDepending on what you can tolerate, maybe. The average gamer won't enjoy this enough to finish it however.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i refunded 8 minutes in. just pointless dialog and spamming the A button. Almost 10 minutes in and still no actual game to be played",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You can clearly see they put in love but it spreads thin across all the minigames",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I did not enjoy the theme of this game. It was too cutesy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not very fun for long",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meh I don't fuck with it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I understand a lot of the appeal for this game: the artwork is nice, every character is brimming with personality etc... but I have put 30 hours into this game and I am beyond frustrated with the gameplay loop. Or rather that the game wont leave me alone so that I can just play the fucking game. After every single single dive there will be a brand new thing to learn or person to meet or minigame shoved in your face that is not skippable. It has been 30 hours of non-stop tutorials. I just want to get fish and make sushi, and even more frustrating is that the new mechanics that are introduced I would actually like usually, but why for the love of fucking christ is something like the farm introduced but you are not allowed to use it at all until like ten real life hours later when otto finally decides its time for you to be able to buy seeds. I would genuinely enjoy 90% of the extra content if it just wasnt constantly shoved down my throat. Dave cant even move from room to room without another text box popping up, just for him to tell you \"its dark in here\". I thought for sure that at some point I could just play the game for a while, but for real, every five goddamn minutes the controls are taken away from the player and you are subjected to a thousand text boxes. Holy shit leave me alone for a while I was doing shit.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "I don't really want to rate DTD negatively, as there's so much to like here: the art style, the initial gameplay loop, the characterisation, the comedic tone, the beautiful soundtrack. All of it makes the first half of the game a deeply enjoyable experience. However, simply put, the game evolves into a series of mini-games that simply aren't fun. There's not a lot of synergy between them and it pulls you consistently away from the central gameplay loop of catching fish and running the sushi restaurant. It's frustrating, for lack of a better word. I really loved much of the game, but there's no sense in the direction that it takes beyond having that initial sense of charm. It quickly becomes a slog and one that you won't feel compelled to see the end of. You end up fighting through un-fun sections of a game to get to the good bit: its central gameplay loop. But once that's taken away from you, it's basically impossible to get the spark back. A shame, there's a lot to like here (at least for the first act!).",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Wide as an ocean but deep as a puddle. There are too many mechanics and not all of them are equally treated. The sea village is a slog to move around in. Fishing + restaurant loop is fun but the restaurant becomes pretty much irrelevant mid-game because most of the time you're diving.\n\nI almost got to the end but I'm rage quitting because the death penalty of losing all your inventory but one is too harsh because of how long each dive takes near the end game. Random shark encounter that you can't outrun and you have to do dive for another 60 mins",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game can't decide what it wants to be. It is trying to do everything at the same time, and in the end, no part of the game really feels well-developed and worth recommending. I initially enjoyed diving, exploring, and managing my restaurant, but I lost that enjoyment when the focus shifted to following a (very shallow and cliché) storyline, completing (unchallenging, repetitive) quest objectives, exploring dungeons, solving puzzles etc. This is a very ambitious game with a good sense of humour, and it certainly has some good moments, but it is stretched too thin. Everything Dave the Diver tries to do, another game has already done better.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Dave the Diver is a very well-made game with a very unique combination of gameplay elements, a great art style, and a positive laid-back vibe. Despite all this the game just wasn't for me, and I didn't enjoy it. Here's why:\n\nA jack of all trades is a master of none. My main issue with Dave the Diver is that it just tries to do way too many things without ever focusing enough on one element. The first 5 hours were great; all I wanted to do was catch fish, run my sushi restaurant, and ignore the main plot. But as I progressed, they just kept introducing more and more and MORE. Oh here's a fish farm, oh here's a new location with 50 zillion fetch-quests, oh here's a farm, oh now you can dive at night, oh here's a camera to take pictures, oh by the way did you get all the ingredients for the 15th VIP guest we have tonight? Every core element of this game feels like it would have been so much better if they had focused more time and attention on those core gameplay elements rather than the dozens and dozens of smaller, less interesting elements. The game is so bloated that the extremely lackluster plot absolutely CRAWLS along. The most fun I had with this game was when it randomly turned into Balatro, but that's probably a sign that I just need to go buy Balatro. \n\nBut that being said, it was still fun enough for me to willingly finish it (albeit begrudgingly). I think most people would actually have a blast with this game and it's very well-made. It just wasn't for me for the above reasons. If it looks like fun, I would say ignore my review and give it a shot because there's a lot to enjoy in this game and if it's your thing then this game would be a blast.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Starts off super strong. I really like the overall vibes of this game as well as the diving mechanics and sections. However the more you play the game the more it turns into \"work\" you'll have to side manage so many things that it starts getting tedious after a while I simply stopped enjoying the game from a certain point.\n\nMaybe I'll pick it up again sometime in the future. If you're into farming/grinding games then I guess this could be for you, but for me this isn't it.\n\nAlso time gated dlc purchases are predatory shit.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "There's nothing strictly speaking wrong with this game. Every bit of it is competently put together. Why negative, then? Because it is ALL tedium. Even what little bits of assistance you get in reducing tedium are soon replaced by a farcical level of additional tedium, all the way into the fucking postgame!",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I am unsure whether to reccomend this game. I had a lot of fun, but the way the saving system works sucks a lot of fun out of it at times. I don't have the time for hours long gaming sessions that I feel held hostage to because I can't save. There are many fat jokes that seem meanspirited after the umpteenth time. I love the sushi minigame and all the species of fish, but I rarely get to play the restaurant part sicne I take so long in the sea.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really wanted to like this game, but there's so much that just stops you from actual playing.\n\nI'm going to start with the positives\nThe art style is incredible, there are quite a few funny cutscenes, Bancho is incredible.\nThe core loop of finding new fish, hiring staff, cooking new dishes is quite fun.\nThe idea behind most of the other mechanics is also fun\n\nThe issue is with how shallow everything is, how poor is the game feel.\n18 hours in and there are still tutorials being presented, the game doesn't let you explore, everything is on tight rails.\n\nIt all feels very constricted, from movement speed (and the lack of upgrades to it) to only unlocking the ability to track ingredients at 12 hours in to the lack of QOL features like being able to sell low quality fish from the Fish Farm (Going 1 by 1 with 10+ fishes is mind numbing, and the actual UI being right stick to select an amount is... innovative)\n\nTaking 5 minutes to swim from top to bottom every single time, where the map is barely randomised (6 weapons in 20 hours), where the layout is pretty much irrelevant (no secrets, little variation), does not feel fun.\n\nAs I said the \"core\" loop, of finding different fishes, upgrading your restaurant and hiring staff is quite fun.\nUnfortunately the game does not want to emphasise it, it's fetch quest after fetch quest, cutscenes every 3 minutes...\n\nThe nail in the coffin to the restrictive nature of the game is how everything you do takes control from you, 5 seconds moving the camera to a point, 2 seconds to actually be able to fire, 2 seconds to skip a dialogue line.\nIt sounds very small but the game just... feels stiff, in every single interaction.\n\nThis feels like a shallow Stardew Valley in the ocean and it's really a shame because it could've been so much more.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's OK at first. There's some good stuff here but the fun ran out pretty rapidly for me. The normal game play loop is very repetitive but is the best part of the game. Once you get tired of that it's over. I hated all the mini games, they all felt like a chore.\n\nAlso based on the way the game was described I expected much more procedural generation of the dive maps. It's very much static with minor changes which quickly means the exploration element goes out the window. There are a few map variations but not much. I understand why this is but I was sad on my 2nd dive when it was the exact same map.\n\nThe controls seem to be decided at random and are not assignable. It makes me frustrated. \n\nThe art style is a choice for sure. If you're into pixels you won't be disappointed. Not for me.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Really fun and addicting game until the mermaid section, after that its really hard to want to play again. Id recommend removing the mermaid section or making the minigames less dumb so that its worth playing afterwards.  I want to give a thumbs up because it was fun, but the fact that nothing will ever draw me back to the game makes it a thumbs down.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Very overrated IMO. The beginning of the game is very fun but as you progress it becomes more like Dave the Farming Sim.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "extremely overrated, gameplay loops gets old fast and then game just throws dozen of minigames to keep you interested.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Serious Issue:\r\nThe bosses in this game have no clear patterns and have way too much HP. They always seem to know exactly when the player is refilling oxygen and rush in at that moment — while the refill process forces the character to stand still and do absolutely nothing. This makes the fights feel unfair and frustrating rather than challenging.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Everything about this game is designed in such a way that makes it so inconvenient to do anything fun. Cutscenes aren't funny the first or the fifth time. You move too slow even for a \"casual\" game, and far too slow especially for mandatory boss fights that beat the abysmal pacing further into its grave. And holding down buttons to loot, to move to a different location, etc. is such an outdated mechanic that only exists to pad out the threadbare gameplay.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a fun concept, but I've never played a game with more padding and handholding.  The puzzles make Pokemon gym puzzles look difficult, and five seconds can't pass without your protagonist commenting on exactly what glowing interactable they have to touch.  Your skill and success don't seem to advance the story meaningfully, and new mechanics seem to just be arbitrarily introduced on the calendar instead of upon surpassing any sort of milestone.  I've spent at least an hour walking from one end of an area to the other with no hindrances on the way for the classic 'walk from A to B and back' fetch quests.\r\n\r\nThe fishing mechanics are pretty fun, but once again the pressures of oxygen or damage aren't the most pressing; the limiting factor in your advancement today is largely your carry weight.  In short, just go play Subnautica again, and pick up a restaurant tycoon game on the side.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not thrilling enough to be that repetitive for more than 8 hours. The gameplay loop is super simple, not bad per se, just very simple. I was having fun for the first 5-6 hours, and then I realized it doesn't get more complex. This is the type of game I'd have loved when I was 14 and addicted to Lemonade Tycoon on my first gen iPod touch.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was trying for a while to get back into the game and had a few stints of trying it for a couple hours but i found myself playing for an hour then going to watch YouTube, the game looks great and the Main game is decent. But I could just not find the power to finish this game and its I'm sad to say that. The game goes off a bit to far in different directions that don't keep to the main story or game play and that might be  plus for some people. I found myself struggling to get back on and i knew that that was the end of the game. This isn't to say that the game is bad, far from it the art is phenomenal and the story is quite fun. I just did not have the same experience that most people share. I would just say watch a video before you buy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The base mechanics of the game (diving and restaurant) are too shallow to remain enjoyable in the long run.\n\nMost frustratingly, there are no incentives to change up your fish catching strategy. You can mostly just blow through fish by upgrading your damage output, and survive with better health. I don't think I'll make it to the end of this game as I'm so so bored.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "icepick mini game is stupid af, never make force dis shit mechanic on gamers again\n\noverall decent game, just not worth recommending with all these fuckass mini game mechanics n FANFO boss mechanics with no real hints",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}