{
  "positive": [
    {
      "review": "> Load into game\r\n> Spend 30 minutes crafting the PERFECT loadout\r\n> Finally ready\r\n> Hop in a Sarka with some random dude\r\n> He hits the FIRST TREE he sees\r\n> Entire squad dies instantly\r\n> Respawn naked in mob\r\n> Realise you never saved the loadout\r\n> Do it all again like a clown\r\n\r\n10/10 gameplay, would suffer again.",
      "voted_up": true,
      "votes_helpful": 68
    },
    {
      "review": "I've started playing prior to the 1.6 update (about 2 weeks before). and really enjoyed the realism and immersion. \n\n1.6 improved the immersion and realism with the new HQ commander update. Battles and engagements now seem pivotal and important. Supply runs are essential, a misuse of resources is impactful. \n\nHowever, the game is buggy at times and will crash so beware. but I am willing to overlook this, as the game is good at letting you to reconnect into the match and resume your progress.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "TLDR; the player-base doesn't like mil-sim games and would rather a Battlefield experience, even before 1.6. Game good.",
      "voted_up": true,
      "votes_helpful": 90
    },
    {
      "review": "Such an outstanding game. Far exceeded my expectations when I picked it up back in v1.2.\r\n\r\nUnlike previous Arma titles, this one is created as a whole game in its own right - it's no longer just a sandbox dev environment where you rely on good modders to make otherwise VERY uninteresting gameplay enjoyable.  The Enfusion engine is incredibly impressive, the variety of detailed mechanics that immerse you in gameplay makes Reforger stand out. \r\n\r\nIt's a really authentic title with none of the predatory practices that other games have. It stays true to the setting, you won't find any details that are out of place for the period of the game. No female spec ops warriors, no garish skins, no pointless bloat in equipment variety. It's a show-not-tell environment with very little HUD for the most part. It's also a milsim that so often feels like a survival game, making it incredibly unique amongst its kind.\r\n\r\nPatch 1.6 has really turned the game into a better team environment and a much deeper game where players can carve out very specific and creative play styles depending on what their preference is. There is now a meaningful economic strategy to develop with supply scarcity. You can be securing supplies as a logi driver, knowing you're doing something that's vital beyond just the early game these days. You can take it sideways instead: scavenge the battlefield looting high value enemy gear to return to your arsenal. Or you can hit the battlefield with a truck to reclaim resources from abandoned or destroyed vehicles.\r\n\r\nIf you're me, you love engineering. This is in part running supplies, but it's mainly taking up the commander's objectives to build bases or setting up FOB infrastructure. Or building impenetrable sandbag + wire fortresses. However, you can take this sideways too: you can head out to lay AT or AP minefields - defensively or offensively. Or perhaps you head out to clear obstructions for your logistics teams. Or you go out there and create those obstructions for the enemy with roadblocks and ambushes.\r\n\r\nThere are much finer inter and intra squad mechanics to master too. It now means more to survive, which means working together with your squad. With the greater division of duties via squad types, you're also going to be rewarded when you start working with other squad types to get stuff done. Engineers need offensive squads to clear areas to establish bases for example. Mortar teams can burn down enemy supplies until they have to respawn elsewhere, making it much easier for your assault teams to move in.\r\n\r\nIt's overwhelming at first, but once you get a grip of it you will come to appreciate just how much more there is to offer in the game as a result of patch 1.6.\r\n\r\nFurther to that, so many of the most absolutely frustrating elements of Reforger have been patched out: no more RPG-7 spam; no more RPG sniping; no more gamma abusing for night vision exploits; free-form base locations give much needed variety to the gameplay after all this time; being forced to very limited loadouts to begin with means you're relying on other players to give you a variety of attack options; no more assault rifle + UBGL + Sniper + C4 main characters roaming around never wanting to work together in any meaningful way.\r\n\r\nIf you're looking for a run'n'gun kind of game that you can farm Tiktok clips that no one will watch, then Reforger is no longer really that game. Its pacing is now slowed down to what anyone who is wanting to play a milsim is expecting. But it's still very much a sandbox. \r\n\r\nMy only big complaints that remain in the vanilla game at the moment are:\r\n-Movement and other action speeds are MUCH too fast. Apparently something is in the works, but this needs to have been changed already in my opinion. \r\n-Nametags (particularly xray squadmate names) are far too much, far too cluttering and diminish some really enjoyable aspects the game had in v1.4 (the fog of war between squad mates, the gameplay of communicating and co-ordinating).\r\n-Low detail distance rendering making it much easier to see people amongst thick grass and trees at long range.",
      "voted_up": true,
      "votes_helpful": 44
    },
    {
      "review": "Arma Reforger mixes stunning visuals with deep tactical gameplay, creating a truly immersive sandbox. The pacing is slower and more thoughtful, rewarding players who communicate and plan together. It can be demanding, both technically and skill-wise, but the sense of accomplishment is unmatched. It’s a unique experience for anyone who enjoys realism and teamwork.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "game is good, update 1.6 has given a little issues with stability but otherwise i like it \ni like the addition of squads and roles no longer allowing infinite rpgs and pkm's in every loadout, the limit can be a little annoying but it feels more realistic and i think made the game more fun",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I would be lying if I said this game was without flaw — some mechanics are more rudimentary than others and supply lines need to be reworked — but it is still worth playing.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "requires a brain to properly funcition. crossplay means you will be joined by hundreds of console players who are playing their first milsim since larping battle drills in empty battlefield lobbies or playing operation flashpoint: dragon rising for the xbox 360 so don't expect too much from pub players. \namazing ideas conceptually with the return of a capture the island-esque gamemode as the mantle piece which is a HUGE improvement over the last iteration's complete lack of vanilla content. unfortunately it all comes back to finding a server that has players with the minimum cognitive capability and willingness to learn how to actually play their role in the grand orchestra.\nmost servers are barbie dress up arsenal purgatories with rounds that last forever and have no sense of direction, just a massive moshpit team deathmatch. this is mostly due to the default supply system and base building fuctions being turned off by the clueless at best community server owners building lists of the same untested, unbalanced, bloated modlists featuring kit soup arsenal content packs that are 10 pages long, composed mostly of small variations and miscellaneous goofy items that eat dozens of gigabytes of hard drive space.\ninstead what SHOULD be happening is the creation and curation of conversions and overhauls built around the conflict gamemode into new time periods; examples like: vietnam, the bush war and world war 2, or even sci-fi themed era packs that have the the freamwork of rank restricted item structures and frontline-based gameplay flow that the developers are putting all their time into creating.\nmy own hope is that these issues are just growing pains and that in time a few servers with positive communities form around constructive and progressive interactions just as they did in the early days of the OFP, Arma 1 and 2 and even arma 3 to an extent.\nmy personal opinion is that the devs really overestimated the capabilites of the general public who ended up forming the majority of the game's playerbase. but either way, good on them for going back to their roots, i'm excited for the future of development and if the era and gamemode are any sign of what arma 4 will be then the future is bright.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Getting a notification for killing enemy commander is peak game design.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "ABSOLUTELY AMAZING WAR SIMULATION GAME ! - One of My Favorite Games!\n\nSummary: This game delivers the core, immersive military simulation experience you crave, backed by a massive community and the incredible visual power of the Enfusion engine. The quality of the core gameplay, combined with the endless customization, makes this an easy recommendation for anyone looking for the next-level tactical shooter.\n\nGraphics & Immersion (Superb Graphics & Immersive Gameplay):\nThe switch to the Enfusion engine has been a game-changer. The graphics are truly superb, with environments that feel incredibly detailed and alive. The visual upgrades support the high level of immersion the Arma series is known for. Every firefight, every tactical movement, and every drive across the map feels authentic and grounds you completely in the Cold War sandbox setting.\n\nGameplay & Multiplayer (Awesome Gameplay & Incredible Multiplayer Gameplay):\nThe core military simulation gameplay is awesome and unmatched in its strategic depth. This is not a casual shooter; it demands teamwork and careful decision-making. The incredible multiplayer gameplay is where Reforger truly shines. Whether you're coordinating supply runs or engaging in massive combined arms battles in Conflict mode, the experience of working with your squad against another player-led faction is intense, tactical, and highly rewarding.\n\nCommunity & Longevity (Loads of Mods & Loads of Custom Servers):\nThe community support here is amazing. The game already boasts Loads of Mods via the Workshop, allowing you to completely shape your experience, from new weapons and vehicles to entirely new scenarios. Thanks to the Loads of Custom Servers, you'll always find a match running exactly the kind of scenario you want, ensuring the game's longevity is practically limitless.\n\nVerdict:\nEither your a casual FPS gamer or Hardcore FPS gamer Arma Reforger is, without a doubt, one of the best FPS game on the market. It is the definitive military sandbox and a powerful precursor to Arma 4. If you want a game that offers realistic, expansive, and constantly evolving tactical multiplayer, jump in now.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The main gamemode on official servers being a battlefield style conquest is pretty cool. But it can be hard to just jump in and play, play with friends, or even just find a good fight. But where this game really shines is when you host a server, or play solo, and really enjoy a classic Arma experience. The new engine is amazing, the graphics are improved, new vehicle and weapon interactions are smooth, and everything is just further refined from previous installments. Plus the cold war theme is awesome, a welcome change from vietnam/ww2/middle east. This game has provided some of my favorite Arma experiences to date. Can't wait for more epic updates/mods to this (the new island from a recent update is awesome), and it makes me hyped for Arma 4.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lots of fun just wish it didnt run like buns sometimes, but when the game run well it is an all timer in my opinion. has a great community with it as well",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, surprisingly low amount of bugs for a Bohemia game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun addictive capture the flag style gameplay!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have over 20 days on xbox. Its a amazing game and its worth the second buy",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing and Fun game, especially with a group. Just DO NOT PLAY ON RUBBER BAND RANGERS SERVERS (Some admins(reg) abuse powers and they seem to not care).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I think context needs to be set about this game, it is a multiplayer military sandbox game, with one of the biggest modding scenes i've seen since arma 2 OA, its also got a very strong core game mode that even after 1.6 you can still access (some seem to believe its gone for good, its not.), did 1.6 update break A LOT of things? yes it did, but BI was rather quick to address a lot of the stability issues, but i think the biggest issue with the update was how much of a shift it presented, people were not prepared for that.   Over all, very good live service \"realistic\" shooter, with a Dev that seems to genuinely care... that sometimes has a bad update. \n\n\nTLDR: good game, take the criticisms with a pinch of reactionary salt, most fun ive had in Arma since Arma 2 OA.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful game, great realism, but still feels unfinished. Needs some more polish, mods help a lot though. Worth watching as it improves.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you like mil-sims this is the best of the best. It is not perfect by any means (server crashes, pop in, weird physics) but it doesn’t detract from the absolutely unforgettable moments you can have in this game. The -“you had to have been there”- moments..\n\nDon’t hesitate! Buy it! And most importantly [spoiler] USE YOUR MIC GOTDAMMIT!!!!!!!!!!! [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is really fun, huge technical improvement over Arma 3. The interiors of buildings are especially good, the best I have seen in any game with map this large.\r\n\r\nThe game misses alot of key features that were in previous titles. The lack of a proper easy to use scenario editor (the new tools absolutely DO NOT respect your time) really hurts the overall potential and growth of modding scene of this game.\r\n\r\nThe lack of aiming deadzone really takes away from the realistic feel and hurts stealth during missions due to you having to turn your entire body around which makes you move more which causes enemy players to spot you more easily.\r\n\r\nThe game also has a huge crashing issue, the stability has taken a huge dump over previous titles (including operation flashpoint/arma cold war asssault).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Playing on the Aussie Gamers community modded server, such good fun.  Still prefer Insurgency: Sandstorm but everyone in Discord chatting makes this fun still. Much slower than Insurgency, still enjoyable though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Arma Reforger is currently the shittiest shit to ever shit in the history of gaming shit.\r\nI load in and the game immediately hits me with a 20-second SHIT FREEZE — a monumental slab of frozen shit where the map, the players, the sky and even my hopes all turn into one giant glacier of motionless shit.\r\n\r\nI move ten feet and the server slaps me with a lag spike made of compressed cosmic shit.\r\nMy character rubberbands back like the universe said, ‘No, you stay in this pile of shit.’\r\n\r\nGunfights?\r\nForget it.\r\nYou fire one shot and the game becomes a shit slideshow, stuttering through three frames of pure shit before catapulting you into a pile of additional shit you didn’t even know existed.\r\n\r\nVehicles?\r\nShit on wheels.\r\nYou tap the accelerator and instantly get launched into a shit vortex, crashing into invisible shit objects, flipping into the air like a shit frisbee with shit physics powered by fossilized shit.\r\n\r\nExplosions?\r\nAbsolute shitstorms.\r\nOne explosion and the entire server collapses into a shit dimension, dragging every player into a lag coma full of brown pixelated shit.\r\n\r\nAnd THEN —\r\nTHEN the game does its favourite trick:\r\n\r\nClosing.\r\nJust closing.\r\nInstant shutdown.\r\nFull-screen blackout of pure, premium, handcrafted developer-grade SHIT.\r\n\r\nNo warning.\r\nNo message.\r\nJust the game quietly saying,\r\n‘Enough shit for today,’\r\nand unplugging itself from existence.\r\n\r\nEvery match is a marathon of:\r\n• shit lag\r\n• shit freezes\r\n• shit crashes\r\n• shit vehicles\r\n• shit AI\r\n• shit hitreg\r\n• shit physics\r\n• shit teleporting\r\n• shit falling through floors\r\n• shit bugs stacked on older shit bugs\r\n• and brand-new shit bugs built from the ashes of previous shit bugs.\r\n\r\nThe player base is just sprinting around in circles screaming at the shit, shooting at the shit, drowning in the shit, and occasionally becoming the shit.\r\n\r\nHonestly, Arma Reforger isn’t even a game right now.\r\nIt’s a living monument to unstable, unpredictable, historically significant SHIT.\r\n\r\n10/10 shit.\r\nA masterpiece of shit.\r\nWill absolutely install more shit mods and play this shit again tomorrow.”",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\n❌ You forget what reality is\n✅ Beautiful\n❌ Good\n❌ Decent\n❌ Bad\n❌ Don‘t look too long at it\n❌ MS-DOS\n\n---{ Gameplay }---\n✅ Very good\n❌ Good\n❌ It's just gameplay\n❌ Mehh\n❌ Watch paint dry instead\n❌ Jake Paul’s content\n\n---{ Audio }---\n❌ Eargasm\n✅ Very good\n❌ Good\n❌ Not too bad\n❌ Bad\n❌ Jake Paul’s music\n\n---{ Audience }---\n❌ Kids\n✅ Teens\n✅ Adults\n❌  Grandma\n❌  Bucky Barnes\n\n---{ PC Requirements }---\n❌ Check if you can run ms paint\n❌ Potato\n✅ Decent\n❌ Fast\n❌ Rich boi\n❌ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n❌ Just press 'W'\n❌ Easy\n❌ Easy to learn / Hard to master\n✅ Significant brain usage\n❌ Difficult\n❌ Elden Ring/Dark Souls\n\n---{ Grind }---\n✅ Nothing to grind\n❌ Only if u care about leaderboards/ranks\n❌ Isn't necessary to progress\n❌ Average grind level\n❌ Too much grind\n❌ MW 2019 Damascus Camo grind\n\n---{ Story }---\n✅ No Story\n❌ Some lore\n❌ Average\n❌ Good\n❌ Lovely\n❌ It'll replace your life\n\n---{ Game Time }---\n❌ Long enough for a cup of coffee\n❌ Short\n❌ Average\n❌ Long\n✅ To infinity and beyond\n\n---{ Price }---\n❌ It's free!\n✅ Worth the price\n❌ If it's on sale\n❌ If u have some spare money left\n❌ Not recommended\n❌ You could also just burn your money\n❌ You need 50% of Elon Musk’s wealth\n\n---{ Bugs }---\n❌ Never heard of\n✅ Minor bugs\n❌ Can get annoying\n❌ ARK: Survival Evolved\n❌ The game itself is a big terrarium for bugs\n❌ Cyberpunk 2077 before patch\n\n---{ ? / 10 }---\n❌ 1\n❌ 2\n❌ 3\n❌ 4\n❌ 5\n❌ 6\n❌ 7\n❌ 8\n✅ 9\n❌ 10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I'm so happy with update 1.6. It actually feels like Arma again! Like a milsim! A lot of people dislike it because they've been playing Arma like a different genre of game, but I assure you, if you want a milsim experience then this is great. I'll always cherish Arma 3 but this is turning into something really special.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was not a fan of Arma 3 mostly because of their predatory DLC's. But Reforger is hands down the best Mill-Sim on the market. The modding support is top notch and the community is great.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you want a modern Arma experience that’s easier to run, friendlier to new players, and built on technology designed for the future of the series, Arma Reforger is a compelling pick. If you prize the deepest possible catalog of mods and decades of mission content today, Arma 3 still has that edge — but Reforger is the promising, performance-minded evolution that veteran and new players alike should watch and play now. \n\n- Vietnam \n- Cold War \n-  Ukraine vs. Russia\n-  So Much More!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I finally bit the bullet after taking a break from Arma 3 for a few years. Much better core game overall than 3. I know all change is bad to players of every game, but since I came in after the release of 1.6, I can't tell what the difference would have been, but I like the main multiplayer game mode of Reforger so I can't complain.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a good game, but is it better than Arma 3? Well, yes and no. It's more stable than A3, but don't have that much features as A3. With mods it's better, but still there's something missing. Don't get me wrong, I like this game. What I realy hate is mission making. Reforger Tools is just a pain in the ass to learn it. Why they couldnt leave same mission maker as in A3? They are still updating this game and lets hope Arma 4 wont get delayed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I used to like this game, 1.6 update however, has made me stop playing it, I dont like the psuedo class system, I dont play vanilla, and it seems to be forced onto community servers aswell. which messes with about half the gear related mods and the arsenal mods? seemingly? so until thats fixed, I'm not going to be playing it. However if you're a noob, and haven't played this before. It'll probably feel fine.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Loaded into a game, met 2 random dudes, went on a journey around the map, camped in a treeline, ambushed random cars that drove past, 2 mins later heard a helicopter, a littlebird flew over did backflip 180 and rained fire down on our positions. \n\n10/10 Recommend game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if they roll back the updates then buy the game its brilliant but as of 1.6 this game is really below par compared to what we had. bohemia how did you brake the game so much?\nit makes me want to play fortnite since the performance took such a hit in the nuts and the poor sods that run the community servers must be thinking twice about their decisions with all the flak they been getting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Arma Reforger is Arma 3, is Arma 2, is Arma, is Operation Flashpoint ONLY BETTER.\nIt has aged like a fine Italian wine.\nTrust me when I write this, I have played every game they have made, check my games list \nThis game is fire!\nGame - 9/10\nGraphics - 10/10\nSound - 8/10\nMods - 10/10\nDLC - 0/10\nKolguyev 1.6 Update as of Oct 30 10/10\n\nMore and more people are playing both on PC, PS5, and XBOX\nPlayablity on those platforms are still hit and miss though.\nBut still nice to have crossplay.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game started out pretty bare bones and bohemia turned this into one of the finest realism shooters i have played",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game has its bugs tho. I get out my car and then i fell thourgh the map.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "load into WCS \ngoes to objective \ngets shot with a rpg from 300 m away \nrespawn \nsteps on land mine \nmatch is over \n10/10 would get screamed in russian again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great graphics great community great combat great devs great mods honestly cant say nothing bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is game is great, the moments you can have in it alone or with other players are just amazing. I love the prox voice chat, I love the flying, i love the gun play. the maps and mods are great. \r\n  There can be connection issues quite often, but most the time you can get right back in where you left off.\r\nYou can have matches that last for an entire day, or matches that last 3 hours just depending on your teamplay. \r\nI recommends it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im finally in the right age for Arma and i must say after Hell Let Loose, Post Scriptum, Red orchestra, Insurgency... Im home.\r\n\r\nMy advice is find community server and find friends either in game or discord. Official servers are not place to be in this game.\r\n\r\nBTW: I also enjoy Battlefield 6.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is great have alot of fun in this since i got its the most ive had in arma since arma 3 the only down fall of the game is the crashes that happens random it kills the mood but still a 10 out of 10 game for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I entered the game for the first time, I paused for a moment, put down the mouse and keyboard, and looking at the monitor, I started clapping, admiring all the work that the Arma Reforger team had done.\n\nThe collective spirit of the game is enchanting and a very beautiful characteristic. The online players are kind and great teachers who are willing to help newcomers share the experience of playing Arma Reforger.\n\nThe soundtrack is the perfect complement to the entire game's construction.\n\nThere are so many positive words I could say, but the one that best fits would be: Thank you.\n\nBuy the game, you will experience something very beautiful, fun, and a unique experience of what teamwork with people of various nationalities truly is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good Milsim game that has a ton of mods for all style of play.  PVP and PVE, Older Milsim, modern Milsim, and even Halo Milsim.  If you have a working Mic and a decent computer/connection then you can squad up and have fun for hours.  Matches can be as short as an hour or last days, it all depends on if the teams hold their positions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "where do i start? \r\nwhen i first got into this game after watching many youtube viideos about arma 3 and reforger , i go for reforger newer and less complicated.\r\ngreat right?!(started on console switched to pc so this is my CONSOLE angle on this)-spoiler alert i got hooked like it was crack anyway.-\r\ni join a regular server and spawn in pick nato boom i spawn into pitch black, im like wtf ??something wrong ???? i spawned into a night cycle, cool(not cool pants have been shidded)look thru menu for flashlight function, ffind it(there are ALOT of controls) , were good? right? right....no were indeed not good,im walking thru a forest i pull out my map try to figure out where im at , cant you have to literally figure out where u spawn in and get your bearing straight before you make moves or you will never find anything.so thats great its dar i dont know where im going or how to do anything , clueless i say fk it chalk the game up as a dud.but something called me back i couldnt just give up like a child and i gave the game another shot and boyyyyyyyy, i cant describe it in words the experiences ive had in modded and non modded servers, the games amazing and it just gets better stick with it and learn the basics via the training grounds etc, i could go on and on\r\nBUY IT \r\nDO TRAINING GROUNDS\r\nJUMP IN SERVER \r\nHAVE FUN\r\nTRUST ME i said alot but nothing at the same time with this review.\r\nyour welcome\r\nin advance \r\ni join a random server non modded",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just wish.... that you could make maps and missions just like you could on arma 3... there was so many ways to do it while i tried arma reforger and theres so little you can make build and what not...so ima a bit sad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I moved on from Arma 3 and I find this game has really solved the AI aimbot, making them be a little less instant-kill unless you purposefully stand there trying to get yourself killed. \n\nThe game's lighting is really good, seriously, it's very fun, but\nplease\n\nthere are amazing mods\nMOD IN ALTIS AND STRATIS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is great worth the money so many great communities to play with although can have major lag spikes at times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game when it wants to work however every 30 minutes or less I get kicked from a server for some weird reason",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun even more fun with mods get fucked console players",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly Its a really fun game when you get in the zone and figure out the right play style. on the other hand It has horrible server issues, constantly kicking me from games at the worst moments.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun unless you rage at lag spikes, other than that there is like low frames and server connection sucks sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game to play alone or with friends. If this is the tech demo, I cannot wait for ARMA 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it.....besides the community server owners.....just like DayZ......",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The firefights in this game are alot of fun and very intense!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best game ive ever played in my life, best realistic war ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite game!!! Play on the Arma Confilic US-1 Modded servers.   TRUST >W<",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Depending on the servers, I had some great evenings so far playing this game. Recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IMHO, This game can`t be compared with anothers \"realistic shooter\" (besides arma 3) because there are more opportunities in gameplay, the deep and realistic environments, the legal latitude in operation possibilities and of course the endless amount of stunning and cool short combat stories.\n As a man of \"cold war drama\" I don`t need anything more but you can download mods with variety of genre and customization, so i really appreciate that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game I've been playing since Arma 2 and I love the direction that the series is going. Worst part of the game is how many console players don't have microphones for an intensely communication based game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, content and size of the game is increasing every update!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To be honest I haven't played the base game at all, only modded servers which for me, is what makes this game. I love playing barbie at FOB and making the perfect tacticool loadout.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks like this game gonna be awesome. Good mod support, plenty of players online, a lot of gameplay styles, devs are continuesly updates the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Slower gameplay than the typical shooter,  but makes for some pretty epic experiences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game and amazing franchise its growing to be what made arma 3 so great\nso exited for what arma 4 can be\ntake your time make it great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion Arma Reforger has provided the most fun I've had gaming in a while. I've been looking online of videos about Arma Reforger and even some of the mods they provide. It looked like a blast so I got the game about 4 days ago with some buddies of mine and since then I never looked back. I already have 33 hours on it, I'm hooked! As soon as I installed the game I went and headed over to join this ultra hardcore server called \"Spearhead\" with no experience and even as a noob I've had a blast whether it's with buddies of mine or even playing with randoms this game is officially my favorite I've ever played. Also just want to include they have thousands of online Mods and adjustments you can use into your actual gameplay, it's crazy! Even with only 33 hours in the game here I am writing this review, 20/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great. It's better with mods, in my opinion, but still pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game overall and highly immersive. the player base is honestly my biggest issue. servers run by the game arent fun because they use so much AI and bots but public servers are full of raciest weirdos. This isnt a unique thing to arma it is a systemic issue within the military sim game world. if you can get over that this game is super fun. everything from base building to combat feels immersive and feels important. The game also looks and sounds amazing. i only wish the base game had night vision of some type because night time gets ruff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would reccomend, but if its your first time playing AND you only play COD style games. sigh,your in for a long one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "run for 10 minutes\nget torn to pieces by a jltv or a sniper from 700 meters\nentire team is playing barbie\nrespawn and do it again\n\n-> average arma reforger experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first real Arma experience that has lasted more than 2 hours, I can see myself returning to this game frequently. With friends, it is legendary. Such a fun experience.\r\n\r\nSome games last 30 minutes to an hour, some last like 8+ hours and I love it. \r\nI am not a big graphics guy, but the graphics are beautiful as well.\r\n\r\nI haven't played that much so far, but there has already been so many awesome as well as hilarious moments. Look forward to enjoying more. Great game, solid 9/10 even on official servers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Originally came from PS5 when the game first came to us and it doesn't disappoint the game was a buggy mess when the PS5 update came but i fully understand that ARMA as a whole IS and will always be a PC game otherwise amazing game lots of action and plenty of mods for different experiences from WWII to modern day with good graphics and plenty of details...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game just better with each update.\nIts not perfect but a lot of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another good entry into the arma series, plenty of different servers for different needs and lots of mods to suit your taste. The game is both complex and pretty simple once you understand the basics. The most fun usually is when you play with friends. Are there bugs? Indeed they are minor, like a bit of texture glitches and a few items floating in air, probably because of the mods more than the base game. It's slower pace than something like cod or battlefield but to each his own. A solid 8/10 ,great game to either chill or go all in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First few hours in a game, you're having fun. Especially, when you're with friends: planning tactics, supply routes, helping each other with their own strategies. After a couple hours, you get into this groove of knowing what your team needs, what you can provide, but you mostly stay for the hopes of the game ending in either way. \r\nTo either see the result of your effort, and or, see your stats which aknowledge said effort.\r\nThus comes my review, two aspects of the conclussion of the game can get frustrating:\r\n1. the end game timer is put at 15 minutes, which although better than the previous 5, is a bit too much, and the game turns into a standstill, until at best it ends in one team giving up and the other using the chance to end it. Rather than it being a swift finish.\r\n2. the game has a tendency, especially towards the end of matches of crashing. Plus side is, your rank and loadouts get saved. Minus- your stats reset. Which may be a small thing, but it gets rid of a part of the vissible effort, your own contribution from being visible. And game crashes are inevitable, so if there's a chance to implement match stat saving, that'd be great.\r\n\r\nAll things considered, this is a great game. It's fun, slow pace and fast, when it counts, and it gives you the chance to not take yourself too seriously.\r\nIt is worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game to bits, Love the amount of customisation options you can get and how you can put real life tractics into a game. Has a funny community but it does sometimes take some time to search for a server you like. So many mods and so many differnt ways to play. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So proud of the dev team for fighting to bring this game where it is, been a loyal fan since release. I NEED NIGHT VISION! But this game is the best!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reforger still has a long way to compare itself to A3 but better than waiting around for A4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very coool game takes time to learn and stuff but it hard when you get used to it it pretty fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arma Reforger is a great step forward for the series. The new Enfusion engine delivers beautiful visuals, smooth gameplay, and an immersive military experience. The maps feel alive, teamwork is rewarding, and the modding tools add endless replay value. A strong and promising foundation for the future of Arma.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lowkey boring with no mods but find the right server and the gameplay can get really intense and interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fun getting some friends together on refroger and using combined arms to take out strong points",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing with mods, gets stale in vanilla. the mod scene is huge and tons of servers to play. game does has its problems. mods not downloading, crashes (rare but happens), frame drops. but this game does a ton right, mod downloading is super easy, gun play is fun, not as complicated as 3 was, easy to learn, coms are good, voip is done well,maps are large but not to large where you cant walk point to point, the community is fun to be part of.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MODS MODS MODS MODS-\r\n\r\nin all seriousness, this game is goog(Good). Specially cause of the endless ways to play it, thanks to modding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If your looking for a good millatary rp game that has tactics this is for sure the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game a bit rough rn with crashing due to the 1.6 update but besides that lovely game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an excellent game especially if your coming from A3 like me i find it nice to have a combat game with less \"tech\" and more Gorilla technique, the modding community is amazing but it can be difficult to find mods that work and dont contradict each other but when you can it can be really fun even in the editor\r\n\r\n8.5/10 would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though it is a bit laggy from time to time and has its fair share of bugs and crashes, I would still recommend this game to anyone who is getting tired of all the run-and-gun Call of Duty-like games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "can be slow Paced at times but the fire fights are worth it! some of the best gameplay for a milsim however has a ton of bugs, which have been a thing for years that have never been patched. fun, buggy, realistic,\r\nin summary good game but needs work!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good and realistic i recommend it but it have some optimisaton isssues but it is great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Phenomenal game, modding community really needs more credit then they deserve, can't wait for Arma 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had this game for a while. Other than the crashes i face when playing in large modded servers. Gameplay wise its a big up from the previous arma games. Tbh i enjoy the QOL features this game offers and has alot of potential to grow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice milsim, super interactive community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Military Sim games out there. I highly recommend for those who want a highly realistic FPS game. Plus the community has created so many mods so you will never have to worry about running out of content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arma Reforger is the most intense realistic shooter i have ever played and just in general realistic both with weapons movements i have 280 hours of game time and i love them all if you need a intense combat game i would strongly recommend this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "tuff game and good modding esp in game editor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watched my friend get blown up. Saved is life. Stands up takes a round to the dome. Great game 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to put hours into with a great mod community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Arma Reforger is a fun game with a great community. I would recommend Arma to any squad player who is tired of weird ai and their character being a wuss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recomend this game I have been having a lot of fun try out the server spearhead if you get a chance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best balance of realism and interactive gunplay, You might need a nasa computer to play it at max graphics but you can definitely play it with good frames on slow specs with the right settings. I love the community, chill people. And man is it fun shooting rockets at metal birds and turtles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very fun game. Its fun even if you are dying and not managing to kill anyone or complete anything.  Do recommend to anyone who likes to play slowly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing. Thematic, tense and way better than Squad. I love playing as Ivan and blasting Americans left, right and centre who just played COD and Battlefield.\n\nGo home GI.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Alright, Bohemia, let's talk. After 15 hours with the new Arma Reforger 1.6, I can confidently say you’ve managed to patch the fun straight out of the game and replace it with a tedious, unbalanced slog.\n\nThe new Kolguyev map is a masterpiece of art design and a catastrophe of game design. As someone who appreciates depressing Soviet bloc architecture, the attention to detail is amazing. But as a player, it’s a concrete NASCAR track. The entire meta is now a demolition derby of jeeps and UAZs hugging the coastline, while everyone else tries to summit Mount Boring in the middle.\n\nWhy the sudden need for speed? Because the new loadout system is a masterclass in unintended consequences. To stop players from draining supplies, you introduced limits so restrictive that no one can afford a long-range radio. The result? Every man for himself, buying his own damn jeep to get to the action. This isn’t a team game anymore; it’s Mad Max with more bushes.\n\nAnd the radios! Limiting them to three uses isn't a balance change; it's a joke. You might as well delete them from the game. The old system was elegant: more supplies, more respawns. Simple. Now, the grind to Major gets you a loadout that feels like you’re a broke private. The new meta isn't tactics; it’s looting your dead teammates just to get a decent kit. This is Escape from Tarkov, but your friends are the loot pinatas.\n\nAs for the Commander role? I wouldn't touch it with a ten-foot pole. Instead of leading a charge, the CO is now a glorified FedEx driver, chasing down braindead AI convoys stuck on a roadblocks. Meanwhile, the grunts are looting the last of the supplies to join the coastal Grand Prix.\n\nRemember Arma II? You got burned by this exact \"Warfare\" approach before DayZ accidentally saved your company by reminding everyone that games should be fun. Reforger was a blast - dynamic and engaging. Now you’re turning it into a sterile training simulator for Jarheads who hate joy. Why?\n\nI’m uninstalling until this mess gets sorted. The fun is gone.\n\nMy Patch Notes for Your Patch Notes:\n- Bring back the FUN. The last version had it; this one is just a chore.\n- Ditch the radio paywall. Tie respawns back to supplies. It just worked.\n- Fix the loadout limits. A Major should feel like a badass.\n- Scrap the AI convoys. They're glorified piñatas on wheels. Let players run logistics for XP.\n- Add a longer cooldown on vehicle purchases.\n- Nerf the partisan aimbots. This isn't a 20-minute hike simulator just to get headshot.\n- Give the base AI a brain. Right now, they’re just chickens waiting to be plucked by the first enemy that shows up.\n- Just bring back the last patch, at least for Everon. You were so close to greatness.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "1,000 Hours In and The 1.6 Update Finally Drove Me Away.\n\nI’ve put about 1,000 hours into Arma Reforger, but this 1.6 update has completely killed my enjoyment of the game. The new game mode and squad-based roles have stripped away what made Reforger fun, freedom, and flexibility. Now it feels like a cheap knockoff of Squad, or as I like to call it, Temu Squad.\nI used to love being able to approach objectives and gameplay however I wanted, but now everything feels forced and boxed in. I’m told how I have to play, where I have to spawn, and what role I have to fill. It’s frustrating, restrictive, and the opposite of what Arma has always stood for and feels like a job now.\nTo make things worse, the performance somehow got even worse with this update  stutters, desync, and drops everywhere. After all the time I’ve invested, this patch is the first one that’s actually made me uninstall the game.\nArma Reforger 1.6 didn’t just change the game. It changed the experience into something I no longer recognize or want to play.",
      "voted_up": false,
      "votes_helpful": 53
    },
    {
      "review": "in my 240 hours played probably 140 of those hours were spent in queues/crashing/ troubleshooting. \nThe game is good. The patience needed is masochistic.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Unplayble after 1.6 Update, server lags, mass disconnect, crashes every 20 minutes on vanilla and modded servers.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "the game is COMPLETELY unplayable now even on a 2000 dollar PC getting consistant stutters and stead 50fps . avoid this at all costs as the devs just continually break the game and never optimize it. 10-10 would NOT recommend",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Crashing every 20 minutes, I have a great PC setup and i still crash. This is my first Review of a game, and ive been a pc player for 10 years. I felt the need to warn would be buyers against it",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "1.6 update ruins the point of a milsim sandbox which is what arma at it's core really is. Arma isn't Squad and it certainly isn't battlefield. Any roles or classes can be assigned or ignored depending on what your going for milsim or casual gameplay. Now you can't save kits and you have to be a rank to make a new squad for what purpose other than ruining the fun of your players. The issue in particular is these new gamemode and gameplay changes force the original way of playing away. Just add the old game back with this new way of playing as another option.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "With the new update they did it is a hard no. They turned it into progress unlocks you items in pvp server's. Which alright sounds cool until you spwan in at night & they made nvg's a high rank to get. So if you are a new player loading into a match & it's night you are screwed until you ask someone to drop you a item like nvg's so you can see at night until you are the certain rank. That's with gun sights as well in modded servers & other items. They are trying to take it into a weird direction, something that it isn't even arma anymore. Not to mention, every day server restarts so that means you are screwed again from the gecko. Arma is a sandbox game & you are making stuff locked behind progression in servers that restart with ur rank. It is the worst thing I have ever seen bohemia ever do. With this update I'm gonna go on a stretch to say they are trying to kill arma reforger off on purpose. It was such a good game before this update. Now not even 4k people are playing on pc because of this update. In classic bohemia fashion. You will not hear a word from them. Do not buy this game. Maybe before update 1.6, But for sure not anymore. This isn't a arma game anymore.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Everything positive about the game died. \n\nWhat's the issue?\n- Power abuse. You'll play this game and get shot in the head by the person next to you, but if you do anything, you can bet on any server you play on, you will be clipped, reported, and permanently banned.\n\n- Custom servers only. You will not ever be playing official servers because they aren't fun and they never have people on them, so you're essentially forced to play on a number of custom servers.\n\n- Cheaters. I've literally watched people brag and tune their recoil remove tools in front of crowds of people and nothing happens to them. Anybody who uses a third-party software to give themselves a crosshair already has a massive advantage over other players. The list of this type of behavior goes on.\n\n- Players. After almost a hundred hours of gameplay, I've noticed a recurring theme amongst this community. The most fun thing to do here isn't playing the game, it's ruining your own team's day. You will never play a server where the chat isn't full of arguments. Where there aren't people shooting you in the head at random. Where you don't get reported or harassed for using any amount of supplies even if you're the one providing the supplies.\n\nAnyways, I got fed up after I made an appeal on a custom Discord server and the mod insulted me and called me a liar, intentionally provoking me. Then waited for Discord to say that I'm typing just so he could ban me before I could click send; mind you he literally waited for this, it's not like I immediately started replying after he sent the message. I used to like the game, now I just hope that anybody who reads this saves themselves from regretting purchasing this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have 1600 hours on this now..... \r\n\r\nEvery time bohemia makes an update, they break much of the game.\r\n\r\nSince the 1.6 update the game is now almost unplayable. The fps will be fine at first, then drop to low 20s or even lower after 20 mins or so.'\r\n\r\nBefore the update, i would get 60 fps easily on high settings... with a Lenovo legion pro 5, rtx 3060, 32gb ram, ssd.\r\n\r\nSadly, Bohemia doesn't concern itself with fixing the problems the game already has, no, Bohemia instead prefer to release new content that just breaks the game even more.\r\n\r\nAll in all, the game is unplayable in its current state and until Bohemia address's these issues and publicly admits there are problems, i would advise everyone to steer clear of buying this game.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I have 1,151 hours on this game. The game was completely ruined by the 1.6 update. The core game mode Conflict (which most people who played it thoroughly enjoyed) was completely reworked at a fundamental level. Most of these changes, no one asked for, as well as performance issues that were not there before. I really hope they bring back the old conflict. Everyone who enjoyed the sandbox elements and freedom it offered were very disappointed to have all of that yanked away by a new authoritative and seemingly restrictive game play loop.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The game is genuinely fun when you have friends and your connection is stable, but with the recent update. It made the game unstable and questionable at best. from random crashes, mods not being recognized and the constant \"fixes\" being added. I love the game but recently. . .Im not too sure.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Some of the bad reviews seem reasonable here. I've got overall a fairly nice machine and a 5090. Every other game runs fine. Here, at least once a minute or two, the game stutters and stops for 10 seconds or so though sound keeps playing. It then resumes, and eventually it just crashes to desktop. Did some research but couldn't find anything definitive. Updated drivers, restarted, all of that. \n\nIt sucks, too, because the little bit I was able to play seemed pretty cool. Will try to get a refund, though.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Current state is awful. Critical bugs in experimental were left unfixed and into the stable build, leaving all games into a state of not if, but when, you will be kicked and lose all progress from a crash. Bohemia Interactive should not have released this update in its current state, and still hasn't fixed other issues like netcode. Save your money. My review may change if the game gets fixed, but right now its buns, extra burnt.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a great game, but terribly buggy. Completely vanilla, even.\nI never play all the training sessions because it always crashes near the end. And the save function doesn't work in training. You have to start over every time. The same goes for playing HQ in single-player mode. It usually ends with me frantically choosing another game.\nSuch a shame for a great game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "good game but it turns into a try not to crash challange after 20 minutes of playing. I would consider buying after fix. \r\n\r\n50 hours of playing, and i am not kidding more than 50 crashes just on a few servers. Maybe its the mods, but the vanila game glitches mags in the ground, inventory and more.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun to play, but way too buggy at this time. Crashes too frequently and new commander HQ game mode would be fine if the AI running supplies would actually work. Would wait to buy this game until bugs and game modes are better addressed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is a bit to be said about this game. I will start by stating that I have been playing ArmA ever since it was Operation Flashpoint, and I have played every single ArmA game since. I have recently just got back into ArmA via this Reforger game. \n\nI do like the return to the Cold War era, it is simple and focuses on tactics and team work more than weapon superiority. The game naturally encourages team work, with sections forming out of mutual intent to secure the same series of objectives rather than by forcing it. So it is refreshing to have a game where team work is mostly used.\n\nThat said, there are some critical failings in the game itself. Firstly, it runs horribly. I have a Core i5 13600K and a Asus Strix (massive cooler on them things) 4070Ti. Unlike other games where I can run them with a ±3 FPS tolorence (within standard game play), Reforger's FPS is all over the place; even to the point where I can increase or reduce the graphics settings, but that only changes the GPU usage percentage and doesnt actually change the FPS stuttering. And before you think it is the mods, I make this judgement both with and without any mods installed. Although I am on a PC, I think that the devs really need to get their stuff sorted and enhance the playability for console users - seems they have opened this game to consoles as well. My opinion on performance is based upon my use of RivaTuner to monitor my CPU, GPU, and RAM, so there are no system limitations at play when I say that the stuttering is horrible. \n\nThe second issue I have is from the recent update (1.6) where specific items and weapons become locked out depending on what soldier class you have selected. In my opinion, this is contrary to the historical vibes of ArmA where you take what ever it is that you need to ensure mission success, and you find a like minded group of lads and set forth as your own section. This class-based system is not desirable at all, it is appears to be trying to minic the class-based system of other games.\n\nOverall I actually do recommend this game - but, I cannot recommend this game to what might be the majority of the buyers which might be using console or older PCs that will struggle beyond the point it is worth the effort. I will absolutly be happy to change this review if at a minimum the performance problems are fixed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Since 1.6.0.68 Update game sucks donkey d...s. the countdown to uninstalling is on (after 1100hrs+ playing this game)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm a fan of the Arma series, I really enjoyed the game, but the 1.6 update ruined all my enjoyment of it, even affecting mod servers. We didn't ask the devs to add role-based functionality like in Battlefield/Squad, we love Arma for what it is, for it's freedom of action. Bring back the good old Conflict, because it's unplayable now",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Owner of a MILSIM UK, been running since feb 2025. Arma Ref has seriously taken peoples money and wasted a great game. Had nothing but issues from my server domain, and they do nothing to resolve the matter. Ruined anyone able to update mods since 1.6. Now having battle eye issues and cant even access in game play. Constant crashes, constant issues; high time they refunded peoples money. Game is unworkable. Spend fortunes on servers,as im sure others feel the same; and they do nothing for people spending said money and being out of pocket. Disgusted",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Recently they're ruined the game I'm getting fatal crashes every game.\n\nEdit: I crashed 6 times in one game I've uninstalled this trash I'm done with it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Getting a negative review until features are implemented as intended, new update released from the experimental version even though AI and commanding is still Jank AF\r\n\r\n- AI supply transport absolute trash even with ideal conditions\r\n- Confusing Commander role and no decent tutorial or guides in the field manual\r\n- Field manual wordy and confusing with no clear headers or organisation\r\n- Passive income for supply was better for casual gameplay but now so reliant on players for logistics it easily turns into Euro truck simulator but with worse physics and more BS, hense why no players want to go logistics unless they are a masochist.\r\n\r\nWas always a fan of Arma 3 and do like reforger but more work is required by the devs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Patch 1.6 completely changed the gameplay entirely, developers are ruining the game trying to force a drastic systems change on players...The devs are trying to cater more towards console players , who want fast games with no depth opposed to the PC players who built, supported, funded this franchise for almost two decades",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I haven't played for a week since the update, didn't have time. I logged in today and realized that it's impossible to play this game now. The sandbox mode and everything I loved about this game is now broken. Why did you add classes? What's the point? Keep this for consoles and remove crossplay. Let console players think they're playing COD. On PC, bring back everything from before update 1.6.\n\nThe game is dying on PC.\nI'm leaving Arma.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I am disappointed after \"patch\" 1.6.\n-> connection stall kicks still in game\n-> custom layout still resets after kick\n-> noticed more kicks at Vanillia servers\n-> for me more graphics bugs\n-> entities loads slowly",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Update 1.6 has ruined the game for me.\n\nIn the new HQC game mode, supplies quickly dry up meaning you can't spawn anywhere near the action.\n\nWelcome to the new game loop: Take a 5-10 min drive, get shot in the face, repeat. You spend MUCH MORE time driving or being driven than achieving objectives or fighting the other team.\n\nThe HQC mode relies on having a competent commander, most of them aren't in my experience. It's stupid to have a game mode that relies on a random person being a good commander. When they are bad it ruins the experience for the other 60+ people on their team.\n\nPerformance wise, the game runs very badly since the update too. It ran fine before - constant 60fps + for me. Now I get patches of 5fps which makes the game intermittently unplayable.\n\nI would change my review to positive if the devs added the original Conflict mode back onto some official servers. At least let people choose whether to play the new mode or stick with the original.\n\nAlso fix the new performance issues.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "F***ing over it. Back to back Battleye Query Timeouts across this game and DayZ, and others that utilize it. It's just more frequent here. The game itself is amazing, but unless you enjoy getting kicked midgame because the anti-cheat is a gigantic sack of dogs*** that can't communicate with its own servers, wait for a fix.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Update 1.6. The worst that could happen... In principle, all the innovations look good except for the gameplay of the \"Commander\" mode. Why try to turn Arma into a Squad? Please return the old game mode.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I do enjoy the gameplay of arma reforger when it comes to conflict and HQ Commander mode. And I would recommend purchasing this game if you are into tanks and helicopters since you use supplies to purchase them instead of spawn camping or waiting in teamspeak.\n\nThe reason for the negative review is because unfortunley the game developers have not adapted connectivity well into the game for users using wifi. Battleye anti-cheat system will kick you out of a multiplayer session 30-40 minutes saying \"QUERY_TIMEOUT\".\n\nIve tried to fix this issue on my side by disabling firewall, using WARP cloudflare, re-installing battleye and mods, however to no avail. \n\nIf you wish to play multiplayer on this game I highly recommend a wired ethernet cable since wifi will have packet loss even if you have fiber optic wifi with over 100+ mbps there will be issues.\n\nI highly recommend game master and the campaign well worth it!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1.6 is not the time. Unplayable mess of a game and the patch to fix it made it worse",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Vote kicked for joining a public server and banned from joining any server for 10 minutes. What the fuck. Can't even join a fucking match.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Cool game but I can only play for 15 minutes at a time until it crashes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1.6 update is awful. The MSAR system is overly restrictive, and doesn't fix the problem it attempts to solve. Supplies can still easily be wasted by bad actors. I will be uninstalling until this change is rolled back. Bring back normal Conflict mode.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Few months ago was totally hooked and actively recommending this game to anyone who would listen. Since update 1.6 it's clear these developers are totally out of touch with the community. Ruined moded game play as well as default mode, they removed/changed game modes that were very popular for some squad copy mode rather than releasing it as a separate game mode.\r\n\r\nIf you are coming from squad and want some cheap game copy or care about \"sim blabla\" sure it will might be for you. If you want a game and fun then they don't want to appeal to you don't waste your time and money. If they a ever add back in standard conflict mode I will repeal this review. Until then I have no interest in playing it and can't recommend it.\r\n\r\nP.S not even going to talk about the 1.6 bugs and performance, ruining the main game was enough, bugs are accidents these game changes were intentional.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Reforger was a lot of fun til this most recent update. 1.6, now its virtually unplayable on any modded server and completely ruined the fun of the game. It's a shame.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Finally decided to play the game.\n\nAI NPCs are still aimbots & see you behind tons of foilage & even if you're just a head poking over a brick wall similarly to previous Arma titles.\nPerformance is non-existent even with very high-end specifications.\nAnd crashed five times in the short amount of time played.\n\nDisappointed. Will return much later to see if anything changes...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "tons of hours on arma reforger, which also meant tons of fun on arma reforger. The new update absolutely ruined this game. Updates are supposed to make things better and i applaud development teams for caring enough to try. But this game is just broken as of now and as long as that update stays i wouldnt reccomend this game. i have bought two copies myself, and ive bought multiple copies for friends to join in. Its never to late to just go back to the drawing board guys. please save this game !",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "\"Milsim\" doesn't mean realistic weapons/ lack of UI, it means MILLITARY Sim; therefore it must have some actual teamwork. Nothing wrong with some solo gameplay as long as it is supplemented with a seperate gamemode for actual tactics. The new gamemode is a great idea but is awful in practice. The AI logistics is supposed to take the pressure off players, but it doesn't ever work(I mean OBVIOUSLY what did you expect trying to make AI drive across a map that large) And so it the same shit, valuble supplies being wasted by the newbies/ dumbasses whilst the players who would be good SL or actually know basic tactics are running errands. The game needs basic bugfixes and gameplay changes before such big updates, why is it not still in experimental?? Its a shame because this game got me into this genre as it has a monopoly on the PS market(in this niche) but it fails to teach key milsim principles- so why get angry at newbies if they can't learn in such an environment? No wonder nobody talks to one another- its just battlefield but slower from their perspective. Just look at \"Bellum\" I know it hasn't been stress-tested by the randoms yet but I can't see any errors in the gameplay, and it just started development, and isn't run by a massive company! I just hope arma 4 is better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You join server, then you do supply runs for 1 hour after that your game crashes. You try to join - full queue after 30 minutes you get into the queue and have to wait another 30 minutes - you join and in 10 minutes game ends. Final rating 10/10 would NOT recommend",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game, but if you are a casual player, you will have a hard time finding someone that actually communicates. Not to mention the trolls.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After the 1.6 update, the game stopped working online.\nEvery time I launch it, I get the message:\n\nBohemia Interactive backend initialization error\n\nBecause of this, the game can’t connect to my account, servers, or Workshop.\nA detailed report has already been submitted (ticket T188946), but the issue is still not fixed.\n\nRight now the game is completely unplayable in online mode.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Until the servers get improved I cannot recommend playing at this time. I cannot play more than an hour without getting disconnected from a server. Very frustrating.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Update 1.6 completely broke the game, made rank progression fast which is nice but if your vehicle explodes and everyone dies within the vehicle you lose rank, EVEN if it wasn't your fault. Unless if they fix this i cannot recommend this and you'll be better off playing something else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I've put many hours into this game, and while it has been glitchy and performance intensive, this recent update has completely destroyed any optimization. I don't have a superb PC, but at least I could run the game. I'm now forced to run the lowest graphics possible, incredibly low resolution, close all background programs, and yet I only average 10 FPS and regularly encounter large stutters. I want to enjoy this game, and I most certainly want to support it, but after over 400 hours, I can't even play it anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Update 1.6 broke the game for me, Every EU server I join crashes the internet on my PC, no its not my problem, I play a plethora of other multiplayer games and I don't have the issues. So I can only play US servers and half the time I join my PC freezes and I have to restart it. This update came out a week or two ago and yet no hotfix patch has dropped, Optimize your shit before you release it, it is not that hard, and before anyone says anything yes I cleared my catche. Game ran just fine before, now I can't play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "В общем, обновление 1.6 полностью сломало игру по крайней мере для меня. Я даже просто поиграть не могу нигде не в онлайне, не в сингле а всё потому что  после запуска абсолютно любой миссии или захода на любой сервер я нажимаю любую кнопку игра просто зависает и выдаёт ошибку ''приложение не отвечает''\nи исправить я это никак не могу. БОГЕМИЯ ИДЁТ НАХЕР!!\n\nIn general, update 1.6 completely ruined the game, at least for me. I can't even play anywhere, neither online nor offline, because  after launching any mission or entering any server, when I press any button, the game just freezes and gives an “application not responding” error\nand I can't fix it. BOHEMIA CAN GO TO HELL",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "was perfect till the Kolguyev update, ruined everything after this. \nearlier used to be queue sim and mod downloader now its a queue sim and mod downloader with a bad game mode.\n\n2nd update- they fixed the loadout issues with a mod somewhat bearable now, still wouldnt buy ( was gifted by a frnd).\n\n\n3rd update- made it even more shit now SERVER issues and FPS issues, everytime i think it is the deepest shithole they have made, they dig it a bit more deeper (the commander mode make the AI perform tasks that make it bad cause the AI rendering makes FPS go almost to the unplayable level and opening map crashes the games). Still have some hope on the devs and modders to fix this game, Let's see how worse or better they can make it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "BI broke their game with the last patch. When you ask them if there is a fix on the way all you get is some mod making idiot remarks. Not a great look BI.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This WAS my favorite game until the new 1.6 update removed the original conflict mode THAT I BOUGHT THIS GAME TO PLAY, as well as introduced a restrictive rank and MSAR system that is counter-intuitive and frankly, annoying. The game is currently FULL of bugs on PC and I am beyond pissed about the shoddy implementation of this downgrade. Currently I can't recommend this game until the Devs listen to their broader player base.\n\nHow to change my review? \n1: Reintroduce pre 1.6 classic conflict as a standard game mode with an added option to play HQC.\n2: fix supply delivery glitches and other recurring bugs that you continue to ignore.\n3: remove or turn down the film grain at night or add shadow clamping.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game has had some clunkiness to it but was fun. Post 1.6 its clunkier with little to no fun.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Honestly, wish I hadn't picked this game up. Ranks are wiped between server sessions, and frequent server crashes mean re-starting from a FNG all the time. Just annoying and repetitive. Tried to give it a chance but should've just requested a refund before 2 hours were up. Unfortunately the tutorial ate up a bunch of time before I could even see what everything was about.\n\nDon't waste your time and play something more enjoyable.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "1.6 changed the core game mode to focus on supply too much, the AI that is supposed to drive supplies doesnt work 90% of the time, and there is so much desync when driving that it becomes extremely frustrating so noone wants to do it. this update ruined the game that was already unstable and broken. and the devs are working in tiny things like hats falling off when getting shot or lipsyncing speech and i cant even play the game for half an hour without it crashing",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Buggy interfaces, lag spikes, freezes, and game crashing all for the low price of 40 USD. All with the included feature of terrible hit reg, so I hope you enjoy empty a mag into someone from 3 yards only for them to one shot you.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The bugs, performance issues, and sloppy movement and gun play take all of the fun out of this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game had been quite recommendable up until update 1.6, which broke all the mechanics that had been implemented, the game’s stability, the squad system, and ruined all the mods. The mods are the game’s greatest treasure — without them, the game would be mediocre — and that’s why this update is the worst work the studio could have done. The addition of wind affecting ballistics is very strange, and the anti-personnel mines are bugged. It was a good game (with mods) that has now become something unbearable. Hopefully, the developers will listen to the community and return to the path that made this game such a unique experience.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "glitches cheaters game crashes continuously .big pile of steaming shit",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Battleye Not working with the game therefore making the official multiplayer Unplayable :c",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs time set aside to fix the game. We aren't paying for arma 4. THIS is arma 4. I think its time to realize that. I can't toss more money at this game or the devs until the game is in a MOSTLY playable state for more then just the top of the line PC.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The game has changed for the worse since 1.6 update. Many of the changes to conflict gamemode sound great on paper but in reality it makes the game feel bloated and messy. The performance is terrible, constant kicks from servers due to connection time-outs, terrible FPS, a lot of bugs caused by lag, the entire screen is fuzzy at night and in shaded areas. The jank is insane. \n\nThe glory days of reforger are long gone, I don't see this game making a comeback. \n\nBetter to save your money and wait for Arma 4.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Currently, the servers are really underperforming. I would strongly suggest implementing a matchmaking system for solo players or small groups of up to four. Matchmaking works much better in these cases, especially since most servers either lack enough players or suffer from poor connection quality. Of course, server creation should still be available for communities with large player bases.\r\n\r\nAdditionally, the reward and punishment system needs improvement, and the game’s mechanics should be made more cohesive. At the moment, players can constantly friendly-fire, harass, or mock others without meaningful consequences. This makes the multiplayer experience frustrating rather than enjoyable. Team play is nearly impossible unless you’re already part of a dedicated community.\r\n\r\nPlease continue working on this aspect of the game. As a solo player, I’m not enjoying the multiplayer modes at all, even though the solo experience is awesome and genuinely fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Incredible game. Latest update ruined all modded servers. Traditional inventory, arsenal, rank, progression, loadout saving all basically bricked currently on modded servers. Cannot recommend the experience in it's current state if you intend to play anything other than Vanilla.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game was great till the recent update. We are now just delivery drivers constantly trying to supply bases.\n\nBefore the updates we had fun fighting to capture bases and push the enemy back, now its boring and joyless.\n\nThis is no longer a game you can just jump on to after a hard days work and have fun.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game was great until they changed all the game modes and made it unplayable. Thanks arma.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "loved the game the freedom it provided up until the update 1.6 destroying the sandbox aspect of the game took away the core mechanic that made this game fun now the game feel lifeless and stale losing its identity  i can no longer recommend this game sadly bring back the old conflict mode i hope they dont fumble the ball wake up devs !!",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Cannot in good faith recommend this game too long of development, the rank system makes the game punish you for suicidal teammates, you have to grind for a crappy rank and lose it within a second. This game suffers from the same issue as squad, devs keep catering to larpers who ruin the game. Pull the ranking system.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought this game and I cant even play it because all the servers are full and the ones that arent full always have the highest ping and eventually crashes my game. This is some bs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "most of my hrs logged are redownloading mods or having sit in a queue waitng to join again. ill be deleting this headache till i see things get better. 4/10 multiplayer",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Before the 1.6 update this was a great game.\nBut now it is a buggy mess everyone keeps crashing even when its a vanilla game, even worse if the server uses any Mods. \nIt isn't worth playing anymore.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Turned it from a blend of mil sim and arcade to straight milsim with class restrictions. 1.6 has completely ruined the game I enjoyed. At least keep servers with the old game. Dont bother buying.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Completely ruined the game after 1.6 update. Plumeted performance into the ground and what used to be an enjoyable experience in conflict is now super rigid and has lost the freedom that Arma is known for. Just check the charts Bohemia AR team has dropped the ball and player count is lowest its ever been due to their incompetence. Do better Bohemia, stuff like this shouldnt have made it out of exp.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Latest patch locked all forms of customization. A key aspect in military simulation. The player base is very frustrated and the steam charts show a severe down turn of player count. I loved the game we all did. As of the time of this review most of us are frustrated and all gameplay is very subpar and lacking now. Large teams dont exist, customization doesn't exist. I cant talk over enemy radios, heavy rank locks, very slow leveling, now again 0 loadout customizablity, restricted teams, the player count is almost 50% dropped and thats most of us are just logging in checking if the new patch has been removed then logging out.\n\nUntil then im not logging on anymore and ill change my review if the game goes back to being arma... a proper military simulator with the customization and everything arma was about since the beginning.\n\nLet us use radios like commo guys let us halo jump let us do anything but restrict the gameplay like we have seen. It ruined the game for most players just check the charts. And ill fix my review to reccomend thumbs up if the game goes back to being playable and fun for the majority of the community again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game crashes 3x during a match, the performance is hit or miss, the travel times are long just to get 1 shot from 2 miles away and have to run there again. If you like torturing yourself, play this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is unplayable at night-time because of all those white flickering dots like a 90s crt tv",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The 1.6 update has changed the game so much from what it was. The weapon and kit limitations all in the name of stopping supply waste, huge maps with a max of 48 players , constant crashing years in .... This is a test bed . If you want to play modded servers this is for you . I liked the core game . The reality is 48 players is not going to be enough to run an entire supply logistics game in the back with 20-22 other players .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The New squads update kinda sucks, It feels like the game mode doesnt know what it wants to do. the new squads is meant to encourage team work which I approve but the map is so spread out and large with only 48 players (24 per team) that makes it really hard, Like I cant place down construction and use teh construction trucks unless im engineer squad yet I can switch to the engineer squad on a dime and do it anyway? It feels like they changed very little while making it annoying and seem pointless. \r\n\r\nI think the system will work very well if they maybe tthe game mode focused the points a bit? but right now it feels like its trying to mimick squad but not really sure what they even want or are trying to do. \r\n\r\nThe game was a bit of a sandbox before and it feels like they are removing the sand while still keeping you in a large box, I actually still really like it. the biggest issue is the shitty desync which will spawn me upside down in a bunch of trees while im driving in the middle of nowhere. Logi life is tough",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "id love to play this new update but whatever you guys did completely broke my arma. ill load into a match and get as far as the map to choose where i spawn. once i choose where it is that i want to spawn at the game freezes and force crashes after 5 mins. this is an alright game but there is little to no help for anyone facing my issue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "fucking dogshit of a game after the 1.6 update and even the patch they did today 11/11/25 is fucking trash. spent a hour after the update to get the game to work or even let me on a server without freezing in the main menu or the loading screen of the actually server. and no it not my PC all my other games work perfectly fine. how are you going to have a update that make your game unplayable 80% of the time. updates are suppose to make the game better not worse and all this game does now if crash every 10 to 30mins. ive had one day were i was able to play for two hours and never again since. FIX YOUR FUCKING GAME",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Add an dlss option or something so my computer can stop hitting 100% GPU usage please :D",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Before this most recent update the game had so many options for different servers and different game play experiences. Either from vanilla servers having a little bit of mods to full blown modded servers. But after the update it feels like everyone's servers have been completely flushed down the drain. It's really heart breaking. So for now at the time being I cannot suggest or recommend this game to any new buyer's.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "1.6 ruined the fun of the game, they removed the ability to save your own custom made loadout, so now i have to go re-equip every single item if i want the same outfit and gun, instead of just being able to save and load the old one. i know they did this because they want to stop people from playing dress up at main base, but this is NOT the right way to solve that problem. + now the game crashes every 30 minutes. Fix your game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has been out for a while and its even less stable than dayz sometimes. Vanilla or moded it doesn't matter. Sit in a queue for an hour then get kicked 10 minutes in because the server timed out and join back in to regear and have it happen again. Its ridiculous and they still haven't fixed the issue.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gameplay is good, teamplay is good, movement is good, everything is good in this game except the network. Cant get into games cause I cant get connected to the servers. Only reason I dont recommend getting it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "after the last update they completely killed the game, making it truly unplayable and out of the players' line of thought, terrible",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the game was good before. maybe if they change things back to what they were id maybe come back but until then its not worth buying, you would be wasting your money. buy something else like squad or arc anything that isnt this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've had this game for a long time now and its had its ups and downs but recently they dropped a new update and the game is a mess, I've now had to drop my games resolution to about 75% from 100% or I have a solid 12fps. Now let be clear when I say this reforger is a good game but not a good product, as much fun as I've had the lack of WORKING SERVERS is just too much. \r\n\r\nalso last little tidbit the new update has only slightly broken the game :)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game itself is great, but I cannot play the game without constant crashing after the latest update. It's been over a month and I still crash about 1/hr, which is unacceptable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i liked the way the game was this new crap aint it kills all the gameplay that made this game fun i bought it when it was still good if i wouldve known about this update i wouldve kept my money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I’m honestly furious with what happened to Arma Reforger. This used to be one of my absolute favorite games, and this update completely ruined it. I don’t understand why developers insist on changing things that weren’t broken in the first place. It feels like they took everything that made the game great and threw it out the window.\n\nI’m so disappointed with the game industry at this point. Instead of listening to players, they keep forcing changes nobody asked for, and Arma Reforger is now another victim of that nonsense. I’m mad, I’m frustrated, and I’m genuinely sad to see one of my favorite games go down a path that makes zero sense.\n\nI hope the devs wake up, because right now this update is a disaster.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, who asked to turn the game's unique feature—freedom of choice—into a clumsy copy of Squad?\nIt's just a disgrace and disappointment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, this game SUCKS in its current form.\r\n\r\nDon't play, just wait until ARMA 4 is released if ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game ha major potential at its core but that core is almost unreachable since the game crashes every 30 minutes and disconnects you every 10. Would give positive review if this wasn't such an unstable mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After 1.6 performance is so bad its not even fun to play it was bad before now its even worse",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As much as I love to praise this game for all the cool stuff it does, it is not an Arma game. Movement is much faster paced, Plays much like squad for the most part, and is more of a pvp game than a fun player vs AI while zeus makes a story in between it. If this is what Arma 4 is going to become, I'll just go back to Arma 3 thank you very much.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The 1.6 update has ruined the game for many people. Recent update is riddled with problems including packet loss, disconnects, crashes and extremely low FPS. it has been weeks with no fix in sight. *EDIT* They've fixed some things but i still crash and consistently get 20 fps on a high end computer, done with the game for now until some major fixes arise, no current interest in playing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ive put over 600 hours in and about 1/4 of that time is sitting in que only to be booted out or server crashing constantly. The game is really good dont get me wrong, but the devs need to fix their servers and until then i dont recommend buying it and i wont be changing my review ill then either",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have had this game for a little bit of time. I loved it and enjoyed it but they released the 1.6 update. This ruined the entire game for me. The team class system is not that good and can be improved. The game now runs way worse. Fighting mechanics feel way off. I no longer recommend anyone buys this game until they even add a way to have the same fighting style and playstyle of pre 1.6.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun, exciting, good game, but it doesn't work properly 50% of the time. Servers are an absolute MESS. Reconnect system doesn't work correctly. Optimized poorly. Asset loading fails sometimes, results in you disconnecting a minute in with good ping. It would be a great game like Arma 3 if the servers weren't such a problem.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fix your game bro its been how long since the 1.6 update and its still buggy as, change it back and try again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not easy to configure needs a lot of work by makers to improve quality of weapons as an Ex British army sniper    when you pick up and use the sniper rifle     you just wave it round like its a flag it is not stable at all",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}