{
  "positive": [
    {
      "review": "Good. This game utilizes the Turn Icon mechanics for its combat akin to M:Re. a system which I think is far superior to the old One More/Pass system. It allows for a very flexible and thoughtful game play. Build diversity is enormous, though, as it has always been since time immemorial in SMTs, Crit build rules. It can be quite a grind when you try to build your team against superbosses unless you have the Mitama DLCs. I hate Atlus superbosses. The story is not very self-contained. You have to be a bit into mythological cosmologies and abstract philosophies to get into its story. It's more about the \"larger than life\" concepts rather than the lives of its characters. This is probably nothing strange to rpg fans but this game leans heavily into it. You can think of it like a pop culture reference cluster kinda story but with folklore and metaphysics reference instead. It can get a bit cold and bland at times, but overall I like it. Character designs are glorious. Revisions of some demon designs are excellent. New Odin looks so cool. Yes please to new Lilith. And can we get Nanoheeho on all SMT games?",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "[b]Shin Megami Tensei V Vengeance[/b] is the reimagine version of 2021 Shin Megami Tensei V. SMT itself has a long history of monster-collecting turn-based JRPG and SMT VV definitely delivered coming from a long standing franchise. With the second storyline/main route and many more QoL and features added, Vengeance is the definitive edition of an already very good game from ATLUS.\n\n[h1]Story[/h1]\n\tVengeance is a bit unique when it comes to its story, or rather.. stories. SMT V featured one main story, now dubbed “Canon of Creation”, and now Vengeance has added “Canon of Vengeance”. Both follow a protagonist and his group unknowingly transported to the other world called “Da’at”, which strangely seems to resemble Tokyo but in ruins and full of Demons. They got separated and in the moment of crisis for our protagonist the help came in the form of blue Demon “Aogami”. In the moment, the protagonist took Aogami helping hand and fuse together to become the being known as the “Nahobino”, the forbidden being outlawed by the Creator God. A simple accident seemed to quickly devolve into the battle for the throne of Creation and only the Nahobino can assume the role.\nNow that is the outline of the story in both routes. But do not assume that both of them are just a simple rewrite of each other. It’s more of an expansion to the idea of the previous Canon of Creation route and SMT Universe as a whole. The Canon of Creation route is not strong, to put it lightly. The pacing towards the end was rushed and there's quite a number of convenient plot points and unexplained story beats. Canon of Vengeance does fix and expand stuff that has previously been established in the old route, but itself also features the same problem albeit not as severe.  \n\n[h1]Gameplay Mechanics[/h1]\n\tSMT V is unique when it comes to normal gameplay compared to previous installments. Instead of the main area of the game being dungeons, this being a full open-world that we can explore freely and divided into large maps depending on how much you have progressed in the story. Both Canon routes featured their own unique area and one dungeon also. When it comes to open-world games, I’d say SMT V does a good enough job to not be a slog fest and not cluttered like in modern open-world games. There are 2 main areas which players can interact with; Tokyo map and Da’at. Tokyo is a place for human interactions and some quests while Da’at is the main area in which the story will progress. The open-world map, to me, is not boring like some other games out there. And while it’s not mandatory to do so, exploration will yield you some interesting side contents all throughout the game. \n\n[h1]Combat Mechanics[/h1]\n\tCombat in the SMT franchise is always the main focus for me, apart from the interesting thematic setting. As usual, SMT uses the Press-Turn System featured in all SMT from Nocturne onward. The number of turns you have depends on your actions, gain or lose your turns as you battle Demons, and same goes to your enemies as well. SMT V’s iteration is generally the same as previous installments with some improvement to make combat more engaging and challenging in some aspects also. Like Pokemon, your party members are Demons that you can either persuade to join you, or sacrifice your Demons to make a new one. You can build your team however you want without limit to breeze your way through every boss and super-boss (and trust me you’ll need a good team for that).\n\tOne thing is that SMT do have a reputation for being hard. Some even dubbed “Dark Souls of turn-based RPG”. But I do think SMT is not the same “hard” as people may think. Like previously mentioned, if you build you party and strategize well, you can fight the any boss back to back pretty well, even if you are under-level (virtual battle PTSD) \n\n[h1]Sounds and Music[/h1]\n\tOf course if some of you read my previous review on ATLUS games, I LOVED their soundtracks, more so for SMT. This time the main composer is Ryota Kozuka, previously on SMTIV, SMTIV:A as main composer, and various ATLUS games including Persona 4, Persona 5/Royal, Persona 3 Reload as supporting composer. And as much as I love Shoji Meguro as an ATLUS composer, the more I listen to Kozuka’s work the more I love his music. His experimental style is really unique among game OSTs. Even though his style is not for everyone, you need to acknowledge his music is innovative and fresh among the soundscape of same-same music these days. Some notable tracks, for me,  in Vengeance in particular are Battle -Qadistu-, Da’at -Kabukicho, Battle -“Vengeance” for reclamation, Battle -Dagda-.\n\tSounds overall fit the game and the effects are satisfying to say the least. The ambience fit perfectly combining with the soundtracks.\n\nOverall, Shin Megami Tensei V Vengeance, even though released in the same year as other great ATLUS games; Persona 3 Reload and Metaphor: Refantazio, remain my most favourite of that year. This game is such a unique experience it’s hard to make a comparison to. Clear and distinctive style of SMT will still remain my favourite despite the flaw of the story being not as strong as it should be. That title went to SMTIV in my opinion. But this game delivers on gameplay being really engaging and most fun in the series. Plus with the atmosphere and soundtrack, I can be really immersed in the experience that is Shin Megami Tensei V Vengeance.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Playing Shin Megami Tensei V: Vengeance on Hard mode elevated the entire experience, I enjoyed it immensely and loved it even more. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "JRPG's are all about evil fog and killing god, in Shin Megami Tensei, that's the entire game.\r\nIt really is the most jrpg jrpg to have ever jrpg'd. Great game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Nahobeeho\nSolid gameplay and Soundtrack, still haven't finished all content in the game but i do want to in a near future.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "First SMT game.\n\nCrazy good turn-based JRPG and monster collector.\n\nSoundtrack is great. Combat music is top notch. Overworld music is hit-or-miss (the fairy village music is rough).\n\nCanon of Creation (the vanilla storyline) is fairly weak. But this version of SMT V is praised because of the new Vengeance storyline. However, I recommend playing through Canon of Creation before playing through Vengeance. It's still enjoyable and helps fill in important context you'd miss playing Vengeance from the get-go.\n\nGameplay-wise, SMT V is all about strategy. It's not difficult strategy and there are fun team compositions you can make that are just kind of busted over time, but you'll have to learn how optimize your turn rotations and party pairings. You might have a team dedicated just to boss fights whereas another team may just be for farming. \n\nHowever, unlike other creature collectors, SMT loves to limit your pool of available characters, otherwise known as demons. This isn't necessarily a bad thing as the game encourages you to burn upwards when fusing powerful demons since lower level demons do not scale well over time due to high EXP demands. As a result, you can expect to keep one or two demons around throughout the game, but otherwise don't expect to become attached to specific demons and party setups for the whole game.\n\nThankfully, the cast of demons are well written. Most demons have some form of unique dialogue mixed in with a pool of generic dialogue specific to their race. This dialogue can provide insight to unique demon interactions when negotiating/recruiting, general history lessons, game lore, and gameplay hints. You'll find, despite inevitably become fusion fodder, bonding with most demons is beneficial since it also comes with stat buffs and new skills.\n\nYou can easily spend hours just fusing demons. In fact, the vanilla gameplay can become far easier by really leaning into trying out different fusions. If you run into a difficult boss, there is a chance you just fuse demons upwards and quickly overpower the boss on a rematch. There are also hidden quests that can only be found by fusing specific demons that cannot be found in the overworld.\n\nOverall, this game is well worth the price tag and I encourage anyone who has been on the fence with Nocturne to try this game out first. It's a great introduction to SMT that provides challenging turn-based gameplay, engaging creature collecting, and some of the best combat music around.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I originally played the first version of this game on the switch and loved it as this was my first Shin Megami Tensei game. The soundtrack and gameplay of this game is pretty good! I ended up playing the new path for this game with the different ending and I have to say it might be better than the original. My jaw was dropping multiple times throughout the game even though I knew one of the endings it still surprised me. I might be playing this again in a year or so because of those different endings! Overall I'd give this game a 9/10 One of my all time favorites for sure!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Shin Megami Tensei V Vengeance is one of the most intensely difficult Turn Based RPG experiences anyone can undertake, on par with both of Owlcat's Pathfinder Games in many ways. Very highly recommended for its stylized, sleek artstyle and character design, its eruditely crafted lore based on real-world mythologies that's  been worked on for decades now and its open-zone world map.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wasnt really aware of it being made by the same devs, but this game is literally just persona. it plays the exact same for the most part, the combat system is the exact same, they even have the repeat \"fog\" in the story like persona aswell. the abilities are the exact same in how you get them and what have you with the fusion system, some of the animations are pretty much exactly the same on the spells / skills as persona. i will say though, i do like it better then persona so far. i never really liked persona that much to get into it, and im not sure how this game is going to go exactly but im over 2 hours in ( have time offline atm of writing review over the 1 hour ) and im still in the same first stage area at over 2 hours in, its just..a really big zone or map they dump you in at the start. creature collecting is kind annoying, have to go through dialogue and pick the right option, differing from what each specific \"creature\" likes. aka a bad demon will want you to talk sh$t , a fairy might want you to compliment them or pay them money etc. now, all in all, its OKAY. I saw creature collector tag on SMT3, hoped it would be like pokemon or monster storyesque style gameplay. i dont know if i wouldve bought another persona game, especially at 27 dollars. its not a lot, but theirs so many other things you can get, and for cheaper. i will keep playing it more though, i do like it more then persona like i said already. best advice is save often early on, one mob can wipe your entire squad in a few hits at times and then you have to restart from last save. other then that...its a turn based RPG ish game with an AUTO attack and skill feature, so for that i recommend. Story length is pretty long, so if you do enjoy it you will easily get well over 27 hours of gameplay content.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "9/10\r\n\r\nThis game show the new quality of improvement visual, expanded demon roster, and better pacing make the game more approachable, especially for newcomers. Visually and musically, the game still delivers a strong post-apocalyptic atmosphere with memorable sound design.\r\n\r\nFor early game it will feel difficulty spikes and slower storytelling may turn players away—but for those who enjoy deep RPG systems, Turn Based Strategy, and dark narrative themes, it’s an excellent experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NAHBINHEE-HOOO! Music, graphics, jumping and slashing, everything I have ever wanted in a smt game. Beyond blessed that this exists. If you like rpgs, this is easily one of my top 5 of all time. The demons are so well detailed and alive. The music can't be described in words what it does for me. So many layers and instruments, sounds, it all feels so alive. Nothing but love and respect for the series. This game kills it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ultra Anime pokemon with Demons. \nIts Very good JRPG, but 60e is prety mad from game as simple as pokemon in Gameboy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All endings, all achievements, yet in the end it was the journey, not the destination, that made this game special. Doing repeated playthroughs in this game is quite cathartic as you learn to speed run the game as efficiently as possible. Funnily enough, the game also has an in-universe explanation for repeat playthroughs which I thought was very interesting.\r\n\r\nHonestly this game is probably an 8/10 due to the lacking story and characters but personal enjoyment included pushes it up to a 9/10. As someone who has played the base version of SMT5, this Vengeance rerelease is the definitive version offering many QoL changes and many new additions. Highly recommended for all turn-based enthusiasts, achievement hunters and completionists.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the demo since day one and brought the game recently it's just wonderful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played launch base game on switch. Boy, has this game come a long way.\n\nIt is now definitely in my top 2 for modern JRPGS, can't decide which one is better, this or Yakuza 8 (both I love for drastically different reasons, they don't compare besides being really good).\n\nI wait for a sale below $40 and it came. Well worth the price, even full. I just don't want to spend more then $50 on a game nowadays.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just awesome for old and new players, demons/characters are so good especially with latest graphics feels more alive than ever. Maps and exploration are great also i am having a blast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after coming from Persona games holy cow this game is amazing literally with the best turn based system i ever seen personally has to be my favorite turn based game i've played so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, another great addition to the SMT franchise. Now I just wish for Raidou 2, DDS  and both persona 2  games can be a remaster or remake whatever. Atlus/Sega I Know you can do it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very different from Persona, but it's supposed to be and what this game does offer is pretty great. Enjoyable story and really cool gameplay mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, great game when you played all persona games and want more, but dont want to go straight into hard and harsh smt franchise that looks so much different than persona. Newcomer friendly, with great hooks, characters and the improved gameplay mechanics, for me feels like upgrade from persona franchise. So far my favourite ATLUS game. The qulity of life upates and impressively magnificent music give the game high replay value.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first experience with Shin Megami Tensei was Nocturne as a PS2 classic on my PS3. Years later, I have yet to find an SMT game to surpass it as my favorite. I think in many ways SMTV is a superior experience, especially with Vengeance, but I find myself hesitant to call it my favorite. I can't exactly say why either. My complaints are honestly nebulous and have more to do with the gaming community at large than the game itself.\n\nI beat the original release of SMT not long before Vengeance was announce and waited for a sale for Vengeance. Frankly it's worth full price, but I think anyone who actually cares about the health of this industry should refrain from paying full price for any game over $30. You're not doing anything wrong by picking up this game at full price, and I think you'll have a great time with it if SMT is your jam. But you'd be doing yourself and EVERYONE else a favor by waiting for a sale.\n\nWith the preamble out of the way, this is definitely the SMT game with the highest quality of life. I appreciate Vengeance over the original release for both improving on the core gameplay and the story and for actually releasing on platforms that can handle it. Seriously, the Switch release was just passable enough that I could power through it. But if you want an SMT experience without a lot of the random BS like randomly selected skills, widely available and common instant death spells, or smirk (I love smirk, but it is BS), this is definitely lacking in those departments. There are still instant death spells, but you can plan for them abundantly. You can save anywhere, side quests are plentiful and hand out EXP like candy, and you run fast enough to avoid most battles if you really need to not get in a fight.\n\nThe demon selection here is insane, too. I love the side quests, though the opportunities to play as demons are often underwhelming, and they really went the extra mile to dig up and present some deep cut mythological references. I actually liked the story this go around and it was fun to dunk on the Qadistu. As with most SMT games, this one scratched that mytho-nerd itch enough that I wanted to go look into the origins of the new designs. I also think Masayuki Doi has come a long way from SMT4 and has created some compelling demons, even if the stand outs continue to be mostly naked females and Kamen Rider references.\n\nWith all that in mind, I can't help but feel SMTV has lost a lot of the soul of old SMT. Doi is not Kaneko, which is not inherently a bad thing. But there's a clear difference between this an old SMT even if SMTV is an intentional successor to Nocturne. It's like a game in the same vein as Morrowind or Monster Hunter World where where the broader gaming community is finally figuring out that this franchise is worth the hype. But to maintain that audience, they'll have to make it even more accessible. If SMT6 is pure slop, I won't be surprised. Because this title definitely leans towards accessibility to a degree that I find concerning. It's certainly a \"Real Shin Megami Tensei\" game in that journalists were complaining that SMTV at launch wasn't \"Persona enough,\" which is precisely what I'm after. But the \"niche\" (in the grand scheme of things) franchise is finally getting attention, so it will either resist the temptation of fat stacks of cash or succumb and be unrecognizable in a game or two. I pray that doesn't happen. But the game came out, it's good, and people know it. I won't blame you if you stop caring about future titles long enough to enjoy it, because I certainly did the same thing. This is still a great game in my favorite JRPG franchise and I can tell you to pick it up with my full chest.\n\nAlso, I played a lot of this on my Steam Deck. It ran great and I have no complaints regarding performance or textures due to running on a lower powered PC. I doubt anybody reading this would be considering it, but I definitely don't think you should pick up either version of SMTV on the Switch. Not when the PC version exists.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Near 100% the OG on the switch. This version just offers more than the original did. It was ALREADY a good game. Now its a great one. Worth getting. Better than Digimon Time Stranger hands down.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For me Shin Megami Tensei is as much about the story as getting killed on an unlucky RNG. \nHowever SMTV nails... None of that. \nBut let me explain.\n\nSo is SMT V: Vengeance a good game? \nShort answer: Yes, as a JRPG\nLong Answer? Depends.\n\nNow a disclaimer... \nI am NOT a veteran SMT as in the sense that I've cleared SMT 1/2 or the other spin-offs like Soul Hackers, The Raidou Series, DDS, and etc. However I am familiar with the formula through playing through Persona 1, 3 and 4, Nocturne, and SMT4. \n\nYet, I must say SMTV failed to capture the same feelings like P3 / SMT4's story and Nocturne's difficulty which are core to the SMT experience in my opinion.\n\n[Story]\nFirst let's talk about the biggest issue that led to this updated version which is the story. I played Canon of Vengeance thinking it was going to have deeper narrative weight to the story, but I was disappointed when I find there's no cohesive plot to the story that gave a real theme to it. \n\nTL;DR the \"Japan\" you're in is an imaginary bubble that's connected to the real destroyed Tokyo called Da'at. After becoming a Nahobino, you have the power to reshape the world and you're tasked with protecting the current Tokyo by defeating the Qadistu. A group of demons that wishes to destroy the cycle of reincarnation in service of the Serpent god out of VENGEANCE to the Horned god who was the previous Nahobino that won the throne and altered reality to his image... \n\nAnd that's just the basic premise after you stitch everything together, but some details are missed. Who's the horned god? Why is Japan a bubble and nobody noticed? No idea. \nBut hey, there's 4 hot chicks for you to beat up, so get to it!\n\nYes, the Vengeance there is not some hint that our character is out for some vengeance it's the theme of the Qadistu that you won't know until late into the game. Until then you're literally trying to figure out what the hell are these Qadistu girls and why are they so hot? And why should you care for a reality that's not even real? \nIt makes your early playthrough about clearing levels for the sake of clearing them and the Qadistu a villain of the week type of plot device. \nOther characters like Atsuta and Dazai are also very stereotypical for what they represent and you don't share enough time to really care or get to know them. Atsuta is the responsible and protective brother of Miyazu,\nDazai is the fool trying to be king.\nThe 2 representative of your alignments that judges you through your quests are Tao and Yoko. \nRepresenting the law route is Tao. If you know, you know. She's the most boring one with the least depth. \nRepresenting the chaos route is Yoko. Actually useful and interesting because she thinks for herself and reacts to the world. She's the cynic that values self-preservation and basically carries the entire story and it's interesting how you can influence her belief with your choices.\nHence, no one outside of Yoko is actually interesting. Not even the Qadistu that just does cruel things for the sake of cruel things until it's properly explained.\n\nSo really, don't expect a good story for this game. Not to mention how close this is to Nocturne's in the setting and idea, that you'd wonder if this is actually a sequel, but no. \nEven Nocturne had a better story than this and that a.\n\n[Gameplay]\nIt's interesting, the obvious one is the Quality of Life mechanics. You can save anywhere now, inheriting demon skills are easy and not about RNG anymore (if you came from P3 or Nocturne), there's affinities too, know what the overworld demons are, jumping, magatsuhi skills, and innate skills. However one can boil it down to a word... these features are \"Experimental\". I will be the one to say Innate skills for demons are the most interesting part and what they should keep in future games. However unique skills, and affinities break player experimentation because some are too good that they end up as a meta especially one with support skills and heals like:  \n- Idun's Golden Apple\n- Cleopatra's Frolic\n- Sakuya's Sakya Sakura \n\nFor affinity, it's a mess too. MP usage depends on how good their affinity is with that element. So for example... a 150 MP zio (lightning) skill on a 0 affinity demon can be just 90 MP if they have +9 affinity. You can also get a negative number (like -6) affinity which by that point means you're better off using another demon. In other words... You end up looking for meta demons. \n\nYes, Older SMT has affinities too, but implicitly like lower chance of passing through skills they're weak at. So then why not ignore affinity here? Because MP economy is VERY important in this entry since EVERYTHING is with MP. Usually you can pack a Phys skill because that costs HP instead of MP so it's more sustainable while also balancing risk. Now, not only does your demons have limited pool of MP, every skill even Phys is with MP and they can be VERY costly. This means instead of heals, you will rely on a lot of chakra drops/soma along with skills that can give MP boost. \nTHIS SHOULD NEVER RETURN. It limits demon builds because you need to use the limited skill slots just to cover this and some of their weaknesses, on top of affinity limiting what you can put on a demon.\n\nAlso, pro tip? Every demon is either resistant/null/blocks light and dark so those demons who primarily uses it are useless... Agi (Fire)/Bufu (Ice)? Nah, you'll have more luck finding ones that are weak to Zio (elec) and Force (wind). So don't even bother if that's not their main affinity. Better yet... just use Phys because there's a skill that's a hybrid between piercing and charge making it a pseudo almighty that actually crits. Now suddenly elemental skills doesn't matter because that physical skill will blow through every elemental resistance.\n\nSee the problem? The choices given are basically an illusion.\n\n[Music/Sound]\n\nI don't like SMT V's music... SMT and Persona always have a strong musical identity. Nocturne with Rock/Metal, SMT IV's electronic/synths, Persona 1's 2000's pop rock, P3's blend of hip-hop/rock, and P4's pop-rock/jazz. \nSure it sometimes has that blood pumping OSTs like \"Vengeance for Reclamation\" or \"Strength\" but the overworld music is sometimes just ass. Especially the ones that whispers in your ears like the one in Shinjuku 3rd Block as you run around trying to collect those damn Mimans. \nAlso just listening to \"Battle-Origins\"... that's literally \"Forced Battle\". \n\"Battle-Da'at \"Vengeance\"? Put on SMT IV's \"Battle-A1\" and it won't feel like you changed a thing. \n\"Battle-gliding\"? SMT IV's \"Battle-A2\" less energetic cousin.\nAnd don't even start with how I keep hearing those Mandala jingles like it's Nocturne PTSD. They literally start the same but is just bland... Like they don't know what kind of theme they wanna use. Sometimes it's SMT4's synth and sometimes it's Nocturne's rock.\n\n[Conclusion]\nI see SMTV as an experiment on how they want to portray the SMT series moving forward. Everything is more simplified, and it mixes a lot of ideas from previous entries. However it turned it into a Frankenstein monster instead of its own identity which is a BIG missed opportunity. \n\nThey HAD potential, I wouldn't rant this hard if they didn't. The gameplay loop is a lot more streamlined to make your run less grindy than other SMT games which is GREAT, you can actually focus on making your demons without sacrificing hours to get them to your level, and you can make some cursed stuff if you level them enough. \n\nI think if you're an SMT fan, then yeah this game might not be as in-depth or hard as you're used to... but there's enough challenge in here that doesn't deviate too much gameplay wise. However, if you want to get into SMT, I implore you to try other SMT games after this. Yes, this is a good beginner entry, but it's not the full SMT experience.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you loved the Persona series for its gameplay i.e. the press turn system ( gaining extra turns from hitting weaknesses ) then get this game. Gameplay wise, this is superior. Its basically Pokemon but better.\r\nBut if you're expecting a great story, then SMT 5 falls short. Its not bad but not great compared to Persona 3 and 5.\r\nBut the lack of a amazing story isn't a dealbreaker because the gameplay is addictive, the strategies are endless, the difficulty is hard but exciting and the open world is interesting enough to explore.\r\nThe game has enough content. Go for it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am a first time player of the Shim Megami Tensei franchise, so far, I understand its the parent of Persona, seeing as Persona was initially a spin off of this franchise, though, so far I find it visually fascinating. Demons have only been depicted as of things of brutality, temptation, and to cause suffering of any measure. However, while some are visually grotesque or visually displeasing (I mean that in a good way) and many so far seem to be more like monsters, though, one could argue that monsters and demons go hand in hand; although, some are very cartoonish looking. Something I've come to expect from playing Persona 3 way back when, as well as 4. Either way, it's an odd thing to think about. So far the story is very interesting and at the moment lacks depth, but I will cross that bridge and discover more story to the game and 'lore' that may exist. Game play wise, nothing I wouldn't expect from any RPG. So far so good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Going through tutorial.\n\nMeet a pixie. \n\nDudebro hands me a jewel, telling me to woo the gold digging pixie for the tutorial.\n\nMeet a group of slimes afterward.\n\nTalked to it about the weather.\n\nIt ate my pixie.\n\nThen it bodyslammed me.\n\nMy entire being dissolves as the dudebro just stares at me.\n\n10/10 experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not sure if I played the same game as everyone else because I do not understand whatsoever why anyone's praising this game's story; it's still awful. I haven't played Canon of Creation but I have trouble imagining how the story could have been WORSE than what I experienced here. \n\nHowever, for me, the gameplay is the best I've experienced in the entire megami tensei franchise (especially combat and exploration) and maybe even any turn based game I've ever played.\n\nThus, my recommendation of this game entirely hinges on whether you can ignore a pretty crappy story to experience what this game has to offer in terms of gameplay. If you can, then this game is 100% worth it. Otherwise, you're better off playing other games in the franchise. \n\n(Note: it's come to my attention that people recommend playing CoC before CoV because there's important context exclusive to CoC that makes CoV more sensible and enjoyable? That's unfathomably stupid. The new story in Vengeance should be able to stand on its own without needing info from a previous iteration of the game's story that is regarded as sloppy and unfinished. No one is playing 70-80 hours of a bad story just to experience the other 70-80 hours of story (granted it's probably much less due to NG+) that they may or may not even find enjoyable. That is so incredibly unreasonable to expect of the player.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was pretty good, not the best JRPG I've played but still worth your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I support women's rights and especially women's wrongs.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Better than Persona 5 in ways, worse in others. Has Idun, but the music is worse. One thing I don't like is the lack of choice. Tao is the only correct option, after all. Skip Canon of Creation--it's super lame.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a great game grinder.... so much better on steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "--Writing as someone who has a job and likes the other games in the series--\nIt's a great game but drags on in the 2nd half. The final 2 areas add about an extra 20h+ as you're expected to reach around lvl80 - but just doing story will get you to around lvl68~ , expects you to do allot of grinding, for levels, upgrade currency, demons, demon fusion fodder, etc. \n\nThe new Vengance path is a cool little extra story for if you played the original. The characters were handled way better and made them seem like actual SMT reps en par with SMT4. BUT it's a little cliched at the end and I think by that point I just wanted it all to be over. Probably won't be replaying or doing any post game any time soon.\n\nIt's a good first SMT but yeah, difficulty and the Git Good ceiling at the end is a bit of a time sink. \nCan we get DDS HD collection next please :3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite a long game, good luck completing it 6x",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "0 out of 10, I COULD NOT SEE JACK FROST OIL UP, but at least I have a good blue femboy on screen, game 10 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really great game with the peak press-turn combat system",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I had no idea about the Shin Megami Tensei series and took a chance on this game. I'm glad I did.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is just amazing, buy a lot of spyglass's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game's been a refresh for me. I was PLAYING a game instead of watching back to back cutscenes.\nHaving the SMT formula makes it easy to approach and the soundtrack is another banger 🕺. The performance is solid and smooth on my 6700K+rtx3070, just needed to install a simple ultra-wide mod. \nI had a lot of fun. Now I'm waiting for more :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best turn based game I've ever played. The soundtrack is complete fire, The atmosphere is great in a lot of areas, and the amount of demons you can fuse, recruit and strategize with to tackle challenges in so many ways is what gives this game so much replay value. I have like 16+ playthroughs of this game together across consoles and here. Genuinely one of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Weird seeing most of my FGO roster here.\r\n\r\nReally good JRPG, now on to Persona.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Might be a little teeny tiny eensy teensy itty bitty bit peak.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Law bros to the right. Chaos cultists to the left. And here I am stuck in the middle with you!\" \n\nIs SMT V: V a good rpg? Yeah,and that is stating the obvious. It's difficult to figure out how to add to the discourse other than to say I have enjoyed it immensely and on sale for around $25.00 it is a very much a sweet deal! (And even if you got it at full price you would not feel short changed beyond a few dodgy dlc purchases which are fortunately not needed to make the game feel complete.)\n\nHowever, I cannot speak for people whom already played the vanilla version. I don't know how much the canon of vengeance diverges from the canon of creation. What I can say is I'm elated it runs so smoothly on my pc. I have not dealt with abrupt errors leading to random crashes. Performance wise SMTV: V slaps! (At least with my specific specs!)\n\nPlot wise you know what you are getting. An apocolyptical series of events happens. There is a war over the throne of God to recreate the world. Demons, angels, fey, urban legends, and creatures of folklore can now pierce the veil into our world. Feuding fractions break up into the law, chaos, and neutrality alignments. \n\nIt's a rock solid foundation for an intriguing setting albeit one that has been repackaged countless of times before. World building and important events vary between games but the Machiavellian machine driving the overall escalation forward always leads to modern humans having to survive their first contact with supernatural beings.\n\nIf you are tired of apocalyptic settings brought about by the atom bomb or bioengineered plagues then Shin Megami Tensei can be a refreshing deviation from the usual tropes. It's much more biblical in its' approach to the subject matter. Normally I would enthusiastically recommend the series to Christians whom want to experience a work of fiction happening during revelations and the rapture but because the angelic law fraction are not always the default good guys that might be a tough sell. \n\nYet let us not delude ourselves here. All this is padding and posturing using mature themes facilitates what is essentially a more edgy yet still cute Monster Rancher/Pokemon turn based dueling simulator for adults! You have hundreds of mythological creatures to level up, train, and to fuse into more powerful variations. Every \"type\" has weaknesses and strengths versus its' peers. If you exploit an enemy's Achilles heel with flare you are given more turns to climb up the combo chain! It's sublime, it is simple, and it is still fun. Certain things age like fine wine and SMT's press turn system is one of them!\n\nI'd be remiss if I didn't mention the music. It has a brilliantly discordant, melancholic, and unsettling pitch that goes perfectly with the game's many haunted, possessed, and ruined vistas. Listening makes me feel as if I'm in an unsettling wonderland that's caught in a cosmic spiderweb between objective reality and a waking existential nightmare!\n\nSMT V: V is also is savagely beautiful with its' visuals and art design though by now some might find the overall graphical fidelity to be behind the times. (To which I say \"Whatever, man!\". We already know there are plenty of games out there with high resolution cutting edge realism that both look and play like stinky dog water!) \n\nMy only qualm is there are yet more teenagers dealing with yet more high school drama stuff. I understand why culturally Japan idolizes adolescence so much. It embodies everyone's energetic wonder years before they are forced into the wage cage!  But could we have gotten something more along the lines of Strange Journey in which a team of SKILLED ADULTS were sent in to deal with the anomaly instead? That would have been much more believable. Okay, I'll stop boomer posting! For the most part the characters are surprisingly likable and very well written. They feel \"human\" and that's the most important part. (I just want more busty milf protagonists in SMT! Ya feel me?)\n\nWelp, that's a wrap. Do the fusion dance with your super saiyan nahobino uncle then prepare yourself, young man! God's throne awaits! (And it better not be a giant toilet!)\n\nPros\n\n+Press turn combat system is still fun to this very day!\n\n+ \"A lot\" of quests, hidden secrets, and overall content.\n\n+ The number of demons you can train, fuse into more powerful creatures, and learn from is impressive even by SMT standards.\n\n+ The overall story is not the best in the series but it is good enough you press on with just one more scenario to see where it all goes.\n\n+Music and art direction are sublime. \n\n+Want to be tortured by sexy big booty biblical bombshells? Let me introduce you to the Qadištu! (Woman, I'm not trapped in here with you. You are trapped in here with me!)  \n\n+ Safety mode difficulty if you are too old, too busy, too cranky, and too tired to fight a single boss for 2 hours straight!\n\n+ Despite the atypical high school setting at the very beginning, SMT V: V does have an overall darker, more complex, more mature, and grittier approach when compared to the more modern Persona games. (SMT V : V is  very much its' own \"beast\"!)\n\nCons\n\n - More teenaged melodrama.  (Bah, kids! Get off my lawn!)\n\n- Those whom picked up vanilla SMT V will feel cheated.\n\n- Dlc shenanigans. \n\n+/- Neutral\n\nThere are moments in our lives we collectively romanticize philosophical shades of grey too much and this might be one of them! As if it's an outdated concept to make situations and characters that boil down to being 100% good or 100% evil. SMT suffers from this a lot. As in no matter who you side with the game will make you feel like a jerk regardless! If you help character A you find out character B was tragically misunderstood. If asked \"Are you winning son?!\" I would respond with \"Uh, I don't know for sure, dad! Get back to me in a few years after I process it all!\".  \n\nSeriously SMTV: V , stop jerking around my chain. I'm trying to enjoy the immersion but you keep projecting all that subversion! What is this? A big brained redditor fan fic about how God's angels are secretly the bad guys? That I should become the ultimate simp when four neurotically unhinged fallen goddesses with a boombox crank up their remix of \"Unholy\" whilst trying to eat my soul? These shawties need to realize I'm a top and not a bottom! (Bootie Warrior voice)\n\nI'm being fictitiously tongue in cheek if you could not tell already! I have managed to appreciate the lore and the character interactions very much! However, I sympathize with those  whom feel as if SMT plays it too fast and too loose with its' interpretation of religious and spiritual icons.   In addition its' attempts to shy away from more traditional concepts of objective good and objective evil can leave the player feeling aimlessly lost in the quagmire of petty semantics. \n\nCertain people are going to perceive this as a masterclass in rpg story telling that reinterprets old ideas in an appealing new modern way. Meanwhile others are going to write it off as shallow sensational slop trying to project a semblance of  depth it simply does not have.\n\n  That's why this is in the neutral section. The way this game portrays our myriad myths, folktales, and beliefs  is going to be a tug of war struggle session within the hearts of many gamers based upon their own personal preferences and upbringings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No lie there's probably like over 50 if not more demons I would crack in this game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "decent turn based combat. Cool Demon Merging system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this might be like a good game i forgot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can reject Gods one more time in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love SMT, this game is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "on everyone's souls we are CRACKING loki tonight",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games I've played!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "now i know why they call this serie is dark soul turn base",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thank God they fixed the Switch disaster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfection.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I want to [REDACTED] the Pixie",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No words, just vibes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i goon to cleopatra but nobody now ts",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you already know\r\njrpg shin megami \r\nwho do you love",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Havent even finished it yet but I can already tell you its good.  Fusing demons to get stronger demons is fun and has alot of depth.  \n\nIf you're going to buy the dlc to save time on leveling, then do yourself a favor and increase the difficulty to hard.  At the time of this review, I'm 47 and the current story area is only lvl 20-25.  All because I farmed the mobs from the dlc for hours.  You need to put the difficulty to hard then if you decide to farm those mobs. \n\nGrinding takes awhile without the dlc, like alot.  Several hours per level.  The strategy in combat is there when you enter the boss encounters but normal mobs can be killed just with basic attacks.  \n\nWhat I mean by basic attacks is, you still need to use something that is an opposite element to their attack.  For example, they use wind magic and have resistance to wind magic, so you need a demon on your team that can hit them with another spell type and has resistance to wind.  So it requires like one brain cell to conduct turn based combat in this manner with boss battles requiring alot more thought and setup.  Youre kit of demons must be leveled and have the proper defenses for the boss fight or they will get 1 shot easily.  The first time you enter a boss encounter, you'll most likely wipe just learning its attacks.  All bosses choreograph when they're using a signature ability, all you need to do at this point is use an item to negate that attack and it makes the boss battles sort of trivial.  You just need to make sure you're properly leveled.\n\nAs I said earlier, leveling takes time. Alot.  You need to level multiple demons for multiple team setups.  This will take a multitude of hours.  Most of the 80 hours of gameplay is grinding to fight the bosses.  I only have 50 because I bought the DLC which sped everything up.  \n\nIn the end there is immense strategy with the demon fusing.  With team setups in the several dozens using around 200 demons you can collect like pokemon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best atlus games ever made",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's peak, I'm afraid.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Dare I say one of the great JRPGs of all time?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Truly fire",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good af",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shiva deez nuts",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "HOOOLY PEAK",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, so this review will be LONG. I started my playthrough through Shin Megami Tensei V: Vengenace on July 9th, 2025. I write this review on October 21st, 2025. It has taken me nearly four months to finish both my playthroughs of the games different stories (or canons). Four months to have this game become perhaps one of my favourite JRPGS of all time, and definitely my favourite Megaten game. I'm sure many other players could have finished it faster, but I'm glad I got to really soak in and absorb every single part of this game. It has its many flaws, like all games do, and they can be pretty glaring at times. Even still, I implore you to give this game a shot. If you're a fan of JRPGs or Megaten in general, I know you won't regret it. \n\nFor those who don't know Megaten, it's a VERY LONG series where colorful casts of characters fight in order to reshape a dying world in favour of different alignments. Law, Chaos, Neutral are the common three\n\nAnd of course, with Vengeance being a rerelease of the original switch exclusive SMT V, there are a plethora of big changes that affect both canons. All these quality of life changes and new features bump up the game and make it the definitive experience. A short list of the most important changes are the following:\n- New story path (the main selling point of the game)\n- Innate skills, passives that add an entire extra level to demon customization and specialization\n- Over forty new demons being added to the already expansive roster\n- ABILITY TO SAVE ANYWHERE\n- Virtual Trainer (rematch system against basically every boss)\n- Aogami Husks (helps you get some abilities for fusion)\n- Demon Haunt (a social area where you get to chat up your demons about their feelings on current events)\n- Rails that allow you to shortcut through the map, or allow you to reach special pockets of land with treasure\n- Sky view, gives you an aerial viewing of the surrounding location\n- 89 NEW SONGS THAT ARE ALL BANGERS FROM START TO FINISH\n- All original DLC are part of base game\n\nBefore anything else, I must address the music as a stand out part of this game. It is perfect. Perhaps one of the best videogame soundtracks I've had the pleasure of listening to. There is so much variety, so many different tunes with different motifs and moods and its just... perfect.  It's consumed my life and I find myself listening to it whenever I get a free moment. That vengeance credit theme just hits some kinda way... \n\nSame with the gameplay, which also deserves its own praise. The press turn combat system that was introduced in Nocturne is still one of my favourite JRPG battle systems ever. Earning an extra half-turn for exploiting a weakness. Losing some turns if you miss or get your attack nulled, or losing ALL turns if the enemies drains or repels your attack. And the best part is that the playing field is even for both parties. Sure, you can dumpster enemies if you play your cards right. But enemies, especially bosses, have their own way of rigging the system in their favor. One weakness exploit can lead into a full party wipe, which forces you to have concrete strategies for whatever you do. Combat can be both trivial at times, and near impossible at others if you allow it to be. \n\nAND THE DEMONS. THE DEMONS! THERE ARE SO MANY COOL DESIGNS AND ALL THE DEMONS ARE FROM DIFFERENT REGIONS AND RELIGIONS!!! Folklore fans always eat great with this series. I cannot do the designs enough justice, they are the bread and butter of Megaten.\n\nNow onto my thoughts on the two different canons that this game has to offer. While I may like the new route more than the original, I believe both need to be played in order to have the perfect experience. I played both routes on the Hard difficulty, but there are easier difficulties if the game is too challenging (I believe this game shines when its hard)\n\n[b]Canon of Creation:[/b]\n\nVisually, its great. I love the many different locations of Da'at, that all feel oppressive yet free with their atmosphere. Knowing that you walk among the ruins of civilization makes for some scary thoughts. And the background music just completes it all.\n\nChanging from a random encounter system (from previous entries) to the current overworld system where you can attack the enemies on your own terms takes a lot of frustration out of navigating the world (although Estoma, a skill for warding off enemies, is very pointless here). Fights can range in difficulty, depending on how prepared you are. If you're going into a fight blind, there is a decent chance you may get wiped in a turn or two. Some fights will just kick your ass regardless. But sometimes, the fights don't really pose any challenge to the player. There aren't many strong gimmicks when it comes to the main fights either, other than manipulating the Press Turn system.\n\nStory, a focal point in most JRPGs, is just... alright? I'd say this is the biggest failing of the original game, sadly. That being said, I do like the story! Siding with different ideologies on how to reform the world is the coolest thing ever. However, the majority of characters that represent the different alignments feel more like tropes, and less like characters. Not only that, but the story offers so little time with some of them that you might feel indifferent when it comes time to pick sides. The ideas there are good, some set pieces like the [spoiler] Nahobino fights in the Empyrean [/spoiler] are phenomenal, and I think some characters like [spoiler] Abdiel [/spoiler] really shine above the rest. But the story ended and I just wished there was a bit more to it. Still, I enjoyed my time with this canon, and I think it deserves to be played just as much as CoV. I ended this canon with the Chaos ending.\n\n[b]Canon of Vengeance:[/b]\n\nAreas are the same, apart from the third area and accompanying dungeon being completely new in CoV. Can feel samey if you go through both stories back to back, but the new area [spoiler] Shinjuku [/spoiler] is probably my favourite in the whole for how gorgeous and ethereal it feels. Something about it is just so magical, despite it being filled with demons, I'd want to walk around it a little and soak in the atmosphere. [spoiler] Shakan [/spoiler], the new dungeon, is okay I guess. Very short and the 'gimmick' isn't very well used\n\nMost gameplay notes from Canon of Creation are present here, although the intro of Guest characters was such a well-needed shakeup. Having your friends actually join and help in fights makes much more sense than just... NOT HELPING WHEN THEY EASILY CAN. Now you can fight hand in hand with your buddies, which made CoV stand way above CoC by itself (at least to me). Another note about the battles is the better used gimmicks within this route. A lot of fights in the original story could feel very similar, so having actual gimmicks made the battles feel so much more powerful ([spoiler] even if I hate some of them fuckkkkk Tiamat that fight was brutal [/spoiler])\n\nStory is a huge improvement over the original, its way more character-centric and the chatacters are way better utilized. The tag-along of [spoiler] Yoko and Tao [/spoiler] throughout the middle of the story to provide commentary and moral dialogue may be annoying to some, but it feels quite nice to me. When things happened to the characters, I cared more. I wanted only the best for everyone. Characters like Yuzuru had so much more presence here, compared to CoC where he is sorta just... there. I think there are good aspects about the CoC story that are absent here, but that is why I believe both stories need to be played for the best experience. I ended this canon with the Law ending.\n\n\nI'm gonna miss having this game as my main obsession. It may not be everyone's cup of tea, but there is something special here that I am in love with. Maybe all my ramblings don't mean much to someone who doesn't know this game well, but I hope someone else will love this game as much as I do",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "it's still shin megami tensei v, to my relief. i liked that game where many didn't, in part because it was sympathetic and moving to play a game that had clearly struggled so much to get made, both on the nintendo switch hardware and due to the covid pandemic. wandering through a game full of holes felt familiar in an unexpectedly personal way, and let me forgive and even appreciate things that many found fault in. and even though this is the fixed, complete edition of SMT5, it still retains those strange absences that i found so compelling. massive plot events happening off-screen, a clearly unfinished and rushed final act...a diamond without a flaw is not a diamond, and vengeance has remembered the importance of that, even as it polishes its battle system to near-perfection.\n\nlike a lot of shin megami tensei stuff, it's much more engaging to just enjoy the clash of occult symbology rather than decipher a greater thematic resonance from the plot, such as it is. all the concepts are arresting enough that it doesn't necessarily matter too much to me that they don't go anywhere, particularly when the game is more interested in being a mood piece than anything else. they have, thankfully, realised that the more people talk about these images, the less interesting they are, a lesson the hashino side of the company would benefit from i think. i love the idea of the nahobino, the alchemical rebis reinterpreted as each persons' unification with their chosen patron into something that defies gender, contrasted with the tragic goddess role as something that subsumes the self under it rather than allows true transcendence. much as i might like for anyone in the game to comment on it in a substantive way, sometimes the ideas speak for themselves. god knows that letting atlus talk for long periods of time doesn't always lead anywhere you wanna go. \n\nlike i say, it's more smt v. i don't think this is going to change the minds of anyone who truly disliked v, but if you were on the fence, enough might be done to help you appreciate it. i'm glad that rather than attempting to fix a game i liked well enough already, it tries to drill into the stuff that already worked, and expand that. i'm particularly delighted that how utterly strange and dehumanising Tokyo is in this game has been retained. in contrast to the wastelands of da'at filled with vibrant and chatty demons, it's a diorama filled with faceless people with little regard for others, spouting slogans and weird propagandist statements. even if Mastema will forever remain my deeply problematic fave (not beating the allegations with that attack animation guys) the presence of god being so off-putting does better to sell the argument against Him than a thousand dickhead angels. when you're hanging with detective pixie and hell biker, listening to some of the greatest choons the medium has to offer blare over stark but striking places, it's enough to make you think that the end of the world won't be so bad.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Good. This game utilizes the Turn Icon mechanics for its combat akin to M:Re. a system which I think is far superior to the old One More/Pass system. It allows for a very flexible and thoughtful game play. Build diversity is enormous, though, as it has always been since time immemorial in SMTs, Crit build rules. It can be quite a grind when you try to build your team against superbosses unless you have the Mitama DLCs. I hate Atlus superbosses. The story is not very self-contained. You have to be a bit into mythological cosmologies and abstract philosophies to get into its story. It's more about the \"larger than life\" concepts rather than the lives of its characters. This is probably nothing strange to rpg fans but this game leans heavily into it. You can think of it like a pop culture reference cluster kinda story but with folklore and metaphysics reference instead. It can get a bit cold and bland at times, but overall I like it. Character designs are glorious. Revisions of some demon designs are excellent. New Odin looks so cool. Yes please to new Lilith. And can we get Nanoheeho on all SMT games?",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "going from 12 to 120FPS REALLY makes this game feel entirely different and ACTUALLY playable, unlike the switch port\r\nnow add vengeance.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Atlus keeps it classy with SMT V: Vengeance, just like most things it has put out previously. SMT series has always been about atmospheric journeys through cycles of apocalypse and recreation with a dark/grayish story involving interesting characters and this is exactly what you get here. \r\nAside from the rich and memorable narrative (specially in the Cannon of Vengeance), I'm grateful that the series still respects the players' intelligence and didn't sacrifice the strategic combat mechanics and intense gameplay in favor of accessibility; You're gonna fight some of the most terrifying battles the genre has to offer and you're gonna get your ass kicked, but I doubt any jrpg fan would change this experience for anything.\r\nSMT V's world is big and there are lots (and I mean LOTS) of things to do in every corner. Although large in number, the subquests are fun and diverse, each with their own unique storyline and most of the times unique boss and superbosses.\r\nVisually speaking, this is the best SMT's main line has ever looked. Everything is super stylish (I mean come on, It's Atlus!), the character design is eye candy and the atmospheric design of locations complements the themes of the story deliciously. \r\nThis game is a solid entry in one of the best and most complex JRPG series of all time, so if you're a fan of genre, its a must play. Even if you don't know anything about the series or the genre, it could be a great start, so just go for it.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This is the absolute pinnacle of peak. I adore this game and would replay it a million times. Along with Metaphor Refantazio Atlus have successfully made back to back generational bangers. I love this game <3",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Shin Megami Tensei V: Vengeance is a complicated game for me to review for several reasons. For one, I was one of the few people who had very few issues with the original game. I thought the story was perfectly fine for what it wanted to be, and the performance and visuals were above average for the Switch. Secondly, there's my strange relationship with Atlus games. While I enjoy most SMT games, I've grown a disdain for Atlus games and the fanbase they've garnered from other titles. And lastly, my interest in theology and respect for religion has gone up a lot since I first got into this series. I started SMT as an edgy agnostic teen: philosophically malleable and easily impressed. Whereas now I'm a lot more skeptical of the themes presented. Put simply, I wasn't sure if I would still enjoy this game. It seemed like I might have outgrown the series over time.\n\nWith that being said, I'm glad to tell you Vengeance is still a good game. It has excellent combat, amazing visuals, and stellar optimization on PC. With my mid-range PC able to play the game at 2K resolution with 144fps with very little stuttering, and in that regard it was such a drastic improvement from the original. Though I still think the Switch version has some merit, since RPGs lend themselves well to portability. And with the implementation of the improved press turn system from IV Apocalypse on top of 3d graphics, you get one of the most definitive turn based games available on modern game consoles. Not to mention the new(er) features like semi-open exploration or the stellar OST by Ryota Kozuka. The original game has never been better. It's stylish, challenging, innovative, and has loads of meaningful content. So yeah, it's good and you should play it if you're interested.\n\nWith that out of the way, we can get to some more nuanced thoughts. I feel very mixed on this game's new route the Canon of Vengeance. In SMT V: Vengeance you can either choose to play through the original game with very few changes (Canon of Creation), or a very different story with new characters. Because of that, it's difficult to criticize the new route at all. Seeing as it doesn't disrupt or replace the original experience. However, it was a factor in me buying the new edition so I think it's worth mentioning.\n\nOverall, Canon of Vengeance aims to tell a story with more personal stakes. It actively gives you a relationship with every major character involved, and fleshes out every faction. In the original game, most characters were not that close to you; you only got an impression of them from a distance. In Vengeance you spend a good amount of time with everyone throughout your whole journey. With the main two being Tao Isonokami and Yoko Hiromine: girl classmates of yours that have \"saint\" powers. This is a classic play on the law and chaos heroes from past titles. They'll actively comment on just about everything you do, and you can control them for a good amount of the game.\n\nKeeping with the theme of personal stakes, you're also actively focused on one main villain faction the whole time. With the main character having a grudge against the new demon group: the Qadistu. A group of female demons that want to create \"true freedom\" freeing people from hierarchy. This is in contrast to the original game where your attention was more focused on your own demons and rise to power.\n\nThere's some merit to the new story, as it creates a more clear narrative throughline and sense of immediate purpose. But for me, the excessive dialogue and all the times the game took control away from me in cutscenes felt antithetical to what made me love the series in the first place. SMT's main strengths for me are subtlety and player freedom. Both of which you can see clearly in the Canon of Creation route. Because of its on-the-nose story and long dialogue, Canon of Vengeance is constantly telling you how to feel. It's lengthier and more traditional. It's more complete in a technical sense, but it replaces your opportunity to fill in the gaps and view the story your own way.\n\nAnother issue with the new route is choices and their impact. Mainly just that there are less endings in the CoV route than the CoC route, and the endings you can get aren't particularly novel or exciting. The endings you can receive are a forced binary where you completely agree with one character or another. While I wasn't particularly fond of either. Canon of Vengeance reminded me of IV Apocalypse which had similar issues in terms of forced characters and lack of subtlety, but at least that game gave you a cathartic ending if you chose to reject everyone.\n\nAs a note on the religious aspect, I did find the weird interpretations of Biblical stories to be somewhat irritating. I understand that SMT takes a lot of inspiration from Gnosticism, but it does suck when other religions are portrayed with a more honest portrayal. Versus \"God turned ppl into salt! Daaaas bad\", completely lacking context etc.\n\nOverall, the story's not irredeemable, and it certainly has better themes and writing than most RPGs. It's just flawed.\n\nMy last issue with Canon of Vengeance is the new third Da'at area. There's a completely different open zone depending on your route. The one in Canon of Creation is basically a war zone between the forces of law and chaos. There's constant battles and epic bosses like Surt and Ishtar. Capped off with a dark dungeon at the end. It's tightly packed and a nice pace breaker from the other less intense areas.\n\nCanon of Vengeance for some reason replaces that area with Shinjuku. An overly open and mostly uneventful area, that resembles a worse version of the final area: Taito. It feels like a redundant drag. Granted there's still a new dungeon at the end, but considering the lack of dungeons in the base game, I feel both could have been included with the first or second Da'at area replaced instead. Or better yet, use the development time spent on the new area making more dungeons so that there's a more even spread throughout the whole game. Compared to what it could have been, Shinjuku is simply disappointing for me.\n\nThat's about it for my thoughts though. To recap, I found the new story and area disappointing, but I also think the base game was improved a lot. It's hard to say the new route hurts the game since it's simply a pack-in. So I won't let it impact my rating much. I still strongly believe SMT V is a great game and I'm glad it's on all platforms now. I just won't ever replay Canon of Vengeance.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "If you liked the combat and persona fusion system of any of the persona games, but didn't like dating teenagers, then this game is definitely the one you wanna get. (persona 3 still goated though)",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "[h1] Shin Megami Tensei V: Vengeance - A Diabolic Delight [/h1]\n\nShin Megami Tensei V: Vengeance is the definitive version of an already overlooked but fantastical JRPG that had flaws, but still hit like a truck in terms of gameplay depth, artistic beauty and overall experience: this release aim to achieve perfection and adds content both were was needed and in places that now feels even more rich and compelling to explore: expecially on the gameplay side.\n\n[b] Gameplay: A Strategic Masterpiece [/b]\n\nLike one would expect, this Atlus title too uses the Press Turn System, a renowed battle system that had room to grow in the various iterations of the franchise, it requires you to exploit enemy weaknesses and manage your turns with surgical precision.\nIn this specific iteration, the press turn system reach its peak with the added depth of Innate Skills, passive abilities that when used right will let you achieve the impossible. This added depth can scare newcomers but it's not really mandatory to explore this aspect of the battle system to beat the game, however the heart and soul of this game  (expecially when it comes to fight secret / super bosses ) lies in this aspect and in team building.\n\n•   [b] Demon Fusion: [/b] This is your primary tool. Fusing demons to create stronger allies and, crucially, inheriting specific skills is a deep, rewarding meta-game. Building the perfect demon to counter a specific boss or cover your party's elemental weaknesses is incredibly satisfying.\n•    [b] Skill Potentials: [/b] The enhanced Potentials system encourages deep specialization. Do you create a demon solely for critical hits, or one designed to debuff the entire enemy line? The freedom to craft your perfect team is immense.\n•    [b] Improved Experience: [/b] This release also adds QoLs improvements and features such as the ability to save whenever you want, or even a bigger and more navigable map with the Magatsu Rails connecting the whole place better and adding new zones with quests and other other types of content.\n•    [b] The New Canon: [/b] The addition of MANY new demons and the \"Canon of Vengeance\" story provides a new narrative with 2 added routes, that really digs deep into the characters and themes of this world, as well as fresh challenges.\n\nThis is a game that respects your intelligence and rewards meticulous planning.\nI can back this up with a specific example: there's a certain infamous bossfight in this game (and base V) that is expecially hard, requiring the player to commit to a 40 minutes-ish battle with a solid strategy and a good party of demons: I had a goal to beat this fight in the most efficient way possible to test how much does this game really lets you play with its system, and after days worth of preparation and strategic planning I managed to beat the fight in only 2 player turns.\n\n[b] Narrative & Artistry: The Two Paths [/b]\n\nWhile the core Law/Chaos conflict remains, the new \"Canon of Vengeance\" storyline is a darker, more direct and character-driven tale. It explores themes of revenge and justice with a nuance that improves even the original routes, offering a compelling reason for veterans to return.\n\nThe presentation is top-tier:\n•    [b] Art Direction: [/b] The desolate beauty of Da'at is breathtaking. The demon designs remain a highlight, masterfully blending grotesque and divine elements with original twists on classical mythology designs. Both the storic demons designed by Kazuma Kaneko and the new ones by Masayuki Doi are a feast to look at, with extremely satisfying battle/skill animations that really makes them alive.\n•   [b] Soundtrack: [/b] The score is a powerful mix of haunting ambient tracks and adrenaline-pumping battle themes that perfectly encapsulate the game's apocalyptic vibe, I'm an avid fan of IV and IV Apocalypse soundtrack, and to me Vengeance manages to reach that olympus.\n•   [b] Performance: [/b] The original game came out on the Nintendo Switch, so it's really no surprise that it runs like a charm both on Steam deck and on desktop PCs, the level of settings is acceptable, but the old cutscenes running at 720p are really meh, also some UI elements are quit low resolutions in some areas (nothing crazy but c'mon)\n•  [b] Completion: [/b] It's crazy work like one would expect with such a big JRPG, getting all the endings, unlocking and fusing all the demons and completing the hardest challenges is really no small feat, prepare yourself if you want to get all the achievements: it's not going to be easy or fast.\n\n[b] Final Thoughts [/b]\n\nShin Megami Tensei V: Vengeance is my new personal standard on JRPGs. It combines a deeply strategic and customizable combat system with a morally complex narrative and a stunning audio-visual presentation. It’s a challenging, thought-provoking, and ultimately triumphant experience that will stays in the heart of the ones who will give this gem a chance.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Vanilla Shin Megami Tensei V was already a great game. Not the best SMT, but a really fucking good one.\nVengeance is one of the best SMT games. It's up there competing with Strange Journey & Devil Survivor for my favorite Shin Megami Tensei. I've got another 475 hrs on the Switch lol.\n\nTangent: My dream for VI would be a dungeon crawler like SJ, press turn, & Tokyo cyberpunk setting like IV. But we know they ain't making a fucking dungeon crawler.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "[b]Shin Megami Tensei V Vengeance[/b] is the reimagine version of 2021 Shin Megami Tensei V. SMT itself has a long history of monster-collecting turn-based JRPG and SMT VV definitely delivered coming from a long standing franchise. With the second storyline/main route and many more QoL and features added, Vengeance is the definitive edition of an already very good game from ATLUS.\n\n[h1]Story[/h1]\n\tVengeance is a bit unique when it comes to its story, or rather.. stories. SMT V featured one main story, now dubbed “Canon of Creation”, and now Vengeance has added “Canon of Vengeance”. Both follow a protagonist and his group unknowingly transported to the other world called “Da’at”, which strangely seems to resemble Tokyo but in ruins and full of Demons. They got separated and in the moment of crisis for our protagonist the help came in the form of blue Demon “Aogami”. In the moment, the protagonist took Aogami helping hand and fuse together to become the being known as the “Nahobino”, the forbidden being outlawed by the Creator God. A simple accident seemed to quickly devolve into the battle for the throne of Creation and only the Nahobino can assume the role.\nNow that is the outline of the story in both routes. But do not assume that both of them are just a simple rewrite of each other. It’s more of an expansion to the idea of the previous Canon of Creation route and SMT Universe as a whole. The Canon of Creation route is not strong, to put it lightly. The pacing towards the end was rushed and there's quite a number of convenient plot points and unexplained story beats. Canon of Vengeance does fix and expand stuff that has previously been established in the old route, but itself also features the same problem albeit not as severe.  \n\n[h1]Gameplay Mechanics[/h1]\n\tSMT V is unique when it comes to normal gameplay compared to previous installments. Instead of the main area of the game being dungeons, this being a full open-world that we can explore freely and divided into large maps depending on how much you have progressed in the story. Both Canon routes featured their own unique area and one dungeon also. When it comes to open-world games, I’d say SMT V does a good enough job to not be a slog fest and not cluttered like in modern open-world games. There are 2 main areas which players can interact with; Tokyo map and Da’at. Tokyo is a place for human interactions and some quests while Da’at is the main area in which the story will progress. The open-world map, to me, is not boring like some other games out there. And while it’s not mandatory to do so, exploration will yield you some interesting side contents all throughout the game. \n\n[h1]Combat Mechanics[/h1]\n\tCombat in the SMT franchise is always the main focus for me, apart from the interesting thematic setting. As usual, SMT uses the Press-Turn System featured in all SMT from Nocturne onward. The number of turns you have depends on your actions, gain or lose your turns as you battle Demons, and same goes to your enemies as well. SMT V’s iteration is generally the same as previous installments with some improvement to make combat more engaging and challenging in some aspects also. Like Pokemon, your party members are Demons that you can either persuade to join you, or sacrifice your Demons to make a new one. You can build your team however you want without limit to breeze your way through every boss and super-boss (and trust me you’ll need a good team for that).\n\tOne thing is that SMT do have a reputation for being hard. Some even dubbed “Dark Souls of turn-based RPG”. But I do think SMT is not the same “hard” as people may think. Like previously mentioned, if you build you party and strategize well, you can fight the any boss back to back pretty well, even if you are under-level (virtual battle PTSD) \n\n[h1]Sounds and Music[/h1]\n\tOf course if some of you read my previous review on ATLUS games, I LOVED their soundtracks, more so for SMT. This time the main composer is Ryota Kozuka, previously on SMTIV, SMTIV:A as main composer, and various ATLUS games including Persona 4, Persona 5/Royal, Persona 3 Reload as supporting composer. And as much as I love Shoji Meguro as an ATLUS composer, the more I listen to Kozuka’s work the more I love his music. His experimental style is really unique among game OSTs. Even though his style is not for everyone, you need to acknowledge his music is innovative and fresh among the soundscape of same-same music these days. Some notable tracks, for me,  in Vengeance in particular are Battle -Qadistu-, Da’at -Kabukicho, Battle -“Vengeance” for reclamation, Battle -Dagda-.\n\tSounds overall fit the game and the effects are satisfying to say the least. The ambience fit perfectly combining with the soundtracks.\n\nOverall, Shin Megami Tensei V Vengeance, even though released in the same year as other great ATLUS games; Persona 3 Reload and Metaphor: Refantazio, remain my most favourite of that year. This game is such a unique experience it’s hard to make a comparison to. Clear and distinctive style of SMT will still remain my favourite despite the flaw of the story being not as strong as it should be. That title went to SMTIV in my opinion. But this game delivers on gameplay being really engaging and most fun in the series. Plus with the atmosphere and soundtrack, I can be really immersed in the experience that is Shin Megami Tensei V Vengeance.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "If you're into demon hunting, fusing monsters, and experimenting with builds, SMT V core mechanics is very good. The combat is challenging and fun especially if you're into JRPG turn base game.\n\nThe story in  might not grab you right away, but it really picks up your interest later on, with the mid to late game offering some cool twists and engaging moments.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "best rpg combat mid story and characters",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Nahobeeho\nSolid gameplay and Soundtrack, still haven't finished all content in the game but i do want to in a near future.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I wish I had something creative to say, but nah: I'll just admit I named my MC with the nickname we had with my ex. Oh, and also that this is exactly what you expect out of a turn-based open-world RPG, it has to be one of the finest examples of the genre. No stupid souls-like mechanics, no ridiculous microtransactions, just a quality game designed to challenge you without being irritating and is easy to play but hard to master. Story is a bit ´meh´ at first, but it more than compensates with ridiculously entertaining gameplay.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Obrigado Atlus por mandar um \"Eu ainda lembro de vocês\" para todos os fãs de SMT e esquecer Persona por um tempo, esse jogo é realmente mt bom",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Peak concept, you are twink that turns into femboy and gets godlike powers.\nFair warning, this game is like Dark Souls but turn-based.\nGraphic design also slap big time.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "The best SMT with an incredible combat system and exploration. Some might criticize it for having a weak story, but this series has always been gameplay-focused, and in that regard it’s absolutely unmatched.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "One of the most polished turn-based RPG's out there. The Vengeance version added so much additional content. Creating the perfect team of demons is so satisfying and the open zones offer plenty of meaningful exploration. Played this originally on the switch and more than happy to replay it here again. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "About 30 hours in and this is probably the best JRPG I have played. I already know I'm going to replay this multiple times on NG+. The story is reactive with very little metagaming shenanigans, incredible atmosphere, and super super cool character design. I am struck with how easily I have gotten immersed with this game. Something I don't hear much about this game is that all of the demons are based off of mythology across the globe, there's a lot of cool lore and fun spins on preexisting creatures and cryptids. Actually, the only real shenanigans you get up to is in the insane bullshit you can pull in combat with the combos in your team. Very very fun.\n\nPlaying on normal difficulty, I have found it somewhat easy to fly through the main campaign. There are challenging fights for sure, but they are landmark fights more than anything. That being said, the real fun challenge has been running around doing the rest of what the game has to offer. With the help of the overall great immersion, the side quests in this game have been so creative and inventive. Weird comparison maybe, but they remind me a lot of Breath of the Wild / Tears of the Kingdom side quests. There is a wealth of content even after you clear a full map as well, going back and forth to challenge mini bosses I previously had to avoid has been very fun.\n\nEven out of the game I have found myself on multiple occasions putting teams and combos together in my head that I can work out next time I get on. Not only that, but a lot of the dialogue and story options have given me a lot to think about even after I've turned the game off. I've heard a lot of the good new stuff comes along with Vengeance, which is the run I am going through, but regardless I have been very impressed.\n\nIf you're a JRPG fan, I think this is a must play. If you are just an RPG fan, or looking for something new, maybe wait for a sale, but I still think it's heavily worth your time.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I had gotten this on my OLED switch that I've had for about 2 years now. The original game was a little draggy and with other titles sitting around/coming out, I just never got to progressing more in this game than I wanted to because I was distracted by others. Fast forward to today in present time October 2025, I pick up Vengeance on sale for like $20? (absolute steal btw) because I hear they expanded upon the story way better/added so many more things including quality of life updates and I can sit here and tell you that its already playing way better than my original run. Even beyond the $20 sale price, this game goes beyond its value. As someone who has given nearly every atlus game a shot even if it was a drag/copy paste reskin of previous titles *cough* metaphor *cough* tokyo mirage sessions* . This one truly stands out and is still a great play years after its original release. If you want to enjoy any atlus release, let this be the one and if you enjoy it, do yourself a favor and pick up persona 3 reload after you finish",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I mulled over even trying this game because the art style is just not something i've ever been interested in but it came up for sale on switch so I got it. I can say that the first few minutes almost had me shutting it off but I stuck it out and got where you end up going. Needless to say this is quite possibly one of the best turn based games i've ever played. Add to that the pokemon aspect and this game is a banger. I liked it so much that I bought it on PC and started over just to see it as it should be seen. Just great stuff here.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you loved the Persona series for its gameplay i.e. the press turn system ( gaining extra turns from hitting weaknesses ) then get this game. Gameplay wise, this is superior. Its basically Pokemon but better.\r\nBut if you're expecting a great story, then SMT 5 falls short. Its not bad but not great compared to Persona 3 and 5.\r\nBut the lack of a amazing story isn't a dealbreaker because the gameplay is addictive, the strategies are endless, the difficulty is hard but exciting and the open world is interesting enough to explore.\r\nThe game has enough content. Go for it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First SMT game.\n\nCrazy good turn-based JRPG and monster collector.\n\nSoundtrack is great. Combat music is top notch. Overworld music is hit-or-miss (the fairy village music is rough).\n\nCanon of Creation (the vanilla storyline) is fairly weak. But this version of SMT V is praised because of the new Vengeance storyline. However, I recommend playing through Canon of Creation before playing through Vengeance. It's still enjoyable and helps fill in important context you'd miss playing Vengeance from the get-go.\n\nGameplay-wise, SMT V is all about strategy. It's not difficult strategy and there are fun team compositions you can make that are just kind of busted over time, but you'll have to learn how optimize your turn rotations and party pairings. You might have a team dedicated just to boss fights whereas another team may just be for farming. \n\nHowever, unlike other creature collectors, SMT loves to limit your pool of available characters, otherwise known as demons. This isn't necessarily a bad thing as the game encourages you to burn upwards when fusing powerful demons since lower level demons do not scale well over time due to high EXP demands. As a result, you can expect to keep one or two demons around throughout the game, but otherwise don't expect to become attached to specific demons and party setups for the whole game.\n\nThankfully, the cast of demons are well written. Most demons have some form of unique dialogue mixed in with a pool of generic dialogue specific to their race. This dialogue can provide insight to unique demon interactions when negotiating/recruiting, general history lessons, game lore, and gameplay hints. You'll find, despite inevitably become fusion fodder, bonding with most demons is beneficial since it also comes with stat buffs and new skills.\n\nYou can easily spend hours just fusing demons. In fact, the vanilla gameplay can become far easier by really leaning into trying out different fusions. If you run into a difficult boss, there is a chance you just fuse demons upwards and quickly overpower the boss on a rematch. There are also hidden quests that can only be found by fusing specific demons that cannot be found in the overworld.\n\nOverall, this game is well worth the price tag and I encourage anyone who has been on the fence with Nocturne to try this game out first. It's a great introduction to SMT that provides challenging turn-based gameplay, engaging creature collecting, and some of the best combat music around.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the most fun JRPGs i have played. Not a massive fun of the genre but the idea and character designs made it very enjoyable for me.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I originally played the first version of this game on the switch and loved it as this was my first Shin Megami Tensei game. The soundtrack and gameplay of this game is pretty good! I ended up playing the new path for this game with the different ending and I have to say it might be better than the original. My jaw was dropping multiple times throughout the game even though I knew one of the endings it still surprised me. I might be playing this again in a year or so because of those different endings! Overall I'd give this game a 9/10 One of my all time favorites for sure!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "JRPG's are all about evil fog and killing god, in Shin Megami Tensei, that's the entire game.\r\nIt really is the most jrpg jrpg to have ever jrpg'd. Great game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Addictive gameplay loop. Well designed levels. Fantastic music. Great character design and art direction. Story is a bit slow paced, but what's there is great. I can't put it down.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I know this is my personal opinion since most of the people are ecstatic about this game (95% positives), even though many mentioned that the plot is a LITTLE weak. When i started the game i felt it was okay, but at the mark of 3 hours exactly i understood i can't bear it anymore, the plot is NOT a LITTLE weak, it's DOGSHIT. \nNothing happens for hours, you are forced to farm same mobs forever to attain lvl's for getting better ones to progress, barely any dialogues are recorded and you are just reading text, while the same phrases like \"YOUNG MAN\" get itched onto your brain. People mentioned good OST. Oh REALLY? The same track plays in literally every battle you start. And oh i mean it. Every. One.\nI read that this game lacks the link system like in persona games and thought that it might be interesting to not spend as much time talking, heh, but i was so wrong. The lack of relevant dialogues with companions only enforces this feeling of never ending grind. Changing the team doesn't change the feeling of being in the same fight for hours on end - same strategies (only differently packaged), same annoying OST and same YOUNG MAN phrase every 2nd minute.\nI forced myself to play for 3 more hours to see if maybe it gets better. No, it did not. I really wish i could refund this, but i can't. \nSo i'm warning some guy stumbling on my review (which is unlikely to happen) to steer away. If you are a fan of Persona games - stick to them. SMT5V is a downgrade in all the possible ways from them. Perhaps i somehow misunderstood the game or was too rash in my judgement, but for me these 6 hours were nothing but one big annoyance (and i say it as Persona 3 and 5 fan).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has no challenge because you can save at almost any time before every battle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you expect Persona, this one is not for you and me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really great dungeon crawler that unfortunately devolves into a morass of uninteresting exposition and cutscenes. Even the dungeon crawling eventually turns into FFXIII corridor simulator... sad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As a newcomer to SMT, I had a good time messing around, learning the system and exploring the demon designs, until the novelty wore off and I realised that A) there's so much QoL polish that the actual stakes of random encounters are about zero, and B) the base game has nothing for a plot.  There's a big hole where all the writing should be.  I see other reviewers saying that the new route has a better story; if you're planning on picking up this game, you're not missing anything by ignoring the original route.  If you're still worried, skip the tedium take 30 seconds of your life to read a plot synopsis.\n\nThe side quests have a bit more charm to them, but that's not saying much.  Most of the styling starts and ends at \"what if this mythic figure was foul-mouthed and menial\".  I hope you weren't expecting lore, either.\n\nDespite the series reputation, this game is honestly pretty easy; playing on Normal, I've not had to worry about resource management or grinding since hour 1, and even superbuffed Ishtar only required fusing a couple of demons to crumple her like a paper cup.  You can't increase the difficulty after starting so you might want to start on Hard to see how it goes.\n\nThere are some genuinely charming demon designs here, but also a surprising number of scantily-clad women who think you're hot shit and need your approval.  It's clear that part of their QoL was aimed at making the demons into proper co-travellers with personalities you'd care about, but the combination of poor scaling + limited part space + one-demon-per-species limit + fusion system hobbles them in that regard.  You'll have to melt down your darlings to free up space, and churn through demons if you have any interest in exploring the fusion roster once it starts to bloat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mediocre. The gameplay is engaging enough for a RPG, but the characters and storyline are painfully lacking, even in the remake's improved story. Good for wasting time grinding, but thoroughly forgettable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story - What would you do if you ended up being god.\r\nPagan gods are sick and tired of being beneath the Christian stories. Slow story and very lackluster... A basic what if twist on the Christianity stories. And the game says its purely fiction :'D\r\nCombat - Decent not great.\r\nGood enemy amount - Better ally amount. \r\nTedious - Extremely tedious levelling and swapping out to new allies - Glory system made that extra tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know this is my personal opinion since most of the people are ecstatic about this game (95% positives), even though many mentioned that the plot is a LITTLE weak. When i started the game i felt it was okay, but at the mark of 3 hours exactly i understood i can't bear it anymore, the plot is NOT a LITTLE weak, it's DOGSHIT. \nNothing happens for hours, you are forced to farm same mobs forever to attain lvl's for getting better ones to progress, barely any dialogues are recorded and you are just reading text, while the same phrases like \"YOUNG MAN\" get itched onto your brain. People mentioned good OST. Oh REALLY? The same track plays in literally every battle you start. And oh i mean it. Every. One.\nI read that this game lacks the link system like in persona games and thought that it might be interesting to not spend as much time talking, heh, but i was so wrong. The lack of relevant dialogues with companions only enforces this feeling of never ending grind. Changing the team doesn't change the feeling of being in the same fight for hours on end - same strategies (only differently packaged), same annoying OST and same YOUNG MAN phrase every 2nd minute.\nI forced myself to play for 3 more hours to see if maybe it gets better. No, it did not. I really wish i could refund this, but i can't. \nSo i'm warning some guy stumbling on my review (which is unlikely to happen) to steer away. If you are a fan of Persona games - stick to them. SMT5V is a downgrade in all the possible ways from them. Perhaps i somehow misunderstood the game or was too rash in my judgement, but for me these 6 hours were nothing but one big annoyance (and i say it as Persona 3 and 5 fan).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has no challenge because you can save at almost any time before every battle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you expect Persona, this one is not for you and me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really great dungeon crawler that unfortunately devolves into a morass of uninteresting exposition and cutscenes. Even the dungeon crawling eventually turns into FFXIII corridor simulator... sad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A addicting, super fun game. Until it just doesn't store any of your saves for the last 12 hrs of gameplay and completely stops your playthrough making you never play it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a newcomer to SMT, I had a good time messing around, learning the system and exploring the demon designs, until the novelty wore off and I realised that A) there's so much QoL polish that the actual stakes of random encounters are about zero, and B) the base game has nothing for a plot.  There's a big hole where all the writing should be.  I see other reviewers saying that the new route has a better story; if you're planning on picking up this game, you're not missing anything by ignoring the original route.  If you're still worried, skip the tedium take 30 seconds of your life to read a plot synopsis.\n\nThe side quests have a bit more charm to them, but that's not saying much.  Most of the styling starts and ends at \"what if this mythic figure was foul-mouthed and menial\".  I hope you weren't expecting lore, either.\n\nDespite the series reputation, this game is honestly pretty easy; playing on Normal, I've not had to worry about resource management or grinding since hour 1, and even superbuffed Ishtar only required fusing a couple of demons to crumple her like a paper cup.  You can't increase the difficulty after starting so you might want to start on Hard to see how it goes.\n\nThere are some genuinely charming demon designs here, but also a surprising number of scantily-clad women who think you're hot shit and need your approval.  It's clear that part of their QoL was aimed at making the demons into proper co-travellers with personalities you'd care about, but the combination of poor scaling + limited part space + one-demon-per-species limit + fusion system hobbles them in that regard.  You'll have to melt down your darlings to free up space, and churn through demons if you have any interest in exploring the fusion roster once it starts to bloat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mediocre. The gameplay is engaging enough for a RPG, but the characters and storyline are painfully lacking, even in the remake's improved story. Good for wasting time grinding, but thoroughly forgettable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story - What would you do if you ended up being god.\r\nPagan gods are sick and tired of being beneath the Christian stories. Slow story and very lackluster... A basic what if twist on the Christianity stories. And the game says its purely fiction :'D\r\nCombat - Decent not great.\r\nGood enemy amount - Better ally amount. \r\nTedious - Extremely tedious levelling and swapping out to new allies - Glory system made that extra tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know this is my personal opinion since most of the people are ecstatic about this game (95% positives), even though many mentioned that the plot is a LITTLE weak. When i started the game i felt it was okay, but at the mark of 3 hours exactly i understood i can't bear it anymore, the plot is NOT a LITTLE weak, it's DOGSHIT. \nNothing happens for hours, you are forced to farm same mobs forever to attain lvl's for getting better ones to progress, barely any dialogues are recorded and you are just reading text, while the same phrases like \"YOUNG MAN\" get itched onto your brain. People mentioned good OST. Oh REALLY? The same track plays in literally every battle you start. And oh i mean it. Every. One.\nI read that this game lacks the link system like in persona games and thought that it might be interesting to not spend as much time talking, heh, but i was so wrong. The lack of relevant dialogues with companions only enforces this feeling of never ending grind. Changing the team doesn't change the feeling of being in the same fight for hours on end - same strategies (only differently packaged), same annoying OST and same YOUNG MAN phrase every 2nd minute.\nI forced myself to play for 3 more hours to see if maybe it gets better. No, it did not. I really wish i could refund this, but i can't. \nSo i'm warning some guy stumbling on my review (which is unlikely to happen) to steer away. If you are a fan of Persona games - stick to them. SMT5V is a downgrade in all the possible ways from them. Perhaps i somehow misunderstood the game or was too rash in my judgement, but for me these 6 hours were nothing but one big annoyance (and i say it as Persona 3 and 5 fan).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has no challenge because you can save at almost any time before every battle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you expect Persona, this one is not for you and me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really great dungeon crawler that unfortunately devolves into a morass of uninteresting exposition and cutscenes. Even the dungeon crawling eventually turns into FFXIII corridor simulator... sad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A addicting, super fun game. Until it just doesn't store any of your saves for the last 12 hrs of gameplay and completely stops your playthrough making you never play it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a newcomer to SMT, I had a good time messing around, learning the system and exploring the demon designs, until the novelty wore off and I realised that A) there's so much QoL polish that the actual stakes of random encounters are about zero, and B) the base game has nothing for a plot.  There's a big hole where all the writing should be.  I see other reviewers saying that the new route has a better story; if you're planning on picking up this game, you're not missing anything by ignoring the original route.  If you're still worried, skip the tedium take 30 seconds of your life to read a plot synopsis.\n\nThe side quests have a bit more charm to them, but that's not saying much.  Most of the styling starts and ends at \"what if this mythic figure was foul-mouthed and menial\".  I hope you weren't expecting lore, either.\n\nDespite the series reputation, this game is honestly pretty easy; playing on Normal, I've not had to worry about resource management or grinding since hour 1, and even superbuffed Ishtar only required fusing a couple of demons to crumple her like a paper cup.  You can't increase the difficulty after starting so you might want to start on Hard to see how it goes.\n\nThere are some genuinely charming demon designs here, but also a surprising number of scantily-clad women who think you're hot shit and need your approval.  It's clear that part of their QoL was aimed at making the demons into proper co-travellers with personalities you'd care about, but the combination of poor scaling + limited part space + one-demon-per-species limit + fusion system hobbles them in that regard.  You'll have to melt down your darlings to free up space, and churn through demons if you have any interest in exploring the fusion roster once it starts to bloat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mediocre. The gameplay is engaging enough for a RPG, but the characters and storyline are painfully lacking, even in the remake's improved story. Good for wasting time grinding, but thoroughly forgettable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story - What would you do if you ended up being god.\r\nPagan gods are sick and tired of being beneath the Christian stories. Slow story and very lackluster... A basic what if twist on the Christianity stories. And the game says its purely fiction :'D\r\nCombat - Decent not great.\r\nGood enemy amount - Better ally amount. \r\nTedious - Extremely tedious levelling and swapping out to new allies - Glory system made that extra tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know this is my personal opinion since most of the people are ecstatic about this game (95% positives), even though many mentioned that the plot is a LITTLE weak. When i started the game i felt it was okay, but at the mark of 3 hours exactly i understood i can't bear it anymore, the plot is NOT a LITTLE weak, it's DOGSHIT. \nNothing happens for hours, you are forced to farm same mobs forever to attain lvl's for getting better ones to progress, barely any dialogues are recorded and you are just reading text, while the same phrases like \"YOUNG MAN\" get itched onto your brain. People mentioned good OST. Oh REALLY? The same track plays in literally every battle you start. And oh i mean it. Every. One.\nI read that this game lacks the link system like in persona games and thought that it might be interesting to not spend as much time talking, heh, but i was so wrong. The lack of relevant dialogues with companions only enforces this feeling of never ending grind. Changing the team doesn't change the feeling of being in the same fight for hours on end - same strategies (only differently packaged), same annoying OST and same YOUNG MAN phrase every 2nd minute.\nI forced myself to play for 3 more hours to see if maybe it gets better. No, it did not. I really wish i could refund this, but i can't. \nSo i'm warning some guy stumbling on my review (which is unlikely to happen) to steer away. If you are a fan of Persona games - stick to them. SMT5V is a downgrade in all the possible ways from them. Perhaps i somehow misunderstood the game or was too rash in my judgement, but for me these 6 hours were nothing but one big annoyance (and i say it as Persona 3 and 5 fan).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has no challenge because you can save at almost any time before every battle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you expect Persona, this one is not for you and me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really great dungeon crawler that unfortunately devolves into a morass of uninteresting exposition and cutscenes. Even the dungeon crawling eventually turns into FFXIII corridor simulator... sad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A addicting, super fun game. Until it just doesn't store any of your saves for the last 12 hrs of gameplay and completely stops your playthrough making you never play it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a newcomer to SMT, I had a good time messing around, learning the system and exploring the demon designs, until the novelty wore off and I realised that A) there's so much QoL polish that the actual stakes of random encounters are about zero, and B) the base game has nothing for a plot.  There's a big hole where all the writing should be.  I see other reviewers saying that the new route has a better story; if you're planning on picking up this game, you're not missing anything by ignoring the original route.  If you're still worried, skip the tedium take 30 seconds of your life to read a plot synopsis.\n\nThe side quests have a bit more charm to them, but that's not saying much.  Most of the styling starts and ends at \"what if this mythic figure was foul-mouthed and menial\".  I hope you weren't expecting lore, either.\n\nDespite the series reputation, this game is honestly pretty easy; playing on Normal, I've not had to worry about resource management or grinding since hour 1, and even superbuffed Ishtar only required fusing a couple of demons to crumple her like a paper cup.  You can't increase the difficulty after starting so you might want to start on Hard to see how it goes.\n\nThere are some genuinely charming demon designs here, but also a surprising number of scantily-clad women who think you're hot shit and need your approval.  It's clear that part of their QoL was aimed at making the demons into proper co-travellers with personalities you'd care about, but the combination of poor scaling + limited part space + one-demon-per-species limit + fusion system hobbles them in that regard.  You'll have to melt down your darlings to free up space, and churn through demons if you have any interest in exploring the fusion roster once it starts to bloat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mediocre. The gameplay is engaging enough for a RPG, but the characters and storyline are painfully lacking, even in the remake's improved story. Good for wasting time grinding, but thoroughly forgettable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story - What would you do if you ended up being god.\r\nPagan gods are sick and tired of being beneath the Christian stories. Slow story and very lackluster... A basic what if twist on the Christianity stories. And the game says its purely fiction :'D\r\nCombat - Decent not great.\r\nGood enemy amount - Better ally amount. \r\nTedious - Extremely tedious levelling and swapping out to new allies - Glory system made that extra tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know this is my personal opinion since most of the people are ecstatic about this game (95% positives), even though many mentioned that the plot is a LITTLE weak. When i started the game i felt it was okay, but at the mark of 3 hours exactly i understood i can't bear it anymore, the plot is NOT a LITTLE weak, it's DOGSHIT. \nNothing happens for hours, you are forced to farm same mobs forever to attain lvl's for getting better ones to progress, barely any dialogues are recorded and you are just reading text, while the same phrases like \"YOUNG MAN\" get itched onto your brain. People mentioned good OST. Oh REALLY? The same track plays in literally every battle you start. And oh i mean it. Every. One.\nI read that this game lacks the link system like in persona games and thought that it might be interesting to not spend as much time talking, heh, but i was so wrong. The lack of relevant dialogues with companions only enforces this feeling of never ending grind. Changing the team doesn't change the feeling of being in the same fight for hours on end - same strategies (only differently packaged), same annoying OST and same YOUNG MAN phrase every 2nd minute.\nI forced myself to play for 3 more hours to see if maybe it gets better. No, it did not. I really wish i could refund this, but i can't. \nSo i'm warning some guy stumbling on my review (which is unlikely to happen) to steer away. If you are a fan of Persona games - stick to them. SMT5V is a downgrade in all the possible ways from them. Perhaps i somehow misunderstood the game or was too rash in my judgement, but for me these 6 hours were nothing but one big annoyance (and i say it as Persona 3 and 5 fan).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has no challenge because you can save at almost any time before every battle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you expect Persona, this one is not for you and me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really great dungeon crawler that unfortunately devolves into a morass of uninteresting exposition and cutscenes. Even the dungeon crawling eventually turns into FFXIII corridor simulator... sad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A addicting, super fun game. Until it just doesn't store any of your saves for the last 12 hrs of gameplay and completely stops your playthrough making you never play it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a newcomer to SMT, I had a good time messing around, learning the system and exploring the demon designs, until the novelty wore off and I realised that A) there's so much QoL polish that the actual stakes of random encounters are about zero, and B) the base game has nothing for a plot.  There's a big hole where all the writing should be.  I see other reviewers saying that the new route has a better story; if you're planning on picking up this game, you're not missing anything by ignoring the original route.  If you're still worried, skip the tedium take 30 seconds of your life to read a plot synopsis.\n\nThe side quests have a bit more charm to them, but that's not saying much.  Most of the styling starts and ends at \"what if this mythic figure was foul-mouthed and menial\".  I hope you weren't expecting lore, either.\n\nDespite the series reputation, this game is honestly pretty easy; playing on Normal, I've not had to worry about resource management or grinding since hour 1, and even superbuffed Ishtar only required fusing a couple of demons to crumple her like a paper cup.  You can't increase the difficulty after starting so you might want to start on Hard to see how it goes.\n\nThere are some genuinely charming demon designs here, but also a surprising number of scantily-clad women who think you're hot shit and need your approval.  It's clear that part of their QoL was aimed at making the demons into proper co-travellers with personalities you'd care about, but the combination of poor scaling + limited part space + one-demon-per-species limit + fusion system hobbles them in that regard.  You'll have to melt down your darlings to free up space, and churn through demons if you have any interest in exploring the fusion roster once it starts to bloat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mediocre. The gameplay is engaging enough for a RPG, but the characters and storyline are painfully lacking, even in the remake's improved story. Good for wasting time grinding, but thoroughly forgettable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story - What would you do if you ended up being god.\r\nPagan gods are sick and tired of being beneath the Christian stories. Slow story and very lackluster... A basic what if twist on the Christianity stories. And the game says its purely fiction :'D\r\nCombat - Decent not great.\r\nGood enemy amount - Better ally amount. \r\nTedious - Extremely tedious levelling and swapping out to new allies - Glory system made that extra tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know this is my personal opinion since most of the people are ecstatic about this game (95% positives), even though many mentioned that the plot is a LITTLE weak. When i started the game i felt it was okay, but at the mark of 3 hours exactly i understood i can't bear it anymore, the plot is NOT a LITTLE weak, it's DOGSHIT. \nNothing happens for hours, you are forced to farm same mobs forever to attain lvl's for getting better ones to progress, barely any dialogues are recorded and you are just reading text, while the same phrases like \"YOUNG MAN\" get itched onto your brain. People mentioned good OST. Oh REALLY? The same track plays in literally every battle you start. And oh i mean it. Every. One.\nI read that this game lacks the link system like in persona games and thought that it might be interesting to not spend as much time talking, heh, but i was so wrong. The lack of relevant dialogues with companions only enforces this feeling of never ending grind. Changing the team doesn't change the feeling of being in the same fight for hours on end - same strategies (only differently packaged), same annoying OST and same YOUNG MAN phrase every 2nd minute.\nI forced myself to play for 3 more hours to see if maybe it gets better. No, it did not. I really wish i could refund this, but i can't. \nSo i'm warning some guy stumbling on my review (which is unlikely to happen) to steer away. If you are a fan of Persona games - stick to them. SMT5V is a downgrade in all the possible ways from them. Perhaps i somehow misunderstood the game or was too rash in my judgement, but for me these 6 hours were nothing but one big annoyance (and i say it as Persona 3 and 5 fan).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has no challenge because you can save at almost any time before every battle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you expect Persona, this one is not for you and me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really great dungeon crawler that unfortunately devolves into a morass of uninteresting exposition and cutscenes. Even the dungeon crawling eventually turns into FFXIII corridor simulator... sad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A addicting, super fun game. Until it just doesn't store any of your saves for the last 12 hrs of gameplay and completely stops your playthrough making you never play it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a newcomer to SMT, I had a good time messing around, learning the system and exploring the demon designs, until the novelty wore off and I realised that A) there's so much QoL polish that the actual stakes of random encounters are about zero, and B) the base game has nothing for a plot.  There's a big hole where all the writing should be.  I see other reviewers saying that the new route has a better story; if you're planning on picking up this game, you're not missing anything by ignoring the original route.  If you're still worried, skip the tedium take 30 seconds of your life to read a plot synopsis.\n\nThe side quests have a bit more charm to them, but that's not saying much.  Most of the styling starts and ends at \"what if this mythic figure was foul-mouthed and menial\".  I hope you weren't expecting lore, either.\n\nDespite the series reputation, this game is honestly pretty easy; playing on Normal, I've not had to worry about resource management or grinding since hour 1, and even superbuffed Ishtar only required fusing a couple of demons to crumple her like a paper cup.  You can't increase the difficulty after starting so you might want to start on Hard to see how it goes.\n\nThere are some genuinely charming demon designs here, but also a surprising number of scantily-clad women who think you're hot shit and need your approval.  It's clear that part of their QoL was aimed at making the demons into proper co-travellers with personalities you'd care about, but the combination of poor scaling + limited part space + one-demon-per-species limit + fusion system hobbles them in that regard.  You'll have to melt down your darlings to free up space, and churn through demons if you have any interest in exploring the fusion roster once it starts to bloat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mediocre. The gameplay is engaging enough for a RPG, but the characters and storyline are painfully lacking, even in the remake's improved story. Good for wasting time grinding, but thoroughly forgettable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story - What would you do if you ended up being god.\r\nPagan gods are sick and tired of being beneath the Christian stories. Slow story and very lackluster... A basic what if twist on the Christianity stories. And the game says its purely fiction :'D\r\nCombat - Decent not great.\r\nGood enemy amount - Better ally amount. \r\nTedious - Extremely tedious levelling and swapping out to new allies - Glory system made that extra tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know this is my personal opinion since most of the people are ecstatic about this game (95% positives), even though many mentioned that the plot is a LITTLE weak. When i started the game i felt it was okay, but at the mark of 3 hours exactly i understood i can't bear it anymore, the plot is NOT a LITTLE weak, it's DOGSHIT. \nNothing happens for hours, you are forced to farm same mobs forever to attain lvl's for getting better ones to progress, barely any dialogues are recorded and you are just reading text, while the same phrases like \"YOUNG MAN\" get itched onto your brain. People mentioned good OST. Oh REALLY? The same track plays in literally every battle you start. And oh i mean it. Every. One.\nI read that this game lacks the link system like in persona games and thought that it might be interesting to not spend as much time talking, heh, but i was so wrong. The lack of relevant dialogues with companions only enforces this feeling of never ending grind. Changing the team doesn't change the feeling of being in the same fight for hours on end - same strategies (only differently packaged), same annoying OST and same YOUNG MAN phrase every 2nd minute.\nI forced myself to play for 3 more hours to see if maybe it gets better. No, it did not. I really wish i could refund this, but i can't. \nSo i'm warning some guy stumbling on my review (which is unlikely to happen) to steer away. If you are a fan of Persona games - stick to them. SMT5V is a downgrade in all the possible ways from them. Perhaps i somehow misunderstood the game or was too rash in my judgement, but for me these 6 hours were nothing but one big annoyance (and i say it as Persona 3 and 5 fan).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has no challenge because you can save at almost any time before every battle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you expect Persona, this one is not for you and me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really great dungeon crawler that unfortunately devolves into a morass of uninteresting exposition and cutscenes. Even the dungeon crawling eventually turns into FFXIII corridor simulator... sad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A addicting, super fun game. Until it just doesn't store any of your saves for the last 12 hrs of gameplay and completely stops your playthrough making you never play it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a newcomer to SMT, I had a good time messing around, learning the system and exploring the demon designs, until the novelty wore off and I realised that A) there's so much QoL polish that the actual stakes of random encounters are about zero, and B) the base game has nothing for a plot.  There's a big hole where all the writing should be.  I see other reviewers saying that the new route has a better story; if you're planning on picking up this game, you're not missing anything by ignoring the original route.  If you're still worried, skip the tedium take 30 seconds of your life to read a plot synopsis.\n\nThe side quests have a bit more charm to them, but that's not saying much.  Most of the styling starts and ends at \"what if this mythic figure was foul-mouthed and menial\".  I hope you weren't expecting lore, either.\n\nDespite the series reputation, this game is honestly pretty easy; playing on Normal, I've not had to worry about resource management or grinding since hour 1, and even superbuffed Ishtar only required fusing a couple of demons to crumple her like a paper cup.  You can't increase the difficulty after starting so you might want to start on Hard to see how it goes.\n\nThere are some genuinely charming demon designs here, but also a surprising number of scantily-clad women who think you're hot shit and need your approval.  It's clear that part of their QoL was aimed at making the demons into proper co-travellers with personalities you'd care about, but the combination of poor scaling + limited part space + one-demon-per-species limit + fusion system hobbles them in that regard.  You'll have to melt down your darlings to free up space, and churn through demons if you have any interest in exploring the fusion roster once it starts to bloat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mediocre. The gameplay is engaging enough for a RPG, but the characters and storyline are painfully lacking, even in the remake's improved story. Good for wasting time grinding, but thoroughly forgettable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story - What would you do if you ended up being god.\r\nPagan gods are sick and tired of being beneath the Christian stories. Slow story and very lackluster... A basic what if twist on the Christianity stories. And the game says its purely fiction :'D\r\nCombat - Decent not great.\r\nGood enemy amount - Better ally amount. \r\nTedious - Extremely tedious levelling and swapping out to new allies - Glory system made that extra tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked the concept of the game—it was fun for the first couple of hours—but after that it just became boring for me. I’m not saying it’s a bad game, it’s just not for me. I really tried to enjoy it, but I kept falling asleep and even accidentally beat a boss just by mashing buttons half-asleep. The game feels too easy, even on hard mode, since you can grind to a high level very early and breeze through most of it.\r\nI’m a big fan of Persona and Persona-like games, so I had high hopes, but this one felt like a letdown. None of the characters stood out to me except for the saint girl and the second arc, which were the only parts I found interesting. Beyond that, the experience was just dull.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I know this is my personal opinion since most of the people are ecstatic about this game (95% positives), even though many mentioned that the plot is a LITTLE weak. When i started the game i felt it was okay, but at the mark of 3 hours exactly i understood i can't bear it anymore, the plot is NOT a LITTLE weak, it's DOGSHIT. \nNothing happens for hours, you are forced to farm same mobs forever to attain lvl's for getting better ones to progress, barely any dialogues are recorded and you are just reading text, while the same phrases like \"YOUNG MAN\" get itched onto your brain. People mentioned good OST. Oh REALLY? The same track plays in literally every battle you start. And oh i mean it. Every. One.\nI read that this game lacks the link system like in persona games and thought that it might be interesting to not spend as much time talking, heh, but i was so wrong. The lack of relevant dialogues with companions only enforces this feeling of never ending grind. Changing the team doesn't change the feeling of being in the same fight for hours on end - same strategies (only differently packaged), same annoying OST and same YOUNG MAN phrase every 2nd minute.\nI forced myself to play for 3 more hours to see if maybe it gets better. No, it did not. I really wish i could refund this, but i can't. \nSo i'm warning some guy stumbling on my review (which is unlikely to happen) to steer away. If you are a fan of Persona games - stick to them. SMT5V is a downgrade in all the possible ways from them. Perhaps i somehow misunderstood the game or was too rash in my judgement, but for me these 6 hours were nothing but one big annoyance (and i say it as Persona 3 and 5 fan).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has no challenge because you can save at almost any time before every battle",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you expect Persona, this one is not for you and me",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A really great dungeon crawler that unfortunately devolves into a morass of uninteresting exposition and cutscenes. Even the dungeon crawling eventually turns into FFXIII corridor simulator... sad.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A addicting, super fun game. Until it just doesn't store any of your saves for the last 12 hrs of gameplay and completely stops your playthrough making you never play it again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "As a newcomer to SMT, I had a good time messing around, learning the system and exploring the demon designs, until the novelty wore off and I realised that A) there's so much QoL polish that the actual stakes of random encounters are about zero, and B) the base game has nothing for a plot.  There's a big hole where all the writing should be.  I see other reviewers saying that the new route has a better story; if you're planning on picking up this game, you're not missing anything by ignoring the original route.  If you're still worried, skip the tedium take 30 seconds of your life to read a plot synopsis.\n\nThe side quests have a bit more charm to them, but that's not saying much.  Most of the styling starts and ends at \"what if this mythic figure was foul-mouthed and menial\".  I hope you weren't expecting lore, either.\n\nDespite the series reputation, this game is honestly pretty easy; playing on Normal, I've not had to worry about resource management or grinding since hour 1, and even superbuffed Ishtar only required fusing a couple of demons to crumple her like a paper cup.  You can't increase the difficulty after starting so you might want to start on Hard to see how it goes.\n\nThere are some genuinely charming demon designs here, but also a surprising number of scantily-clad women who think you're hot shit and need your approval.  It's clear that part of their QoL was aimed at making the demons into proper co-travellers with personalities you'd care about, but the combination of poor scaling + limited part space + one-demon-per-species limit + fusion system hobbles them in that regard.  You'll have to melt down your darlings to free up space, and churn through demons if you have any interest in exploring the fusion roster once it starts to bloat.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Mediocre. The gameplay is engaging enough for a RPG, but the characters and storyline are painfully lacking, even in the remake's improved story. Good for wasting time grinding, but thoroughly forgettable.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Story - What would you do if you ended up being god.\r\nPagan gods are sick and tired of being beneath the Christian stories. Slow story and very lackluster... A basic what if twist on the Christianity stories. And the game says its purely fiction :'D\r\nCombat - Decent not great.\r\nGood enemy amount - Better ally amount. \r\nTedious - Extremely tedious levelling and swapping out to new allies - Glory system made that extra tedious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been spending 6 hours in the same desert now just fighting the same enemies over and over. Even if the enemies are different these fights feel the same. I got maybe a little bit of story, so too boring to continue.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i tried so hard to justify spending $60 on this but having to slog through the areas (open world and especially demon king's castle) are the most repugnant abhorrent incomprehensibly dogshit sections of any game to have ever been made i have played and i have played xenosaga episode 2. the combat is so cool but story uninteresting, the music is neat but the characters don't exist, the nahobino is hot but will metaphor is hotter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Kinda regret buying this game.\r\n\r\nI thought they improved since SMT 3 but it still the same pattern. \r\nThe pacing in this game is horrible in modern day RPG. You enter a big world, you fight nonstop until you reach a checkpoint storyline, you continue fighting immediately.\r\nThere is no hub for you to release tension. You have to be caution all the time, and manually save every 5min yourself because one bad encounter then you are dead.\r\n\r\nEven when i have overleveled my character, i can die to some random bullshit like Mudoon hit enemy and instant kill mc or entire party get one shot by red berserk enemy. I could easily kill that berserk monster if my bar is full, but i just take the shortcut since i'm overleveled at that point, thinking it should be a breeze fight, and now i lost 30min of progression. \r\n\r\n\r\nIf they allow us to save everywhere, why not just put auto save feature to prevent such bullshit scenario. \r\n\r\nNeed to remind myself don't ever buy SMT game in future",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}