{
  "positive": [
    {
      "review": "Its a wonderful game, which is Wuxia based and the graphics and animation is clearly inspired by Octopath Traveller series. Wandering Sword has a pretty gripping story with several twists and turns throughout the game, as if when u think the story is about to end, a surprise villain appears and fits quite well in the story. The story acknowledges the protagonist's  growth as a martial artist.\n\nEarly game, the game throws some tough battles. Although winning all is not required, but in case you do, the enemies react with disbelief, which is a pretty nice aspect. \n\nThis game also has a couple of cons. Firstly, this game shouldnt use both CPU and dedicated GPU at its fullest. But in my case it does, running CPU (Ryzen 9) at 94 degree C and GPU at 86 degree C continuously, right from the start page of the game. So optimization of this game is very poor. \n\nSecondly, this game is huge and it doesnt actully tells you anything about the game world. So I missed a huge number of plots in my first playthrough.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Easily the best game I've played in the last decade. Translation is actually not bad at all and the story is an absolute masterpiece. Big THUMBS UP and congrats to the devs!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I wish there would be some post-game exploration. To just have the final fight, ending of some characters then return to the menu screen is making me feel a little... empty inside.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Been waiting for sale to buy it for a long while, but after trying, realized, the game is so good you dont need a discount to buy it, worth every penny\n\nEdit: finally a good Jianghu game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I have only played one other cultivation game before and kinda got stuck partway into it with a lack of direction and understanding of what to try next.  So, admittedly, I was a bit hesitant.\n\nThis game though... I decided to try it out for a few mins and a couple hours later I looked at the clock to realize time had just disappeared.\n\nThis game is really well done.  The English translations are really good.  There is a lot of Wuxia terminology here that is a bit jarring if you haven't encountered that style before, but it's quite well done and if you can get into this type of Chinese fantasy than this game really delivers.  The HD-2D pixel art and stylization is really well done, especially when balanced against the more traditional artwork of the character portraits.  I like that the proportions of the characters are a bit more realistic (as opposed to Chibi).\nThe combat is quite well done, and can pose quite a challenge.  You really do have options available though, especially in how you develop your character.  There's a lot here, and it does have a very incremental stat building and improving system that gives you a lot of fine control over what direction you go.\n\nI haven't gotten far into the story, but it is really quite good so far and I'm super looking forward to playing more of this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I bought this game a week ago...Its alright.\n\n\n\nHoly shit. Im working tomorow,i did it again. God damn it.\n\nJust take my word for it. Its a very good SJRPG's.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very decent amount of contents for the price. The game is casual friendly but has higher difficulty settings if you want to apply the mechanics. \r\n\r\nOverall, the narrative is more of a draw than the combat mechanics. It does a fairly decent job at \"modernizing\" the wuxia genre. I think what stands out the most is that it incorporate more nuanced character development that do not necessarily serve the classic wuxia tropes. Some elements were certainly borrowed from anime and JRPG and they bring the story to a new height.\r\n\r\nThe fictional world in which the game takes place does have numerous real life history references if you are familiar with East Asian history. What I really like about this narrative is that it significantly toned down the Sinocentrism in a lot of the classic wuxia that created a fake duality of \"good south vs evil north\". This game takes a much more humanistic approach to the classic understanding of the wuxia world. Wuxia as a genre has the cold war era precedence of being hijacked by Chinese ethnonationalism (some of which were understandable metaphorical reactions from Hongkong/Taiwan authors against mainland Communists), and most modern wuxia stories still follow the same mold. This game breaks that mold by taking a rather pragmatic and fair stance by giving almost all characters a fair shake. In fact, I was drawn to the game immediately when I learned that the protagonist's name is likely a geopolitical reference to the historical Northern Asia. And I was not disappointed by the author's somewhat fair treatment.\r\n\r\nThe one downside I will mention is that the numerous endings require very detailed instructions to reach, likely not possible without a guide, and very time consuming. But obviously you can just watch recordings of those endings.\r\n\r\nEither way, highly recommend if you are used to old wuxia and would like a more dynamic modern take.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Congrats on Console release (i will double dip). Please make sure to update dub on STEAM too.\n\nOverall one of the best recent wuxia game that I have played, but with each update one of the Main heroines role got over shadowed by other Main/Sub heroines.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is perfect with the story lines and the gameplay system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "内容丰富，制作精良，文案昂有古韵。是讲情怀的良心制作",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I find myself wishing their were more games like this one. I was very hesitant to try it at first just because it looked a little too different, but man am I glad I did. I seriously hope for a sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are a few minor bugs, but the thing that bothers me the most is the balance. Combat swings between being way too easy and suddenly way too hard, with almost nothing in between. The balance definitely needs more tuning. If you can live with that, it’s still a fun experience. The story is actually pretty well written, and I get the feeling they pulled some inspiration from a few popular anime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "兼顾游戏性和设计感，文本撰写更是了得，东方武侠世界的大千魅力在此得以窥见一二",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't praise this game enough. Even after finishing it, I constantly get myself thinking about some of the moments of the game. If you're a fan of martial arts movies, this is the game for you! I'm eager to play the NG+ but I will wait for the update with voices after the game gets released to console so I can enjoy this world once again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best wuxia based RPG that I have played. This story-driven RPG is also have enticing visual, good music, and also many memorable characters. The story is also deep and have so many story branch that can affect your ending. \nDefinitely recommend this game especially for people who like wuxia and RPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basicly a martial arts octopath traveler, i like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve put 100+ hours into it and the story just keeps getting better—emotional, unpredictable, and way deeper than I expected. The world-building is rich, every faction and location feels alive, and the soundtrack is stunning. If you love wuxia or classic JRPG-style adventures, don’t sleep on this game. It deserves way more attention.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One-line verdict:\r\nA flawless 10/10 experience—and an absolute must-play for anyone who loves the wuxia genre.\r\n\r\nThis game is an absolute masterpiece within the wuxia category. The only real rival it has is Hero's Adventure, and since both titles use different mechanics—despite being turn-based—they complement each other wonderfully and can be enjoyed side by side.\r\n\r\nFor new players, I highly recommend using an online companion guide during your first playthrough. It helps ensure you don’t miss any recruitable companions or key pieces of lore and story that make the experience what it truly is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a wuxia story involving many of the places, factions and concepts familiar to those familiar with the genre (fantastical martial arts, sects devoted to such, the struggle between good & evil and the like). A 'Zero to Hero' kind of story  as such.\n\n- There are plenty of places to travel to, many interesting personages to seek, lots of secrets both big and small to find out...\n\n- I would compare this game to 'Hero's Adventure' as well as the first two Baldur's Gate games - though it's a bit more linear than Heros Adventure (so, more like BG 1&2 there), you may be surprised by how many things can affect the story in both small and big ways. Which brings me to another point:\n\n- What I think is remarkable about the game is how it encourages the player to be thorough. Doing not just the main quest but also side-quests, making sure to check things thoroughly during the quests, travelling far and wide unprompted during your playthrough, searching every every nook and cranny... Doing these tend to reward the player with extra good stuff, unlock new companions, unlocking new solutions for future quests and even later future outcomes and events of the course of the game's story... It's something that makes the game enjoyable for me and also gives the player a reason to replay it.\n\n- While the game is categorized as an RPG, it should be said that you shouldn't expect too much from it in that regard. Yes, there are some aspects of the main character you can control, such as their choice of weapon styles and in some cases which matters they choose to get involved with or not and the like, but... Not that many; if that's a plus or minus is for you to decide, I guess.\n\n- Many games in this genre are badly or so-so translated or not translated too... Coherently as such, but this seems to be very well done indeed and you should find little to nothing to complain about in this regard.\n\n- Although this game is advertised  as turn-based, there's a choice to go from turn-based to realtime, but it's not an option I choose to explore, so can't comment on it other than that it exists if you prefer that over turn-based.\n\n- The art is nice, both in terms of pixels and the character designs and whatnot.\n\nOverall: This may well be the best or at least one of the best wuxia games you could possibly add to your collection! Very much recommended for fans of the genre, and even if you aren't a fan, I recommend trying it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best cultivation games I know. The power progression actually feels like you got stronger",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't know what to expect going in, but I was very pleasantly surprised. The story was exceptional and the world felt shockingly alive, with so much attention to detail. The art is gorgeous and the pixel work is outstanding. The fact that there are so many distinct and recognizable characters over the course of a 80+ hour game is wonderful.  The gameplay is fun, and the ability to customize skills for each character really made it feel like assembling a team of companions. Truthfully, if this had come out in the age of Chrono Trigger and the earlier Final Fantasy games I think it would be held up as a pillar of RPGs in much the same way they are. \nIf I had to give any critique it would be that given the game's scope, the fact that there are so many subplots and multiple endings makes the idea of replaying it a bit daunting. I know there's things I missed that I do /want/ to see, but I'd probably need a solid break before I sat down to run it again. Also, if you do have the DLC, I'd almost prefer if those stories were gated a little further into the plot because you can very quickly become OP. It's not gamebreaking unless you really grind a lot, but it does a little bit hurt the flow/challenge of an otherwise amazing story. Finally, at a certain point, once you get your own crafting skills up, the gear/weapons dropped from enemies and found in chests pretty much becomes vendor/disassemble trash. That in and of itself isn't a huge problem but I felt like I got so much of it that even looking at my inventory was painful with how cluttered it got. I had to intentionally make trips to town after any major story beat just to offload the junk.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent combat, cool story/worldbuilding, interesting upgrade, recruiting, and crafting systems. Ridiculously ambitious for an indie title and they nailed it for the most part.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very well written wuxia adventure for those who's in love with those old wuxia & kungfu movies from 1960-70s Hong Kong Shaw Brothers era. The characters are quite stereotypical, but exactly the types you expect to meet in Jianghu, the world of martial arts. Yes, each and every element of the story you have heard or seen somewhere before, but still it's a delicious stew made of all those ingredients and a must-have for all wuxia lovers out there!\r\n\r\nYes, it feels like an old JRPG - no game-changing choices (or so it seems so far!), repetitive returns to the same areas to fight the same enemies to get some stuff for the next quest - but you are xiake, you live to serve, so it's not your place to complain about that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wandering Sword is a difficult game to recommend, but at the same time it's really something that needs to be played to understand and appreciate it. The game is very unique when compared to the standard RPG fare. It's growth and progression systems are entirely different, the way it handles it's story and characters is closer to a SaGa game in feel, the graphics are very Octopath like in design but with it's own flair, the music is pretty damn good, and it's quests and their end states have more layers than an onion varying. There is a metric ton of stuff to unpack in this game and it's clearly been designed with multiple play throughs in mind from the word \"go\"\n\nCombat is a tactical grid based affair once you run into an enemy. All the different martial arts and weapon moves you've acquired have a fixed range and different effects. At game's start you are going to feel like a chump. The story also intentionally pits you against and allies you with stronger martial artists early on in the story just to drive the point home how much weaker you are than them. But it does this for a reason. It wants you to feel weak so you strive to better yourself and Yuwen Yi as a character through his personal journey, and good lord what a journey it is. Conspiracy, betrayal, the strong trying to subjugate the weak, allies, scheming, evil, there's a lot of familiar elements here but where the game shines is in it's overall Wuxia theme. The developers clearly have a passion for the genre that's hard to describe and the work and care that was put into this game shows.\n\nBut that is also a double edged sword for this game. As interesting as Wuxia is as a theme it's subject matter is a bit dense. Some of the terminology and details can be a little overwhelming at first and this might turn people off early into the game. The basic overarching story isn't hard to grasp there's just a whole lot of words used to tell it backed by concepts that a westerner might be unfamiliar with. But honestly it's a minor problem in the end. If you can get through the first couple of hours without losing interest I'd argue the game has done it's job. I also want to point out that while the translation isn't perfect compared to other games whose native language is Chinese this is one amazing translation.\n\nAbout the only other thing I can really hold against the game is two fold. The Secrets of the Eastern Sea DLC while good isn't very well balanced. The skills and some of the items you can acquire are pretty dang broken when taken back into the main game. Which is really too bad because the extra lore, story, and character details the DLC adds are wonderful. The other minor complaint I have is that controller support is a little \"janky\" It's very clear that this game was designed to be played with M/KB and that controller support was added as almost an after thought. It works well enough but it has some strange little quirks that might take some getting used to. I can't really think of anything else to complain about. I suppose things in the story being easy to miss, or characters being hard to recruit, and the like might bug some people but you have over 30 auto saves and can generally save anywhere. All you're really losing is time in that case.\n\nBut seriously this game is fantastic on a lot of levels. There is easily 100+ hours worth of content here if you're willing to take your time. And it's not like the price is going to break the bank unlike some current \"AAA\" titles might. If you're looking for something different in regards to the RPGs you play Wandering Sword is about as different as it gets. Highly recommended but do your research first.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game that is right in the middle between an open rpg and a jrpg, where you get to do practically anything you want but at the same time you have the characterization and fun party members that you expect from games inspired by jrpgs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful 10/10 game for any Wuxia / Turn based lover with a bit of roguelite in terms of getting 'Inheritance points' for your future runs.\n\nIt's very much running the same style as Octopath Traveller, but has it's own combat system between real time / turn based and loooads of stuff to do and discover.\nNow 218 hours in I am at 97% and got what I would say is the perfect ending. I done 4 runs and got 5 different endings. Some very abrupt, some midway due to not being strong enough and the last two I grinded the ever living out of any sidequest till I was sure I had it all.\nDLC is worthwhile for it's small cost, but the items can really change up the games difficulty, though there is a nice little gatekeeper if you are not strong enough yet.\n\nFiguring out how to get the different 8 Legacy items to get a better start next time was great fun.\nHope to see a 2nd installment of this game in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far i've only put 3 hours into the game and i'm really enjoying it! the combat is fun and so far the story is keeping my attention, the variations on builds in pretty cool but a little in depth, i really recommend you pay attention to the tutorials as they come up and not skip them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wandering Sword is a lot of fun and you really get absorbed in the world. I'm not too familiar with Wuxia / Cultivation stuff so I was a little confused with the setting at first but you learn enough to get by pretty quick. It's a good RPG but it needs some more polish imo, namely for things like tracking the different multiple endings, or maybe a quest map because you can accidentally lock yourself out of quests super easily. Fortunately that doesn't negatively affect you too much, more of an annoyance. \n\nCombat can be set to AUTO mode which is something I really like, you can put your feet up for unimportant battles and lock in for the important ones. Crafting is pretty simple and rewarding since the best gear is crafted but the inventory needs work. Overall very fun and worth the price but needs more love from the devs and they seem to be working on updates.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "- 剧情带入感强，软引导极其出色，靠推理所触发隐藏对话及剧情，从而获得极大满足感\r\n- 令人着迷的江湖世界，画面和音乐皆属顶级，大部分队友刻画以及专属剧情过于精彩，导致女主显得平淡无奇...\r\n- 传统回合+战棋，刷刷时能自动倍数战斗，解放双手\r\n- 小瑕疵：管卡难度设计得稍显不合理，困难难度下，一周目早期会觉得处处碰壁，到中后期又变得过于简单. 有极少数任务会因bug导致失败，无法重接只能读档.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wandering Sword is an absolute masterpiece — a rare gem that blends deep lore, philosophical storytelling, and breathtaking world-building. The game draws heavily from Taoism, Buddhism, and classic Wuxia traditions, creating a universe that feels both mystical and grounded in ancient wisdom. Every faction, every sect, every legend feels alive — each with its own ideals, conflicts, and ambitions. It’s like Game of Thrones set in a world of martial arts and spiritual enlightenment.\nThe characters are profoundly written — complex, layered, and full of purpose. Their motivations intertwine beautifully with the overarching lore, creating emotional depth rarely seen in modern RPGs. \nIf you love stories with deep philosophy, political intrigue, and grand adventures across ancient lands, this game is an epic journey not to be missed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really solid little RPG, better than many of it's kind. Recommend for folks who find Saga RPG games a little too chaotic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "remembering me in two xia games, world of kungu for the tbs ganging and multiple stat management and heroes adventure...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my goodness this is truly wuxia story , its worth the price , typical wuxia story indeed but the twist is interesting as Fck . its worth to play if you enjoy good game story . i should be around 3/4 of the main story , i skip so many side quest just to see how main story progress . this is my personal opinion",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just started playing this recently and can already tell I'm gonna love this game. Turn-based tactic games are my absolute favorite. I'll get lost in it for hours playing nonstop. A++\n\n*Note for the devs* please consider making weapons/armor packs like the mount pack. Also pill packs that give meridian points. Not everyone has thousands of hours to dump into games that require \"reincarnating\" to get higher stats. I really dislike the inheritance system. Having to replay through the entire game over and over just to get higher stats is incredibly tedious and like I said, not everyone has endless free hours to play like that. I would definitely buy those pills over having to start all over and I'm sure I'm not alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An nice cultivation game. I really like the turn-based real-time switch feature. The current only complaint is the poor graphic setting, it's a significant problem for my low-end machine. Anyway, love this game so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good gameplay and great storyline. Just fun to play and get all the hidden stories u can miss if u just follow the quest marker",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great music, interesting story, pretty vast world to explore and lots of martial arts to learn and experiment with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is good.  Octopath Traveler vibes but with cultivation instead of magic, although, it basically is magic.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So so sooooooo underrated.\n\nJust buy it and support developers.\n\nIts worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fantastic story with an expansive world and deep characterization and development. I recommend installing this one, especially for portable systems and during trips.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chill and Play\nStory Rich 10/10 likes Jin Yong's Novels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "臨繪天下觀殘紅，遙指東南西北中， 神州春秋九問鼎，誰堪煮酒論英雄。",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's alright for now, but the story is basic and cringe cuz the main character acts like 7 years old. It's not like he's being a fool who doesn't know any better, his dialogue is just annoying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like wuxia, if you like big partys and lots of story events, Combat is kind of an afterthought often using auto battle. But building you character(s) is interesting. 8.5/10 for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "15 minutes into the game I beat up a 5 year old for his stuff.  - 10/10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Best Wuxia game, when i play this game i feel like a real cultivator XD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game so far and haven't been able to put it down",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can you put this game on the Switch? I don't own a Steam Deck..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My go to game for Wuxia/Martial Arts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are into Wuxia then this game is definitely a must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "喜欢武侠的话，这是你近年必玩的游戏",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down one of the best indie games i've played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dare to say this game is even better than suikoden II",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun little game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice Chinese game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hours and hours of fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazingly fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best Wuxia game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty Good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "日",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "6",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll be honest.  Initially, I played this game because of the cast of pretty boys.  But then it became something more.\n\nI'm GENUINELY obsessed with this game.  I've never dipped my toes into the wuxia genre much, but this game made me want to learn more about martial arts and Chinese culture!  Like, I want to make a discord about this!\n\nPros:\n\nThe best parts are the beginning to middle story arcs as they're very strong and engaging.  the final arcs felt rushed somehow, but then again, I was playing the latest update that included the Southern Chronicles DLC.  If you want to play the original story and go for a more bittersweet journey painted with tragedy and redemption, opt out of the golden scorpion quests that initiate it.\n\nYuwen Yi is a great protagonist and he undergoes amazing character development throughout the story based on your choices.  He starts out as close to an audience surrogate if you're not familiar with martial arts.  I was expecting to play as someone already hard-boiled and alienated by living as a martial artist.  Yuwen Yi is endearing, loyal, kind to a fault, and naive starting out, but it's rewarding to see him grow and mature into a powerful martial artist that you train him to be.\n\nBeautiful world, gorgeous art, and there's many funny scenes - mostly having to do with Bai Jin.\n\nThe many, many cast of characters you get to meet and recruit!  They're all interesting in their own right.\n\nGameplay-wise, it gets repetitive sometimes and you definitely have to grind sometimes.  Luckily, there's two modes you can play: turn-based or real time.  It's fun to switch it up!  On the other hand, if you're like me and hate grinding for hours, there's always the auto option.\n\nCons:\n\nSometimes the game gets glitchy during battles.  I don't know why.  It lags, but maybe that's because I need a new graphics card.\n\nThis game is definitely BRUTAL without a guide.  I played mostly blind until I realized how much content I was missing just by progressing too deep into the main storyline and then being too past the point of return to recruit those three characters crucial to obtaining a good ending.  So here is the guide that helped me achieve (almost) 100% completion!\n\nhttps://docs.google.com/spreadsheets/d/1K_qPs8IH-relSXdUx7U4BIklrW0UjtWc8cRg-7b_x4I/edit?gid=1776806085#gid=1776806085\n\nLimited love interests.\n\nOkay, so don't get me wrong.  I absolutely have no problem with Yao Ji and Ouyang Xue.  Both are sweethearts in their own ways and the way they fall in love with Yuwen Yi is natural and lovely to see if you prefer them.  But I feel like the whole the \"girl next door\" and \"dating catwoman\" shtick has been done so many times that I've lost my taste for it.  As far as the official romance options go, they're both alright, I guess.  Their illustrations and sprites are beautiful.  Just not my cup of tea.  I sympathize with Yao Ji seeing her tragic background and hard life in the cult, and she's pretty badass with the flame sabers, so I can give her that much credit.  As for Ouyang Xue, she's nice.  But that's pretty much it.  I personally don't find her character compelling as it feels like she was only really there to support Yuwen Yi and didn't have any strong personal goals of her own besides Yuwen Yi.  Like a love satellite.  But I do commend her for being more proactive and her badassery upgrade in the Southern Chronicles, even though she still felt ultimately sidelined in contrast to the other characters.\n\nHowever!  In my personal opinion (and this is just my opinion, so if you don't agree with me that's fine please don't attack me), I feel that seeing as so much content was devoted to Shangguan Hong (best girl besides Bu Weiyue and Yia Vang) to the point of giving her new clothes, an awesome sword, and considerable focus in numerous cutscenes, I'm shocked the developers didn't just make her the third official romance option, considering she's journeyed with Yuwen Yi the entire time (if you find her) and has her feelings hinted at several times in the game.  Suma Ling is like their hyperactive little sister/child, lol.  Though I can understand if this was meant to be write them in a more platonic familial light.\n\nLike, how can you get an ending with Xiaotong but no Shangguan Hong?!  She was done dirty, I swear.\n\nYia Vang.  The Scorpion Envoy!  OMG I looove her :sob: She's nothing but sweet and helpful.  I'm not just saying this because I'm biased towards her exotic design.  She's absolutely killing the scorpion motif.  I really wish she could've been romanced as a secret romance option or something.  It'd've been amazing since Vang is from the Wuxian sect and they could've connected more based off their association with Xiaotong.  Idk if she has a hidden ending, but I know that Shangguang Hong and Frosty Condor and Xun Yaoyao have hidden endings if maxing out their affection.\n\nShe WOULD be my favorite if she'd've been a love interest!  But she's not, so the winner goes to...\n\nBu Weiyue is the best girl, hands down.  Pretty islander girl with monkey sidekick ftw!  She's already powerful when you meet her, but the assets she provides are really helpful for the player, especially for a new game + playthrough.\n\nThe fact that there's no official solo ending reserved for her like there is for Ouyang Xue and Yao Ji makes me salty to this day.  Girl literally shows up out of nowhere, trolls the men trying to take advantage of her and makes them run away without their clothes, and gives Yuwen Yi his own island, an awesome fan that deals damage, and has the best chemistry with him out of all the main official love interests.  She's so quirky, cute, and genuine and can relate to Yuwen the most.  She's the last part of the Yuwen-Shangguang-Sima troop.  The DLC arc of them overcoming trials and becoming closer throughout the journey was really natural and sweet, especially the romantic scenes at night.  I feel like her romance with Yuwen Yi felt the most natural, supportive, and romantically endearing since they spend a lot of time together.  Watching her gradually fall in love with him was adorable while Yuwen stumbling and stammering around her was pretty cute to see as well.\n\nThe monkey is pretty much their child, lol.\n\nPlus, her confession scene was actually really beautiful and sweet.  How could I say no!  I admire her boldness for sure.\n\nOverall rating:\n\n8.2/10\n\nIt definitely stands out as a wuxia RPG, and the characters and story are compelling and solid enough to keep you playing.  However, sometimes it's more of a \"tell\" rather than \"show\" narrative.  Characters throw a lot of lore and exposition at the player out of nowhere, which can make it hard to follow/exhausting.\n\nBeginning to mid was strong - but the last few arcs felt shaky and rushed.  I felt the execution could've been more gradual instead of flinging villain group after villain group to reach the resolution.  The villain valley guys were introduced as threatening, powerful enemies, only to get cut down pretty unceremoniously at the end.  They didn't get much development and focus besides the two secret enemies who I wont' say or else I'll end up spoiling them.  Basically, the main villains were there to be all imposing and threatening but don't have as much substance to them as say, the traitor antagonists.\n\nThe later plot twists I saw coming from a while away, and they weren't executed too well in my opinion.  It was alright.  Not bad, but not great either.\n\nStill, the bromance between Yuwen Yi and his other companions was endearing to watch.  Bai Win is who I consider Yuwen's closest bestie.  My alcoholic dude is so chill and gives no fucks whatsoever about the sects or world.  My man just wants his drink.  It would've been hilarious if he'd been a love interest.\n\nAll in all, I had a lot of fun playing this game!  I really enjoyed the martial arts/wuxia aspect, which is different from most RPG games I play.  So definitely try it!",
      "voted_up": true,
      "votes_helpful": 71
    },
    {
      "review": "I checked i already played 152 h to this game. I am at the end of the third playthrough, and i must say this game is as good as this genre can get. The story telling, the replayability, the branches in the story.... this is a love letter from the developers, and i would like to give them my most sincere congratulations and thanks: You have done something remarkable, ambitious and excelent in every way. You should be proud.\r\n\r\nFor the players, i will only say that if you are into this, you definetily need to play this game. You will never regret.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "What a journey it's been. If you're a fan of the Wuxia theme, I ABSOLUTELY recommend this masterpiece of a game. If I were a little less poor, I'd have bought this game for my friends so they can experience this journey as well.\r\n\r\nLOOOONG review ahead so be warned:\r\n\r\n\r\n\r\nIn terms of story, if you're familiar with this theme in general, you'll be familiar with a lot of the tropes present in the game. The story had me hooked from start to end, and I always felt that I gotta keep going and do more. Even the side quests are fun enough with their own compelling stories.\r\n\r\nProgression feels amazing and extremely immersive; that zero-to-hero feeling feels hard-earned as every skill, every cultivation technique, everything you do contributes to the overall growth of your character. And you're constantly meeting incredibly strong martial artists in the story and world that motivates you to keep exploring, keep learning and mastering more stuff to hopefully one day surpass them.\r\n\r\nRomance options, though somewhat limited, exists in the game. Really would love more options as some characters like Sima Ling (my ABSOLUTE FAVORITE) spend a lot of time with you, and even have their moments to shine in the main story that makes you love them even more, yet they don't get their own routes for romance. No way she just put her life on the line for you with Hong in the Nanjiang arc and she doesn't get a chance with you. DEVS WHYYYY\r\n\r\nI believe there are many events in the story that have very different outcomes depending on your actions (some leading to named characters you know and love dying) but getting the \"best\" outcome can be a bit of a pain since a lot of things are quite missable without the progression guide. I'd say if you don't mind giving it multiple playthroughs, enjoy your first run as is and then look up the guide for your second. A small tip: You CAN keep every recruitable character in your party despite the UI suggesting otherwise, and doing so gives you so many more dialogue and cut scenes from both the main AND side quests (love this). Doing so also gives you access to options that can be important to the story.\r\n\r\nOverall, I really feel the devs have shown immense love for this game. Wuxia fans, hardcore and casual, will find much enjoyment out of both the story and immersive progression system of the game. It really feels like you gotta work your way up in the world to be the unstoppable hero you are at the end of the story. Even players unfamiliar with Wuxia have a lot to take from this masterpiece of a game.\r\n\r\nSorry for the yap, but I really just love this game so much I had to put my thoughts and emotions out. To the developers, thank you for the journey.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "It starts slow, but stick with it. This game has a wonderful story with tons of secrets and hidden interactions between characters. I recommend using a guide for all of the quests, as it's incredibly easy to miss secret content. You could do repeated playthroughs to find them more naturally, but a single playthrough can take over 80 hours! The combat is very fun for the most part, but the end of the game is bogged down by mass combat fights against weak enemies. Still, most of the time the combat isn't like that and is great, especially if you like rpgs with tactical combat.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "If you are a fan of classic Wuxia, JRPG's, beautiful 2.5D artwork and rich narrative stories, lots of legit 'choices matter' moments that run 30 - 40 hours deep in their consequences, deep and intricate systems of skills and experience customisation, I cannot recommend the game Wandering Sword enough.\nIt has absolutely blown my mind and redefined my expectations of what these kinds of games can deliver.\nIt's pretty affordable, on Steam, and where normally by the time I'm a day or two into most games I'm starting to wane - this just keeps delivering more cool story arcs, awesome power creep where you are both continuously challenged and made to feel powerful as you unlock new skill manuals and learn about your Qi from a rich host of helpful, and also hostile NPC's with their own agendas and plans.\nIf you like roleplaying games, and story + mechanic rich romps - or Wuxia / Chinese fantasy?\nWANDERING SWORD.\nGET IT.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This game has scratched that itch in my brain that only Wuxia or Xianxia novel and manhwa has scratched.\r\n\r\nI really enjoyed the visual, the pixel art is genuinely beautiful (except for one companion lol).\r\n\r\nGameplay is similar to strategy turn-based RPG, with tiles, movement, buffs and debuffs and it can get ridiculous once it gets going. Can be quite grindy, however.\r\n\r\nOne thing that I might dock it is the fact that everything is so interlinked with each other as one dialogue option is the difference between an outcome 30 hours later, and forgetting one item or companion leads to a different ending all together, which sucks since this game has a lot of ending so getting 100% achievement can be a bit of a pain.\r\n\r\nI quite enjoyed the writing however, although some concept can be a bit far for me, especially some of the buddhism or taoist terms, but it has led me to some interesting rabbithole.  [spoiler] I do think the Wudang Sect really does not play a lot in terms of the personal character arc of the MC so that can be refined in further games or even another DLC [/spoiler]\r\n\r\nI really enjoyed this game, and I am happy that I stumbled upon this game. Thanks dev, I hope you guys nail your next project!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "My word, what an amazing game, at first the story and characters seem all over the place, i have hard time remembering who is who and what sect and what relation they have but after the story unfolds one by one like an onion wow only then it became very interesting like reading wuxia novel but i am playing it instead, like ingredients that don't taste good by it self but when one by one added to the mix it became a dish, the story unfold in a very beautiful, sometimes sad, heroic and complex way, i lovee the story so much, the characters are complex human being not one dimensional bad or good but like human , each have story of their own and the story also have many branches also to choose, i just play blindly though since this is first playthrough, i am truly in awe with this game especially the characters and story and the friendship and comrade in arms very touching, it fully worth the price and some moree, again amazing gamee , it is very satisfying to see the hero from nobody then have being titled unrivalled and to be the peak of martial arts, buyy it you won't regret it",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This game is actually peak. I don’t see why anyone would dislike this game if they like wuxia. Satisfying progression and a branching but set storyline. Gameplay was so fun that I started NG+ immediately after my first playthrough.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "What I like:\r\n* graphic - very detailed HD-2D sprites, varied enemies and animations, hand-drawn character portraits. Overall it's superior compared to Octopath Traveler\r\n* music - relaxing\r\n* story - pretty cliche MC, but many of the side characters and their story arcs are very interesting. The final part of the story is pretty epic.\r\n* battle system and progression - satisfying and embodies Chinese wuxia perfectly\r\n* multiple endings including perfect harem ending\r\n\r\nWhat I don't like:\r\n* PRESS M IN OVERWORLD (no idea why this isn't the default)\r\n* fast travel is limited - need to go to a fast travel point to fast travel (can't do it directly from map)\r\n* some janky translations from Chinese to English (50/50 on this)\r\n* lots of missables if you are not careful (quest markers in overworld would make it a lot easier)",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I didn't want it to end. Not sure there is a much greater way to feel about a game. While going for other endings/achievements is tempting, I think I may just let things lie as they are.\r\nI rarely finish games and this was a joy from start to finish. A welcome surprise.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I wish there would be some post-game exploration. To just have the final fight, ending of some characters then return to the menu screen is making me feel a little... empty inside.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Its a wonderful game, which is Wuxia based and the graphics and animation is clearly inspired by Octopath Traveller series. Wandering Sword has a pretty gripping story with several twists and turns throughout the game, as if when u think the story is about to end, a surprise villain appears and fits quite well in the story. The story acknowledges the protagonist's  growth as a martial artist.\n\nEarly game, the game throws some tough battles. Although winning all is not required, but in case you do, the enemies react with disbelief, which is a pretty nice aspect. \n\nThis game also has a couple of cons. Firstly, this game shouldnt use both CPU and dedicated GPU at its fullest. But in my case it does, running CPU (Ryzen 9) at 94 degree C and GPU at 86 degree C continuously, right from the start page of the game. So optimization of this game is very poor. \n\nSecondly, this game is huge and it doesnt actully tells you anything about the game world. So I missed a huge number of plots in my first playthrough.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fantastic RPG with a deeply character-focused story. Useful to play with a guide to not miss anything, as there are a lot of missable characters and story branches to increase replayability. Combat is OK-to-good, as most of the time it becomes kinda rocket tag due to how much powerful stuff you and your enemies have; if you are ever overpowered you can set the game to real time combat and/or autoplay, which is great for grinding or sidequesting.\r\n\r\nThe power fantasy is great, as you start up as a very basic martial artist and end up as a deity (swords recommended as your main weapon, as the game kind of pushes you to use them and they have more cool stuff). DLC adds to the experience significantly.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "After finishing game once i really must recommend that game story its great i really enyojed combat a lot and i had a lot of fun worth trying",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "This game is PEAK.\n\nI tried this game a year ago, and it was scuffed as hell. There were bugs with UI, and it just felt like it's a slop. I just couldn't even go past the prologue, cuz it felt so... scuffed. So I just dropped it and refunded. But... A couple of days ago, after seeing all of those reviews, I decided to give it another chance. So I bought it on sale. And let me tell you lads something... This game is insanely good. UI is still feels scuffed, but I can at least play in this one with a controller. But overall, the game is insanely good, and I'm sure that I still didn't even reach the middle of the story. \nSo... Good points:\n1. A really good written story.  No memes. If you guys like manhwa about all those chinese martial artists - you will like it 100%. Every side story what I did so far - were really good written. The MSQ is interesting too. Every char what you can recruit feels like an actually important char, when they're, in fact - not. \n2. Martial arts.  I'm a sucker for games like this. There's different types of weapon what you can use. Swords, Sabers, Sticks, Fists, Throwable stuff. Each weapon has it's own skills. The best part of it, you're not getting skills from the \"skill tree\" like in normal RPGs. You're learning them from books or people. If you're in a good relationship with a chars, you can \"ask\" them to teach you skills. For example, there's a guy who's using cool sword skills in battle. You can talk to him (if he has a specific icon), gift him some stuff so he would like you more and then learn all those cool skills from him so you could use them too! And let me tell ya, there's a LOT of them. There's also ultimate moves, and some kind of \"magic\" stuff too. But in the end, it's insanely interesting to just farm those moves so you could use them too.\n3. Exploration. So... I'm 20+ hours into this game, and I'm STILL in the first area. Every town has some interesting side quests, characters what can teach you rare moves, or who you can recruit later. Items to buy/get from ppl. There's a LOT of places to visit and events to see. It's very good.\n4. Battle system. Well, some people would not like it, I thought so too. But I really like it now. First of all, it's a turn-based combat. Like in FF:Tactics. The thing is, it has a \"real time combat\". Basically, it's a much faster way to do things which makes things not that boring for people who don't like turn-based gameplay. And... It also has Auto-battle. And trust me, you will use it a lot my friend. It's a good stuff, especially when u're farming something. So this is a damn solid combat.\n\nBad things:\n1. Buggy UI for controller users (didn't try it without a controller). Sometimes it's insanely clanky and mega scuffed. Almost every window has issues with it.\n2. Re-used char pictures. That's not a mega big deal, but it was very confusing time to time. Like they're using one pic of the bald dude for almost every bandit encounter. Ppl who played in this game will understand me. But they're not that random, cuz they're like... part of the story. So it gets very confusing at the beginning, unless you're remembering their names lmao.\n\n\nSo, so far it's a solid 8/10 game. I really enjoying it so far and I would highly recommend you guys to give it a fair chance. You will not be disappointed",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Been waiting for sale to buy it for a long while, but after trying, realized, the game is so good you dont need a discount to buy it, worth every penny\n\nEdit: finally a good Jianghu game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "tl;dr: \nChinese wuxia Buldurs Gate 3 meets octopath traveller art.\n\nThis is a very well put together game. \nVery few bugs and crashes. \nThe story is pretty good.\nThe music (especially the boss music) is really good.\n\nThe combat is fun and engaging. Compared to its closest competitor, hero's adventure, the combat is much much more balanced. Fights can't entirely be determined through slight stat increases. (you can still overpower/be overpowered by opponents with major stat gaps). You can better compensate for the lack of stats in this game through character builds, tactics, and skill cycling.\n\nSome minor quirks of this game:\n1. Game expects you to understand wuxia novel terminology.\n2. Befitting of the wuxia story style, your party members have their own allegiances and goals. And will often leave party. But sometimes you need to win their own individual quest battles to get \"better\" rewards or achievements. You need to build the right companions but also don't rely on them.\n3. The game is as close to a free form choose your own adventure as a game can get. You don't need to win every fight. You don't need to resolve a quest the way the quest outline dictates. Theres a lot of secret ways to end quests depending on how you do them. There are 20 main story endings to this game depending on choices.\n\nverdict: 9.5/10 \nbuy your friends copies of this game to support the devs",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Finished the game today, after 120 hours of playtime, and honestly, it's totally worth the price.\r\n\r\nGameplay 8/10\r\nIt's solid if a bit daunting at times; I found myself running the auto-combat real-time battles A LOT. That said, the system exists there, the character growth is fun, since you start the game seeing all those high level characters, but you grow into a true powerhouse... Sadly, due to how thorough I was with my exploration, I beat the final boss in 1 minute on normal difficulty, so that was underwhelming a bit. The game is a bit grindy, but nothing people aren't used to in this type of RPG.\r\n\r\nStory: 8/10\r\nVery strong and captivating, has multiple variables to it. It is one long journey and well thought out; the writers did an amazing job on this. That said, two aspects of it are bad: its romance and disproportion in some characters. Romance is bad because I was just being nice, and I got all romance endings... Seriously, give the guy an ability to say \"No\" to a woman's advances; that kind of killed the reason for me to replay the game. Regarding the disproportion, some characters get a lot of screentime during cutscenes, while others are pretty much ignored after their recruitment and maybe some small side quest. Huo Changqing and Chen Lenxi are pretty much pointless to recruit; they do not contribute to anything.\r\n\r\nEnding: 5/10\r\nThis really needs to get fleshed out more; it's pretty abrupt, and while a game shouldn't be rated by this but rather as a whole journey, I found this to not really be satisfying when it just dumped me to the main menu after a few ending slides. It seemed underwhelming in comparison to this epic journey.\r\n\r\nMusic and Sound: 9/10\r\nVery atmospheric, the game wouldn't be half as good without the soundtrack that tied it all together and created an immersive atmosphere.\r\n\r\nReplayability: 5/10\r\nYeah, there is a New Game+ kind of, but I honestly see no reason to replay it, since I got rewarded all those ending cutscenes during one playthrough. I can see it working if someone just rushed through the game, but if you are a completionist like me, you'll end the game at 120h and stare at the screen with the \"that's it?\" expression.\r\n\r\nOverall, I highly recommend this game; it's great if you are into Wuxia type settings. There are not enough games in this setting, and this one happens to also have a very good translation.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "OUTSTANDING game!  It's like Octopath Traveler had a baby with Crouching Tiger, Hidden Dragon and the Iron Monkey.  Love the gameplay, mechanics, and character advancement.  While the story and characters might exhibit some trope-like aspects,  they also display some excellent features respectively.  My one notable critique would be the lack of quantity with the music ... the quality of the tracks is very good, they're simply repetitive.   I played this game TWICE back to back this summer and had a blast!  I loved the DLC and hope a sequel comes ASAP.  I recognize that Spiral Up Games and Swordsman Studio are working on porting the game to consoles, so more DLC and a sequel are on the back burner but I would pay for new content tomorrow if I could ;). This game is a 9-9.5/10!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Easily the best game I've played in the last decade. Translation is actually not bad at all and the story is an absolute masterpiece. Big THUMBS UP and congrats to the devs!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I bought this game a week ago...Its alright.\n\n\n\nHoly shit. Im working tomorow,i did it again. God damn it.\n\nJust take my word for it. Its a very good SJRPG's.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very decent amount of contents for the price. The game is casual friendly but has higher difficulty settings if you want to apply the mechanics. \r\n\r\nOverall, the narrative is more of a draw than the combat mechanics. It does a fairly decent job at \"modernizing\" the wuxia genre. I think what stands out the most is that it incorporate more nuanced character development that do not necessarily serve the classic wuxia tropes. Some elements were certainly borrowed from anime and JRPG and they bring the story to a new height.\r\n\r\nThe fictional world in which the game takes place does have numerous real life history references if you are familiar with East Asian history. What I really like about this narrative is that it significantly toned down the Sinocentrism in a lot of the classic wuxia that created a fake duality of \"good south vs evil north\". This game takes a much more humanistic approach to the classic understanding of the wuxia world. Wuxia as a genre has the cold war era precedence of being hijacked by Chinese ethnonationalism (some of which were understandable metaphorical reactions from Hongkong/Taiwan authors against mainland Communists), and most modern wuxia stories still follow the same mold. This game breaks that mold by taking a rather pragmatic and fair stance by giving almost all characters a fair shake. In fact, I was drawn to the game immediately when I learned that the protagonist's name is likely a geopolitical reference to the historical Northern Asia. And I was not disappointed by the author's somewhat fair treatment.\r\n\r\nThe one downside I will mention is that the numerous endings require very detailed instructions to reach, likely not possible without a guide, and very time consuming. But obviously you can just watch recordings of those endings.\r\n\r\nEither way, highly recommend if you are used to old wuxia and would like a more dynamic modern take.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Congrats on Console release (i will double dip). Please make sure to update dub on STEAM too.\n\nOverall one of the best recent wuxia game that I have played, but with each update one of the Main heroines role got over shadowed by other Main/Sub heroines.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is perfect with the story lines and the gameplay system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome. Amazing value for money. It's like 8 excellent martial arts movies in one. The writing is hammy, but in a fun and charming way, and the plot is soooo goooood. At like hour 70 of play stuff comes up that references the first 3 hours of the game. The layering is masterful. Dozens of tangled threads coming together all over the place, tonnes of excellent references to the full gamut of wuxia works, tropes, and aesthetics. The characters are fun and well realised. The villains are cartoonish but believable and compelling.  The DEVs have been attentive to irritations, like they have a 'skip minigame' option, an autopilot function for grinding trash mobs of enemies, and the game (usually) warns you when you're about to do something stupid. I hope there are many more RPGs and similar in the Wuxia world. This is more of an adventure game than an RPG, but it rocks either way. \r\n\r\nMy only significant grievance was that the quests and their triggers weren't signposted well in many cases, so it's pretty easy to miss really important sidequests, like to recruit the Killing Precept monk and Frosty Condor (I got that one but I had to replay about 4 hours). This reminded me of games like chrono trigger that this game is obviously inspired by, but this is something people do not remember fondly about those games. Basically every time the \"main quest\" flag gets updated you should make a hard save and then go to every location on the map and talk to everybody, or use a guide (but I was using guides a bit and still missed stuff, and there aren't many complete/good guides).\r\n\r\nAnother small grievance is that with the two big updates and the DLC, the power curve is now out of whack and you need to self-handicap or switch to extreme difficulty half way. The fan powers in the DLC especially are basically broken (though very hard to get before about two thirds of the way through), especially Immortal's Descent which makes all the boss battles a cakewalk. I'd leave it until right before the very late duel on the snowy mountain unless you want to feel like none of the epic battles are especially epic. The Elusive Swordplay technique in the Nanjiang arc is similarly absurd. If you're a completionist and you upgrade forging, tailoring, and your skills as you go along combat will be very boring by midgame. Combat is generally not so deep, but just enjoying being an overpowered Wuxia! \r\n\r\nSpeaking of which, as other people have noted, the way the game/story responds to your increasing power is super satisfying and well crafted. At the start of the game people are mocking you but you persist heroically. In the middle people are like \"We should be careful, I've heard this guy is strong\". And by the end everyone is like \"oh shit we about to get stomped\". It feels good. The levelling up is generally subtle until you get a few busted moves too early. If you refrain from using Red Moves, perhaps except for Tai Chi, until at least the Nanjiang arc, and refrain from the fan skills entirely, you should be fine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "内容丰富，制作精良，文案昂有古韵。是讲情怀的良心制作",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, On my second play through and i'm 70 hours in. LOTS of sneaky content and interactions that completely change events, paths, and endings. Honestly, I've been looking at a guide and some of the stuff would take me thousands of hours to figure out. \n\nI 100% recommend, and I would also advise to maybe refrain from following guides beyond where to find certain resources for your first play through. Going back through made me realize how many things I missed/ all the close calls I had.\n\nEdit: Now 100 hours in, chasing achievements and a max difficulty play through. Def a bit of grind but who would try to 100% an rpg with like 20 endings...  Still a lot of fun and some of the New Game+ Options are really fun to mess around with. The annoying thing is all the little decisions that give you different endings.. Miss one and forget to save before it and BOOM you need a whole new run or need to load an even older save before it to get back to it. If you ignore all side quests a run can be done in like 2-3 hours but to get the different endings you need to do some side quests and honestly idk which ones yet... Still fun though.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "incredible game. feels great to experience a normal wuxia story after reading so much xianxia with weird twists. highly recommend playing completely blind, there so much to miss and therefore find here, and no guide for seeing it all. i did not get either of the true endings.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was surprised at how big this game was. For $25, I overlooked the lack of polish, but I was not expecting to get so much content and side stories. The pixel art was beautiful, the gameplay was fun, and the stories were entertaining. It was a little hard to follow at times but overall a great game I can't wait to replay!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have only played one other cultivation game before and kinda got stuck partway into it with a lack of direction and understanding of what to try next.  So, admittedly, I was a bit hesitant.\n\nThis game though... I decided to try it out for a few mins and a couple hours later I looked at the clock to realize time had just disappeared.\n\nThis game is really well done.  The English translations are really good.  There is a lot of Wuxia terminology here that is a bit jarring if you haven't encountered that style before, but it's quite well done and if you can get into this type of Chinese fantasy than this game really delivers.  The HD-2D pixel art and stylization is really well done, especially when balanced against the more traditional artwork of the character portraits.  I like that the proportions of the characters are a bit more realistic (as opposed to Chibi).\nThe combat is quite well done, and can pose quite a challenge.  You really do have options available though, especially in how you develop your character.  There's a lot here, and it does have a very incremental stat building and improving system that gives you a lot of fine control over what direction you go.\n\nI haven't gotten far into the story, but it is really quite good so far and I'm super looking forward to playing more of this.",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "想来找找以前玩游戏的感觉, 但是陷入了练级刷怪跳过剧情, 过去的再也找不回来了",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "This game isn't categorically bad but certainly doesn't deserve overwhelmingly positive reviews imho.\n\nIn terms of game play the balancing is all over the place. At one point I suddenly went from needing to be careful where I explore and whom I challenge to being brutally overpowered. There are so many moves, but none of them matters. They all feel samey. The weapons feel samey. The characters feel samey. I've been autobattling half the game away. And I'm supposedly playing at Hard.\n\nIn terms of story, I *think* it could be kind of OK if it wasn't ruined by the terrible writing. The writing style & tone is simplistic, casual and sometimes plain broken, which clashes with the contemplative, solemn atmosphere the game is going for. Moreover the dialogue sometimes unexpectedly veers into needlessly lengthy and complicated passages.\n\nThe graphics are a pleasant Octopath Traveller lookalike and truly the game's strength. It's the visuals that hooked me to to this world. Its charm wholly depends on it. I have to mention that exploration felt great to me at first. The sheer ambition of the developer is commendable. Unfortunately the final result is too many half baked systems, quests, moves, items, characters, etc.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Too much of everything, way too much of everything, and most of the things just slows and disturbs the experience. \n\nWas It necessary to have 2 skill trees with +30 skills per character? With 10 levels per skill?? Most of these are like\"+1/2/3..% damage when atacking with a ketchup bottle wearing sandals\"\n\nAlso, using 10000 exp points for levels 2 skills?? Cant we turn It down a bit to use 10 and 13 instead of 10305 and 13856?? Were talking about 8 digit numbers in mid-late levels, dude i dont even know how to read some of them let alone feel the progress\n\nIts confusing for the sake of being complex, but doesnt really have any dept.\n\nIts not BORING perse, but does a good work making me lose the motivation to keep playing. I dont really feel like farming quests for that \"+3% when hitting pigs with a ladder\"\n\nAlso, the guys are handsome af, but im not gay, were are the asian cuties, almost no female characters :(",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The aesthetics are fantastic, the soundtrack is great, the characters are fun to talk to... but I just can't see myself enjoying it for one reason: the combat.\n\nCombat is very floaty and unrealistic and you get teleported into a little hexboard that breaks your immersion every time it starts, and all your attacks feel like they're hitting air rather than the NPCs. A game that did this genre better was Dragon Quest 8, where your character runs forward and physically chunks enemy NPCs for a quarter of their health, but with Wandering Sword the combat feels like you're thrown into a chess game that has nothing to do with the game as a whole. This is probably fun for some people... but I'm trying to role-play, so it feels way too meta.\n\nI can only imagine as the game goes on that NPCs will have 10,000 HP and I'll be hitting them after short dragon-ball Z-style animations for 9999 damage. I'm sorry, but it's just not my thing.\n\nTl;DR: The game lacks grit. It definitely has a fan-base, but I'm clearly not the target audience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was going to give this game a thumbs up because:\n+it starts off challenging and is engaging\n+the ancient Chinese philosophical beliefs and martial arts are great & inspiring\n+Some well-written party members\n\nHowever, I can't give this a thumbs up because:\n\n-DLC breaks the game, main character was one shotting everything on normal difficulty (by early mid game) which you cant change without starting a new game.\n-Drawn out and poor writing, several of the main villains aren't really introduced till late game\n-You need an actual guide/walk-through to not miss party members that are essential for good outcomes.\n-The game actively tries to make you miss content often, by telling you for instance to \"go rest\" when you actually need to go investigate more to get a good outcome.\n-it takes 100 hours to get all the party members, get a good text ending (with a background image) that means nothing.",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "A visually wonderful game let down by bad combat, a poor resource and skill system, and many QoL issues. \r\n\r\nThe combat - through the total 14 hours I played - never felt gratifying.  There's no 'unique' factor to any of the fights, they all feel the same just with bigger numbers each instance.  I never felt like I was achieving anything by spending more time fighting in unexplored areas because I can just walk past enemies to get loot. \r\n\r\nThe story was where I thought this would shine but it really never had me hooked at any point.  The characters you meet all seem lifeless outside of the main story line; and you never know which ones are going to stay in the party because you meet so many and never know which are worth investing skill points into, because they may just be absent during an important fight.\r\n\r\nExploration isn't as fun as it should be in a game with 'wandering' in the title.  Again, you can just walk past enemies in new areas to get loot, and all of the resources you can gather respawn quickly so outside of grabbing the main chest(s) there's not much point taking your time.\r\n\r\nThe upgrades, stats and inventory are by far my least favourite parts of this game.  Upgrades never feel meaningful outside of increasing numbers.  There was never a turning point where it felt like I unlocked a game-changing ability or feat, rather it felt like box ticking. The layout of the UI, even in combat, for these is bad.  Any time you hover your mouse to see details, it covers half of the inventory or action bar, with no option in game settings to reduce or customise it in any form.  The stats are rarely explained, and the tutorial log doesn't offer much insight.  I had to google a lot of the terms to see what I was pumping points into.  \r\n\r\nGold is practically useless outside of crafting, yet you're flooded with it from the start with a big welcoming chest in your inventory.  You'll come across way higher level items than you have equipped but with far worse stats for some reason.  XP gain doesn't even seem to do anything for some of the abilities.  I looked up what gathering and fishing XP does and the only thing I found was from the developers apologising in a community thread in 2023 because they apparently don't do anything.\r\n\r\nI'm pretty disappointed given the overall user reviews for this when the game - in my opinion - needs a lot of work done to scratch that RPG/adventure itch.  If this were a fraction of the price or still in early access I think I would still recommend it for future reference, because the developers clearly have a lot of talent, but - my two cents - they need to continue to work on these problems to be worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I would love to play this game, but sadly the entire interface is so painfully small that I cannot comfortably read things.\n\nNeither on Steam Deck, or a 55 inch tv. The scaling is just so out of proportion, any Interface designer would suffocate from his own vomit. That's how bad it is.\n\nYou get offered an option for the size of the dialogue's text which works great, but what use is that when everything else is more or less unreadable.\n\nIf they ever consider to fix that I'll buy this game in an instant.",
      "voted_up": false,
      "votes_helpful": 35
    },
    {
      "review": "A lot of cool and unique aspects to this game, and entertained me for a long time. But. The first, like, 10 hours is basically a tutorial where your character is a wet square of used toilet paper and you have some super master temporarily on your team to beat up your opponents. There's an open map, but if you go anywhere but where you're supposed to, the enemies are way too hard. Then, you don't really know where you can go. The game only tracks some of quests and story for you, but follow-up and lead-ins to quests are often not tracked. You could play close attention, take notes, but... So that might not be so bad, but then you miss out of the \"good ending\" because you missed some interaction you never knew was suppose to occur. That's what broke it for me. Game: 'Do you want to save guy's life?' Online: You must save guy's life for 10 other stories to occur. Me: Okay, 'save his life.' Game: He died anyway!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: Loved Gujian 3. This one didn't click. Annoying combat.\n\nLet's start with some general info.\nTranslation is OK, sometimes you can feel it's not really fluent but it's doable and understandable.\nThe way leveling works is a bit different from your standard jrpg but I think that's good. You need to do more than just run around and kill stuff. You need to actually find NPCs with certain skills (kind off) and persuade them to teach you so you can become stronger. It takes some time finding them because the map is decently large and there are lots of NPCs to talk to. And even if you find them, it's not sure you can persuade them yet.\n\nThe music is pretty good but I found it quite repetitive. Plenty of flute high notes. You kinda get ear fatigue after a while.\n\nThe graphic is....semi-pretty? It looks a lot like what Square Enix is doing lately in games like Octopath Traveller. Pixel 2.5D.\nFor me it's not really working out. I think it looks a bit cheap. But some parts are pretty.\n\nNow.. to my thumbs down;\nI don't know exactly why I don't like it, but I just dont. This game just won't click with me.\n\nI think one thing that bugs me is that stuff's so damn random and you can't prepare for it properly.\nYou could be walking in an area with decent leveled mobs and suddenly there's a cutscene and you enter a fight with some enemy that will greatly outlevel you and you have no chance of winning.\nAnd this happens soooo often and in so many stupid locations.\nAt least have the decency to autosave in those situations...\n\nAnother thing is that you can't count on your party being there in a fight, because some times (often in crucial fights)....and only God knows why I guess, cause the game sure won't tell me... the party won't or partially won't join in. Why? It's like thery're not there at all. SOME times. Not everytime.\nHello? You stood with me when we entered the area? Thank youuuuu~\nSo random...\n\nThe combat is also way too slow considering how little exp you get per battle. It makes grinding unfun. I don't usually mind grinding, but it needs to feel like it's worth the time, and I don't feel that here.\nYou could put the game in auto mode and speed it up... but, that feels weird? Why they make the game so slow they had to add that? They literally KNOW the grinding is too stale.\n\nIt's typically a game I should enjoy. A chinese medieval/fantasy/wuxia rpg sounds great on paper.\nAnd actually, have you played Gujian3? An a-rpg wuxia here on steam. I loved that one.\nBut sadly, Wandering Sword didn't do it for me.\n\n6/10",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}