{
  "positive": [
    {
      "review": "I’m usually the type of guy who stays in the shadows and never posts anything online, but this time I simply can’t move on without rating this game.\n\nBack in 2013, when I saw the massive hype surrounding The Last of Us, I was frustrated that I didn’t own a PS3. I ended up spoiling a lot of the experience for myself by watching playthroughs and let’s plays. As a PC-only gamer, I always dreamed of a proper PC port.\n\nYears passed, and when I heard that The Last of Us was finally coming to PC, I genuinely wondered if it would still be worth playing, considering how much I already knew about the story. Now, even if I’m more than a decade late to the party, I can finally answer that question.\n\nAnd oh my god, YES ! It was absolutely worth it.\n\nExperiencing the game firsthand completely blew me away. Even though I already knew most major story beats, I was still captivated from start to finish. It ended up becoming my favorite game of all time.\n\nThe Last of Us is a mature, emotionally rich narrative with exceptional pacing. Every piece of dialogue lands exactly as it should, some lines hit so hard you feel them in your spine. The writing is elevated even further by Gustavo Santaolalla’s beautiful, haunting soundtrack, which perfectly reinforces the game’s emotional moments.\n\nThe visuals are stunning as well. The overgrown, post-apocalyptic world nature reclaiming collapsed cities creates an atmosphere that is both eerie and breathtaking. It’s one of the most immersive worlds I’ve ever stepped into.\n\nGameplay-wise, the main combat loop is incredibly satisfying. Whether you approach encounters aggressively or with full stealth, the game supports both playstyles with a strong variety of weapons and tools.\n\nI played The Last of Us in both English and French, and the voice acting was exceptional in both versions. The performances truly carry the emotional weight of the story.\n\nAs for optimization : yes, the game had a rough launch on PC, but as of now it runs smoothly. I personally experienced zero bugs, zero frame drops nothing that took away from the experience.\n\nI enjoyed every single second of this game, and I can easily see myself replaying it in the future. When the final scene ended and the credits rolled, it hit me so hard that I just sat there for a moment, speechless.\n\nThis is one of those rare games that makes you wish you could erase your memory just to experience it again for the first time. It leaves you feeling empty in the best possible way, wondering if you’ll ever play something that hits you quite like this again.\n\nMy only regret is not playing it sooner but as they say, better late than never.\n\nI’m incredibly grateful to have finally experienced this masterpiece. \n\nThis is the kind of game that reminds me why I love gaming.\n\nThank you, Naughty Dog.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "I have gotten this game on sale. \r\n\r\nI  have played years ago on ps4. The PC version right now runs great with many settings and all the options we need. I would recommend it to firends.\r\n\r\nThe story aged well imo. \r\n\r\n9/10 story game",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Amazing game, definitely one of the most memorable gaming experience from my childhood. CRIMINAL OFFERING THE GAME W/OUT FACTIONS.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "First time playing this game!! it was truly an amazing story and the characters were written very well. I always wanted to play The Last Of Us which i waited many years to do. Now that i do more gaming on PC i finally got to experience this amazing game. Joel and Ellie are one of the greatest duo characters that I've ever seen and there journey is an intense ride. If there is any game you want to play at least once in your life this is the perfect choice!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Bad things happen and the world keeps turning.\n\nNo matter how hard things get we shouldn’t close ourselves to the good things in life. The last of us is a story about resilience and the persistence of goodness in a really bad situation. The story and characters are impressive and of course they are iconic by now in 2025.\n\nI hadn’t played this game for years because it was a Playstation exclusive. It is now one of my all-time favorites on Steam, it is a fantastic game.\n\nThis version is a great way to play it for the first time, although it has needed to be patched since release. As of 2025 it is a great PC port and this version has some cool collector’s edition, extra content.\n\nLast Of Us knocks it out of the park in all aspects, story, gameplay, graphics… everything is top notch. This game is on the same level as Red Dead Redemption 2, I enjoyed it just as much as RDR 2 and that is saying a lot.\n\nOne of the best games of all time and a genuinely moving story… I loved every minute of it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Last of Us Part I has over the years and through many updates, become a much easier and smoother experience on pc. If you've heard of the series and want to play through a pretty good narrative about a father and daughter odyssey through a post-apocalyptic world infested by a mycelium zombie virus with all the moral dilemmas that can generate then you're set. The problem i have with the game is down to gameplay, stealth and combat can feel incredibly shallow at times with uncommon exceptions. As a narratively focused game, it's a fun experience but outside of that it struggles to find an appeal for another playthrough. Keep that in mind if you're looking for value.\n\nWhile certain enemies do shake up the formula, most of the time what you'll be doing in stealth from hour 1 will be the same by the end. The action gameplay is very by the numbers and isn't very innovating either, while the limited ammo nature feels tense at times.. it's not really enough to shake things up. It's very railroaded on both of those fronts. It does feel like the game does try to make an attempt to add some depth but it's just not enough to keep the fun going by the end. TLOU:P1 ultimately feels like it really spins it's wheels by the end on the gameplay end, the narrative really is the thing that keeps you going.\n\nDo i think TLOU is a good game on the gameplay standpoint? Yeah i think it's a pretty solid experience but i don't think it's the rave hit game that everyone thinks it is, it clearly has weakness in it's gameplay. It feels trapped between three worlds, the action, the survival horror aspects of the game and the stealth and they don't particularly mesh that well at least in age. Other games have managed a better synergy, Alan Wake 2 as an example marries the pump shotgun action with that desperation of scrounging for ammo much better and functions better as a horror game than TLOU. And as a stealth game, it just is too shallow. Throw distraction, pick off enemy. Throw another. Pick off enemy. \n\nThe Narrative is good, it's maybe a little bit of a slow burn for the first 6 hours with the intro being the exception but it gives you a good glimpse into how dire the world is and the personalities of it's main characters. I had zero complaints with how the art is handled in this game, it's fantastic. It perfectly marries post-modern american architecture with the post-apocalyptic aesthetic. Nature taking back an increasingly distant past of what was modern civilization and you see a lot of that. It's very melancholic. I won't spoil the characters, the story or anything because it really is that special sauce that makes the game standout. I will however quickly interject that the TV Show really develops it a lot more and is generally a higher quality of story but in terms of immersion factor the game is solid.\n\nThe remaster itself is probably the best experience you're going to get out of the game, certain quality of life features and more fun nic-naks do add onto the base experience if you've ever played the original PS3 version. If it's worth £50? That's a lot more debatable. I think maybe at half price at around £25, it's a no brainer price. You'll enjoy your time but £50 is a tall order for what is essentially a 10-14 hour game. It's on your own definition and you'll have to decide the tiebreaker here. Ultimately you'll likely have a good time with this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, the jokes achievement is sorta bugged. 10/10 otherwise.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Although I've seen the storyline way back when the game was released, I haven't got a chance to play it myself until now, and the only thing I can say is.. from the very beginning, this game grabs you by the heart. The way the story was told is so devastatingly human, and everything that you go through in this game adds up to something overwhelming. Even though there is no clean resolution to the ending, it's exactly what it had to be, and it somehow feels complete. The story is more about the terrifying, beautiful things we would do for people we love, more than it is a post-apocalyptic one.. It leaves you sitting there, wondering what choices you would've made in Joel's place. It's rare for a game to stay with you this long after the credits roll, but this one lingers in a way that's hard to put into words.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I booted this game up on the 10th anniversary of the original PS3 release, there couldn't be a better way to relive this experience.\nNothing prepared me for what was coming then, and the remaster still holds up like fine wine.\nThe original release seemed to have gone mostly unnoticed on the old hardware - at least for the first few months until the PS4 remaster was available, which quietly gathered a passionate fanbase that is still alive and thriving.\nI miss the Factions multiplayer mode and desperately wish for it's most needed return or even a spiritual successor.\nI do think it's quite overrated - rereleases considered, but there is just nothing out there matching quite possibly Naughty Dog's best game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Last of Us is an incredible survival game with a gripping story, set in a beautifully detailed post-apocalyptic world. The background design is outstanding, with a strong sense of realism that makes every moment feel immersive. The scarcity of supplies adds real tension to survival, and the hunters are smart, often spotting you quickly, which keeps the gameplay challenging. The level of detail is phenomenal, but it can demand a lot of VRAM at high resolution. The narrative feels cinematic, drawing you in as if you're watching a movie. A must-play for fans of intense, story-driven games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun game amazing story and characters Naughty Dog always makes their characters so great and human. Gameplay wise also really fun def reccomend 10/10!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a 3rd time I bought the same game, and also I've lost count how many times I already played it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What else can be said about The Last of Us Part I that really hasn't been said already? It deserves every accolade it's gotten and all the praise it's been given. It's an essential title to any player of any caliber. Remastered made it better, in disregard to the HBO adaptation, must be experienced with a keyboard.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has been on my \"I should play through the whole game\" list for a long time, and I'm glad I finally finished it.\n\nI have to give this a 9 out of 10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "7th playthrough, first 6 on PS. \n\nSimply unmatched. One of the greatest games of all time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome! I knew the game was good, had high expectations in general and the game blew those out of the water. It was fun, emotional, beautifully crafted. Had issues with DLSS and DLAA with smearing with some stutters on a 5090, went to AMD FSR 4 and 9070XT and had no issues with FSR nor stutters. Other than that, game worked without any significant issues. Performance on both was exceptional at 4K, max settings without motion blur, film grain and I believe lens distortions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Graphics: ☑ Reality (On Ultra settings, this is unbeatable) ☐ Beautiful ☐ Good ☐ Decent ☐ Bad\n\nPerformance: ☑ Butter Smooth (Runs perfect on a good rig) ☐ Good ☐ Acceptable ☐ Potato PC might struggle\n\nStory: ☑ Masterpiece ☐ Good ☐ Average ☐ Bad\n\nThe Verdict: I just bought Part 2 immediately after the credits rolled. Naughty Dog created a world that feels terrifyingly real, and playing it with everything cranked to the max was immersive as hell.\n\nIf you have the PC for it, buy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[b]One of the best story games I have ever played[/b]\n\nI know that this game is a decade old, and by this point everyone has played it, heard about it or watched the series - but I'll still write the review. As a person who has watched the series, and knows most of the things that are going to happen - I can still not recommend this game enough. Stunning visuals, audio, writing, combat - everything just clicks.\n\nThe story hooks you within the first hour, and it never slows down. It's definitely an experience witnessing Joel starting to click with Ellie as time passes by, and the stuff they go through - complimented with some beautiful visuals along the way. Audio design as well, will literally give you goosebumps. The intro to the game is probably the best you will ever find as it's just too iconic.\n\nThe only thing that I kind-of disliked was some of the achievements, which felt like a chore at moments trying to find and pick up everything, but with it you also discovered some lore about the game.\n\n[b] Absolute cinema of a game - 10/10 recommend[/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Last of Us isn’t just a game.\nIt’s an emotional masterpiece, a story that breaks your heart into pieces only to carefully stitch it back together – just to break it again. 💔\nThe story of Joel and Ellie is unforgettable.\nFrom the very beginning, it pulls you into a post-apocalyptic world that’s broken, yet still full of small traces of humanity.\nEvery dialogue, every glance, and every moment of silence carries meaning.\nYou feel the characters grow, change, and form a deep bond that transcends survival itself.\n\nVisually, the remake is breathtaking – every detail, every shadow, every expression is perfectly crafted. The sound design and Gustavo Santaolalla’s haunting score create an atmosphere that stays with you long after you stop playing. 🎶\n\nThe gameplay remains faithful to the original but smoother and more immersive.\nCombat feels brutal, desperate, and raw – not like action, but like survival.\nEvery bullet counts, every move matters.\n\nThis game leaves a mark.\nIt’s not just about the infected or the apocalypse.\nIt’s about love, loss, desperation, and hope – about what it means to be human when the world has forgotten what humanity is.\n\nFor me, The Last of Us Part I is one of those rare games you never truly finish – because each time you replay it, you discover something new.\nRating - 11/10⭐\nPerfection in its rawest, most emotional form.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I remember back in 2013 when I lend the game from a guy I met at the skatepark. It was one of, if not the best videogame I played at the time. And I really gotta admit - this fresh look and PC Port really shine! \r\n\r\n10 / 10 would buy again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Last of Us Part 1 9/10\nStory 10/10\nGraphics 10/10\nGameplay 9/10\nOne of if not the best storys in a game ever, the graphics are great and most of the combat is decent enough the only thing that lets it down is some of the melee combat is abit dated but its obviously a 2013 remaster but what an amazing game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "TLoU is a beyond beautiful game. From the story, the characters, and the setting, it completely captivates the range of emotions our characters feel, and the scenery is insanely impressive and gorgeous. If you want to fell emotionally captivated by a game, this is it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I never played this game in it's original hayday but after the buzz of the HBO show, I decided to check it out. Man, I should've played this sooner. Amazing atmosphere, music, dialogue, story, cinema. Great game. The PC version has bugs and it runs hard on GPUs, but the story and game are superb. I'll deal with an occasional crash here or there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Perfection- runs amazing on steam deck, lots of replayability with new game+  and collectibles, audio design is gorgeous and the visuals are STUNNING. Character development is top tier, I love I love I love. ALSO the Left Behind add on is soooo much fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Firstly, you can't go wrong with campaign/story game right? I always played games such as ghost of tsushima/yotei. But, Holy the last of us has a really good story, and the vibe of the game really gave you that feeling of the world ending. So, i really recommend this game for people that want to experience a really good storyline!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my first playthrough on pc but my 4th time replaying it and it just gets better and better every time i replay this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest story games I have ever played, I would 100% recommend this game to ANYONE!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best story driven games of all times. Must play for everyone who calls themselves a gamer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLOU series was one of the biggest discovery for me as a gamer just a couple of years ago. Now to me it's one of best games ever made, period. One of a kind, really. If you love it you love it, till death parts you :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lets just say Ive played this game a couple of times, and it never gets old.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, very immersive if a little linear at times like most ported ps games. But great for replay value and incredible graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ps4 game make my pc turn into space heater at max settings +rep",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is pretty good, and I find myself actually caring about the characters.  This is as much an interactive story as it is a game.  Being a Dad myself, some of Joel's scenes really hit me in the feels.\r\n\r\nThe game seems really stingy with resources even on normal mode.  Inventory is miniscule. It's kind of annoying when I can't pick up a scissor or a rag because I already have 2. \r\n\r\nAll in all, I'm enjoying it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Altough I am experiencing some performance issues, this game is one of, if not the best story games I've ever played. It's filled with raw moments and amazing, smooth, yet simple combat. If you have some money left, you should definitely get this game on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just wow a story that everyone must play through with one of the best characters of all time, the pacing is amazing, combat and stealth is so good only beaten by its sequal but the story of the last of us is up there with one of the best of them. Such a dark world they build and the lines are blurred to right and wrong so well by the end you see the such a gritty and hard felt story of a father and duaghter in a dark world. 10/10 amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been my favourite game for over 6 years, no other game can compete ᖭ༏ᖫ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is THE BEST game I've played so far !!! so emotional at the end, took me a bit to get back to the real world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply an amazing story. Played it before on PS4, now coming back to it with TLOU2 released on PC. Definitely recommended for anyone who likes a good story and solid gameplay. Such an emotional rollercoaster to go through. 10/10 for me!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, but if you have a playstation 4 or 5, buy it there instead unless you have a monster PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played TLoU and TLoU2 on PS4 a couple years back, and this is my first time playing it on Steam. I will say that there are some aspects that are different... for some reason it takes me too long to get the third pull on the generators even though I time it perfectly, even though back on the PS4 it was first try every time, but I'm not complaining. I love this game too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐️⭐️⭐️⭐️⭐️ A Masterpiece of Storytelling and Emotional Impact\r\n\r\nThe Last of Us Part I stands as one of the most compelling and emotionally powerful narrative experiences in modern gaming. This remake elevates the already-iconic 2013 original with stunning visual fidelity, improved character animations, and tighter gameplay, all while preserving the heart of what made the story unforgettable.\r\n\r\nThe relationship between Joel and Ellie unfolds with remarkable depth and nuance, pulling you into a world devastated not just by a fungal outbreak, but by loss, moral ambiguity, and the desperate desire for connection. Combat and stealth feel smoother and more responsive than ever, and the richly detailed environments transform each location into a piece of storytelling on their own.\r\n\r\nThe upgraded graphics breathe new life into familiar scenes, making every expression, quiet moment, and emotional peak hit harder. Combined with an unforgettable score and impeccable voice acting, the remake not only honors the original—it enhances it.\r\n\r\nWhether you’re discovering it for the first time or returning to it years later, The Last of Us Part I is an essential experience, and one of the finest examples of storytelling in gaming history.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great cinematic game. I played after watching the TV shows but still an amazing experience. Highly recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story game, thrilling encounters, rewarding combat system with an interesting story narrative.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay: 9/10\nVisuals: 10/10\nMusic & Sound: 9/10\nStory: 9/10\nWorld & Atmosphere: 9/10\nPacing: 9/10\nReplayability: 6/10\nCreativity: 8/10\nTechnical Quality & Bugs: 10/10\nGrind: 10/10\n\nFinal rating: 90/100 (A- | Great)\n\nThis is a fantastic linear story game with an incredibly immersive post-apocalyptic atmosphere, detailed environments, excellent physics, and stunning emotional performances. The facial motion is perfected, especially in the final scene with Henry and Same. It feels like a playable move. The game also runs flawlessly, just a top-tier technical showcase from Naughty Dog. I personally don't think it is very replayable due to its linear structure. The enemy and then puzzle cycle, and the dark tone could get a little repetitive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the best single-player story games i've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the video game equivalent of a page turner, it's very hard to \"put down\" and end a session.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely amazing. I have never found a game that could actually combine story and gameplay at the same time well. Also, if you've watched the show, I think that playing the game is still a great idea.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is honestly one of the best games I have ever played, if not the best. I love the gameplay. I love Joels character and the dynamic with Ellie. The gameplay is really fun and entertaining. Only problem is it took a lot of memory to be able to run and I had several problems while running the game, I do believe that those problems were caused by my computer though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "!!! NB !!!\nIF YOU ARE RUNNING AN UNDERVOLT OR OVERCLOCK (even a very slight one), THIS CAN CAUSE A LOT OF INTERMITTENT CRASHING WITH THIS GAME! It is very picky about GPU power and even if none of the other stress-tests/games cause any issues with your UV/OC - if you encounter crashing, TRY DISABLING THE UV/OC FIRST! If it fixes the crashing (as it did for me), good, if not, re-apply your settings and keep searching.\n\nAbout the game:\n+ Has good writing and nice storytelling.\n+/- Very easy on PC with KB/Mouse setup, even on harder difficulty settings (I suggest starting from Hard and adjust when needed if you are accustomed to KB/Mouse with shooters).\n- Quite a few visual artifacts can be seen during certain sections of the game.\n- Has bugs when you rebind keys: you always have to have \"E\" bound as Use key, other keys simply will not register specific Use actions such as swapping melee weapons from the ground.\n- FOV is adjustable, but not enough - use Flawless Widescreen plugin to add extra FOV to the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is an absolutely stunning experience. The story is beautiful from start to finish, and the bond between Joel and Ellie is on another level, emotionally, believable, and incredibly well written. The world is detailed, the graphics look great, besides some artifacts I personally encountered, and the gameplay mechanics (especially upgrading weapons and gear) feel satisfying and polished.\n\nBUT…\n\nIf you're a MK player, lord have mercy. This game has some of the worst keybinds known to mankind. Even though the game “recommends” using a controller, I stuck with keyboard and mouse because I'm not about to spend 50 minutes trying to aim at an enemy with a joystick. Some controls make things take forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really great story and sometimes the graphics are just breathtaking.  You'll enjoy this one!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best story games I've ever played, i like the gameplay and combat amd everything in general is very detailed witch i like. But they don't gotta be remixing this game for over 10 years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This recommendation definitely comes with an asterisk. While the story, characters, graphics, audio and overall presentation are amazing, the gameplay can get pretty stale and repetitive. Luckily, the pacing is pretty balanced, so it ends before feeling like a chore. Also, this game is buggy. Visual artifacts, stutters, and glitches that require reloading checkpoints. Nothing game-breaking, but very much there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have never had a game in my life that made me cry in the prologue before or got me to care about characters so quickly. Writing is easily 10 out of 10, Im starting to see why everyone hated the second game lol. Easily in my top 10 for story alone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is everything it is cracked up to be. PC version ran great with zero crashes or major graphical glitching over 17hrs. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is incredibly good.\n\n The connection that I feel between Joel and Ellie as I go through the story is simply enchanting. They did a very good job of conveying those feelings to the players. The atmosphere, story and game mechanics are also amazing. \n\nThe only downside is that it is a little short. I got through the whole story in 13 and a half hours, and that without rushing. \n\nIt delivers an unforgettable mix of emotional storytelling, cinematic visuals, and intense gameplay\n\n9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "excellent game. one of my favourite game series from naughty dog. just recommend you have a good PC to play this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have comtemplated on buying this game for a few years, now I wish I could go back. It is the perfect blend of realism and fantasy out there. And there are ZOMBIES!!! This is possibly the best game I have ever played. I will and have recommended this game to others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good story with complex characters. Good variety of gameplay options for stealth and shooting. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watched this game like 3 times over on youtube as a kid, and I finally got around to playing it.\r\n\r\nAbsolutely phenomenal game. I would consider this a must-play, or at the very least a much-watch. I would recommend buying this on sale though, as it is a little pricey.\r\n\r\nAnd for anyone who experiences crashing when trying to load a save, I updated my drivers and verified my files, and that seemed to do the trick to fix it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um...Let's just say I've been playing this game since it's original release on PS3. Just play it. Stop reading reviews. Just play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relatability leads to understanding, understanding leads to sympathy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I waited to play The Last of Us Part I for quite a while. One of the reasons was because how broken this port was on launch. I did encounter a few freezes here and there and on one occasion my entire pc had to be rebooted. I was able to stay at a pretty consistent 60 fps following a reddit optimazation guide.\n\nThe game has really gorgeous visuals. Cutscenes are really high quality with character models of Ellie and Joel so detailed to the point where they look really lifelike. Combat is simple, yet effective. The guns feel good to use but, I wish the shotgun was stronger. The game has really good PS5 DualSense controller implementation which makes everything really immersive. I played on a custom difficulty with everything set to Survivor except from loot which I set to Hard. I don't love stealth and I had heard that with how scarce loot becomes on Survivor or above you are really incentivized to use stealth. If enemies are going to be more accurate, spot you quicker and more aggressive I want loot to deal with the situation without being forced to stealth. I got killed quite a few times, especially early on because of being reckless but, overall the Survivor difficulty felt pretty fair and not having listen mode made the game a lot more tense. I played at a slow pace, especially inbetween enemy encounters so I could loot as much as possible. I'd say the pacing of the game is pretty much perfect, there are enough interesting gameplay setpieces to keep you engaged. The weakest part of the game by far are the puzzles. There are like 3 different kinds of puzzles: Push a floating board made of wood to assist Ellie across water, Push a dumpster or similar objects to a ledge so you can jump it or find a ladder. The story is and how characters are written are the best part of the game, and several moments had me emotional even though I had watched someone play the game before and watched the show. It is definitely an experience that will stick with me for a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game makes you feel like, you are living inside the game. The design of every level is incredibly realistic. The story is amazing, character improvements are also well designed. I will definitely buy the 2nd game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game (original, remaster, and now the remake) every few years since it originally came out. It's gotta be one the best narrative driven games out there. I'm not even sure what else to say, it's one of the best games of all time and anyone who hasn't played it is missing out on a truly incredible expereince.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great content, great story, 100% enjoy this, game is worth every penny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For revolutionary gameplay and unbelievable amounts of story and emotion, this gem take the cake.\r\nStory- 10/10\r\nGraphics- 10/10\r\nGameplay- 10/10\r\n\r\nvery few games still hold up like this other than some outliers like, Dying light 1 and days gone to give a couple. always reccomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing story and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ive ever played for story and combat i havent played part 2 yet but this is a masterpeice ive also replayed this game about 15 times and would again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow, is this game something else. With this being my first experience into The Last Of Us' franchise, this has me HOOKED.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll give it a thumbs up. It is a masterclass in what it is. Walking simulator story teller. DO NOT PLAY THE LEFT BEHIND DLC (ruins the main story). Instead of binging a new Netflix miniseries, play this. Combat that is fun, variety of weapons and strategies to get through a zone. \"Every shot matters\". Good difficulty settings to adjust so you can make the game what you want it to be. A decent story that slightly tugs on heart strings, good environments, great soundscapes. Took some fine tuning and tweaking to get it to run right on PC, that's the way with all PS Ports though. I will be playing the Last of Us Part II and probably watching the HBO show.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not just an ordinary game.. It is an experience.. Each time I run the game I feel like I dive back into this magical side of the world, that each time after it ends, it gives you that feeling you get after you leave from your grandparents and you don't know when you will be seeing them again, being scared that you wont get the chance to do so.. Closing the last of us chapter is like closing a part of your soul.\r\n A true masterpiece, Balance on everything.. Story, combat (+ satisfaction you get from killing enemies), visuals, characters.. A true masterpiece.. You should be ashamed if you haven't played it yet.. I remember playing it on my ps3 in 2013.. Then I had finished it more than 10 times and I couldn't stop loving it.. 5 days ago I paid it a visit with my brand new computer.. And I have to tell you.. 1440p at 200 fps with all settings on.. I cannot describe you the experience.. Just know that in the first 2 minutes into the game I was in tears.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Juegazo, a pesar de lo antiguo sigue siendo un juegazo con una historia que te atrapa. Muy buena adaptacion a pc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bro this game is totally insane, when you play this game it feels like you watch a movie coz all the story lines and the characters feels alive. You will feel everything like emotionally, shattering interactive experience that will, in the very order, make you cuddle your dear ones. Best game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exactly the kind of single player, story-heavy game with great acting that I love!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game havent finshied yet but so far story is very good and the graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games ever made, with amazing stealth mechanics and incredible storytelling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game. great game. amazing game. hard to find game that match this quality",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Impossível não recomendar. Esperei muito, muito tempo pra jogar esse jogo. Assisti no YouTube quando era criança e não consegui jogar por não ter um PlayStation na época. Não me arrependo nem um pouco de ter comprado agora e finalmente poder aproveitar essa história, essa ambientação, a qualidade dos sons, tudo. Tudo nesse jogo é bom. Uma obra de arte.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute masterpiece of a game. Could the PC port of the game been better? Yes! But it’s not the end of the world. I do recommend getting it on sale because $60 is a little too much even for a 12 year old game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLOU Part I will be cemented within my mind for a long time. This game was absolutely incredible in many ways, most notably in the way it just nails such a deeply emotional and atmospheric narrative from the moment you first hit play to when the credits roll. This game is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They did a great job porting this over. I loved playing this and getting sucked into the story, then come to realize \"Holy crap\" so many hours have gone by already! Lol\nI will be do many runs through this like i did with the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks like a PC game, runs like a PS3 game.\n\nOf course the game is incredible, it is one of the greatest series ever created. Yes you should buy it. Unfortunately though, even after 2 years, this game has HORRIFIC loading screens. Genuinely, this game could load faster on a PS3 potentially.  I shouldn't have to wait 10 minutes to load chapter 1 after the prologue on an m.2 SSD. \n\nFrequent frame drops ~20 fps is very common, but its also very common to run at ~120 fps so.. I don't really know what to say to that. (7700X, 4070 Super)\n\nI do recommend this, especially if you have never played. Just know that this game struggles at times.\n\nEDIT:\n\nAs I've progressed through the game, all the issues I have listed above are GONE. This seems to be an early game issue within the QZ and the very brief outskirts.\n\nNow that I am much further in the game, I can say that I'm averaging around ~120 fps consistently on ultra. While it's inconvenient, it is a very small portion of the game that is affected, therefore, I take back my negativity and can comfortably recommend this game, with the note that you have to know that the frames get better within about 2 hours of playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely One of the best games I have ever played.\r\nI started on the PS3 played it again on the PS4 now I am enjoying it on PC!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing story and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite games of all time, given a phenomenal graphical boost. Looking forward to the day I have the system to run it in its maximum glory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most games are pretty simple. You jump on enemies, you die, you have to insert another quarter to continue. The Last of Us changed that.\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Obviously a masterpiece. The story is top-notch, of course, but I am equally blown away by the level of detail in every environment. This game has some of the best graphics I've ever seen, and the performance is pretty solid, too. I've only encountered one bug where the game froze and I had to force quit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is amazing even after watching the show first. However if you plan to play with a controller, be sure to find a community layout for it which removes the terrible deadzone they put in to the default layout.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Last of Us Part I isn’t just a remake — it’s a celebration of one of the greatest storytelling achievements in gaming. Naughty Dog has taken a beloved classic and elevated it into a breathtaking, emotionally charged experience that feels right at home in the modern generation.\r\n\r\nEvery detail, from Joel’s weary eyes to Ellie’s playful smirks, has been meticulously rebuilt with stunning next-gen fidelity. Expressions hit harder. The environments feel richer, more alive — nature reclaiming civilization in haunting, beautiful ways. Lighting and animation work together to make each scene more powerful than ever before.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2025 e alguém aqui ainda precisa de review para querer jogar esse jogo? Esse port infelizmente é meio podre e não vai rodar direito em computadores mais fracos, o que eu acho uma tremenda sacanagem com um jogo tão popular e aguardado para o PC, mas se sua máquina rodar esse game liso pode jogar dentro que é cinema demais isso aqui",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Znakomita przygoda od początku do końca. Świetnie poprowadzona fabuła, wyraziste postacie i dopracowana rozgrywka sprawiają, że trudno się oderwać. Całość doskonale oddaje klimat oryginału, a do gry chce się wracać, bo przez wiele godzin czuć w niej ducha filmowej serii.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great storyline and seemless gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After taking a couple of months to reflect on the game post-completion, I can confidently say it belongs in the S-tier alongside some of the best story-driven games ever made. The visuals are stunning, the voice acting is excellent, and the sound design and atmosphere are top-notch. The only area where it really falls short is the combat, which is still serviceable overall.\n\nNow for the negatives: the PC port is genuinely terrible. I first bought the game two years ago when I had a 6700 XT and assumed it would run fine at reasonable settings. Instead, I had random drops to 20 FPS that resolved after a few minutes, plus unexpected crashes. No other game—including Cyberpunk 2077 at launch—gave me issues like this. I ended up refunding it and moving on.\n\nAfter upgrading to a 7900 XTX, I decided to give it another shot, thinking maybe the old GPU was the problem. Unfortunately, I ran into the exact same performance drops and crashes. After hours of troubleshooting, I finally discovered that disabling half of my CPU cores in Task Manager fixed it; apparently the engine doesn’t like having too many cores available (I have 12).\n\nOnce I sorted that out, I was finally able to enjoy the game—and honestly, it was worth the hassle. It’s a short, tight 15-hour experience with a genuinely compelling story. Some people say the $30 sale price is too high for a 2013 title, but they overlook that this is essentially a remake built for the PS5, not just a port of the 2013 version. In my opinion, the game is absolutely worth $30—and arguably more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not a game, basically, you live there with them, you are with them, with their struggles, how hard and cruel the world would be....This is NOT a game, This is pure EMOTION!  ( cant wait to play part2)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beat the game on PS3 and PS4 and loved every second of it. To be able to come back and play in true 4k Ultra graphics is quite the treat. Game is amazing the show is dogshit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well, this game was really cool and made me think and had interesting concepts. I highly recommend this game. If I were to talk about the game, it is a game full of graphics and a story in the heart of a zombie apocalypse. The sad story of Joel's character may upset you, but I don't want to spoil it, but I can say that you are entrusted with a girl named Ellie, who you have to take to the hospital to complete a series of tasks, and along the way you will face many ups and downs, and the songs of the game, which are perfect, will drive you crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "whole game took me approx 16 hours to beat, game was a solid 7.9 out of 10, some of the scene's were repetitive, I got a little tired of sneaking through a city, to jump off a ledge, to see a bridge a little closer, to sneak through a city a second time, the store was great, the characters memorable, the tension palpable. I'm excited to play the second and see the conclusion to the story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, spent just 6 hours and hope I'll spend another 6+ hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game numerous of times,absolutely a masterpiece.Story rich,and takes you on a journey that takes unexpected turns!\nScripting 10/10\nVoice acting 10/10\nStory10/10\nCombat10/10\nEnjoyment10/10\nPlaythroughs 4\n\nI recommend it",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "VRAM issues over and over again and it wasn't my system. Even lowering the performance settings and starting in  safe mode.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "It's a beautiful game and well written.  But the conversion to PC did not add anything extra for keyboard-mouse control at all.  There's 100+ keys on my keyboard, I want to bind weapon/tool selection to them for each item!!!  But no, switching weapons/tools is extremely frustrating, rotating by clicking the same key, instead of assigning individual keys.  Same for reload/melee/throw -- the game doesn't let you assign different keys !!   I am dying over and over again in boss fights because of selection and keybind issues... not fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Good game, ruined by having to rebuild shaders almost every time you launch the game.  A process which takes at least 5-10 minutes.    \n\nMore annoyingly, it does so for the main game and the expansion *simultaneously*, slowing both down to a crawl (even though I'm nowhere near playing the expansion yet... complete waste of time and resources/power to rebuild those)\n\nMay sound like a small thing, but it's led me to quit the game at the menu at least four times now, when all I wanted to do was \"play a quick game of TLOU\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't accurately detect VRAM (shows 6 instead of the 10 available), resulting in locked texture streaming settings, resulting in terrible texture pop-in",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Another one of those modern ''games'' where it's mostly cliched, moronic cut scenes with grade Z dialogue (fortunately, you can skip the cinematics), and a very basic, barebone game in between (press W to walk from point A to point B to trigger next cinematic, press E to open a door to reach next cut scene, kill a handful of braindead enemies to reach next path that triggers next cinematics, etc.\n\nI don't know if the people reviewing these games have ever played games made before this garbage trend started, but there is no universe in which this is a good game or something worth purchasing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is a great game. The audio is absolutely shocking and ruins it completely on pc though\n\nI started off with headphones; tried every iteration of settings and its just awful. It ranged from the main character sounding like he was in a distant bath to everything sounding like it’s in a goddam bath. It’s appalling. \n\nI’m using monitor speakers that cost £2k+ and it’s borderline unplayable. How is it so bad?!?! And yes, I’ve tried everything. The best I can get is that if NPCs are talking and I look away from them, I can just about hear what they saying. I have yet to hear a clear word from the protagonist, on any setting\n\n…It’s like the second most important part of this game has been ignored. \n\nThis would have 5 stars if they’d made it playable. Hard no from me; it’s a joke this got released as is",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "look i love this game but every time i play the game and load my save the game ends up crashing and idk how to fix it if any one can help me that would be wonderful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely buggy game. Crashes every 2 hours or so. Manual saves disappear, autosaves are not working correctly. Ellie gets stuck sometimes and is not moving, then 1 hour later she teleports to me only to block me from moving, making me load previous save which misteriously disappeared. Should get my money back.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Poor port for PC, where the game can't maintain 120 fps at 2k res on Medium graphics settings.\r\nIt's unacceptable (for me at least) to play it on a very good PC (RTX4080 + I9-13900K) and the game fails to maintain that.\r\nThis game and GOW: Ragnarok have the same problem and while they are both one of the best games ever made, these 2 PC ports are not worth it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Garbage game, constant crashes and fcked my GPU for some reason.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "even with all the updates still runs jank on my laptop,I can run Ghost a teshima full speed ,RE2 remake max settings,sekiro no slow down...then this game has jitters and bounces on low?\r\nSucks because I love this IP played it on PS4 and had a blast,tried on PC and its...not good.\r\nIt says I've \"played\" 3 hours? thats me trying to get the game to run.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great story. However, this is undone by the absolutely terrible controls. Nothing about combat is intuitive. Reloading, swapping weapons is total clusterf***. Shame, I bet that otherwise the game is really good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "到底如何理解这部里程碑，十年前我在彼时的次世代游戏机上尝试去触碰，并没有随着阅历和年龄不同获得不同的体验。她还是位居荣耀堂，我只是多了一些着色器编译的等待耐心，既不好看，也不好玩。",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "maybe the story is incredible. maybe when it originally released it was groundbreaking. maybe I'm 10 years too late to care. but in my (probably wrong) opinion, it's just not that fun.... gameplay is extremely linear, limiting, and lackluster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the best graphics i've seen in my life.\r\n\r\nThe gameplay is terrible and it's just stealth section after stealth section.\r\n\r\nIt's very boring and i don't want to keep playing. \r\n\r\nThe story is probably as good as people say but it's not enough to make me like the gameplay.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Would like to play the game, but too many issues with FPS and game stutters. Would maybe consider the game for $5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for a ps3 game, i thought it'd run well on my 2050 but i have to downscale the game and use low settings just to scrape 30 fps... would only recommend if u play on a supercomputer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of these days I'll start having fun... hopefully?\nI've tried playing this so many times over the years, and the remake hasnt helped. Yeah sure its a great story but I'm just not having fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gratified plank carrier and box pusher simulator with occasional forced stealth and no guns & ammo on dead soldiers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The story is what I came here for but its so terribly bad... so lazily written that I spent the last half of the game busting out laughing at the cringingly dumb decisions of the entire cast. The only emotional engagement in the playthrough is 50/50 cringe and rage. Most of the entire game is a parade of manufactured suffering directly caused by the stupid choices of the main characters and everyone around them, to say nothing of the intentionally long action animations, every single one of which has an extra second or two on the back end just to make the player watch as the lithe energetic enemies take another bite of their face. Story; 0/5. Gameplay 1/5. To be fair the voice acting is top notch; 5/5, even if what they have to say isnt. Mocap is very good, 4/5. This is a game made by people who were much more concerned about meeting quarterly profit margins than making something fun for people to play. If the player characters ran like they were in a life threatening situation instead of walmart on black friday, if the entire story was burned and rewritten, if the guns were just guns and didnt have to be upgraded, and by god help us all, if they completely exorcised the motion blur (who ever asked for motion blur?) that might be a good game. This is not. So what if the graphics are good. So what if the scenery is pretty. About a half dozen times Ellie says out loud; \"gosh just look at how pretty those sky boxes are... arent you glad you bought this game player?\" I would have written none of this if the plot was worth sticking around for and it really really really isnt. Fifty shades of gray is a better story. All three Twilight movies are a better story. Its suppose to be a gritty apocalyptic horror epic but it reads like if the walking dead was written by a team who havent seen anything more horrifying than a deep cut on their finger. Im glad I didnt buy the second one and I wont.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "NEVER AND I MEAN NEVER GET THIS FUCKING GAME WATCH SOMEONE PLAY THIS THEN GO TO PART 2 REMASTERED AND BUY THAT I HAVE 50 CRASHES THIS GAME IS SHIT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't get the hype over this game... I got a couple of chapters into it and it still hasn't caught my attention or made me want to keep playing. It's just boring! Very very boring...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The amount of retarded fucking sway with the weapons makes we truly believe Joel is a weak pussy and maybe his dad should've fucking beat him for not being able to hold fucking weapon straight without a god damn upgrade",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never known a Game to be one of the best in both Game Play & Story But to be Spoiled by continuing Crashing!!!! I've not long brought this & played it around 6 times & around 7 times it's just closed taking me to the Steam page! This is what, 2yrs now on PC?? What the Hell. Come on Guys surly this is a Bug that can be put right?????",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Continually crashes, giant nightmare of a game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have above recommend specs but it runs like dog water on minimum",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Won't launch !!!!\nI do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "general lack of optimization.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "stealth stealth stealth and more stealth",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "does NOT run wel on steamdeck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "keeps freezing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kpop Is very Big Gai !!!\n\nND",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crushing frequently :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sinceramente, the last of us é um jogo incrivel, eu ja tinha finalizado o part 1, fiz 100% no part 2, agora rejogando o part 1 na versão mais atual (1.1.5.0), é uma experiência horrivel, o jogo é mais pesado que o part 2, crasha com frequência em partes aleatórias, o fps sem motivo nenhum cai para 20-25 em partes aleatórias do jogo, eu peguei mais fps em uma rx 580 do que em uma rx 6600\n\npelo preço que esta a venda hoje em dia, não vale a pena, vale a pena você esperar alguma promoção e ter muita paciência para jogar isso\n\ndoi muito em mim negativar esse jogo, pois é um jogo que eu amo de paixão, mas realmente não da, a situação do port para pc esta ridicula",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "......",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "VRAM issues over and over again and it wasn't my system. Even lowering the performance settings and starting in  safe mode.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "FIRST OFF!! This game is absolutely amazing! - it's one of my late childhood games that I played on the PS3! It still sticks to my mind like gorilla glue to this day (especially that nostalgic guitar riff and the Clickers..). \n\n(I bought this on PC because I mostly play games on here and wanted to farm the achievements lolz)\n\nBUT! This port is not good at all. It constantly stutters mainly when I move the camera/pov. I have tried SO many 'fixes', but nothing has worked. These stutters make me feel like I'm high ASF using an old slide film projector to play this damn game.\n\nI was hoping that these issues would have been fixed within the 2 years that it came out on steam wellll... i don't think i hoped enough :/\n\nI do love this game so much that I'll try whatever's possible to be able to play it smoothly. \n\nBut anyways, it's a really good game if you love zombies, apocalyptic themes, thriller & horror, gore, story-telling and adventuring! This game sparked my obsession with zombies! Although, I'd definitely purchase it on a different console if I were you ( ◜‿◝ )♡ \n\nWishing I got that damn refund, ugh (╯°□°）╯︵ ┻━┻",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It's a beautiful game and well written.  But the conversion to PC did not add anything extra for keyboard-mouse control at all.  There's 100+ keys on my keyboard, I want to bind weapon/tool selection to them for each item!!!  But no, switching weapons/tools is extremely frustrating, rotating by clicking the same key, instead of assigning individual keys.  Same for reload/melee/throw -- the game doesn't let you assign different keys !!   I am dying over and over again in boss fights because of selection and keybind issues... not fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Terrible fucking optimization. For such a fun game, they sure did ruin it by making the port ass. I constantly get stuttering in different areas of the game, and have very frequent crashes, all while on a 5090. Fix your terrible port of a game Naughty Dog.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "unless you have a passion for this game from earlier and just want to relive nostaliga, DONT buy it. not at all worth it. its much better to play it on console. the mechanics and optimalization on pc is horrible. keep your money.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Finally got round to playing 'one of the best games of all time', 10 years after release and having already watched the TV show that followed, I feel like I've somehow had the rug pulled out under my feet. While I can't honestly say that any part of the game is plainly bad, it's obvious that a massive internet hive-mind frenzy is responsible for the surge of awards, acclaim, and outright hysteria that follows the series to this day.\r\n\r\nIt has to be admitted that the remaster's graphics are incredible, although turning them up to their true maximums will tax the vast majority of PC's. Sadly despite this, the developers fall into the same trap as so many other groups, where a truly fantastic level of graphic fidelity ends up utterly ruined by constantly covering everything in fog, dust, smog, mist, blinding rain, or if those aren't good enough, just outright darkness to the point where everything is just shadows on shadows. The sections where actual light is allowed to get through do look excellent though, and are spaced throughout the game.\r\n\r\nSound design overall can only really be described as 'good'. All generally well crafted, but nothing particularly stands out as amazing, and music is sparse but well placed.\r\n\r\nThis is where the praise ends however. Gameplay overall is painfully linear, and even allowing for the fact it's technically 10 years old, it's just dull. There is literally nothing in here that hasn't been done before, and better, elsewhere. A particular annoyance was just how gamified the resources and ammo systems were, in an attempt to enforce an atmosphere of constantly scrabbling for kit and scavenging. By the end of the game Joel is carrying 3 different hand guns, a sawn-off shotty, a full size shotgun, a hunting rifle, a full size bow, an assault rifle, and a literal flamethrower (as well as 9 different grenades), but at no point can you ever carry more than around 30 or so bullets for any of them.\r\n\r\nSilent melee kills on dangerous enemies have to be done with crafted shivs which break upon use, and the same shivs are also used to unlock optional loot doors, while the parts to make them can't always be easily found; creating a choice between silent combat and getting more loot. Joel's been living as a smuggler in an apocalypse for years without ever finding a fixed blade knife? You can carry around up to 3 pre-made large health kits, but the small chocolate bars and snacks found lying around can only be eaten on the spot (because they're just a replacement for what would have been a glowing +5 health icon 10 years before). Of course you can't put those in your backpack, that's where you keep your 9 guns.\r\n\r\nFor a game that loves to bash you over the head with the idea of using stealth combat where necessary, the actual stealth mechanics sure are basic. The earlier complaint about how everything is dark means the game has to literally pop up a UI note to advise that you can leave your flashlight on when dealing with zombies, because it won't attract them (convenient). Enemies that are described as 'flanking' are really just pathfinding to your exact spot but being forced to detour to the side; if you sit and watch them they will always end up right next to you, even if they have ranged weapons that would let them sit back. Fire literal hand cannons within 20 feet of someone but move 10 feet to the side and you've 'vanished', so off they search again.\r\n\r\nAnd then finally, the plot. The most lauded story-based game in what must be nearly 20 years. The plot and storyline must be great, surely? Well, it's functional, and that's about it. Having seen so many franchises where public opinion is that 'the book/game was better than the TV show', here I have to say it feels reversed. The TV show took the bones of a plotline from this game, and made an actual story and characters out of it; the game is just a series of scenarios that Joel slowly grinds through, killing everything as he goes. There are no choices, this is a set-story and you aren't deviating an inch, if you spend too long hanging around an area a big hint will pop up for you to let you know which way to go. I particularly enjoyed the constant running joke of Joel finding and keeping various maps for each area, as though you actually need to navigate.\r\n\r\nThe characterisation of both Joel and Ellie seems almost deliberately vague, they're both intended as Mary-Sues, and I suspect this is why the show had so many negative responses, because any actor that's not 'you' as Joel, and your own real or imaginary child as Ellie is never going to live up. Joel could be literally any masculine-coded American middle-aged male you care to think of. His backstory is that he used to have a daughter. His personality traits are that he used to have a daughter, and he shoots things. No friends, no beliefs, no known affiliations (alright, one brother, estranged) or life motivations. Even with his 'partner' Tess it's not clear if he even has any attachment to her at all beyond her usefulness as a smuggling accomplice.\r\n\r\nEllie is arguably even worse, despite the fact that the entire game is about her. She essentially pops fully formed into the world at 14 years old, you are given literally no backstory about her whatsoever until the very end of the game via a couple of diary entries, and 3 sentences of dialogue. Her personality is to be unnaturally pleasant and cheerful even for a regular 14 year old girl, let alone one constantly travelling and being attacked by zombies and bandits in an apocalyptic nightmare. She will occasionally raise her voice slightly and curse in the sort of genteel manner that might offend a priest, just to remind you she is in fact supposed to be a teenage girl going through a severe PTSD-inducing traumatic life; but only briefly before returning to her usual state of socially pleasant optimism. Both characters show no signs of change or growth until key plot moments where they are required to, whereupon they suddenly change their minds. Joel in particular spends the entire first half of the game trying to palm Ellie off until the precise moment he's able to; whereupon he immediately becomes a surrogate father and doggedly refuses to let her out of his sight. Ellie chafes at the idea of anyone telling her what to do, or treating her like the child she actually is, but accepts her being smuggled to the Fireflies and out of the safety of the QZ without so much as a murmur, if not actively assisting this despite how much danger it puts her in.\r\n\r\nThe plot itself is as basic as can be, leveraging the background of the scenario (zombies, yo) as justification for a lack of any explanatory detail whatsoever. FEDRA is bad, they have no interest in a cure,  would kill Ellie on sight, and only care about maintaining dictatorial control. You know this because you are told so by a Firefly (rebel group working against FEDRA). No further arguments, no other evidence or justification, you never even speak to a FEDRA aligned character who has a name to present an opposing opinion. Joel as the PC is initially motivated only by money / supplies, and takes the job of smuggling Ellie without even knowing why she is important; he could quite literally be trafficking a 14 year old sex slave and doesn't question it. Yet contrarily, he also appears to be the only person who has any issue with killing Ellie in the final act. It's just accepted that although a few people wring their hands for a while, ultimately the entire Firefly group goes along with murdering a child, to the point that almost the entire Firefly population dies at Joel's hands trying to stop him.\r\n\r\nOverall, I wonder if I'd been able to play this when it first came out, I may have felt less critical to it, but without nostalgia goggles on, this feels like a case of Playstation fans experiencing heavy buyers remorse and tribal bias, resulting in an internet group-think that decided a 7/10 game is somehow an 11/10,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game itself is good (though very overrated in my opinion) but this port is one of the worst ive seen, and thats after all the updates I can't imagine before. It just doesn't look good enough to run as bad as it does. Part 2 is better in almost every way, the port is miles ahead of this one as well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game, ruined by having to rebuild shaders almost every time you launch the game.  A process which takes at least 5-10 minutes.    \n\nMore annoyingly, it does so for the main game and the expansion *simultaneously*, slowing both down to a crawl (even though I'm nowhere near playing the expansion yet... complete waste of time and resources/power to rebuild those)\n\nMay sound like a small thing, but it's led me to quit the game at the menu at least four times now, when all I wanted to do was \"play a quick game of TLOU\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't accurately detect VRAM (shows 6 instead of the 10 available), resulting in locked texture streaming settings, resulting in terrible texture pop-in",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Another one of those modern ''games'' where it's mostly cliched, moronic cut scenes with grade Z dialogue (fortunately, you can skip the cinematics), and a very basic, barebone game in between (press W to walk from point A to point B to trigger next cinematic, press E to open a door to reach next cut scene, kill a handful of braindead enemies to reach next path that triggers next cinematics, etc.\n\nI don't know if the people reviewing these games have ever played games made before this garbage trend started, but there is no universe in which this is a good game or something worth purchasing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is a great game. The audio is absolutely shocking and ruins it completely on pc though\n\nI started off with headphones; tried every iteration of settings and its just awful. It ranged from the main character sounding like he was in a distant bath to everything sounding like it’s in a goddam bath. It’s appalling. \n\nI’m using monitor speakers that cost £2k+ and it’s borderline unplayable. How is it so bad?!?! And yes, I’ve tried everything. The best I can get is that if NPCs are talking and I look away from them, I can just about hear what they saying. I have yet to hear a clear word from the protagonist, on any setting\n\n…It’s like the second most important part of this game has been ignored. \n\nThis would have 5 stars if they’d made it playable. Hard no from me; it’s a joke this got released as is",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "look i love this game but every time i play the game and load my save the game ends up crashing and idk how to fix it if any one can help me that would be wonderful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely buggy game. Crashes every 2 hours or so. Manual saves disappear, autosaves are not working correctly. Ellie gets stuck sometimes and is not moving, then 1 hour later she teleports to me only to block me from moving, making me load previous save which misteriously disappeared. Should get my money back.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Poor port for PC, where the game can't maintain 120 fps at 2k res on Medium graphics settings.\r\nIt's unacceptable (for me at least) to play it on a very good PC (RTX4080 + I9-13900K) and the game fails to maintain that.\r\nThis game and GOW: Ragnarok have the same problem and while they are both one of the best games ever made, these 2 PC ports are not worth it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Garbage game, constant crashes and fcked my GPU for some reason.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "even with all the updates still runs jank on my laptop,I can run Ghost a teshima full speed ,RE2 remake max settings,sekiro no slow down...then this game has jitters and bounces on low?\r\nSucks because I love this IP played it on PS4 and had a blast,tried on PC and its...not good.\r\nIt says I've \"played\" 3 hours? thats me trying to get the game to run.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great story. However, this is undone by the absolutely terrible controls. Nothing about combat is intuitive. Reloading, swapping weapons is total clusterf***. Shame, I bet that otherwise the game is really good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "到底如何理解这部里程碑，十年前我在彼时的次世代游戏机上尝试去触碰，并没有随着阅历和年龄不同获得不同的体验。她还是位居荣耀堂，我只是多了一些着色器编译的等待耐心，既不好看，也不好玩。",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "maybe the story is incredible. maybe when it originally released it was groundbreaking. maybe I'm 10 years too late to care. but in my (probably wrong) opinion, it's just not that fun.... gameplay is extremely linear, limiting, and lackluster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the best graphics i've seen in my life.\r\n\r\nThe gameplay is terrible and it's just stealth section after stealth section.\r\n\r\nIt's very boring and i don't want to keep playing. \r\n\r\nThe story is probably as good as people say but it's not enough to make me like the gameplay.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Would like to play the game, but too many issues with FPS and game stutters. Would maybe consider the game for $5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for a ps3 game, i thought it'd run well on my 2050 but i have to downscale the game and use low settings just to scrape 30 fps... would only recommend if u play on a supercomputer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of these days I'll start having fun... hopefully?\nI've tried playing this so many times over the years, and the remake hasnt helped. Yeah sure its a great story but I'm just not having fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gratified plank carrier and box pusher simulator with occasional forced stealth and no guns & ammo on dead soldiers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The story is what I came here for but its so terribly bad... so lazily written that I spent the last half of the game busting out laughing at the cringingly dumb decisions of the entire cast. The only emotional engagement in the playthrough is 50/50 cringe and rage. Most of the entire game is a parade of manufactured suffering directly caused by the stupid choices of the main characters and everyone around them, to say nothing of the intentionally long action animations, every single one of which has an extra second or two on the back end just to make the player watch as the lithe energetic enemies take another bite of their face. Story; 0/5. Gameplay 1/5. To be fair the voice acting is top notch; 5/5, even if what they have to say isnt. Mocap is very good, 4/5. This is a game made by people who were much more concerned about meeting quarterly profit margins than making something fun for people to play. If the player characters ran like they were in a life threatening situation instead of walmart on black friday, if the entire story was burned and rewritten, if the guns were just guns and didnt have to be upgraded, and by god help us all, if they completely exorcised the motion blur (who ever asked for motion blur?) that might be a good game. This is not. So what if the graphics are good. So what if the scenery is pretty. About a half dozen times Ellie says out loud; \"gosh just look at how pretty those sky boxes are... arent you glad you bought this game player?\" I would have written none of this if the plot was worth sticking around for and it really really really isnt. Fifty shades of gray is a better story. All three Twilight movies are a better story. Its suppose to be a gritty apocalyptic horror epic but it reads like if the walking dead was written by a team who havent seen anything more horrifying than a deep cut on their finger. Im glad I didnt buy the second one and I wont.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "NEVER AND I MEAN NEVER GET THIS FUCKING GAME WATCH SOMEONE PLAY THIS THEN GO TO PART 2 REMASTERED AND BUY THAT I HAVE 50 CRASHES THIS GAME IS SHIT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't get the hype over this game... I got a couple of chapters into it and it still hasn't caught my attention or made me want to keep playing. It's just boring! Very very boring...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The amount of retarded fucking sway with the weapons makes we truly believe Joel is a weak pussy and maybe his dad should've fucking beat him for not being able to hold fucking weapon straight without a god damn upgrade",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Never known a Game to be one of the best in both Game Play & Story But to be Spoiled by continuing Crashing!!!! I've not long brought this & played it around 6 times & around 7 times it's just closed taking me to the Steam page! This is what, 2yrs now on PC?? What the Hell. Come on Guys surly this is a Bug that can be put right?????",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Continually crashes, giant nightmare of a game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have above recommend specs but it runs like dog water on minimum",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Won't launch !!!!\nI do not recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "general lack of optimization.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "stealth stealth stealth and more stealth",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "does NOT run wel on steamdeck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "keeps freezing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Kpop Is very Big Gai !!!\n\nND",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crushing frequently :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sinceramente, the last of us é um jogo incrivel, eu ja tinha finalizado o part 1, fiz 100% no part 2, agora rejogando o part 1 na versão mais atual (1.1.5.0), é uma experiência horrivel, o jogo é mais pesado que o part 2, crasha com frequência em partes aleatórias, o fps sem motivo nenhum cai para 20-25 em partes aleatórias do jogo, eu peguei mais fps em uma rx 580 do que em uma rx 6600\n\npelo preço que esta a venda hoje em dia, não vale a pena, vale a pena você esperar alguma promoção e ter muita paciência para jogar isso\n\ndoi muito em mim negativar esse jogo, pois é um jogo que eu amo de paixão, mas realmente não da, a situação do port para pc esta ridicula",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "......",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "VRAM issues over and over again and it wasn't my system. Even lowering the performance settings and starting in  safe mode.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "FIRST OFF!! This game is absolutely amazing! - it's one of my late childhood games that I played on the PS3! It still sticks to my mind like gorilla glue to this day (especially that nostalgic guitar riff and the Clickers..). \n\n(I bought this on PC because I mostly play games on here and wanted to farm the achievements lolz)\n\nBUT! This port is not good at all. It constantly stutters mainly when I move the camera/pov. I have tried SO many 'fixes', but nothing has worked. These stutters make me feel like I'm high ASF using an old slide film projector to play this damn game.\n\nI was hoping that these issues would have been fixed within the 2 years that it came out on steam wellll... i don't think i hoped enough :/\n\nI do love this game so much that I'll try whatever's possible to be able to play it smoothly. \n\nBut anyways, it's a really good game if you love zombies, apocalyptic themes, thriller & horror, gore, story-telling and adventuring! This game sparked my obsession with zombies! Although, I'd definitely purchase it on a different console if I were you ( ◜‿◝ )♡ \n\nWishing I got that damn refund, ugh (╯°□°）╯︵ ┻━┻",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It's a beautiful game and well written.  But the conversion to PC did not add anything extra for keyboard-mouse control at all.  There's 100+ keys on my keyboard, I want to bind weapon/tool selection to them for each item!!!  But no, switching weapons/tools is extremely frustrating, rotating by clicking the same key, instead of assigning individual keys.  Same for reload/melee/throw -- the game doesn't let you assign different keys !!   I am dying over and over again in boss fights because of selection and keybind issues... not fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Terrible fucking optimization. For such a fun game, they sure did ruin it by making the port ass. I constantly get stuttering in different areas of the game, and have very frequent crashes, all while on a 5090. Fix your terrible port of a game Naughty Dog.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "unless you have a passion for this game from earlier and just want to relive nostaliga, DONT buy it. not at all worth it. its much better to play it on console. the mechanics and optimalization on pc is horrible. keep your money.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Finally got round to playing 'one of the best games of all time', 10 years after release and having already watched the TV show that followed, I feel like I've somehow had the rug pulled out under my feet. While I can't honestly say that any part of the game is plainly bad, it's obvious that a massive internet hive-mind frenzy is responsible for the surge of awards, acclaim, and outright hysteria that follows the series to this day.\r\n\r\nIt has to be admitted that the remaster's graphics are incredible, although turning them up to their true maximums will tax the vast majority of PC's. Sadly despite this, the developers fall into the same trap as so many other groups, where a truly fantastic level of graphic fidelity ends up utterly ruined by constantly covering everything in fog, dust, smog, mist, blinding rain, or if those aren't good enough, just outright darkness to the point where everything is just shadows on shadows. The sections where actual light is allowed to get through do look excellent though, and are spaced throughout the game.\r\n\r\nSound design overall can only really be described as 'good'. All generally well crafted, but nothing particularly stands out as amazing, and music is sparse but well placed.\r\n\r\nThis is where the praise ends however. Gameplay overall is painfully linear, and even allowing for the fact it's technically 10 years old, it's just dull. There is literally nothing in here that hasn't been done before, and better, elsewhere. A particular annoyance was just how gamified the resources and ammo systems were, in an attempt to enforce an atmosphere of constantly scrabbling for kit and scavenging. By the end of the game Joel is carrying 3 different hand guns, a sawn-off shotty, a full size shotgun, a hunting rifle, a full size bow, an assault rifle, and a literal flamethrower (as well as 9 different grenades), but at no point can you ever carry more than around 30 or so bullets for any of them.\r\n\r\nSilent melee kills on dangerous enemies have to be done with crafted shivs which break upon use, and the same shivs are also used to unlock optional loot doors, while the parts to make them can't always be easily found; creating a choice between silent combat and getting more loot. Joel's been living as a smuggler in an apocalypse for years without ever finding a fixed blade knife? You can carry around up to 3 pre-made large health kits, but the small chocolate bars and snacks found lying around can only be eaten on the spot (because they're just a replacement for what would have been a glowing +5 health icon 10 years before). Of course you can't put those in your backpack, that's where you keep your 9 guns.\r\n\r\nFor a game that loves to bash you over the head with the idea of using stealth combat where necessary, the actual stealth mechanics sure are basic. The earlier complaint about how everything is dark means the game has to literally pop up a UI note to advise that you can leave your flashlight on when dealing with zombies, because it won't attract them (convenient). Enemies that are described as 'flanking' are really just pathfinding to your exact spot but being forced to detour to the side; if you sit and watch them they will always end up right next to you, even if they have ranged weapons that would let them sit back. Fire literal hand cannons within 20 feet of someone but move 10 feet to the side and you've 'vanished', so off they search again.\r\n\r\nAnd then finally, the plot. The most lauded story-based game in what must be nearly 20 years. The plot and storyline must be great, surely? Well, it's functional, and that's about it. Having seen so many franchises where public opinion is that 'the book/game was better than the TV show', here I have to say it feels reversed. The TV show took the bones of a plotline from this game, and made an actual story and characters out of it; the game is just a series of scenarios that Joel slowly grinds through, killing everything as he goes. There are no choices, this is a set-story and you aren't deviating an inch, if you spend too long hanging around an area a big hint will pop up for you to let you know which way to go. I particularly enjoyed the constant running joke of Joel finding and keeping various maps for each area, as though you actually need to navigate.\r\n\r\nThe characterisation of both Joel and Ellie seems almost deliberately vague, they're both intended as Mary-Sues, and I suspect this is why the show had so many negative responses, because any actor that's not 'you' as Joel, and your own real or imaginary child as Ellie is never going to live up. Joel could be literally any masculine-coded American middle-aged male you care to think of. His backstory is that he used to have a daughter. His personality traits are that he used to have a daughter, and he shoots things. No friends, no beliefs, no known affiliations (alright, one brother, estranged) or life motivations. Even with his 'partner' Tess it's not clear if he even has any attachment to her at all beyond her usefulness as a smuggling accomplice.\r\n\r\nEllie is arguably even worse, despite the fact that the entire game is about her. She essentially pops fully formed into the world at 14 years old, you are given literally no backstory about her whatsoever until the very end of the game via a couple of diary entries, and 3 sentences of dialogue. Her personality is to be unnaturally pleasant and cheerful even for a regular 14 year old girl, let alone one constantly travelling and being attacked by zombies and bandits in an apocalyptic nightmare. She will occasionally raise her voice slightly and curse in the sort of genteel manner that might offend a priest, just to remind you she is in fact supposed to be a teenage girl going through a severe PTSD-inducing traumatic life; but only briefly before returning to her usual state of socially pleasant optimism. Both characters show no signs of change or growth until key plot moments where they are required to, whereupon they suddenly change their minds. Joel in particular spends the entire first half of the game trying to palm Ellie off until the precise moment he's able to; whereupon he immediately becomes a surrogate father and doggedly refuses to let her out of his sight. Ellie chafes at the idea of anyone telling her what to do, or treating her like the child she actually is, but accepts her being smuggled to the Fireflies and out of the safety of the QZ without so much as a murmur, if not actively assisting this despite how much danger it puts her in.\r\n\r\nThe plot itself is as basic as can be, leveraging the background of the scenario (zombies, yo) as justification for a lack of any explanatory detail whatsoever. FEDRA is bad, they have no interest in a cure,  would kill Ellie on sight, and only care about maintaining dictatorial control. You know this because you are told so by a Firefly (rebel group working against FEDRA). No further arguments, no other evidence or justification, you never even speak to a FEDRA aligned character who has a name to present an opposing opinion. Joel as the PC is initially motivated only by money / supplies, and takes the job of smuggling Ellie without even knowing why she is important; he could quite literally be trafficking a 14 year old sex slave and doesn't question it. Yet contrarily, he also appears to be the only person who has any issue with killing Ellie in the final act. It's just accepted that although a few people wring their hands for a while, ultimately the entire Firefly group goes along with murdering a child, to the point that almost the entire Firefly population dies at Joel's hands trying to stop him.\r\n\r\nOverall, I wonder if I'd been able to play this when it first came out, I may have felt less critical to it, but without nostalgia goggles on, this feels like a case of Playstation fans experiencing heavy buyers remorse and tribal bias, resulting in an internet group-think that decided a 7/10 game is somehow an 11/10,",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game itself is good (though very overrated in my opinion) but this port is one of the worst ive seen, and thats after all the updates I can't imagine before. It just doesn't look good enough to run as bad as it does. Part 2 is better in almost every way, the port is miles ahead of this one as well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game, ruined by having to rebuild shaders almost every time you launch the game.  A process which takes at least 5-10 minutes.    \n\nMore annoyingly, it does so for the main game and the expansion *simultaneously*, slowing both down to a crawl (even though I'm nowhere near playing the expansion yet... complete waste of time and resources/power to rebuild those)\n\nMay sound like a small thing, but it's led me to quit the game at the menu at least four times now, when all I wanted to do was \"play a quick game of TLOU\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't accurately detect VRAM (shows 6 instead of the 10 available), resulting in locked texture streaming settings, resulting in terrible texture pop-in",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Another one of those modern ''games'' where it's mostly cliched, moronic cut scenes with grade Z dialogue (fortunately, you can skip the cinematics), and a very basic, barebone game in between (press W to walk from point A to point B to trigger next cinematic, press E to open a door to reach next cut scene, kill a handful of braindead enemies to reach next path that triggers next cinematics, etc.\n\nI don't know if the people reviewing these games have ever played games made before this garbage trend started, but there is no universe in which this is a good game or something worth purchasing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is a great game. The audio is absolutely shocking and ruins it completely on pc though\n\nI started off with headphones; tried every iteration of settings and its just awful. It ranged from the main character sounding like he was in a distant bath to everything sounding like it’s in a goddam bath. It’s appalling. \n\nI’m using monitor speakers that cost £2k+ and it’s borderline unplayable. How is it so bad?!?! And yes, I’ve tried everything. The best I can get is that if NPCs are talking and I look away from them, I can just about hear what they saying. I have yet to hear a clear word from the protagonist, on any setting\n\n…It’s like the second most important part of this game has been ignored. \n\nThis would have 5 stars if they’d made it playable. Hard no from me; it’s a joke this got released as is",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "look i love this game but every time i play the game and load my save the game ends up crashing and idk how to fix it if any one can help me that would be wonderful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely buggy game. Crashes every 2 hours or so. Manual saves disappear, autosaves are not working correctly. Ellie gets stuck sometimes and is not moving, then 1 hour later she teleports to me only to block me from moving, making me load previous save which misteriously disappeared. Should get my money back.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Poor port for PC, where the game can't maintain 120 fps at 2k res on Medium graphics settings.\r\nIt's unacceptable (for me at least) to play it on a very good PC (RTX4080 + I9-13900K) and the game fails to maintain that.\r\nThis game and GOW: Ragnarok have the same problem and while they are both one of the best games ever made, these 2 PC ports are not worth it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Garbage game, constant crashes and fcked my GPU for some reason.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "even with all the updates still runs jank on my laptop,I can run Ghost a teshima full speed ,RE2 remake max settings,sekiro no slow down...then this game has jitters and bounces on low?\r\nSucks because I love this IP played it on PS4 and had a blast,tried on PC and its...not good.\r\nIt says I've \"played\" 3 hours? thats me trying to get the game to run.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great story. However, this is undone by the absolutely terrible controls. Nothing about combat is intuitive. Reloading, swapping weapons is total clusterf***. Shame, I bet that otherwise the game is really good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "到底如何理解这部里程碑，十年前我在彼时的次世代游戏机上尝试去触碰，并没有随着阅历和年龄不同获得不同的体验。她还是位居荣耀堂，我只是多了一些着色器编译的等待耐心，既不好看，也不好玩。",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "maybe the story is incredible. maybe when it originally released it was groundbreaking. maybe I'm 10 years too late to care. but in my (probably wrong) opinion, it's just not that fun.... gameplay is extremely linear, limiting, and lackluster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the best graphics i've seen in my life.\r\n\r\nThe gameplay is terrible and it's just stealth section after stealth section.\r\n\r\nIt's very boring and i don't want to keep playing. \r\n\r\nThe story is probably as good as people say but it's not enough to make me like the gameplay.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Would like to play the game, but too many issues with FPS and game stutters. Would maybe consider the game for $5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for a ps3 game, i thought it'd run well on my 2050 but i have to downscale the game and use low settings just to scrape 30 fps... would only recommend if u play on a supercomputer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of these days I'll start having fun... hopefully?\nI've tried playing this so many times over the years, and the remake hasnt helped. Yeah sure its a great story but I'm just not having fun.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}