{
  "positive": [
    {
      "review": "if everyone who plays gets as addicted to the giant mech as i have, we are in trouble! im not kidding, the upstanding human beings that play this game run the risk of getting blown up! i mean like, what if someone loved this game so much that they tried building a mech on their own!!?? it would totally blow up! i mean like, really. what if all of those guns and bombs where defective and they blew up? that person would get hurt! and what about all of their friends?? they would have to stop playing games and go make \"get well soon\" cards to send to their friend in the hospital that got blown up by the homemade mech! and think about what would happen if this happened to a LOT of people!!?? THERE WOULD SOON BE NO SANE PEOPLE PLAYING VIDEOGAMES LEFT ON THE PLANET!!! THE HUMAN RACE WOULD BE DOOMED!!!\r\n\r\n10/10 would highly recommend this game!",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "Masterpiece, make sure you play 3 playthroughs for all three endings, its totally worth it.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "Yo, I knew this game was awesome but I never expected it to be THIS GOOD...\nI unlocked all 3 endings, meaning I finished the game 3 times btw.\nI also consider myself very critical but also extremely fair and for me this was a PERFECT GAME!\n\nClearly a\n[h1]10/10[/h1]\nexperience. For me this is one of the best single-player games ever made!\nGhost of Tsushima is still my personal number 1.\nPlaces 2–10 aren’t ranked, but yeah… I love Ghost of Tsushima THAT much 😁.\n[b]Armored Core 6 definitely made it into my top 10 of all time now.[/b]\n\n(For reference, here’s what “peak quality and experience” means to me: Returnal, Hi-Fi Rush, Sea of Stars, Ghostrunner 1+2, Furi, Metaphor: ReFantazio, Monster Hunter World)\n\n[h1]GAMEPLAY 10/10[/h1]\nAbsolutely GOATed. Addictive gameplay loop, insanely satisfying button presses, simply MASTERCLASS!\n\n[h1]STORY 10/10[/h1]\nSame here: MASTERCLASS storytelling.\nAnd believe me, I’m one of those guys who dissects everything and tries to find logical fallacies or plot holes that don’t make sense 🤓.\n\n[h1]MUSIC/OST 10/10[/h1]\nLOVED EVERYTHING except only 1 track lol.\nIt’s the very first song that plays during the credits after the 3rd ending: “Alea Iacta Est”.\n\n[h1]DIFFICULTY 8/10[/h1] but some bosses definitely [h1]10/10[/h1]\nYou’ll suffer A LOT if you don’t adapt and adjust your build.\nSome encounters might look unfair at first, but everything’s totally doable with the right playstyle and setup.\n\nYou miss out not playing this gem.\nI honestly think this is [b]FROM SOFTWARE’s best game ever made.[/b]\nThey’ve developed amazing games before, yes but AC6 is on another level. It stands above everything else.\n\nHave fun, peace ✌️\n\n\nIf interested, here are my no commentary playthroughs (normal, ng+, ng++): https://www.youtube.com/watch?v=aaI4x3hKFQA&list=PL8InGed9Mc4lagpeiBLtXmDcpOQe-Yvvw",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "This game was nothing short of absolutely incredible. if you're reading this comment wondering \"hmmm should I really buy this game\" if you're into mechs even a little bit then yes yes YES.\nThis has to be the most immersive experience I've ever had playing a mech game. \nThe story is amazing, Mech designs are cool as ever, and its really easy to follow what you're building, and what it can do. One of the best parts about that? they give you a training arena where you can switch things out accordingly in the middle of your training until you find exactly what you're looking for. \nThis game gives the player a lot of freedom in playstyles. The game was also challenging in its own aspects, being a Fromsoft game and all. however, never so challenging that I didn't feel like I wasn't having fun EVER. \ni always felt i could figure out how to overcome any boss, obstacle, or mission. you can even build multiple mechs and save them and switch them out accordingly. that way you never have to sit there and build it again. \n\n if Fromsoft ever drops a new AC game it will be in my cart within a matter of seconds. one of the best games I've ever played to date.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Robots, guns, swords, rockets, with fast action and decent story. I had a lot of playing this one and I'm happy I started playing. I really like the game and I'm sad that it's over.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Gameplay is fantastic, story is interesting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you're thinking about buying this game. This is your sign, DO IT. It's an incredible masterpiece of a game and has left a lasting impression on me.\n\n\nPros:\n- Gameplay. Oh, the gameplay. Engaging and satisfying once you nail the kind of playstyle you like. This isn't your usual souls-like esp if this is your first AC game like me. The game is fast, and if you can't adapt to the enemies speed either through sheer firepower or moving just as fast you'll have a rough time. \n- Replayability. Want to be a immovable fortress with enough firepower to cover your entire screen for 10 mins? Done. Want to be so fast the your brain can barely keep up but have the stopping power of a nuclear bomb? Done. Want to comfortably hover indefinitely as you rain napalm on your foes? Done. \n- Story is keeps you captivating and the VAs really immerse you into their world. If you want to fully experience the game you'll have to do multiple playthroughs and even in ng+ (esp ng++) i'm left feeling engaged and challenged.\n- Writing and dialogue is meaningful. Each character has their values and motivation which you can't help but feel for them.\n- The mechs and world is big and BEAUTIFUL. Some moments are so chilling and epic that you have to experience yourself.\n\nCons:\n- The difficulty curve spikes in some boss fights [spoiler]*cough* balteus and IB-01: CEL 240 *cough*[/spoiler]. Which if people can't beat them they simply will stop playing and won't get to experience the whole game.\n- If you don't have the specs to run this beast of a game all you'll get is a white screen.\n- You may need a new controller. You'll be mashing your controller like your life depends on it, but don't mash too much or you'll be out of ammo. Unless of course you brought one of the many swords. \n\nNow get back in there 621, Rubicon needs you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best non gundam gundam game made by the guys who made gundam but refuse to make a gundam game",
      "voted_up": true,
      "votes_helpful": 95
    },
    {
      "review": "When Rusty said during the worm fight \"“I am Optimus Prime, and I send this message to any surviving Autobots taking refuge among the stars: We are here. We are waiting.\" I knew they would accidentaly alert unicron. 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game if you love mech combat and playing robo-Barbie. Another FromSoft banger",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With 400+ hours with this game and over 35 plays through, I highly recommend this if you're looking for fast game play and creative freedom to customize your mech however you want. It's dark souls but with MECHS. If you ever buy this game and complete it, good job buddy. Remember only you can fly high enough, to chase the clouds above Rubicon.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this game is awesome. guns and lasers go pew pew, laser blades go woosh, cannons and missiles go boom. make brain very happy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this has been with certainty the best game i have ever had the privilege of playing,im glad i cant rate it because because 5/5 or 10/10 dosnt do it justice,i hundred percented it on xbox and im working on doing it again,the story sticks to you omost like chains,your breaking as you progress ,and after you beat it,you dout if that was the choice,for spoilers i wont say but i will recomend you to beat in 3 or 4 times,to grasp Rubicon.also Ayre best girl",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, the story is amazing, the deeper meaning behind everything goes much further beyond that too. My only complaint is how I wish the multiplayer in this game took off more than it had. I think it is mostly dead any time I think to check it, unfortunately.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is an absolute masterpiece. I was lucky enough to get the game gifted to me but this game is worth every last cent if you love mech games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my favorite part of the game was when you kill the iguana for no reason and raven said this is our armored core i clapped and cried this game is so peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best fromsoft game I've played. also has the best story and characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like the Armored Core Series, This is a great entry. \r\nIf you've never played it before, it's highly customizable mecha combat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Must for every Neo Genesis Evangelion fan ;) For first and second playthrough I was not recommending this game to any fan - amount of different parts and possibilities is overwhelming. \r\nThing changed during my 3rd playthrough and testing different builds needed to achieve S Rank in every Mission. It was much more fun scoring S ranks than doing whatever else in this game. \r\nMusic could be better, story could be better and boss fights sometimes feel unfair but this is From Software game after all :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So, since the FromSoft games I'be been playing thus far haven't disappointed me, I thought to play another one, in this case Armored Core 6, which is a rather different (yet similar) beast from the FromSoft titles I have played thus far... And here's my thoughts and impressions of the game:\n\n- The loot goblin in me is a bit disappointed of the lack of loot in this game, both in terms of 'loot you can pick up from downed enemies and 'loot you find/pick up'...\n\n- When it comes to boss arenas, I really don't like the 'illusion of free movement' - that is to say, how our movements are restricted while the boss is totally free to move outside of the arena, which often gives them a bit of an advantage I'd rather not see them have AND sometimes ended up with me being cornered when this shouldn't have been the case...\n\n- When it comes to OS tuning, I don't really like the fact that you have to reset EVERYTHING, even if you just want to change a small detail or two... And yes, I know; eventually you'll have enough points to just turn on everything in the OS, but nonetheless...\n\n- A detail that makes me like it less than the other FromSoft games I've thus far is that if you quit during a mission... You've got to do it all over again. Meaning, if you've got trouble with a boss, there's no parking right outside or at least near enough the boss room. This wouldn't be so bad, if it was not for the fact that there's extra stuff to collect during many of the missions as well, so if you collect everything during a mission, but then end up struck at the boss and have to quit before you can finish it or the like... You've got to redo everything from the start (including defeating whatever minibosses andwhatnot there are between you and your objective), and this I find rather annoying.\n\n- On a very minor note, I wish there was an achievement for replaying every single mission and getting a ranking for it - and yes, fair enough, there is such an achievement already, the 'Get an S rank in every mission'-achievement, but that's not quite the same thing; I daresay many of us replay the missions, but how many of us are crazy enough about it to do it so many times to get everything right for an S-rank? Not that many, I'd say, yet they do replay every mission, regardless...\n\n- Visually speaking, the game offers some quite stunning sights, not just in terms of beauty, but in how enormous everything is - the 'Attack the weaponized mining ship' left me quite stunned, for example - and that was far from the only one! And when you realize just how your mech is in comparison to everything around you (normal vehicle, stairs, etc), it also makes it all the more stunning and impressive.\n\n- Of note is how 'short' this game is in comparison to other FromSoft games I've played thus far. To compare, a single playthrough of DS1 took me over 100 hours, three playthroughs of AC6 took me less than 90 hours. This isn't too surprising, because you're doing missions rather than being given an open or semi-open world to explore and farm for items and/or souls/runes and suchlike. Even if one spends lots of time replaying missions for cash or finding the hidden stuff, or spend lots of time fiddling around with their AC, they'll probably only add about 10-20 hours to their playthrough this way at most, and those that spends little time on that may well end up completting the game in less time than I did (again, less than 90 hours - all three routes done). So from that perspective, it's a good game to go for if you don't want a game you might get stuck for hundreds of hours in.\n\n- In-game equipment-wise, it's about as impressive as any other FromSoft game, though you'll be buying rather than finding most of the stuff. I'm sorry to say I had a harder time wrapping my head around what was, equipment-wise, good or not in this game than in the other FromSoft-games I've played thus far though... But that's hardly a problem everyone will be having.\n\n- As far as replayability goes; things are decent in that department too. The game offers three different endings, some different choices when it comes to missions as well as some alternative versions of certain missions, though some of these won't appear until your second or third playthrough (if even that), so in short... The game gives you reasons to not just uninstall it after you're done with the first playthrough, and if you do play through the game more than once, there's bound to be differences from your first playthrough - unless you deliberately make all the same choices as the first time around, of course. \n\nWhen I bought and installed the game, what hoped for an experience similar - in both gameplay and story - to that of the Gundam-franchises, especially gameplay-wise... And I'd say I got what I wanted there, though story-wise, I'm not so certain. Regardless, it's a game I'd recommend to enthusiasts of the mecha-genre, soulslikes and FromSoft games - though it pays to be aware it'll be a different experience from FromSoft-games one has played thus far, unless one has played earlier games in the Armored Core-franchise. Probably to those who want a game that doesn't take overly long to play through as well...\n\nAll in all, AC6 is a game with fun and interesting gameplay, an interesting story, characters you won't exactly meet face-to-face in the game but still meet and find either interesting or annoying enough, challenging (sometimes annoyingly so) fights and plenty of stunning sights!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very difficult souls like mecha game with a decent but obscure story. I'm still struggling to complete the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visceral world-building, deep and heart-wrenching storylines culminating in a finale that doesn't disappoint. Gameplay is stellar, nigh-perfect, and movement is incredible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a robot/tech/mech/anime fantasy for fans of the genre, like me. The game has been out for a while, so I'm modding it at this point - to make it more enjoyable. The plot is a straightforward, by the numbers, story that provides ample excuses for you to blow up Big huge Boss mechs. It throws in ammo and energy management, which I think is out of place in a game that uses physics destroying mechs. Yes, MechWarrior has lots of that as well, but, whereas Mechwarrior seems more like a simulation with its own world rules that everyone follows - this game is an anime style fantasy where you fight enemies and bosses that don't have any of the constraints that you have to live with. Gameplay Mods help with that, and it turns the game into a more arcade like  experience - which is honestly what I was looking for. \r\n\r\nThis is a FromSoft game, so it's a little like Elden Ring with guns and robots. It's a mission based game, so don't expect open world exploration. You get your missions, you complete them, you open up new areas, in which you can do more missions. \r\n\r\nEasily recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent mech game and great story telling for a mute character",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is literally everything that makes a good video game rolled into one. It also has weirdly really good plurality representation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't have many hours in this game as I got it, played to the first boss, got ate, digested and pooped out WAY too many times and I am a OG Souls and AC gamer.. More games came out and i lost all motivation. Today I finally decided to give it another shot. DESTROYED the boss and now I am enjoying every minute of the game. 3 hours in after defeating Balteus and my love for AC is back! Best mech game out there. Be impatient, be aggressive and blast some mechs Raven.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Gives a LOT of customization, lore, and action. 10/10!\n\nYou can paint, configure, put new weapons your mech, and test it out on missions you progress through in an action-packed, immersive story with guns and robots. Personally, one of my favorite games made by FromSoftware, next to Elden Ring. I definitely recommend this game, if you intend to buy it on sale or at the usual price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a huge mecha fan this game might be one of the best options you got currently on the market , i highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The customization and sheer amount of ways to play the game is a + for me, but what takes it to the next level is the way your mech moves there is just something about going nearly subsonic speed with your mech bolting and dashing around the map.\n\nalso the game is very well optimized and I find it runs well on my quite old hardware, I only wish we had gotten a DLC or something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had lots of fun with this game! When I was growing up, I played some of the older AC games. I tended to use a tank build in those games, but with this game (and after quite a bit of time), I think I prefer using a more lightweight, faster build instead. Of course, From Software has garnered a reputation for its games featuring some tough difficulty, and I would say that this game does have its difficult moments. However, victory tastes so sweet after finally nailing those tough bosses!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down the best mech game, let alone armored core to date. Have purchased numerous times and would buy again.  Nothing stands even remotely close. PLEASE BRING THIS SERIES BACK IN FORCE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played any of the armored core games but this game was really really good. Good dialog, good game play, good customization for your mech, and all in all just a peak game. Highly recommend if you've ever played any other FromSoftware games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down one of the best and most focused Fromsoft experiences ever... and I never even played the other ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "phenomenal, without equal. this game will push you to your limit and at the same time make you the coolest pilot there ever was. at it's heart a game that entails what one person with enough grit and will changing the course of history. from the ground up I love everything about this title, 100% steam achievements inbound.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was legit addicted to this game for a month. I had to force myself to uninstall it and stop playing it. I was staying up until the early hours of the morning and in the 4 or so hours \"sleep\" I got, I was dreaming about mech customisation. Believe the hype, this game is like crack. An absolute masterpiece of a game in basically every aspect from presentation to controls to customisation and player expression. All builds are viable to some degree and all weapons can absolutely SHRED if used well. Insanely good game. If you are on the fence buy it. Also the Balteus boss theme is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "solid action with very deep customization but would like an FOV slider and DLSS support in the next one. Bosses will sometimes feel unfair, but the game does give you the tools and resources get them (via replaying older missions for additional currency) to customize your mech to overcome the challenges it presents.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very much seems in line with the excellent Armored Core games from the PS2 era, most akin to Silent Line and Nine Breaker; complete with massive difficulty spikes, cheating AI and obscure lore/plot! The quality of life improvements are very appreciated and the graphics are top notch. My only criticisms involve: S Ranking, which is not explained, mission specific and varies quite drastically; and the forcing of heavier ACs/armament in the later 2/3rds of the game.\r\n\r\nI am pleased From Software took a break from Dark Souls/Elden Ring to pay homage to their roots. \r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredible mecha game. Simply a must-play for any mecha fan.\n\nThe visuals, the soundtrack, the characters, the gameplay, everything is incredibly well done. Strafing just right to avoid volleys of 20 missiles, sneaking in a melee hit to stagger the opponent, rushing in to secure two point blank shotgun blasts, no mecha game I've played has given me the rush that this combat gives.\n\nEach weapon, part, engine, chip, etc is thoroughly unique and fun to play around with. Perfecting each mission to secure that S rank is exhilarating and rewarding.\n\nI'll say again, simply a must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best thing that ever happened in the series. I came from the 3rd game in the installment and wow what a crazy difference. only problem was I can't do dual melee ToT. other than that a 10/10 experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An exceptional Armored Core game, an exceptional FromSoftware game, an exceptionally interesting story with strong, varied characters. I refuse to spoil this game but i must say, you don't truly beat this game in one playthrough, and for those thinking it's just a repetitive campaign, i assure you, it is anything but. Grueling bosses right from the first chapter, fantastic missions and set pieces that will leave you in awe again and again. Massive customization options to build the AC you want. Oh, and the music? an absolute Banger.\n\nA true FromSoftware Masterpiece for those who love Mecha games, and i for one cannot wait for the next entry in this franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on release and very quickly dropped it in chapter 4. Came back and the game completely hooked me, Give it a chance, it is great.\nNeeds 3 playthroughs which is a bit of a slog if you don't like replaying, but you unlock new items and get different perspectives with the lore which keeps it interesting and worthwhile. After finishing the game I was wishing for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, and true to From Software, the combat is excellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had trouble getting the game to run smoothly. I meet the hardware requirements but still get 3 to 4 second lag spikes and no single loading screen took less than than a minute even on the lowest quality setting.\n\nI made a clean sweep of my PC, updated my drivers, checked for malware, closed anything unnecesary, cleared up space on my hard drive, etc. Problems were still occuring, my CPU was practically catching fire.\n\nIn a last desperate attempt, i try to disable Easy Anti Cheat.\nNo problems whatsoever. I can run the game on high quality smooth as butter and no loading screen takes longer than 20 seconds.\n\nIts a good game, but screw Easy Anti Cheat. You may need to disable it in order to play the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool atmosphere, story, and gameplay. Played on ps4 and here. Worth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i enjoyed the story so much that it took me a whole month to decide on weather to help AI girlfriend or  continuing to help cindy carla (shes basically a cool terroist aunty) drunk drive the space island into a tower (their was only one tower) like a badass. either way making decision in this game is very important, kinda feels like the scary feeling you get when your mum tells you do your own appointment with the doctor. \n\nstory 10/10 for me \n\nnow , the nest (pvp)\nwhen you think your the goat  thinking your AC IS THE  RAVEN and everyone else is shit. the ranking in nest is very humbling way of telling you \"your ass\". (side note TO THE ABSOLUTE PRICK WITH THE PUMP im sorry sir your AC layout is true raven material next time lets have a rematch without the shotguns pls)\nplaying against other players is like playing the pachinco machines in the casino. you dont know if your build is or isnt cable of killing him so yes it comes down to the pilot. the greatest fear is when they carry dual pumps and their good at using it , youll know when their good, when ass hair is standing up straight like your in danger kinda like a cat. \n\n8/10 cause everyone uses pump but gg to anyone i fight",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the first AC game i have played i've owned it for a little over a year and enjoyed it, once i got a steamdeck and picked the game back up it gets alot more intriging after chaper 3, lots of different builds that are very fun to test out and min max. defenitly a fun game that plays and looks great. dopamine rush that makes war awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yup, fromsoftware seems to be unable to make a bad game since demon souls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "任何喜欢高速战斗超级交合，喜欢势大力沉工业重击，喜欢高达、大型机械甚至挖挖机的人都不容错过的游戏：）",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall I think its a decent game. I'd get it while its on sale. I wish I had more parts to customize the AC personally I though the story was okay and the soundtrack is a 6/10 has some bangers for sure though. Very short multiplayer battles that require a lot of skill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very unique story, and is the first game that i actually wanted to hear about the lore of. 10/10. G5 Iguazu is also fun to ridicule",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Had me hooked from the first mission all the way till the end of my third new game. Atmosphere is second to none, and there is such a rewarding depth of mechanics and content. Will be thinking about this one for a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im bad at this game and refuse to play chapter 3, because im not aware of how good the boss is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is absolutely worth it, the campaign was worth playing it over 6 times in my experience. The variety of parts and play styles make it refreshing without feeling too overwhelming. The story and cinematic moments (plus secret events) is very engaging, not too mention the difficulty is just right. Can't say too much without spoiling the story, but it does have extra levels and routes after completing it the first time.\n\nUnfortunately, that's where the good ends.\n\nFromsoft did great with the solo experience, however pretty much abandoned the game in every other department.\nPvP is alright, netcode is poor though. And unless you play ranked mode, the game is pretty dead. Funnily enough, it's not even completely the fault of lack of updates. A big part of the blame is the community, it is full of big ego cry babies. Its either only using meta to have fun, or crying about how everything they lose to is meta. Have a kite build = meta, melee build that uses any high stagger gun = meta, shotguns = meta. missiles = meta. These aren't my words, just a lot of excuses made by players. I get it winning is fun, but take pride in a loss here and there. I used to really enjoy this game and for a good while it had a decent community, however, the toxicity killed any chance of momentum. If you like a toxic community, you found your home.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a guy who got into Armored Core from the 4th generation, this game is very fun. Story is alright, things do in fact blow up, and while the new stagger mechanic changes and sophisticates combat a bit it's still very enjoyable. I do hope Fromsoft adds a DLC or something, would love more content for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gritty, fast-paced action scifi with giant mechs, megastructures and an excellent soundtrack. Great customization options and the combat is very flexible if you want to experiment with different builds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you like mechs? Do you like getting treated like a dog? Do you like putting an hour of design work into a supersonic killing machine that's only ever out in the field for a few minutes at a time? Are you, or do people commonly assume you are, trans? If you answered yes to any of these questions, this is the game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game from Fromsoft. I have played previous AC games in the series and they always manage to make the next title even better. IF you like mechs, customization, funds management, and a very difficult adapting type of game this game is it for you. now I normally do't buy or recommend deluxe version but if you can i highly recommend getting it. that artbook and soundtrack is worth the extra ten usd. once you finish your first playthrough it makes you want to go back and play again which just so happens to let you do a different ending as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun, only played it once because I prefer not to play the same game twice just to have to wade through pretty much the same campaign, just to maybe take a different path than before. Didn't end up finishing it though because of that stupid two-phase fight near the end. Still enjoyed my time with it. I do wish the levels were longer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 story, no early access bs, full game on launch. I could go on, but trust me when I say this game is worth every penny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The first AC that I really played, I never got a chance to play the ones in the PS3 a few years back so I was really looking forward to this one when it was announced. Was not disappointed. Challenging gameplay at times, controls great. I think the controls was pretty responsive considering I played a lot of this on the Steam Deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First Mecha game I played, and I had such a blast with it that I finished the ENTIRE story. The sound, customization, art, va's, mechs, gameplay, and even the multiplayer were Top Tier. This is what a game made with love looks like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as someone whom played dark souls, bloodborne, elden, etc. this has got to be my favorite fromsoft game in the past decade",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great, if you enjoy other FromSoftware titles you'll enjoy this game. At the same time it captures the spirit of other games and have a totally new high-octaine action gameplay. I Reccomend getting all 3 endings",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big bot shoots other bots, goes boom, and then changes guns. Repeat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "entertaining, fun, engaging and a decent enough challenge worth about 40 hours in your time to complete everything. definitely worth the money but I do wish they would at least port or remaster AC4 and for answer over to PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One word.....\n\nPEAK.\n\nThat's how I would describe AC6, not only is it a banger game but it's also a fantastic introduction to the series for newcomers. Now I will admit, I would've liked to have more options in terms of parts like in previous games (Weapon Arms, Sniper Rifles, more options for reverse joints, Tetrapods, Tanks etc) This game definitly needs more in terms of content/options and I hope that gets rectified in a update or expansion/DLC. \n\nAnd I do feel the stagger/acs system could be tweaked as it can easily be abused with certain combinations.\n\nBut as it stands it's absalutely worth you're time and money, if you are a newcomber, a veteran or a Fromsoft fan that havn't played a Armored Core game before. \n\nGet this game, you wont regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mecha game. The three campaign endings make it very replayable alongside the variety of weapons and mechs to build. Your mech is highly customizable, and the depth and nuance of the stats make it easy to try but hard to master. The story is well presented, and the voice acting is well done for all the characters. I haven't tried the online, mostly because the anti cheat causes the game to lag which is really annoying, so I disabled the anti cheat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very satisfying gameplay, good story, mechfights...\r\n\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was my first Armored Core game and I almost gave up on it initially. There's a huge learning curve but once I figured out I really ended up enjoying it. Still, the environments are all pretty drab and the story is nothing to write home about so you really only play this for the combat. Nonetheless, I recommend it for the combat alone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was not sure if I would enjoy this one. It is quite different from FromSoftware's other titles, but it is strangely addictive and dodging rockets while shooting your own, showering enemies with minigun fire and slashing them with energy swords seems to work pretty well.\r\nThe game's mechanics are introduced slowly and it gives players space for experimentation. Take your time with it and it will reward you nicely. There is no excessive amount of cutscenes here. Gameplay is king, and this is a video game through and through, almost like something from the 2000s. Some text and speech before each level, then off you go to shoot the badies.\r\nThe action itself is pretty intense, and in typical FromSoftware tradition, expect a decent challenge here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, really satisfying combat. \r\n\r\nNot a ton of content, but the quality is really high.\r\n\r\nI completed the new game ++ for the \"real ending\" in about 20 hours and completed all the achievements in 33. \r\n\r\nI would highly recommend AC6, the lore is fantastic, the music slaps, and the combat is addictive. \r\n\r\nIf you see it on sale it's worth as scoop, otherwise it's still probably worth while if you like the series or are just a fan of Mechs smashing shit up with universe threatening stakes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best mech game on the market, offering a vast selection of parts for enthusiasts to spend hours fine-tuning their builds. The gameplay feels exceptionally sharp and responsive. I loved the game’s art style, and while the story was engaging enough, it was the gameplay that truly made this game stand out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favourite mech combat game. \r\nI will admit that I didn't understand the core systems for the first boss battle, and got very frustrated and had to bang my head against that brick wall several times before the gameplay clicked.\r\nAfter that, I never stopped having fun. Brilliantly voice acted, engaging story, and addictive gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was such a fantastic and intense experience. From the combat, to the story, to the characters it was such a fun time I couldn't get enough of it. I love the freedom of customization and how many combinations there are and how well everything works together. I can't really do it justice. You just have to go out and try it if you have any interest in big robots fighting each other while the pilots are trying to figure out what makes them who they are",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has been a fan of souls and jrpg fan and saw that this was made by FROMSOFTWARE. \nI was BLOWN away by how much I enjoyed this game! \nArmored Core VI has some of the best movement I have ever seen in any video game and the graphics are INSANE. \nIt makes you feel like riding a MECHA and I dont even know how they did it. \nThe story is INCREDIBLE with 3 endings which are unlocked by playing through the games 3 times. \n10/10 MASTERPIECE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didnt know such an incredible atmospharic game existed. goated franchise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game has a cinematic feel to it and when ever the real scale of everything slips back into your mind it reminds you of the games actual beauty yet dystopian nature. the gameplay is fast but you can choose to make it slow and play how you want to. the game is capable of fitting anyone's play style and i recommend you try it out yourself, and fear not the ibis series fight for it is possible my friend... Just keep trying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is good, but its bad. There is no real story so to speak (yes there is, but its very linear and Arcade like), with only spoken voicelines and a few cutscenes, the game revolves around Arcade like progression to select mission, dive in, complete, and select another mission - While upgrading your Armored Core simultaneously.\r\n\r\nDifficulty level is medium to hard, depending if you play tanky (easy) AC or a more lightweight and mobile (harder).\r\n\r\nCan't find any opponents for online multiplayer during Q4 2025 unfortunately.\r\n\r\nMixed feelings about this game - It has so much customization possibilities, so if you like trying out different builds and customizing your Armored Core, perhaps you'll like it. But if you're looking for a cinematic story driven single player game, it might not be for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like mech games, then you'll like this one. The graphics are great, although there are a few places that are just too dark to see anything. The movement controls feel solid as well. The music could have been better. The overall gameplay loop is fine. It will take you a hot minute to learn the \"best\" builds for each mission, but then you'll be able to clear each level in less than 5 minutes. One of the bigger issues I have with the game personally is the stun mechanic. If you do enough damage within a shot timeframe the enemy is stunned and take increased damage. The game rewards you to just nuke the enemy during this time.\r\n\r\nThe story is a bit trope heavy, and not hard to guess all the different options you'll get to make. Basically play this game if you want to see cool robots fight, but don't expect any grand story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really makes you feel like youre piloting a mecha, fluid non clunky combat, and the story is great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good, reminded me a lot of Zone of the Enders but in a much more mature and polished package.\r\nLooking forward for ACVII",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games I've played in my opinion, I hope there's a DLC for this game in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "waltuh, put your coral away waltuh, were not starting a fire right now waltuh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "someone needs to make a nerf mod to the final boss to acccomodate keyboard and mouse players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "easy to handel on my intergrated graphics laptop i rate This 8 soups out of 10 soups (Good Soup)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game top 10 games of all time number one for me right now .part 7 is needed :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big Mecha. Tons of customization. Easily one of my favorite games. \nWe stan Ayre around here.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A beautiful dilemma about human evolution hidden behind a fast passed mecha brawler.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing! now give us Armored Core: A New Age From Soft, don't want to spoil nothing but if you've gotten all endings and know about the sequel to Armored Core 2, then you know.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fucking peak.\n\nDo yourself a favor and buy this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still get goosebumps when listening to Rusted Pride\r\n10/10 experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is the sixth installation of the game in which your core is armored",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Being a Gundams kinda fire, I ain remember the story though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fell inlove with the game within the first hour. Still playing, love it so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best mech game ever and if you get it on a sale you wont regret it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is a work of art. My only two frustrations are that I didn’t play it earlier and that there’s no DLC, at least not yet.\r\n\r\nThe combat is amazing, playing with different builds is super cool, and trying to S-rank all the missions is really fun in my opinion.\r\n\r\nAs I always say, FromSoftware never lets us down.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Masterpiece, this is truly fire of rubicon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game absolutely rocks. This is probably the greatest mech game of all time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its fun but i think its only worth like 40 bucks. get it on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The real mech experience where you spend half your hours making and painting your sick mech before it gets steamrolled in under a minute",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Man, I really want to like this one. The core idea is so good, but the game just isn't good. It starts great with some cool boss fights, but then the game runs out of ideas and each boss fight is less interesting than the previous one. It's a bit of a classic FromSoft problem, where the game is front-loaded and the latter parts of the game feel cobbled together to get the game out the door. \r\n\r\nThe story is just awful. It's not even a fun kind of bad, it's just not good, worse, it's boring.\r\n\r\nIt's just a shame. I really want to like this game. I just don't have the energy to finish it though. It's not good enough and the competition if fierce.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "tried it twice // both times it felt like i was fighting two things at once the movement of the mech and the actual boss or target infront of me // tried it on keyboard and mouse and using a controller // neither helped, maybe the game isnt for me, but the movement was just not something i could get used to",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am rather underwhelmed coming from 4 Answer to this. It looks nicer due to modern graphics, the story is nice, but campaign could be a lot longer, theres a distinct lack of giant bosses to fights (most bosses are player sized) and a lack of 'companies' to take jobs for. I could do without the stun mechanic and a more generous variation of unique weapons and mech parts. Not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly, I really liked this game, but after further play I realize I can't really recommend it. After going back and playing through other Armored Core games as well as other giant robot games both retro and modern, the fact that this is the game that is now the flag ship of the mecha genre is disappointing. Not because its worse than any of the other Armored Core games nor any other mecha game, but its disappointing that this is the best the genre has to offer. This is very easily one of the best if not the best Armored Core game out there. The game is extremely well polished, worked perfect on launch, and has no micro transactions or any major hickups, and the game can be extremely fun.\r\nHowever, I just don't think this modernization of Armored Core works well. The Armored Cores of the past admittedly are not great. Many missions are just you destroying waves of clueless MT's that have no chance of beating you, until you come to a mission where you get absolutely destroyed by fighting 3 AC's at once. This game is far better than the Armored Cores of the past (don't take armored core fans word for it, actually go and play them and see for yourself if you don't believe me). But AC6 doesn't know what it wants to be. A big part of the Armored Cores of the past was that there was no healing. All the health you had was given at the start of the mission, this would turn certain missions into a game of learning how to navigate to the end while taking as little damage as possible for the boss. It also made your mechs feel more unique and specialized making you choose between just beefing up, or trying to be nimble and skilled enough to just avoid the damage all together. With the healing items and resupply mechanic in AC6, navigating through the map feels extremely trivial, almost like a waste of time. The combat is flashy and satisfying enough to where, on your first playthrough, you wont even notice how little they put up a fight. If somehow you manage to get through all your medkits fighting MT's, it doesn't even matter since you will autosave before you get to whatever boss you are going to fight. This mechanic in a weird way makes the game more frustrating, because if your build isn't cutting it for the boss, since you are mid mission you can't buy and sell parts to fit the job. So instead of just having the mission be the boss, you have to quit the mission, make your new mech, go fight your way back to the checkpoint, and then try your new build against the boss. This disincentivizes experimentation because the dark souls mentality (lets be honest that's why we ALL played this game) just tells you to keep fighting rather than back out, which while this can be satisfying, isn't what the Armored Core series has been about.\r\nSpeaking of the buy and sell system, while in the beginning this does lead to an interesting 4th dimension to mech building where you have to factor in the cost of parts, at a certain point in the game no matter what mech you want to build, if you just sell everything you can always make it (you get all your money back when selling parts). This just adds more friction to mech building requiring you to back out of the buy menu, go to the sell menu, sell all the parts you aren't currently using, then buy the ones you do. Even worse if it's a core in which you need to first buy the core you want, then swap, then sell. \r\nThere are some really awesome missions in this game, but the majority of them just feel like the equivalent of orange waypoint AAA slop, just something to do because you have to do something. You don't really feel like the legendary Raven pilot, you feel like a fly swatter.\r\nLike other AC games, you aren't necessarily getting attached to characters the same you would in a Baldurs Gate or a Tale Tale game or something. You just like them cause they are cool but nothing really beyond that. The ending quality varies WILDLY. The first ending I got absolutely blew me away and made me think about the game for weeks after I beat it, but after getting another ending, the ending most people probably would have gotten, I was extremely disappointed and felt completely unfulfilled after having going through the entire game again, which leads me to my last point.\r\nThis game isn't very replayable, but it very much tries to be. The mission replay system encourages you to replay missions to try and \"S-Rank\" them by beating them faster, taking less damage, ect, but doesn't present itself in a way that makes that satisfying. Maybe if there was an extra UI showing the time needed to S or the damage you can still take before going past the threshold while you are doing the mission it would feel better but you get nothing, once you are in the mission you are in the dark so it just feels unsatisfying. And most missions aren't interesting enough for you to even want to replay them, and you have to if you want to get all the endings, one of which requires you to get all other endings. \r\nBut there still is a reason I have so much time in the game, and was my favorite game of 2023. The environments are beautiful and dreary. The sound design, particle effects, movement, and mech design are incredibly immersive and really give off this awesome feeling of dealing with truly extraordinary weapons and armor of the future. The aesthetic is raw and incredibly unique. The voice acting is, okay well the voice acting is really rough, but some characters like Handler Walter, Carla, Ayre, and Rusty, while not being fleshed out or honestly even really characters, are still presented in such a way that make them unforgettable (in certain endings). Where this game shines is what all AC games shine in, the customization, and this game turns it up to 11, letting you choose what type of weathering you want, how much weathering, differing finishes between matte and glossy, colors, your boosters, targeting systems, weapons, swap-able weapons. The cosmetic customization and the build variety is something I haven't been able to find in any other pilot game. This game showcases what is now exceedingly rare in the gaming industry, truly showing off things that can only be done by a AAA studio, and using that power to bring to reality something that fans of mecha or just gaming in general could only dream of a decade ago. It truly is an unforgettable game with spectacle I've never seen before. \r\nIf you are truly passionate about the mecha genre, this is an absolute no brainer purchase, its the most important thing we have gotten in gaming, but Armored Core isn't yet at a point where I can truly recommend it to everyone, and I'm incredibly excited for when we get to that point.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't really get into it, it was pretty dry and dull. None of the control schemes felt good whether playing with controller or mouse. Mission design wasn't very exciting. One for the fans I imagine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nothing like what i hoped for. Is not like the Og in enough ways. it is just a crappy want to be dark souls in a mech game. that disgraces everything that armored core once was.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Having played this series since the PS1 era, and going absolute HAM on the PS2 games, especially Silent Line, I came into this expecting much the same: Amazing graphics, music, enemies, and mech customization. \r\n\r\nSOME of that is still true, and kudos to that. \r\n\r\nUnfortunately, some moron at FromSoft thought \"hey, let's make DarkSouls Mech Edition\" and they did that instead of making an ARMORED CORE GAME. The DS mechanics are lame, and kill the fun.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Was starting to have some fun untill I got to 1 mission pretty early on in the campaign Investigate BAWS Aresenal No. 2 and cracks in game started to show, The difficulty comes from legit broken and unfair mechanics/fights\r\n\r\nLets make the player go up against invisible mechs that need to be constantly scanned to be visible to the player and make them randomly teleport away, and now lets swarm the player with them, and why give them checkpoints? one mission has killed all will to want to continue and all fun, havent had a need to restart a mission more then once up  to this point and was enjoying replaying SOME of the previous ones, but not having any fun on the 8th try now? experience will only diminish from here, shouldn't have gotten FromSoft to make the game or should have forced them to implement a choice of difficulty as this just isn't fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played AC2 back on the PS2 and was thinking about it recently. I decided to pick up AC6 more than 2 years after it came out. Beat the game and got all the endings. put over 100 hours into it, very fun single player experience. Went and tried my hand in PVP and quickly found that the net code is pretty terrible. reacting to projectiles is meaningless because they end up hitting you anyway. I travel for work, so i was playing on a slightly unstable connection, and I had a few DC's. couple that with the net code and you get a very unfun experience. After the 7th match in a row against the same person, who was using a weapon that was literally impossible to dodge under the circumstances, I Alt F4'd out of the game and went to lay down. went back the next day and I spent 20 minutes in the matchmaking queue with no games found. Come to find out, Fromsoftware had instituted a separate queue for people who frequently leave matches...I havent been able to get a game since. how long does it last? well also come to find out that it can last for months...great way to kill all the interest i had left in the game, and honestly pretty annoying. if someone DC's or quits a match...give them a loss. thats it. why make your own game unplayable?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not playable on deck. Keeps crashing in the first level",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kernel level anti-cheat = malware\nuninstall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constant stun lock",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat really isnt clicking for me. Just feels like I hold down shoot and get shot in return. Dodging feels ineffective. Whatever the flow for this game is, its just not clicking for me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I've played this game since launch without any issues in FPS but now I cannot get around incredibly low FPS and stuttering. I imagine its due to EAC like always, as the game is now I cannot recommend it until FromSoft decides to grace us with proper optimization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I find the combat boring, which leaves very little to enjoy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Couldn't really get into it, it was pretty dry and dull. None of the control schemes felt good whether playing with controller or mouse. Mission design wasn't very exciting. One for the fans I imagine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a good game. the negative review is due to how this sequel was handled. \r\n\r\nbasically, this is a simplified mecha souls-like. this is a really be step away from AC series in the past. this ought to be a totally different franchise. this installment also ommited a lot of features from the past titles. no tuning of individual parts, no balancing the mech. compared to previous titles, this is quite a bit more shallow in a lot of ways. \r\n\r\nits a fine game but its not the AC that fans knew and loved.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this game, can't even beat the first boss lmaoooooo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fromsoft once again fails to demonstrate improvement in areas where they struggle.\n\nThere is little reason that a studio like Fromsoft should struggle with displaying the correct button prompts for controllers in a game so clearly primarily designed for consoles.  The first bossfight is also poorly timed, with it clearly intending the player to use mechanics that are not explained until tutorials are accessed after the bossfight is successfully completed.  I suspect this second failure is due to poor planning on Fromsoft's part, with the introductory mission and boss being designed and implemented after the rest of the game was a finished piece - the studio has a history of such directorial blunders.\n\nThe game also seems to fall into the trap of attempting to display simplified stats for things like weapons while at the same time hiding useful information, leaving players relying on dataminers and extensive, laborious in-game testing to establish what *exactly* weapons do.\n\nAdditional features are poorly implemented.  The store system is unnecessary, providing no true limit on player builds past the very early game.  Engine load and weight already provide the necessary tools for balance.  Since you can buy and sell for the same price, in practice you simply buy, sell, buy, sell, buy, sell...it interrupts the flow of building, making the act of customizing your mecha a gigantic chore.\n\nThe story, as far as I have gotten, is poorly written and full of dull, unlikable characters with far too much dialogue for what they actually have to say.\n\nImportant missions are designed to be played halfway, failed, and restarted once the player has had a chance to tune their gear.  This is due to how the bossfights work, which are dependant on you having certain equipment to make them go by quickly enough to not drag on forever.  It's clear the devs are desperate for you to take a blade with you, but they only give you one blade for an extended period of time and it's kind of miserable to use.  It takes up a hand slot despite being  a wrist-mounted device.  You don't get any money for a failed mission, so it's just a way to waste player time.  \n\nThe \"voice in your ear\" characters are annoying to listen to, and only rarely have something useful to say.  Most of the commentary they give is cliche, and not in a funny way.  Just in a dull, unimaginative, hacky way.  Remember in Halo 2, how annoying it was to hear Cortana repeat the same voice line four or five times while trying to beat the game on higher difficulties?  It's that, but the character speaking never has any good lines to make up for it.  At least Cortana's lines in these situations tended to be more than \"Don't let him bait you.  Focus.\"  \n\n(Side Rant: He's not baiting ME you dumb fuck, he's baiting YOU.  I don't know who he is, I don't know who he's talking about, I don't give a single flying fuck about any of it.  Shut the hell up and let me do my job.  Like, at least do something useful and jam his comms so I don't have to hear his smug-ass dialogue)\n\nUnfortunately, major mech games are rare and so it's still likely worth playing this game if you like mechs and can roll with the punches.  DO NOT pay full price for this title.  Fromsoft needs to be held to a standard appropriate for a professional, well-funded AAA studio.  If they put out a 30 dollar game that they take a loss on if they sell it for less than 50, that's not your problem.  That's their problem, and they can go bankrupt over it.\n\n\nEdit:\n\nI decided to see how far I could get,  I believe I got to the final boss of the first playthrough when I ran out of patience.  I just don't understand what people get out of this.  \n\nIf you decide to go ahead, understand that the game is *primarily* about what you have equipped.  Some weapons are simply much better than others.  Some weapons can excel in certain situations but are traps 90% of the time.  Some weapons do seem to just be bad.\n\nI wish I could say I enjoyed my time, but the reality is that of the 40 hours I've spent with this game, I've enjoyed very little.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am rather underwhelmed coming from 4 Answer to this. It looks nicer due to modern graphics, the story is nice, but campaign could be a lot longer, theres a distinct lack of giant bosses to fights (most bosses are player sized) and a lack of 'companies' to take jobs for. I could do without the stun mechanic and a more generous variation of unique weapons and mech parts. Not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Man, I really want to like this one. The core idea is so good, but the game just isn't good. It starts great with some cool boss fights, but then the game runs out of ideas and each boss fight is less interesting than the previous one. It's a bit of a classic FromSoft problem, where the game is front-loaded and the latter parts of the game feel cobbled together to get the game out the door. \r\n\r\nThe story is just awful. It's not even a fun kind of bad, it's just not good, worse, it's boring.\r\n\r\nIt's just a shame. I really want to like this game. I just don't have the energy to finish it though. It's not good enough and the competition if fierce.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "tried it twice // both times it felt like i was fighting two things at once the movement of the mech and the actual boss or target infront of me // tried it on keyboard and mouse and using a controller // neither helped, maybe the game isnt for me, but the movement was just not something i could get used to",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played AC2 back on the PS2 and was thinking about it recently. I decided to pick up AC6 more than 2 years after it came out. Beat the game and got all the endings. put over 100 hours into it, very fun single player experience. Went and tried my hand in PVP and quickly found that the net code is pretty terrible. reacting to projectiles is meaningless because they end up hitting you anyway. I travel for work, so i was playing on a slightly unstable connection, and I had a few DC's. couple that with the net code and you get a very unfun experience. After the 7th match in a row against the same person, who was using a weapon that was literally impossible to dodge under the circumstances, I Alt F4'd out of the game and went to lay down. went back the next day and I spent 20 minutes in the matchmaking queue with no games found. Come to find out, Fromsoftware had instituted a separate queue for people who frequently leave matches...I havent been able to get a game since. how long does it last? well also come to find out that it can last for months...great way to kill all the interest i had left in the game, and honestly pretty annoying. if someone DC's or quits a match...give them a loss. thats it. why make your own game unplayable?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not playable on deck. Keeps crashing in the first level",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kernel level anti-cheat = malware\nuninstall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constant stun lock",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat really isnt clicking for me. Just feels like I hold down shoot and get shot in return. Dodging feels ineffective. Whatever the flow for this game is, its just not clicking for me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I've played this game since launch without any issues in FPS but now I cannot get around incredibly low FPS and stuttering. I imagine its due to EAC like always, as the game is now I cannot recommend it until FromSoft decides to grace us with proper optimization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I find the combat boring, which leaves very little to enjoy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Couldn't really get into it, it was pretty dry and dull. None of the control schemes felt good whether playing with controller or mouse. Mission design wasn't very exciting. One for the fans I imagine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a good game. the negative review is due to how this sequel was handled. \r\n\r\nbasically, this is a simplified mecha souls-like. this is a really be step away from AC series in the past. this ought to be a totally different franchise. this installment also ommited a lot of features from the past titles. no tuning of individual parts, no balancing the mech. compared to previous titles, this is quite a bit more shallow in a lot of ways. \r\n\r\nits a fine game but its not the AC that fans knew and loved.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this game, can't even beat the first boss lmaoooooo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fromsoft once again fails to demonstrate improvement in areas where they struggle.\n\nThere is little reason that a studio like Fromsoft should struggle with displaying the correct button prompts for controllers in a game so clearly primarily designed for consoles.  The first bossfight is also poorly timed, with it clearly intending the player to use mechanics that are not explained until tutorials are accessed after the bossfight is successfully completed.  I suspect this second failure is due to poor planning on Fromsoft's part, with the introductory mission and boss being designed and implemented after the rest of the game was a finished piece - the studio has a history of such directorial blunders.\n\nThe game also seems to fall into the trap of attempting to display simplified stats for things like weapons while at the same time hiding useful information, leaving players relying on dataminers and extensive, laborious in-game testing to establish what *exactly* weapons do.\n\nAdditional features are poorly implemented.  The store system is unnecessary, providing no true limit on player builds past the very early game.  Engine load and weight already provide the necessary tools for balance.  Since you can buy and sell for the same price, in practice you simply buy, sell, buy, sell, buy, sell...it interrupts the flow of building, making the act of customizing your mecha a gigantic chore.\n\nThe story, as far as I have gotten, is poorly written and full of dull, unlikable characters with far too much dialogue for what they actually have to say.\n\nImportant missions are designed to be played halfway, failed, and restarted once the player has had a chance to tune their gear.  This is due to how the bossfights work, which are dependant on you having certain equipment to make them go by quickly enough to not drag on forever.  It's clear the devs are desperate for you to take a blade with you, but they only give you one blade for an extended period of time and it's kind of miserable to use.  It takes up a hand slot despite being  a wrist-mounted device.  You don't get any money for a failed mission, so it's just a way to waste player time.  \n\nThe \"voice in your ear\" characters are annoying to listen to, and only rarely have something useful to say.  Most of the commentary they give is cliche, and not in a funny way.  Just in a dull, unimaginative, hacky way.  Remember in Halo 2, how annoying it was to hear Cortana repeat the same voice line four or five times while trying to beat the game on higher difficulties?  It's that, but the character speaking never has any good lines to make up for it.  At least Cortana's lines in these situations tended to be more than \"Don't let him bait you.  Focus.\"  \n\n(Side Rant: He's not baiting ME you dumb fuck, he's baiting YOU.  I don't know who he is, I don't know who he's talking about, I don't give a single flying fuck about any of it.  Shut the hell up and let me do my job.  Like, at least do something useful and jam his comms so I don't have to hear his smug-ass dialogue)\n\nUnfortunately, major mech games are rare and so it's still likely worth playing this game if you like mechs and can roll with the punches.  DO NOT pay full price for this title.  Fromsoft needs to be held to a standard appropriate for a professional, well-funded AAA studio.  If they put out a 30 dollar game that they take a loss on if they sell it for less than 50, that's not your problem.  That's their problem, and they can go bankrupt over it.\n\n\nEdit:\n\nI decided to see how far I could get,  I believe I got to the final boss of the first playthrough when I ran out of patience.  I just don't understand what people get out of this.  \n\nIf you decide to go ahead, understand that the game is *primarily* about what you have equipped.  Some weapons are simply much better than others.  Some weapons can excel in certain situations but are traps 90% of the time.  Some weapons do seem to just be bad.\n\nI wish I could say I enjoyed my time, but the reality is that of the 40 hours I've spent with this game, I've enjoyed very little.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am rather underwhelmed coming from 4 Answer to this. It looks nicer due to modern graphics, the story is nice, but campaign could be a lot longer, theres a distinct lack of giant bosses to fights (most bosses are player sized) and a lack of 'companies' to take jobs for. I could do without the stun mechanic and a more generous variation of unique weapons and mech parts. Not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Man, I really want to like this one. The core idea is so good, but the game just isn't good. It starts great with some cool boss fights, but then the game runs out of ideas and each boss fight is less interesting than the previous one. It's a bit of a classic FromSoft problem, where the game is front-loaded and the latter parts of the game feel cobbled together to get the game out the door. \r\n\r\nThe story is just awful. It's not even a fun kind of bad, it's just not good, worse, it's boring.\r\n\r\nIt's just a shame. I really want to like this game. I just don't have the energy to finish it though. It's not good enough and the competition if fierce.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "tried it twice // both times it felt like i was fighting two things at once the movement of the mech and the actual boss or target infront of me // tried it on keyboard and mouse and using a controller // neither helped, maybe the game isnt for me, but the movement was just not something i could get used to",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played AC2 back on the PS2 and was thinking about it recently. I decided to pick up AC6 more than 2 years after it came out. Beat the game and got all the endings. put over 100 hours into it, very fun single player experience. Went and tried my hand in PVP and quickly found that the net code is pretty terrible. reacting to projectiles is meaningless because they end up hitting you anyway. I travel for work, so i was playing on a slightly unstable connection, and I had a few DC's. couple that with the net code and you get a very unfun experience. After the 7th match in a row against the same person, who was using a weapon that was literally impossible to dodge under the circumstances, I Alt F4'd out of the game and went to lay down. went back the next day and I spent 20 minutes in the matchmaking queue with no games found. Come to find out, Fromsoftware had instituted a separate queue for people who frequently leave matches...I havent been able to get a game since. how long does it last? well also come to find out that it can last for months...great way to kill all the interest i had left in the game, and honestly pretty annoying. if someone DC's or quits a match...give them a loss. thats it. why make your own game unplayable?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not playable on deck. Keeps crashing in the first level",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kernel level anti-cheat = malware\nuninstall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constant stun lock",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat really isnt clicking for me. Just feels like I hold down shoot and get shot in return. Dodging feels ineffective. Whatever the flow for this game is, its just not clicking for me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I've played this game since launch without any issues in FPS but now I cannot get around incredibly low FPS and stuttering. I imagine its due to EAC like always, as the game is now I cannot recommend it until FromSoft decides to grace us with proper optimization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I find the combat boring, which leaves very little to enjoy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Couldn't really get into it, it was pretty dry and dull. None of the control schemes felt good whether playing with controller or mouse. Mission design wasn't very exciting. One for the fans I imagine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a good game. the negative review is due to how this sequel was handled. \r\n\r\nbasically, this is a simplified mecha souls-like. this is a really be step away from AC series in the past. this ought to be a totally different franchise. this installment also ommited a lot of features from the past titles. no tuning of individual parts, no balancing the mech. compared to previous titles, this is quite a bit more shallow in a lot of ways. \r\n\r\nits a fine game but its not the AC that fans knew and loved.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this game, can't even beat the first boss lmaoooooo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fromsoft once again fails to demonstrate improvement in areas where they struggle.\n\nThere is little reason that a studio like Fromsoft should struggle with displaying the correct button prompts for controllers in a game so clearly primarily designed for consoles.  The first bossfight is also poorly timed, with it clearly intending the player to use mechanics that are not explained until tutorials are accessed after the bossfight is successfully completed.  I suspect this second failure is due to poor planning on Fromsoft's part, with the introductory mission and boss being designed and implemented after the rest of the game was a finished piece - the studio has a history of such directorial blunders.\n\nThe game also seems to fall into the trap of attempting to display simplified stats for things like weapons while at the same time hiding useful information, leaving players relying on dataminers and extensive, laborious in-game testing to establish what *exactly* weapons do.\n\nAdditional features are poorly implemented.  The store system is unnecessary, providing no true limit on player builds past the very early game.  Engine load and weight already provide the necessary tools for balance.  Since you can buy and sell for the same price, in practice you simply buy, sell, buy, sell, buy, sell...it interrupts the flow of building, making the act of customizing your mecha a gigantic chore.\n\nThe story, as far as I have gotten, is poorly written and full of dull, unlikable characters with far too much dialogue for what they actually have to say.\n\nImportant missions are designed to be played halfway, failed, and restarted once the player has had a chance to tune their gear.  This is due to how the bossfights work, which are dependant on you having certain equipment to make them go by quickly enough to not drag on forever.  It's clear the devs are desperate for you to take a blade with you, but they only give you one blade for an extended period of time and it's kind of miserable to use.  It takes up a hand slot despite being  a wrist-mounted device.  You don't get any money for a failed mission, so it's just a way to waste player time.  \n\nThe \"voice in your ear\" characters are annoying to listen to, and only rarely have something useful to say.  Most of the commentary they give is cliche, and not in a funny way.  Just in a dull, unimaginative, hacky way.  Remember in Halo 2, how annoying it was to hear Cortana repeat the same voice line four or five times while trying to beat the game on higher difficulties?  It's that, but the character speaking never has any good lines to make up for it.  At least Cortana's lines in these situations tended to be more than \"Don't let him bait you.  Focus.\"  \n\n(Side Rant: He's not baiting ME you dumb fuck, he's baiting YOU.  I don't know who he is, I don't know who he's talking about, I don't give a single flying fuck about any of it.  Shut the hell up and let me do my job.  Like, at least do something useful and jam his comms so I don't have to hear his smug-ass dialogue)\n\nUnfortunately, major mech games are rare and so it's still likely worth playing this game if you like mechs and can roll with the punches.  DO NOT pay full price for this title.  Fromsoft needs to be held to a standard appropriate for a professional, well-funded AAA studio.  If they put out a 30 dollar game that they take a loss on if they sell it for less than 50, that's not your problem.  That's their problem, and they can go bankrupt over it.\n\n\nEdit:\n\nI decided to see how far I could get,  I believe I got to the final boss of the first playthrough when I ran out of patience.  I just don't understand what people get out of this.  \n\nIf you decide to go ahead, understand that the game is *primarily* about what you have equipped.  Some weapons are simply much better than others.  Some weapons can excel in certain situations but are traps 90% of the time.  Some weapons do seem to just be bad.\n\nI wish I could say I enjoyed my time, but the reality is that of the 40 hours I've spent with this game, I've enjoyed very little.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am rather underwhelmed coming from 4 Answer to this. It looks nicer due to modern graphics, the story is nice, but campaign could be a lot longer, theres a distinct lack of giant bosses to fights (most bosses are player sized) and a lack of 'companies' to take jobs for. I could do without the stun mechanic and a more generous variation of unique weapons and mech parts. Not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Man, I really want to like this one. The core idea is so good, but the game just isn't good. It starts great with some cool boss fights, but then the game runs out of ideas and each boss fight is less interesting than the previous one. It's a bit of a classic FromSoft problem, where the game is front-loaded and the latter parts of the game feel cobbled together to get the game out the door. \r\n\r\nThe story is just awful. It's not even a fun kind of bad, it's just not good, worse, it's boring.\r\n\r\nIt's just a shame. I really want to like this game. I just don't have the energy to finish it though. It's not good enough and the competition if fierce.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "tried it twice // both times it felt like i was fighting two things at once the movement of the mech and the actual boss or target infront of me // tried it on keyboard and mouse and using a controller // neither helped, maybe the game isnt for me, but the movement was just not something i could get used to",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played AC2 back on the PS2 and was thinking about it recently. I decided to pick up AC6 more than 2 years after it came out. Beat the game and got all the endings. put over 100 hours into it, very fun single player experience. Went and tried my hand in PVP and quickly found that the net code is pretty terrible. reacting to projectiles is meaningless because they end up hitting you anyway. I travel for work, so i was playing on a slightly unstable connection, and I had a few DC's. couple that with the net code and you get a very unfun experience. After the 7th match in a row against the same person, who was using a weapon that was literally impossible to dodge under the circumstances, I Alt F4'd out of the game and went to lay down. went back the next day and I spent 20 minutes in the matchmaking queue with no games found. Come to find out, Fromsoftware had instituted a separate queue for people who frequently leave matches...I havent been able to get a game since. how long does it last? well also come to find out that it can last for months...great way to kill all the interest i had left in the game, and honestly pretty annoying. if someone DC's or quits a match...give them a loss. thats it. why make your own game unplayable?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not playable on deck. Keeps crashing in the first level",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kernel level anti-cheat = malware\nuninstall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constant stun lock",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat really isnt clicking for me. Just feels like I hold down shoot and get shot in return. Dodging feels ineffective. Whatever the flow for this game is, its just not clicking for me.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I've played this game since launch without any issues in FPS but now I cannot get around incredibly low FPS and stuttering. I imagine its due to EAC like always, as the game is now I cannot recommend it until FromSoft decides to grace us with proper optimization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I find the combat boring, which leaves very little to enjoy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Couldn't really get into it, it was pretty dry and dull. None of the control schemes felt good whether playing with controller or mouse. Mission design wasn't very exciting. One for the fans I imagine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a good game. the negative review is due to how this sequel was handled. \r\n\r\nbasically, this is a simplified mecha souls-like. this is a really be step away from AC series in the past. this ought to be a totally different franchise. this installment also ommited a lot of features from the past titles. no tuning of individual parts, no balancing the mech. compared to previous titles, this is quite a bit more shallow in a lot of ways. \r\n\r\nits a fine game but its not the AC that fans knew and loved.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck this game, can't even beat the first boss lmaoooooo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fromsoft once again fails to demonstrate improvement in areas where they struggle.\n\nThere is little reason that a studio like Fromsoft should struggle with displaying the correct button prompts for controllers in a game so clearly primarily designed for consoles.  The first bossfight is also poorly timed, with it clearly intending the player to use mechanics that are not explained until tutorials are accessed after the bossfight is successfully completed.  I suspect this second failure is due to poor planning on Fromsoft's part, with the introductory mission and boss being designed and implemented after the rest of the game was a finished piece - the studio has a history of such directorial blunders.\n\nThe game also seems to fall into the trap of attempting to display simplified stats for things like weapons while at the same time hiding useful information, leaving players relying on dataminers and extensive, laborious in-game testing to establish what *exactly* weapons do.\n\nAdditional features are poorly implemented.  The store system is unnecessary, providing no true limit on player builds past the very early game.  Engine load and weight already provide the necessary tools for balance.  Since you can buy and sell for the same price, in practice you simply buy, sell, buy, sell, buy, sell...it interrupts the flow of building, making the act of customizing your mecha a gigantic chore.\n\nThe story, as far as I have gotten, is poorly written and full of dull, unlikable characters with far too much dialogue for what they actually have to say.\n\nImportant missions are designed to be played halfway, failed, and restarted once the player has had a chance to tune their gear.  This is due to how the bossfights work, which are dependant on you having certain equipment to make them go by quickly enough to not drag on forever.  It's clear the devs are desperate for you to take a blade with you, but they only give you one blade for an extended period of time and it's kind of miserable to use.  It takes up a hand slot despite being  a wrist-mounted device.  You don't get any money for a failed mission, so it's just a way to waste player time.  \n\nThe \"voice in your ear\" characters are annoying to listen to, and only rarely have something useful to say.  Most of the commentary they give is cliche, and not in a funny way.  Just in a dull, unimaginative, hacky way.  Remember in Halo 2, how annoying it was to hear Cortana repeat the same voice line four or five times while trying to beat the game on higher difficulties?  It's that, but the character speaking never has any good lines to make up for it.  At least Cortana's lines in these situations tended to be more than \"Don't let him bait you.  Focus.\"  \n\n(Side Rant: He's not baiting ME you dumb fuck, he's baiting YOU.  I don't know who he is, I don't know who he's talking about, I don't give a single flying fuck about any of it.  Shut the hell up and let me do my job.  Like, at least do something useful and jam his comms so I don't have to hear his smug-ass dialogue)\n\nUnfortunately, major mech games are rare and so it's still likely worth playing this game if you like mechs and can roll with the punches.  DO NOT pay full price for this title.  Fromsoft needs to be held to a standard appropriate for a professional, well-funded AAA studio.  If they put out a 30 dollar game that they take a loss on if they sell it for less than 50, that's not your problem.  That's their problem, and they can go bankrupt over it.\n\n\nEdit:\n\nI decided to see how far I could get,  I believe I got to the final boss of the first playthrough when I ran out of patience.  I just don't understand what people get out of this.  \n\nIf you decide to go ahead, understand that the game is *primarily* about what you have equipped.  Some weapons are simply much better than others.  Some weapons can excel in certain situations but are traps 90% of the time.  Some weapons do seem to just be bad.\n\nI wish I could say I enjoyed my time, but the reality is that of the 40 hours I've spent with this game, I've enjoyed very little.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am rather underwhelmed coming from 4 Answer to this. It looks nicer due to modern graphics, the story is nice, but campaign could be a lot longer, theres a distinct lack of giant bosses to fights (most bosses are player sized) and a lack of 'companies' to take jobs for. I could do without the stun mechanic and a more generous variation of unique weapons and mech parts. Not worth full price",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Man, I really want to like this one. The core idea is so good, but the game just isn't good. It starts great with some cool boss fights, but then the game runs out of ideas and each boss fight is less interesting than the previous one. It's a bit of a classic FromSoft problem, where the game is front-loaded and the latter parts of the game feel cobbled together to get the game out the door. \r\n\r\nThe story is just awful. It's not even a fun kind of bad, it's just not good, worse, it's boring.\r\n\r\nIt's just a shame. I really want to like this game. I just don't have the energy to finish it though. It's not good enough and the competition if fierce.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "tried it twice // both times it felt like i was fighting two things at once the movement of the mech and the actual boss or target infront of me // tried it on keyboard and mouse and using a controller // neither helped, maybe the game isnt for me, but the movement was just not something i could get used to",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played AC2 back on the PS2 and was thinking about it recently. I decided to pick up AC6 more than 2 years after it came out. Beat the game and got all the endings. put over 100 hours into it, very fun single player experience. Went and tried my hand in PVP and quickly found that the net code is pretty terrible. reacting to projectiles is meaningless because they end up hitting you anyway. I travel for work, so i was playing on a slightly unstable connection, and I had a few DC's. couple that with the net code and you get a very unfun experience. After the 7th match in a row against the same person, who was using a weapon that was literally impossible to dodge under the circumstances, I Alt F4'd out of the game and went to lay down. went back the next day and I spent 20 minutes in the matchmaking queue with no games found. Come to find out, Fromsoftware had instituted a separate queue for people who frequently leave matches...I havent been able to get a game since. how long does it last? well also come to find out that it can last for months...great way to kill all the interest i had left in the game, and honestly pretty annoying. if someone DC's or quits a match...give them a loss. thats it. why make your own game unplayable?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not playable on deck. Keeps crashing in the first level",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kernel level anti-cheat = malware\nuninstall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constant stun lock",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The combat really isnt clicking for me. Just feels like I hold down shoot and get shot in return. Dodging feels ineffective. Whatever the flow for this game is, its just not clicking for me.",
      "voted_up": false,
      "votes_helpful": 9
    }
  ]
}