{
  "positive": [
    {
      "review": "Valheim with less focus on individual gear, and more focus on NPC villagers that you can manage.\r\n\r\nBasicaly if you ever felt that playing Valhaim SOLO is too lonely experience and never bothered to build too much because of that, ASKA fixes it with its NPCs, which give you reason to build and in exchange make your life (gathering chores) more automated.\r\n\r\nPROS\r\n+ new sailing mechanic\r\n+ NPC villagers\r\n+ well managed steam forum (so many other games ignore it, shame on them) with active mod/dev team\r\n+ great survival and management gameplay\r\n+ nice stylized graphic\r\n\r\nCONS\r\n- visual glitches\r\n\r\nNEUTRAL\r\n° slower gameplay especially at the start, doing things on your own is too slow and you really need to make use of the NPCs which cajn be annoing but it also feels rewarding",
      "voted_up": true,
      "votes_helpful": 74
    },
    {
      "review": "For me personally, this is by far the best survival game ever. I also think this game teaches pretty good management skills, whether this is intentional or not. And I would like to spend time describing this below because the game is awesome and is worth playing.\n\nYou may be able to survive on your own for some time, but you will suffer to beat the bosses without proper armor and weapons. Unlocking the armor and weapons takes a significant amount of time and will be super boring without the village, so you build one. First, you are running around doing things, setting up logistics, building buildings, etc. But then you realize: you can't do everything by yourself, surprise!!! It's unavailable, unsustainable, repetitive  and boring.\n\nSo you learn how to delegate more and more stuff, how to set up processes and how to eventually remove yourself from the equation so you have time to explore. And this is hard because something is going wrong all the time: constant attacks from wolves, occasional bloon moons, bear attacks, smolkers chew through your precious storage stuff...  I had to start over and over to figure optimal way to build the village. And finally ali got it! Fun and relief!\n\nAnd then the first winter... Everyone froze to death or died from hunger. Start over. Focused on clothes. Doing great, survived the first winter, yay! The second year expanding and exploring.\n\nThe second winter. Invasion. I had warriors trained, but stone weapons. Everyone got wiped out. Start over. Now I am at the point my second invasion is coming and I have a little army, but my mine is dead so I will have to setup logistics to bring iron from far away. If I survive the invasion of course.\n\nAnd this constant learning and planning ahead is what makes this game great. I definitely recommend it.",
      "voted_up": true,
      "votes_helpful": 37
    },
    {
      "review": "I write reviews infrequently, so a game must be truly compelling for me to dedicate time to writing one. Aska is such a game.\r\n\r\nAs a fan of survival-crafting games and, to a lesser extent, city builders, I began Aska with few preconceptions. To call it a pleasant surprise is a profound understatement. This review will delineate what Aska is, what it is not, what I found exceptional, and what elements may not appeal to all players.\r\n\r\nExecutive Summary:\r\n\r\nWho will enjoy Aska: Players who thrive on challenge, production and village management, and learning intricate crafting chains (which include unique mini-games).\r\n\r\nWho may dislike Aska: Those seeking deep, complex combat (it is engaging but mechanically simple), players who dislike intricate NPC/supply chain management, or those who prefer fast-paced, combat-centric gameplay.\r\n\r\nIn-Depth Analysis:\r\n\r\nAska begins like a typical survival title: gathering berries, crafting basic tools, and finding shelter. However, the game quickly transitions as you establish roots and build a base. This phase introduces the core mechanic of managing NPCs you summon for your tribe, requiring thoughtful village planning. These summoned villagers are not mere helpers; they are fundamental to your progression.\r\n\r\nRegarding the villagers: while they generally don't match a player's efficiency, they are highly competent at specific tasks and significantly reduce the player's workload. A key part of the game's learning curve involves mastering their job assignments, work-marker placement, and perk specializations. Critically, this system serves as an elegant solution to tedium; any task you find monotonous can be automated by assigning it to a villager.\r\n\r\nAs your settlement expands with more buildings and villagers, Aska evolves into a full-fledged production management game. While managing five villagers is simple, scaling to twenty—all requiring food, clothing, and housing—makes mastering production chains an absolute necessity.\r\n\r\nThis leads to your first winter, a formidable challenge that serves as a harsh audit of your planning. Many players will spend it learning from their mistakes, huddling by a fire as their village starves and freezes. While this steep difficulty might not appeal to everyone (though guides are available), I found it refreshing. The genuine threat of winter, and the realization that a restart with \"lessons learned\" was the best path forward, was a high point.\r\n\r\nFrom this point, the game loop solidifies: maintain village and production equilibrium, gear up your tribe, and hunt bosses while exploring your starting island. Concurrently, you will likely work towards building a ship, stocking it with goods and warriors to raid the outside world.\r\n\r\nAska is a game of intricate systems. After the standard crafting introduction (gather, click), the game layers on complexity. Advanced items require multi-step production chains, and key professions like ironworking and carpentry introduce bespoke mini-games. Again, if these prove tedious, they can be fully delegated to villagers. Even base location, terrain management, and defensive walling are iterative learning processes.\r\n\r\nThis iterative nature makes starting a \"new run\" feel not like a chore, but an exciting opportunity to optimize: to build more efficiently, test new locations, and experiment with different village layouts.\r\n\r\nAska is, for me, one of the most memorable gaming experiences in recent memory. I had initially shelved the game to avoid burnout before its full release, but one specific update pulled me back in.\r\n\r\nThe Game Changer: The Sea Raiding Update\r\n\r\nI returned to Aska specifically for the Sea Raiding update, and it is transformative. A primary drawback of the earlier game was a finite map and a lack of clear endgame goals. While the starting island is large enough to occupy you for the first couple of winters, it is ultimately finite. The Sea Raiding update shatters this limitation. It allows you to build a Karvi (ship) and launch expeditions with eight of your villagers.\r\n\r\nHaving only scratched the surface of this feature, I can confirm it is a masterstroke. Aska was already a fantastic game for its first few in-game years, but this update fundamentally alters the experience. The world is now massively expanded (its full size is, as yet, unknown to me), offering raids for resources that may be dwindling on your home island. The sailing mechanics—which include a learning curve for those unfamiliar with basic sailing concepts—feel authentic and immersive. As a sailor myself, I appreciate the subtle touches. This update elevates Aska into an elite class of survival-crafting titles.\r\n\r\nConclusion\r\n\r\nIs Aska for everyone? Certainly not. But if its core pillars—challenge, management, and deep systems—resonate with you, you may lose hundreds of hours exploring its subtle complexities. If, however, you seek a traditional, action-heavy survival game or a \"fire and forget\" experience, you will likely find Aska's deliberate pace and intricate management tedious.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Great game for playing with my wife, and very realistic in many respects. Like... what she builds is hers and what I build is mine and hers.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "[h3][b]It Does Get Better[/b][/h3]\n\nThis is the first thing I'd say when considering to buy. My first 8 hours as a new player was miserable, frusterating, and tedious. There's a learning curve with how things work and what to build first, but once you figure it out it does turn into a rather solid survival-city management game. I'm currently on my second play through and enjoying it just as much as the first (after I figured out what to do.) As a side bar, if you want to know the biggest tip I could give for a new player is... rush the farm, start growing flaks every season, make clothes. Winter is coming. And it'll make you want to quit if you and your village isn't fully clothed.\n\n[h3]Not Without Its Problems - Bugs and Changes Needed[/h3]\n\nI'm going to begin by listing bugs and suggested changes, and I'll list them based on how severe they are to the overall flow of the game.\n\n-Villagers assigned to the Blacksmith plain do not want to work. Sometimes, I can get a few nails out of them, but they mostly are too concerned with filling their storage with random crap, then complaining its full, OR they spend all their time constantly lighting the fire in the Metalwork, even if they're not assigned to tasks there. This is really bad for late game, requiring the player to fully take over all the metal needs, which is a lot late.\n\n-Woodcutters prioritize cutting trees rather than carrying the logs back to their storages. Which leads to the next problem.\n\n-There needs to be a \"Supplier\" role that functions the same way Builder does, in that it can be infinite and they will fill stations and warehouse storages. Currently, you can have a limited amount of villagers per warehouse storing what they have storages for. However, every crafting station spends half their time going to the warehouse, rather than crafting. And you need an excessive amount of warehouses and workers to keep the supply moving. This needs streamlined, badly. You can have a million of the materials they need laying around but just not enough hands to load the warehouse before the worker needs more.\n\n-Market workers hate their job, and will completely break often just standing there doing nothing. This is also where the \"Supplier\" job would make things significantly better since the Market/Outpost system is a broken mess right now, and it doesn't fix the problems of constantly being on short supply of logs and other needed goods.\n\n-Villagers should be able to use carts outside of market workers. They're terribly inefficient due to it.\n\n-Bosses are, horrendous. They're stupidly easy. To the point where you could be naked with a wooden hammer and smoke them. Alternatively, the Draugr boss and the stone Jotun Giant, like to spam knock down moves repeatedly, which means you stand up, then get locked in a long stand up animation, over and over... and over.\n\n-Iron Plates do not drop from gear when they break. I love the tool system how they drop their metal part, however - this is a huge problem later since mines are not infinite and will eventually run out of iron, as Plates are expensive. They need to drop when broken.\n\n-Carpenters are terrible at their job. Although I do believe this is fully from the issue of supply not being able to ever fully catch up with demand. Again, \"Supplier\" role. Not a house, but an alternative role like how the builder works. We need an infinite amount.\n\n-Walls need a bigger leeway when it comes to counting as connecting. I've had them literally kissing and it still says red. Takes too much playing around to get it to decide it's good.\n\n-Blood Moons and especially Invasions are WAY too easy. A complete joke easy. I know the game received criticism for being too hard early in its life... I'd like to try how that was with the current fixes because there is way too little of a threat, and I have zero army in my village. I can solo it without problem. Invasions are supposed to be this huge build up, but it's like a bunch of gnomes with knives come out instead. I think the best way to do this is to add more options when creating the worlds. More enemies on Blood Moons and Invasions to make them a real threat would go a long way for replayability. If you see a review saying, \"ITS SO HARD\" or \"YOU WILL RESTART IN THIS GAME\", they're full of it. It's a joke fighting wise.\n\n-Cheiftan's house should function the same way the longhouse does, with being able to expand it. Can hardly fit anything in my house.\n\n-Aska's, the female character, neck is... really long? lol.\n\n-Animal models look horrifyingly awful, specifically the dogs. Need a model update.\n\n-Combat could use some updating but this is quite minor. Even if it went live with the current combat it'd still be fine, just could be better.\n\n-When doing carpentry or blacksmithing, allow us to keep swinging while being able to rotate, gets annoying having the animation stop.\n\n-Dodge rolling needs some forward momentum.\n\nOverall I would recommend the game right now as once I figured enough out to survive winter and work around the kinks I'm still very much enjoying myself. The learning curve is a slight hill, not a mountain, so if you're interested give it a shot and just remember--this is really important--it does get better.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "This game’s not for everyone. If you want fast action, instant gratification, flashy explosions... this ain’t it. But if you’re the kind of person who likes the grind… who enjoys building systems, solving problems, managing chaos then this thing hits different. It’s automation. It’s micromanagement. It’s colony building. It’s W-O-R-K. But it’s the kind of work that makes you feel smart. Like you’re actually doing something.\nYou're playing your second life... and what life has? A real freakin job, and you have it here, but in an ancient, brutal, resource-starved environemnt. And when you finally get your systems humming? That’s the payoff. Most people won’t get it. But if you do? You’ll love it. Honestly, I would even buy the game at full price.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "First thing - the elephant in the room that many reviews seem to be discussing: Valheim.\n\nMany other reviews seem to fall into two categories: those that compare everything in the game to Valheim (tend to be negative reviews) - and those that stress that this game IS NOT VALHEIM - nor is it intended to be a Valheim clone. Just as It would be silly to compare the original NES Ninja Gaiden to AC: Shadows (both are set in \"ninja worlds\" and both are nominally action games), you should not go in expecting Aska to be a clone of Valheim just because both are set in mythic Viking worlds and are crafting/survival games.\n\nNow that that's out of the way - this game is not for everyone. In my experience so far, it is much more Rimworld/Dwarf Fortress than it is AC: Valhalla. There is much more focus on city building, survival, crafting, and managing your villagers than it is hack-and-slash combat. So if you're looking to jump in and have an axe covered in Jotun blood within the first few hours, you'll be very disappointed. \n\nNow that we've now what kind of game it is - how does it stack up? \nI had this game on my wishlist for a very long time before actually picking it up and trying it out - I'd seen a lot of \"mixed reviews\" that kept me from leaping in, but most of what I'd seen showed a lot of promise and seemed like something I might actually love. - I'm glad I picked it up when I did. \n\nThe game is still in early access. As I mentioned before, I kind of followed Aska's progress for a while before I bought it, and one thing I noticed during that period that made me pull the trigger: The Devs seem very dedicated to fulfilling the ambitions they have set for themselves with this game. It seems like just about every time I look at the store page of this game, steam is always showing a LIVE stream of the devs playing their game (not a re-stream like so many others).\n\nThe BAD:\n\n1. Learning Curve\nThere is a steep learning curve to village/villager management, especially if you're not familiar with colony management sims. But once you get the hang of it, the game opens up pretty quickly. I recommend watching a youtube video or two if you are not accustom to colony sim mechanics - it will save you lots of time. There is sort of a tutorial, but it needs a lot of work. However, the tooltips are GREAT (once you know where to look) - things went easier once I realized most of the information I wanted to know was THERE, I just needed to know where to look for it. \n2. Random Map Generator\nThe random map generation needs a bit of work. IMO, they should make it so at least 1 cave is somewhat close to the starting area. \n3. UI\nThe interface/default keybind system takes some getting used to, it's probably not what most people are used to in similar genres, and could use some work. Some of the UI stuff is innovative and I actually grew to like better than other games so count this partially in the \"good\" section of the review- e.g. hold 'R' to harvest automatically pulls out the correct tool from your inventory and starts harvesting the rock/log/etc in front of you as opposed to having to select the correct tool yourself and then start chopping - this saves a lot of the typical headaches of swapping tools and moving them on/off your hotbar. However, the menu navigation still needs some work though and feels clunky sometimes.\n4. Terraforming \nSo far they've done a pretty good job on this one - but it's still not perfect, and those imperfections can lead to big headaches - like that one little pyramid spike of dirt that you can seem to get rid of, or the hump on the edge of the ramp that your character only seems to be able to walk over without falling down a level 50% of the time. \nAlso dedicated hotkeys for level terrain/create path/build road would go a long way here - this ties in to some of my UI complaints.\n5. Custom Difficulty settings\nSome more options would be nice here - from what I understand these are a fairly recent addition, but there are some settings I'm still not seeing a \"just right\" option for. The settings for monster attack frequency/day length/season length, etc. could use more options in between what's currently offered.\n\nThe Good: \n1. Bugs (or lack thereof)\nThere are very few bugs that I've encountered - I think I've had 1 crash to desktop? \nNew features are constantly being added. Patches seem to be frequent and substantive - rebalancing things, responding to community feedback, fixing QOL things, etc. Even the multiplayer seems relatively smooth compared to loads of other similar games that seem to struggle with multiplayer in EA. Aska has FAR FEWER BUGS than I remember in Valheim (which still had optimization issues last time I played it).\n2. Breadth, scope, multiplayer, everything else?\nThere is SO much in this game to keep you busy/having fun I don't know where to begin. And I would have said that before they added viking ships raids in the most recent patch. Hours often fly by when I'm playing this game and before I know it, I've barely even left the immediate area of the village and the season is changing again. From my limited experience with multiplayer, I get the feeling that the chains of micromanagement aren't as big of a deal (if that's really not your thing), however the villagers are there to do most of that grunt work to begin with, so maybe I just enjoy the grind too much. Also you can tame wolf cubs, fish, poop, farm, fight alien things in caves, defend against raids, ATTACK monster camps, built outposts to help with logistics, cook, go raiding on your viking ship, fortify your village, oh yeah and there's a whole magic system too, which I've barely had a chance to touch it because I've been too engaged just building my village.\n\n3. Price\nIf this type of game seems like something you would like, it's well worth the money even at early access, this game is a great buy.\n\nThe Hope:\nI really hope the devs stick to realizing their ambitions and don't release 1.0 too early. The game still needs work on several QOL things, however, none of the issues are game-ruining and it's incredibly enjoyable as-is. There is also some progression and content that I don't think is in the game yet, so if you're someone who wants to \"beat the game\" you might want to hold off until 1.0 - but I'm excited for what comes next. I don't know what their plan is for mod support on this game, but as some other reviewers have already said, mods could play a HUGE role in this game's future (in a good way). \n\nTL;DR:\nCurrent meta rating of \"mostly positive\" feels unfair - I'd say it should be \"very positive\" with a potential to go higher at full release --especially at this price point. it's a Fantastic game if you like Rimworld but want it a little bit more hands-on. There are so many different game mechanics in Aska, I feel that it has something for just about everyone. Co-op multiplayer is great, but single player is viable. Very few bugs encountered, but QOL needs some polish still. I will continue to look forward to what they add next, which hopefully will eventually include mod support.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "About 400 hours solo and the best 25 bucks I’ve ever spent on a game. Every update just gets better and better.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Constant updates, Devs listens to playerbase, Devs are active on discord, its very fun and worth the price. :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Had a dear friend recommend this game to me, saw it during a sale and thought id give it a whirl. \r\nHave been thoroughly impressed with how well the AI villagers work and how much depth this game has to offer. \r\nA few QoL features would be nice but its early access so I am sure they are in the pipeline.\r\nCurrently I haven't had any issues or bugs at all, rather rare for new games on the market!\r\nI love rts games so this has been an amazing experience tho I would warn people looking for a more rpg-style game, this probably isn't for you.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ There is also Pong...\r\n☐ Just don't\r\n\r\n---{ DLC }---\r\n☐ Worth it!\r\n☐ Good\r\n☐ I mean it's alright\r\n☐ Boring\r\n☐ Think twice\r\n☐ Watch 100 hours Nyan Cat Instead\r\n☑ There is no DLC\r\n\r\n---{ Audio }---\r\n☐ Mesmerizing\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☐ Teens\r\n☐ Adults\r\n☑ Anyone\r\n\r\n---{ PC Requirements }---\r\n☐ You can run it on a toaster\r\n☐ Potato\r\n☐ Decent\r\n☑ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Isn't necessary to progress\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ It'll replace your life\r\n☐ Masterpiece\r\n☐ Good\r\n☐ Average\r\n☑ Some lore\r\n☐ No story\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a can of Energy\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ Total Warhammer II (100%)\r\n\r\n---{ Price }---\r\n☐ It’s free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying\r\n☐ Goat Simulator?\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ Overall }---\r\n8/10\r\n\r\n\r\n---{ Notes }---\r\nThis is an amazing start to an amazing game, I hope they keep giving it the love it deserves!\r\nIt could definitely use some polish and an update to help with FPS, as when your village gets pretty large your FPS tanks.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of good things to do in this. I'm hoping the mid and end game is as engaging as the early. I feel like it is just hard enough to be challenging withing being frustrating.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My Experience\r\n\r\nYou spawn, gather some sticks, build a small community, and live happily… until a bear shows up and wipes out half your village.\r\n\r\nStart a new game, now you’re smarter. You build an army, live happily… and then everyone starves to death.\r\n\r\nStart another game with custom settings — longer days and nights. You’ve evolved, you’re ready to conquer everything… winter arrives, and half your village freezes to death. xD\r\n\r\nAmazing game, especially with friends! xD",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "What a incredibly good game, just wow! Took me quite a few hours to start getting the hang of what to do and how things work, but once you get the hang of it the depth of this game is unbelievably fun, engaging and incredible. So many things constantly going on, threat of winter, threat of blood moons, threat of invasions, to stabilise your village processes and defences, so much more. It's extremely rewarding to see your village thriving amidst all these things. After bit of time and learning, this became one of the best, if not the best game I've played. Extremely well done devs, thanks for this awesome game, will keep me busy for a long time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a pretty phenomenal game.  Definitely under appreciated, in my opinion.\n\nIt's essentially a survival colony builder.  You spend your time crafting but also hiring villagers, defending your village, going out into the world to find cool things, and automating your production at home.  The seasons play a big role and you have to manage how you approach the year.\n\nThe crafting early game is very laborious, but I found it fun still... it takes a while to complete any building because of the array of resources needed, but it also feels good when you finish something.  I like the way buildings can be expanded out, and I also really love that every little part of the manufacturing process has its own in game management.  For example you see leather on the racks drying and tanning, and you craft your thread at the loom but your clothes at the workbench, stuff like that.\n\nThe combat is decent.  It's not souls-level, but I would put it on par with other games of this style like Medieval Dynasty or even something like Enshrouded.\n\nThe world is beautiful and well designed, and I really like the quality of life features like using the Z key to scan for resources in your local vicinity.\n\nThere's so much about this game that it's hard to pin point any single thing to call out here, but I can say for certain that this game has me hooked much harder than most games of its style and I really look forward to building out a much larger village and going out on raids at some point.\n\nDefinitely recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The gameplay is a good building simulator which reminds me of playing Valheim but with NPC villagers management",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game was one of the best going-in-blind experiences I had in a long time. I fumbled with some underexplained mechanics and did things unoptimally but that's actually what would happen if you got dumped on a deserted island at first, isn't it? The villagers sometimes do things in a dumb way but again, that's what happens with real people too right? You can sometimes mitigate their actions with micromanagement if you want.\r\nAnd in the end I pulled through without resetting and got to the admittedly underdeveloped endgame where I'm taking a break before taking on the raiding gameplay of the newest update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing this game for a little bit now and while the start can be a bit rough, because the interface doesn't feel very intuitive, I can say I definitely enjoy this game and where it is going^^ If I would have to describe it based on other games, I would say it's like a cousin to Soulmask or a Valheim, where you aren't alone handling everything.\nThere is alot to do and at times it can be overwhelming to try to prioritize between tasks, but it's also these challenges that make me enjoy it. It can be incredibly unforgiving, but once you get somewhere, I actually felt like I earned my stay in the world with sweat and tears XD many many tears. Especially the damn lack of sticks and always meddling Rabbit like Pests trying to eat everything and even from the villagers pockets >.> \n\nI can confidently recommend this to anyone who likes survival and city building and whomever likes the freedom of more sandbox-like games ^^",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game keeps on giving. I have fallen in love with it, and I have to say the devs are amazing. I joined the Aska discord and the devs actually listen to their community and adjust things for a better player experience. I love the management part of the game, you really feel like a leader, where you need to think about all the different aspects to make it all work together. Its really satisfying",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "🪓 Come for the Viking survival, stay to rescue your villagers from walls\n\nRecommended — “Worth a Shot”\nRough around the edges, but easy to lose a few hours building with friends.\n\nASKA feels like Valheim meets an RTS, except instead of barking orders from above, you’re right there in the thick of it with your villagers, hauling logs, shaping metal, and watching your settlement come to life. It really captures that feeling of building something together, which most survival games miss.\n\nNow, it’s early access and boy does it show. NPCs sometimes walk into walls until they pass out trying to get to bed, carts love to clip into the ground, and you’ll run into plenty of odd bugs. Nothing completely game-breaking, but it’s definitely rough around the edges.\n\nCombat’s basic and the raids are pretty tame (don’t expect Conan Exiles or 7 Days to Die chaos), but there’s a simple charm to working alongside your crew, cutting lumber, and forging tools to keep the village running.\n\nIt’s definitely best with friends. My wife and I had a great time building and laughing through the chaos.\n\nIf Steam had more rating options, this one’s a solid “Worth a Shot.” Not perfect, but there’s something special here for anyone who likes to build, manage, and get their hands dirty with their viking crew.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A game like valhalla or enshrouded but with your own real close knit npc community. go from nothing to feeling like a king i love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "8/10, could play this for hours and hours, would've gotten a higher score if it was a bit more optimized (70-100fps 9070XT 1440p). Performance isnt that big of an issue though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Picked it up on sale 40% off, it's been on and off my wishlist for awhile, but glad i finally picked it up. I've overall enjoyed the game, and at $20 cad on sale its been worth the buy, full price I think it's a bit high for early access at $32 cad. Your character screams when you use the outhouse, and there's a shark creature.\n\nHave only played it single player, and some things have been a bit tedious in the first year, but there is also some limited world settings you can play with to make things easier. Biggest issue is probably just the combat does feel a bit janky, and you can't really 1vX much, but also can't bring villagers with you early game so it compounds the issue.\n\nOtherwise the biggest issue is the performance needs some work. The game is too ugly on the lowest settings, but on high settings struggles to pass 80fps on a pc that can run most games 144fps or more on high settings. 80fps is doable, just could be better. Otherwise only one crash in 36 hours while changing villager schedules.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Valheim x RimWorld with slightly better combat than Valheim.\n\nI'm actually having more fun with Aska than what I did with Valheim,\nOnly thing I'm missing from Valheim is free building and tougher sieges.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Aska, is a solid game, in the same genre as Dawn of Defiance, and yet, it possess a much more ponderous process, resources are spread out and/or behind progress gates for example without a farm producing flax, you'll be picking it in the wild practically every single game day which can mount up into in game time, find [my own words here] soul stones from ice giants blood litter around world takes time to crack open, before that I have to gather a lot resources to make a Odin stone, to summon villagers, which has a timer on how long it takes to summon, then I have to house the villagers, keep them warm, keep them fed, cloth them in winter [which is Frost Punk levels of brutal] and most of all keep 'em workin' on top of that my character movements are heavy and ponderous and held at ransom by a stamina bar...\n\nOk...Let me cut it down a bit\n\nVillagers when you've summoned them make a major difference, however, they do need a fair bit of helicopter parenting, you have to ensure they are tasked with work, they'll snap to it but if they can't do a thing they'll follow you about like puppy and say they can't instead making a leap to provide for themselves: \nVillager: Yarl! I haven't got any firewood to make coal at the Kiln\nMe: what are you telling me for?, the tool maker has made the necessary axes for you, and the foresters have left enough tree stumps for you to chop into fire logs...*eyebrows raised questioningly*\nVillager: Yarl! I haven't got any firewood to make coal at...\nMe: Just...sigh, I'll be right back with the\nVillagers 2,5,8, 10 and 14: Yarl\nMe WHAT IS IT NOW!?!\nMe also: THOSE DAMNED RABBITS ARE STEALING OUR SH*T AGAIN!!\nYes, you read it right, giant rabbits [some with horns] will sneak into your village and steal all your sh*t, if you don't see them off\n\nI'll not give it a no because Aska is a good game, even in early access; if you like your survival games at a sloooow pace Aska will indeed deliver\n\nIf you don't like watching the sun rise and fall in real time and feel like you're not getting sh*t done in-game then give Aska a very wide berth.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "my wife and i haev been enjoying this game greatly , has a good combination of crafting, fighting and building cant wait to see how this game porgesses more over time",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So unique and satisfying. Hope other devs are taking notes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really have high hopes for this. so far it has been amazing. very excited to see what the future holds for this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for the little time I have played I think its worth it  I just hope the devs keep on add and improving on this one Good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a survival village builder with a Norse theme.  Think Conan Exiles or Soul Mask, or even Medieval Dynasty with more survival elements.  Like Medieval Dynasty, you cannot custom build structures but you can add furniture.  There are some neat mechanics and I've really enjoyed it.  While there's only one biome it changes a lot during the seasons.  In fact I'd say this game has the best visual differences between the seasons of any I can recall.  My only real complaint is that the framerate definitely suffers in the deeper forest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game where you can manage your very own Viking Village/Colony. But beware it is realy dificult and still in Early Access so expect bugs and game mechanics that can break over time or get changed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm starting to get the hang of it after more than 300 hours of gaming. \nSo far i have encountered a couple of small bugs.\n1. The gatherers stopped gathering although there where plenty of resources at the markers. Fixed wit a restart of the game but it seems that the gatherers should get some improved AI.\n\n2. Highlight of objects disappear but a restart of game fixed this.\n\nWhat i don't like in this game is that the blacksmith, carpenter and others are addons to a workhouse. For me this make the tasks very messy and i would like to see them separated.\n\nWhat i would like to see in this game.\nDynamic sized icons on map. My map is messy on zoom. Also keep the last zoomvalue maybe. \nThe stone and woodcutters should have carts or sled.\nSort button in storages.\nThere should be room for storage (food and arrows) in the towers, at least the guard tower.\nBlacksmith should be able to make spring for gates to close automatically.\nMore animals maybe, chickens for food and feather. Horse for the cart.\n\nHopefully the developers will give us some of this and more. They probably have some surprise up their sleeve.\n\n\nOverall i love this game and think it has great potential. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun games i ever played so far.\nThis game is definitly worth playing and buying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game need a lot of polishing before anything good can be said.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fun highly recommended it. It may be a bit confusing at the start but wants you find out how to do things it becomes better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, surprisungly big game loop. Villager mechanics are good. This and Bellwright have really been scratching an itch if you like that sort of thing :-)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love Colony Sims, Survival/Crafting, and Tower Defense. And the monkey in my brain is banging all of their symbols in my head with this game. I absolutely love the Nordic theme. Harsh realities of cold weather play a part, so lets make fur clothes! That way we can survive the waves of undead knocking on our door (well, palisades). Why are these villagers so needy? Lets fix them and give them what they want.\n\nAll to say this game is actually good. Not great, good. There is still a lot of work to be done. Then again, a lot of work HAS been done to get it to this point. I urge the developers to continue to work on this because this is absolutely worth the title of \"Labor of Love\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game, and the devs keep working on making it even better. I've never had an early access game that felt so complete already, and every time they release a major patch for it, it feels like a level of DLC I would expect to pay for.  The ai for the villagers keeps improving every iteration and while it had (has) problems, they started out from a better place than most games that have villagers. Really beautiful and very engaging. I like it best played multiplayer cooperative, but even in the quiet hours alone, this is a comfortable but still challenging game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very polished for a game still in early access. the systems are well thought out and improved by attentive devs. this has been and continues to be one of my favorite games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game SO much. I played it so much with my brother and we had so much fun... however, i do wish there were less bugs... Progression is pretty good but it slows downs a bit after iron... In the end, I am very exited to see this in the future and see what they add.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game! Can't wait to see what else they add as the updates go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely an amazing time if you love survival colony games and I have yet to fins a dull moment playing it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game is fantastic I think it's fun it's great it's all around good minus the freaking bunny rabbits they're evil and they getting your shit. I have no complaints about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Many will might find this to be a Valhiem clone.  I disagree.  I find this to be the superior of the two.  I love having the villagers.  I dislike the limitation of 4 players.  Only being able to play with 3(at a time) of my friends is disappointing.  The graphics are solid.  This is an always 3rd person view game, so if that is an issue for you like it is for me be aware.  The rest of the game and the placement of things keeps you from dying from random stupidity.  \r\n\r\n There are scheduled events that you can prepare for each play through.  Each world seed is different so your play experience will be different each time you play.  Resource collecting can be completely done by your villagers.  You can also gather  a militia and take them with you on fights or other adventures. \r\n\r\nMy wife and I have already spent over 100 hours each playing together and alone sharing what we've learned with each other.  Looking forward to many more hours eaten up by this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, very heavy micromanagement needed but fun, love a good challenge. Visuals are insanely beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10\r\n\r\nA good friend of mine bought me this game to join him and I thought at first the game we neat. Not great but neat. Then the more time I actually spent in the game the more my opinion of it shifted.\r\n\r\nThe game is actually great you just have to learn how to play it. The more you play the more you learn and the better the game becomes. Learn from experience, talk to other players, watch videos and experiment and the game grows on you big time.\r\n\r\nThe game is not without bugs or issues but is so well done and so much fun I give it a 9/10. I have had no direct communication with the dev but jsut take a look in the forums and you will see how much they care and how engaging they are in helping people. This is a top notch dev and I cant wait to see future updates and fixes and what other projects they work on in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a addicting survival craft! As someone who plays a lot of survival crafts, this feels like a mixture of Valheim and Medieval dynasty. Its not as in depth as the system in medieval dynasty but it still scratches that settlement management itch while still keeping the combat and exploration is a lot like Valheim. Combine all of that with it price id give the game a solid 7.8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't played in a couple months and see new stuff has come out. \nI like this game, I recommend it. It is different and the devs are still actively working on it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an amazing game but solo can be overwhelming  as there a tons  stuff to do ,,, im with 2 others friends and omg i love that ... dont listen bad reviews wich  were from begin of the game and was pretty emtpty and boring but  NOW omg  amazing game  10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my comfort game, I love the visuals and sounds of Winter that make me snuggle deeper into my couch. Raise yourself a village, manage and care for your faithful followers. Provide infrastructures to maintain food, armour, tools and weapons and let your villagers thrive as you explore and ponder their path forward into an uncertain world.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 162 hours in ASKA, I can confidently say this game has been one of the most enjoyable survival experiences I’ve had in years—especially in multiplayer with friends.\r\n\r\nWhat makes ASKA stand out is how relaxing yet rewarding the gameplay loop is. It’s a survival game, but without the constant stress you get in other titles. Instead, it leans more into exploration, base-building, and micromanaging your NPC villagers, which is honestly one of my favourite parts. Assigning roles, watching them gather resources, and seeing your settlement grow feels extremely satisfying.\r\n\r\nI’ve spent countless hours building boats, sailing out to different islands, and expanding our territory. Even after all this time, I still haven’t found the dragon needed to conquer the flying beast and unlock the Crystal Golem, so there’s still a lot left for me to discover.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun Viking survival village builder. The lack of an auto-pickup is kind of annoying, but it's still fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game so far: multilayered, very complete sim and great atmosphere.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad game. \nNeeds more content. \nThe loss of skill progression from death is heavy. \nCombat needs a little more work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the most addictive games i've ever played would highly recommend to anyone who loves Norse, survival and village management.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is everything Valheim didn't have, in my opinion. gameplay is fun, with friends this game is even better. just wish the smilker raids weren't so funny...they just kill themselves on my spiked walls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This fantasy survival game is developing very nicely toward my all time favorite survival game.\r\nGraphics are high end with fun animations in crafting, harvesting, and combat. The AI for the NPC is very impressive and the main reason I enjoy the game so much. Combat could be a little less clunky, but still fun as it is a mix of player skill at tactics and maneuvering matched with gear.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, but EXTREMELY tedious and has quite a few bugs/issues (Big ones for me were cooking and forestry). Inventory management is not fun. I'll recommend it, but hesitantly. Maybe wait for an update that includes some major QoL upgrades + bugfixes. Content is nice and all, but if it's too frustratingly tedious to get their, people will drop the game before experiencing all that you have to offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First I'll say this, the game can be Slow and Grindy at times, BUT...  I Definantly enjoy this game, and would highly recommend.  There is a little learning curve for first time players, but it's not terribly steep.   I enjoy the Building mechanic, and the fact that villagers tend to be able to handle tasks effectively on their own.\n\nI do have some Minor gripes:  \nI think villagers should be able to be assigned to multiple jobs, or maybe buildings should have fall back jobs.  I often have villagers just standing around because their \"job\" currently doesn't have any tasks that need doing.\nAnd the limit on farmland should be relaxed a little more, either by somewhat larger fields or more placeable.\nbut I mean those are more about My likes/wants than game mechanics issues.\n\nOverall though, like I said, I Highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has it's bugs as all early access survivor games do, but honestly, I've enjoyed my time even watching bugs happen throughout my playtime. I'm hopeful to the future of the game and look forward to each update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love coming back to this game, it gets better with each update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not an easy game (learning curve). There are some cool innovations unique to Aska that are nice positives, such as foliage shrinking when looking for materials. Overall it's an ADHD fever-dream in that there's always another task that needs doing. In my playtime so far I've reached near the 100 (in-game) days mark. \r\n\r\nTL;DR - Viking union/babysitting simulator. Lots of QoL opportunity.\r\n\r\nFeedback to devs from scribbled notes as I play, I hope they read this:\r\n* Do we really need 4 \"interact\" controls? So many things could be one button. Really. Pickup and place don't need to be different keys. Look at ARK, Valheim, Enshrouded, or similar\r\n* Almost every buff is too short - food, rest, petting the dog, all uselessly short duration\r\n* The amount of food the dog eats is insane. Like a whole deer per day\r\n* Tier 2 water container decays, not an upgrade\r\n* Dismantling structures is more clicks than it should be\r\n* Multi-purpose workshop addons are confusing and easy to build in an unoptimized way by accident\r\n* Resource \"vision\" would be great as a toggle rather than a short \"buff\"\r\n* Seasonal forage should respawn every new season\r\n* Structures need \"minimum target\" resource levels - i.e. NPCs should keep <20> Fiber/sticks in the workshop\r\n* Workers will sit uselessly waiting on resources rather than gather them from nearby (firewood, sticks, etc.) - this is my Viking Union comment, all of them say \"that's not my job\" so you babysit too often\r\n* Woodcutter and stone harvester need to use a cart\r\n* Gatherer needs a basket (could go in large item slot) or cart\r\n* Pending buildings should auto-prioritize workshop tasks\r\n* Building/structure descriptions and details need more info on function\r\n\r\nThat's all intended to be constructive feedback, not criticism. I like the game, devs! I hope you keep going.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. There are still things to work on, like better ways to manage what who can take, or what to do with some beginning resources (especially with small stones and branches). But still fun!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In ASKA's early days, it was seen as a sort of \"Valheim-knock-off\" but as updates are continually released, ASKA distinguishes itself among the best of survival and settlement building games! The developers are continually monitoring and listening to it's community feedback for future additions, improvements, tweaks and fixes! I can't wait to watch ASKA surpass even ARK!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The team behind Aska is doing such an excellent job. I have been following and playing this game for the last year and it has only been getting better with every update. They are quick to fix bugs and add/change things that the community request. I fully recommend this game to anyone because it is fun in singleplayer and multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a wonderful blend of some of my favorite styles of games. It feels like a combo of Banished and Valheim, with some automation elements dashed in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game, it is in early access, however the love and attention this particular labor of love game the devs have been working on in my mind is great!. dont let the negative nancies of the world tell you its hard managing the villagers, it is not and there are ways around multiple diffrent problems they come up with with the food and what not people keep complaining about. love the idea this game has had for village building and management combat isnt horrible but def could use a little polish. all in all this game makes you think and is super fun to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite interesting, both building, discovery and mysticism, as well as action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Sunk many hours into it. Plan on spending many more. I love the management although it doesnt need alot of tweaks from villagers getting stuck in the tiny warehouse pathways to figuring out where the bottlenecks are slowing to outright stopping the entire production lines. Traveling on foot is a pain long distances even with roadways. Small things in my opinion compared the difference of entertainment. The yearly Winter walker raids increasingly more powerful are a ton of fun fighting and trying to set up next years defense. Overall absolute blast. Hopefully the small stuff gets fixed with time as the Devs have showed they actually make changes needed AND requested by the ocmmuntiy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has all the vibes of Satisfactory, but with the automations of a colony builder like Manor lords.\r\nWhile also having the same AI stupidty of Manor Lords.\r\n\r\nOnce it gets some polish, some better AI overview controls. It has potential to be GOTY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game in it's state! would love even more for more added content in the future!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would describe it as a Viking themed village sim with periodic raids and world bosses.\r\n\r\nI have been really enjoying this in it's current state, and look forward to doing more play throughs at the dev team continues to work on it. This game is not Valheim, which many try to compare it to. This game is not for everyone, especially if they enjoy simple games or ones where all you have to worry about is your own character. I recommend playing when you don't have \"tired brain\", or lots of distractions and can take the time to understand the mechanics, which will result in a very enjoyable sim-like experience.\r\n\r\nHosted multiplayer has been very fun with friends. If you want to run around and play as a Viking but don't want to do village management, then joining someone's game is a good way to go. You currently cannot take the same character into multiple games, however there is a work around for this (check discussion threads). This work around can also be used to retain progression after starting a new game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game looks gorgeous.\ncolony building is pretty good. \ngameplay feels good enough.\n\nthe world is filled with way too many hostile spawn point. it takes so many world reroll to get a iron deposit  thats not being guarded by draugr, golems, or even a bear boss.\nterrain is not very friendly for making huge villages. ther raid event happens way too much, the first being at day 2.\n\nbut none of these problem is severe enough to stop playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game. It's so addicting. With all the settings you can tweak and different maps each time you start a new game. It's hard to believe this game is still only Early Access, it's the size of a full game already! I do wish we had a way to tame Fennmar for a mount or have a coop for some birds to get eggs easier. But I have no complains!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Estou gostando do jogo até aqui. O craft, gestão da vila e dos npcs está ficando muito boa e diversificada, só ainda precisa de alguns ajustes de melhora, como adição de um blacklist além de um whitelist, e tb melhoras nas opções de gestão de cada prédio, como inserir opção para ajustar um aldeão para fazer troca de itens somente entre alguns prédios e não entre todos, ou entre somente o que ele está designado para trabalhar. Mas os devs tem implementado muitas melhorias e feito isso constantemente o que é um bom indicativo para o game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is truly a hidden gem . I wish more people would give it a shot whether alone or with a friend! Does it have its flaws? Absolutely! but this is a really exceptional game and tons of hours of fun and creativity. Love the Villager aspect of this and how it comes to life. I wish they would not chase me down all the time but at least they are trying to do their jobs!! So excited about the new update with exploring the seas this should be awesome!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once I got the hang of it (and tbh, I'm still figuring things out), I cannot not put this game down. I can start over and play forever just on the main starter island. I haven't even gotten to sail and go to the other islands, there's just so much to do! Continuously refining and tweaking everything and making sure that my village runs optimally is just so good. And that fact that I can play co-op makes it even better!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Alright so here we go,\n\nAnyone who likes Valhiem, Sons of the forest, age of empires etc will probably enjoy this game. There's a small learning curve when it comes to the game mechanics. \n\nOnce you get used to the building mechanic its actually an enjoyable game.\n\nWhat it needs to improve:\n\nAssign villagers two jobs or subtasks\nmore buildings\nmore enemies\nmore things to do IE biomes/ores/gear etc\n \nStreamlined way to manage villagers. Like the chieftain hut has a table where you can assign villagers to jobs, assign tasks in one location.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, huge potential for when it will be fully released. I am planning to drown a few thousands hours in, but so far I got to Winter. \r\n\r\nSome reality checks for you though since it can be hard to get that from the pictures and videos.\r\n\r\n- This is not an adventure game, it's a survival village sim with adventurous elements, think of Banished but rather than you being this \"God\" from top down, you are literally inside it as one of the characters.\r\n- The main focus is village, villagers, creating a nice cozy place that can be defended from threats. \r\n- People will be mauled by bears and wolves.\r\n- People will freeze to death\r\n- Building isn't instant, it takes time, so any new project has to come with forethought, e.g. Don't  build an armorsmith if your villagers don't have basic clothing\r\n- If you love attention to detail, or paying attention to detail, then this game is great. If not, then this game is not for you, there is a great deal of micromanagement and you need to learn how to \"Move with intent\"\r\n- You will restart the game often, so learn to play before investing into a server with your friends. (Or watch some guides)\r\n- The dedicated server menu sucks shit, which I hope they will improve. If you rent a server, there is no search function so you need to find it manually from a list. Then after that first connection, it will be added as a favorite for easy connection and will show up at the top. \r\n- Do some research on good seeds before starting a serious playthrough, there are many that suck out there.\r\n- Combat is more dark-soulsy than Valheim or other hack and slash games of this type. \r\n- Invasions are cruel and don't care about your new warehouse, so plan ahead when placing critical objects.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really fun, but it has some issues.  if you heard this game compared to a city builder and/or valheim it would be best to drop that assumtion. it is it's own game, and it is all the better for it. \r\n\r\ni'm really enjoying building my village, and taking it slow. there is a lot to do, and doing it is fun. the game has surprising depth, and lots of interesting bits. \r\n\r\nthe theme is strong, and it is well executed. the art is very pretty, and the monsters are properly scary like few other games have instilled in me.\r\n\r\nthe UI could use some work, as it is sometimes frustrating to deal with, and sometimes inconsistent. it is hard to find the thing that you're looking for in the sea of menues, sub menues and storage boxes. \r\n\r\ncombat is hilariously unbalanced (for the first like 15 hours). enemies will just kill you in three shots, and a bajillion of them will come at you at once. you can cheese them, but its hard.  its best to not even deal with the combat until you get to metal weapons properly. \r\n\r\nthen the villagers will have random problems and it is not clear what they want/need.  they will just have a vague and confusing message instead of telling you what game mechanic they are compalining about. they are also completely useless, they will complain that their storage is full, and have a completely empty basket right next to them for example (but there is a  workplace whose entire deal is to do that, so i guess its fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aska is the next evolution of games like Valhiem, it has way more depth and creativity, along with a large dose of logistics.  The world and character models are superior too.  I highly recommend and if you would like to see it in action, look for my youtube videos.  https://www.youtube.com/@Cattulus00",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aska is a really engaging colony management game with a deep, thoughtful approach. If you enjoy managing resources and feeling a bit of pressure from monster raids, you'll find a lot of depth here. \n\nIt definitely takes some thought to master. \n\nThe only downside is the combat could be a bit more polished, but overall I recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game has a crash bug. we just lost 3 hours of development so make sure you save to the cloud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I went into this game knowing almost nothing about it. I have been pleasantly surprised at how much I like it so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is Great but not for everyone. It's survival/tower defense  The combat it rather meh,  It requires a lot of micro managing which is not for everyone.  It is rather basic but winter is harsh and you need to plan for it or they be dedz.  I hope they add in more cooking options like a veggie dish as eggs are unsustainable and chickens or something would be awesome.  You can grow as much as you want but there is a limited amount of iron so you have to watch output. Smolkrs are nice but its a 3/1 ratio for 1 cheesemaker. You need a lot of warehouses \n\nNow the good.  Running around killing bosses is fun and I imagine better with friends if I only had some.  The shrines are a cool Idea.  I like the whole summoning with the blood of your enemy.  I enjoy building, running roads to all 3 mines, Outpost are a good idea.  Builders hut was a great addition, Party system is cool, but level 99 archers smoke anything. I cannot wait to try the new content, explore the seas and kill dragons. \n\nI look forward to this games future and hope they continue to support it.  I have 500 hours in and once you learn tricks like a warehouse is better at collecting than the pits.  It becomes easier and how important roads are \n\nMeet you in Valhalla!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In need of another crafting/survival/base builder?\r\n\r\nThis can scratch that... maybe.\r\n\r\nAdd colony sim and dogshit AI, and you've got yourself ASKA. The game is pretty interesting. combat is straightforward enough and the construction feels impactful-a step towards automation each time-or so it leads you to believe. The more you grow your village, the more the AI fails at its given tasks. Be prepared to spend more time fighting your villagers than the enemies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best survival style games ive played in a very long time. Steep but extremely enjoyable learning curve and after 100+ hours in game I still figure out new basic mechanics on an everyday basis. I see myself probably spending thousands of hours in this game over the coming years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent Viking village builder with villager automation.  Would love for there to be more of an exploration aspect and varied environments with different resources.  Seems they are trying to do that with the sea expeditions, but that avoids the necessity of setting up outposts and supply chains.  Even so, the building and crafting is going to keep me going for a while, and it's good enough to give me faith that the devs have more brilliance up their sleeves.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, still needs a little tweaking on some of the game mechanics to make them more user friendly but all in all its a good time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good town-building and survival game. Just be ready for winter!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game so far, I would like to see some horses in the future, for faster traveling and better carrying capacities",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you like medieval dynasty and valheim you will like this game. I would like to see some custom base building options instead of all prebuilt buildings but that is just me. Pick it up, you wont be disappointed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nearly 40 hours in ASKA and still having a blast. Multiplayer is where the game really shines, running around with a friend or two makes everything more fun. Sure, there are some bugs here and there, but nothing that ruined the experience for us.\n\nHonestly, the whole adventure started because my buddy just wanted to build a boat… and suddenly we were hooked. If you’re into co-op survival with a Viking vibe and don’t mind a few rough edges, this game is absolutely worth jumping into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Vibes of the Minecolonies mod for Minecraft. One thing--the dodge roll is a bit slow and clunky, not as reactive as I'd hope.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I went into this skeptical as its an EA game but I must say I am so far pleasantly surprised even though I have had to restart 6 times so far due to logistical mistakes lol . Here is to hoping it continues and doesn't become abandonware.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game and mechanics, addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a very immersive challenging game, things could be more clear. Like farming, crops etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "11h CO-OP experience, everything works so far. Its like Valheim with city management. Basic AI with citizens work good enough. I like these kind of games CO-OP very much. Top Tier!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At the time of this review, this game IS early access. That aside, this game doesn't really feel EA. It's not a bug-ridden mess, it has a good many features that can last you 30-40+ hours before you feel like a map is 'complete' with all of the bosses downed and all of the upgrades obtained. It's got city building features, micro and macro management, or a relatively, within reason, low management approach. It's got boss battles, invasions, blood moons, random animal invasions as daily reminders this isn't an idle game. It's got supply chains, major settlements and outposts for maximizing efficiency. So-far-in it's a great game and I would recommend it to anyone who is into this kind of game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You ever see that episode of Malcolm in the Middle where in the cold open, Hal has to replace a lightbulb, but when he goes to grab a lightbulb, the shelf its on falls off, so when he grabs a screw driver to fix that the drawer its in isnt sliding right, then he grabs a can of WD40 to fix that, but when he shakes it its empty, then when he gets in his car to go to the store his car wont start, so he has to crawl underneath the car to fix it? \r\nThats what doing anything in this game is like, and I love it",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "So this game came as recommended after beating Valheim and Vrising and Oh boy ..... \n\nThis feels like you build a kindergarden for mentally impaired vikings, half the time you spend here is managing their needs rather than actually playing the game. \n\nYou'll spend your days looking for the crystal meth clusters so you can summon more villagers for them to take care of the problems other villagers have, but in the process creating new problems that will need to be filled by new villagers...\n\n-MF get scared everynight a skeleton manages to sneak in and then it's another 100h of therapy for that villager ..... \n-I had a villager almost die of hunger with around 500 eggs right beside him...\n-Lumberjacks will leave a whole ass forest of stumps \n-your villagers will be unhappy even though they'd still live inside a stone without you\n\n\nThis game is for anyone wanting experience of how it feels working in HR \nYou can't pay me enough to play this sht again. Remove this happiness BS, we are trying to survive the winter, not build snowmen, I might give it another shot with updates.",
      "voted_up": false,
      "votes_helpful": 67
    },
    {
      "review": "Game has incredible potential, but holy hell is it rough around the edges.\nThe setup is fantastic, but be ready for some serious growing pains. As a new player, I had zero clue that fiber would become my life – you need HUNDREDS of the stuff. Forget casual gathering; you need fiber farms up and running immediately or you're screwed.\nThen there's the flag system for worker resource management. It's just... unnecessary micromanagement pain.\nYou'll spend ages breaking blue stones, leaving a trail of small rocks scattered across the entire map like some kind of stone apocalypse. Feels wasteful as hell.\nThe mood system though? That's where things get truly maddening.\nI just came from Farthest Frontier where mood management was intuitive – a few clicks and done. Here? Every third villager is constantly unhappy about WORK HOURS. These are supposed to be Vikings, but they're acting like overpaid Google developers demanding work-life balance. I'm sitting here clicking through schedules like a madman, trying to find the bare minimum hours that won't trigger the mood debuff and make them rage-quit. It's not fun. It's just goddamn annoying.\nOh, and food? You'll have mountains of it while everyone starves because fish won't cook and meat chunks won't get cut. Took me forever to figure out why my cook refused to cook a single damn thing!\nMiners will trek across the entire map to their cave shaft, get there, realize \"gosh, I need a torch,\" and walk ALL THE WAY BACK. Day's over. No iron for the village. I had one worker who just... never brought iron back. Still don't know why.\nThe final straw for me: Lumberjacks finally learn to collect hardwood logs. Great! Except the default task value is 18 – exactly the storage capacity that holds BOTH hardwood and regular logs. My village ran out of regular logs because of the priority system. Figuring out why this happened was like trying to spot a typo in a 5-page essay.\nToo much frustrating micromanagement, not enough fun.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Live your Viking dream - collecting sticks and fiber.\r\n\r\nThe demon rabbits are one of the dumbest and least forgiving mechanics in this game. So much so that if I could get a refund for this game I would. The only way to stop them stealing, LITERALLY YOUR PROGRESS, is to build fences around your stuff. Ok, that's fine, no problem... and no sticks or rope. So, you can't keep your progress in your inventory (limited space), you can't keep it stored in a basket in the workshop (it will get eaten), no storage solutions. So the whole beginning of the game is just managing your inventory and deciding what items the demon rabbits can eat because they will have their tithe. Go out to mine resources overnight and come back to all your resources just gone. Sticks, fibers, seeds, food, everything wiped out. Just a few can literally wipe out days of progression because there aren't enough sticks to make fences for defences. The most infuriating part, let's say your speed in the game 5.15 ( don't know what the actual number is, this is just for reference), the demon rabbits speed, 5.16. You can't catch them and it takes multiple arrows to kill them so they get away every time. Grow up and come up with engaging mechanics for your game.\r\n\r\nAnd then there's sticks... I get that you have to gate progression somehow but not giving a way to create basic items like sticks easily and then psuedo-limiting the number in the world is some EA/Ubisoft level corpo garbage. Yes you can easily find sticks in bushes (2 per bush with an average harvest time of around 3 secs - thats from button hold to being able to move again) and when chopping down trees (starts at around 6-15 secs per tree and yields 4-8 sticks). It's the amount that you get vs. the amount needed for crafting & harvest time. I still don't understand why these games make you just constantly have to farm sticks throughout the whole game.\r\n\r\nYou have to harvest plants and chop trees and rocks for 6 hours before you can even get into the actual meat and potatoes of this game. That is not an exaggeration either. I played this game for 10 hours (2 playthroughs) and you wanna know what I did. Farm sticks and fiber for rope. I'm sure once you actually get into the game it's ok, but not fun.\r\n\r\nThe combat is just off. Rolling doesn't feel good and I didn't even get the chance to create a shield to block so I can't tell you how that feels. The first bow that you get is pretty much useless - 6+ shots for just killing basic game",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Good But... A Viking Survival That Hooks You, Then Frustrates\nASKA nails that perfect itch between Valheim's brutal exploration and deep village-building sims. It's a genuine Viking survival game that sucked me in for hours. The survival aspects shine brightest: managing seasons, tiered foods (Warrior Pies are god-tier), and scaling your settlement from shipwreck scraps to a self-sustaining beast with 20-50 villagers. Once your village hits autonomy, it kicks into high gear. You're free to raid, boss-hunt, and conquer without constant micromanagement.\nBut combat feels clunky and unrewarding. Heavy attacks deal maybe 10% more damage (if you're lucky), yet any enemy heavy slams you to the ground like your character's made of wood. What's the point? They can be blocked anyway, so lights and kiting are all you need. Heavies just punish you for trying.\nVillager AI bugs are straight-up infuriating (and deadly). I've had entire villages die from dehydration with wells everywhere. Workers get stuck in endless animations, unable to eat or drink, just scratching or looping forever. Crafters ghost their stations mid-queue. Devs have patched some, but it's still a crapshoot. Losing progress to dumb AI deaths kills the vibe.\nThe new Seaborne Raiders update amps the Viking raiding fantasy, then drowns it in tedium. Longboat sailing is fresh (wind physics, sea beast fights), but the ocean world's TOO BIG for Early Access. Hours wasted sailing for desert islands (Nidhogg boss hunt). Exploration towers on tiny isles reveal chunks, but they often point nowhere due to RNG. No Valheim-style boss markers or waypoints. Constant resupply runs kill momentum. Procedural gen means no reliable paths. Pure luck if you stumble on the endgame content.\nIt's Early Access, so patience is key. Devs are active with hotfixes. If you've got endless time and love a grind, it'll reward you. Otherwise, play something else.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I'd love to recommend this game but there are just too many game breaking bugs at the moment, and the developers ignore the bug reports. \n\nEspecially performance bugs that make the game unplayable.\n\nSure, it's early access, but when the performance is so bad it is impossible to play it... what did I pay for?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Game does not respect your time. I like survival games alot.. this one is rough. Early on expect to just sit and gather forever. Death penalty is harsh with no settings to change. Combat is floaty and doesn't feel nice. Character design is meh. It feels more like a job than a fun time.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game felt so janky and looked horrible imo even on high settings. Graphics aside though because I could easily ignore that, combat, building, everything felt so janky. I honestly can not enjoy this game as it is.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Fun game for a few couple of hours, but it gets boring really fast. Even though it might look like an open world survival craft, it's absolutely NOT! It's a city manager/colony sim, as you micro manage your village 90% of the time. At the same time, it seems like the devs couldn't decide on a certain path, and they try to put every possible mechanic, to appeal to a larger public, but fails miserably. \n- The city management is trash, you have no grid, snap-to-grid, upper view of the city, no dedicated menu to micro manage buildings or villagers, at the same time every villager/building as tons of requirements and you spend all the time looking after them.\n- The survival part is just plain simple, you just run around and gather stuff.\n- The combat part is HORRENDOUS. The most basic type of 2005 like-games, you can't use skills to beat anything, as you will get stuck all of the time, the animations are laggy, the enemies attack through terrain/walls.\n\nI really wish the devs would decide on one path and just stick with it, at least on the side of micro-managing your town, as it just kills the joy of playing this game.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Best way to describe the game would be Valheim+Soulmask. Unfortunately, it isn't fun. You need to constantly micro your settlers, you can't assign one to multiple tasks, if they need arrows you need to manually give them even though there's a guy dedicated to crafting tools, weapon and arrows. Days are too short, once you get past the tedious micro you realise it's already too late to explore. Then you have to deal with resources which seems to not respawn and you need lots of sticks and fiber to build all your buildings. Then the effin giant rabbits messing up your storages, fencing them off requires you to fence your entire settlement by placing fences one by one, you can't shift click to muti build. Leveling terrain is annoying cause there's giant rocks everywhere and the area you can select to level is small. And finally your char is a viking with muscles everywhere full of giant tattoos, but can't run for more than 10 secs. That's how silly stamina is. You may enjoy the challenge, I personally buy and play games to have fun.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I just bought this game. I went in hoping to lose myself in a game that let's me be the leader of a tribe. I was expecting to customize my version of a strong yet soft and determined MC. The problem? ASKA may have a lot of value and heart on paper, but as a newbie I spent thirty minutes of my irl time STRUGGLING. Even the lettering and background is hard to see especially if your computer already struggles with glare like mine.\n\nThe game automatically skipped my intro because I had to restart due to v-sinc lag, it also hides some tutorials that aren't properly explained. To make matters worse, I don't even get to choose my own name. The male character MC has better stats than the female one, in a game that seems to be named after the female MC Aska and as a female I felt annoyed by it. Why can't I just choose my own beginner stats? \n\n I could not choose my own body proportions, I can't even turn my character when customizing it (unless there is one and once again isn't obvious cuz this girl is lost). I can't even choose my starting animal I'm suppose to embody. For example, the female mc is strictly the 'raven' while the male is the 'bear' but why can't I choose differently and still have the same background story line?  This  greatly reduces the 'I can only be one kind of MC' to make the player feel that their mc is their own character.\n\nThe game seems like it has a ton of potential but if I'm struggling as a newbie who just got the game? I expected some 'find my own way' as you get with every new game but I ended up uninstalling the game after just 30 minutes because I was so frustrated. I realize this is in Early Access so I may re-download it later with the hope that I'll actually enjoy all the hard work that the developers have done into the game but right now I feel too frustrated to continue :( \n\nI guess i'll stick with Grimshire and Roots of Patcha for now.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's all just a bit too clunky, nothing ever feels smooth to do.\r\nIt's got kind of the right idea but there are countless alternatives that do the same thing but feel better to play.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a brilliant game ruined by a terrible UI riddled with inconsistent button choices and tedious, half-baked design decisions. Further burdened with simply awful NPC AI, the overhead of chasing needless details that should have been automated exceeds any game I've ever played. The feedback discord channel (for an EA game) is toxic to feedback.\n\n If the devs straighten it out, this game has enormous promise, but that's not the way to bet and will take a lot of work. I wish them luck.\n\nDon't buy this game unless you enjoy fighting the UI and level 11 tedium more than the mobs.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Aska is a game where I happily chopped trees, built cozy Viking houses, and felt like the king of resource gathering… until an enemy showed up and reminded me that my combat skills didn’t matter because the fighting system plays like it’s underwater on a dial-up connection.\n\nI love the building. I love the gathering. But the combat? The combat made me feel like my character forgot how arms work. After several painful battles (and a lot of yelling at my monitor), I tapped out and refunded it.\n\nIf they ever rebuild the combat from the ground up, I’ll gladly re-join my little Viking settlement. Until then… I’ll stick to games where swinging a weapon doesn’t feel like filing taxes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "thisa game seems cool until you start playing it after 3 hours and find out how poorly thought out alot of its mechanics are..... like having POI's with enemy spawners that are easy to destroy but summon a boss that 2 shots you since your too early for the fight? yea thats a thing. you enjoy random enemys wondering into your base and attacking your buildings constantly without a blood moon seige? yea thats a thing all the time. do you like a poorly designed building system that feels like a tycoon game lied on its resume? yea thats a thing. how about the garbage melee combat and the crappy punishment system where when you die you perma lose stats AND all your items are destroyed on your person but it leaves a marker that drops nothing back if you seek it out so thats fucking cool",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR; a colony sim/survival game where you have 40-50 villagers spread around the map and 2-4 are bugged and dying and/or bugged and doing nothing in each cardinal direction at any given time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I Recommend this game based on it's design and gameplay. However there are some issues I hope the devs address. The standard map is like someone took the noise filter on random generator and tossed it up to 9000... ply on custom smooth and flat and it is way better.  The game has come a long way since i first looked at it and come a bit since i bought it.  I am hopeful of good things.  Terraforming is a fair pain so thats kind of my primary hope.\n\nHOWEVER.... their community management team.... is crap.... they have a paid person who doesnt really communicate with the community and let's volunteers moderators wield tyrranical authority.  I had multiple people tell me it's ben a long term issue and explaisn why their discord is so small compared to other indie dev's discords... their moderator threratens and abuses people and brags about his unlimited power to ban people for any reason any time he wants. I tried to reach out to the devs and have recieved zero reply as of yet regarding this behavior.\n\nSo in summary if ya want a fun and fairly unqiue game. it is kind of a cross between medieval dynasty and Life is feudal with a norse theme.  If you want a good commjity there are good players but very bad communiaty lisaons.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So the main premise of the game is repopulating your tribe.\n\nIronically playing with a large town has some severe issues that are left unaddressed.\n[list]\n [*]Warehouse workers completely disrespect production chains and will just steal stuff from everyone.\n [*]Woodcutters will commit forest genocide leaving scattered resources everywhere that builders and warehouse workers just can't keep up with.\n [*]The marker system, my god the marker system. My map is basically littered in markers because there are so many different ones and my village is big.\n[/list]\n\nIf these issues are ever fixed then the game is a really cool survival/village builder mix, as it stands however the village part is broken once you get big. (50+ vills)\n\nIts weird to me that the developers are focusing on large expansions to the games exploration while the core gameplay is left in such a state.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TLDR: do not buy period unless on a supersale or the devs do massive overhauls.  It's fun enough for a day or two, but $25 is extremely unreasonable.\n\nI want to love this game so badly.  I've given it a VERY fair chance of 40h+ of gameplay, but the game is simply too rough and it just leaves me frustrated.  The problems fall into a few categories, and these problems intertwine to create an unsatisfying, clunky, and time-wasting experience.\n\n-Terrible UI\nStarting with this problem because it amplifies the other problems.  The UI is somehow both claustrophobic and barebones at the same time in a twisted, clunky mess.  Basic colony sim mechanics like setting schedules, restricting access to resources, setting collection areas, and creating bills at a workshop are a time-consuming chore in ASKA, especially as you scale up past the beginning of the game.  The map and many menus become overwhelming (and sometimes practically useless) very quickly because they're too cluttered and poorly set up.\n\n-Bad colonist system\nIn ASKA, you assign people to a job and they'll only do that.  A farmer will farm and do nothing else.  If there's nothing to farm, they stand around.  You can wrestle with the frustrating menus to micromanage the villagers, but that quickly becomes impossible because buildings have worker limits.  A woodcutting house (the top tier) can only allow three people to work.  This means you're going to set a villager to a task and leave them, effectively setting your automation cap.  The result is that ASKA isn't really a colony sim; it's part automation sim, part survival builder, balanced like a colony sim, and it's the worst of all three.  \n\nLike a colony sim, things are expensive and time consuming.  In any other colony sim like RimWorld or Oxygen Not Included, you can assign colonists to priority tasks, but everyone can do almost everything when needed (for example, you can have a crew of builders, but if there's nothing to build, they can help farm or mine).   In ASKA, one woodcutter house means three woodcutters max.   \n\nLike an automation sim, you'll try to scale up.  \"Just make more woodcutter houses!\"  But... it's balanced like a colony sim.  Three more woodcutters means another VERY expensive woodcutting house, three more expensive beds in an expensive shelter, three more daily meals, three more sets of clothes to regularly make, and three more sets of bloodstones (the resource to summon villagers).  Imagine playing Satisfactory or Factorio, but it takes an hour of gameplay for your automated resource gatherers to get what you need to make... another resource gatherer.  \n\nLike a survival builder, you'll do a lot of the labor yourself.  Since clothes, tools, an even buildings degrade over time and require upkeep, it's hard to establish stockpiles through automation alone.  If wood is your bottleneck, you'll need to go grind the wood yourself, even with an established village of 50+ people.  Imagine playing The Forest or Valheim, but everything is three times as expensive to make and instead of clicking a button to make a new clothes with the stuff you've farmed, you need to wait for villagers to process the materials or slowly process them yourself.   \n\n-The villagers are simply too stupid.  \nWorkers will stand at a station and do nothing, and often not even give you an error message explaining their problem.  Hauling mechanics are terrible; the mine will be overflowing with iron, but the smelter will run out there and grab a small handful of iron instead of filling their inventory.  You're supposed to solve this with warehouses, markets, and outposts, but those mechanics are terrible too.  The warehouse will pull logs from the carpenter and the carpenter will pull them right back.  Setting restrictions is frustrating and unintuitive.  Many important in-game systems aren't explained.  Getting villagers to help in combat or even defend themselves is a massive chore.  \n\n-Not enough content, too much grinding.\nThis is a cynical take, but I believe the devs have made the game artificially time-consuming to stretch out the play time and justify this early access price.  If you could have half the village help cut wood or if buildings and items needed less grinding to make, you'd get through 90% the content in a day or two of playing.  \n\nOnce you're processing hardwood and smelting iron, that's pretty much it.  A lot of really expensive buildings and items do close to nothing.  Three people can get to the end game content in a few hours, and then spend 20 hours upgrading buildings to get tiny boosts to productivity.  Sailing and raiding let you get the same basic resources that are plentiful on the mainland.\n\nFor some, progression is being artistic and collecting resources to make a beautiful settlement with cool buildings and an interesting layout.  It's very disappointing in ASKA.  Buildings all look the same and all look very \"early game,\" even at the top tier.  Stone pathways, thatch buildings, rocks, and mud.  The \"beautify\" or \"comfort\" furniture barely changes the look of anything.  Many boulders can't be removed or covered, and need to annoyingly worked around.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not at all what I expected. This is not a survival game, it's a colony sim which requires you to constantly babysit a bunch of AI-deficient whiny-ass NPCs. Janky as hell in a murky world that is procedurally generated, and looks like it. Didn't encounter any bugs, really, the game just wasn't *fun*.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After the latest update, the game is even more buggy than before. Not only that, but you want us to start playing from the beginning again!\n\nSo, as you say, we start at the beginning, collecting stones, sticks, etc. in order to swim across the BIG OCEANS (I swam for over an hour to find anything) where it's so empty that I wonder why I'm swimming so much when there's nothing there. Well, I found a few “big islands” with a few enemy camps. I defeated the enemies and destroyed a few camps. Already so bored and exhausted by this game, I decide to save it. The next day, I think to myself, I'll turn on the game and maybe something will happen. And here's a surprise, I can't do anything because it says that the save is corrupted! And that's the story! \n1 save 40h\n2 save 48h cannot be loaded\n3 save I'm not even going to start this game until it's finished!\n\nI DO NOT RECOMMEND EARLY ACCESS, it's a waste of time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "基础很好的游戏，但是游戏里各种机制非常反人类，你猜猜造一个火把要多少资源，是的没错要树枝 加树脂 加2个绳子，绳子要用最稀缺的资源纤维2个去合成，随便一个房子就要砍好几棵树加好几个石头，而且砍树砍石头的过程极其漫长。然后到冬天你可能连一件衣服都没做出来，因为做衣服要tm 4级建筑，到那时你周围的树和石头基本全没了。制作人你自己好好玩玩你做的游戏吧。",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can honestly not be bothered to go into details of ALL the f-cking bugs and moronic dev ideas in this game.\n\nThe game is honestly not BAD, not at all.  It's far from great.   But it's fun for the most part.\n\nBut as of november 2025, do NOT buy this buggy halfarsed game.\nI played this game long ago, probably over a year ago at least.     Got fed up because of a particular BUG.\nSince then, I've seen the game getting several updates, some really big additions.\nSo now, over a year later, I decided, let's give this game a new chance.\nSeveral hours into this new session,  I found the SAME f-cking bug I had last time I played.\nAgain,  this bug is literally 1½+ years old.    \nI've lost ALL respect and trust in these devs.  IF I could I would've asked for a refund.\nHence why I say, do NOT buy this game as of now.  Check back in late 2026.  But knowing these devs, chances are HIGH that these bugs are still here then.\n\nA couple of bugs I managed to 'fix' by saving, quitting and reloading.\nBut you have ONE save only. (ANother moronic idea from the devs).\nSo you GAMBLE,  when saving when you experience a bug,  because either the bug is gone when you load that save, OR, you'll now be stuck with this bug *forever*.\n\nExamples of a FEW of the oh so many bugs:\nDemolishing buildings (btw you get ALL materials back, so big plus there)  certain buildings have furniture/whatever built in them once you build this building,  these doesnt go  away. \nExample;  cottage for my fellow villagers,   demolish the cottage,  the cottage go away, BUT the 2+ beds AND fireplace are still there, now hovering in the air, FOREVER. You can't remove them.  And you cannot build anything in that spot because they are physically in the way.  \nExample2:  Barracks, demolish it,  it goes away, but the 3 dummies do NOT get demolished, so they'll stand there, forever and ever.  Again blocking you from building in that spot.\nNPCS/villagers  runs away to get something to drink,  the animation for them drinking happens, but they do not actually drink.  Looking at their stats, I can see their thirst meter doesnt go up at all.  I spent several hours (in-game time, not real time, god) following one villager that got this bug,  he ran from water source to water source, 'drinking',  for HOURS,  I was just waiting for him to die of thirst.   So he drinks but it doesnt fill his meter. So he spend *forever* running and drinking. Which means he can't do his job or *anything*, sleep, eat, etc. He's just SO focused on running to a water source,  and *pretend* to drink.\n\nThis is NOT a brand new game. This game has been around for a long while now.     Yet there are these mentioned bugs, that's been around for at *least* 1-1½ years, probably longer.\n\nOne might say,  meh so what if the floating beds are in the way, build somewhere else.    Again, why? Who the f-ck wants floating beds and fireplace in their village?  And dummies.    And stupid fellow villagers running around dying of thirst despite they're drinking from a water container that is FULL of water.\n\nThen on top of that,  the villagers once they start getting better at stuff, will basically demand better food.\nTurning these \"Vikings\" into whining primadonnas.\n\nMost of the time the villagers are just really stupid.   They do their job,  the woodcutter will chop down trees etc.   \nThe hunter is a weird profession in my game at least.   My hunter eventually complained there's nothing more to hunt in the area I designated to him. Fine, that's on me.   But when I was out exploring, I found two big piles of meat and bones.    Why the f-ck  didn the hunter bring that back?   Was his inventory full and he then forgot to return to pick up the rest of the meat?\nWho knows how many  stacks of meat and bones I've lost out on, because I \"Trusted\" my hunter to do his effing job?\nUnless he's busy running around trying to drink - as this bug can happen anytime to anyone.\n\n\nSo, if you want to build a nice looking village, you have a lot of buildins and decorations to play with. Some buildings dont unlock until you have built this and that building etc.\nOh, and again, be DAMN sure where you build your buildings.  Because you might need to keep the buildings there forever.    God forbid you build a cottage for your villagers,  and hours and days of playing later, you decide you want to build that cottage over there instead.  Sure you can demolish it, and build it where you want. But remember,  you''ll forever have 2+ beds and a fireplace hovering in the air where the cottage used to stand.   That sure adds to the immersion and beautyfication of your village eh? Nothing like a few floating beds in the middle of your village.   I feel SO immersed.\n\nSo no, avoid this game for many, MANY more months.\nInstead of giving us more Quality of Life,  these devs seems more interested in adding sh-t,  so it looks \"good\" for potential buyers.  While completely ignoring year(s) old bugs!\n\nWant a survival+ settlement  kinda game?  This aint it. Go for Bellwright instead,  sure it aint perfect either, but man is it better by a mile or two.\nBut you want vikings? Well, honestly ASKA doesnt really feel like a viking game for most of it anyway.\n\nGraphics aint even that impressive, the devs can't even make anti-aliasing work properly.   Game runs well for me, but it DOES demand why more than you receive,  so possibly very unoptimized game.\nI have no problems getting over 100fps with everything cranked up,  1440p,  but I'm also on a 5080, and 9800x3d.      So in MY opinion, this game demands way more, for VERY little in return.\nThere are both older and newer games, that way more impressive visually, that requires half the power ASKA does.\n\nSo again, bugs, weird graphics where the only somewhat working anti-ailiasing is using dlss.  Several instances of things being really shiny.     The nights are really dark, which is both a good and bad thing. Just annoying when you can't really work due to not seeing sh-t.  Yes you have torches etc, but you can't hold a torch AND build a building for example.  So you'll do that in almost pitch dark.\nBecause even though you CAN lie down on a bed and rest,  you do not actually jump forward in time like many other games.  Where you go to bed, wake up X hours later and it's daytime. Nope,  you as a player are forced to experience the whole 24hours of EACH day in the game.  When most of your villagers are sleeping, you're either fumbling around in the dark, or just sit and wait for daybreak.\nThis might be fine for some people.  But figured it's worth mentioning, there's NO skipping of time.\n\nAnd fifty million bugs.\n\nedit(mostly for the devs if they can be arsed to read this): \nDid a couple of tests after writing this review.  Made backups of my save.  Tried the hopeful thing of demolishing the cursed buildings, save, quit, and load back in, hoping it would 'fix' itself. It did *not*.   Barracks, Archery Range, and the cottage (so far!) were bugged af.    \nSo I did some more testing.  Built TWO more cottages.   Demolished the first one right away. Worked perfectly, everything got deleted.  The other newly built cottage however gave me a *NEW BUG*.   This time the entire cottage is STILL there. Can't interact with it. Can for some reason walk INSIDE. The game doesnt know if the cottage is there or not, visually it's definitely there, I get 'context' popups as if I could interact with it, but it does not work, nothing happens.\nThis last bug however, fixed itself after I saved, quit, loaded up again, suddenly that cottage was completely gone.\n\nSO you see,  stay away from this buggy sh-tshow of a game.  Over a year, maybe even two? years old bugs are STILL in the f-cking game.\n\nRun far away from this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TL;DR it's not a bad game but for me this is hard to recommend due to the heavy micromanagement, although it could be a great fit for someone seeking that wrinkle added to their survival games.\r\n\r\nI really enjoyed this initially and I thought it would progress to be more like Rimworld or Stranded: Alien Dawn where I would prioritise jobs for colonists to autopilot but with the added bonus of my player character could fill the gaps or pick up any slack, or ideally be away exploring and fighting things while the colonists did the donkey work... \r\n\r\nSadly the reality for me is that it has quickly turned into heavily micromanaging storage/inventory and babying colonists happiness. For instance rather than just setting different stockpile zones or whatever in a menu and letting the warehouse colonist get after it, the warehouse needs me to build individual bins for each item type before it does anything, only now the crafting station and the warehouse seem to be competing for crafting materials unless you tinker with a colonist storage access whitelist and set specific stock levels per each individual bin? Even the Songs of Syx storage dropdown menus are less convoluted and more fun to me than this.\r\n\r\nSpeaking of which, I'm also finding the UI/UX in general to be a bit of a chore now. Most things seem to be managed with an interaction from the player character at the specific location rather than an instantly accessible background menu. Or a banner needs to be physically placed by the player character in an area to designate it for colonist action rather than just quickly designating an area on a background map to be gathered or hunted or whatever. And even then they kept complaining about needing a new gather zone despite there being things to gather in the existing zones. \r\n\r\nI realise it's still early access and I will check back in 6 months or a year or something and see how it's looking but judging by the other reviews there seems to be an audience for this micromanagement focus, so it could just be my idea of fun and the dev's idea of fun are not aligned and that's ok - I'll just find my fun elsewhere.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "1080p UI scale 100%. too small text. C64 had also 8pixel font.\nfonts look better when use more pixels.quality!.\nunplayable when not have eagle eyes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ASKA – I Wanted to Like This Game (Full Brutally Honest Review)\n\nScore: 4.5/10\n\nI wanted to like this game.\nThis is the second time I’ve bought ASKA. I bought it months ago, played under two hours, refunded it, and hoped the devs had improved it. So I bought it again.\n\nIt disappointed me twice.\n\nTHE “GOOD” (THE GAME TRIES, BUT DOESN’T DELIVER)\n\nAtmosphere – Honestly, it’s meh.\n\nThe game tries to present a mystical, moody world, but it never sticks. The one cool moment — the giant skeleton titan walking into the ocean — is the high point. After that, the world feels flat.\n\nLighting makes it worse:\n\n* Nights are barely darker than daytime.\n* Torches are so bright they’re pointless.\n* You check your villagers and realise it’s “midnight,” even though it looks like early evening.\n\nThe world never feels dangerous or atmospheric, just washed-out and foggy.\n\nProgression – Slow, messy, frustrating.\n\nProgression depends heavily on NPC villagers… and they behave like malfunctioning preschoolers.\n\nThey complain constantly (“don’t like this food,” “lost this item,” “don’t know what to do”), they freeze, they wander, they ignore tasks, and half the time you’re not progressing — you’re babysitting.\n\nIt doesn’t feel like building a settlement.\nIt feels like managing a daycare for confused NPCs.\n\nEarly Game – Fine for a few hours, then becomes a slog\n\nGather → craft → build works until hour 5 or 6.\nThen reality hits:\n\n* Everything slows down.\n* NPCs break constantly.\n* You redo tasks they should handle.\n* Progression crawls.\n\nThe survival fantasy collapses into repetitive labour.\n\nTHE “MEDIOCRE” (WHICH ISN’T EVEN MEDIOCRE)\n\nThe first island is tiny\n\nYou can sprint around the entire starting island in under an hour. Exploration dies immediately.\n\nEnemy areas look like slapped-together placeholders\n\nGraveyards aren’t eerie.\nCorrupted zones aren’t threatening.\nWight camps look like afterthoughts.\nDraugr areas feel like stretched, dumbed-down Valheim rejects.\n\nThere’s no atmosphere, no creativity, no tension. Just flat, empty design.\n\nTHE BAD (WHERE THE GAME COMPLETELY FALLS APART)\n\n1. Combat Is Straight-Up Awful\n\nCombat is the weakest system in the entire game.\n\n* Fighting is mindless button-spam.\n* Rolling is unreliable; you still get hit.\n* Shield blocking barely works; you take huge damage anyway.\n* Heavy attacks have long windups and weak results.\n* Hitboxes are inconsistent.\n* Nothing feels weighty, responsive, or satisfying.\n\nIt’s not skill-based combat — it’s flailing.\n\n2. Ranged Combat Is Miserable\n\nUsing a bow is torture.\n\n* Arrows drop like bricks.\n* Damage is pathetic.\n* Accuracy is unreliable.\n* Hunting a rabbit can take 10–20 arrows.\n\nRanged combat feels like a broken mini-game.\n\n3. Villager AI Is a Catastrophic Mess\n\nEvery system depending on villagers collapses because villagers simply… don’t work.\n\n* They forget tasks.\n* They freeze.\n* They wander in circles.\n* They complain constantly.\n* They refuse to forage/carry/build without perfect conditions.\n\nYou aren’t building a settlement — you’re dragging it uphill yourself.\n\n4. Visual Readability Is Terrible\n\nEverything blends into the environment:\n\n* Plants\n* Animals\n* Herbs\n* Enemies\n* Resource nodes\n\nSo the game gives you a highlight button (Z)… and then puts a **cooldown** on it.\nThe one tool that makes visibility bearable is limited.\n\nHighlight → cooldown → blindness → squinting → suffering.\n\nTerrible design.\n\n5. The Grind Becomes Exhausting\n\nMidgame becomes relentless:\n\n* Too much manual gathering\n* Too many repetitive chores\n* Too many NPC failures\n* Too much walking back and forth\n\nThe game stops being survival and becomes unpaid manual labour.\n\n6. Enemies Are Bland and Forgettable\n\nWights look like zombies.\nSkeletons are skeletons.\nDraugr are tall, dumbed-down Valheim rejects.\n\nThey all behave the same.\nNothing is memorable.\nNothing is unique.\nNothing is interesting.\n\n7. The Bear Is Completely Broken\n\nThe giant bear is visually fine, but mechanically absurd:\n\n* Massive knockback\n* 30+ HP per hit\n* Targets you instantly\n* Villagers die fast\n* Fighting it alone is suicide\n* Fighting it with villagers is still suicide\n\nIt’s not a boss.\nIt’s a griefing mechanic.\n\nEven the community says the bear is overtuned and unfair.\n\n8. The Death System Is Outdated and Annoying\n\nEvery other survival game uses a corpse, gravestone, or bag so you can reclaim your gear in one click.\n\nASKA refuses to adopt this basic standard.\n\nWhen you die:\nYour entire inventory explodes onto the ground as individual items.\n\nTools, armour, mats, weapons, resources — all dumped separately.\n\nYou must pick up each piece manually.\nIt’s slow, irritating, and unnecessary.\nIt adds nothing to the game except frustration.\n\nThis system feels a decade outdated.\n\nFINAL VERDICT\n\nASKA has ambition, but ambition isn’t enough.\nBroken combat, broken AI, bland enemies, bad readability, poor progression, and tedious systems drag the entire game down.\n\nI refunded it once.\nI bought it again hoping it improved.\nIt disappointed me both times.\n\nFinal Score: 4.5/10 – Not recommended in its current state.\n\nTL;DR\n\nASKA looks promising but plays like a chore.\nCombat is terrible, villagers are broken, the grind is exhausting, enemies are bland, the visibility is awful, and the death system is outdated.\nI bought this game twice and regretted it twice.\n\nSkip it until the devs overhaul nearly every major system.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cookhouse full of 20 cooked food right next to houses. Just built warehouse on other side of cookhouse and farm, farther than houses, but no, my stupid villages go to the warehouse to eat all my raw food like Smokrs! This game needs to allow banning access to villagers at a granular level, like never eat raw food.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fix the combat and ill come back. The combat in this game is horrific. The bosses can stun lock you because you can get knocked down, and the animation of standing up has a whole 2 seconds where you cant move after, but enemies can still hit you...... i dont know how this hasnt been fixed yet. horribly clunky combat but the structure of the rest of the game is very promising.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is well put together, It's just not for me and I feel it marketed as something it is not.\n\nI would not call this a survival game anymore than I would call Age of Empires or Humankind a survival game. This is a city/sim management game with clunky combat. You might compare it to The Forest except in the Forest you don;t have to manage a bunch f villagers.\n       The majority of you time will be spent recruiting villagers, assigning them to construct things like farms and barracks, etc.. and making sure your villagers are happy.  As you expand you will find yourself not playing a survival game like ARK or Valheim, or even Enshrouded because it lacks the very important base building, replacing it only with structure placement.  This was a real bummer for me because I hate management games.  I bought it on the recommendation it was a good survival game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In 30 years of PC gaming, I've never yelled at a game so much. The supply chain is soooo broken, I end up trying to do everything. I know from YouTube others have found a way to make it work, but making it work is not enjoyable to me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Gorgeous game, love the way you wake up on an island and the gathering and playstyle. \n\nSadly I just cannot enjoy the grind and crafting methodology. It is unique to have to collect the first log or two for building but it gets old very fast. Especially when you are trying to be conservative with your villagers because of limited resources and their unlimited complains about not being protected (which in the beginning you just cannot afford to cater to because of how much farming you need to do just to make said walls). It got worse once I began to try making metal tools, it was not enjoyable in the slightest because of the entire process and number of buildings needed just to make a metal pick head. When I finally got said metal pick head, I realised I had to go through this entire process with making the shaft for said pick, by that stage I had played a total of 11 hours and gave up. It was just too much micro steps and management of villagers. I could not see myself repeating this process to make tools over and over for me and my villagers. And yes, I get the villagers are there to help, but again - limited resources and not everyone wants to play the people manager game.\n\nI appreciate the effort in this game, and I feel it is like valheim and age of conan sort of combination, but I just cannot enjoy the game in its current state as I write this review, I get trying to make the process of crafting engaging, but the level currently in the game is just far too much to make it enjoyable.\n\nGame great for someone who is a hard core micro manager. Not great for someone who wants to play for fun.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This review is based on the game in it current form, not its potential. \"Valheim with NPCs to automate tasks\". It sounds like a great idea for a game. Unfortunely the bugs, broken AI and poorly implemented systems work against the very concept of the game itself. It is fun in the early stages. However, mid/late game is beyond fustrating since it is impossible to fully automate tasks because you still need to micro manage everything yourself. Which completly defeats the whole point of the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game still needs lots of work. It has potential to be good in the future but for now its best to be left alone. There's a lack of character customization which I could easily overlook. However the \"guides\" the game gives you are not enough. It drops you in and is basically like welp you need a campfire to do anything so figure it out. And if you are doing multiplayer Co-op you cannot use a single fire. Each has to make their own to actually progress in the game. So the Co-op factor is kinda taken out of the game at that point. Compared to other games out there I would not recommend this.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is fun.\r\nCensorship is always wrong however.\r\nUnless the patronizing chat filter is removed, I have to vote this down.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really liked the games artwork, survival, and crafting systems.  The combat and AI seem like there lacking it has the old RPG problem where enemies will run back if you get to fare from there spawn and regain health despite being a survival game the enemies also seem to not be effected by each other there arrows go straight threw them and sometimes get stuck floating in the air and they seem to be able to stand inside each other im not sure if that was a glitch or part of the game.  The building system was okay but felt vary limiting i only played about 7 hours so it might get better late game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Aska the Micromanaging game. 40 some odd hours in and I can't stand to play it anymore. I love these types of games and I liked Aska before I had 30 or so villagers. They refuse to pick up after themselves and constantly hound me for crafting materials even though there are tons of them in the warehouses, or even scattered around because the foresters refuse to process trees after they chop them down. Early game is fun and learning how to play Aska is fun but Late game is a huge chore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Playing Aska reminded me of one of those early 2000s MMOs where you'd hop on into this epic bounding open world full of details and new possibilities, but then on actually playing it you start to realize all of the pitfalls in that vision and how little you can actually do for the most part, and that your character keeps glitching and phasing in and out through the terrain. \n\nTo address the mammoth in the room, Aska borrows much from Valheim, some improvements are made yet somehow they traded these in for qualities which should have been kept from it. The graphics in Aska are nicer than Vheim, but you'll quickly come to see that everything looks very similar and there's nothing that really makes it stand out. A casual glance of a gameplay from Enshrouded or Conan Exiles would easily be confused with this. Valheim at least is instantly (infamously) recognizablewith it's dated graphics and unique design. \n\nThe user interface is also bad, being hard to navigate and the tutorial does little to actually guide you on how to use it or how to progress through the game. Again comparing something like Minecraft, Rust, Green Hell, or Valheim, in these games they're designed to be easily understood and picked up. Punch tree/ pick up rock then punch tree until wooden blocks come out, then build a house. In Aska, because the focus is on fancy graphics I couldn't see where the resources I'd mined / harvested were half the time as everything blended into the hummus of the ground and I had to keep tapping 'z' to highlight where the items had dropped. \nFood and resource management was annoying as you have to figure out that you're supposed to find little water bowls occurring in nature to drink water from. Lots of things exist, but they never really tell you how it all fits together unless you've read all of the crafting pages. There's a unique resource called 'Jotun Blood' but you won't know what it does unless you happen to hover over the exact recipe which happens to mention it. There's a lot of assumed knowledge in this. \n\nCrafting is annoying as you have to memorize what the recipes are as you can't just drop ingredients onto a table to craft or pin recipes (in Stranded Deep if you pinned a shelter recipe the list would stay on the right side of your HUD until complete). I had to keep bringing up the menu in order to see what I was making. Building is annoying as you lose the level of customisation that other settlement builders like Fallout 4 or Raft had where you can't even build your own structures. At least in Valheim or ARK you can place a smithy inside of a walled structure you made. Why can't I make a giant castle or even a simple walled hut like what we had in Fallout? The only sense of enclosure and 'base building' you can really see is the outer enclosure of the city walls / fences. Eventually, once you've levelled all the ground around your base, and paved enough roads, it'll be done, but it'll look the same as everyone else's. It's definitely no No Man's Sky where you can build your own base or home and add your own touch to it. \n\nCombat is rather bland and the threats aren't really anything amazing. There's no giant troll or ice dragon moments like you got from Valheim. The bears and giant wolves were cool, but they're rare, can come out of nowhere and completely decimate your enclosure. You'll be expected to either learn from this or just die again. Once you've got a little army of warriors to lead with though the game starts to lose all urgency or danger and the enemies become a breeze to get by. There's nothing to do late game other than build some more.\n\nIt comes off as a rough cut chunk that really needs much more polish and structure design form the bottom up to get a player engaged. Cool concept, but doesn't look like it will ever be finished properly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Im only into the game about an hour or two, but my thoughts so far are:\n\n- I have played many, many survival games and at this point some of them start off feeling \"fun\" within the first few minutes. This one absolutely does not. It feels insanely boring for the first few hours. But in all fairness so did Soulmask and then that game took off,\n\n- The colors are really washed out. Like dreary/greyish brownish/drab. I dont know, i guess when i play a game i want it to be vibrant. I also hate mist in games. it just makes it annoying to see anything. you dont want your game to feel annoying. Valheim is the biggest offender of this.\n\n- the music is very basic and repetitive enough to the point of being irritating. Most games its either peaceful enough you can ignore it, or its well-thought-out enough that it adds to the experience. This music is like \"ehh, id rather just not\".\n\n- get ready for more annoying inventory management! i really wish we could all agree as a gaming community to just delete carry weight limits altogether. when i have to run to the same spot 10 times to carry back all the twigs from the tree i just cut down, youre just wasting my time at this point. oh, and then you have to build buildings in phases. like \"first add large twigs, then all small twigs, then add rocks, then add glue\" not just \"all at once\". \n\nI'm going to keep playing an will update my review accordingly.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love the game, but at this point there are too much issues for a recommendation. Survival aspect is way to hard, food management is a pain. Lots of micro management and bad villager AI. And so on. \n\nBut has a lot of potential and with some tweaks it can be an really awesome game !",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A little bit more janky than Valhiem (combat especially) but a little less lonely with the NPC's around your base to assign to do the jobs you don't want to do but with a catch (see below)\n\nI am probably done playing for now, as I don't like games with decay IE Arrows, weapons, tools etc.  \n\nThe amount of work it takes to get a iron ax and then how fast it decays is not a fun loop for me.  Please allow us more of the ability to change parameters of our servers/games.  \n\nAlso trying to get the NPC's in your village to work together and actually be productive is annoying.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love some things about this game. The setting is fantastic and the environment and visuals are fantastic. \r\nThe game, however, is absolutely broken. And rather than fixing the many broken mechanics, the devs decided to release a gigantic update adding huge new features and new mechanics and who knows how many new bugs.\r\n\r\nMAJOR ISSUES:\r\n-Gatherers are an absolute mess. They will just stop gathering seemingly randomly and sit next to their hut doing nothing. The gatherers flags can be in the middle of dozens of resources and they will suddenly decide to just stop. Since they are absolutely integral to the survival of the village, when this suddenly randomly happens 2 days before winter it can mean the death of your entire village. And not due to starvation if you planned correctly, but rather because suddenly you will not have a steady supply of feathers. Which leads me to the next serious issue:\\\r\n\r\n-FEATHERS. These are vital to your villages survival. And the only way to get them is from fallen birdsnests. This relies on gatherers, and gathering flags, both of which are broken mechanics. Rather than address this and 1) eliminate the entire flag mechanic that everyone hates or 2) add chickens and chicken coops, the devs did nothing to fix this.  \r\n\r\nWAREHOUSES. Another absolute mess. Having to have one or two villagers attached to each and every warehouse is beyond frustrating. The entire warehouse system is garbage and many times simply breaks mid run. Villagers will out of nowhere stop gathering items to put into storage and your entire production of everything for your village will come to a grinding halt.\r\n\r\nFLAGS. The flag system is the worst mechanic of this game and sucks all fun from the game. Until this is gone or revamped I will not be coming back.\r\n\r\nShelter system. The current system simply requires way to many cabins to house your village. Only 6-7 or so per cabin means you can suddenly have 8-10 of these things around before you can get the longhouse up. And the longhouses require so many resources to build that you will have an army of villagers before you can build it. It is just cluttered and not fun at all.\r\n\r\nI could go on, the lack of different types of animals and creatures, the lack of native humans, etc but suffice to say this game is very broken and with all the added new content of raiding expeditions I cannot see the devs fixing these serious issues anytime soon.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The biggest viking, send to slay Odins enemies;\r\n\"Ouchy me got a splinter\" is the main damage-source\r\n\"My Hydration-Level is not at optimal level\" is his most used phrase ...spoken like a true viking",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My advice with this game is to wait.  It may look pretty okay, but it's poorly programmed and I don't mean optimized.  I'm actually surprised it runs as well as it does on my sub-par cheap computer.  I can have 75 villagers with only it shuddering when it auto-saves or I blow up something (20 dupes on Oxygen Not Included and I can only use the slowest speed in the game).\r\n\r\nAs for the programming, I'll use the bloomery as a simple example.  You have input: coal and iron ore and then output: iron bloom.  You have to blacklist every villager who could possibly use coal and iron ore and your warehouse workers from taking these items out of the input.  They'll even take it out of the furnace while you're using it.  Same with a cookhouse, villagers will take the raw food out of the cook pot WHILE ITS COOKING.  So there's a lot of micromanaging not the game, but the poor programming.  The bloomery workers will not go put the finished product into the warehouse, they'll chase you around complaining that output is full.  And I do mean chase, they'll also stand in front of you interfering with whatever you're doing if you're in their range.  You'll have to update the whitelist for every building every time you get a new villager.  You can't set the whitelist by job, it's by individual person and individual building.  So if you have 75 villagers, you'll do this 75 times for probably 25% of your buildings if not more.  Fun.  They also won't pick up more than what they need for one task (or even one item for one task), so most of their time is spent going back and forth.\r\n\r\nAs for ranges, they don't work properly either.  I don't know what the range of individual buildings are because they're not indicated.  Warehouses do have a limited range where their workers will pick things up, but that's in no way suggested or anything you can see.  There are woodcutting markers, foraging, building, hunting, stonecutting, and forestry with tiny ranges.  And the villagers assigned to those jobs will not go to some of them if they're too far away, but will keep asking for more markers.  What their range is, who knows.  You'll end up with 30 markers for foragers dotting your map and still not enough.  It's ridiculous.  It's not like Flotsam where you can resize them and assign a different number of villagers or specify what they're gathering.  Nope, you'll end up with dozens (if not over a hundred) of little markers all over the map, have the foragers complain about not having enough markers, then realize they're not going out to the markers you placed.  Hunters will leave dead animals, meat, hide, all over the map and never go back and get them.  Same with woodcutters.\r\n\r\nThe durability is a joke.  If there weren't a mod to change this, this alone would render the game unplayable for me.  Every tool you make can break in a day.  **ALL** of your tools can break in a day because of the ridiculous durability.  I've played plenty of games with durability and I think this is by far the worst.  Same with the food spoilage--now we've all bought some raspberries from the store and could swear they stared molding on the drive home, but this game said \"hold my beer\".  Same with clothes.  Also, once you make better clothes for your villagers, there's no way to break down the old clothes so they're every where.  Absolutely everywhere.  And they didn't make folded clothes, so the pants and shirts just stand up like there's someone wearing them, which is also ridiculous.  \r\n\r\nMines are the second joke.  They're the only source of iron ore and there are about 2-4 mines on the map.  They run out and the solution the devs came up with is that you can bomb the corridors of the mine to cause a collapse.  But this doesn't renew the mines, it just brings back a wall which has maybe 45 ore in it.  You need about 4-5 to make anything (even nails) so this isn't a lot.  It also means you have to rebomb the mine in about 8 different places every single day.  You can't have a villager do this and you also won't have enough resources to do this.  I would say this is a way to force having outposts at those other mines, but judging from the rest of the game, this isn't the case, it's just poorly balanced.  \r\n\r\nThis poor balance is most obvious with the woodcutters.  They'll wipe out whatever space you mark for them, cutting down tree after tree and leave bark, sticks, resin, and logs everywhere because all they need is the one long-stick that comes from a 100 ft tree.  \r\n\r\nThere's also not a whole lot to do.  The world has some monsters: wolves, skeletons, wights, and bears in their own POIs and periodic invasions, but other than needing flax and the jotun blood to summon new villagers, exploration of the island is just bland.  You're only coming across the same resources: food, flax, and sticks.  There's no lore, there's no reward, there's nothing that stands out.  I don't know what the endgame is supposed to be, but even with the new harbor update the question is why?  There's no progression.  You \"level up\" individual skills like gathering, stonecutting, etc., but there's no difference from one level to the next.  If there wasn't a little  message saying that you did level up, you'd never be able to tell.\r\n\r\nYou can't create quivers for arrows, sheathe for your swords, a bigger backpack, or anything of the like.  If you want to be involved in the building of your town, which there's not much else to do, you'll need a hoe, pickaxe, axe, roadbuilder, your weapons (sword, shield, bow and arrows), knife and they all take up space in your pack so you have about 8-12 spaces left for sticks, thatch, leather, or whatever.  This doesn't change the entire game.\r\n\r\nYou can eventually make slightly better armor and weapons, but either the tooltips are wrong or the early \"crude heater shield\" does more damage than the \"reinforced\" version.  Same with the later weapons, the pickaxes can do the same amount of damage according to the tooltips, so on paper (so to speak) there's no benefit to making the later items.\r\n\r\nThere's so much for them to fix and with these problems existing from the beginning as far as I can tell from reading comments all over the internet, I doubt they'll ever get to it all to make it a well-rounded game.  It's a jumbled mess right now with awkward UI.  Quick example, they made a sound option for eating and drinking, but if you mute that slider, you still get the eating and drinking effects....  There's also options to extend the day hours and seasons, but they in no way compensated for resources or respawns.  Some respawns are triggered by the beginning of a season.\r\n\r\nAll in all, I bought it after watching three or four people play this on youtube and you could glean some of this from watching them, but wouldn't get the full picture of the brokeness.  So for people hoping inexplicably for a solid early access game, pass for now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love the game, my only problem is the jolten blood in combination with the pickaxe system. Starting a new world is such a pain, it's like being forced to use a wooden pickaxe in mining. The T1 starters pickaxe is absolute garbage and the fact that you have to play hours with it before advancing is just a pain. The T2 pickaxe is also still slow and you can't make villagers gather jolten blood (probably spelling it wrong but idc).\n\nFor those that don't know, jolten blood is neccesary to summon villagers. Most resource gathering task can be automated with buildings but jolten blood can't, this makes joining the world of friends or starting a new world for or with a friend such a giant pain, It honestly takes all the fun out of replaying the game. But yeah, since i'm still on my first gameplay session it'd say the game is recommendable. Just expect a tiresome grind, it's part of it.\n\nEdit: Wooden wall arrow has to face inward not outwards towards the enemy, just found that out after upgrading my walls to hedge walls and finding out that the spike addon faces inwards, really wish this game was clearer with small things like this sometimes.\n\nCan't dismantle the walls since replacing in the same spot won't be possible since building are already behind it and a farm in front of it, which blocks me from replacing anything. Gotta love Aska sometimes\n\nEdit 2: Making a custom world doesn't allow you to edit Joltun rates or anything, going back to point 1 restarting the game just isn't as much fun as it could be. For example, with my earlier wall fuck up I wanted to start over completely, but will have to redo the tiresome joltun grind. The game has no mod support and doesn't allow you to edit resource settings so you can play the game the way you want to, with this in mind I decided to change my review to a negative one. Also, no mod support.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game seems like it has a lot of potential - but it's just.. boring in its current state? \n\nTo function properly, it needs to look to 2003 Savage - where you can swap between RTS and 3rd person to manage the settlement. Managing them via the current system is tedious and I'd rather just play Valheim.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is not a HARD NO..... but besides graphical style we would love to see in Valheim this game manages to be barely average or average at best in every single other gaming aspect so its still a NO unless there is huge sale.\n\nTo be more detailed:\n1. Village manager, builder sim in survival game looks good on paper but it is done so terrible that you get constant feeling you are in charge of group of mentally disabled and challenged. Interfaces and systems are so non intuitive , AI of builder villagers cannot see logs what foresters cut but can see logs on my cart thats in middle of map, depressions being scared of god knows what even when they are in walls and havent seen a single mob in life etc. Just absolute mess compared to other games from same genre it just is there and it works... sometimes.... sort of..\n2. So next step skip the management part of game just play it as solo grindy survival and funny enough it actually allows you to progress MUCH faster, but now you reach the \"battle\" witch also is ......average at best. 3 types of mele weapons and bow . Swords are utter trash , hammers are okish , axes top due to highest dmg and highest stun depletion all thoug the game does not give you that info as all same tear weapons have same dmg on paper but not in reality, could be also connected with hidden resistance stats. And the bow is absolute OP because the rate at witch your dmg grows as your bow skill lvls up is just insane + free arrow farming from skellys makes bow insanely strong, as long as you learn that the bloody bow never shoots in center dot but always in left bottom side from where you actually aim, and this is just redicilous just why? overall fighting is there but nothing that will make you enjoy it.\n3. For a game thats in alpha already for 1,5 years to still have so many technical flaws, getting stuck in textures, Empty(grayed out)enemy spawners even in locations thats beeing first discovered, glitchy draugar fields, no actuall survival as you have water source and food on nearly every 5m and on absolute abbundance, and in general nothing (besides graphics) feels right and enjoyable in this game, kinda shows that devs are ok with this couse by the time you will figure out all the flaws you will be way past refund time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game sux. Janky, ugly, unfun. It's The Sims in the forest. Too much tedious hand holding. Not fun. Graphics are so 1990's. Did I mention it's not fun?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything was going great but... The farmers sit on their arses and don't do a damn thing.. Even though their packed to the hilt with seed, have hoe, outhouse nearby , water wells close and have their tasks set. Now all villagers are dying from thirst even though all water storages are full, have numerous troughs and wells. To anyone thinking of buying in early access you'd be better off to wait for the game to develop more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy survival/base-building games like Medieval Dynasty, Bellwright, etc... so I gave ASKA a try since it seemed like it was right up my alley.\n\nI was thoroughly disappointed with NPC's AI more than anything... especially compared to Bellwright which I had beaten twice. Here are some AI issues that I had ran into which resulted in me giving this game a thumbs down:\n\n - Setting priorities for each item as \"low\", \"med\", \"high\" doesn't really seem to work, I think it should be more specified where you can set the priorities from a scale of 0~10.\n\n - Some of the AI action \"bugs\" I have run into:\n          - I would break up resources such as rocks and trees right next to the warehouse and the warehouse workers would not even go pick them up. I think it would be nice for the game to show a range of \"detection\" where it shows you how far the NPCs go to loot items listed in their jobs, which is a different concept from markers\n          - Using the horn to call the designated warriors doesn't work properly and they don't come to you unless you are already very close to them\n          - BUILDING PRIORITIES, I built the builder's hut and tried to utilize it to have one builder work on repair and fire lighting and other builder to focus on building but I think we should really be able to set a priority per building for the builders (similar to item gathering priority)\n\nThere were other minor details that I was disappointed in such as bad fighting mechanics and awful mob encounters and raids. \n\nI am really hoping that devs can really make some major changes to make the game more enjoyable so that more people like me who have been disappointed with NPC AI can give it another try in the future!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely the worst crafting/survival game I've ever played. It's like they took everything from Valheim but made it at least 10 times as tedious and as slow. I despise this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At this point it’s honestly exhausting. The same core bug has been around forever: whenever a villager takes a tool from storage to start crafting, the item often despawns before they can equip it. The tool is gone, permanently. It’s basically a null-reference mess that breaks every single crafting chain in the game. And yes — it happens in all buildings. Once the tools disappear, villagers just stand around uselessly, production collapses, and I end up crafting everything by hand again. It completely destroys the whole idea of village automation. It’s frustrating because the game has potential, but until the item transfer/despawn logic is finally fixed, the whole system just doesn’t work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The beginning of the game is great! Once you keep playing there are some common stuck issues (Use the unstuck button often) and the AI-workers start to make the game more a management heavy game, as well as the AI-workers don't tend to do as the game intended when you try to expand both in your main base and \"Outpost.\" I suggest the dev really rework the Outpost concept because it impeded the growth to the end-game overall.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many basic quality of life feature that SHOULD be there are missing. I was ok with it because the game is very fun but the last straw was when they saw a difference between local and cloud and pressing \"escape\" doesnt cancel the process... it select the cloud one instead... I couldnt go store my save before doing the process and lost 10-20 hours of gaming. I will change my review if the devs change this process. It's beyond stupid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No QoL, awful controls and horrendous UI, barely any support when comes to bugs and constant timeout errors when trying to play or host a multiplayer session. Can't recommend it even though it has potential and can be fun when it actually works.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A completely and totally disappointing experience.\nToo much micro management.\nHaving to bring in and worry about these NPCs is a pain.\nWhen i first got this game, i was sure it was something like Valheim.. and in a way it is.. but having to deal with all these people needing food and needing this and needing that, is overwhelming.\nIt's stressful.. especially with all the other things one has to cope with during the play of this game.\nI regret ever getting it.. if i could get my money back at this point, i would.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Early Access comments: Before you buy it, you should know that the game requires a lot of grinding and micromanagement. The item crafting and building placement systems still need significant improvement. In my opinion, instead of flashy additions like a port, if more time were invested in AI, workflow systems, and interface optimization, it has the potential to become an outstanding game in its genre. Other titles in this genre are still much stronger at the moment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got a decent base but currently there are so many bugs effecting basic and necessary elements of the game that it's a solo slog at about the metalworking stage of the game.\r\n\r\nCheck back in about 3-4 months since that seems to be the cadence of major patches.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Way to grindy, endless micro management of dumb specialists colony. Not very optimised.\r\nIt could be cool, but it feels like an endless chore of carrying crafting assigning building expending. Cause villagers are actually very dumb and cant have 2 roles. \r\nRemind me Green hell and all I disliked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The lastest update brought alot of features but sadly the features was only available to some people not all of us. Bugfixes doesn't happen regulary. No roadmap available. Nothing that can give players hope. I don't recommend buying it. Everything so far has been half arsed put together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly.. I'm just not having fun. The game is pretty, there's loads to build but.. it's just constant low level stress and boredom. Not sure how to really explain it other than that. There are SO many steps to everything which is cool until you need to do it 50 times again. \r\n\r\nSpecifics which I didn't love at all. There's no way to see what's on your map other than run around and look after creating a world. That's kind of fine, but can screw you over. My first world the closest mine was halfway across the map within range of a large tower. Not awesome. But I didn't even know that was important until well later. The second one I found was even further and didn't actually go down past one floor. Sigh. Fifteen hours spent to just start over cause everything was too annoying. \r\n\r\nCombat also feels.. Really underwhelming. And you can't avoid it, the game literally forces you to fight. Small raids, large raids, invasions, can't get away from it. Idk, at least at first I think I would have enjoyed a creative mode to figure out what the hell I was supposed to be doing before getting past first winter and realizing that me and my 4 bros with stone hatchets were not gonna make it past second winter unless we really scaled up. Not great\r\n\r\nSo like I said, constant low level stress, constant annoyance at having five thousand different ingredients to manage, it's just not fun after a little while. I gave it a pretty good shot I think, but there's a lot that could make this game better.\r\n\r\nOh. Worker AI is... shit. Considering that the game is literally about workers doing stuff for you, that's a pretty big issue too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enjoy the survival and combat a lot in the game but for it being a colony sim its hard having to micro manage sooooo much to the point its more of a headache rather than feeling like being helped by your followers. I know I could look up a guide however the fact of having to do that to make it work is frustrating even trying to get it halfway working in my favour was a task on my own without a guide. But maybe its cause im just not that great at colony sim games idk, def enjoyable moments and wish i could understand it more but unfortunately i wont be playing it unless down the line it seems a bit more optimized for certain features/in game tutorials.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "เกมดี สนุกแต่ จะหลุดออกจากเซิฟรัวๆไปไหน เล่นคนเดียวไม่มีปัญหาอะไร พอเล่นกับเพื่อนเท่านั้นแหละ มอนมาเรทบ้านหลุด เปลี่ยนซีซั่นหลุด ยืนเฉยๆหลุด ก้มเก็บของหลุด ....................เพื่ออะไร????",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have had this game since the beginning. I have held off a very long time and doing a review. My only complaint is the performance of the game on any handheld device. The compromises to run make it disappointing unless you have a dedicated GPU. I have tried on the steam deck, Lenovo go, and the MSI claw 8 AI plus. At some point in time you end up, dropping the resolution so low that it just isn’t enjoyable to look at anymore. I really do feel performance needs to be prioritized.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is very \"early access\" \nI played 2 months ago eventually coming to the conclusion it was too early access and to let it cook more. Broken AI and tons of things need QoL tweaks.\nRaiders patch dropped, bought it for my friend and began setting up a dedicated server for it.\nStill so many broken AI issues and now what may kill the game for me entirely, the dedicated server needs a Steam Game Server Account key.  First it wants my phone, then it says my google phone number isn't qualified.\nThe whole reason I bought this was to play with friends from a dedicated server and now I can't do that and I'm way to far into playing to get a refund.\n\nFailed to create account: 24 (Account does not have a registered phone number)\nFailed to create account: 24 (The specified phone number is not qualified to create persistent gameserver accounts)\n\nHopefully they ditch this garbage steam game server nonsense before release, until then, I do not recommend this game for dedicated server hosting.\n\nHad a mod on their discord say to just play multiplayer and let them connect to my game... was very surprised someone could be that clueless about the why people host dedicated servers. Then they said that everyone else is hosting dedicated servers just fine giving steam their phone number.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game is super fun but so buggy that it becomes unplayable at random. Cannot in good conscience recommend it as it currently operates.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A good idea of a game, but wow is this a mess of micromanagement & poorly implemented features.  I'll illustrate with a series of examples that desperately need to be fixed:\n\nFishing is absolutely worthless and a waste of time.  You catch whole fish and those hang on racks, which is great.  But the time required for a cook to break these fish down & use fish meat, takes away any benefit of fishing.  There is also no other way to break down fish other than your cooks doing it (or you doing it manually).  Horrible design and extremely inefficient.  Skip fishing and you'll end up ahead, they drain your food capacity in a horrible way. \n\nHunters are too inefficient.  Population of 175, with 24 hunters and they can't keep up.  The hunters are all getting rotated through the Archery range too, so almost all of them are archery level 50+ already.  I have them focus on raw red meat instead of meat chunks because, again, only cooks can break down meat chunks.  If cooks are breaking down meat/fish, they aren't cooking which further reduces their production.  \n\nThe 3rd tier of food you make is unbalanced, in a bad way.  It takes way too long to make the food compared to tier 2 & 4.  The yield is also much lower than the others.  This needs a rework.  It's currently a waste of time to make tier 3 food and is a significant cause of production shortages.  I have 9 cook houses & 1 cheese maker, all double staffed (night/day), all level 50-100+ cooks.  When making tier 3 food they fall behind because of how slow it is to make.  Tier 2 & 4 are fine.  \n\nWorkers suck in general.  I have bone arrows as my top queue item in 3 workstations because the moron workers can't figure out how to make them.  Even at #1, they still can't  keep up with my 8 Hunter Cabins and 2 Archery Ranges.  I have 1400 bones, 600 sticks, and over 4000 feathers in my storage locations next to the workstations.  And they still can't make bone arrows efficiently.  Maybe they'll actually build 40 in an entire shift...wow great work there.  \n\nThe AI is too dumb to get raw materials in a batch.  So a TON of time is wasted by the workers walking back & forth.  They get materials to make 10 arrows (queue tells them to make 50), make said 10 arrows, but now need to start all over gain to go collect those resources to make the next 10 arrows.  Horrible design. \n\nSame issue with clothes.  I'm trying to make tier 2 stuff, have thousands of flax, hundres of leather, etc.  Everything you need.  Can the dumb workers actually make the clothes efficiently?  No.  Why?  Because they're too stupid to realize that the linen you make shouldn't be taken back to the storage warehouse & thrown on the floor (because the 5 linen storage racks are already full).  Then, they run back & forth from storage to try to make one clothing piece, again super inefficient.  Dumb design.  The person making linen isn't even the same person making clothes.  Even with specialization it's horrible.  \n\nWhen villagers take clothes, they hang up their OLD clothes on the clothing racks, which BLOCKS the worker from putting up new stuff.  Seriously devs, what are you thinking???\n\nWhen storage is full, the warehouse workers don't care.  They still grab more of the same resources from production & just dump it on the floor, creating a mess.  What good are limits if they aren't getting followed???\n\nVillager speed is too slow, especially between actions.  Does there really need to be a 5 second delay for every action?  Yes, it's not literally 5 seconds for everything, but come on, speed them up a little bit to somewhat resemble a functioning human being.  These guys are all turds.\n\nPeople will randomly stop eating & sleeping, causing them to randomly die of said stupidity.  You can fix this by restarting the game every 30 minutes...great design here.  \n\nIf you \"snap\" your plank walls together and make a straight line, the snap creates a visible gap in your walls.  Not only does it look bad, but you can literally walk through this gap between your walls. \n\nI will revise this if the devs show their ability to fix these major, game breaking issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a lot of options and to customize your gameplay. If you play other survival games, Its not ground breaking, gets boring and repetitive the more you play.  I had 6 hours of \"fun\" and I dont think I will be coming back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ive been following this game for awhile, and playing different updates as they are released. But even as a co-op game, it is definitely not even close to Valheim. They have finally added the longboat in, and there are a few islands scattered out there, but they are devoid of anything meaningful. Maybe a few skeletons that drop the same loot. Found an npc village and destroyed it by myself. No valuable loot of any sort. This game is just missing so much, I cant really recommend even spending 14 dollars on it. I dont get why devs are unable to put content into games anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hope that I will love this game at some point. Idea is great BUT\r\n- Too many bugs (EA, I get it. But I compare this to Valheim)\r\n- Villagers are just too much like dummies. At least they should be able to build very primitive tools themselves)\r\n- Invaders can be too rough in the beginning (I got an bear attack at first autumn. Fair?)\r\n\r\nI'm following this and hopefully can change my opinion later!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Aska had a really promising start, but after the response to every bug report and feature request for months being \"don't worry, we're working on something big for next release ;)\" it turned out their \"something big\" was to change the focus from a game about determined survivors standing against those who would destroy them to... well, being the insane assholes going around destroying other tribes that are minding their own business.  But hey!  Those tribes are \"primitive,\" so it's okay!\n\nI was a huge fan originally, but after stringing us along for ages, the developers went in a really gross direction and they refuse to fix any of the long standing issues with the game.  Spend some time checking out the forums before you waste your money.\n\nAnd just to preserve it in case they try to pretend they \"didn't mean it that way,\" this is actual text from the most recent update announcement:  \"...raiding tests your tribe’s strength. As you venture to remote islands, you’ll encounter human settlements guarded by hostile tribes, the Dragon Folk, determined to defend their homes. These primitive, rugged communities contrast sharply with the advanced structures your tribe can build...\"",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Kinda like Rimworld where you build a colony and assign tasks, but you have to do all the manual labors, like picking up logs and sticks and do it again and again. Unlike in Rimworld where you can speed things up, here you live among them and it progresses very slow. Gets old pretty quick.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "gamn is retarded.... mobs attack town... villagers keep sleeping fuck it why bother defending....... I die villagers keep sleeping buildings get wrecking guess villigars need sleep  0/10 games trash on ai  noone in there right mind would ever just sleep while there village is sacked. do better devs",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Garbage shader, texture and lighting.\n\nNo matter your love of survival genre, this game will disappoint",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring as hell, and the combat sucks game needs more updates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Not Recommended: Over hyped and Directionless[/b]\n\nI don’t understand why so many YouTubers recommended this. I played it on max settings (ultra + widescreen), and it still looks and feels generic. The visuals aren’t as good as advertised, the art direction lacks personality, and the gameplay feels stiff and clunky. Tutorials are poorly designed and leave you guessing.\n\nPeople compare this to [i]Valheim[/i], but aside from a Norse theme, it shares nothing with it: none of the atmosphere, depth, or sense of progression. It tries to be realistic, yet ends up awkward and lifeless. Even compared to similar small survival games like [i]Len’s Island[/i], it feels unfocused and without a strong core identity.\n\nI don’t mind early access roughness, I mind when a game doesn’t seem to know what it wants to be. Unless major design changes happen, it’s hard to see the promise others claim.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a tough one. I want to make clear that this game not getting a recommend doesnt mean that it's totally shit, I just wouldnt recommend it to a standard audience. Its just way too dang fiddly. It feels like something like Medieval Dynasty with some giant caveats which ill try to go in to.\n\nSo first of all, we're dealing with one of those \"Realistic\" build system for a survival game. That means you're usually carrying 1 log at a time. Backwards and forwards. For hours of your life. Thats okay. That can be fine. We've seen it on Medieval Dynasty, Green Hell and others. The problem with ASKA is that this very rarely rewards the player themself. Youre doing this in service of making a workstation for an NPC, and they are exactly that. The time goes so fast they dont have time to have a life and by the time they walk to a gather point, recreation time is done. If we contrast this with Green Hell, you might spend 15 minutes solid setting up a mud area, but once you do, you can make mud structures, the gameplay loop circles on itself and it feels good to play. Youre not stamping out a mud hut that an NPC that youre going to have to micromanage until the end of time is going to use. You're making something that adds new gameplay mechanics and new building options.\n\nWith that point briefly touched on, I'll move on to the villagers. Its like herding minecraft villagers. Absolutely nothing is automatically assigned. If you dont tell them exactly where to go, what to do and where to eat, theyll stand there like a fish with a dumb look on their face, and then walk to the nearest food source to them at the time, the farm full of raw food instead of the kitchen. Their behaviors will change between save files (They wont shit in my current world, as I've tried to give this game plenty of chances. No fertilizer for you nerd). Their jobs arent matched up, so the charcoal burner will be sitting around all day waiting for the woodcutter to get bark, then sticks, then long sticks, then logs, then sap, then eventually the firewood he needs, at which point everyone froze to death. You can forbid NPCs from using storage but then whitelist others, but it doesnt make clear what this even does. What if I dont want the npcs eating the raw food from the farm? If I blacklist them all will the farmer stop storing food there? I dont know the game never tells me what the blacklist does. The tutorial assumes im functionally retarded and most of the audience arent going to have been raised on minecraft in 2025. The design is so disperate and strange.\n\nThe combat is Dark Souls for people who have had a brain anyuerism. There is really nothing else to say. It's slow, clunky and barely responds. You can dodge for iframes, block or parry, and all of your attacks have stupid animations an actual fighter would never do and take up as much stamina as running for 50m. Its the weakest part of th game but the developer insists on shoving it up your ass every second night. Its one of those games where the enemies arent there to kill you they're there to break all those buildings you spent hours taking logs to because good gameplay is wasting your fucking time. I have a job.\n\nThis is a small gripe but I dont understand why the building system had to be so realistic when you can make a magic potion that turns you into a bird, and you fight a stone golem and zombies. Ultra realistic gritty build system where you gather every log one by one doesnt marry up with magic giants very well unless you can eventually use your magic to make the giants work for you and carry 100 large stones at a time or something, and if youre doing that, you need to do it at the start. Make the dogs easier to tame, make them get their own food or even hunt food for/with you and make the whole game about conquering/taming this place to make life easier for the humans.\n\nHonestly, talking about all the bad things in a row just frustrates me because there are hints of something good under there. Its like the beta for Valheim, a title I've been avoiding mentioning simply so I can reference it in this closing statement. ASKA just never picked it's lane. It wanted to be too many things. And ultimately, I can see the birth of the idea in my mind, and its a good one. \"I really wish I had some NPCs to help me build in Valheim\". Thats a mod I would download immediately for that lonely ass game. But if youre going to make something succinct you need to lean into the parts of your game that make it different and this game leaned far too hard into the elements that made it the same as other existing games that are VERY hard to compete with. You try making a realistic build system to rival the likes of green hell, where I know where every single stick in the structure is because I put it there, and you're going to have to work pretty hard. This game very frequently has its toes just over the line of patience where if structures had maybe a few less difficult items like large stone or a little more interactivity and ability to customize them, get new gameplay mechanics and new stuff for making them, it might be okay, but this game has a habit of feeling like a chore even to me, and I play Warframe... Choreframe.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I just cant recommend this game, its incomplete, very grindy and it has zero quality of life in each and every system it shoves in your face. I could sit here and tell all the bad experiences ive had with this game but i`ll sum it up by saying it just feels like a massive shore, the Ui is very click intensive, the activities like crafting and gathering take a rlly long time and the ai on the villagers you have to manage is damn right unnaceptable. Games in the 90s had MUCH better ai to neutral npcs. \nGame also looks awful, those images on the steam page do NOT reflect how it looks ingame. Im running on ultra and its always too bright or too dark, everything has jaggered edges as if this was made before the invention of antialiasing, the textures are very low res and theres A LOT of repetition on the scenarios, almost like there are only 2 trees in the world, one rock and one ground texture. Survival games with pre-defined resource generation are also doomed to begin with, why would you explore if you can just wait for the resource to respawn? you only need to find one. \nTheres so much more i could talk about like the awful combat, lack of story, the god damn stamina bar that wont let you run for more than 3 seconds... but i think im done here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "POCKET SAND!   \n\n\n\nPoor game design. You spend more time holding your people's hands because they are too dumb to function on their own, than you do actually playing the game.  4/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Janky and Unplayable in the current state. Stick to Valheim for a better experience. \r\n1. The automation for the villagers is bad. When assigning a role to the Cook, he doesn't cook and place it in the storage for the rest of the village. They all ended up dying of starvation. \r\n2. Limited crafting at the workshop. The concept to have modular addons for a workshop is good, but limiting it to just two per workshop killed it. having to build another workshop, just for the addons seems completely unnecessary and a waste of time. \r\n3. Animantions. I died to skellys and freezing three times in the slow pick up animation when trying to retrieve my stuff on the floor. This made me ragequit and uninstall.\r\n\r\nSadly cant return the game so if the devs make QOL improvements ill change this to a positive review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game misses the mark.  Combat feels really bad and clunky, You have helpers to gather resources, but they cost more resources than they provide.  In order to gather anything outside of your small base radius, you need to drop a marker.  They still seem unable to find resources though, and I feel more like their mother, ensuring all the resources are stocked, because they are unable to, gathering food for everyone, because the farmers and foragers hardly bring back anything...  It's an all-around un-fun experience.  Would not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A reluctant, nah. It's not bad, but I wouldn't recommend it outright.\n\n8 hours into a custom game over a couple play sessions and I wondered if my achievements were broken. Well yes, and no. If you don't play the bogstandard game, they get disabled, without warning. Which is silly. The custom settings don't feel like they would impact any difficulty really, And none of the achievements are particularly difficult to begin with. But once you realize you'll have to start over it kind of stings. I don't think I'll bother. Maybe a mod will unlock them in the future. Maybe devs will just remove the restriction as it's not worth whatever they thought it was worth blocking.\n\nedit - so I did go back and start a new game to get those achievements. got about 1/2 an hour in and crashed when the day turned, which is also the auto-save. Lost all that time, loaded back on the beach. COOL COOL COOL.\n\nThe rest of the game is fine, and not a bad deal on-sale. It's definitely got that indie charm, as in nothing is all the way finished, but man did they put in some effort to get it where it is. This is definitely one of those games you'll want to watch someone else play first, because even with the tutorials, you'll be stumbling towards a winter collapse before you can fix it otherwise.\n\nThe combat is... not the worst I've played this year, but it's in the bottom tier. At least this has a dodge roll I guess. Enemies vary from painfully slow to impossibly fast, and the randomized zoning means your first real goal of getting iron could very well be surrounded by things you'll want iron to fight. I kind of knew this ahead of time so I was able to scout out a relatively safe spot, but, yeah. Indie charm for sure.\n\nThe real meat of the game is the very nicely layered city building simulation. I do enjoy the crunch of all the systems stacked on top of each other, prerequisites layered inside building upgrades is neat. The citizens are pretty well behaved compared to some other city builder/survival games. But they'll also die fast if allowed to wander into monster areas. Keep those gathering flags where you can see em. The sense of urgency in your first year is challenging, and I assume it gets easier as you become more situated, allowing growth into the second phase of city optimization.\n\nThat's not to say it's without a lot of friction. You're going to be scrounging for fibers to make metric tons of rope, and there's no early way to gather it easily. You're either breaking down materials you need, or spending an inordinate amount of time gathering it in the wild. There's a lot of tipping points in balance that feels either well done or accidentally haphazard. I can't say how much of this is by design, but definitely enough to keep you moving at all times. I'd like to try fishing if I weren't worried about keeping everyone alive.\n\nSo if you're into a kind of sweaty stressful colony management sim with questionable combat mechanics, ASKA might be right up your alley. I don't think a lot of people are going to latch into it right away, but the ones that do know exactly who they are.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "okay if i or a work puts wood in the carp crafting station only a player and the worker for that station should touch the wood. not a warehouse worker putting it all back into the warehouse",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game crashed and save corrupted after placing a farm plot, only 4 hours in",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a fan of the combat system, feels really sluggish and uncomfortable to fight but the micro managing of your villagers is what really becomes a pain.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A micro management disaster of Poorly written AI that forces you to overcome what the developers could not. I can not believe how such a chore to overcome gets such high marks. Then again its not my generation of a game. It goes along with the absurd like millennial socks. Hey how are them socks working out for you this winter or last?\n\nBeyond the abhorrent AI there is also the bad flow of the Crafting UI. Nothing really flows. You need to search every sub menu to determine where anything is. Things are even unevenly stacked one on top of the other. \n\nI bought the game for the latest update and I will never even get to the sailing part as i cannot stomach the game any longer. \n\nAny how, it peaked my interest. I thought it might be the one but, sadly, its not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "should have noticed it was a village builder sim more than a survival, resource gathering, getting new gear and killing bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game feels like it would have been popular 10 years ago. Graphics feel lackluster and odd. The mechanics for gathering feel clunky and dated. If you like older style games this may be for you, it seem they been updating the game but I would not recommend this to anyone else.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The people will die at of hydration standing next to a water source. You lose 25% of your HARD gained skills on every death(That's hours of hard gained skills).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No support for changing graphical options whatsoever on Linux.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played a while, terrible optimization..... refunded.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's valheim except you're given command of the most worthless band of vikings to ever exist. Oh? is someone murdering the other villager 1 foot away from them? better sit down because they're tired. Oh? you didn't place your 346th flag? well that woman with the exclusive job of grabbing rocks totally can't figure out where rocks come from anymore. Oh? you wanted to actually fight the enemies? sucks to suck, the only fight you won't be far too weak for (without 3 hours of grind) is a fight your villagers magically decide to join. Like the idea is cool, but they took all the parts that made valheim awesome, made those suck, and then plastered a loosey goosey villager system over it. why are the animations so ass? why are enemy spawns so annoying? why are villagers (literally the main point of this game) worthless? why fill the map with unmoveable rocks and make my villagers intensely depressed when not surrounded by the walls they refuse to build? why make area based enemy spawners and then put bosses that stun lock you and kill you before you can finish standing up from the first hit? Like this game is undeniably an awesome blend of some genre defining games, but it just falls short on actually putting those elements from pen to paper the best. If the devs fixed the villagers so I wasn't watching a band of toddlers, made the combat feel like a feature and not an afterthought, and added just a little more nuance to enemy spawning it'd be an actual drug to me. Oh also, I don't feel this often, but I am 100% confident that these reviews are filled with bots, everybody with over 3-4 hours of this game commented on the sluggy combat, the wortless ai, or the insane unbalance with everything in the game, yet there's hundreds of people who played this game for an hour or two and swear this game is solid gold, no mention of the ui, ai, artstyle, combat, or anything, just a positive review saying \"the game is great! :)\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the ugliest female character designs I have ever seen. And I have seen ALOT. Even male characters are gay coded, they move like women.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game feels absolutly grindy... you need to invest 1 minute of real life time just to fell a tree... There are no storages other than the ones next to their harvesting sites. And also you have no good insight, what items you have in there. There should be at least a tabula appearing which lists all the items in harvest site. There are more problems, but this feels like work even in my free time...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is very grindy and repetitive. for every task that involves farming, building, mining, hunting, crafting and so on there is kind of a mini game. these tasks are fun for the first couple of minutes you meet them and you will soon be desperate to be able to delegate every possible task to a NPC so you won't have to do it yourself, meaning the fun of the game is the relief of being free from playing the mechanics the developers designed. once you get free from every task, you will be lead to believe the real fun of the game starts, which should combat and exploring. the combat is very clunky in the sense that everything may stop your movement. if you block, you get interrupted, if you get blocked, you get interrupted, when enemies attack you, you get interrupted, meaning it is very easy to get stunlocked with enough enemies. the dodges are not smooth and you may get your movement completely blocked by the bodies of fallen enemies, either by dodging on top of them or even jumping over them. there are hotkeys for consumable items but incredibly once you use them, stacks of the same consumable item is not replaced. the most designed boss fight is very repetitive and may often get you stun locked. unlike souls like games where you have to memorize multiple patterns, here there is only one pattern that needs to be repeated over for a long period without getting stunlocked or tripping over bodies. exploring is very little rewarding in the sense all the envirorments look very similar and there isn't much to be found, except for mini biomes that respawn a different kind of enemy with bosses that are not only easy to defeat but with very unrewarding prizes. the envirorments are pretty, but the designs, art and the characters are a bit ugly, which you can get used to after a while. even though the game is still being developed and is incomplete, I believe this is not what makes it bad. albeit the game might become more interesting as the devs add more content, those are fundamental flaws which might need a complete rework for the game to become enjoyable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Works fine for a while, then you load the game and you encounter \"Could not be loaded because its corrupted\", and you have to start all over. Again.\n\nBefore this occurred, I was playing some kind of chore-simulator, where I was made to serve my NPCs every need.\n\nPerhaps the game is better playable without NPCs?\n\nCannot possibly recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Feels a lot like Valheim in the way it plays with added the added village building mechanics, except the villagers are all incredibly stupid bordering on useless. Assigning one to the workshop, which is a crafting job, means that outside of the tiny amount of time they are making things (you have to manually assign every single craft), they will literally sit around and do nothing. Optimization is abysmal and some of the graphical effects both look bad and cook your GPU at the same time, like the fog and night causing everything to glow like crazy.\r\n\r\nCould be good, but needs more than a little work.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game gets plenty of updates and they add plenty of content, but they just never make the game optimized. Going from 60 fps to 45 fps to sometimes 90 fps looking at the same area. If the games textures look really good then it would make sense that you would get bad performance, but the textures don't really look very good and are very pixelated/grainy. This game is great but i cant get around to play it because of the FPS dips and low fps in general.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Feels like a free mobile game. The menu options dont work. This sucks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Railroads you into playing the game exactly as the devs intend you to. It's not a bad game, but I'm getting tired of not being able to build what I want when I want to. If I want to start a mine right away before calling in villagers (I don't like stone tools, so sue me lol), I need to make: A shelter, to then make TWO different work pits (that I don't even need), so that I can make a workshop pit that I did want, so that I can make the mine I was hoping to get. By the end of this I've spent an hour for the privilege of walking into a cave - still need to make the tools themselves and I'm over half an hour in. I'll then need to upgrade the workshop to access metal tools for myself. Very grindy with no real freedom allowed and no honest explanation given as to why.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "so much micromanaging, you get to gather/craft thing faster by yourself rather than deal with the villagers. Nothing gets done in time with their moods shifts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not really optimize in some card like rtx 3050 laptop",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}