{
  "positive": [
    {
      "review": "Clair Obscur feels like one of those games that shouldn’t exist, but somehow does because a bunch of passionate weirdos decided “yeah, why not?”\n\nThe dev story alone is wild:\nA French dude who speedruns Sekiro gets tired of his job at Ubisoft and just… quits to make his dream game. He calls his old university buddy, who ends up becoming the lead tech. He finds a musician on SoundCloud who makes the entire OST. He finds a girl on Reddit who agrees to voice the demo for free—and she eventually becomes the lead writer.\n\nThen they hire like thirty fresh grads who are all in over their heads but clearly giving it everything they’ve got. And member number thirty-three? A dog. Literally credited as the Happiness Manager in the end credits.\nAnd the crazy part is: the game actually turned out great. Stylish, unique, full of heart—exactly the kind of thing you get when people make something because they want to, not because some exec told them to.\n\nClair Obscure is a win for gamers and a big, beautiful middle finger to AAA companies that fill their games with garbage and micro transactions.",
      "voted_up": true,
      "votes_helpful": 2518
    },
    {
      "review": "If this doesn't win GOTY I will shove 33 esquie plushies up my *** because there is no way on the painter's green earth it ain't. Absolutely criminal that this got snubbed at the grammys when the OST literally went dimdim da dada and sat at the top of the charts for weeks, absolute cinema\n\nGame so good it made me post my first steam review when I heard of that tomfoolery, recommending this game for those who come after",
      "voted_up": true,
      "votes_helpful": 345
    },
    {
      "review": "I love this game! Unfortunately it does not do well on steam deck. If you have a good PC then great but I do not. I bought it on Xbox instead and am loving my time. I am just writing this in case you were wondering how it performed on steam deck. I tried tweaking settings for 30 min but couldn’t get it looking right. Otherwise highly recommend!!",
      "voted_up": true,
      "votes_helpful": 186
    },
    {
      "review": "My god, this might be one of the best games I've ever played. It's clear Lorien and the team poured their souls into this masterpiece.\n\nThe artwork is just... fabulous. Perfect amount of fantasy. During cutscenes, during combat, you're really never left feeling like something was missing.\n\nTurn-based combat is also really well done here. QTEs aren't forgiving at first, but you get the hang of it. Parry windows are extremely short, but man is it ever satisfying when you get it right. Equipment choice also really matters. Not just cuz of the stat increases, but also because of the unique benefits they give in combat. \n\nEvery time I got into a new area, new boss, new enemies, a new track played. And man, were those tracks great to hear. In fact, I still listen to some of the tracks outside the game. They're just so good.\n\nHeavily recommend this game, for any person that loves music, loves art, loves stories, loves turn-based combat, loves QTEs. loves RPGs. Worth it at full price, and even more so at a discount. A rare occasion for our sad gaming industry.",
      "voted_up": true,
      "votes_helpful": 109
    },
    {
      "review": "Absolutely incredible game, GOTY 2025 and probably a front runner for game of the decade.\n\nOnly negative (other than picto UI) I have is a game breaking bug when fighting Renoir. Once Une vie à t'aimer plays I am stun locked IRL and can't do anything. \n\n33/10",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "Whups. I thought I had left a review for this game ages ago. 33/10\n\nThis game put me through such a rollercoaster of emotions. It is perfection. Beautiful game with the most gorgeous soundtrack, engaging (and emotional) story and characters, fun content to enjoy, absolutely wicked combat. Along with Elden Ring, this has got to be the best game I have ever had the pleasure of playing. I cannot wait to play through the story again. I have been nominating this game for all the awards where I can because it 1000% deserves the recognition. <3",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "This is simply amazing. From the beautiful presentation to the incredible world building and how you get sucked into the story within the first hour of playing this is one of those great games you need to play.\n\nIt is also worth mentioning that this game manages to pick up where FF trailed of the path and then adds some. Even if you aren't into turn based RPG you should seriously consider to give this one a go.\n\nWholeheartedly recommended :)",
      "voted_up": true,
      "votes_helpful": 44
    },
    {
      "review": "for those who come after...\n\ni knew i’d love this game the moment i started crying during the prologue. didn’t even know the story yet, didn’t even bond with the characters... but it got me. FAST. never wanted this story to end. wish i could erase my memory just to play it again for the first time... no matter how much i praise it, it’ll never be enough.\nabsolute cinema, GOTY for sure.",
      "voted_up": true,
      "votes_helpful": 86
    },
    {
      "review": "These devs left Ubisoft and the first game they make is a masterpiece. GOTY material for those who come after.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "This is my nomination for Game of the Year. The only slight negative was the overworld map design which was a minor issue. The game itself is a joy to play. The atmosphere, world crafting, acting, combat, builds, story and music are all exceptional. Love the game.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "This game might have the best soundtrack in gaming history.\nFollowed by other great parts like story, characters, art design, combat etc...\nGood job Sandfall.",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "What can I say that hasn't already been said? This game broke my heart. And it was the best game I played all year. (My short amount of time only reflects what I played on Steam, but I did play it elsewhere as well.)",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Excellent visual style, engaging story, addictive gameplay, likable characters, and amazing soundtrack. My personal game of the year!",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Great story, amazing soundtrack, satisfying combat and it made be cry. Absolute cinema!!!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i dont know where to begin. this game offers something that you cant even imagine. the world, the gameplay, the music and especially the story. they are all beyond perfect!!!\r\n\r\ni cant talk about the story because aside from its mind blowing performance, its something that you can never really guess what it is unless you continue playing (or get spoiled).\r\n\r\nthe gameplay mechanics are fantastic. the first thing you notice is the dodge and parry system in a turn-based game. it may seem unusual to some old fashioned turn based players at the beginning, but as you keep playing, you will fall in love with it.\r\n\r\nwhen it comes to visuals, i have to say that Expedition 33 is a lovely and unique experience that you will never find anything like it. theres always something that makes me wanna press F12 to take a screenshot (i took 12k screenshots of it). the structure of Expedition world shows the mindset of its artists is something extraordinary and aligned with the story.\r\n\r\nand the same goes for the music. after lies of P, this is the second game that makes my soul dance to its rhythms.\r\n\r\nim telling you right now that this game will be the best game of the year in 2025. cause its not just a beautiful game with revolutionary gameplay, its a masterpiece that you'll never find anything like it again.\r\n\r\nso buy it at full price if you can. and believe me, i would love to buy it again if i could. Expedition 33 is the best poetic and story-rich game ive ever played in my entire life.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I think E33 is geniunely a good contender for GOTY and I get why its so critically acclaimed but I also get why some people dislike it as the mileage someone will get from it heavily depends on how much one resonates with the themes and the story in it, if for any reason someone doesn't resonate with the themes or dislikes them, they will most likely dislike the game overall. Thanks to how universal those themes are tho, vast majority of people will love the story and things it offers, it brought me to tears and I think it is a really good game. \n\nThe only two things I geniunely disliked about the game were the choice of an engine that I think greatly fucked with the incredible art direction and the gameplay stinks for the most part, I will never get behind parry/dodge system.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Is the game good? Yes. Is it some kind of a flawless masterpiece as some people hype it to be? No, it isn’t. In fact, if there was a neutral review - I would make it, because even while writing this review I am not entirely sure if I should make it a positive or a negative one. Now, let’s get a bit into the details.\n\n[h1] THE GOOD[/h1]\n[list]\n    [*] Music/sound. If I had to pick the best part of this game - it would be music. It is insanely good, to the point where I stopped at some locations just to enjoy the soundtrack. And it is also masterfully used to amplify plot/gameplay moments and create the mood for the events  you are going through. Pure 10/10, will listen again.\n    [*] World. It is interesting and well-made. It has enough weirdness to be interesting to explore and enough things to reward you with for that exploration, even though gameplay wise it is just a bunch of corridors.\n    [*] Characters. Unlike so many other games, characters here are neither blank self-inserts nor some kind of one-dimensional cardboard cutouts, they all have personality and depth that makes them interesting to follow.\n    [*] Plot. I will not call it great, but as a journey for our party it feels interesting, with a lot at stake and seemingly impossible challenges to overcome.\n[/list]\n\n[h1] THE BAD[/h1]\n[list]\n    [*] Platforming. I don’t really understand why you would include any platforming into a game that doesn’t have snappy movement and where characters sometimes switch to tank controls. I understand even less what kind of a developer would wake up and say “Hey, I know what we need in our story-rich RPG - streamer rage games!”. Not only those parts are absolute cancer to play through, but they also show how unreliable movement and physics in the game are - you constantly slide from what seems to be flat surfaces, fail to grab a ledge, get stuck on smallest things - it simply feels infuriating and out of place in this game.\n    [*] Pacing. It is simply weird. Act one is great, act two starts slowing down, as some of your attacks hit damage cap, while your enemies continue to increase their HP. Act three is a complete mess, as you are given a choice: either you go for the final fight, that is available from the start, and miss a lot of plot related information and a bunch of interesting content, or you go for said content and arrive at final boss so overpowered that this whole epic last fight loses any and all weight and impact, as you are just mopping up everyone with one shot AOE attacks.\n    [*] Lack of QOL features. You meet the enemy that you already fought, but forgot what elemental weaknesses it has? No journal, no markings in status bar, the only place to get this information is fan wiki. You want to change your perks? The menu has no presets, no search, no customisable filters - so every time the process becomes tedious and time-consuming.\n    [*] Combat. Considering that most of the gameplay time you will spend in combat - this is the thing that makes or breaks the game for you. And while many people were fine with it, I see too many problems with the system and it simply doesn’t work for me. While turn-based RPG requires you to exploit elemental weaknesses, prepare for combat and level up appropriately, the realtime system allows you to ignore everything I just mentioned by having good reaction - you can just dodge/parry almost any attack without paying attention to elements and levels. And if you go from the opposite direction of realtime action - there is way too much waiting for all of the animations to play. Sure, they are cool, but they are cool for the first 10 fights with this monster - not for 100s of times you are going to fight it afterwards. I also found the attack patterns on enemies erratic and confusing - not only the attack animation goes for far too long, but it also has several feints and weird delays, which makes fighting an enemy for the first time extremely frustrating and basically impossible to win (at later stages even with good levels you will still be oneshotted by almost anyone). And just to top it all off - at the end you will be able to get several builds that do millions of damage killing almost all enemies apart from some bosses in one hit - completely negating both the depth of turn-based element and required reaction as you don’t even let the enemy attack. And the fact that I enjoyed those OP builds (because they allowed me to get to the ending faster while engaging in combat less) should tell you enough about how much I hated the combat system.\n[/list]\n\nOverall: I did enjoy the game. However I enjoyed it in spite of the horrible combat system - the story/world/characters carried the game for me. So while I can recommend playing the game, I am also warning you not to expect much from the combat system - as it is really a coin flip whether you like it or not. And don’t expect it to be some kind of a “once in a millenia game” as so many people hype it to be, as honestly, while it is good - it is not THAT good.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game made me fall in love with it. The music, the plot, the gameplay, the masterpiece. My Game Of The Year for sure.\nFeels amaizing on NG+ but I wish there were more battles for NG+ nerds. Everything exept Simon feels too easy :(",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "What a work of art. Phenomenal story, a superb soundtrack, gorgeous art direction, and heartbreaking characters. Easy GOTY for me.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "It's by far the GOTY of 2025 for me. It's a masterpiece in visuals, music, storytelling, and more.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "An excellent narrative game which provides an action-intensive turn based combat system. Great music, great visuals, great characters.\r\n\r\nSome of the pacing of the later game content could have been better. Sometimes it felt like I was hunting for the \"next\" area where the enemies weren't too high of a level. Once I found the area though, game balance was generally very good.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Clair Obscure: Expedition 33 - симфония света и тьмы, написанная дрожащей рукой надежды.\n\nНевозможно передать словами, насколько глубоко \"Clair Obscure: Expedition 33\" проникла в моё сердце. Это не просто игра - это поэма в движении, написанная огнём заката и пеплом утра. Она не стремится быть идеальной - она хочет быть настоящей. И в этом её неповторимая сила.\n\nКаждый элемент здесь - не просто часть формулы успеха, а отдельная нота в великой симфонии, где:\n* Музыка не сопровождает действие - она становится самим действием. Она дышит, рвётся из груди, замирает в паузах между выстрелами и шёпотом прощаний. Она - душа мира, который вы исследуете.\n* Визуальная часть - это живопись, ожившая в потоках пикселей и акварельных теней. Каждая локация будто вырвана из сна поэта-мизантропа, где красота и ужас идут рука об руку.\n* Сюжет - тонкая, почти хрупкая ткань, сотканная из вопросов, а не ответов. Он не диктует - он предлагает задуматься, вспомнить, почувствовать. Он болезненно честен, особенно когда говорит о потерях, детстве и цене спасения мира, который, возможно, уже не хочет быть спасённым.\n* Атмосфера здесь - почти физическое ощущение: как будто воздух в игре можно потрогать, как будто ветер несёт с собой шёпоты прошлого.\n* Геймплей, несмотря на свою тактическую основу, удивительно элегантен. Он не отвлекает - он усиливает. Каждое решение в бою ощущается как моральный выбор, даже если речь идёт просто о перезарядке умений при атаках.\n* Персонажи - не герои и не антагонисты, а живые люди с трещинами в душах, с надеждами, которые они прячут под шутками и молчанием. Их истории хочется слушать наизусть, перечитывать, как любимые стихи.\n* Мир - это отдельный персонаж. Он дышит, страдает, иногда улыбается сквозь руины. Он не просто фон - он свидетель.\n\nОднако, в этой почти идеальной картине есть одна хрупкая нота предостережения - третий акт. Именно здесь стоит быть особенно внимательным. Если вы решите полностью пройти все побочные задания, собрать каждое достижение и прокачать героев до предела -  финальные сражения, задуманные как эмоциональный катарсис, превратятся в техническую формальность. Боссы, над которыми команда, вероятно, работала с трепетом и драматургией, будут падать за секунды, не успев произнести последнее слово. Это не их вина - это трагедия выбора игрока.\n\nПоэтому мой совет - и он родился из собственного горького опыта: в третьем акте идите прямо к финалу. Не сбавляйте темп. Позвольте себе прожить кульминацию в том ритме, в котором её задумали создатели. Плачьте, если захочется. Смотрите титры до конца - даже если за ними скрывается не надежда, а вопрос. А уже потом, вооружившись платиной как целью и спокойствием как союзником, загрузите последнее сохранение и отправляйтесь собирать то, что осталось за кадром. Либо перед финалом выполните побочные задания своей группы и тогда уже идите на финальный рамс.\n\n\"Clair Obscure: Expedition 33\" - не просто одна из лучших игр года. Это редкий пример того, как видеоигра может стать произведением искусства, не жертвуя при этом своей игровой сутью. Она не просит вас поверить в чудо - она даёт вам возможность его почувствовать. Даже если это чудо будет больным, неоднозначным и оставит после себя вопрос без ответа.\n\nИ в этом её величайшая победа.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Looks like a tech demo, plays like a proper game. Its existence is almost surreal.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "An absolute masterpiece. \n\nNo game comes even close to this one, nothing remotely good has been released in over a decade of gaming. The game looks beautiful, it plays as good if not better (reminds of the old good final fantasy games aka 7 and 10). There is no slop in the game, not one bit, the story is great which is being told with great voice acting through well written dialogue. Build variety sheer endless via an amazing ingame system in order to change and experiment/tinker. \n\nThe game puts all AAA developers to shame, they don't need to brag with how many people worked on the game (i think at the end something along of 50) but let the quality speak for itself.\n\nTo top it all of the soundtrack just slams the pedal down and doesn't stop at any point. When this game wins GOTY, the OST will be a big part of it. Pure beauty, everybody should enjoy the experience this game delivers. This game blurs the lines between art/game, a testament to why I fell in love with video games so many years ago. \n\nThis game deserves all the praise, hype, glaze it got and more. It deserves game of the decade, play it blind, play it now and do not regret waiting like me.\n\nMerci beaucoup.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Baguette Ingredients:\n\nFlour\n\nWater\n\nYeast\n\nSalt\n\nBaguette Recipe: Mix like you’re crafting gear. Knead like you’re grinding XP. Let it rise longer than a boss intro cutscene. Shape into baguettes, bake until crispy, and enjoy while pretending everything is fine. Perfect.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "[h1]Games like Expedition 33 is the reason why I love video games[/h1]\n[h2]\n[/h2]\nExpedition 33 probably one of the games that I will never forget and wish to experience again for the first time.\n[h2]\n[/h2]\n[h2]The Gameplay & Story   [/h2]\nEvery time I play this game, there was never a moment that felt boring and repetitive. From start to finish, this game is so good and fun to the point where I wish it never ended. The gameplay is probably one of the best Turn-Based combat I have ever played. This game allows you to react on almost, if not, all enemy attacks. You can parry, dodge, jump, and counter all of the enemy attacks in the game. So basically if you have mastered these mechanics, you can probably finish the game without dying or even taking any damage. Also, the build variety for the characters is so diverse that you can have different kinds of builds. There are also a lot of enemy variations where up until the end of the story you encounter new type of enemies. The story is so unique and well written, where it doesn't straight up tell you everything that is happening and let's you piece the story all together. The story pacing is an enjoyable slow burn that always keeps you invested until the end.\n[h3]\n[/h3]\n[h2]The Soundtrack & Graphics[/h2]\nThe soundtrack is probably one of my favorite aspects of this game. There are so many that was created for this game and all of them were used perfectly on the game's story and gameplay. When I open up my game, I sometimes just stay on the title screen just to listen. The soundtrack on this game is so good that I don't there are any more room for improvement. It simply is just peak. I can also confidently say the same with the graphics, everything in this game looks so beautiful, from scenery, character and enemy designs, and overall vibe of the world. Everything is an eye candy. I love it.\n[h3]\n[/h3]\n[h2]A Few Small Complaints[/h2]\nThere are very little things that I don't like about the game. First of all, the movement of the characters could get some improvement, although sometimes movement can feel a little jank, it does not ruin the experience of the gameplay and story even for a little bit. As the game is graphically demanding, there are only few graphics settings you can tweak, which lower-end PCs won’t benefit much. \n[h3]\n[/h3]\n[h2]My Overall Thoughts[/h2]\nExpedition 33 is my Game of the Year. It does not fall short on everything that it delivered. Be it from gameplay, story, and soundtrack. This game is so good that there are only a few complaints that I can give, and even those, does not break the game's immersion. That's how good this game is. \n[h2]\n[/h2]\nI highly recommend Expedition 33 to anyone to try this game. It deserves EVEN more praise from what it's getting right now.\n[h2]\n[/h2]\n[h3][i]\"For those who come after.\"[/i][/h3]",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "I haven't enjoyed a game like this in some time\nbeautiful and awesome soundtrack, from some cool bangers to some tense moments\nfun combat just like in jrpgs\nenvironment looks so bizarre and stunning\nstory caught my interest at the very start and made me tear up, that tells something\nperformance is quite good for a ue5 game too\ncan clearly see this game is a work of passion and it just feels so good I love it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Truly incredible expirience.\nTouching story, amazing soundtrack, engaging gameplay, beautiful art style and level design, rewarding exploration.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It seems like the time has come to write a review for Game of the Year.\n\nI've been waiting for this year to come to an end, for all the big new releases to die down, for me to decide for myself which game is the best this year, after evaluating everything I was interested in.\n\nAnd you know, I could have been writing this review as early as April 24, 2025 – nothing has changed since then. This game didn't win Game of the Year – it won the Game of the Year category itself. No one could come close to it, or even come close to its level. This is a competition without intrigue, without losers, only a winner.\n\nLong live Clair Obscur: Expedition 33.\n\nI don't know how to continue writing this review without all sorts of spoilers for those who come after.\n\nI've never seen a story as gripping, heart-stirring, interesting, and incredible as this one. Jennifer Svedberg-Yen has captivated me. She's created a masterpiece. The world, the lore, the characters, their interactions, the backstory, the development, the relationships, the experiences—all of this will leave you captivated. Imagine me saying this when the equally wonderful RDR2 already exists, where the people at Rockstar Games, with endless money and decades of experience, worked hard on the story. I don't want to downplay the value of that story, but imagine what had to happen for me to dare say something like that, where the author is writing a game story for the first time in his life, and yet he stands on par with Dan Houser. That's talent.\n\nAnd I haven't even mentioned the level design and the music yet. I don't know what to say. It's simply priceless. It can't be conveyed; you just have to experience it yourself. And while you don't have to buy the game to listen to the music, its full potential will only be realized when you listen to it while your heart leaps out of your chest from the action on screen. I just want to remind you that Lorien Testard was an unknown musician on SoundCloud.\n\nRight now, as I'm writing this review, listening to the game's soundtrack, the hair on my arms is standing on end and goosebumps the size of dinosaurs are running down my spine.\n\nIt's a masterpiece. I won't tire of repeating it. If I were incredibly rich, I'd buy it for everyone. Moreover, it's a perfect example of how games should be made. You don't need huge studios and thousands of people, you don't need billions in budgets. You need a team that's ready to make games, that wants to make games, and that loves games. You need Sandfall Interactive, you don't need Yves Guillemot.\n\nIf you're having doubts about whether to pick up the game (it's a sin to have doubts), you're afraid of the combat, you don't like it, then definitely pick it up. There's nothing to regret. The story, the music, the world, the gameplay, the build structure—everything is wonderful here (except for the \"only up\" levels; let's be honest, but no one is forcing you to play them). The ones who will regret it are those who haven't played it. I'd never played a game like this before or since, and I have no experience with combat like this, so that scared me too. I picked up the controller and forgot everything.\n\nFor those who come after!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Its pretty cool the ost is good the gameplay is fun and the story is good and it runs good on steam deck",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "To be honest, I don’t even know what to write. This game is so good that nothing really fits into words. One thing I can say for sure is that it brought my inspiration back, and that’s worth something.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "At first, I planned to buy the PS5 physical version at release to enjoy the game on a big TV, but it stayed out of stock for ages, so I eventually gave up.\nAfter months, a friend visited me and we talked about Clair Obscur Expedition 33. I finally decided to buy the game on Steam with a discount and see for myself: And woah, I really should have played earlier. Expedition 33 is mind-blowing and now I get why the reviews are so dithyrambic!\n\nFinished in about 50 hours, I still have many zones to explore and bosses to defeat!\n\nThe visuals are impressive and the art direction is perfect, the studio managed to create an amazing world filled with emotions. As for the story, I won’t say anything to avoid spoilers, but I loved the whole experience and it’s the kind of adventure you really have to live yourselves. The characters elevate the whole narrative.\n\nThe OST is a delicacy for the ears and it’s crazy that the composer wasn’t known before. You can change the difficulty whenever you want so perfect for any players.\nClair Obscur Expedition 33 borrows some mechanics from souls-like games and it works really well.\n\nTurn-per-turn usually isn’t my cup of tea but Clair Obscur Expedition 33 makes it genuinely interesting : thanks to the parry and dodge mechanics. And I’ve got to say, I’m a fanboy of parry-mechanic games!\n\nJust one small bad thing: you can’t rebind the controller, so if you’re used to parrying with LB, switching to RB isn’t possible. Good thing there’s a mod that fixes this.\n\nI do recommend Clair Obscur Expedition 33! You won’t be disappointed. My 2025 GOTY.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "An amazing story in a beautiful, original setting. Gorgeous graphics, stellar soundtrack (that I still listen to). A memorable game that everyone that enjoys RPGs should try.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Beautiful game, even more beatiful sound track. Unique gameplay and features that make this a truly once in a lifetime experience. Would recommend even if you're not used to this genre (I'm not either). Definetely deserves all the love it gets.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "[h1][i]\"When one falls, we continue.\"[/i][/h1]\n\nThis review is going to sound like it was written by a kid who just finished their very first video game. Which is funny, because it's exactly the opposite. After being a gamer for almost 40 years, I rarely get seriously impressed by a game. If anything, they often feel like a chore, just because of the \"been there, done that\" effect. But this? This is... Wow. Or should I say \"owowow?\"\n\nAnyway, our story begins with Ubisoft, the company known for its greed and copy/pasted games. And our hero, Guillaume Broche, grew tired of that. He wanted creativity, not just a paycheck. He left. And he wasn't alone. Another Ubisoft employee, Tom Guillermin, left with him, and since Tom knew Unreal Engine, they started fooling around with it. Things started to take form, and we got an early draft called Sandfall (originally, the game was supposed to revolve around time). But clearly, they needed more people, so... they wrote on Reddit (that was the scale, a bloody Reddit post). They looked for voice actors, but instead, they found their lead writer—Jennifer Svedberg-Yen. And she...\n\nOK, it's hard to describe the story of the game without spoiling it (actually, the one who included certain scenes in the trailer is a criminal). Again, with too many games behind me, I'm rarely excited about stories in video games. Heck, I'm one of those people who hated Last of Us, just because of all the \"Will you shut up already? I want to shoot something!\" Clair Obscur? Blew me away. Think MYST. Think Cornelia Funke's Inkheart novels, but also think something absolutely unique and beautiful. And also sad. Very sad. Like Cyberpunk 2077 (you can say a lot of things about that game, but it had some really good characters, and its story made a lot of impact because of how things were never fair), Clair Obscur pays so much attention to characters (without making things boring) that it's literally impossible not to care. And when you begin caring? The game will break your freakin' heart. Welcome to Clair Obscur, guys. A world of infinite sadness. Sadness so thick you can feel it with your skin. Which is... Shocking. Not because it's good (it is, though; both the story and atmosphere here are absolutely amazing), but because... Jennifer never wrote for video games. Heck, her previous job didn't even involve writing! Yet here we are. One of the most beautiful stories I've seen in ages.\n\nAnd you know what? It wasn't just Jennifer. Sandfall (even though the game wasn't about time anymore, Guillaume and Tom kept the name and gave it to the company they co-founded) hired another person with no experience—Lorien Testard. Who's Lorien? Well, he's a guitar teacher who worked on music for fun and posted tracks on SoundCloud. That's it. That's our guy behind the music. Means we've got a cute, yet simple soundtrack, right? Wrong. No, seriously, you couldn't be more wrong. With the help of soprano singer Alice Duport-Percier, Lorien created one of the most beautiful soundtracks I've heard in my entire life. It's not a paid review, but honestly, it's one of those cases when you simply must buy yourself a soundtrack. It's one of a kind, and it's impossible to forget it. You [i]will[/i] keep listening to it long after you finish the game.\n\nFinally, a couple of words about visuals. And it's yet another name that changed the project's look entirely. Originally, in its times as Sandfall, Clair Obscur was a Victorian steampunk. Hence, hiring Nicholas Maxson-Francombe, an illustrator known for such stuff, was logical. I mean, he's another one with no experience with video games whatsoever, but it still made sense. The thing is though, while looking at some random pictures he made, Guillaume understood that those are much more beautiful than what the team had in mind originally. Nicholas for the game's visuals is what Jennifer is for the story. It's hard to describe what he did specifically, but... let's just say he somehow captured a certain kind of [i]magic[/i] in his design. Thanks to him, the game has its own face, its own signature design. Unique and instantly recognizable.\n\nBut OK, for a person who believes that gameplay is the most important part, I talked too much about story, music, and visuals. What about the gameplay? Well, what we have here is JRPG. And yes, this game is not Japanese. It's French. Very French. A French aesthetic is everywhere. It's so French that, exactly like I recommend playing Japanese RPGs with the Japanese voices, I recommend playing this one with the French ones. And yes, thanks to the publisher and other financial incomes, English voices here come with the Hollywood cast, but still, I can't imagine this game without the French cast (since you can simply switch to it in options, it looks like it was suggested by the devs too). Yet it's JRPG. Because somehow JRPG became a genre's name, and JRPGs that were not made in Japan have been a thing for quite some time (Septerra Core anyone?).\n\nAnd you know what? It's yet another cool thing about this game. Let's just admit it, JRPGs are struggling now. Lots of them feel exactly the same (like those games from the Idea Factory, for example), while major franchises like Final Fantasy are going through one heck of an identity crisis. Personally, I used to love those up until PS2 times, where the gameplay changed so much that the games became something entirely different. Clair Obscur? In a way, it's what Final Fantasy wants to be but fails. It's also important to remember another Square-Enix title – The Legend of Dragoon. Remember how that game used a smart workaround to make turn-based battles more dynamic? Clair Obscur does the same. And it goes all the way into that direction. Despite being turn-based, it wants you to dodge, parry, and even jump during the battles. Which makes it feel almost real-time at times. And it feels... Awesome.\n\nNo, seriously. The battles here feel almost like something from the rhythm games. Remember good ol' Patapon? That's the stuff. When it's about those big bosses, you either pon-pon-patapon their attacks or die. And it's not just a coincidence, it's by design. On many occasions, the characters will compare battles to dances. Like everything else in this game, battles are bloody art. And so is the leveling mechanics.\n\nPersonally, I don't like overly complicated mechanics. Sitting on my butt and doing micromanagement for hours instead of exploring and fighting? Not really my thing. Clair Obscur? It can pleasure both people like me [i]and[/i] the micromanagement crowd. Long story short, things revolve around some items called \"pictos.\" Those are the things you can equip on your characters for certain effects (like Materia in Final Fantasy). What's interesting here is that those chain. Here's an example: There's that ultimate boss who can and will one-hit-kill you. What can you do about it? Well, you can equip certain pictos. One will instantly resurrect you and give you a second chance, another gives you some buff upon being resurrected, and the third one will give the boss a debuff. Do pictos right and you'll be able to one-hit-kill every single enemy in this game, including that ultimate boss. Which is extremely satisfying.\n\nAnd again, it was intentional. Clair Obscur's developers weren't just making a game. They were making a game they wanted to play for themselves. You can feel it everywhere. In how very special and personal the story is, in how beautiful the music is... Even the gameplay is full of some little touches it's hard not to praise. For example, my biggest problem with the genre is that battle animations are very long and the UI is too bulky. Sandfall guys? They felt the same. Thanks to which battles, despite being extremely spectacular, are also pretty fast-paced. So yeah. What we have here is not just GOTY, it's the best game I've played in, like, a decade. You either love Clair Obscur or you just didn't play it yet. It's simple like that.",
      "voted_up": true,
      "votes_helpful": 264
    },
    {
      "review": "Misunderstood artist gets rejected from art school and causes mass genocide on the human race.\r\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Strengths\n\nArtistic design and atmosphere: The light-and-shadow theme, spatial designs, and visuals are truly captivating.\n\nMusic and audio: Testard's compositions and the voice cast deepen the gaming experience.\n\nCombat system: Both strategic and dynamic, distinct from classic turn-based RPGs yet maintaining a familiar feel.\n\nStory and characters: Emotionally rich and thematically mature, successfully exploring themes such as death, loss, and hope.\n\nCommunity and critic support: High scores on Metacritic and very positive player ratings, the game is also a commercial success.\n\nDeveloper commitment: Patch support, balance adjustments, and gameplay improvements demonstrate the developer's commitment to the player community.\n\n\n\nWho's It For?\n\nRPG lovers: If you particularly enjoy classic turn-based RPGs, but are also looking for something new, this game is for you.\n\nArt and atmosphere enthusiasts: If visual aesthetics, narrative, and music are important to you, Clair Obscur will likely captivate you.\n\nDeep story seekers: If you appreciate character-driven, emotionally, and thematically rich experiences.\n\nTime-intensive players: The game's maps, side quests, and systems require patience to explore; it may be challenging for those looking for a fast-paced, mind-numbingly simple experience.\n\n\nCons:\n\nSome technical issues (performance, visual bugs).\n\nThere are criticisms regarding exploration, such as \"mechanically, it's not enjoyable to explore.\"\n\n\nAt times, the dramatic story may be considered over-the-top or melodramatic for some players.\n\nIf you're looking for a strategy + story + aesthetic RPG, I think it's definitely worth a try.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I think the main reason why I write the review is that after more than half a year, I still have the emotions about this game. It's the music, the visuals, and the story. I want to replay it, but I already finished all the achievements and secrets.\n\nThis game is just a light in the horror of the current state of game development. The Sandfall team, thank you, and please keep going!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Think about the best game you played in you career of Gamer, you can know change your mind and think about Clair Obscur: Expedition 33.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "In many respects, Clair Obscur: Expedition 33 is a masterpiece. From its deep and challenging turn-based RPG mechanics, to its gorgeous soundtrack that I haven't been able to stop listening to since I started playing. There's something about the world developer Sandfall Interactive has created that just sucks you in. Telling a deeply heartwrenching tale, Clair Obscur is often more than the sum of its parts. Surprising you constantly with new mechanics, new challenges and twists and turns one might not expect. Whilst some of its side missions don't work quite as well as the spine of the experience (looking at you Gestral Games), these are simply side distractions in what is a captivating world filled with brilliant storytelling. One I'd love to see more of one day. Even its turn-based gameplay offers something new to the genre in its parries, dodges and jumps mechanics that task players with the challenge of mastering precise moves in an attempt to block damage or even counterattack for big time damage to your enemies. With so many unique creatures to battle, mastering these mechanics is the real challenge of the game, but also its best features. Beating that difficult boss offers a level of satisfaction that only the likes of Dark Souls can match. \n\nIt's an easy recommendation from me. Clair Obscur: Expedition 33 is one of the best turn-based RPGs to come about in years. Special mention as to go to the beautiful soundtrack, which is the best you'll hear all year.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I can't remember ever truly enjoying a turn based RPG, let alone a western one before playing this.\r\nHell, I can't even name any good games coming out of France/Quebec except older Ubisoft classics before playing this one.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Had a lot of fun with this game, and while I think this is one of the best games of 2025, it is not without some issues that really irked me. \n\nFirst the pros: Loved the story and most of the characters. The way the story played out genuinely kept me completely engaged on what would be revealed next. The characters mostly felt genuine and I really came to care for them. Some of the twist reveals were really well done. The graphics are really nice, and just the aesthetic tone of the game through out really helps nail down the feeling of the game as a whole. I think the best part of this game is the soundtrack though. The music is so damn good, and something I can listen to outside of the game. It's rare I want to just hear a game's soundtrack on it's own, but this is one of those.\n\nCons: The combat after a while with the constant  quick time dodge, parry, jump just got too repetitive. I would have enjoyed it better if that system was for more major attacks from enemies, and not all of them. As someone with ADHD, I would get distracted and take more damage often.  I eventually just got a trainer to auto handle that for me because it overstayed its welcome. Another gripe I had was the movement through the world sometimes felt a bit slow and tedious, especially when on the open map before finding faster ways to move around. The other major gripe I had was not being able to advance conversations during cutscenes. As someone with ADHD and plays with subtitles, I read faster and sometimes just want to move to the next line. The only options available were to watch the cutscene in its entirety or skip it altogether. \n\nWhile the gripes keep this game from being my favorite release of 2025, it is still up there in my top 5. I think it's a must play for RPG fans, and people with more patience than my ADHD allows me are sure to not suffer from the same issues I did.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "A good game that excels in it’s refreshing approach to turn-based combat and bold narrative. In many ways, this game is very ambitious – so much so that it’s to its own detriment. It tries to do a lot and does a lot well enough so there is a good chance you will find something that will grip you in this game. This game is very close to greatness but it’s just not quite there yet. I recommend you give it a try even if you don’t typically enjoy turn-based games.\n\n\n\n\n\n[h3][b]Story [SPOILERS][/b][/h3]\n\n[spoiler]The introduction is really good. I found the dialogue in it to be refreshingly earnest – the people you talk to before the expedition felt human. It sets up the melancholic atmosphere of the world and gives both you and the characters hope only to crush it immediately. Even if you perhaps found it predictable, I feel like the true strength of this opening sequence lies in the dialogue that gave a lot of life to Lumiere and its citizens concisely. [/spoiler]\n\n[spoiler]However, the game doesn’t maintain the quality of this intro. For the first few areas you are riding on the thrills of the introduction, getting accustomed to the combat and beginning to ask a lot of questions. Unfortunately, from a narrative perspective all you get to do is ask questions. Whenever you do get an answer, it only ever leaves more questions. A lot of times you can’t even really comprehend what is being talked about, like the nightmares Maelle has for example. This gets exhausting towards the latter part of the middle of the game and while the answers do end up being worth the trouble, it doesn’t change the fact that the flow of information in the story is poorly done.[/spoiler]\n \n[spoiler]It’s a brilliant opening sequence followed by an exhausting and confusing middle game that ends with a bombardment of every single question about the world being answered back-to-back in a never-ending sequence of climactic cutscenes and battles. It’s a great story but it should have been executed better.[/spoiler]\n\n\n\n\n[h3][b]Combat[/b][/h3]\n\nParrying and dodging is a great addition that makes battles much more engaging compared to traditional turn-based combat. Focus is on the parry as dodging ends up being a more niche option. You can build around your dodge but you do lose out on a lot if you don’t parry, so you’re really encouraged to parry. Regardless, dodging is a nice option to have – you can make it easier for yourself and take less risk.\n\nNevertheless, the limitless potential of parrying is what really makes the combat stand out. You can technically win every battle if you parry every attack, making punching above your weight class a lot of fun.\n\nThe excellent sound design also really shines through here – you can at times parry according to audio cues, and the sounds behind parrying give the counter-attacks and the parries themselves a lot of weight making them very satisfying. It plays a big role in keeping the parry of which you will be doing a ton of engaging all the way to the end and it makes up for the faults of the visual presentation.\n\nAnother strength of the combat is the pronounced variety between each party members moveset with the addition of a unique gimmick for each one of them. Felt great to try and maximize the potential of some of them, especially Maelle’s Virtuose stance.\n\nTypical turn-based RPG elements are also present – levelling, skill acquisition with skill points, passive abilities through Pictos and Luminas… There’s a lot to minmax which unfortunately sometimes leads to exhaustion. \n\nTo get the most out of your builds you’re encouraged to play around with Pictos, Luminas and weapons. However, you acquire all of those at a fast pace and zones tend to be fairly short with each one having different weaknesses and enemies. All of this is circumvented if you spend time doing optional stuff because you’ll likely be able to get through on raw strength anyway. Similar feelings arise when a new party member joins and you have to learn how to play with their unique ability. It can be overwhelming to keep your build up to date considering how short of a time you get to enjoy it before you are presented with a lot more options.\n\n\n\n\n\n \n[h3][b]Presentation[/b][/h3]\n\nVisual presentation is what I found to be this games biggest fault. I personally didn’t enjoy the artstyle much but that is a subjective matter. What I’m referring to is the incredibly busy visuals present no matter what you’re doing in the game. The art direction is at fault here. Even if you don’t resonate with the artstyle itself, it’s certainly possible to appreciate it – which is something that was made very difficult as a consequence of poor design choices. \n\nYour screen is almost always full of particle effects and busy backgrounds. An example of why this isn’t executed well is when the game shows you a vista. During those moments, I found it so difficult to take in the essence of what it’s trying to show you. There are so many visual motifs ever-present and the areas themselves are so short that you were constantly being shown something new, something more. It’s often times very suffocating to look at this game. There are peaceful visuals in this game but it’s either that or rocks flying, dead bodies, the monolith in the background, enemies roaming… The issue becomes not that they want to have a busy arstyle, it’s that they’ve designed it in a way that makes it really difficult to take any of it in and feels like a blur more than anything.\n\nBattles themselves have the same issue. It’s to the point where sometimes it’s hard to tell what an enemy is even doing since the animation and particle effects make it very difficult to see. Not all party member attacks have this problem but enough do where they’re difficult to visually to take in since you’re doing a quick time event during an elaborate animation that is shown to you through shaky camera work and tons of particle effects.\n\nAnother issue with the presentation is how, for lack of a better term, “put-together” this game can be. Easily the best example of this is the platforming mini games on Gestral beaches. They feel so out of place and unsophisticated that it’s very hard to take it seriously. Another example is the little zones you find which only contain a music record. Platforming in general looks very clunky. It takes away from the world a lot when lazy, put-together elements are in it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I realized right from the opening moments that I was going to love this game. I didn’t even know the characters yet and still found myself drowning in the story. It pulled me in instantly. I wish I could wipe my memories just to experience that first playthrough again. No amount of praise could ever do it justice. It’s one of the finest games I’ve played in years — stunning atmosphere, amazing combat, and flawless presentation. Pure cinema. My personal GOTY without a doubt.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[h1] Clair Obscur: Expedition 33 [/h1]\n[h2] My game of the decade [/h2]\nEvery once in a while, a game comes out that just does more then just entertain. It rewrites what gaming means to you. Clair Obscur: Expedition 33 did exactly that for me. It shifted my perspective, rekindled my likeness for games in a true manner. I thought the problem was me that i didn't liked gaming that much anymore but it wasnt me, it was the games most of the time.\n\nMy belief that specific games are true art and that this kind of medium has the power to move, inspire and break you emotionally in the best way possible, got confirmed here again!\n\nI went into it curious with the question if i even would like that style of game but what i found was something extraordinary.\nA masterpiece, a defining moment in modern game design. This is not just Game of the Year....it's Game of the Decade for me.\n\n\nThe writing is immaculate.  Alive, breathing, human. It was impossible for me just to connect and stick with one character, because i've connected with all of them.  I loved their stories their journey's, ambition.\nI felt their joy, anger, sadness. in every moment. even now everything the characters and the story feel like they're still with me, traveling with my thoughts.\n\nThe Story, Characters, Music and Atmospshere, swallowed me completely.\n\nThe emotional moments embedded into this story,\ni felt joy, awe, pain, love, loss i wasn't just playing i was living the moment.\n \nThe only game in existence that made me even cry.\n\nHow many games can do that?\nVery, very few.\n\nYou can feel the heart of the developers in every note, every brushstroke (painting hehe), every line. \nThis wasn't crafted by a studio chasing trends or profit. This was created by artists who wanted to say something, leaving a mark. They said it beautifully!\n\nFINAL WORD:\nIf you love games......truley love them as emotional works of art.\nClair Obscur: Expedition 33 is something you must experience. it is bold, beautiful, devestating, uplifting and unforgettable.\n\nThis game deserves their awards rightfully\n\nAnd for me personally, nothing this decade has come this close\n\n33/5 STARS A true masterpiece and work of art!\n\n[b] A game i will remember and carry with me for the rest of my life. [/b]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the story, the characters, the music, the art; it'll break your heart and then help repair it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This games visual style is more than amazing, the soundtrack wants you to just play on and on. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A very diverse and different game from all genres, especially in gameplay, with a very powerful story and music in a fantasy world that has been carefully put together to encompass a dramatic story. But in terms of graphics, cutscenes, and attack animations, it could have been much better. Overall, it is a very attractive game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a genre defining game. A game that solidifies it's position as a great addition to the turn based role playing genre. A true masterpiece in storytelling and gameplay.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Bought it for soundtrack, stayed for story.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "AAA slops with marketing budgets of a small country's gdp have no excuses for being so much worse than this masterpiece 30 people put together",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "⭐ Clair Obscur: Expedition — GOTY Contender Review ⭐\n\nClair Obscur: Expedition isn’t just another stylish RPG—it’s a bold artistic statement wrapped in one of the most creative combat systems we’ve seen in years. From the moment you step into its surreal, painterly world, you realize this game is doing something different, something that pushes the entire genre forward.\n\n🎨 A Visual Masterpiece\n\nThe game blends impressionist art with modern rendering in a way that feels alive. Every environment looks like a moving painting, and every moment is visually breathtaking. It’s not just pretty—it’s unforgettable. This level of artistic identity alone makes it stand out from every other release this year.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Amazing game that to me, kinda came out of nowhere. And these are usually the best games. The story, the music (omg, the music), the world... all was done so well. There are so many talented people behind this game and I can't wait to see more from them.\n\nAs someone that does suck at timing things, I did get a mod to give me a wider window on the Parry/Dodge mechanic, so that was a helper to me to really enjoy the game. \n\nYou can also eventually make bonkers builds were you one shot about anything in the game, including bosses. The music I still listen to because I love it so much. Not many games make me cry in the Prologue, this one did and it did it exceptionally.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Games with turn-based combat usually aren’t my thing, so I went into this one skeptical despite all the praise I had been hearing. But I’m so glad I gave it a chance. It’s easily landed in my top five games of all time. The art style is beyond stunning, the soundtrack is packed with absolute bangers, the story is compelling, and the unique twist on turn-based combat had me wondering why I ever claimed to dislike the genre in the first place. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "There's no other way to say, this game is outstanding, its my personal GOTY and forever people will talk about this game. The gameplay is amazing, the lore is captivating there's a lot of mystery going on and the soundtrack OMG\r\n\r\n11 out of 10 - buy it, play it - writing this for those who come after",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "FOR THOSE WHO COME AFTER \nI Have No words that will describe how great this game is.\nGOTY For sure",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I remember I tried out this game, because from what I'd heard kinda reminded me of BG3, and well I soon learned otherwise...\n\nThis game is very good and I understand why people liked the game so much, listed below is a segmented review I have of the game.\n\nArt style: Look at trailers and pictures to get the idea but the art style is very majestic and unlike anything I've seen before. I really enjoyed getting to see such a beautiful world as you progress through the story, with this comes the great design of enemies/bosses which always just look so cool to look at.\n\nMusic: The music in this game is fabulous because if not only plays great music, but uses it incredibly well. I mean that all the soundtracks fit perfectly to elevate the mood of wherever you are in a game to the next level. It's very rare to see a game that can not only create a masterful soundtrack but nail it on the timing.\n\nBattles: I don't dislike turn-based combat but not necessarily enjoy it either. However I love the combat system where you can learn smart combinations from a wide varity of options and skills the game teaches. Or you can be like me and not think that hard and spend a long time learning how to parry attacks.\n\nStory: I cannot talk much about the story without spoiling but I will say this is one of the greatest stories I have ever experienced, and made me left thinking. The game does a great job of tying together close connections and details with characters with very well done cutscenes. It felt to me like I was watching a theatrical production for most of the game, which I really enjoyed. Here is the premise to understand the start without spoilers: Every year a figure called the Paintress lowers a number on a monolith in the distance, everyone who is that age dies. For awhile now Expeditions go out the year before they know they are going to die to attempt to destroy the Paintress, all have failed.\nThe game takes this premise and expands on it immensely, making for a story worth the hype- with many twists and turns to keep you engaged. \n\nMy Con- Throughout the story there are many extra areas and side quests. I feel like these need a rework. Some quests are thrown in as fillers with some helpful rewards but don't exactly match the urgency of needing to complete your quest. Some quests have some really great lore and information but these aren't always obvious that they should be done. Others are just off the beaten path. I wish some of these quests that are really good for story were pointed to more clearly, or impropriated into the main story in some fashion. Because it feels a bit weird going through the main story and then picking up the story bits.\n\nOverall: Expedition 33 is a masterpiece and a must-play for people who like to be immersed in an incredible story (and have the patience to see it through)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the greatest games I have ever played.\n\nGameplay - Intense, Fun & Challenging!\nMusic - Breath-taking!\nStory - Pure Cinema!\nCharacters - Unique & Charming!\n\nI don't think a review can really justify how impactful this game is, you honestly just need to experience it!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "➤ Genre:\nTurn-based RPG / Stylish Combat\n\n➤ Pros:\n\nStunning visual effects and stylish turn-based combat\n\nReal-time action system that smartly fixes the late-game sluggishness typical of turn-based RPGs\n\nBackgrounds, objects, characters, and creatures all look like pieces of art\n\nFrench artistic sensibility shines through every part of the game\n\nCutscenes and cinematic transitions are breathtakingly beautiful\n\nExceptional soundtrack, with “une vie à t’aimer” being an absolute standout\n\n\n➤ Overall:\nThis game is not something you can simply call “just a game.” The gorgeous effects, stylish turn-based combat, and the brilliantly integrated real-time action system create an amazing experience on their own. But what struck me the most was how clearly the developers feel like true artists. The environments, objects, characters, creatures, and every cinematic moment are so artistic that I constantly found myself stopping to admire them. This game perfectly shows why France is known as a nation of artists—sometimes the visuals were so dazzlingly beautiful that I was literally stunned.\n\nThe music is just as incredible. Every track is great, but “une vie à t’aimer” is on another level. In the boss fight where the calm classical piece transitions into that song, the screen fades to black, petals blossom, and the melody shifts into electric guitar—no matter how many times I watch it, I get chills. The harmony between the classical female vocal and the modern male vocal always gives me goosebumps.\n\nThis isn’t just a game. It’s a piece of art.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Best game I've ever played. Game of the year, maybe of the decade. Phenomenal gameplay, history, music or world design. Perfect in every detail. \n\nAnd remeber i am daily grand stretegy fan. Not jRPG, but this game is a masterpiece.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My favorite turn based RPG and my personal 2025 GOTY. This game was made with love and exceptional talent",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great story and characters.\nThought I was going to play a better looking Persona game but got something way better.\nDefinitely worth your time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its a game about my best friends who are all part of an amnesiac death cult in Belle Époque France.\r\nThe turn based dodge mechanics are ghastly and fabulous. \r\nI love it! <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely recommended, I will have to return to this review when I've progressed further though. A gem across gaming history - through and through.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Thats how latest FF games was supposed to be. The music alone worth it, spent 30 minutes in the game menu.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If Persona 5, Final Fantasy Tactics, and a fever dream from a French impressionist painter had a lovechild raised by Charlie Cox (Daredevil himself as Gustave? Chef's kiss), this is it. Combat that'll have you sweating parries like your life depends on it (spoiler: it does). Story hits harder than getting gommage’d at 33. OST? Grammy-snubbed but god-tier.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Definitely for those who come after seeking a best game that never played turn based RPG games before in 2025\n\nsure it's another turn based RPG game just like Final Fantasy/Persona series but it does proven to be one of the kind in the genre as while i play from time to time.\n\nVisually it really is looks like an fantasy theme art museum no matter where i heading to, while also did the excellent job as audio wise(music, combat sound effects, character traits and so on)\n\nstory do interests me too(pretty remarkable even just chapter 1 only so far for me)\n\noptimization? welp might be a bit concerned if you are more favor over 60/144FPS guys.\n\nmy i7-7700k + 1080ti can run avg 40-60FPS around 1920x1080 medium/high hybrid settings without upscaling.\n\nstill it runs pretty exceptionally well compared among with all unreal engine 5 game.\n\neven i rarely play turn based RPG games it does worth every single penny i purchased.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game of the year 2025 and it isn't even close.\n\nThis game deserves every bit of its success. An indie game that punches so far above its weight in gameplay and polish that you'd be fooled into thinking it was a AAA release. Beautiful art direction, an amazing soundtrack, and a great character driven story. \n\nA distinctly French take on the classic JRPG, this game stands at the top of the genre it's a love letter to.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have played this game more than once already and I still love every bit of it. The story, the music, the emotions... It's worth cursing out Simon once or twice.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A game made with love and passion for every gamer! Deserve Game of the Decade!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Absolutely incredible experience end to end. One of my favorite things in RPGs is getting super overpowered so I can stomp everything and that is very feasible to do in this game. It also has settings for adding challenge if you don't want to be stomping everything. The story, music, characters, atmosphere, and everything are all just so, sooo good. Highly recommended game.\n\nSidenote: there is also a story mode where you can practically walk through the entire game if you just want to experience the story.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best games I've ever played with a godly soundtrack and amazing story. Plus it cured my hatred for the french",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fantastic art evokes emotions; it frees your mind to wonder, to contemplate, to think, and Clair Obscure delivers that. Clair Obscur is French for light-dark; a painting technique that uses color contrasting to convey depth or enhance the dramatization of a subject matter. E33 embraces the essence of Clair Obscure, the contrasts between the gorgeous and the gruesome; it explores and navigates themes like grief, love, and existence.\r\n\r\nThe narrative is an absolute delight. Its captivating themes are heavy yet never feel overbearing. The characters are written with so much love and attention, brought to life by incredible VOs. The story itself is very unique and impossible to predict, but I will leave it at that.\r\n\r\nThe Music, oh maaan, I mean... simply speaking I lack the fluancy to describe how amazing it is... The emotions it evokes, the scenes it enhances, even the ambient and effects sound design, oh god, it is so freaking good. \r\n\r\nThe graphical art direction left me in awe constantly. I legitimately couldn't close the game; even when I was AFK, the eye candy was real. The animations were clean and satisfying and had some heft to them. Together with the aforementioned sound design, moment-to-moment gameplay just felt great.\r\n\r\nThe gameplay pulled me in quickly. The turn-based combat felt intuitive from the start, and the surrounding systems; weapons, passives, lumina, pictos, made experimenting feel rewarding without being overwhelming. The active combat moments were a highlight too; landing a perfect parry and following up with a counterattack stayed consistently satisfying.\r\n\r\nFinally, the cohesion between the multi-disciplinary art forms comes together so well, enhancing each other and creating a believable world you really want to immerse yourself in without ever wanting to leave.\r\n\r\n+++++",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I wish I could delete my memories of this game,\r\nto play it for the first time again... \r\nand get traumatised all over again. \r\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Very bad\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Difficulty (in Normal) }---\n☐ Just press 'W'\n☐ Easy\n☑ Average\n☐ Difficult\n☐ Very difficult\n\n---{ Story }---\n☐ It'll replace your life\n☑ Lovely\n☐ Good\n☐ Average\n☐ Some lore\n☐ No Story\n\n---{ Game Time }---\n☐ To infinity and beyond\n☐ Long\n☑ Average\n☐ Short\n☐ Long enough for a cup of coffee\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ The game itself is a big terrarium for bugs",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Clair Obscur: Expedition 33 is easily one of the most stunning gaming experiences I’ve played. I ended up 100% completing it because I simply couldn’t stop playing until I had explored every corner of the world it had to offer. \nThe story and characters pulled me in from the very beginning and by the end I was genuinely attached to them. It’s rare to find a narrative this moving, told with such care. \nThe world is hauntingly beautiful and the music is phenomenal and elevates every moment. The combat is fluid, stylish, and deeply satisfying. Every encounter feels meaningful and expertly crafted. \nFrom start to finish, Clair Obscur: Expedition 33 delivers an unforgettable experience. It’s visually mesmerising and emotionally gripping. An absolute must-play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’ve played so many games, so many masterpieces and classics, I never thought a 2025 game could ever make it on my top 10 list, but here we are.\n\nYou absolutely need to play this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Heart gripping storytelling with stunning visuals. Engaging gameplay for both the casual and the min-maxer. Breathtaking audio design. Varied build variety rewarded through unique pictos and luminas. All packaged into Unreal engine without murdering your frames. A satisfying post-game for the 100%-er and a more focused mian story for those who just want to expereince it. A definite contender for game of the year.\n\nThe only part of the game i did not enjoy was hitting max level, but it only took a few hours to get through.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The world is gorgeous and surreal and the soundtrack + voice acting help make the atmosphere really immersive. The story is heavy, dealing with themes like grief and purpose, but it’s powerful and memorable. It’s a super impressive game for a small studio and one of the standout RPGs of the year. If you like emotional stories, stylish worlds, and strategic combat, Expedition 33 is absolutely worth playing!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Already played this game 1 and half time on Xbox gamepass, bought just for the love of it. Absolute masterpiece, absolute cinema. Infinity/10. A must buy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I barely ever write reviews for games I played. But this game is the reason I will now...\n\nI am going to repeat words many already have said. This game is a masterpiece in every meaning of that. In the world of recycled ideas, endless sequels of the same recycled ideas which are just identical as the previous 3 entries (yes Ubisoft I am looking at you rn). In the world where game developers do not respect the players' intelligence and spoon-feed the story as if players were 5 years old. And finally in the world where games are created not from pure passion but from will to maximize the profit. In this world, Clair Obscur: Expedition 33 is THE game that shatters all these stereotypes. This is not even the game, this is a masterpiece which combines multiple layers of art in a beautiful label.\n\nLet me break down every aspect of gameplay to express how incredible this game is:\n\n- Music - Imagine the best film songs you've ever heard; the level of Hans Zimmer, John Williams, or Ramin Djawaldi. Now imagine over 8 hours of soundtrack with the similar level of mastery, every inch of which is so well tailored to the context, the scenes and the characters. Songs which stay with you long after the game ends.\n\n- Sound Design - Not only the music, but also the Sound Design is brilliant. If you are able to parry boss's attacks blindfolded basing it only on the sounds you hear, that means something, and sometimes when I wasn't able to parry some attacks based on the visual aspect, sound was the most helpful factor here. \nAlso every location has an amazing ambient which together with music and breathtaking visuals creates a real work-of-art.\n\n- Story and Narrative - I won't spoil anything don't worry, but... the depth of the narrative, the lack of understanding, the emotional build-up, the multi-layeredness of the characters... I have never seen anything like that in any game before. This is the first media that made me cry multiple times in a single playthrough... I almost never cry watching movies or playing computer games; but this damn game broke me. \nI have always hated games which included team management and the main story was spread between multiple characters. I played Baldurs Gate 3 and it didn't attract me as much, even though I deeply understand the hype and value the game (I hope to finish it in the future though :D). Here this hasn't bothered me even for a single second and was perfectly connected to the plot. I haven't felt disrupted for a single moment and was able to ignore my indifference to team management because of how well it was done.\n\n- Gameplay and combat - This is a very interesting concept. It is like the mixture of JRPG, Soulslike, and turn-based combat, but done better in every aspect. This reinvention of traditional JRPG which again was not my cup of tea (I haven't tried Final Fantasy yet so might check it out now) worked perfectly executed. The need of the player being forced to actively participate in combat was the factor that made each fight exciting, and rewarding (especially if you finally learn the attacks of the boss and are able to perfectly parry each one of them). Even if you thought the turn-based combat to be boring, you might be pleasantly surprised when trying out the Expedition 33. \n\n- Voice acting - Finally the voice acting. If not the wonderful performances of Jeniffer English, Ben Starr or Charlie Cox, this game would not hit as hard as it does. Their skill to paint the characters in so clear and extraordinary way added a cherry on the top and again, I haven't heard another voice acting on a similar level for a while now.\n\nThis game is going to be spoken about in a 10, 15, or 20 years from now as a masterpiece; a symbol of what gaming may be in the times of lazy reuse of assets and profit-focused corporations. I genuinely hope for it to win GOTY and I am looking forward for whatever Sandfall Interactive does next. \n\nFor those who come after...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nothing short of a masterpiece. \n\nThe visual design is second to none - hauntingly beautiful, with almost every single frame deserving of a screenshot. \n\nThe OST is to die for. Over eight hours of atmospheric, immersive music with clear French influences. It elevates every cutscene and every battle (Rain from the Ground is an absolute bop).\n\nThen there’s the story, which is an emotional gut punch in the best possible way. It will make you cry more than once.\n\nProbably one of the best RPGs I’ve played in years. Absolutely deserving of its flowers and all of the inevitable awards it will receive!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Masterpiece. Never played anything like this, one of the best story games ever made and don't let turn based combat shy you away from how insanely written this game is. 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Completely blew me away from the first second. One of the best games I've ever played and one of the most memorable gaming experiences I've had in a long time. The story is super engaging and full of moments that hit hard. The soundtrack is a masterpiece.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game at a great price. The story and world pull you in right from the start, and the pacing feels just right without the game overstaying it's welcome. The soundtrack is one of the best that I have heard in a while, with each area in the game having a unique feel and sound. Some of the minigames can feel a bit jank, but they are completely optional and there are only a few of them, so they can easily be overlooked by how strong the rest of the game is.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Game is great, [b]although its a turn based game, they make it more interactive with dodge, parry and Jump mechanics[/b]. Furthermore the dialogues and story are mostly extremly well written, even tho im not the biggest Fan on some Story beats but overtime, i disliked them less. All the main characters are also pretty great written with their own strengths and flaws. Great Voice acting performances across the board with [b]banger Soundtracks.[/b] The Games visual Art style is also a Eye candy in all the Level Areas. \n\nI recommand to play it on the hardest difficulty if you are looking for a challenge since you have to utilize the game mechanics more often. It never felt frustrating, playing against Main Story Enemys. However it can feel kinda unfair, when you fight agains optional bosses but thats mostly because you are just underleveled. You can always go back and fight them later on. Also idk if i mention it but the [b]Soundtracks are a banger.[b]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love this game.. music, characters, artstyle. Masterpiece. GOTY2025 - Game of the Decade even!\n\nPS: fuck volleyball",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Expedition 33 was honestly amazing. \n\nFrom the moment it started, everything just felt smooth, fun, and super well-put-together. The whole experience is packed with unexecpted moments, great pacing, and a vibe that keeps you hooked the entire time.\n\nEverything is full of surprises, espescially the story. Totally memorable and enjoyable.\n\nOverall solid 10/10 - For Those Who Come After",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I absolutely loved Clair Obscur: Expedition 33. The visuals are gorgeous, the world feels amazing to explore, and the combat is super fun and satisfying. The characters are great too—easy to connect with and genuinely memorable. Everything just comes together perfectly, from the music to the story.\n\nI 100% recommend it!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Lune's Feet 10/10 also the music is pretty good",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Expedition 33 is brilliant. Buy it and play it, you cheap bastards!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the most emotional and beautifully crafted games I’ve played in years. \nGOTY without a doubt 🥖\n- 100+ hours.\n- all achievements;\n- zero boredom;\n- zero skipped cutscenes;\n- several emotional breakdowns (in a good way);\n- music so good I pre-ordered the vinyl and can’t wait for the London concert next year.\n\n\n\n\n\n\n\n\n\n\n(and yeah, f*ck Simon)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It has been a long time since I’ve found a turn-based game that truly breaks out of the mold, but Clair Obscur: Expedition 33 managed to remind me why I fell in love with the genre in the first place. This isn’t just another stylish RPG—it’s an experience that pulls you in with its haunting atmosphere, emotional storytelling, and a world that feels both surreal and painfully human.\r\n\r\nWhat struck me first was how effortlessly the game blends its narrative with gameplay. Every encounter feels intentional, every choice feels heavy, and every moment pushes you further into a story filled with tension, melancholy, hope, and dread all at once. It’s rare for a turn-based title to deliver such a raw mix of emotions, but Expedition 33 does it with confidence.\r\n\r\nThe music is another standout element. Not simply background noise, it guides the story—elevating quiet moments into something memorable and turning battles into cinematic, pulse-pounding events. The soundtrack aligns so perfectly with the tone of the world that it almost becomes a character of its own.\r\n\r\nCombat is where the game truly goes “out of the box.” It reimagines the turn-based formula with a sense of urgency and rhythm, balancing strategy with real-time input in a way that feels fresh without abandoning the roots of the genre. Each battle is a showcase of creativity, blending visual flair with mechanical depth.\r\n\r\nWith its breathtaking art direction, finely crafted characters, and worldbuilding that lingers in your mind long after you stop playing, Clair Obscur: Expedition 33 feels like one of those rare titles that defines a gaming year. If someone told me this was their personal Game of the Year, I wouldn’t hesitate for a second—I’d probably say the same.\r\n\r\nIf you’ve been waiting for a turn-based game that dares to be different, deeper, and more emotionally resonant than the rest, this is the one that stands above the crowd.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I couldn't recognize how tight this game was, even YOU couldn't recognize how tight this game was, but most importantly Ubisoft couldn't recognize how tight this game was. Suck ass, Ubisoft.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h1] GAME OF THE YEAR for me [/h1]\n\nThis is my first and only JRPG - and it’s[b] ABSOLUTE CINEMA! [/b]I’ve never tried this kind of fighting mechanics before, and it turned out sooo nice. The plot isn’t the best, but it’s definitely something that keeps you intrigued to discover more. There are several spots for improvement throughout the game, but overall it’s a masterpiece.\nAnd a few more words about[b] the music [/b]- it’s the best, it’s just sooo good.\n\nOverall, I’d say that [i]the Wheeee balances the Whoooo[/i] in this game perfectly.\n\nP.S. feedback from my wife, who was playing via our Steam Family",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've played many rpgs, and it's probably my favorite genre. At first i was a bit skeptical about this game, but the moment i started playing it everything changed. \nThis game showed industry giants that you don't need to spend an absurd amount of money or just think about profit to make a good game. \nFrom the music to the story to the art and gameplay, this game does everything good. \nA must play for rpg lovers. 9.8/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "5 seconds into the game is enough to realize the devs created a masterpiece",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is perfection and you deserve to experience it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Straight up the best game ive played in the last 10 years at least, STRONG recommend!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Played it first on another platform. Fell in love. Now we here. ABSOLUTE CINEMA. Amazing story told by OUTSTANDING visuals all accompanied by the most beautiful and well made music that is versatile depending on the world you are surrounded by. Combat is fun even tho its turn base - you are constantly on edge with parries and dodges. Beautiful work that you can tell was made with love for the game and not for the chase for greed. Cant wait to play it many more and more with different builds.",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "As much as I loved it for most of my playtime and was genuinely happy to have found a game that has ultimately bringing a lot of joy to my life, I cannot in good faith recommend it to others based on the twist the story takes later in the game. It genuinely ruined the game for me.\n\nThe story subverts itself in the worst way possible, throwing most everything that happens for the first 70% out the window. Characters, motivations, even the \"central\" message of the game (advertising included) get thrown out the window to suddenly turn the story into a completely new story with new characters. People we have come to love due to excellent writing and great characterisation suddenly turn into lobotomised yes-men who don't seem to care about the \"twist\" the story has taken.\n\nEither of these stories would be great on their own, but the jarring shift in goals and motivations left me genuinely angry. The ending makes this even worse as the seemingly \"good\" ending (at least the developers seem to think so) is the one where you finally flush the half-dead remains of the first part of the story down the toilet and just focus on the latter part.\n\nHaving played the game the line \"For those who come after\" which is heard often for the first part and seen in marketing is almost false advertising in what the story wants to convey.",
      "voted_up": false,
      "votes_helpful": 58
    },
    {
      "review": "This is more of a [b][u]Neutral[/u][/b] recommendation since steam does not have these. And I do not want to give a thumbs up for the following reasons.\r\n\r\nThe game is OVER hyped. \r\n\r\nI don't know if it's because of \"indie company\" creating an AAA game, which is true, or I am missing something in this whole game.\r\nI finishing the game on the recommended difficulty and completing most of the side content but I’m feeling conflicted.\r\n\r\nTo give credits where its due, yes, the visuals and the music is top notch as everyone is yelling. The environments are beautiful, and the soundtrack melancholic, I could describe it like a NieR game.\r\nAnother highlight is the passive system of pictos, but I will talk about it later.\r\n\r\nAnd thats it. Thats the good parts of the game. \r\n\r\nThe story is mediocre.\r\nUp untill Act 3 it doesn't explain ANYTHING and you constantly have more questions than answers and apparently even the characters do not care.\r\nLike, after Verso joins the expedition instead of bombaring him with questions about everything they wanna know and basically get his knowledge, they ask him some basic stuff and thats it we are friends now...\r\nUnfortunatelly the game did not manage me to care about a single character. I think the writing was all over the place. It started REALLY strong in the prologue, where you are in Lumiere and just witnessing the Gomage, and then you have to go to the expedition. It was really depressing and messed up and you basically go there to make things easier \"for those who come after\". you are not supposed to survive.\r\nbut all of a sudden it got silly. there was a part with a funny huge guy which was a plot device for exploration and all the seriousness of the prologue was gone. the immersion was gone.\r\n\r\nThe characters were uninsparing,\r\nAs I said they did not care, they had like a main goal but thats it, no personality, no nothing.\r\nThey didn't even had the mainstream archetypes, like a hothead brute or at least a girl boss, everyone was as bland as the other.\r\nFor some reason the game had a social bond mechanic.. ????. which again didn't make sence in this game. they tried to copy it from the ATLUS games but failed miserably. It feels unnecessary: you can level every bond without limits or choices, and the rewards ? a little stronger attack in the combat.\r\n\r\nThe combat was meh.\r\nIt's really cool to have each member of the party having a completely different set of moves and abilites and not the typical: this character has fire dmg, this is the healer, this is the melee, so very nice combat choices, BUT the actual combat was stale. \r\nYou could not change characters mid fight and you did not have to exploit the enemies weaknesses because you don't earn anything like an extra turn.\r\nThere is a parry and a dodge mechanic, pretty unique to this type of games, a welcome one but it got tiresome pretty fast. \r\nBecause of these mechanics, there is not a block stance where you boost your defence in your round to survive a strong attack and instead you have to rely on your timing and reflexes. If you miss the timing of a strong attack you are instantly dead btw.\r\nYou basically have to stay alive with parries and keep damaging the enemy untill its dead. Minimal strategy.\r\nThe passives i mentioned earlier were actually a huge W mechanic. Bassically you can have as many passives as you can afford. Very cool.\r\n\r\nThe exploration it was ok\r\nPretty straight forward and linear. Most of the times the things you find are underwelming but at least there was a \"reward\" for exploring outside of the main path. \r\nAnother thing that done poorly was : you did not know if an enemy was strong or weak before fighting it. There was a \"danger\" promt outside of some places but not in the enemies. So you can not tell if you can beat an enemy before fighting it. And by that i mean if the enemy was strong you would die one hit, no second chance.\r\n\r\nLastly the voice acting.\r\nThe voice acting itself is solid. The actors put genuine emotion into their lines, but the dialogue and writing was limiting the impact of their performances. They do the best they can with what they are given.\r\n\r\nDo not get me wrong this is a good game, but it didn’t live up to the overwhelming praise it has received from many players. \r\nIn a more competitive year I believe it could not win GOTY.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "I honestly feel like I am crazy for not enjoying this supposedly \"game of the decade\". I want to love this game, and I was sure I would, yet somehow this game managed to bore and disappoint me. I love story driven game. I love turn based RPG. I love parrying. But this game made me realize that just because the two things are good, doesn't make it a good idea to smush them together. It reminds me of that one Family Guy meme with Noah saying \"What the hell is this?\" to a child product of an elephant and a penguin.\n\nThe long wind up of some of the attacks to bait your parry/dodge drove me crazy. It's almost impossible to tell what's the correct timing for them, unless you memorize each of these attacks. The lack of camera angle freedom means that some attacks does not telegraph well which \"phase\" it's in at all. Also your character is locked to one place, so that stripped away any decision making ability you can have in a normal dodge/parry fighting game and turned the whole system into a glorified QTE. Even if you decide to ignore the mechanic and just focus on the turn based strategy part, you still have to sit through this slow ass animation every turn. It's excruciating.\n\nSpeaking of strategy, there is no strategy. I quickly realized this when I ran into a miniboss way over my level that can one shot my characters, but was able to win on the second or third try anyway thanks to well timed parries/dodges. What's the point of building for anything else if your characters are able to be impervious to all damage? Just optimize for big damage and git gud at dodging. Somehow they made the QTE the most powerful ability you can have in a turn based game. I am not against dodging but I'd rather take a 5% chance dodge/counter armor over this mechanic.\n\nThat being said, the world is beautifully crafted. The story is intriguing - the prologue was a super strong opening. It even managed to make me re-examine and look back at my relationships with some of the people around me and that's really something. The music was haunting. But all that couldn't save this game from boring gameplay. Maybe I will revisit the game at a future time, but right now it's a pass from me.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "[h1]\"For those that come after\"[/h1] \nI've never seen a game undermine it's main theme so heavily by claiming to be looking forward to a brighter future whilst the story and it's characters are obsessively stagnating in the past. \n\nThere is also no character development at all really, each character is the same as they were when they started. They never really look at their grief or loss any different than when it all started. At best they exchange witty banter every once in awhile and might share \"dark secrets\" of their past. \n\nThat is not even mentioning the pace of the game, most of the story takes places at the beginning and end of each Act. So there are large gaps where they are hoping vague information will be enough to carry you forward through the story. With the 3rd Act giving you almost too much information to the point it makes it hard even want to progress to the end because the motivations moving the plot forward come off childish and makes the story feel like unnecessary padding.\n\n[h1]Combat[/h1]\n\nI get why people like the combat but feels at odds with itself as well. There is a awesome and tight strategy system here but the bosses never really ask you to deviate and it can be easily undermined by the action combat that comes during the opponents turn by parrying well. These action elements feel too strong and aren't situational enough to be that interesting. Sure, the timing changes but the mobs in the area also clue you in on the sort of timings and moves you will be dealing with so by the time you're at the boss you're not really learning all that much. I just wish there was more incentive to change my play and that the opponent's turn didn't take focus over the strategic elements of the player turn as it feels like what you do during the opponent's turn matter so much more.\n\n[h1]The Positives[/h1]\n\n[h2]Music[/h2]\n\n The soundtrack for this game is amazing. Ranging from electronic drum beats to grand operatic orchestrations. I would definitely recommend giving the soundtrack a listen. I would be shocked if there is not at least one track you enjoy.\n \n[h2]Visuals[/h2]\n\nThe visuals in this game are nothing short of stunning. The atmosphere is pitch perfect, the enemy designs are visual unique from anything I've seen and honestly genuinely lack comparison as they truly feel original short of a few areas like a water themed area where the enemies have anchors or underwater mines but that is about. The environments are filled with cool little visual elements even with it being small instanced environments. I would not fault you taking a screenshot from this game and slapping it as your background.\n\n[h1]Verdict[/h1]\n\nThe experience did not feel cohesive and there are some really cool ideas there to be sure so I can understand how some people can enjoy this game but I can't personally recommend it as the sum of it's part did not work for me personally. However, if you feel you can overlook it's flaws and embrace the canvas then I would say go for it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I would say that this should have been a movie, but that would have just made the story issues more obvious. The first several hours of “gameplay” are mostly taken up by cutscenes. The first combat encounter is a cutscene. Over and over, things that could have been barks or environmental storytelling, are cutscenes.\n\nThe realtime parry/dodge element ranges between tolerable to insufferable depending on the enemy. It often intentionally mimics soulslikes, where there’s a long wind-up animation for an attack with multiple fake-out movements. If you’ve seen the “how fromsoft makes boss attacks” meme, at least a third of the enemies move like that, and since it’s otherwise turn-based there’s nothing for you to actually do while waiting on it. It wastes a lot of time and adds nothing but mild boredom. The majority of the real-world runtime of a lot of fights is waiting on these animations, and the further into the game you get the more time is wasted on these animations. Thus, the combat gets worse and more boring with every new enemy type.\n\nIf you’ve ever played a rhythm game like DDR or beat saber up to the highest difficulty for a song, and then tried to play the same song at the lowest difficulty, that’s essentially what the parry mechanic feels like.\n\nThe central conceit of the plot relies on concealing pivotal information and pretending that that is a moral quandary. If the painted people are sentient then they should be kept alive, and if they are not then the canvas must be destroyed. There is no grayness or ambiguity, but the game very much wants to pretend there is by refusing to disclose whether they are sentient or not and giving conflicting information.",
      "voted_up": false,
      "votes_helpful": 108
    },
    {
      "review": "Was not a fan of its battle system. Game heavily relies on parrying and it gets monotonous.",
      "voted_up": false,
      "votes_helpful": 102
    },
    {
      "review": "Most overrated game in a while. Story has a good setup, but becomes awful the longer you play, most characters literally becoming meaningless, the dialogues are absolutely boring and the game pulls some of the worst cliches in fiction. The gameplay is fun at first, but gets worse the longer you play as well, it becomes a rhythm game devoid of any real strategy.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "everything is bad except for visuals.\ngameplay is awful.\nno character development. you could remove half of the characters, and it just don't change anything.\nplot is interesting, but game explain you what happening only after 30-40h",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Another UE game where the resolution settings are dysfunctional and keep resetting, requiring 3rd party hacks to fix. How is this not fixed yet? It's been reported since release. It's such a basic thing, holy... Fix it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Dear Devs,\nI am high-functionally autistic, so I prefer turn-based games over real-time action because my reactions are kinda … slow.\nI can manage to survive many real-time action games in „story“/„easy“ mode, so we are not talking about pathological impairments here.\nI WILL keep the game, and I so much WANT to love it for its deep story and beautiful art design, but there is one complaint I need to state here as an official bug report or feature request - WHEN I SET EASIEST STORY MODE, I WANT A FAIR EASY STORY MODE!!!\nLOWER THE DODGE/PARRYING TIMINGS ASAP! \nIF PLAYERS WANT CHALLENGING TIMINGS, THEY DON‘T CHOOSE STORY MODE!\n\nI am very much willing to totally twist around my review to thumbs up and praise if you are so kind to reach out to me and/or somehow reconsider your choice in quicktime timings and hardness to be more inclusive for those who are not just „too lazy to get good“, but at a weaker point at all. Why must games be so hard in general without including additional customers (more than you might think?) to also be served with a great game?\nI am willing to practice and learn, but within my personal comfort zone and capabilities.\nIf there is a story mode, make it a fair story mode, not a 1% less super-hard-mode, in my very personal opinion, this is almost false advertising at its finest.\nPLEASY, MAKE IT SUPER HARD FOR THOSE WHO CHOOSE HARD MODE, \nYou can design achievements only for those playing harder modes, I am with you, or give more or less XP in-game for harder play styles, but please don‘t exclude players that are just more casual or even have some limits. Your game is pretty, packed with story and emotion, why exclude such a wide range of players from enjoying it?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Didn't live up to the hype for me. They do an amazing job of capturing emotions and the score is fantastic throughout. \nBut the the combat gets boring quick. Parry and dodge are forgiving enough and just way too strong. For me at least. I'm glad so many people enjoy the game but it's just a great movie with DDR moments in between for me",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "The Paper Mario-like turnbased combat drew me in, as well as the interesting plot set up at the beginning. \nBut the battles became repetitive, there's too little story for how much travel and repetitive battling there is. \n\nIt's a beautiful game with neat characters, but i just got really bored.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game starts off really strong with act 1, and act 2 is pretty good as well, but the epilogue and act 3 utterly ruined the game for me because of where they went with the story.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "Good story, lackluster gameplay.\nI have to say the game has a unique narrative and a great and playful art style. This is the part that made people fall in love with it.\nOn the other hand, you have gameplay that is mediocre at best. It is generic jrpg combat. It is the exact same system as any other rpg. The difference is a bunch of qtes slapped on it. It looks stylish, but the gameplay is very boring.\nJust like exploration offering nothing except walking around, left-clicking on items and starting fights with jarring invisible walls everywhere.\n\nUltimately, I think this game is overhyped and I don't quite understand the praise for its gameplay, there is really nothing in particular to see here. And it certainly is not enough to carry through the entire game.\nThe soundtrack is full of bangers tho",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "[h1] Not the generational game it was made out to be [/h1]\n\nExpedition 33 is a great game and it deserves game of the year. However, this isnt the revolutionary experience that previous game of the years have provided me with. It’s clear that those calling it groundbreaking have never played any other JRPG in their life.\n\n[h3]Parrying doesn't make turn-based combat better[/h3]\n\nWhile the parry mechanic is initially engaging, the enemies' extremely limited move sets, make them very predictable after a few turns. It doesn’t hold the long-term appeal of turn-based games that emphasize optimizing each action and exploiting weaknesses. In Expedition 33, I never had to think about my turns, sticking to the same handful of moves for the entire game: Verso slowly builds up Perfection, Lune spams lightning dance, Maelle spams op moves. \n\n[h3]The levels are poorly designed[/h3] \n\nVery linear with a few branching paths that lead to trivial rewards. I'm just exploring these visual spectacles on auto pilot. It reminded me of the terrible level design in God of War. The overworld also needs to let players track what they've done.\n\n[h3]The party is so uninteresting.[/h3]\n\nWe get some funny interactions here and there but their individual relationships are so shallow and under developed. Characters like Monoco and Sciel are so forgettable and won't leave a lasting impression like other great JRPG party members.\n\n[h3]Conclusion[/h3]\n\nI'd like to reiterate that this is a well-crafted game with solid music and story. I just wanted to point out and criticize a few of the overhyped aspects. That said, it’s far from unique, and I couldn’t help but think, 'Really? This is the game of the year everyone’s been hyping so much?'",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "I honestly struggled to chose a positive or negative review because I don't like this game at all but i can see the devs put a lot of effort in it and appreciate the way it was done.\n\nIt just didn't click for me at all the theme the gameplay and the story just felt way over the top on all sides nothing really that wasn't done before and just felt like it gathered a lot of other game systems and tried to bunch it all up.\n\nI'm playing through and have gotten all the way to the final battle where I've pushed myself to play this honestly because I bought it when i saw the nominations for the GOTY and how many great reviews it got but just can't get around everything to like it.\n\nPlease though if you do like the theme (check out some youtube vids first) and don't mind the creepy facical animations (seriously look at how the eyes move) then support the devs becuase it feels like they did put a lot of effort in this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Having gamed on a PC for most of my life, I find this game a bit bland for my taste. I can see how people that used to play FFX etc on PS2 see it as a polished version of what they used to play as kids, but I just can't seem to get immersed in it.\n\nI've tried so much to like it, but I get bored and cannot come to terms with the limited gameplay, even though there's so much customization with different weapons, skills and attribute combinations.\n\nThe game world lacks soul, even though everybody says that there's a very engaging main story with plot twists, which I cannot find the courage to follow because of the boring gameplay.\n\nI used to love old JRPGS on SNES and PSX, but there was the perceived freedom that you were in an open world. This game just throws you in a PS2-like linear minimap that you have to navigate and inevitably come across a minimap boss that looks like it's come from the Dark Souls series.\n\nAnyway, I get the nostalgia some people may feel playing this game, but I just can't recommend it to anyone remotely interested in a game world that actually feels alive and your meaningful interaction with it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Still terribly optimized for AMD, even mods that are supposed to fix the game due to the crappy engine don't help much. OptiScaler doesn't really help as well. \n\nIt's a shame because the story, combat and characters so far are just simply amazing and I can't wait to, eventually, finish this game. But playing the game for roughly 15 minutes before it inevitably crashes every single time is hardly an enjoyable experience. \n\nPlease, Sandfall, it's high time you guys properly optimize this game for AMD setups.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Damn, I really wanted to like this game. The storytelling in the first two hours was fantastic, but then the gameplay took over. It’s basically just quick-time events, except you never know when to press the buttons. You’re forced to learn through trial and error. The enemy animations are hard to read, and their attacks feel completely random. On top of that, the world feels empty. Sometimes it looks inviting, but your curiosity is never rewarded. I really don't get the hype.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really liked a lot of parts of this game. However, the parts I disliked (the story) have such glaring issues, it's hard for me to like the rest of the game. I loved the music, the art direction, the characters, the dialogue is good but the story is so unsatisfying and left such a sour taste in my mouth it's impossible for me to say I liked the game when all is said and done. Maybe everyone should play it to decide for themselves but to say this story is masterpiece is ridiculous. There are so many plot holes idk how anyone could glaze it to this degree, at least be honest. The combat is unique but shallow and repetitive. I was so disinterested by the time I got to endgame I was just ready to move on.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game tricks you into thinking it’s great, when in reality it’s mediocre at best.\nIt feels like it was made with free assets, and the facial animations are honestly terrible.\nThe music is fine, but it’s basically the same tune remixed ten different ways, so it gets old fast.\nThe parry/dodge mechanics are new for a JRPG-style combat system, but they end up feeling pointless. Sure, the timings are made to screw you over at first, but after a dozen fights you’ll barely take any damage, so what’s the point?\nI really don’t get why so many people praise it. It’s not bad, but it’s nowhere near a masterpiece.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I would not pay for this game.\n\nMain story = 2/5\nSide stories = 2/5\nGameplay = 3/5\nVoice acting = 4/5\nDialog = 2/5\nCombat = 1/5\nGraphics = 5/5\n\nSpecial note: I'm glad so many people like this game but I can't help but wonder if it's the core gameplay that they love or just the aesthetic. This game feels like it was made by a creative mind that simply refused to compromise their creativity for any other improvements that make this a entertaining video game. The main story is linear. The side stories are inconsequential. The enemies are somewhat-mindless constructs existing at the behest of some greater mysterious evil. The only driving force for continued play is the desire to unearth the ever-growing stack of mysteries dumped at your feet. The story itself has some gaping nonsensical loop holes while the combat breaks down into whether you're good at quick-time events, which in turn makes any strategic choices involving your party & their respective upgrades completely pointless. Maybe the ending made it all somehow worth it but as you can guess, I never bothered getting that far due to boredom.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dodge/parry QTE combat mechanic in a melancholic story wrapper.\nInteresting art-style but disliking the core mechanics and tone it was not compelling enough for me to continue playing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One-button game. \n\nHave completed Act 1. The story is good, or have one curious, the characters are great, the music is good, and the graphics are nice (the faces are amazing). The atmosphere and environment is like a children adventure fantasy movie from 80's 90's like Labyrinth, Dark Crystal, Mio in the Land of Faraway, Neverending Story - with a high dose of Studio Gibli inspiration. \n\nI'm on the fence and would vote neutral if possible, but since it has \"overwhelmingly positive\" here on steam and won goty, I don't feel bad voting no. After all, if a friend asked me if it was worth playing I would say \"nah, not really\". \n\nSo what's bad?\nThe actual gameplay, what makes a game a game. It's basically a One-Button-Game. \nIt LOOKS on the surface that there's a lot of tactics and variations involving the gameplay, but those really don't matter much. You attack using the tactic part, then you click the one-button at the right time, trial and error to when that time is, most attacks are not intuitive to when the right time is (which I believe is on purpose since it's 95% of gameplay and 100% of win relevance).  \nIf you are great at clicking the button no other tactics matter because you are immortal. \nIf you suck at clicking the button no other tactics matter because you will die. (you can cheat and put it on easiest, that makes you basically immortal, but it's still a one button game.) \nThere is Some range that fits your one button click skill and the enemies power to a degree that using the right tactic actually matter that, that if you failed to do enough damage to your tactics you'd die because of what you lack in clicking-one-button skill, and win with right tactics. But those are quite few - and counting all enemies and bosses, it's basically just a one button game. \n\nThe gameplay aspect feels like a chore to progress the story.  It's not kicking up adrenaline, and you don't even get the \"oh yeah fuck you\" when you finally beat a difficult enemy encounter, it's more like getting out of an overcrowded subway train - you don't jump and shout \"hell yeay I did it!\" you grimly think \"eww, thank god that's over\". \n\nI'll hopefully finish this game, to enjoy the full story, but I won't enjoy the game part of the game. So no, I can not recommend this game.\n\nedit: finished it now, on immortal/story mode, and my view still stands. If the question was \"Do you recommend the story?\", or even as a piece of art, the answer would be yes. But the gameplay is too lacking and unenjoyable to recommend it as a game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sadly, not for me.  This is a ...beautiful...game, and I am really interested in the story.  However, it is now clear after some play time that this was a game designed for a console controller.  As an old fuddy-duddy chained to my mouse and keyboard I thought I would make a valiant attempt.  But, I am still trying to hit the space bar and the Q button in time with my attacker's moves and failing badly.  It says \"turn based\" but really they are just strategic combat pauses  so you can choose your next action.  Me and my arthritis just don't do button mashing like that.  I'm sure you CAN play on mouse/keyboard, but do not recommend.  Disappointed, but still a lovely, lovely game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There is a bug that causes your inputs to sometimes not register on the PC version. It has been documented for over six months but is still confirmed to persist. This is the kind of game where a single dropped input will lead you to a Game Over in later stages of the game. Save yourself the headache.\r\n\r\nIncredible game. Great story. Too broken to recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really want to like this game and I do, BUT the performance is so bad. We the consumer should not need to mod the game to make it play better.\nWhen I finish the game or an update fixes the performance issues then I'll update my review.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Quicktime events for battle absolutely ruined any momentum this game had. I was invested in the story until I started normal battle, where everything is determined by these split-second learned attacks, and the margin of error is so stupid. My hero is obviously out of range of the attack's box, but the timing is wrong so I get hit anyway. \r\n\r\nWatching tiny pixels on the screen and waiting for them to slow down so you can be successful in battle is utterly infuriating. I was expecting a turn based RPG with Realtime elements, but this is a turn-based RPG with very annoying, repetitive Quicktime events. \r\n\r\nThe game is beautiful, and the first 2 hours you are not shown how annoying battle can be. It's almost exactly the persona 5 battle system, down to the posing, and exaggerated form of the combat menu. \r\n\r\nLots of screenshake that can't be reduced only turned off. \r\n\r\nDodging doesn't get easier. Some moves have multiple attacks you need to dodge. Fail too many of them and the battle is over. \r\n\r\nI failed too many times, even after grinding, and I'm returning it. I'm going against the grain on this one. It's beautiful, but with just being persona battle and adding quicktime events, I think it's another cinematic game on rails that's a little full of itself.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Phenomenal soundtrack, stunning visuals and cinematics, brilliant actor performance. The overall length of cinematics would make for a decent movie or two. Why they needed to strap that to the game is a mystery to me.\nIt captures you from the start with how it looks and sounds, and the setup of the story makes you want to learn more. Then you get the flashy combat, and you're feeling like it all comes along extremely well, and the general feeling is awesome. Until you reach mid-game. By that time you realize you haven't really learned anything substantial about what's going in in the story (and the game intents to keel you in the dark till the last hours), the exploration is boring and empty (you either find audiologs or music you can play at the camp), except for new equipment pieces, which at a certain point of the game become redundant because you've already come up with the most optimal builds for your character, and there is no point in changing anything. Lack of fast travel feels like a way to make the player spend more time in the game traversing, and lack of the minimap feels like the developers not wishing to underline the game's simplistic level design. I only kept playing for the story, which, to be honest, wasn't anything mind-blowing. I did enjoy it, and I feel like it did well in covering the themes it aimed for, but it has many flaws, which I won't discuss to keep the review spoiler-friendly. Most bosses feel poorly designed in terms of the readability of their attacks. You'll often find too many things on the screen, or the enemy flying back and forth frantically, or all at once. While this game is certainly an impressive project for such a small team, and it sets a healthy precedent, it lacks in many ways; however, I believe it can serve as an excellent foundation for something greater to be built upon. To conclude: rather spectacular experience, but hardly the game of the year.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "100/10 game, the minigames are ass and whoever made them should feel bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I originally played this game on PS5 and completed it. If you have an NVIDIA card, this game is a solid thumbs-up and you should buy it. The story is phenominal and I'm so glad my first impression was on Playstation instead of what I experienced on PC. \n\nMy review is strictly from the POV of someone with an AMD card, specifically a RX 9070 XT.\n\nThis game does not have native support for any AMD up-scaling tech. You're left to choose some Intel's up-scaler or UE5's native up-scaler and both are horrible. Inconsistent picture quality and horrible screen tearing, even with a frame cap and V-Sync enabled. The only decent workaround is by using 3rd party software to modify the game files to trick the game into thinking you have an nvidia card and even that didn't yield good results. \n\nIt's a shame the game isn't supported with AMD's tech. I would've loved to play through again and 100% on pc but I'm just not going to keep playing around with the game files to hope it works. I refunded it for now. If they add support for FSR in the future I will re-buy, but for now my recommendation for AMD GPU users is to be aware you will likely have issues. If you can tolerate all the tech issues, the game is an absolute gem.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is really interesting and the graphics are beautiful but the controls and fight actions are so god awful I wanted to throw something at the screen half the time I was playing. 80% of the time, the jump button doesn't work when doing an obstacle and the dodge and parry windows are so ridiculously small it's just infuriating. If you like spending hours trying to get super-miniscule timing down, I guess this is your game. If that's not your idea of a good time with a video game, take a pass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "while its a poilished game, unless you really enjoy turn based combat, this is a snooze fest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great story, amazing design, frustrating gameplay. In the easiest difficulty (story mode), some enemies still kill with one hit, have a large amount of hp and execute multiple attacks with multiple hits each turn. The parry system is very intransparent. If you fail, you get no hints to indicate whether you acted too early, too late, or with the wrong counter type (dodge/parry/jump). The game teaches you that enemies execute jump attacks, and that to evade you need to jump at the right time. Then the next boss uses a jump attack that needs to be parried instead of jumping. Level design frequently gives you multiple options on where to go, but zero indication which path will lead to interesting side quests, which ones are optional, and which ones advance the story.\r\n\r\nThe game is great if you're looking for challenging gameplay and a great story, not so great if you just want to relax and experience the story without fighting the same enemies multiple times to learn their attacks, timings and how to counter them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is as great as they say. But I bought it for my steam deck and it crashes nearly every time I load it.\nAfter a reset, it works but it's still annoying enough for me to give it a thumbs down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mechanics remind me of a souls game, which was torture to learn, yes it felt satisfying to win a battle but the grind to get there is just a pain in the as$ and I just can't be bothered. And the thought of restarting a game like Elden Ring is just too much. I've played 4000 hours of warhammer, so its not the complex games that do me in, just mechanics that rely on tiny degrees of accuracy. \n\nGuess its just not for me and I restarted six months later thinking I'd give it another go and I got to the troubadour and thought I just can't be bothered.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant recommend cus i can't play it.\nit simply won't run on steamdeck even on lowest settings and resolution where you cant even see the game but touching 30 is a challenge.\nand even with a 9060 XT you have to use upscaling to hit close to 40-60.\nbut then the game looks like shit and the hair makes me literally sick.\nby the time i found out it just won't run i could not refund no more \nnow i feel robbed",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Technically this game plays on Steam Deck and while I love the game itself, it is not correct to say that it works with the game’s default graphics configuration. It chugs along while characters and scenery pop in and out of the game. Gustav’s hair changes back and forth from brown to white by the minute and/or scene. If I hadn’t spent so much time trying to get it to actually perform well on my Steam Deck I would have asked for a refund. I would definitely recommend this game on a console or an actual PC, but not on the Steam Deck where it is listed as playable, but barely is and is not a pleasant experience at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is... a choice that the developers make in the ending of Act 1. And it sits so poorly with me that, unfortunately...\n\nI will not be playing the rest of the game.\n\nWhich is incredibly, incredibly sad. Like, I'm actually seriously depressed, but I've lost all interest in the game and I don't think I'll ever return to finish it. I even looked up what comes after, and [spoiler] even knowing how the rest of the plot plays out, and the various endings, I wouldn't have enjoyed it if I had forced myself to continue. [/spoiler] \n\nThis is really sad. I loved this game for the time that I had with it, but I'm unfortunately done and I genuinely regret getting so invested in it.\n\nIf you decide to play this game and want to avoid this experience, this is the turning point you'll want to avoid: [spoiler] stop playing when you reach the lamps, you can reload and explore elsewhere if you want to play the most before the turning point [/spoiler]. \n\nFuck.\n\n------------------------Original review below ---------------------------\n\nI'm only really 8-ish hours in (I leave my games on overnight) but already....holy shit. The premise of this universe and the metaphors it evokes are incredibly potent, and the combat/skill system seems like it's going to have a crazy amount of potential for a theorycraft-enjoyer like myself.\n\nI now understand why this is a GOTY contender even with Silksong on the board (and I fucking LOVE Silksong).\n\nAlso the soundtrack has some fucking bangers. \"Rain from the Ground\"??? \n\nMastapeece.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game but UE5 Fatal Error, tryed all the fixes still crashes with a AMD GPU",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I forced myself to keep playing because of the hype, and I genuinely wanted to like the game, but no matter how hard I tried, I could only push myself to the beginning of Act 2. The game has one major flaw, and that is how boring it is.\n\nNegative points:\n\n- The gameplay isn’t balanced. Even if you play normally, as long as you know a bit about JRPGs and have some gaming experience, it’s extremely easy to one-shot every mob. But if you increase the difficulty to hard mode, then they start one-shotting you instead. From what I’ve heard, this imbalance gets even worse in the later arcs.\n\n- The parrying and dodging focused system, while fun at the beginning and seemingly very innovative, soon feels like it kills the strategy factor of  turn-based combat and becomes boring rather quickly.\n\n-  The inability to interact much with the environment , the world makes it feel like you’re not actually there, but rather looking at a painting on a wall. Everything in the environment looks like it’s frozen in time. What I mean is that small details like a chair slightly moving in the air could make the immersion much better.\n\n\nPositive points:\n\nThe music and the beginning of the game until you reach the main continent were genuinely very impressive—there’s not much else I can say.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "repetitive ops everywhere\n\"unnatural\" human actions, way too intentional for the story",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is beautifully made, but just not fun for me.\r\nIn many cases it is reflex game where you need to parry or die. Just die a few times and get the attack timing down and then win. Use the \"wooosh\" sound or the camera zoom as a signal for timing. Not that interesting. Walk to the next monster, parry, go to the next monster, parry... \r\nFor me it is just another entry in the \"Final-Fantasy-ish\" games.\r\n\r\nA friend promised me the story is good and now I think I should have just watched a video about the story and be done with it. At this point after 16 hours, the story is just loose ends that make very little sense... It is a lot of playtime for just loose ends. Like a mystery book that makes you read 300 pages and untangle the whole thing in the last 50.\r\n\r\nI might continue at some point, but for now I had enough.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really want to love Exp33. Love the looks, the combat (even tho it's a bit hard) and the story. But actually playing the game turned into a frustrating fight I didn’t sign up for.\n\nI don’t have a standard 16:9 monitor, and this game absolutely hates that. Unable to change Res, Constant UI and scaling issues, problems with window/fullscreen — the list goes on. I spent more time fiddling with settings and trying to fix things than enjoying the game the devs clearly worked hard on.\n\nIt’s genuinely fun when it works i guess, but I just got tired of the technical mess. I want other players with larger or non-standard screens to be aware: you might run into the same headache-inducing problems I did. Hopefully the devs can patch this up, because the game deserves better than to be nearly unplayable for some of us.\n\nTLDR;\nIf you have a standard 16:9 setup - go for it.\nIf not - wait for fixes.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This is one of those moments where I kind of wish Steam had a bit more nuance than just thumbs up or down. The game is pretty good, but it certainly was not the life-altering, mind-shattering experience that I heard about going into it. If you're the kind of person who normally wouldn't bother with this game were it not for all the hype, then I don't think you're going to be blown away unless you discover a hidden love of this style of RPG that you just didn't know you had.\r\n\r\nIt has solid (if somewhat unforgiving) turn-based mechanics. And the visuals are nice, but sort of in the way that I expect this level of fantasy RPG to have nice visuals, ya know? It ticked the checkbox but I didn't find anything ground-breaking about them. (I actually found some of the cut scenes had much more choppy animation than I would've thought.) But the narrative was not super gripping to me, especially at the rate it was drip-feeding information. I gave it nearly 7hrs before going to watch a lore video for the fuller narrative. The combat was repetitive and I just couldn't see myself putting 40+ hours into this to learn all the details.\r\n\r\n[spoiler] At its core, the narrative revolves around a mother's loss of one of her children, the insurmountable grief she experiences, and how her fixation and inability to move past that grief impacts the rest of her family and the world around her. It's pretty somber. That being said, this is not even the first new release I've played THIS YEAR that deals with those specific themes. So I wasn't very wowed or shocked by some of the reveals that I think were pretty huge or hard-hitting for other people. [/spoiler] It's a decent story overall, but I think this stands out a lot more for people who are not used to consuming media with themes of loss, grief, or complex family dynamics. \r\n\r\nIf you're the kind of person who generally likes turn-based RPGs and can appreciate having to master some pretty precise timing when it comes to dodges and counters in combat, you'll probably have a good time with this and the story may feel like a nice bonus to an otherwise well-constructed game. But if that level of precision isn't your thing or repetitive combat is grating for you, this probably won't be as fun and your own prior media experiences will determine whether the story makes the game worth it to you or not. Knowing what I know now, I've found that I can't honestly recommend this to most of my friends, but I also don't want to condemn it for just not living up to expectations.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "the game needs external mods just to fix graphics on the steam deck default ones are a joke",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really wanted to like this game. I played and enjoyed many JRPG, I was excited at the prospect of turn-based combat, which is getting rarer in games. This games advertise itself as a turn-based JRPG, but it's not. Combat is basically QTE and rythm. The parry and dodge system made every other combat mechanics useless. I tried playing in \"story\" mode difficulty, but it makes combat trivial and boring too. I finished act 1, but right now I don't know if I'll get the motivation to finish the story.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just didn't really like what I played. Also some of the animations look a little janky. Probably will try again some time later but the game didn't really hook me, I couldn't really care about what was happening.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Without giving any spoilers, the end of Act 1 is lazy writing and is just relying on a generic trope as motivation for a character. It's lazy writing since the whole point they're on the expedition in the first place is to stop the Paintress disappearing the people. It's nothing but copium to say the ending for that act was needed when there was already a reason for motivation in the game where it could've been handled differently. AT the very least, that should be more of an Act 3/late game type beat. Square Enix handled that a lot better with one of their games. It's not surprising that only 56% of players on Steam have the achievement for getting through the area right after the end of Act 1.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fine story and boring gameplay, just watch cutscenes from somewhere instead of playing",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nope not for me, Great Enemies, Bad Combat style,  Awesome Art, Voices. Just Didn't Grab Me",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I dont like this game. It's the timing and parry system, I'm just crap at it and I cant progress. I've even tried the accessibility settings, I'm still getting killed fight after fight. Everyone tells me its a masterpeice, and to be fair it might be but I cant get into it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game itlsef is decent, i can't do any reasonably long gaming session though as it has this awfuk smearing issue that's giving me headaches. Why do UE5 games have this issue that devs seem incapable of fixing? barely make it 5 minutes til my eyes get strained trying to find focus when there's non to be had.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Ultimately \"vanilla\" is the keyword for me. The characters and voice acting are stellar, yet the gameplay and world/map design really lets it down. It plays it safe and doesn't really innovate or excel anywhere. Would highly recommend throwing it on story difficulty and powering through if you want to see what happens.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The visuals and soundtrack are amazing. The story is great until the 3rd act when the writers do a twist that I think hurts the feel of the game. I absolutely  hate the combat, it relying completely on QTEs  to avoid one hit kills from even the basic mobs really drag the game play down.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I desperately wanted to like this. The story behind its development, the aesthetics, the concept, all great.\n\nBut I find the combat fairly awful. I think I can tolerate action command turn based combat in something like Paper Mario, or Like A Dragon, but in this is felt annoying. \n\nWeird complaint, but if it had less involved gameplay, I'd probably enjoy it more.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Feel like I'm going crazy... This is the game everyone has been glazing so hard? \n\nIt's not terrible or anything, but it plays like any dozens of mediocre JRPGs (I know it's not Japanese, but that's the style of game). Combat is ok, but the dodging/parry quicktime system undermines any really interesting builds/combos. As long as you dodge, nothing else really matters. Didn't everyone hate quicktime events a few years ago? \n\nThe story is interesting, but the gameplay isn't fun enough to keep me around for the next story beat. I doubt I'll finish this game. It's not terrible, but I wouldn't recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "If you aren't into Quick Time Events (QTE), do not apply. The game is basically Final Fantasy but *literally every single attack and defense* is a QTE. Story and voice acting sure are nice though.\n\nSome folks might be into QTE-fests, but personally refunded due to the tedium.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Good:\n+ Music is very good\n+ Graphics are good\n+ Fighting feels good\n+ The first of the three Acts is amazing\n\nNeutral:\n~ Each character has a distinguished skillset and needs to be played very differently from the others. Individual resources, mechanics and synergies need to be learned anew for every character. Annoying at times\n\nBad:\n- Story drops off very hard after the first Act, to the point that I didn't bother to play further than half of Act II. This is also the main reason why this review is negative.\n- Gatekeeping of damage output, which means the maximum damage a character can do per hit is capped at a very low value (apparently it can be unlocked at the end of Act II, which is much too late in my opinion)\n- Annoying platformer minigames",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Painfully slow and confusing story line. They try too hard to get you emotionally invested in the characters with long drawn out scenes with corny lines and overly dramatic cheesy elevator music. Its like watching a bad drama that just wont end.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Great story like the characters. Combat system is bull****. Counter system is frustrating . If you blink your getting hit. Who ever developed it is a ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashing at end of prologue, tried all fixes, checked game file integrity, ran in dx11, still crashes.  Inexcusable and to not have a patch or fix in months is awful.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wasn't able to hit a flow-state with this game. It's like being stuck in LA traffic. Once you push on the gas, you get blocked by a cutscene. Or new skill assignments after pushover fights. Or a new pictos to \"train\". Or some disruptive tutorial several hours in. The awful, cluttered Menu UI doesn't help.\n\nMaelle looks like an animatronic.  It's like everyone forgot how Mass Effect Andromeda went down.\n\nThe dodge/parry system was interesting, but Mario RPG already did something similar and did it better 20+ years ago imo. Some of the enemies do these silly feign swings from limited camera angles to make you flinch, so it's not even a skill thing more than it is reloading battles until you remember the fake-outs. It's like the worst of Elden Ring bosses and ends up feeling like glorified QTE's.\n\nUnreal Engine 5 is also responsible for a negative experience. The upscaling, lighting and filters kill the art. Seriously, fuck the plague that is UE5.\n\nPositives: Interesting story and well-made music.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "-Come out of nowhere \n-Sweep game awards including getting \"game of the year\"\n-\"Update\" the game in a fashion making it literally unplayable with rampant crashes, freezes, crippled performance and have the prologue cutscene alone be so broken that new players cannot progress.\n\nMy playtime shows as 1.7 hours, in that time all I got to do was the 30 second tutorial fight and a mime fight, the bulk of the time was trying to get passed the prologues impressively broken cutscene that even when attempting to skip still manages to sht the bed\n\n\nThe only word that comes to mind for this is genius, true genius, we've all heard the expression polishing a turd, but here we have an example of a company who instead decided to roll a diamond in sh1t",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm really enjoying this game, actually. Good acting, beautiful designs, interesting story, satisfying combat, and more. However, I'm giving it a thumbs down because of the lack of a map. I cannot believe this game, inspired by so many digital role-playing games, doesn't include any sort of map, which has existed in this genre forever. It even fits the theme and story. I'm pretty sure these expeditioners would take notes and make maps as they go through these labyrinths, no?\n\nIf the game were strictly linear, I wouldn’t have minded, but a good portion of it is about exploration, and you never know if you're going the way that will progress the story and trigger a cutscene, or if you're finding a side path with optional enemies and items, or if you're just circling around aimlessly. The exploration right now is honestly so excruciating, and it feels even worse because I genuinely want to find everything, but without a map I'm having so much difficulty. Sometimes I just prefer to move forward because I have no idea if I've missed anything or not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Maybe i'm too old, but this QTE focused gameplay is just awfull.  Story was interresting though.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game of the year? LMAO Becomes boring & tedious after the first few hours. Level design is poor and the world is bland & not immersive at all. Maybe get it when its heavily discounted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Visuals and story cool, but gameplay is so boring and repetitive...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've heard nothing but amazing things about this game, however it crashes on launch or on new game whenever I try to play, which after some research seems that many others have experienced these issues too, so unfortunately my only experience has been bugs that prevent you from even playing the game being my only experience after hours of debugging, which specifically has consisted of;\n1. Game crashing on launch with an error that closes immediately, which once fixed led to\n2. Game freezing on new game, which after fixing led to\n3. Bright red screen stuck on cutscene, which at this point just tires me to try and fix right now, maybe I will come back and try to fix, but I will probably leave my review as this even if it is fixed because this is a terrible fresh player experience\nUpdate: Now the red screen is flashing... very dissapointing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Breathtakingly beautiful and engaging turn based bar-raiser ruined by quicktime gimmick and effortless rug-pull boss.\n\nThat garbge took this game from five stars to two. NEVER punish the player for playing the game how you taught them they were supposed to play it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I wish steam had a neutral option. Yes the graphics, music and voice acting is amazing. But I cannot recommend it. The combat twist is nice, but for me once I figured a combo that worked 99% I never felt the need to change anything all up to act 3 where the game while narrative is urgent, it's clear you are meant to spend the next several hours grinding characters, as the enemies now have multiple combo attacks that instantly one shot your characters. \n\nThen there is the story. Like others who posted negative reviews, I did not buy the story, Act 1 was a great opening and immersive. Then you go out and meant weird creatures and no one questions why, you aren't told why you fight everything. The characters while having some great moments just don't feel real. Events or new party members join and there is no basic questioning of \"Hey how the are you alive?\" it's like cool we are mates now have a 33 armband. Then the finale. What a insane rug pull. I feel we often seem to give credence to 'mature' story/themes in games. If this was a movie people would have been pissed off. One of the characters is researcher, something happens that any sane person would probably have a mental breakdown over. But everyone just accepts it. The player is presented new characters in Act 3 which you need to suddenly care about or have some emotional bond but as a player you just feel like you wasted your time as the narrative takes massive shift. This along with the insane difficulty spike in Act 3 just broke the game for me, I turned it down from Normal to Story just so I can finish the game. \n\nLast thing I didn't see any anyone mention. The enviroments are about 50% too large. You'll spend a majority of your time running. The exploration is extremely linear and you will always know what awards you might get. There are also optional bosses that are insanely hard that you won't know are insanely hard. One some locations show danger sign. \n\nWhile I think its overrated, I do want to see what Sandfall does in the future.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game single-handedly ruined JRPGs for me. There will never be another game as visually stunning, story-driven, or with such a satisfying turn-based parrying system as Expedition 33. Every moment feels handcrafted, every fight perfectly tuned. Nothing will come close to filling the void this game has left behind. So for that very reason, I do not recommend anyone play this game. With that being said, I’ll still be nominating this title for game of the year. 10/10.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "mid obscur \n\nwish I could play this game without wanting to throw up with the god awful upscaling and filters, gameplay is whatever too",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Expedition 33 is a good idea marred by a lot of bad choices and execution.\n\nThe graphics are ok but there are a lot of problems with how they used UE5. Textures have that same \"wet, smooth\" look that was common in, say, Bloodborne, but that was 14 years ago and looks a bit bad today. Hair textures get weird fuzziness from the smoothing effects, and this is on higher end PCs. The landscapes are pretty but feel a bit lifeless.\n\nExploration is mostly corridor based, with a few side paths, but those paths are rarely rewarding outside of minor pickups like cash. The late game opens up exploration a lot, but most of the new areas unlocked are single rooms with just one mini-boss enemy or a fixed camera angle with one item to pick up. I found that it really killed my interest in exploring new areas thinking I would move halfway across the overworld map just to find a minor pickup or a boss with nothing I wanted in a single room. It feels like it's wasting your time.\n\nThe characters are mostly good. I really enjoyed them, though the motivation of the male lead vacillates back and forth without clear reason in the very late game and he becomes very exasperationg.\n\nUnfortunately, what kills the game is the story and gameplay.\n\nThe story starts out decent, but it's clearly trying to hide a very obvious \"twist\" in the nature of the world. If you pay any attention... like, at *all*, you will figure it out early. The thrust of the story is clear at first, but changes at the end of Act I to become very much yet another bland and tedious family drama story, much in the same vein as all of the other family dramas masquerading as a different genre, such as all of the Haunting of Hill House spinoffs, Hereditary, the VVitch, Babadook, the Arrival. If you love all of those movies, then this story is probably up your alley. If you tired of family melodrama being the main plot of the story (and no, Star Wars doesn't count, because the family drama was secondary to the main story of overcoming despotism and the hero's journey), then you are going to roll your eyes a lot.\n\nFurther, the story completely falls apart in the 3rd act, with the entire act being a single short dungeon with 3 optional side quests, all of which are very short but 1. The rest of the map is just new places you have access to, but without a lot of motivation or reason to go to them. The bigger problem is that the motivation of the male lead starts one way in Act II, and then switches in Act III. It makes sense at the time, but the endings are both two of the most atrocious ass-pulls in writing. The male lead suddenly throws out all of his character development at the end to demand one choice, while the female lead completely forgets the entire moral of the story that she's learning. Both endings are bafflingly stupid, considering they completely ignore the entire story to that point.\n\nFinally, the gameplay is just terrible. It's a turn based JRPG style, but the dev is apparently a Sekiro speedrunner and decided that we should all be Sekiro speedrunners. The dodge and parry mechanic could be really great, but on normal and hard difficulty (which have the SAME window), the window to dodge is about 5 frames and the parry window is about 2. Nexus lists them at .35s and .22s respectively, but it's definitely not. It's tied to frames, as many dodge/parries are, and it's extremely tight. The dev also clearly took too much \"Margit\" from Elden Ring and decided that nearly every enemy needed a lot of long attack delays and feints and many late game enemies can have up to 6 or 7 attacks on their turn. This isn't Sekiro or Souls where you can watch the enemy freely and then engage, no, you must dodge/parry on your first go or die (so many enemies can one hit kill your character or entire team) and retry the fight. It's the bad version of trial and error game play. It's telling that one of the most popular mods gives a huge dodge/parry window (no, I did not use it, I played the entire game unmodded).\n\nUltimately, the gameplay becomes incredibly tedious, retrying fights, and then if you get the two leads their best weapon, the game is completely broken at that point and no enemy will get a turn again. It's all or nothing and really lacks good combat compression.\n\nIn the end, this game is not a bad game, but it's not anything near the incredibly high praise it has received. In a year with both Silksong and Hades 2, the idea that Expedition 33 could be a game of the year is laughable.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I don’t really understand the extreme hype around this game. At first, I found the setting mystical and intriguing, but the longer I played, the sillier the story became. It feels like a slightly more “mature” Alice in Wonderland, just without the charm.\n\nThere’s a lot I could criticize, but I won’t spend time listing every detail. People are different, of course, but to me this game felt silly, childish, and all over the place. On top of that, it’s surprisingly poorly optimized for an Unreal Engine title – be prepared for loud fans and hot hardware.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The characters were really well designed and done - amazing voice acting too.  Visually it's a really cool game, and the story has me intrigued.  \n\nThat said, every time I play I find myself getting frustrated and loosing interest.  The battles are my chief complaint.  There's no actual strategy, it's just pressing a button to dodge or parry at the right time.  Normal difficulty was frustrating, and easy is just far too easy.  \n\n10 hours in and I'm calling it quits... really wanted to like this game, but just didn't do it for me.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "DONT GET ME WRONG I LOVE THIS GAME AND THIS GAME IS COOL \n\nbut if u cant parry you are doomed, idk man this game is effin hard even in story/easy difficulty especially when you starting advanced to act 2. I probably need a lot of time to practice this game but goddamn i only have 4 hours max of gaming session, if u ask me why? Well simply because i have a job.\n\nI wish modern story games could make story/easy difficulty it how it's supposed to be.\n\nMind you though, some of us are casual gamers.So of course we would like to be able enjoy this game or have fun in this game while playing it and that's why we prefer to play this game on story/easy difficulty (skill issues + i don't have much time to grind and learn.)\n\nLast but not least, im sorry for my bad grammar because english is not my mother tongue but at least i tried Thank you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Insane levels of hype for this game gave me too high expectations, thought I was getting Jesus Christ reincarnated in gaming form, based off other reviews over the past 6 months. Instead I got another turned-based game with that generic UE vibe to it, impossible dogding/parry mechanics.\n\nI'm sure it's good later on, but if I'm getting mad at the combat in the prologue, then it clearly isn't for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not for me.\n\nI see a lot of people loving the story, but at least for the time I’ve been playing, it doesn’t feel special. The biggest issue is that I can’t connect with the characters. Their emotions don’t feel real or consistent with what’s happening. People are dying around them, and two minutes later they’re cracking jokes—it just doesn’t fit. If they don’t give a s***, why should I?\n\nAbout the enviroment and gameplay, it’s disappointing. The maps are really nice, however, the world feels very linear. The game invite you all the time to go around collecting useless items. Each character has their own set of abilities you can invest time optimizing with specific objects, but ultimately none of that really matters. The only truly important skill is learning enemy attack patterns to dodge. Sure, if you optimize everything you might defeat enemies a bit faster, but the difference is minimal.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The act 2 ending \"big\" reveal ruined the story for me, if the writers don't care about the expedition itself why would i",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Combat calls itself turn based but the single most important aspect, in early game at the very least, are the dodge/parry mechanics, which has absolutely nothing to do with turn based combat.\n\nThe visual and narrative design seem amazing and I would have loved to see more of the game but the combat genuinely ruined it for me. I did not have a moment of fun in all of the 7 hours i forced myself to play this. \n\nOf course that puts me right outside of steams refund window, so money down the drain.\nA demo would have been nice, could have spared me the 50 bucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cannot in all honesty recommend this game, unless you love childish drama, pretentiousness dressed up as art, an unlikable starting character, an English localization that just falls flat and a wholly unoptimized game. The hype train has really run off on this one.......\n\nI got past the prologue and could not tolerate to go any further. My impression was that they wanted to have a game that could be considered in the realm of Kojima but from France. Missed the mark by some leagues.\n\nSome details:\n- the characters have all kinds of clipping issues in the in-engine cutscenes\n- the cutscenes are all grainy and pixelated (pre-rendered ones)\n- the characters do not blink enough... I kid you not, they look like freaking monsters because of it.\n- performance drops so low in plain exploration scenes. My rig can run games that have higher specs than this no problem, yet this game tanks when just running around..........\n\nYes, I can say that the style of the game, storyline and characters are all subjective... BUT I do not consider the topic of this being \"a small indie team\" to factor into any of the above. Also, delivering a game that is not optimized is not okay in todays world. Activision or Microsoft would get ripped apart for delivering such a badly optimized game, but here it is okay?!\n\nClear thumbs down from me.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Expedition 33 started off strong but ultimately fell flat for me. The story hooked me in at first, but the level design quickly became repetitive and a slog to get through. Just walk through a big corridor to the next fight, then repeat. Combat is okay, but I wish there was more to it. I was pushing through the repetitiveness to see where the story went, but about midway through Act 2 I was feeling let down. I think this game had a lot of potential but was missing that “je ne sais quoi.”",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun if you like VERY DIFFICULT games. Even on the middle of the road setting there are bosses that take forever to take down and if you have problems with dodge and parry like I do, it becomes very frustrating.\n\nI was going to return it because of the difficulty but I had played more than 2 hours and couldn't\n\nI don't hate the game, but I would not buy it at full price. Wait for a sale",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Personally can't recommend it. The game is basically dark souls but turn based. You HAVE to master countering to win, and once you do, you can win with basic attacks alone. It's more of a reaction test than an rpg.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "There is a reason after my 30 years of living that I stopped playing JRPGs. There is just so much that has to come together, and that it also has to do something new with an excellent story to hold it together, because an RPG like this is competing with thousands of titles that have done \"it\" already.\n\nExpedition 33 does it all. Excellent character, combat system, art direction. It was a very refreshing take on the RPG genre. \nuntil (spoilers below):\n\nAct 3. The whole story just really fell apart for me so much that I just lost the desire to play the game.\ntalk about being railroaded to an almost completely different plot line, I just didn't feel the desire to perfect parry from then on. Just the Act 2 final dungeon was a slog to arrive into what is one of the most disruptive plot twist in gaming history made it hard for me continue on.  I've always hated RPGs for terrible writing, and it still continues to plague a lot of RPGs (looking at you all shin megami titles) This was so good until it suddenly wasn't.\n\nI think the Act II final dungeon being a grind to Act III horrible plot twist just killed it for me. Two things I've dislike about rpgs - bad writing, and grind as I am getting older.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This is more of a neutral recommendation because I think people should play it but I didn’t like it. \n\nI've never been this happy to see the credits. Wow, I'm so sad this game was not for me. It felt like a 39 hour chore. It's visually STUNNING, but i disliked pretty much everything else from the combat, gameplay, characters, music, builds etc. And I HATED that there are no maps or minimaps, omg. The story was so confusing and the whole \"aaaahhh\" moment of realization was disappointing, like really??? that's it?? and i STILL have to google \"expedition 33 story explanation\".  Maybe I'm dumb. Actually, I loved Esquie. \n\nHowever, I know I'm the minority, so I hope it wins game of the year lmao",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[spoiler] 这个游戏剧情的逻辑，为了治妹妹网瘾，把妹妹网友全杀了。 [/spoiler]",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am 50/50 on this game, story is good, game play is good, music is good. The technical aspects and choices of this game are not.\n\nThe music is really good, it sets the mood quite well. The story pulls you in and makes you guess at what it going on. The character animations, albeit a little stuttery, the animators did an amazing job expressing emotion on characters faces and it feels like you are watchin real poeple. The blend of 3rd person and JRPG elements is simply awesome. The game battle mechanics are a pleasure to use, are innovative, and don't reinvent the wheel with JRPGs but add interesting elements. I haven't played a JRPG for a long time, this is well done. \n\nDon't get me wrong this is a good game but it is not great as it is plagued by technical issues, bad optimization and lazy development practices. This could be a great game if it wasn't for the stutters, graphical glitches, and poor technical choices.\n\nI had to find a fix for resolution scaling, the game forces upscaling by default even when you turn off the scaling it still applies it. I had to use a third party fix to run my game at full resolution 5120X2160, I got that fix from here: https://github.com/Lyall/ClairObscurFix . Without it the game would be scaled down to 3820x1440 and no matter what I did I could not set the proper resolution. The use of blur in cutscene backgrounds is a terrible choice. It is distracting and unnatural. \n\nI have to use both DLSS frame gen and Scaling on a 5090 which is absolute nonsense.\nLazy development practices in the industry think it is ok to rely on AI scaling and frame gen, it is not, optimize your games. Despite this being a good game as far as story, music, and gameplay goes I give it a thumbs down due to the terrible optimization of the game. UE5 is not the shortcut solution that developers think it is, EPIC games conned you into thinking otherwise.  \n\nNot all is lost and there is hope. More and more developers are aware of the sh!t show that is UE5 and how to optimize the engine for their game. Hopefully Sandfall take what the industry has learned in the last few months and optimize this.\n\nUntil this is optimized I can not recommend this game outside of top tier systems!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I went into this game extremely excited and hoping to love it. The premise was interesting and immediately hooked me. Unfortunately, the game doesn't deliver on the story it sets up at all. The game is pretty, the gameplay is fun, but the story just falls so flat and left me feeling totally apathetic about this game and it's characters. It pulls a twist that totally spits in the face of the themes the game had you spend dozens of hours experiencing and caring about beforehand just to go \"none of that mattered, here's an ending to a totally different story.\" It's a bummer because I wanted so badly to like it, you can feel the passion in the whole thing, but God the ending just ruins the whole experience for me and makes me never want to replay it. It feels like it disrespected my time by swapping the story out at the last minute. Unfortunately I regret buying this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game-play is just pass or fail QTE masquerading as a turn based rpg.\nAlso can't give a pass to a game that strongly suggests a controller but only supports x-box style prompts, its not hard to add a toggle in the settings to flip them to PS.\n\nWorld seemed interesting, would like to explore it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "im sorry the story is so bad i cant play it anymore its just too fuckin obvious ( the design and combat are dope but cant redeem a bad story  )",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game for tags Action-RPG or Souls-Like which are for strange reason are missing on official store page. The game is not a RPG, and Turn-Based Combat does not exist without real-time mechanics that makes the play-through is annoying for me personally. It would be great to introduce auto-Parry along with an existing auto-QTE.\n\nThe music is great, agree.\n\nAll in all, I was not looking for a challenge in the game - I was looking for a pleasant way to spend some time while doing attributes and skills management, and this really good in many aspects game failed to deliver it to me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Personally not for me, i love turn based games but this game makes me actively want to avoid combat and gets very repetitive the more you play. No real exploration and is the same in every level. Ui is awful especially the more pictos you get and stay away from the mini games they are the worst ever done. I didn't like the narrative, the emotional parts fell flat.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[h1] For Those Who come After [/h1]\n\nAs Somebody who plays way too many JRPGs I can tell they put a lot of love and care into making this game. There is quit a bunch to Love about this game but for me they really dropped the ball on 2 of the biggest things that make a JRPG styled game actually good for me. But first let me touch on...\n\n\n[h2] The Good [/h2]\n \n[h3] The Premise [/h3] \nI think the initial set-up to the plot is a super cool an unique idea. Its really lends it self to something a lot of good stories need, a sense of Mystery and a good reason to even head out on the adventure to begin with. I pretty instantly wanted to head out on the adventure and see what the hell was going on for myself, It's a Great initial hook!\n\n[h3] Music [/h3]\nOverall the music in this game is pretty solid, nothing stood out as particularly bad or ear grating it did a good job of fitting the zones and scenes. It's not the most amazing OST of all time but there are a few bangers especially in a few of the later boss fights just don't go expecting a Yoko Shimomura or REVO level of soundtrack.\n \n[h3]A Game With Post Game Content!?[/h3] \nYa love to see it! Nothing makes me more sad then finishing an RPGs main story and there's not even a few extra dungeons to explore or further challenges to tackle. Luckily this game has a good chunk of post game dungeons a boss fights to indulge in, That's a major win in my book. Along with a lot of pretty silly mini games and unlockable costumes and rewards this part honestly is what I'd like to see more of in general!\n\n[h2] The Mixed [/h2]\n\n[h3] The Overall Visuals [/h3]\nIt's been a while since I played a game that had moments where it flops back and forth between being Beautiful and Hideous so often There will be some zones that have such a wide open stunning look to them followed by a zone that's super cluttered and visually messy. The characters in cutscenes also go from looking pretty good to like unfinished animation work depending on what random scene you're in and mixing it with some of the most noticeably bad Lip Sync i've ever seen ina game like this it can be kind of jarring sometimes.\n\n[h3] The Characters [/h3]\nI really want to love the party of ever RPG I play but sadly here I really only like about half of them. 2 of them are the most nothing burger party members of all time. I really enjoyed the last 2 party members you get the most and a special round lad. I feel like the game was too short for its own good you can probably finish the Main story in about 25 hours I would have liked for it to be a bit longer  so they could give us some time to do fun things with the party  maybe I would have liked them a bit more than I ended up.\n\n[h2] The Bad [/h2]\n\nThis is really what dragged the game down for me ALOT The 2 things if only one of these things let me down maybe it might have saved it for me but the worst part of this game for me had to be...\n\n[h3] The Combat [/h3]\nI LOVE, LOVE Good turn based combat I love equipping my team with unique abilities and passives find the most broken gear setup and coming up with my own fun strategy on how to take on any given boss ahead of me!\nWell none of that matters at all in this game because there is only 1 way to just beat the whole game with 0 thought PARRYING. you can stop all damage in this game from ever happening and then hit every boss and enemy for massive damage. I think if this game kept its action commands for attacks and removed the parries while adding some more defensive options it could have been ok. I like that every character has their own cool combat style and gimmick it's just kind of sad none of it really matters at all. If you're someone who plays any sort of fighting games or rhythm games this might be the easiest game of all time, on any of the Main story bosses on hard mode I died a total of 0 times the only things that killed me early on were super bosses I shouldn't have been fighting till end game, and within a few attempts I beat most of them.\n\nAnd the thing that really just pushed the game over the edge for me was...\n\n[h3] The Story [/h3]\n\nI'm not going to go into too much detail here to avoid spoilers, but as someone who was kind of vibing with the game thru the first few acts. That final act was actually one of the most poorly executed final chapters of a game i've played in so long. It Feels extremely rushed and un-finished they just present you with a new lump of information don't proceed to elaborate or explore the idea then end the game.  It really feels like there should have been another 10-20  hours stapled onto this game in the middle and towards the end to actually finish it, but I guess this is what we're left with.\n\nIf you Like this game I'm happy I hope more people get into JRPGs because of this game and if you liked this game PLEASE check out other games in the genre, this is but a small bite of a much bigger cake.\nIn the end people were right it really is a game that will stick with me forever, Just not in the way I was hoping.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Will change my review when they add FSR support to the game, kinda ruins the game for me when it runs like crap without it or looks like crap without it. You guys have XeSS support but not FSR? Come on now, and do not tell me to upgrade, 9070 XT AND 9950X3D, Nvidia can eat me. \"Why don't you play on lower settings?\", you can eat me too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bland characters and doge based combat made the game feel forgettable.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "seems intriguing but i've ran into multiple technical issues. first of all, the cinematics look like they have block artifacting, the game stutters (probably a ue5 thing), and the epic quality preset makes the game capped at 60fps, even though I've capped it to 120, and I dont have external framerate limiter software or anything. its a shame, because the gameplay and story are fantastic.\n\nEdit: oh, and there seems to be no way to turn off upscaling, i tried the anti aliasing setting for xess, but it still produces artifacts, leading me to believe it is still using some sort of scaling.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Saw some stellar reviews and praise of this game and saw it was an RPG and got baited. Maybe this game is just not for me, so im not saying its a bad product, guess just a preference.\r\nIm in the middle of act 2 and now am uninstalling the game. The whole game feels like a chore, i was forcing myself from pretty much minute 1 to keep playing. \r\nPlaying this game for me is like mandatory funeral attendance of someone I dont even know and dont care about. \r\nSorry to everyone who loves this game, this is just my personal opinion.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly, extremely overrated. \n\nStory is to some extend interesting but combat is dog water and ruins the entire experience.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}