{
  "positive": [
    {
      "review": "Hi! I don't know why Steam allows such a cold-blooded mass murderer on their platform. OBS is guilty of the murder of Bandicam, Fraps and your storage space if you forget it on or decide to record 40 seconds in 1440p. But now i can record my gameplay of that one sexy character in that one video game without any issues, that is if her ass isn't bigger than my monitor but we don't talk about that, anyways it's such a good compromise! Would definitely recommend. If you need to record gameplay, a tutorial or that anime girl dancing on your screen, as well as many others, then this is what you should be using. Yes. Great.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This game is not scary at all, idk what people are talking about, But yes i got scared sometimes",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Actually Goated, Just a little buggy for me due to my older hardware.\r\n- Records & Streams!\r\n- No need to Pay!\r\n- Very easy and good to customize!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Mean its obs but on steam what more can i say love obs and how much you can do with it what more can i say besides that.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Using it to record online meetings for transcription purposes. Not really used for streaming but suitable for my uses.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its clean it gets the job done it gives access to advance features while still being pretty simple if u want to keep it like that performance doesn't take a hit honestly one of those things you don't apperciate them enough until they start being greedy like other companies cause like obs IS the goat i can't name any other relavant recording software besides this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great to capture everything you need and easy to setup. \nIt is not the most new user friendly, but there are plenty of guides on youtube!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect application to record and stream things! yeah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Free recording software. I use it for recording videos and livestreaming and it works great most times. it did crash during some recordings (really rarely tbf) but it plays a sound on crash so I always know when it happens. I 100% recommend to record videos with the \"Matroska Video/ .mkv\" because you will still be able to use the recording even if a crash happens especially since you will probably want to edit your video either way and I think most editing softwares will accept .mkv files just convert them before uploading. I personally use the free davinci resolve app to edit my videos and never had any problems even if I wouldn't consider myself a expert. also there is a streamlabs plugin that is basically a must have for streaming so I would also recommend using it if you plan on streaming.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a super practical program that I use for recording, clipping, and streaming, so far it's the best program i've used so far, so I highly recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really good, but some features are missing on linux, like gamecapture.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm only using this for one thing and one thing only, recording vids. And I can safely say OBS Studio does that job exceptionally well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The mainstream streaming software, you can also use it to edit your webcam and other details.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goodbye Streamlabs, Restream and Bandicam. Hello OBS, get used to it for YouTube and Twitch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The interface is confucing but besides that there is a lot of content and things to do daily, I love the story so far and the character customization 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE recording software when it comes to screen capture, livestreaming, webcam, capture cards, etc. I personally have it auto launch on boot and activate the replay buffer so i can save whatever happened in the last 5 minutes with seperate audio tracks (in case one of the boys says something racist in Discord while an epic clip happens yknow how it is). Basically if you have ANY need for a recording or livestreaming program then there is no reason to use anything other than this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME OF ALL TIME, DESERVES GAME OF THE YEAR (p.s. unpopular opinion, overwatch sucks)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the gameplay is decent, i hope they patch the combat mechanics doon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really easy to use program for screen recording. even a total noob like me figured everything out really quickly with obs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been doing YouTube for around 3 years now, and have amassed over 2,800 subscribers. OBS Studio was the first completely FREE recording and streaming software I used, that wasn't unnecessarily complicated to use. Initially, I started with BandiCam, but there was only a free trial. I've also tried StreamLabs, but I never really got the hang of it and have always preferred OBS. Furthermore, OBS is available on Steam, which is helpful to me since there are no annoying installation steps whenever I use new devices! The only problem I have with OBS is that the framerate varies during recordings, although I use a ROG Zephyrus G15 as my main recording device, the playbacks are still 30-60 FPS, and not stable. Also, while I'm streaming, the quality goes down to 480p, even days after the stream, even though I'm recording 2560x1440. It might just be YouTube though... \r\nI heavily recommend using OBS Studio for those who are looking for a reliable, free and easy to use recording and streaming experience, or those looking to start their YouTube career.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OBS is a classic, needs no introduction. Maybe not perfect, but very reliable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a little tutorial - I have nothing negative to say.\n\"Win+G\" failed to record my GDevelop game-in-progress ,\nso I had to look for something else (but without watermark)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent and free software for recording and streaming. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bagus , pc kentang kayak saya jadi bisa ngerecord game untuk di post di sosmed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great streaming and recording software and very simple",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just for whomever wants to record for youtube or videoblogging on steam or whatever you choose to do, it's a good start, and just ol' reliable in general",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "бест прога для записи в мире, только иногда проблемы, не понятно из за чего0)0)0))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its really good software to record. Totally, recommend new youtubers and streamers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing studio\nOBS is great for first time or professional streamers. Sometimes it's confusing otherwise I would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great software for making videos and just recording and streaming, but I do have a couple minor complaints. It might just be on my end, but I just wanted to let it be known.\n\n-Window capture won't work for apps that close when tabbed out (Can't really be fixed)\n-Bad quality when zoomed in (Again, there's not really a way to fix that)\n-Camera keeps not activating, so I have multiple non-functional camera instances (I'm using a camera from 2015, so that's probably my fault)\n\nBesides from those minor issues, most of which probably being on my end, this sofware is great. I would 100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Strange how this tool is on steam but let's get over it, it's very good, but it's better to get it from google. I recommend it, but more the version from google",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for recording and streaming game play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dude this is honestly so useful for youtubers and streamers. I just press the button \"start streaming\" and it links to my browser and starts the stream. I can also add elements to my stream/video BY JUST CLICKING A BUTTON LIKE BRO THIS THING IS TOO USEFUL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great app for recording gay porn btw. look at my pfp",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "OBS Studio is the reason you can’t trust price tags anymore. How is it that the most stable, customizable, and feature-packed recording software is the one that costs absolutely nothing? It’s wild. Everything works the way you expect: clean encoder options, flexible scenes, audio mixing that actually makes sense, and plugins that let you shape your setup exactly how you want it. It’s the kind of program that makes you feel spoiled, like you shouldn’t be getting this level of quality for free. If you’re creating anything like streams, clips, tutorials, or gameplay, OBS is not optional. It’s mandatory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very great,had to rip off a ram from another laptop so it could run on my current laptop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Does videos for recording for streaming for sigma for obs obs sbo studio for life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve spent some time with this game and honestly, it surprised me in a way I didn’t fully expect. I don’t want to sound dramatic, but there’s something oddly satisfying about how everything fits together — not in some perfect, polished “advertisement” way, but more like a game that knows exactly what it wants to be and just… goes for it.\n\nThe first thing I noticed is the atmosphere. Every part of the game — the visuals, the sound, the pacing — kind of blends into this feeling that you’re actually inside its world, even if you’re just casually playing. I know that sounds a bit cliché, but it’s true. Sometimes it’s chaotic, sometimes slow, sometimes you’re just wandering around thinking “ok, what now?” but that’s honestly part of the charm. The game doesn’t try to rush you unless it actually needs to.\n\nGameplay-wise, it has this mix of familiar elements and small twists that keep things from feeling stale. Nothing groundbreaking, maybe, but it all works together in a way that feels natural. There were moments when I thought “yeah, I’ve seen this in other games,” but then the game throws in tiny details or unexpected interactions that make it stand out just enough. It’s the kind of thing you only notice after a few hours, when you start connecting the dots.\n\nPerformance has been mostly fine. A little rough spot here and there, but honestly, show me a game these days that doesn’t have something weird happening once in a while. Nothing game-breaking on my end, at least. You can clearly tell the developers put effort into this, even if a few edges are still a bit sharp. Again — part of the charm.\n\nWhat I really appreciate is that the game gives you space to play the way you want. Some people will rush through every objective, others will take their time exploring or messing around, and both approaches actually feel valid. I like games that don’t punish you for not following some “correct” path.\n\nOverall, I’d say this is one of those titles that grows on you the longer you play. It doesn’t try too hard to impress in the first five minutes — instead it slowly builds its identity, layer by layer, until you suddenly realize you’ve been playing way longer than you planned. If you’re looking for something that balances comfort with challenge, familiar mechanics with fresh touches, and a world that’s just fun to be in, then I genuinely think this one is worth giving a shot.\n\nWould I recommend it?\nYeah, I would — maybe not to everyone, because no game is for everyone, but definitely to anyone who likes getting lost in a game for a bit and discovering things at their own pace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good ol' recording thing so i wont have to download from a sketchy site. one time I did and a bunch of naked women popped up they were all kissing eachother and hairy. My Dad, George came in and went \"Georgie What are you lookin' at\" and I said \"Pa' I'm looking at naked ladies atleast atleast im not looking down the end of a Bud Weiser\" then he beat me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kinda complicated. But when you know what you're doing, then it's the best streaming and/or recording app there is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I use this to record my DVDs and blurays to my computer and then use handbrake to compress so I can watch them on my quest 3.  I find it provides higher quality result than using MakeMKV and handbrake.  On handbrake I use the super options instead of fast to get best quality.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for the beginner.. thats what i am and it's easy to use.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "accidentally recorded myself blundering around in KSP for 8 minutes trying to land on a flat enough surface while working on something that I'm trying to make be under one minute long\r\n\r\n10/10 software",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend this for content creators/streamers\r\n\r\neasy and great to use 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Works well, would recommend after using it for over 1k hour",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good at recording (does not come with minecraft preinstalled)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've had OBS on my PC for a long time, and now decided to get it on Steam!\nStill is the best recording software out there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome software for recording and streaming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best recording software I have and will use/used. Thank you to the devs for making something simple and easy to use.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really great textures/graphics. AI is really good and playable against. Add in the pvp and you have normal human elements added into the mix like the real thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i use it to record anime scenes i like for personal watching later",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "|  Very Good!\n|  10/10\n\nI find OBS Studio very easy to use, and I can nicely record my gameplay in different games I like. I very much recommend this recording software! Wouldn't use anything else. Its nice and modern, rounded edge look is nice.\nIf you use it however, you may want to use a tutorial because although its easy, it can be tricky to set up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Praticamente se configura sozinho, excelente!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "streaming made easy and easily accessible from your library",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "useful if you want to record your screen or just one application",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kinda complicated but once yoiu get hang of it its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "uhh cool software and not hard to understand",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very good for creating videos had a bit of a hard time trying to go live tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for streaming and recording!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for content creators",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If it doesnt work, the problem is between the table and the keyboard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i can make my discord camera a five nights at freddy's gameplay video pretty neat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very nice game\r\nthere is a lot of buttons to play with\r\nis this even a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good for streaming, recording etc, Like it alot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best screen recording software",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i dont realy like it i am a youtuber and i only play poppy playtime and hello neighbor because IT WONT LET ME RECORD WILE I PLAY ROBLOX",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if someone asks me what im doing in obs for 5 hours then i was probably using it for 20 minutes then forgor to turn it off after",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best recording and streaming app ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very good streaming / recording app!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best recording app for computers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for Recording, I use it for MSFS flights. Very Easy to use. 11/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's simple, easy to understand some things, and is probably the best for if you want to be a YouTuber.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good software, always use it when i play vr to make everything easier.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm writing a review of this program, because I used the browser version (which is identical). Well, not much to say as it is the most valid choice to record videos. Might be slightly complicated to get it to work, but once you get the hang of it, you can record without any problems.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best app for streaming and/or recording.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Mom, get the camera, i hit a clip!!! Well no more asking mom because now you can do it yourself",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great gameplay worth your time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still good but lag my games but that because my laptop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty decent recording software. Using this to learn how to make videos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i freaking love clipping roblox roleplay games with this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great recording studio but needs setting up before hand",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice recording app",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Records stuff, does it good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its rlly good to record and my pregnent wife pooped rn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good software for strea\r\nming",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good recording software",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best recording software of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gets most of my cs2 clips to look clean if it didn't I wouldn't have used it 😁",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really useful! pretty confusing tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best of its kind on Steam for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to use and run. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wow that is so good and god",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great for asmr while i watch the hub",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only recording program it just eats too much resources",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing software helps me make videos easily.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "USER FRIENDLY, IF YOU KNOW WHAT YOU'RE DOING.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Verry good for record *thumb up*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good for streaming do recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there's nothing bad about a free recording software :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very easy to use and efficient",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "i spent 1210 hours trying to fix my screen - do NOT play it. it is a cursed copy of sonic the hedgheog 2 and there is a demon inside it. it corrupted my screen and ive been trying to fix it ever since",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "PLEASE DONT INSTALL THIS, YOUR LIFE WILL BE SUCKED AWAY AND YOU WILL ENDELESSLY WANT TO LEARN MORE ABOUT VIDEO EDITING. AS OF POSTING I HAVE 500 HOURS ON DAVINCI RESOLVE. PLEASE DONT DO IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MY RECORDINGS FREEZE ALL THE TIME BECAUSE I ALT+TAB OUT OF AN APP SO I LOST A GOOD ONE SO FRICK THIS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk how to screen record yet so I'm off of this studio I am actually leaving the O.B.S app and reinstalling it after I get some tips on how to get it\n\n-From JTMac1987",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use Nvidia's built in Screen Recorder if you're only using this for recording. Because you won't get any input lag or game lag/ stutters in Nvidia Recorder and the best part is, it's better quality too. So stop using OBS and start using Nvidia Recorder now. Press ALT+Z and use your prefered settings there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the product is good but holy crap it lags the entire system on mac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LET'S GOO I JUST FINISHED MY VIDEO!!!. WAIT WAIT WHERE'S MY VIDEO WHERE'S MY VIDEO??????!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wanna be steamer simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Ryan Gosling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scree is laggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "na na nu a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I H",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game\r\nno gameplay \r\nno characters\r\nno lore\r\njust straight up video recording\r\n10/10\r\nit costs too much tho\r\nmake it cheaper pls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i spent 1210 hours trying to fix my screen - do NOT play it. it is a cursed copy of sonic the hedgheog 2 and there is a demon inside it. it corrupted my screen and ive been trying to fix it ever since",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure if its just my pc but EVERYTIME I open obs it crashes. I can't have it open for more then like 2 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE DONT INSTALL THIS, YOUR LIFE WILL BE SUCKED AWAY AND YOU WILL ENDELESSLY WANT TO LEARN MORE ABOUT VIDEO EDITING. AS OF POSTING I HAVE 500 HOURS ON DAVINCI RESOLVE. PLEASE DONT DO IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MY RECORDINGS FREEZE ALL THE TIME BECAUSE I ALT+TAB OUT OF AN APP SO I LOST A GOOD ONE SO FRICK THIS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk how to screen record yet so I'm off of this studio I am actually leaving the O.B.S app and reinstalling it after I get some tips on how to get it\n\n-From JTMac1987",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use Nvidia's built in Screen Recorder if you're only using this for recording. Because you won't get any input lag or game lag/ stutters in Nvidia Recorder and the best part is, it's better quality too. So stop using OBS and start using Nvidia Recorder now. Press ALT+Z and use your prefered settings there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the product is good but holy crap it lags the entire system on mac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LET'S GOO I JUST FINISHED MY VIDEO!!!. WAIT WAIT WHERE'S MY VIDEO WHERE'S MY VIDEO??????!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wanna be steamer simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Ryan Gosling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scree is laggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "na na nu a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I H",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game\r\nno gameplay \r\nno characters\r\nno lore\r\njust straight up video recording\r\n10/10\r\nit costs too much tho\r\nmake it cheaper pls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i spent 1210 hours trying to fix my screen - do NOT play it. it is a cursed copy of sonic the hedgheog 2 and there is a demon inside it. it corrupted my screen and ive been trying to fix it ever since",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure if its just my pc but EVERYTIME I open obs it crashes. I can't have it open for more then like 2 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE DONT INSTALL THIS, YOUR LIFE WILL BE SUCKED AWAY AND YOU WILL ENDELESSLY WANT TO LEARN MORE ABOUT VIDEO EDITING. AS OF POSTING I HAVE 500 HOURS ON DAVINCI RESOLVE. PLEASE DONT DO IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MY RECORDINGS FREEZE ALL THE TIME BECAUSE I ALT+TAB OUT OF AN APP SO I LOST A GOOD ONE SO FRICK THIS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk how to screen record yet so I'm off of this studio I am actually leaving the O.B.S app and reinstalling it after I get some tips on how to get it\n\n-From JTMac1987",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use Nvidia's built in Screen Recorder if you're only using this for recording. Because you won't get any input lag or game lag/ stutters in Nvidia Recorder and the best part is, it's better quality too. So stop using OBS and start using Nvidia Recorder now. Press ALT+Z and use your prefered settings there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the product is good but holy crap it lags the entire system on mac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LET'S GOO I JUST FINISHED MY VIDEO!!!. WAIT WAIT WHERE'S MY VIDEO WHERE'S MY VIDEO??????!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wanna be steamer simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Ryan Gosling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scree is laggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "na na nu a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I H",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game\r\nno gameplay \r\nno characters\r\nno lore\r\njust straight up video recording\r\n10/10\r\nit costs too much tho\r\nmake it cheaper pls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i spent 1210 hours trying to fix my screen - do NOT play it. it is a cursed copy of sonic the hedgheog 2 and there is a demon inside it. it corrupted my screen and ive been trying to fix it ever since",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure if its just my pc but EVERYTIME I open obs it crashes. I can't have it open for more then like 2 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE DONT INSTALL THIS, YOUR LIFE WILL BE SUCKED AWAY AND YOU WILL ENDELESSLY WANT TO LEARN MORE ABOUT VIDEO EDITING. AS OF POSTING I HAVE 500 HOURS ON DAVINCI RESOLVE. PLEASE DONT DO IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MY RECORDINGS FREEZE ALL THE TIME BECAUSE I ALT+TAB OUT OF AN APP SO I LOST A GOOD ONE SO FRICK THIS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk how to screen record yet so I'm off of this studio I am actually leaving the O.B.S app and reinstalling it after I get some tips on how to get it\n\n-From JTMac1987",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use Nvidia's built in Screen Recorder if you're only using this for recording. Because you won't get any input lag or game lag/ stutters in Nvidia Recorder and the best part is, it's better quality too. So stop using OBS and start using Nvidia Recorder now. Press ALT+Z and use your prefered settings there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the product is good but holy crap it lags the entire system on mac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LET'S GOO I JUST FINISHED MY VIDEO!!!. WAIT WAIT WHERE'S MY VIDEO WHERE'S MY VIDEO??????!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wanna be steamer simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Ryan Gosling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scree is laggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "na na nu a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I H",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game\r\nno gameplay \r\nno characters\r\nno lore\r\njust straight up video recording\r\n10/10\r\nit costs too much tho\r\nmake it cheaper pls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i spent 1210 hours trying to fix my screen - do NOT play it. it is a cursed copy of sonic the hedgheog 2 and there is a demon inside it. it corrupted my screen and ive been trying to fix it ever since",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure if its just my pc but EVERYTIME I open obs it crashes. I can't have it open for more then like 2 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE DONT INSTALL THIS, YOUR LIFE WILL BE SUCKED AWAY AND YOU WILL ENDELESSLY WANT TO LEARN MORE ABOUT VIDEO EDITING. AS OF POSTING I HAVE 500 HOURS ON DAVINCI RESOLVE. PLEASE DONT DO IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MY RECORDINGS FREEZE ALL THE TIME BECAUSE I ALT+TAB OUT OF AN APP SO I LOST A GOOD ONE SO FRICK THIS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk how to screen record yet so I'm off of this studio I am actually leaving the O.B.S app and reinstalling it after I get some tips on how to get it\n\n-From JTMac1987",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use Nvidia's built in Screen Recorder if you're only using this for recording. Because you won't get any input lag or game lag/ stutters in Nvidia Recorder and the best part is, it's better quality too. So stop using OBS and start using Nvidia Recorder now. Press ALT+Z and use your prefered settings there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the product is good but holy crap it lags the entire system on mac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LET'S GOO I JUST FINISHED MY VIDEO!!!. WAIT WAIT WHERE'S MY VIDEO WHERE'S MY VIDEO??????!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wanna be steamer simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Ryan Gosling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scree is laggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "na na nu a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I H",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game\r\nno gameplay \r\nno characters\r\nno lore\r\njust straight up video recording\r\n10/10\r\nit costs too much tho\r\nmake it cheaper pls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i spent 1210 hours trying to fix my screen - do NOT play it. it is a cursed copy of sonic the hedgheog 2 and there is a demon inside it. it corrupted my screen and ive been trying to fix it ever since",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure if its just my pc but EVERYTIME I open obs it crashes. I can't have it open for more then like 2 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE DONT INSTALL THIS, YOUR LIFE WILL BE SUCKED AWAY AND YOU WILL ENDELESSLY WANT TO LEARN MORE ABOUT VIDEO EDITING. AS OF POSTING I HAVE 500 HOURS ON DAVINCI RESOLVE. PLEASE DONT DO IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MY RECORDINGS FREEZE ALL THE TIME BECAUSE I ALT+TAB OUT OF AN APP SO I LOST A GOOD ONE SO FRICK THIS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk how to screen record yet so I'm off of this studio I am actually leaving the O.B.S app and reinstalling it after I get some tips on how to get it\n\n-From JTMac1987",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use Nvidia's built in Screen Recorder if you're only using this for recording. Because you won't get any input lag or game lag/ stutters in Nvidia Recorder and the best part is, it's better quality too. So stop using OBS and start using Nvidia Recorder now. Press ALT+Z and use your prefered settings there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the product is good but holy crap it lags the entire system on mac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LET'S GOO I JUST FINISHED MY VIDEO!!!. WAIT WAIT WHERE'S MY VIDEO WHERE'S MY VIDEO??????!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wanna be steamer simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Ryan Gosling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scree is laggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "na na nu a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I H",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game\r\nno gameplay \r\nno characters\r\nno lore\r\njust straight up video recording\r\n10/10\r\nit costs too much tho\r\nmake it cheaper pls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i spent 1210 hours trying to fix my screen - do NOT play it. it is a cursed copy of sonic the hedgheog 2 and there is a demon inside it. it corrupted my screen and ive been trying to fix it ever since",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure if its just my pc but EVERYTIME I open obs it crashes. I can't have it open for more then like 2 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE DONT INSTALL THIS, YOUR LIFE WILL BE SUCKED AWAY AND YOU WILL ENDELESSLY WANT TO LEARN MORE ABOUT VIDEO EDITING. AS OF POSTING I HAVE 500 HOURS ON DAVINCI RESOLVE. PLEASE DONT DO IT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "MY RECORDINGS FREEZE ALL THE TIME BECAUSE I ALT+TAB OUT OF AN APP SO I LOST A GOOD ONE SO FRICK THIS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idk how to screen record yet so I'm off of this studio I am actually leaving the O.B.S app and reinstalling it after I get some tips on how to get it\n\n-From JTMac1987",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Use Nvidia's built in Screen Recorder if you're only using this for recording. Because you won't get any input lag or game lag/ stutters in Nvidia Recorder and the best part is, it's better quality too. So stop using OBS and start using Nvidia Recorder now. Press ALT+Z and use your prefered settings there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the product is good but holy crap it lags the entire system on mac",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LET'S GOO I JUST FINISHED MY VIDEO!!!. WAIT WAIT WHERE'S MY VIDEO WHERE'S MY VIDEO??????!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wanna be steamer simulator",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No Ryan Gosling",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scree is laggy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "na na nu a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I HATE YOU I H",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit game\r\nno gameplay \r\nno characters\r\nno lore\r\njust straight up video recording\r\n10/10\r\nit costs too much tho\r\nmake it cheaper pls",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i spent 1210 hours trying to fix my screen - do NOT play it. it is a cursed copy of sonic the hedgheog 2 and there is a demon inside it. it corrupted my screen and ive been trying to fix it ever since",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm not sure if its just my pc but EVERYTIME I open obs it crashes. I can't have it open for more then like 2 minutes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE DONT INSTALL THIS, YOUR LIFE WILL BE SUCKED AWAY AND YOU WILL ENDELESSLY WANT TO LEARN MORE ABOUT VIDEO EDITING. AS OF POSTING I HAVE 500 HOURS ON DAVINCI RESOLVE. PLEASE DONT DO IT",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}