{
  "positive": [
    {
      "review": "As far as the English language Super Robot Wars games go (Alpha Gaiden, J, V, X, T and 30) it has the best story with clear themes and interesting development of characters. Most series feel like their story is important to the overall plot of the game (Witch from Mercury feels stubby for only having the first season included) and it makes the game more fun to see how the characters from different shows and their plots interweave and change from the original.\r\n\r\nGameplay's the usual Super Robot Wars fun gameplay, I played on Expert difficulty which provided a solid challenge. Towards the end of the game objective conditions start being introduced which work as a nice way to up the difficulty even if you've been Front grinding for credits and MxP. Music's great as usual, the new character designs are enjoyable. I'd say the mecha designs for the protagonist units are nicer than the OG antagonist units, but the music they come with is great nonetheless.\r\n\r\nNitpicks I'd have are mostly related to the new engine they've moved onto after 25? years of frankensteining on top of the Alpha engine; the unit screen isn't anywhere near as thorough or nice as it used to be, opting for a grid system with a filter option. I'm thinking primarily PS2/PS3 era SRW games you'd get a long list and you could sort and filter by *many* criteria like score, EN, terrain adaptability, strongest attack, if they can support attack or defend, do they use a shield, have a barrier, etc. The menus for buying and upgrading skills and parts is also clunky and hard to get through to find what you want quickly, similarly working on a scroll and filter system that resets its position every time you leave its window. This can make distributing your acquired skill parts very tedious in conjunction with how barebones the search menu is for your units and pilots.\r\n\r\nGreat Super Robot Wars game, I'd recommend to anyone interested in turn-based strategy JRPGs and hopefully by the next entry they've become more comfortable with the new engine they've moved onto and improve on the QOL menu stuff. I also expect the combat animations to keep improving and for them to be more comfortable, you could see in the attacks for the OG units and a handful of others like the Wing Gundam Zero that they can put out beautiful and awesome-looking attack animations.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is a blast! hoping for a remaster and release on Steam for the Z trilogy and the VTX trilogy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily one of the best SRW games by mechanics, not the best but top 5 easily in my book. Its balanced, but not annoyingly so where units have no identity. Expert mode is a fun, if light challenge.\r\n\r\nMore importantly this is for the most part one of the better written SRW. Most of the plot lines are tightly integrated into the overall plot and it even made me care about Combattler V by the end.\r\n\r\nThe only exception is the Witch plot. I feel like this license was included very late in development as the chapters are very segregated from the rest in terms of plot relevance and connectivity.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Only delved a  little into it so far since I'm working on finishing SRW 30 still. But so far it looks nice, runs well, and still has some of the humorous moments one comes to enjoy in each one. Will likely offer a  more refined experience as I begin getting into the meat of the game properly.\r\n\r\nThe main complaints I've heard is it's not able to use the current premium resolution standard. \r\nBut them not dong so appeals to those without souped up rigs and probably reflects that they have swapped to a whole new game engine and need time to master it if they keep using Unity in the foreseeable future. Frankly, I see 4k as wholly unneeded as the substance of a game is paramount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as SRW 30, but its ok. I do hope we can get another one that includes Iron Blooded Orphans. I need alternative ending on that one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love tactical RPG gaming along with a cast of robots to ensure destruction on your enemies then this game is just for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, fell in love with this series after my fist game (30). A little strange having some of the series stories be over (G gundam and Wing) but I like how they have handled it. Witch from Mercury only having season 1 is a bit of a disappointment but still works (I made Suletta death, destroyers of worlds) and Being able to grind but having a limit is wonderful for someone who loves to grind a bit to much like me. If you love crossovers and story then this is a great game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another pretty damn good addition to the SRW Series. Much better story integration on this one than 30 had, in this one other party members actually feel like they are a part of the action in a mission instead of doing MST3k style bits as other characters play out episodes of their anime or segments of the games they are from. \n\nCombat isn't much different from previous installments, but that's feels like more of a \"don't try to fix what isn't broken\" situation than anything. \n\nDon't worry about the giant roster, you'll find a few units you like and be fine.\n\nThe only thing I wish was a little more like 30, the most recent other one I've played, is the soundtrack. This one has more instrument only covers, as opposed to 30 where they had singers and the original songs with lyrics in most cases.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of my favorite english-speaking entries in the series (discounting fan trads, but that's another discussion entirely).\r\n\r\nIt builds on 30's structure and strengths, with a return of the free-select mission structure and an attempt at non-linear storytelling. Where it succeeds is that missions now focus on multiple series in parallel, and always feature mid battle events changing up the situation and the narrative, so it's a much more engaging experience both story and play wise.\r\n\r\nThe game's biggest strength is its writing and how it weaves all the crossovers together in a single, consistent world without relying on the parallel universe crutch from 30. Animations are still a bit of a mixed bag but still mostly on the very good end of the scale, with a much better use of 3D models.\r\n\r\nThe new engine the game is built on does mean a ton of decade-old muscle memory is now invalid when UI and UX are concerned (no more quick movement with R1+stick or quicksave with square/X) and there are improvements to be made still, but it's an intriguing development and I look forward to their next iteration on this new foundation.\r\n\r\nOverall: if you've played SRW before, it's one of the better entries, not reaching the heights of the series japanese-only best but definitely memorable in its own right, with excellent OG units and music, cool story and animations, a surprising-yet-it-works cast, and plenty of small UI changes that make gameplay extremely fluid and stop relying on the old quicksave/quickload shenanigans.\r\n\r\nIf you haven't played SRW before... there isn't a better time than now, so if you're interested, get in the robot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty good if you like tactical gameplay or some cute fanservice with stories mentioned in. Mechanically its something similiar to Final Fantasy Tactics or Fire emblem, where You get to command units from many different mecha anime. Story is neatly interwoven with everyone having their own reasons to join our group. Overall its a pretty nice game that has some decent difficulity(If you pick one that fits your level) and pretty cool animations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic iteration on SRW30. Extremely well integrated crossovers, with many series seeing creative representation that allow them to be more than just a rehash of their plotline. The original characters are among the best SRW has ever had, and the original enemy faction is similarly outstanding. Still have many DLC missions left to go, but as of finishing the game I'd say this is among the best SRW games I've ever played. Highly reccomended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super Robot Wars Y is an Incredible improvement over Super Robot Wars 30 (a low point in the franchise, if you are not familiar with it). Significant mechanical overhauls, better writing, more varied objectives and terrain usage, and really bolting down a lot of the mechanics added over the past few entries make the game much less of a stomp in favor of the player and much more of a, you know, game. All this said; there is room for improvement.\r\n\r\nLet me start off by saying the plot is incredible and I love it. Super Robot Wars has always been about the plot, and Y is a return to form in a big way. A lot of series interconnectivity, and even better treatment of DLC characters puts it leagues ahead. My one minor complaint is that it is sort've a retread of the super robot wars 30 story, but I can respect it as essentially a \"second attempt\" at that plot.\r\n\r\nMechanically, not much has changed, but many of the auxilary systems (skill tree, assists, ExC, etc) have been remodeled and tightened up. No more ExC (so no more zealing your best unit across the map to kill every enemy on turn one), skill tree is much larger and upgrades are much more marginal, and assist crew entries are... pretty much the same, but they were never too bad. Difficulty remains fairly low, even on expert (I beat the entire game on expert, first run, putting no special effort in and only had to stop and think a couple of times; I am Not an SRPG Pro, and this is not a compliment). Difficulty is concentrated in the early game and the very late game, and if you're good at scaling your units well (doesn't take a particularly larg eamount of effort, tbh), the late game probably won't be so bad. Some minor difficulty spikes early on in new chapters, and in general it seems like this problem was, at least partially, a complication of the new (circa SRW 30) mission system, so I do have some sympathy. All this said; still absolutely massively better then SRW 30, which I nearly fell asleep playing several times. No joke.\r\n\r\nAn excellent step up all in all! I dunno if I'd reccomend it to people that aren't big on giant robots, and I don't need to sell it to people already playing super robot wars games, but it's certainly much better then super robot wars 30. Hope to see more improvements in later entries! The game doesn't need to be absurdly difficult, but I would like to have to think about how I'm playing more then like, 20% of the game. Still better then 0%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend this game for veterans of the Super Robot Wars community and new members as well! This game is easy to learn and has a rich story to enjoy when you are not engaged in battle. Highly recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have been playing super robot games since it started in the 90s, and this is by far one of the better ones, the music the gameplay and even the story is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Out of the games that have come out since V. This is probably the best one (including V) in almost all aspects. They have finally fixed the gameplay and properly balanced the units and assists. And remove some of the most oppressive mechanics in the previous game. Like EXC. And the story is also significantly superior, they actually do a incredibly good job a making the series mix together naturally and have the characters and stories properly intertwine with each other which is something srw had been missing for a while. The one complaint I would have which isn't really that much of a serious critique but more of a personal thing is I think the roster of this game is pretty lame. But considering it's used way better than the previous games roster. I can let it pass. Honestly a great start for the international era and steps a thousand steps in the right direction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look, even the grinding on this is a blast for me. This game is just a joy for anime nerds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been really enjoying going through this one. It goes without saying, if you like Super Robot/Real Robot stuff in either classic or modern form, you'll find something you like here. They got everything from Heavy Metal L-Gaim to Gundam and Aura Battler Dunbine. The tracks are very faithful to their respective IP, often times including the actual songs themselves in addition to tasteful renderings. I'm especially stoked on this one due to the inclusion of Gundam characters and mechs from Wing and G Gundam. Overall, if you like mech stuff and grid based strategy games you should give this one a shot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super Robot Wars games are my drug which means I tend to spend years at a time in deep withdrawl, shriveled up like a prune until a new one arrives and suddenly I'm alive again but high-speed incoherently babbling about punching robots. This is a really good one, though it did take me a little bit to get used to the UI changes compared to how it tended to go on previous games in the franchise.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a good SRW entry. It's rather slow at the start, but at least they keep you interested throughout. There's always at least a plot revelation at the end of each chapter.\r\nThe UI is still too convoluted. I don't like how everything is crunched towards the middle of the screen.\r\n\r\nThere are some good crossover moments, but not as good as SRW 30's. Witch from Mercury is almost completely separate from the overall plot, while Macross Delta is very well integrated. Majestic Prince is more self-contained here than in SRW 30. \r\n\r\nOverall, this game is Macross Delta, Getter Robo Arc and Dynazenon-centric. Although Godzilla won't show up for most of the game, they actually hype it up correctly. When you finally fight it, it's like you're at the end of this long quest and finally got your reward.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Robots, Godzilla, and Anime Boobies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I see Super Robot Wars\n\nI buy Super Robot Wars.\n\nSimple as.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Who knew giving the team actual time leads to a better product",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Better than the last 4 games in the series were. Still too easy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun but can be challenging at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a Super Robot fan I love this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This version is the best i see for this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Now, Godzilla, time to count your sins.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most fun you'll have in a SRPG this year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A wonderful Robot Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so good on the steam deck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CODE GEASS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Robots",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak Mecha Behaviour",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This has the best character interactions and story by far out of VXT trilogy and 30. The original characters are this time are very endearing. By the time I finished the game after 112 hours, I felt sad that it was over in a way I haven't felt about a game in forever.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "As someone who took the time to watch every series featured here, this game did not dissapoint. In fact it's probably the best Super Robot Wars game since Z2 back on the PSP.  Not only does every series addition feel meaningful, but the original cast tied it together so nicely.  It's not just empty fanservice, it's an authentic story about characters learning how any power can turn you into a God or a Devil, it merely depends on how you use it.  The gameplay is also an immense step up, actually requiring real strategy instead of just spamming the most powerful attacks with all your units.  I got my ass kicked at times, but it always felt like my fault.  If you're a mecha fan, you owe it to yourself to check this out.  It checks about every box you could ever want.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "SRW Y is the best game the franchise has produced since the PS2 era, and I don't think it's particularly close. I say this as someone who thought SRW 30 was a disappointment to the point that I didn't preorder Y or even pay attention to any of the trailers or other pre-release media. I thought that the series list had too many retreads from 30 that would clog up my roster with units I didn't want to use. If you're wary of getting Y because of this same worry, let me reassure you: every single show in Y's roster more than pulls its weight, even (and in some cases [i]especially[/i]) the ones that reuse a bunch of units/animations/etc from 30.\r\n\r\nThe core appeal of SRW as a series has always been the crossover aspect - your favorite characters and robots from your favorite shows fighting and interacting with each other. Every game in the series does tons of crossover stuff - in fact, that's basically the entire point - but Y does it as well as any of them, if not better, and that's because of the writing. In an average SRW game, any given stage will usually primarily follow the plot of one particular show. Your whole team is there, of course, but they're mostly commenting from the sidelines and providing support to that stage's main characters. SRW Y stands out to me because the character dynamics and plotlines are constantly intertwined in fun ways that I don't expect. And if you track these dynamics and deploy people at appropriate points, you get bits of bonus dialogue. \r\n\r\nThe writing isn't the only reason the game is such a success in my view. The core gameplay has also taken a step forward, most notably by having actual well-tuned difficulty settings. You can still effortlessly stomp the enemies if that's what you want, but the higher settings actually provide a good challenge now. The ExC and Supporter systems from the past few games have sort of been combined and replaced with a new Assist Link system which is more tactically interesting and rewarding. QOL is better than ever, most notably because you can finally save in battle (using actual save slots, not just a single suspend slot) and you can load a save in battle without needing to reset to the title screen. \r\n\r\nThe game isn't flawless of course. The number one issue is that variety in enemy mechs is somewhat lacking - this is a persistent problem that the series has been facing for a long time. Some factions are worse offenders than others. The Custom BGM feature is somewhat poorly implemented in comparison to past games (basically, you can no longer adjust the volume of an individual track). The UI is a bit clunky in some ways. All of these are minor issues in the grand scheme of things, and some of them might even be able to be patched out.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "This game is fun. I just cleared it for the first time as a SRW veteran.\r\n\r\nPros \r\n- A good mix of classic and newer mecha shows. The visuals on the OG mech and Gundam Wing are very impressive particularly, keep it up!\r\n\r\n- The story is more cohesive than SRW 30 which had a similar idea with branching missions.\r\n\r\n- Great to have clear conditions to unlock the side missions, a really nice touch.\r\n\r\n- The new skills and seishin feel great. Especially the addition of gunfight/infight reminds me of the good old days of the SRW OG series allowing your ranged units to often outrange bosses and melee to counterattack from most ranges while moving very far.\r\n\r\n- The challenge maps are pretty fun and have good variety. Even as a longtime player I had a good chuckle or two at what they expected of us while not being a complete pushover.\r\n\r\n- The assist system is more balanced on average compared to the more recent EXC which made it incredibly easy to finish a map in 1-2 turns and at least this way you need specific setups to chain assists infinitely.\r\n\r\n- The adjusted difficulties levels appear to suit every range of player. Even those I've talked to who consider the modern games extremely easy said that they were impressed at how the game felt to them now, from  the adjustments I mentioned earlier and also more terrain to make defensive plays worth it instead just throwing your units at the enemy and abusing the EXC system.\r\n\r\nNeutral\r\n- The change to PP is a massive one and it does consolidate resources more which's good (allowing weak mechs/pilots to become good provided you have enough funds rather than relying on them to regularly fight). This does however have the downside of making building a strong unit easier in the longterm but would require much grinding to get a perfect squad.\r\n\r\n- Following on from that i have mixed feelings about the shop. It's cool that by lategame you can buy amazing items however I kind of wish they were limited, because with enough funds it's very easy to give these to all your best units and makes some of the trials feel less interesting as they don't give good items by comparison.\r\n\r\n-Speeding through assist animations feels a bit weird. It would be nice to turn the animation off or simply skip through.\r\n\r\nCons\r\n- The odd missing audio queue, which seems to happen sometimes when you speed through mech abilities with an animation.\r\n\r\n- It sounds strange to say but before the DLC is available there's quite a lack of super units, meanwhile we are swimming in real robots. Not a giant problem personally but I can imagine some would be put off by this.\r\n\r\n- Pre-order exclusive content, (good free OG units in this case) just feel like bad practice. If someone wanted to wait for a sale, they shouldn't be punished by being restricted from fun units.\r\n\r\n- The new UI takes some getting used to. It does have good information especially on the main map but I feel like it took much longer overall to navigate and setup multiple units at once whereas in previous games this was better streamlined e.g. Activating the drive seishin on multiple characters I can search>drive then gives a list of characters but afaik It wouldn't allow me to select those characters kind of defeating the point of searching for them in the first place.\r\n\r\ntl;dr A great addition to the Super Robot Wars series that has something for everyone and improves on almost every aspect of the more recent game, SRW 30. If you like mecha or strategy RPG's this should be a good time. Bless ya",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "never played a super robot wars? go start with 30, it's like 10 bucks on sale. if you already have the super robot brain disease, you probably already bought this. it's a good one.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Best SRW in over a decade. Fears over this being another \"portal story\" were completely unfounded; all the series are integrated in a very well thought world design. They've also managed to balance the stages to actually be difficult, and occasionally introduce varied stage objectives. The ability to choose stages from SRW30 is still present, but it's been drastically scaled back so that the game still has pacing. I have some complaints about the UI, but that's minor compared to all the things they've finally gotten right after years of almost getting there.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "用了90小时全成就了这个游戏，我给这游戏的评价：7分，不能再多了。我简短说一下\r\n\r\n画面上跟X, V, T, 30没有区别，所以别期待什么画面上的飞跃。不仅没有进步，前几关时还有一个Z高达的敌人，那个敌人仿佛是从上世代的机战弄过来的，贴图都是糊的，给我一个很差的第一印象。\r\n乳摇完全消失，期待这个的玩家要失望了。\r\n\r\n游戏性上跟以前的作品基本一样，只要你玩一部机战，你就能知道其他机战玩起来什么样。虽然本作加入了一个辅助成员的系统，其实你一玩就明白了，跟前作的系统很像。\r\n本作把关卡改成了主线任务和支线任务，其实放在以前的机战里，这都是主线任务。这么一改的话，大大减少了速通游戏的时间。我第一周目通关，主线+所有支线+所有挑战，74小时通关。第二周目通关，只打主线，16小时。\r\n\r\n游戏的难度似乎提高了，在游戏后期，普通难度下，小兵打全改的v高达竟然都有40-50%的命中率。在最高难度下，小兵打无改的沙扎比，竟然是100%命中率，而且2枪就死。\r\n敌人的数量也大大增加了，尤其是后期关卡，有一关直接80多架敌方机体，还有一关有无限增援。挺爽的，机战无双。\r\n\r\n剧情上倒是有大大的改进，这次各个作品的世界观融合的很好，不像前作生硬的把其他作品的机体“时空转移”进来，在本作中所有作品都存在于这个世界里，所以一切事情发生的比较自然。\r\n但似乎因为这种对世界观融合的需求，参战作品很少，这可能是机体最少的一作。而且有些参展新作品挺无聊的，比如哥斯拉奇异点，喷射杰特是相当无聊的机体。\r\n\r\n说说不满意的地方：\r\n1. 游戏男女主角，但其实这俩主角的机体都是一样的，升级后的机体也是一样的，唯一的区别就是机体颜色不一样，还有升级最终必杀技不一样。 男女主角没有专属的任务，也没有专属的行为模式和故事。你玩过一个主角的故事，你就知道另一个主角的故事什么样了。\r\n而且玩这游戏90%的人都会选女主角，女主角在设定上也更加讨好。以后若是不想做不同主角的专属任务和机体的话，还是取消双主角的设定算了。(回想过去的机战，不同的主角机体不一样，任务不一样，性格也不一样，啧啧啧)\r\n\r\n2. 机体少不说，有些该有机体的没有，比如Hi-v高达就没有，全装甲百式都有了，为什么没有夜莺。而长得一模一样的Macross战斗机倒是一下给了5个。Seed的机体也没有流星系统\r\n\r\n3. 多蒙的神高达没有超级霸王电影弹. \r\n\r\n4.高达水星的魔女说是剧情包含了第一季，但实际上第一季就最后几集的剧情完全没出现。来自于地球的高达完全没有。\r\n\r\n5. 最终boss缺乏以往boss的魄力。以前的boss要么是神，要么是宇宙的创造者什么的。然后战斗都是在异空间进行的。这次的boss感觉就是个很厉害的人罢了。我一直都不敢相信这个是真正的boss，直到我打通游戏才不得不接受这个设定。\r\n\r\n说了这么多总结一下就是，这游戏7分不能再高。有好的地方，有坏的地方，但是因为是机战，所以爱玩的人依然会玩。不看机器人动画的人甚至无法理解这游戏的吸引力在哪。",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "As far as the English language Super Robot Wars games go (Alpha Gaiden, J, V, X, T and 30) it has the best story with clear themes and interesting development of characters. Most series feel like their story is important to the overall plot of the game (Witch from Mercury feels stubby for only having the first season included) and it makes the game more fun to see how the characters from different shows and their plots interweave and change from the original.\r\n\r\nGameplay's the usual Super Robot Wars fun gameplay, I played on Expert difficulty which provided a solid challenge. Towards the end of the game objective conditions start being introduced which work as a nice way to up the difficulty even if you've been Front grinding for credits and MxP. Music's great as usual, the new character designs are enjoyable. I'd say the mecha designs for the protagonist units are nicer than the OG antagonist units, but the music they come with is great nonetheless.\r\n\r\nNitpicks I'd have are mostly related to the new engine they've moved onto after 25? years of frankensteining on top of the Alpha engine; the unit screen isn't anywhere near as thorough or nice as it used to be, opting for a grid system with a filter option. I'm thinking primarily PS2/PS3 era SRW games you'd get a long list and you could sort and filter by *many* criteria like score, EN, terrain adaptability, strongest attack, if they can support attack or defend, do they use a shield, have a barrier, etc. The menus for buying and upgrading skills and parts is also clunky and hard to get through to find what you want quickly, similarly working on a scroll and filter system that resets its position every time you leave its window. This can make distributing your acquired skill parts very tedious in conjunction with how barebones the search menu is for your units and pilots.\r\n\r\nGreat Super Robot Wars game, I'd recommend to anyone interested in turn-based strategy JRPGs and hopefully by the next entry they've become more comfortable with the new engine they've moved onto and improve on the QOL menu stuff. I also expect the combat animations to keep improving and for them to be more comfortable, you could see in the attacks for the OG units and a handful of others like the Wing Gundam Zero that they can put out beautiful and awesome-looking attack animations.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Game initially appears/feels like it is much older, like it was developed in 2015 but they nail every important component of the gameplay and presentation. Absolutely amazing game; hope they keep bringing more of these titles to the west as they are a unique experience in the tactical strategy RPG genre.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Having tons of fun. The character/world interactions are great this go around. More A Portable/J then 30",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "SRW Y reminds me of SRW F and F Final. The difficulty level is high and really fun.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "スーパーロボット大戦Yは私を幸せにしてくれる！それが私の人生のすべてです！",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is a blast! hoping for a remaster and release on Steam for the Z trilogy and the VTX trilogy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily one of the best SRW games by mechanics, not the best but top 5 easily in my book. Its balanced, but not annoyingly so where units have no identity. Expert mode is a fun, if light challenge.\r\n\r\nMore importantly this is for the most part one of the better written SRW. Most of the plot lines are tightly integrated into the overall plot and it even made me care about Combattler V by the end.\r\n\r\nThe only exception is the Witch plot. I feel like this license was included very late in development as the chapters are very segregated from the rest in terms of plot relevance and connectivity.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The character writing is leagues ahead of 30's, and the additions and changes to the gameplay makes it so that if you are looking for a challenge, this is the game for you! Hard and Expert Mode offers a good amount of variety and is very reminicient of early SRW games where you can't just alpha strike enemies and one shot them. I highly recommend Y, and hope we get a new trilogy!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I mean its just another SRW but with a bunch of cool improvements so heck yeah sign me up 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The negatives: Really its mostly just the UI being both uglier than the rest of the series and less functional. In a vacuum it's far from the worst I've seen in a strategy RPG but any longtime series veteran will immediately notice issues like Spirit Search being less functional or the fast forward feature outside of battles needing to reset your button inputs a lot. Also of all the new shows implemented, Witch from Mercury is the one that feels the most forced/awkwardly implemented[at least in scenes involving the show's own plot, suletta and friends are cute and enjoyable when crossing over into other series'].\r\n\r\nThe positives: This is the most fleshed out strategy RPG the series has had since Moon Dwellers. If you thought 30 was too easy/boring, this game refreshed all the basic mechanics from the ground up while still being recognizably SRW. Hard/Expert mode are a ton of fun for me, as someone who's been playing these games since the PS1 entries. Tons of units with distinct abilities and traits, difficult enough to make you have to take fights seriously without degrading into an opaque puzzle game, and with lots of fun character interactions in the way you can only get in SRW. The scenario select system from 30 returns but in a form more comparable to Impact/MX, where the game is split up into chapters with their own individual flowcharts. Helps the pace of the story tremendously and is easier to parse on the gameplay side of things too. Speaking of, the story itself has an interesting twist to it compared to other entries[there is no more Earth Federation, your team is an independent city state on top of a giant 3km long ship] that changes a bunch of stuff you'd take for granted in any other entry of the series. Overall a big step in the right direction and hopefully a sign of more good things to come, I hope they at least do some patches to improve the UI usability issues and maybe get a nicer looking UI in mind for the next game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "On the first chunk of maps (chapter 1) it feel very sluggish and not interest due to mostly introduction narrative for each series. But once the team are there, game feel more fun and interested.\n\nGame is hard enough for expert mode comparable to F / F Final which is good.\nHowever after level 50+ game start to feel not so hard due to a lot of sp point.\n\nAssist link system is nice idea some character have interest effect like grant morale for both ally and enemy. Some characters are heavily out shine by other due to gameplay (Morale + credit + mxp are more important than anything else.)\n\nNew animation mostly soso (Original) or below average (Macross). with a few exceptional good (Wing, Zeta).\nThe outliner is gridman series which mostly below average but some part of animation is good.\n\nCross over story is quite good more alike V a lot far better than 30th.\n\nOverall seem like they accept feedback from 30th and make the improvement from there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "People's negative reviews about the game really shows who are real SRW veterans. Animation reuse has been in the lifeblood for every era. No one actually cares what the UI looks. What really matters is how well all the involved series gel with one another, and that has been excellent so far for me.\n\nIt's a Super Robot Wars game. If you've been playing since F-Final like I have, you already know what a good or bad SRW game is like.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's been a while since the last SRW game (SRW 30), when this was first announced, I was disappointed with the series list, and I still am, but everything else about the game has been pretty enjoyable. One thing I noticed that has been different compared to the last half a dozen english SRW games is that SRW Y is surprisingly more difficult.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After a long break between SRW 30th we got another SRW game directly on steam. Though much is the same as usual we still get several improvements and overall a solid new entry in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only delved a  little into it so far since I'm working on finishing SRW 30 still. But so far it looks nice, runs well, and still has some of the humorous moments one comes to enjoy in each one. Will likely offer a  more refined experience as I begin getting into the meat of the game properly.\r\n\r\nThe main complaints I've heard is it's not able to use the current premium resolution standard. \r\nBut them not dong so appeals to those without souped up rigs and probably reflects that they have swapped to a whole new game engine and need time to master it if they keep using Unity in the foreseeable future. Frankly, I see 4k as wholly unneeded as the substance of a game is paramount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as SRW 30, but its ok. I do hope we can get another one that includes Iron Blooded Orphans. I need alternative ending on that one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love tactical RPG gaming along with a cast of robots to ensure destruction on your enemies then this game is just for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, fell in love with this series after my fist game (30). A little strange having some of the series stories be over (G gundam and Wing) but I like how they have handled it. Witch from Mercury only having season 1 is a bit of a disappointment but still works (I made Suletta death, destroyers of worlds) and Being able to grind but having a limit is wonderful for someone who loves to grind a bit to much like me. If you love crossovers and story then this is a great game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another pretty damn good addition to the SRW Series. Much better story integration on this one than 30 had, in this one other party members actually feel like they are a part of the action in a mission instead of doing MST3k style bits as other characters play out episodes of their anime or segments of the games they are from. \n\nCombat isn't much different from previous installments, but that's feels like more of a \"don't try to fix what isn't broken\" situation than anything. \n\nDon't worry about the giant roster, you'll find a few units you like and be fine.\n\nThe only thing I wish was a little more like 30, the most recent other one I've played, is the soundtrack. This one has more instrument only covers, as opposed to 30 where they had singers and the original songs with lyrics in most cases.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of my favorite english-speaking entries in the series (discounting fan trads, but that's another discussion entirely).\r\n\r\nIt builds on 30's structure and strengths, with a return of the free-select mission structure and an attempt at non-linear storytelling. Where it succeeds is that missions now focus on multiple series in parallel, and always feature mid battle events changing up the situation and the narrative, so it's a much more engaging experience both story and play wise.\r\n\r\nThe game's biggest strength is its writing and how it weaves all the crossovers together in a single, consistent world without relying on the parallel universe crutch from 30. Animations are still a bit of a mixed bag but still mostly on the very good end of the scale, with a much better use of 3D models.\r\n\r\nThe new engine the game is built on does mean a ton of decade-old muscle memory is now invalid when UI and UX are concerned (no more quick movement with R1+stick or quicksave with square/X) and there are improvements to be made still, but it's an intriguing development and I look forward to their next iteration on this new foundation.\r\n\r\nOverall: if you've played SRW before, it's one of the better entries, not reaching the heights of the series japanese-only best but definitely memorable in its own right, with excellent OG units and music, cool story and animations, a surprising-yet-it-works cast, and plenty of small UI changes that make gameplay extremely fluid and stop relying on the old quicksave/quickload shenanigans.\r\n\r\nIf you haven't played SRW before... there isn't a better time than now, so if you're interested, get in the robot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty good if you like tactical gameplay or some cute fanservice with stories mentioned in. Mechanically its something similiar to Final Fantasy Tactics or Fire emblem, where You get to command units from many different mecha anime. Story is neatly interwoven with everyone having their own reasons to join our group. Overall its a pretty nice game that has some decent difficulity(If you pick one that fits your level) and pretty cool animations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic iteration on SRW30. Extremely well integrated crossovers, with many series seeing creative representation that allow them to be more than just a rehash of their plotline. The original characters are among the best SRW has ever had, and the original enemy faction is similarly outstanding. Still have many DLC missions left to go, but as of finishing the game I'd say this is among the best SRW games I've ever played. Highly reccomended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super Robot Wars Y is an Incredible improvement over Super Robot Wars 30 (a low point in the franchise, if you are not familiar with it). Significant mechanical overhauls, better writing, more varied objectives and terrain usage, and really bolting down a lot of the mechanics added over the past few entries make the game much less of a stomp in favor of the player and much more of a, you know, game. All this said; there is room for improvement.\r\n\r\nLet me start off by saying the plot is incredible and I love it. Super Robot Wars has always been about the plot, and Y is a return to form in a big way. A lot of series interconnectivity, and even better treatment of DLC characters puts it leagues ahead. My one minor complaint is that it is sort've a retread of the super robot wars 30 story, but I can respect it as essentially a \"second attempt\" at that plot.\r\n\r\nMechanically, not much has changed, but many of the auxilary systems (skill tree, assists, ExC, etc) have been remodeled and tightened up. No more ExC (so no more zealing your best unit across the map to kill every enemy on turn one), skill tree is much larger and upgrades are much more marginal, and assist crew entries are... pretty much the same, but they were never too bad. Difficulty remains fairly low, even on expert (I beat the entire game on expert, first run, putting no special effort in and only had to stop and think a couple of times; I am Not an SRPG Pro, and this is not a compliment). Difficulty is concentrated in the early game and the very late game, and if you're good at scaling your units well (doesn't take a particularly larg eamount of effort, tbh), the late game probably won't be so bad. Some minor difficulty spikes early on in new chapters, and in general it seems like this problem was, at least partially, a complication of the new (circa SRW 30) mission system, so I do have some sympathy. All this said; still absolutely massively better then SRW 30, which I nearly fell asleep playing several times. No joke.\r\n\r\nAn excellent step up all in all! I dunno if I'd reccomend it to people that aren't big on giant robots, and I don't need to sell it to people already playing super robot wars games, but it's certainly much better then super robot wars 30. Hope to see more improvements in later entries! The game doesn't need to be absurdly difficult, but I would like to have to think about how I'm playing more then like, 20% of the game. Still better then 0%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend this game for veterans of the Super Robot Wars community and new members as well! This game is easy to learn and has a rich story to enjoy when you are not engaged in battle. Highly recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have been playing super robot games since it started in the 90s, and this is by far one of the better ones, the music the gameplay and even the story is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Out of the games that have come out since V. This is probably the best one (including V) in almost all aspects. They have finally fixed the gameplay and properly balanced the units and assists. And remove some of the most oppressive mechanics in the previous game. Like EXC. And the story is also significantly superior, they actually do a incredibly good job a making the series mix together naturally and have the characters and stories properly intertwine with each other which is something srw had been missing for a while. The one complaint I would have which isn't really that much of a serious critique but more of a personal thing is I think the roster of this game is pretty lame. But considering it's used way better than the previous games roster. I can let it pass. Honestly a great start for the international era and steps a thousand steps in the right direction",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Look, even the grinding on this is a blast for me. This game is just a joy for anime nerds.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth it.\r\n\r\nI've been playing SRW games since 2003, and being able to play them on PC and in English is still pretty crazy. \r\n\r\nThe cast list is pretty good, everything is woven together pretty well, and it wraps up plots in a satisfying manner. The animations are great, the music choices are more-or-less good (though you can use your own).\r\n\r\nMy only quibble is that the translation's a little off at points. They use the dub names for the G Gundam units (which might be a Bandai thing), and other times you'll hear English words in the dialogue that aren't used in the text.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 30 years of playing these, I still have fun with it.  Nothing has evolved that much over the years, but I like it all the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, Overall story is great, better than SRW 30. \n\nOnly 2 complaint,   \n- Music customization limited compared to previous SRW (you can only change units BGM, cannot replace all music like in previous SRW)\n- Gundam Witch from Mercury story feel incomplete (since it only include Season 1) & the cast feel like last minute attached to the game, they don't contribute much to the story. Hopefully next SRW will utilize WfM better (plus we really is IBO in SRW as main series, not DLC)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was the longest SRW game I played in my life. For a $100 game, the graphics and art were pretty lackluster. So many reused animations from past entries (which I am not a fan of since this game was released 2-3 years after the last one). The carrying factor would probably be the story line and the amount of hours you can get from thoroughly playing the game. I'd suggest waiting for a sale to purchase the game as there are many other SRW games you can play in the meantime. \r\n\r\nI think this game is worth at most $80 imho. Can't wait to start my second playthrough with the DLC characters (gotta spend some more money urgh).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just likethe other SRW games- a ton of mash-up nonsense and fanservice. The game isn't very challenging on the normal difficulty so I recommend playing harder if you like any challenge. \r\n\r\nIf you are a completionist, I recommend following a guide as some units can be locked out if you don't collect them at certain points. (from what I understand)\r\n\r\nI've seen complaints about the presentation of the game, but if you were expecting anything other than a visual novel experience paired with a simple grid-based srpg, idk what you were expecting. \r\n\r\nThe only con I can really think of is the overall story is kinda boring, and the antagonists don't really have much play between them like the protagonists do. There are some hilarious things the heroes get up to, so that's fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best series so far. solid story line. not bloat, good challenging game\r\n8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is probably the most dense SRW game I've played. It's also really beginner friendly but I would recommend one of the previous games like 30 if you're looking to dip your toes into SRW.\nIf you've already played an SRW or two before then Normal might even be too easy to play on.\n\nThe biggest downside is padding the game out with a huge middle portion filled with jobbers and no clear route to what matters to the overall story even if it's a Main mission.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good starting point for anyone who wants to get into Super Robot Wars. The harder modes could be a bit more creative cause as it is, the harder modes just make it so that the enemy has higher stats and makes it harder for you to upgrade your units essentially just forced difficulty, Expert at least has the player unable to use Ally targeting spirits like the older games but that's the only modifier I actually consider a good challenge.\r\n\r\nFrom my playthrough I can say that SRW Y is a bit more challenging than VXT and 30 but still easier than older entries in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall I had a pleasant experience with SRW Y. It is without a doubt a step in the right direction after SRW 30 which I found to be very disappointing. Still while there are pros, there are also cons, and hopefully the next installment in the series will be even better than SRW Y.\n\nPros:\n\n-Out of the modern SRW games(V, X, T, 30 and Y) SRW Y probably has one of the stronger narratives.\n\n-This is probably the most balanced SRW out of the modern SRW games, with almost every unit and pilot having a use, the system being refined even further than the previous installments, and the assists system improving to a very meaningful degree that basically allows for certain combination of assists to fit your playstyle. \n\nCons:\n\n-The mission select system, while it is improved over the mission select system in SRW 30, it still makes the game needlessly longer than needed, and adds a lot of filler content through side missions and front missions. While an argument can be made that you do not have to do these side missions and front missions. You will be penalized for abandoning them by either missing units, finding yourself lacking funds, and sometimes side missions actually end up being as important as main missions to the narrative. SRW for the most part has had a linear story with occasional branching paths, which would encourage more than one playthrough to see everything you missed the first time around, I hope we go back to that for the future installments.\n\n-The robot models and animations: specifically the newer ones mostly either made for 30 or Y. It is clear that most of these are severely lacking in quality when compared to the ones that were port from V, X and T. A lot of the ones from V are actually from SRW Z3 an even older game. I hope the team goes back to making beautiful animations; like the ones in SRW Z1 and SRW Z2. While some attack animations for the newer robots certainlly look cool due to effects and excellent direction(The OG protagonists for example.) The model of their robot looks blocky and awkward, I am sure if it was animated differently the design would look a lot better. On the other hand other units like the ones from Macross Delta were absolutly the worst, especially when you compare them to attacks from the Macross Series from SRW Z2 and SRW Z3. The animation is by far something they need to improve on and I hope we will see something more impressive in the future releases.\n\n-Lack of choices when it comes to OG Protagonists. Its true that we could choose between two heroes, but they essentially piloted the same robot, and aside from some stylistic and color differences, the only other thing that changed was the animation for one attack. This is very limited especially when compared to SRW Alpha 2 and SRW Alpha 3 where you had four choices of OG Protagonists, two of them would pilot Super Robot Types, while the other two would pilot Real Robot Types and all of these robot choices would be different. Still SRW Y is at least a slight improvement over SRW X, T, and 30 where you had one OG robot and only could choose between two pilots, but SRW V is superior to SRW Y here as it allowed you to choose to get a Super Type or a Real Type midgame.\n\n-While I praised the narrative of SRW Y, it has to be said that taking the same story elements for the OG cast from SRW 30 and copying them to SRW Y, even with making enough changes, is something that I hope doesn't become a trend. There is no need to revisit the story of a young captain, obtaining a mysterious, massive battleship, and have the OG robot pilot vow to protect them. Yes it was done much better in SRW Y than in SRW 30, but that doesn't mean that seeing these same story elements again, after I have just seen them in SRW 30 was a good feeling, if anything it gave me pause and made me not have expectations for the plot, but thankfully the story was much, much better than SRW 30.\n\n-Enemy variety is extremely lacking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already 100% V/X/30/Y achievement \r\nOG series pls port from old game or remake is Ok too =)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So, one more SRW came out after some years and it's great!\n\nI admit, in terms of animations it's not the best, it's roster isn't my favorite, but it's plot is a return to form, this actually feels like a crossover game trying to give every series something to do, even if some are disregarded more than others, even the post plot series get something to do, Combattler V actually gets to contribute and have something about them!\n\nThe characters talk to each other, there are friendships and rivalries among each other, it doesn't feel like some past games where everyone from the same series seemed to only hang out with each other and would only talk about serious matters otherwise during plot events, the DLC missions make this even better.\n\nAs for gameplay, it's same old, the game is easy like usual, sure, hard and expert, particularly expert, are tougher than the average modern SRW at first but once you get good enough units and upgrade them enough, the game stops being hard anyways.\n\nSo, if people are hoping for a tough strategy game...go somewhere else, this game is more about plot and cool animations.\n\nI do wish the DLC sets were already available but the game as it is is already good, i do think DLC missions are pretty fun and worth getting, but man, it sucks having music stuck in DLC...though one can still just put some other songs on anyways.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First SRW game to have Macross in 3 decades and it feels amazing to see it free from legal hell.  Support this game for more Macross in the west and in future SRW titles. The game itself is very solid and enjoyable with a good challenge. \n\nYACK DECULTURE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An eighteen-year-old calling a fourteen-year-old \"Ecchi\".\n\nTruly a mark of a 10/10 game. Absolute cinema.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you like Robots?\nDo you like Anime?\nDo you like Gundam, Macross, Mazinger, Code Geas, and many more?\nDo you like Turn Base Tactic games?\nIf yes to the above, than you probably already bought the game. This game is mecha game dream, and compared to the 30th anniversary game, this is so much better. I havve played VXT in the switch and i guarantee i love this game more than them. Although I admit on a story standpoint i prefer V, but that could also be because it was my first super robot wars game. So there is bias in favoring V's story over this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "From what I can tell the UI is fine. It is simplified but it takes all of the important stats/data that was needed and puts it all on the main screen so you don't have to do multiple click throughs to see what's what. I did not see any missing relevant data.\n\nThe visuals are still good, no issues with them whatsoever (it still has 30 FPS but that's what you're going to get from these types of games unless you want them to literally double their animation time to make it 60). I can say that I'm not a massive fan of some of the character looks but it's w/e, personal preference that does not ruin the experience for me.\n\nIt was easy to learn how to swap out tracks for custom ones as well though the file path is a bit different this time. I do wish that instead of making you put songs into the AppData area for PC they would have just left it in the game install area but it's w/e.\n\nI would definitely recommend buying the deluxe edition and only buying the ultimate edition if you have the money and absolutely want to support them (it comes with a bonus mission that gives more goodies and the sound pack). The deluxe edition comes with the DLCs, area missions, and the pre-order bonus (which was 3 mechs). You can buy the base game if you want to try it out for an hour or two to see if you like it, but I would 100% recommend refunding if you do and upgrading to the deluxe edition which will save you a few bucks on buying things separately and buying it separately, sadly, does not upgrade your game's edition either which is why I recommend refunding them buying the deluxe to upgrade if you wanted to demo the game first (you could also just opt to buy the deluxe instead of refunding if you want to but that is a bigger cash investment for some people).\n\nOverall it's just more Super Robot Wars. If you like the series then it's the same as always and is pretty much a must buy. If you are new to the series then I would probably recommend grabbing a Gameboy Advance emulator and playing the OG series (1 and 2) first so you can see if this is the type of game for you. If you do not like the OG series then you will not like this game either and you might as well save yourself some cash as the SRW series has pretty much never changed it's core formula over the decades and the games have always been a massive time sink too.\n\n\nEdit: Also ignore those people whining about the resolution, it's perfectly fine. Unlike most games, this stuff is hand drawn and animated, that's why the resolution is lower. There is a reason why when anime airs, you get 1080 and if you want higher res you have to pay for that buying the blue ray etc. That crap is expensive af to make. This is an extremely niche game that we are pretty lucky to get all things considered. Asking them to more than double the price of making such a product is absurd, they would only make sense if they doubled their profits as well, obviously, that's not gonna happen so stop asking for something that fiscally does not make sense for them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While the story requires you to know an awful lot of a number of shows to begin with, once you are up to speed its an excellent story. The gameplay is a lot of fun, and the animations are great. If you are a fan of the Mecha genre, this game is for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I gotta say this has been the weakest of the recent 4 installments that we got in English. This was the first SRW game i found myself bored. It feels very lifeless. 30 was amazing and I enjoyed VXT a ton as well. I couldn't put those down. This one I am forcing reasons to keep playing.... The art style was definitely a misstep but not a deal breaker, it just doesn't have the soul or passion the others so far have had. I feel like resources were probably limited to opt for other gotcha/micro games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great intersection between the new mechanics and stellar character writing in Super Robot Wars 30 and the more in depth narrative writing from many previous games.\n\nIt also has a good difficulty balance (though, of course, the game gradually gets easier, as every super robot wars game does).\n\nThe game isn't perfect. There are a few mission archetypes that show up quite a bit, and you'll find yourself fighting the same enemies quite often, but overall, this is a stellar example of a stellar series, that dares to be different while still taking great things that came before.\n\nHonestly, not much more to say here. A great choice for mecha fans, and fans of strategy RPGs, and a must play for Super Robot Wars fans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy SRPGs with fun character talks along with a fun crossover setting. This is the game and series for you. Wish the Mazinkaiser content was better handled and the WfM plot was better done but they nailed the Getter Arc plot along with using Code Geass and CCA in a fun way. Godzilla SP was good too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A return to form. SRW Y is the best of the modern generation, beating out the VTX trilogy and 30 in story, difficulty, and gameplay. So happy with the game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is good, and the story is more intresting since SRW 30. too bad i miss pre-order bonus characters due to money shortage, at least i can play the DLC data too. i hope that the game can gain DLC again with re sale the pre-order bonuses",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been stuck playing this game since it came out and honestly I'm addicted!! If you're a fan of turn base gameplay and love big SUPER MECHS I 100% recommend this game!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is super robot wars game! With revamped ui!\r\nEnough said",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i mean, if you are into it play it. did you get into old super robot content? if yes this is the game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very beautiful, especially the character of the heroine, the ninja. This is something new in the world of robots. Thank you, spuer robot wars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much better than SRW30 it's crazy. But please never include Majestic Prince again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The writing reads like someone’s fanfiction from the 2000s.\nVisual novel character portraits have the dynamism and emotion of an empty water bottle.\nSome combat animations for new units range from “meh” to “Jesus, that’s bad.”\nEven the new music remixes feel somehow “cheaper” than in other Super Robot Wars games.\n\nBut this is Super Robot Wars, and despite all the above, I enjoyed every single second of the game, from the info-dump plagued beginning to the end.\n\n10/10 for me.\nCan’t wait for the DLCs to arrive so I can spend another 130 hours of my finite lifetime here.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I feel the writing is the best of the recent games (VXT and 30) and I enjoyed how they made everything connect together. The combat mechanics are still pretty much the same with some minor changes but I still enjoyed the animations, especially the new units.\r\n\r\nWhile it's weird that the resolution options are limited compared to 30, this game is still a thumbs up from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mecha fans will eat this up. Tons of content, fun storylines, weaves together narratives from different series in fun ways. Lots to unlock and experiment with. Missions (and their setup dialogues) are loooooong, so you'll be playing this one for many hours. I'm on Chapter 2 and feel like I've only scratched the surface.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "way too fking slow for the first 5 chapters, almost exclusively reused materials from VXT30 and very little new enemy variety. the new entries stories unfold in much later chapters causing so much fatigue from just powering through those reused materials. Especially Ginga Kikoutai and L-Gaim's story which we just played through in SRW30. And particularly Macross Delta as a long demanded returning Macross title gets treated so badly with poor animation and crappy story telling; The Witch From Mercury's Season 1 even is incomplete and omitted half of the original storyline of season 1\r\n\r\nLevel design is beyond pathetic, 45 50+ of the same enemy piled in late stages and likely somehting you've already fought 10 times prior to that stage because of hte lack of enemy variety is just so boring. The story overall is not bad, but the tempo of storytelling combined with the really bad and repetitive stage designs make the game sooooooo bland and boring.\r\n\r\nI guess its good if you have not been playing SRW since Z3, but if you are someone who played through vxt30 the amount of NEW stuff you are getting here is pretty meagre",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Let me start with saying I love mechs and I have enjoyed most SRW games that have been translated.\r\n\r\nThis, unfortunately, is just a cash grab to keep the fans placated. If you have played SRW30 then you have already seen over half the content this game has to offer. The rest is unfortunately a combination of their mobile game assets being ported into this game, and new assets that were made with that same mobile game in mind.\r\n\r\nSuper Robot Wars used to be a labour of love for these developers. The pixel animations in older versions having more fluid animations and just more movement in general was a testament to this. This love is gone. This is corpo greed at it's finest. \r\n\r\nI'm sure some will say the game has some good animations tucked away in it, and they may be right. The best attack has to be amazing and flashy to sell the unit in a gacha after all. They should all be good.\r\n\r\nOn a side note, if you played SRW30 to death and didn't bother to change the menu music... welcome back. More of the same! Plus you can't change it. \r\n\r\nAnyways, my final (and heavily opinionated) verdict is this game is not worth it's asking price.\r\nIf you love mechs, get it on a deep discount and enjoy what little new there is. \r\n\r\nOne plus, you can enjoy some nostalgia from VXT at least!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "TLDR: \nBuy this game if there is more than ONE series that you really like in the game, else just wait for the price drop / offer. \nIf not, V and 30 will be better choices.\n\nTBH, I am really excited whenever there is a new title in SRW, I love SRW series so much ever since I played my first SRW series (SRW OG) on my gameboy. \nCan't say that I have played all SRW game, but I have completed all the SRW series that I have access to.\nPersonally like OGMD the most, the animation and experience is still the best for me until today.\n\nWhen SRWY is announced, I was SO excited to PO and see titles like Dunbine, Godzilla, Raideen, Kamen Rider W, Big O, etc featuring in the game,\nBUT, after the game released, I am so disappointed as: \n- The UI sucks \n- The map is way awful to view\n- Art style for SRWY originals are so bad  [ this is more towards a personal taste thing ]\n- Bad control [ I am using a controller ]\n- Fast Forward (deploy, move, action, dialog) used to be REALLY fast, but it's not in this game\n- Kamen Rider W is like a randomly designed character that barely have decent animations\n- Big O, where are the missing attacks? Don't tell me that they lost in a time rift of something\n- Some in-game music / theme are \"modified\" weirdly, taking Witch from Mercury as example, I like the original theme music, but the pitch in this game, it hurts my ears [ I connected to external speakers normally ]\n- Same old Masaki that can't do all the tricks in OGMD, like come on, at least let us have a more grand Akashi buster and Super Nova animation please.\n- Mazinkaiser animation, bad, and \"feel like I have seen this same quality somewhere before\"\n\nDespite the points I dont like, there are still something I like: \n- Design of Ninja skills on robot, they are cool\n- Battle theme of Cross is so cool\n- The new finishing blow animation for some old units are so cool\n- Gundam Wing is so far the unit that has the BEST battle animation IMO\n\nThis is the first SRW game, I don't really feel like I want to read the story, and I have no motivation to even complete my first run. This is really not the quality I am hoping for the amount I paid.\n\nWill there be a day I can see those animation in OGMD appear in any other new SRW titles?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This franchise has reached the point of stagnation that its hard to give entries like these a pass just by having a few QoL improvements. Y is just a better 30 and that's it not exactly something you'd expect after 4 years but that's really it, it won't have any retention due to the very weak cast list and story, the visuals have taken a huge downgrade due to the switch to 3D instead of 2D sprites and the soundtrack is bad because with the implementation of custom tracks and the reselling you DLC sound packs is way easier. Its sad that the gacha tie-in DD has way more interesting things going for it than the mainline titles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll preface this by saying I've played almost every entry in the franchise save a few, mostly from the Masoukishin side of things. I started with SRW3 back when I was a kid and emulating it on ZSNES on my moms work computer after school and have been a superfan ever since. I own soundtracks, models, lots of random plastic crap and was one of the first people to upload footage of the franchise to youtube all the way back in 2008. (https://www.youtube.com/@FlamingGnats) - If you need proof.\n\nAll this is to show that I wanted the game to be great, like I do all of them. Unfortunately, after close to 110 hours I finished it more relieved at it being over than anything else.\n\nIn my opinion the franchise has been on a downward decline since the PS3 era (and arguably even further back in the PSP era), but the most recent entries have shown such a lack of passion that I'm convinced that their windfall in the form of the mobile game has removed any reason for them to care about the main entries outside of releasing them just to show the franchise is technically still alive. \n\nV was good enough but the setting did a lot of the heavy lifting.\nX was middling but at least showed that that leaning too hard into magic focused series does not work.\nT was aggressively mediocre.\n30 was where it started to feel phoned in. Quantity over quality. The UI was atrocious, the mission select killed any cohesiveness to the story, and the originals were dull and uninspired.\n\nY somehow made me wish I was playing any of the previous 4 instead, even if I've already beaten them all twice before. What little good there is gets vastly overshadowed by the bad and the overall laziness of the game. Let's go into more detail.\n\n1. 3-4 units have legitimately impressive animations that I suspect were all done by the one guy left on the team with any actual passion. The majority of the rest are either recycled from VXT30 (which imo were largely bad to begin with) or new and just ugly. Instead of the pixel art of the older games or the gorgeous style of the OG games we get this ugly 3D-2D style that belongs in a G-Generation game and not SRW.\n\n2. The story is awful. They take a promising start with a floating city-state and what that could do in a post-war world and squander it, and the only other high point is when they lean into the Getter Arc story, but that gets overtaken by the nonsensical Godzilla plot. Every time I saw someone say Singular Point I ground my teeth. Godzilla itself only appears in 2 missions at the very end of the game, but you're subjected to paragraphs of technobabble from the anime series that is not interesting in the least.\n\nThe originals are boring, though the idea of ninja robots is novel even if it's already been done way better in the franchise already. Art between the characters varies wildly from decent to amateurish, and to the surprise of noone the enemy faction ends up being 90% AI enemies with very little interesting about them. Gone are the days of the original enemy factions being so cool you looked forward to facing them, or seeming like an actual enemy empire and not 50 guys and 5000 AI controlled bots. We'll never get another Balmar, Insalaum, CHIMERA, etc.\n\n3. The music was unimpressive. Some of the choices they made for the series were bizarre and didn't sound good at all, and the original units got maybe one memorable track out of the bunch. At the risk of beating a dead horse, we used to get unique BGM overriding themes for EVERY MEMBER of the enemy faction. All memorable with a leitmotif that tied them all together. I doubt anyone could tell you which final boss theme is for each boss if you took all of them from VXT30Y, but Untrue Crystal is instantly recognizable. Chimera is instantly recognizable. To the End of the Galaxy is instantly recognizable. Moon Knights is instantly recognizable. \n\n4. The devs heard all the complaints about 30's abominable UI and went way too far in the other direction. It's too minimalist and has no personality, and they crammed portraits into a tiny window during battle for no good reason whatsoever.\n\n5. FOMO DLC and DLC in general for these games is stupid. Want to play through the whole thing at launch? Nah, you gotta wait for the DLC that adds all the stuff they cut out and the REAL ending.\n\nThe game feels cheap, cheaper than 30 which already felt like a cash grab. You can tell they consider the single player games an afterthought because DD prints money for a fraction of the effort. They're relying on too many \"weird\" new series being thrown in that really just don't fit instead of pulling from the many older shows people would love to see return, or even newer actual mecha shows. Majestic Prince sucks.\n\nCall me an elitist or behind the times but these games could be so much more. I'm not gonna say \"don't buy it\" because that won't change anything, if profits fell they'd just stop making single player games entirely and only focus on their gacha slop, plus I'd be a hypocrite. I plan to force myself through the game again once all the DLC is out. I feel like I have to. \n\nIt didn't have to be this way, though. As a great man once asked: \"How does it feel to live long enough to see all your favorite franchises go down in flames?\" \n\nIt doesn't feel great.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "A lot of people forget that this game was delayed which is why Witch from Mercury only has the first season in it. That being said I love a lot of things about this game. UI is a little bare bones but I do not mind that. \n\nEvery character is fleshed out, you see them have discussions in and out of missions that makes them all seem like genuine friends which is amazing. The further the game gets the more it challenges you. \n\nMy main problem is that the game freezes 90% of the time you try to buy something from the store regardless of the amount. In a strategic game like this items and skills are important but if I cant use my money to go get the ones I need because the game keeps freezing then youre screwed for the rest of the game. \n\nUntil that is fixed I cant recommend it for first time players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I was bored and just decided to pick a random game on steam to play. Giant robots seems cool. This game is not worth $60. Its crude menus and lackluster cut scenes are made worse by the insane amount of dialogue between battles. The gameplay is ok, but overall i feel kinda ripped off and it wont let me return the game. Hopefully this review will help someone else avoid wasting $60.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is bad no likes 30th and u guys lies about dls no shin balck getter and others so next time make ur shitty game better ... ty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There hasn't been a good Custom MP3 function in these types of games since the SD Gundam Cross Rays games nor has there been decent cutscene/story since Cross Rays. I DO NOT CARE ABOUT GETTER ROBO OR MAJINKAISER WTF EVER OLD AHH 80 SUPER ROBOT SHIZZLES STOP STARTING EVERY ONE OF THESE GAMES WITH THESE BORING OLD AHH MECHA ANIME AND GIVE US THE ONES WE BOUGHT THESE GAMES FOR.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a complete rip off holy shit lol",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}