{
  "positive": [
    {
      "review": "[u]Pros:[/u]\n+ freedom of building\n+ very fun early game\n+ different win criteria\n[u]Cons:[/u]\n- more like a business sim than school management\n- repetitive gameplay loop fails to entertain after a while\n- clunky UI\n- devs abandoned the game (no more patches, QoL, bugfixes)",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This is the game I have been dreaming of. Something in-depth, quirky, managerial, customizable, intuitive. Honestly, the only thing holding this back from being as worldwide popular as the Sims/My Sims or Rollercoaster Tycoon is the original marketing and bias against non-English games. I felt the same bias when I wanted to explore the workshop but most the items were in Chinese. But that should not stop ANYONE from getting this game. I genuinely love every bit of this from the mix-maxing, to the quirky storylines and caring for the community, to just building some cool school. I am actively working towards a save that is entirely focused on making an architecture trade school essentially, but I haven't discovered eveything there is to offer yet. Again, highly recommend. Truly wish this was more popular than it is.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Let’s School is basically what happens when you think running a school is easy… and then reality drop-kicks you. The game looks cute, but don’t be fooled—your students will test your patience, your teachers will beg for training, and your campus will constantly demand upgrades like it’s never enough.\n\n     Still, it’s ridiculously fun. Building classrooms, decorating the campus, and watching your little troublemakers grow is surprisingly satisfying. Every student has their own personality, which means you’ll deal with everything from lazy sleepers to overachievers who panic over a B+.\n\n      However, it feels like the developers have abandoned this poor child of theirs to chase other projects. It’s a shame, because the game has a ton of potential. I really hope one day it gets some proper DLC to bring the experience to the next level.\n\n      Yeah, some systems get repetitive, and the UI sometimes feels like it’s judging you. But overall, Let’s School is a chaotic, charming management sim that turns school stress into pure entertainment.\n\n      If you’ve ever wanted to run a school without actually crying in real life—this is your chance.\n\n      I love this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite the devs having ceased all work on this game, it still remains very cozy and fun as the day I first bought it. I love the community and work shop mods as they help keep the game fresh while still remaining faithful to the designs.\r\n10/10 experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "constantly i crave more Let's School, please sire may we have more management game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great management game with so many things we have to manage, from what courses student should take, invest in community, to (of course) build your dream school. Wish i'm creative enough for this kind of game, but nevertheless, i'm having fun with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game and all its mechanics and the aesthetic is awesome especially the cool dlc buuuuuuuuuuut HOLY FUCK is the ui/ux the worst god damn shit ive ever seen my god",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Watched a 1st year girl beat up a 3rd year boy in the toilets, good game 8.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[i]Let's School is a surprisingly deep school management sim. At first glance, it looks like a cute, chill game, but nah, it throws you right into some super deep and addictive management stuff. You're the principal, designing the whole campus, hiring teachers, setting up the curriculum, and straight-up dealing with delinquent kids. It covers the whole school life cycle, letting you get that director-strategist feeling. It's a blast overall.[/i]\n\n[h2]The Vibe Check & Modder MVPs[/h2]\n\nHonestly, the game gives off some pretty solid vibes, offering a fun loop of growth and upgrades. But, you hit the nail on the head: the atmosphere is kinda all over the place.\n\nThe supposed \"Japanese atmosphere\" in the vanilla game is, like, barely there. Yeah, the general art style leans East, but it totally lacks the detail and authenticity needed for real immersion. This is where we gotta give a huge shoutout to the modders - they are the real MVPs. Their custom furniture models and Japanese interior packs are what actually level up the immersion, turning a good sim into something truly stylish and legit.\n\n[h2]The Vibe Check & Modder MVPs[/h2]\n\nMy experience with visual fatigue is a critical warning for anyone thinking about buying this. You mentioned that after just 1–2 hours, your eyes get straight-up bloodshot, like Bugs Bunny after an all-nighter.\n\nThis strongly suggests the game has way too bright and high-contrast graphics that you can’t properly fix with the standard in-game settings. When you have to rock blue-light glasses or mess with your monitor's settings just to tone down the contrast, that’s a major UI/color palette fail. The devs seriously need to look into this, because visual discomfort is a huge buzzkill and totally ruins the game’s longevity. :/\n\n[h2]Final Take[/h2]\n\nLet's School is an engaging, deep sim that gives you that sweet satisfaction of building a successful, functioning academic machine. If you gotta be cool with the fact that you need the modding community to get that perfect Japanese aesthetic, and you're willing to take precautions for your eyes against the harsh contrast, then it's a solid way to kill some time. It's the kind of game that leaves you feeling good, despite a few annoying technical snags in the visuals department.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like tycoon games, this is a really well made tycoon game, genuinely had a ton of fun playing it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If these lil shits don't stop bringing frogs into my school",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun and relaxing game! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun once you get the hang of the UI",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wish there were more clubs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak demais",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesfgd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fgngtfrgm,ytweq rd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[u]Pros:[/u]\n+ freedom of building\n+ very fun early game\n+ different win criteria\n[u]Cons:[/u]\n- more like a business sim than school management\n- repetitive gameplay loop fails to entertain after a while\n- clunky UI\n- devs abandoned the game (no more patches, QoL, bugfixes)",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Don't let the cartoonish art style fool you; underneath what might look like a children's game is a surprisingly complicated management game with a lot of moving parts. You set up departments, revise class schedules, plan fieldtrips, research, train, patrol. The children learn according to their abilities, their moods, their schedules, and their teachers, and must pass exams at the end of each semester. They bring contraband and bully each other and have friendships or illness and all of this affects their studies. You build and expand and decorate (although it needs a lot more decor!) and give inspiring or scolding speeches. And while it might sound like a chore, it's not—automated defaults and thoughtful design choices make everything convenient and gamefied. There's so much to do, it's easy to get sucked in once you've got the hang of it. It might be overwhelming at first, however.\r\n\r\nIf you like sim management games like Planet Zoo or Two Point Museum and would like similar but in a very different flavor, I highly recommend Let's School. It's not quite as polished, but the scope of interlocking management features is impressive, while remaining cute and fun.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "If you like management games, this one definitely satisfies the itch. I put 26 hours into the game over a weekend. Learning curve pretty easy. I had one \"year\" where I expanded too fast but was still able to make up for it. I love how easy they make rearranging/placing rooms.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "ive played many school simulators but this one is probably my favourite. i have 100 hours but i am still learning things about this game all the time. i like the rival school system (you can trade with them, get additional uniforms for students or really good teachers), the clubs (you train your different clubs to try and become state champs) and even the janky design of it all. is it perfect? no not at all but i still get a smile when i take a photo with each graduating class :) \n\nwould defs pick this up on sale!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is the game I have been dreaming of. Something in-depth, quirky, managerial, customizable, intuitive. Honestly, the only thing holding this back from being as worldwide popular as the Sims/My Sims or Rollercoaster Tycoon is the original marketing and bias against non-English games. I felt the same bias when I wanted to explore the workshop but most the items were in Chinese. But that should not stop ANYONE from getting this game. I genuinely love every bit of this from the mix-maxing, to the quirky storylines and caring for the community, to just building some cool school. I am actively working towards a save that is entirely focused on making an architecture trade school essentially, but I haven't discovered eveything there is to offer yet. Again, highly recommend. Truly wish this was more popular than it is.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Do I enjoy it? Yes\nWould I recommend it? Yes\nDoes it have issues that could and should have been fixed? Yes\n\nSuperb game, lots and lots of depth to this game and I've spent a few fun days with it, but it has some really stupid issue that should have been fixed before the [b]devs abandoned it[/b].\n\nThis game is riddle with little annoying bugs that should have been fixed. It has a lot of information screens that tell you very little and lacks information screens that you'll be wishing you had.\n\nIt will tell you a room has an error, but that is it. No guidance on what the error is, so you have to guess and hope you work it out.\n\nThen there is the most annoying issue of all, that should have never existed. The game is about designing and running a school, it has objects, fences and bushes. Well the devs forgot to enable any collision on the fences and bushes rendering the functionally useless. The characters walk through fences and bushes as if they don't exist.\n\nIt's a fun game and you'll enjoy the depth, but if you're wanting to build a great looking school, good luck making the character not randomly walk around where you don't want them because the fences do nothing.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "🏫 Incredibly enjoyable, fun, and cute. Great variety in building and environment design. Lots and LOTS of nice little touches (from visuals to features). Clear and convenient management that doesn't require time-consuming guides or wikis. A true gem for fans of the above. Despite minor flaws and tech. bugs (which aren't game-breaking but require some polishing; there are only two devs credited), the offered content will keep you entertained for dozens of hours (and that's just ONE session!) Seasonal changes, room temperatures, cleaning radius, lunch calorie counts, rival schools, student uniform selection, and random staff generation (appearance, stats, specialty). There are many hilarious, important, and interesting moments / events related to the director's life in a casual presentation of economics & education. Great potential for modding and DLC's. Too engaging! Definitely recommended, keep up the good work!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Let' School is an adorable school building simulator:\n\nPros:\n-The most important part: building and organizing your school is fun and easy to use.\n-The lesson planning portion is a fun extra layer.\n-3D models aren't my favs, but I like the general aesthetic of the game and character art.\nCons:\n-Only two choices of afterschool clubs, pop music or basketball. Would love to have more options, especially as your student base expands.\n-Students will occasionally return as teachers, but otherwise once they graduate they disappear into the ether. Would love to have some sort of internal record, but it might be too much of a memory burden.\n-Building ACs is a pain in the butt since the external hvac doesn't count as part of the room.\n-Interactions with other schools can feel kind of basic.\n\nOverall: A very cute pretty fleshed out school simulator game, that really accomplishes what I look for in one of these games. So much room to obsess over, but also the option to keep it simple. Would love to see updates to build off the very good base that's already there.\n\nRating: 9/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game scratched an itch in my brain of all the tycoon games I played growing up, combined with a style that is reminiscent of Two Point Hospital/Campus games. It’s challenging and takes some skills to navigate but all the more rewarding when you succeed and get things right <3\n\nSetting out to make the art school of my dreams once all my artsy students stop bullying everyone and flunking out",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is like a sweet snack version of a sim building game. Everything is very cute, the sounds and colors are refreshing, the mechanics are mostly pretty easily understood and there are just enough annoying bits to make it engaging and rewarding.\r\n\r\nDesigning my first school has been really chill since you can actually just pick up entire rooms and shift them around like legos. You can overrun your with cats by adopting every single feline that is abandoned outside the school gates. I am unsure if all the teachers are chubby bc I made my character chubby or if I need to consider the caloric value of all the stuff sold on campus. There is a song building feature for the music club. At the end of the research tree there is an option for a helipad. This feels cute but it scales up complexity well and is very much a game to vibe with for hours and hours to come. \r\n\r\nFunctionally I have only encountered an occasional bug where I can't click the reprimand button on students, but everything is generally snappy and aesthetically pleasing and it includes some (somewhat limiting) features to automate enrollment and curriculum planning, but I can only completely recommend this game if the idea is interesting to you.\r\n\r\nBtw, while it is a \"school\" sim, it is Japanese school system-style, so it might not be your cup of tea.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "연휴 6일간 55시간을 때려박은 게임. I operated those schools for 55 hours within 6 days :D\n\n건축, 학생 요구달성, 연구 테크, 교사 업그레이드, 부서의 역량 관리, 경쟁 학교와의 거래 등 다방면으로 학교를 관리할 수 있다.\n사소한 번역이 어색한 이슈는 있지만 게임 플레이에는 큰 지장이 없다.\n\n문학과 이공계 분야의 동아리도 있었으면 좋겠다.\nHope they update the clubs for Humanities &Sciences\n\n\n◎ 업적 달성 팁 / Tip for achievement\n\n어려움 모드: 부자 학생으로 시작하게되면 수월하다(도련님관상). 꾸준한 학생 파견으로 돈 및 공적도를 수급하는 것도 필수.\n학생에게서 받는 교육비를 증가하는 관리모듈을 적극 활용해야하며, 특히 식당과 매장이 돈 수급에 큰 도움이 된다.\nHard mode: Restart until to start with rich students(Verdant valley). Do field trips to earn money & contribution points\nUse module to earn more students' tuition. Also cafeteria and school store makes lot amount of money.\n\n학생 수 승리: 모든 입학처에서 학생을 받아내어야 경쟁 학교에게 학생을 빼앗기지 않음. (주변 학교 폐교시키기)\n모든 입학처에서 우위를 점한다면 경쟁 학교는 폐교하게 되며, 비로소 각 입학처에서 최대치의 입학 학생 수를 보장받을 수 있음.\nPopulation Wins: Must accept students from all communities. If you win from all communities, competing schools will be closed, allowing you to get maximum number of students from each communities.\n\n건축 승리: 학교 레벨업을 통한 기이한 광경의 해금이 필요하며, 꾸준한 파견을 통한 공적치의 수급이 레벨업에 도움이 된다.\n또한, 이웃 학교와의 거래로 공적치를 얻기 위해, 일부 입학처를 방치하여 폐교를 방지하는 것도 도움이 된다.\nFacility Win: School level is need to open 'Wonder'. Constant field trips for contribution points helps to level up the school.\nPrevent school closures to trade with schools for contribution points by neglecting some communities.\n\n동아리 승리: ☆가장 도달하기 어려우며 상당한 관리가 필요함☆ (현재 2.4%만이 업적 달성) / THE HARDEST TO ARCHIVE AND NEED AMOUNT OF EFFORT (Only 2.4% of user have this achievement)\n\n우선, 5성급 지망학교의 학생 그리고 모듈(재능상승, 훈련효율 개선)이 필요하다.\nFirst of all, 5 stars aspirations students, and module of increasing students Talent & Practice Progress. \n\n농구부라면 운동계열, 밴드부라면 예술계열 학생이 필요하며, 어느 편을 선택해도 무관하나 필자는 농구부와 운동계열로 진행함.\nIf Basketball Club needs students of sports, if Pop Music Club needs students of arts. I tried as basketball club\n\n동아리 재능의 경우 학생의 교육 정도에 따라 상승하기에, 교육에 따른 능력치 상승이 가장 가파른 5성급 학생을 우선하여야 한다.\n5성급 학생의 1학년을 입학하자마자 동아리에 받아들이고 배치해야한다.(배치된 순간부터 훈련을 시작, 미배치시 훈련 X)\n또한, 고점을 높이고자, 꾸준하게 해당 입학처에 운동 공적치를 투자하고, 체력 및 영감에 영향을 주는 물품을 가게에서 판매한다.\n(재능순으로 학생을 받을 경우, 보통 이미 고점에 도달한 3-4성급 학생의 3학년이 받아들여지게 되는데, 이 경우 단 1년만 훈련을 받게 되기도 하고, 나중에는 5성급 학생의 재능에 추월당하기에 올바른 선택이 아니다.(높은 재능의 3-4성 1-2학년은 괜찮음) )\nDo accept 5 stars aspirations students when they enter the school, and place them into train place(They start train since they have placed). Also, developing their community's talents by contribution points, selling good for physique and creativity is needed.(3rd grade students from low stars aspirations are useless. 1st & 2nd grade students are fine)\n\n첫 지역 1위를 할 경우 훈련 포지션 기능을 개방할 수 있으며, 서로의 포지션은 상성이 존재하고, 포지션 내 5명 학생의 위치에 따라 그 능력치에 보정을 받을 수 있다. 따라서, 이후의 대회에서는 출전한 이후, 첫째, 우위에 설 수 있는 포지션을 파악하고, 둘째, 학생과 위치를 바꿔가며 그 능력치가 최대치가 되도록 배치해야한다. (이러한 포지션을 파악하기 위해서는 대회 이전에 3개 이상의 훈련포지션을 갖추어, 3개 포지션 모두를 미리 설정해두어야 한다.)\nWhen you first awarded the 1st place of legion, the training strategy system opens. Each strategy as type and students get buff by their positions. So, you need to find appropriate strategy against opponent and replace students to get most buff.\n\n모듈을 통한 재능 및 훈련 효율의 개선은 필수이나, 이에 따라 학생의 관리 난이도가 크게 상승한다. 이에 대비하여 높은 관리력의 교사들을 충분하게 갖추는 것은 물론(담당교사), 관리부서를 여럿 연계함으로 학생회에 관리력을 몰아주는 작업이 추후 요구된다.\n(관리부서 - 관리부서 - 관리부서 - 학생회 - 동아리 / 아래의 부서에 관리능력을 지원해줄 수 있다) \nSetting the module is the must thing but huge stress and management requirements are follows. Teachers with high management abilities are needed to place them in classes, multi-hierarchy-linked management departments for assign more management ability to Student Council and clubs have to be followed.\n \n각 동아리실 및 훈련 이벤트장이 위치한 장소를 최대 성급으로 업그레이드(3, 5성)하여 효율을 개선해야한다. 또한, 추후 1군으로 기용할 학생을 가장 훈련효율이 좋은 이벤트장에 미리 배치해야한다.\nUpgrade all club houses and training event spots to maximize efficiency. Make sure to place the students you plan to use on your main team in the most efficient training spots ahead of time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Let’s School is basically what happens when you think running a school is easy… and then reality drop-kicks you. The game looks cute, but don’t be fooled—your students will test your patience, your teachers will beg for training, and your campus will constantly demand upgrades like it’s never enough.\n\n     Still, it’s ridiculously fun. Building classrooms, decorating the campus, and watching your little troublemakers grow is surprisingly satisfying. Every student has their own personality, which means you’ll deal with everything from lazy sleepers to overachievers who panic over a B+.\n\n      However, it feels like the developers have abandoned this poor child of theirs to chase other projects. It’s a shame, because the game has a ton of potential. I really hope one day it gets some proper DLC to bring the experience to the next level.\n\n      Yeah, some systems get repetitive, and the UI sometimes feels like it’s judging you. But overall, Let’s School is a chaotic, charming management sim that turns school stress into pure entertainment.\n\n      If you’ve ever wanted to run a school without actually crying in real life—this is your chance.\n\n      I love this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite the devs having ceased all work on this game, it still remains very cozy and fun as the day I first bought it. I love the community and work shop mods as they help keep the game fresh while still remaining faithful to the designs.\r\n10/10 experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "constantly i crave more Let's School, please sire may we have more management game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great management game with so many things we have to manage, from what courses student should take, invest in community, to (of course) build your dream school. Wish i'm creative enough for this kind of game, but nevertheless, i'm having fun with it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh my lord.... so glad I gave this game a chance (didn't hurt that it was on sale too) AND I WAS SO FUCKING IMMERSED IN IT FOR 13 HRS. It's one of the best management games I had the pleasure of playing so far!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun and takes some alternative routes to classical tycoon games. scheduling classes and teachers is very rewarding if it works out. the options to build the school are very nice and taking into account fire safety, heating, and security are nice additions that keep you on your toes.\n\nhowever, the late game feels a bit chaotic. I get access to classrooms that I never see used (even with having 5 star aspirations getting full marks). The wonders and later sports buildings being prebuilt also takes away from the fun. Crashing down a whole museum in the middle of the school feels like the game suddenly does the work for me. Managing teachers also becomes a chore as I didnt see any incentive of firing teachers. I felt bad for the teachers not being able to trained more (especially the alumni, since it is a fun addition). but just kept hoarding better teachers. \n\noverall had a lot of fun, but having to cater to all aspirations has me not coming back for replay to make a specific art school for example. great work :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "compatible with steamdeck and has a lot of content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So fun to play. I love sim building, and this game bring school sim building so fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Actually, a really good management game my expectation was low, but I was really surprised that the game does a few extra steps more than your basic management game, and after spending 34 hours playing it, I can recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game but there are many things that could be done better. A little love is all that is missing,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Will Update my review after more hours of playtime, but man what a fantastic game so far. Very detailed in gameplay, great replayability, a game so far seemingly something i can sink 50 to 100 hours into. Would recommend for those that enjoy simulation management gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really good management game. Some area needs more tutorial / informations in the help menu but the forum definitly helps. You can freely swap victory conditions during a game and completing one does not force you to start a new game, which is a really good plus. Some menu needs a bit more polish like more informations, staying open when doing something else or more filters but it is still very usable. The artwork is really good and friendly but is not refleted at all byt the Steam banner.\r\nLaunched it with no expectations and stayed for the fun. 22 hours for my first victory and I might play more on the same save to try the other ones (they are not mutually exclusive, more like complementary)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really love this game. Find it really addictive to play. Honestly not usually into management games... for whatever reason. In this one I find there is so much to do that it keeps you going, there's character and quirks in everything and the progression is simple enough. I love the ability to change the time frame of the game (when you make it). I've been playing one long game, on a quick cycle (1 year/7 days) and am really excited to try something longer where I can develop the individual students a little more for the club goal!\r\n\r\nIt's simple enough, with enough redundancy, but not too much, ability to fast forward and pause if needed. \r\n\r\nAll in all a good game. Worth a try if you're on the fence or aren't usually into this genre!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was skeptical about the depth this game could provide but after sinking hours into it there is no end in sight. Good classic fun.\r\n\r\nHighly recommend for any fan of a builder/city sim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first the controls were a little hard to get used to (as with most building games), but they became intuitive and easy to use!  I 100% recommend the game, but the items listed below are suggestions for better QOL.\n\nHaving almost \"completed\" my first play through, here are a few suggestions for the devs:\n\nWonders do not reduce volume based on your selection in the menu.  Headphone users beware.\n\nAuto-expedition and auto-training would be AMAZING.\n\nBuilding can be a little wonky.  Sometimes you have to escape out of everything and then click on the room, and go back into build mode.  You can only move objects in certain build modes.  I've found it frustrating that I'll make a room, then for some reason can't save the changes due to one thing making the room \"unusable\", so I have to back out and it removes everything I've done.\n\nWhile in \"build mode\", anything that you build then remove in that session should be fully refunded.  This really only affects you in the early to mid game, but it is a mild frustration because sometimes you would have to exit build mode to get all your money back, then start again.\n\nIn mid-game, deliquency is a little annoying to deal with.  It would be great if there was an \"auto-deliquency\" option where you can set the left click setting to always \"reprimand\" or \"punish\".  Better yet, it'd be nice if the security cameras would automatically send any idle teachers/guards to the room to take care of the issue for you.\n\nSecurity scanners should just generate a notification and deposit the items into your inventory.  That would be a small QOL update because having to go around to each classroom and then click confirm on a pop-up is a little tedious.\n\nPop-ups for students that are eligible to be expelled if clicked should ideally take you to that student so you have the opportunity to expel them.  I have yet to expel a student, but it would be a nice QOL update.\n\nEnd of year speeches would be great if you could create a speech template, and you can select it without needing to go through it every time.\n\nUpgrading desks in classrooms (from shabby to the desks that take up more space) could potentially be a little quicker/easier... if you are putting in a 4-seater desk, it could auto-delete the other desks that are in that area instead of you needing to delete the desks.\n\nThere's probably some more things, but honestly this is a great game and even though there are some minor things, I would 100% recommend getting the game.\n\nIf there's anything in here that I've somehow missed how to do in the gameplay please let me know, I would greatly appreciate it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, it's fun.\r\nNo, it's not perfect.\r\nYes, it has a few glitches,\r\nNo, it doesn't make the game unplayable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very addictive and fun. If you like building management sims like Theme Hospital or Two Point games this is very similar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best school tycoon game I have ever played. It has a lot of death to it and looks great with a lovely cute art style. It has a good learning curve. It has perfect customization options. I will warn you it is extremely addicting. i can strongly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an absolute knee-slapper of a game.\nIt has been a long time since I've played a builder style game without taking a break to the point of the game not being able to handle the amount of entities on screen since rimworld. \n\nLet's school is a gold standard among the likes of the Two Point series and Prison Architect.\nIt combines the gameplay of both and stands better for it.\n\nI start to lag at about 350 students but that's just the limit of the game, many builder games suffer the same fate.\nI hope Let's School 2 or whatever the sequel could be is made on an engine that it deserves, I could spend hundreds of hours making my school as dense and efficient as possible if that memory cap wasn't being reached.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very entertaining and addicting!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and a great game, specially for them who love playing management games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game and all its mechanics and the aesthetic is awesome especially the cool dlc buuuuuuuuuuut HOLY FUCK is the ui/ux the worst god damn shit ive ever seen my god",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is pretty fun. \r\n\r\nI don't really care for the whole \"make kids be a couple\" or the aspect of it, but it's easily ignoreable by the thousands of other things to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watched a 1st year girl beat up a 3rd year boy in the toilets, good game 8.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 My hero's (Students) will become Acadameias (Graduates that turn into teachers back into my school to rinse and repeat)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game outcompeted Hades 2 for my current hyperfixation. HADES 2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly recommend, it's a wonder how the kids get a frog everyday to school.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[i]Let's School is a surprisingly deep school management sim. At first glance, it looks like a cute, chill game, but nah, it throws you right into some super deep and addictive management stuff. You're the principal, designing the whole campus, hiring teachers, setting up the curriculum, and straight-up dealing with delinquent kids. It covers the whole school life cycle, letting you get that director-strategist feeling. It's a blast overall.[/i]\n\n[h2]The Vibe Check & Modder MVPs[/h2]\n\nHonestly, the game gives off some pretty solid vibes, offering a fun loop of growth and upgrades. But, you hit the nail on the head: the atmosphere is kinda all over the place.\n\nThe supposed \"Japanese atmosphere\" in the vanilla game is, like, barely there. Yeah, the general art style leans East, but it totally lacks the detail and authenticity needed for real immersion. This is where we gotta give a huge shoutout to the modders - they are the real MVPs. Their custom furniture models and Japanese interior packs are what actually level up the immersion, turning a good sim into something truly stylish and legit.\n\n[h2]The Vibe Check & Modder MVPs[/h2]\n\nMy experience with visual fatigue is a critical warning for anyone thinking about buying this. You mentioned that after just 1–2 hours, your eyes get straight-up bloodshot, like Bugs Bunny after an all-nighter.\n\nThis strongly suggests the game has way too bright and high-contrast graphics that you can’t properly fix with the standard in-game settings. When you have to rock blue-light glasses or mess with your monitor's settings just to tone down the contrast, that’s a major UI/color palette fail. The devs seriously need to look into this, because visual discomfort is a huge buzzkill and totally ruins the game’s longevity. :/\n\n[h2]Final Take[/h2]\n\nLet's School is an engaging, deep sim that gives you that sweet satisfaction of building a successful, functioning academic machine. If you gotta be cool with the fact that you need the modding community to get that perfect Japanese aesthetic, and you're willing to take precautions for your eyes against the harsh contrast, then it's a solid way to kill some time. It's the kind of game that leaves you feeling good, despite a few annoying technical snags in the visuals department.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "All my students dress up like Harry Potter without the homophobia and transphobia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can be a bit janky at times but still a very enjoyable game overall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like tycoon games, this is a really well made tycoon game, genuinely had a ton of fun playing it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I binged this game for an entire weekend when I bought it. I had to be pried off the PC.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "good for bulidng and management",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just... Even if you don't like it afterwards, the first few hours are worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If these lil shits don't stop bringing frogs into my school",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and need a lot of time to play lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun and relaxing game! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super fun once you get the hang of the UI",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing, very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and cute",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty addictive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hate my rl school, so make my own school",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool lil calm game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am a god among bureaucrats",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love  it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Satisfying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Updates when?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you can build school",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "wish there were more clubs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak demais",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CUTE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesfgd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fgngtfrgm,ytweq rd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[u]Pros:[/u]\n+ freedom of building\n+ very fun early game\n+ different win criteria\n[u]Cons:[/u]\n- more like a business sim than school management\n- repetitive gameplay loop fails to entertain after a while\n- clunky UI\n- devs abandoned the game (no more patches, QoL, bugfixes)",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Don't let the cartoonish art style fool you; underneath what might look like a children's game is a surprisingly complicated management game with a lot of moving parts. You set up departments, revise class schedules, plan fieldtrips, research, train, patrol. The children learn according to their abilities, their moods, their schedules, and their teachers, and must pass exams at the end of each semester. They bring contraband and bully each other and have friendships or illness and all of this affects their studies. You build and expand and decorate (although it needs a lot more decor!) and give inspiring or scolding speeches. And while it might sound like a chore, it's not—automated defaults and thoughtful design choices make everything convenient and gamefied. There's so much to do, it's easy to get sucked in once you've got the hang of it. It might be overwhelming at first, however.\r\n\r\nIf you like sim management games like Planet Zoo or Two Point Museum and would like similar but in a very different flavor, I highly recommend Let's School. It's not quite as polished, but the scope of interlocking management features is impressive, while remaining cute and fun.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "If you like management games, this one definitely satisfies the itch. I put 26 hours into the game over a weekend. Learning curve pretty easy. I had one \"year\" where I expanded too fast but was still able to make up for it. I love how easy they make rearranging/placing rooms.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "ive played many school simulators but this one is probably my favourite. i have 100 hours but i am still learning things about this game all the time. i like the rival school system (you can trade with them, get additional uniforms for students or really good teachers), the clubs (you train your different clubs to try and become state champs) and even the janky design of it all. is it perfect? no not at all but i still get a smile when i take a photo with each graduating class :) \n\nwould defs pick this up on sale!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This is the game I have been dreaming of. Something in-depth, quirky, managerial, customizable, intuitive. Honestly, the only thing holding this back from being as worldwide popular as the Sims/My Sims or Rollercoaster Tycoon is the original marketing and bias against non-English games. I felt the same bias when I wanted to explore the workshop but most the items were in Chinese. But that should not stop ANYONE from getting this game. I genuinely love every bit of this from the mix-maxing, to the quirky storylines and caring for the community, to just building some cool school. I am actively working towards a save that is entirely focused on making an architecture trade school essentially, but I haven't discovered eveything there is to offer yet. Again, highly recommend. Truly wish this was more popular than it is.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Do I enjoy it? Yes\nWould I recommend it? Yes\nDoes it have issues that could and should have been fixed? Yes\n\nSuperb game, lots and lots of depth to this game and I've spent a few fun days with it, but it has some really stupid issue that should have been fixed before the [b]devs abandoned it[/b].\n\nThis game is riddle with little annoying bugs that should have been fixed. It has a lot of information screens that tell you very little and lacks information screens that you'll be wishing you had.\n\nIt will tell you a room has an error, but that is it. No guidance on what the error is, so you have to guess and hope you work it out.\n\nThen there is the most annoying issue of all, that should have never existed. The game is about designing and running a school, it has objects, fences and bushes. Well the devs forgot to enable any collision on the fences and bushes rendering the functionally useless. The characters walk through fences and bushes as if they don't exist.\n\nIt's a fun game and you'll enjoy the depth, but if you're wanting to build a great looking school, good luck making the character not randomly walk around where you don't want them because the fences do nothing.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "🏫 Incredibly enjoyable, fun, and cute. Great variety in building and environment design. Lots and LOTS of nice little touches (from visuals to features). Clear and convenient management that doesn't require time-consuming guides or wikis. A true gem for fans of the above. Despite minor flaws and tech. bugs (which aren't game-breaking but require some polishing; there are only two devs credited), the offered content will keep you entertained for dozens of hours (and that's just ONE session!) Seasonal changes, room temperatures, cleaning radius, lunch calorie counts, rival schools, student uniform selection, and random staff generation (appearance, stats, specialty). There are many hilarious, important, and interesting moments / events related to the director's life in a casual presentation of economics & education. Great potential for modding and DLC's. Too engaging! Definitely recommended, keep up the good work!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Let' School is an adorable school building simulator:\n\nPros:\n-The most important part: building and organizing your school is fun and easy to use.\n-The lesson planning portion is a fun extra layer.\n-3D models aren't my favs, but I like the general aesthetic of the game and character art.\nCons:\n-Only two choices of afterschool clubs, pop music or basketball. Would love to have more options, especially as your student base expands.\n-Students will occasionally return as teachers, but otherwise once they graduate they disappear into the ether. Would love to have some sort of internal record, but it might be too much of a memory burden.\n-Building ACs is a pain in the butt since the external hvac doesn't count as part of the room.\n-Interactions with other schools can feel kind of basic.\n\nOverall: A very cute pretty fleshed out school simulator game, that really accomplishes what I look for in one of these games. So much room to obsess over, but also the option to keep it simple. Would love to see updates to build off the very good base that's already there.\n\nRating: 9/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game scratched an itch in my brain of all the tycoon games I played growing up, combined with a style that is reminiscent of Two Point Hospital/Campus games. It’s challenging and takes some skills to navigate but all the more rewarding when you succeed and get things right <3\n\nSetting out to make the art school of my dreams once all my artsy students stop bullying everyone and flunking out",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is like a sweet snack version of a sim building game. Everything is very cute, the sounds and colors are refreshing, the mechanics are mostly pretty easily understood and there are just enough annoying bits to make it engaging and rewarding.\r\n\r\nDesigning my first school has been really chill since you can actually just pick up entire rooms and shift them around like legos. You can overrun your with cats by adopting every single feline that is abandoned outside the school gates. I am unsure if all the teachers are chubby bc I made my character chubby or if I need to consider the caloric value of all the stuff sold on campus. There is a song building feature for the music club. At the end of the research tree there is an option for a helipad. This feels cute but it scales up complexity well and is very much a game to vibe with for hours and hours to come. \r\n\r\nFunctionally I have only encountered an occasional bug where I can't click the reprimand button on students, but everything is generally snappy and aesthetically pleasing and it includes some (somewhat limiting) features to automate enrollment and curriculum planning, but I can only completely recommend this game if the idea is interesting to you.\r\n\r\nBtw, while it is a \"school\" sim, it is Japanese school system-style, so it might not be your cup of tea.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "연휴 6일간 55시간을 때려박은 게임. I operated those schools for 55 hours within 6 days :D\n\n건축, 학생 요구달성, 연구 테크, 교사 업그레이드, 부서의 역량 관리, 경쟁 학교와의 거래 등 다방면으로 학교를 관리할 수 있다.\n사소한 번역이 어색한 이슈는 있지만 게임 플레이에는 큰 지장이 없다.\n\n문학과 이공계 분야의 동아리도 있었으면 좋겠다.\nHope they update the clubs for Humanities &Sciences\n\n\n◎ 업적 달성 팁 / Tip for achievement\n\n어려움 모드: 부자 학생으로 시작하게되면 수월하다(도련님관상). 꾸준한 학생 파견으로 돈 및 공적도를 수급하는 것도 필수.\n학생에게서 받는 교육비를 증가하는 관리모듈을 적극 활용해야하며, 특히 식당과 매장이 돈 수급에 큰 도움이 된다.\nHard mode: Restart until to start with rich students(Verdant valley). Do field trips to earn money & contribution points\nUse module to earn more students' tuition. Also cafeteria and school store makes lot amount of money.\n\n학생 수 승리: 모든 입학처에서 학생을 받아내어야 경쟁 학교에게 학생을 빼앗기지 않음. (주변 학교 폐교시키기)\n모든 입학처에서 우위를 점한다면 경쟁 학교는 폐교하게 되며, 비로소 각 입학처에서 최대치의 입학 학생 수를 보장받을 수 있음.\nPopulation Wins: Must accept students from all communities. If you win from all communities, competing schools will be closed, allowing you to get maximum number of students from each communities.\n\n건축 승리: 학교 레벨업을 통한 기이한 광경의 해금이 필요하며, 꾸준한 파견을 통한 공적치의 수급이 레벨업에 도움이 된다.\n또한, 이웃 학교와의 거래로 공적치를 얻기 위해, 일부 입학처를 방치하여 폐교를 방지하는 것도 도움이 된다.\nFacility Win: School level is need to open 'Wonder'. Constant field trips for contribution points helps to level up the school.\nPrevent school closures to trade with schools for contribution points by neglecting some communities.\n\n동아리 승리: ☆가장 도달하기 어려우며 상당한 관리가 필요함☆ (현재 2.4%만이 업적 달성) / THE HARDEST TO ARCHIVE AND NEED AMOUNT OF EFFORT (Only 2.4% of user have this achievement)\n\n우선, 5성급 지망학교의 학생 그리고 모듈(재능상승, 훈련효율 개선)이 필요하다.\nFirst of all, 5 stars aspirations students, and module of increasing students Talent & Practice Progress. \n\n농구부라면 운동계열, 밴드부라면 예술계열 학생이 필요하며, 어느 편을 선택해도 무관하나 필자는 농구부와 운동계열로 진행함.\nIf Basketball Club needs students of sports, if Pop Music Club needs students of arts. I tried as basketball club\n\n동아리 재능의 경우 학생의 교육 정도에 따라 상승하기에, 교육에 따른 능력치 상승이 가장 가파른 5성급 학생을 우선하여야 한다.\n5성급 학생의 1학년을 입학하자마자 동아리에 받아들이고 배치해야한다.(배치된 순간부터 훈련을 시작, 미배치시 훈련 X)\n또한, 고점을 높이고자, 꾸준하게 해당 입학처에 운동 공적치를 투자하고, 체력 및 영감에 영향을 주는 물품을 가게에서 판매한다.\n(재능순으로 학생을 받을 경우, 보통 이미 고점에 도달한 3-4성급 학생의 3학년이 받아들여지게 되는데, 이 경우 단 1년만 훈련을 받게 되기도 하고, 나중에는 5성급 학생의 재능에 추월당하기에 올바른 선택이 아니다.(높은 재능의 3-4성 1-2학년은 괜찮음) )\nDo accept 5 stars aspirations students when they enter the school, and place them into train place(They start train since they have placed). Also, developing their community's talents by contribution points, selling good for physique and creativity is needed.(3rd grade students from low stars aspirations are useless. 1st & 2nd grade students are fine)\n\n첫 지역 1위를 할 경우 훈련 포지션 기능을 개방할 수 있으며, 서로의 포지션은 상성이 존재하고, 포지션 내 5명 학생의 위치에 따라 그 능력치에 보정을 받을 수 있다. 따라서, 이후의 대회에서는 출전한 이후, 첫째, 우위에 설 수 있는 포지션을 파악하고, 둘째, 학생과 위치를 바꿔가며 그 능력치가 최대치가 되도록 배치해야한다. (이러한 포지션을 파악하기 위해서는 대회 이전에 3개 이상의 훈련포지션을 갖추어, 3개 포지션 모두를 미리 설정해두어야 한다.)\nWhen you first awarded the 1st place of legion, the training strategy system opens. Each strategy as type and students get buff by their positions. So, you need to find appropriate strategy against opponent and replace students to get most buff.\n\n모듈을 통한 재능 및 훈련 효율의 개선은 필수이나, 이에 따라 학생의 관리 난이도가 크게 상승한다. 이에 대비하여 높은 관리력의 교사들을 충분하게 갖추는 것은 물론(담당교사), 관리부서를 여럿 연계함으로 학생회에 관리력을 몰아주는 작업이 추후 요구된다.\n(관리부서 - 관리부서 - 관리부서 - 학생회 - 동아리 / 아래의 부서에 관리능력을 지원해줄 수 있다) \nSetting the module is the must thing but huge stress and management requirements are follows. Teachers with high management abilities are needed to place them in classes, multi-hierarchy-linked management departments for assign more management ability to Student Council and clubs have to be followed.\n \n각 동아리실 및 훈련 이벤트장이 위치한 장소를 최대 성급으로 업그레이드(3, 5성)하여 효율을 개선해야한다. 또한, 추후 1군으로 기용할 학생을 가장 훈련효율이 좋은 이벤트장에 미리 배치해야한다.\nUpgrade all club houses and training event spots to maximize efficiency. Make sure to place the students you plan to use on your main team in the most efficient training spots ahead of time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Let’s School is basically what happens when you think running a school is easy… and then reality drop-kicks you. The game looks cute, but don’t be fooled—your students will test your patience, your teachers will beg for training, and your campus will constantly demand upgrades like it’s never enough.\n\n     Still, it’s ridiculously fun. Building classrooms, decorating the campus, and watching your little troublemakers grow is surprisingly satisfying. Every student has their own personality, which means you’ll deal with everything from lazy sleepers to overachievers who panic over a B+.\n\n      However, it feels like the developers have abandoned this poor child of theirs to chase other projects. It’s a shame, because the game has a ton of potential. I really hope one day it gets some proper DLC to bring the experience to the next level.\n\n      Yeah, some systems get repetitive, and the UI sometimes feels like it’s judging you. But overall, Let’s School is a chaotic, charming management sim that turns school stress into pure entertainment.\n\n      If you’ve ever wanted to run a school without actually crying in real life—this is your chance.\n\n      I love this game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite the devs having ceased all work on this game, it still remains very cozy and fun as the day I first bought it. I love the community and work shop mods as they help keep the game fresh while still remaining faithful to the designs.\r\n10/10 experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "constantly i crave more Let's School, please sire may we have more management game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "So sad, this game could be really nice. It feels like a neat managemen simulation of a school. There is a big level of complexity, construction and management.\r\nHowever, the UI/UX is abyssimal. Most of the time you have no idea what influences what. Aside from that there are some terrible design choices. E.g. why is a class always linked to a room? I for one build in advance so I create a new classroom for the upcoming school year. However, that creates a new class that is shown as error (since there are no teachers or students in it). The next year then it gets promoted to grade 2 where as it was only meant for grade one by then.\r\nThis is just one of so many examples which makes the game cluttered and hard to understand. There are many values shown where you just don't have any idea where they are coming from nor what they do. Its basically learning by doing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The UI is not very intuitive, and the tutorial doesn't do a very good job of explaining things. After trying three times (twice in career, once in sandbox) the gameplay feels sluggish and repetitive. Maybe after you get past the first 2-3 weeks of classes it improves, but overall it just wasn't fun. Wish I hadn't played for more than two hours since my refund request was rejected based on playtime. Oh well, at least it was on sale so it wasn't a total waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I received this as a gift and I have absolutely no idea how this game has this positive reviews.\r\n\r\nGranted, I've only gotten 16 minutes into this game, but there's a reason for that:\r\n\r\n- Both the English and German translations are clearly either unreviewed AI/machine translation or created without providing the translators with any context. The German version of \"let's give back to the local community\" is translated literally, ending up as the equivalent of \"let us return items backwards toward the localised group\". It's incomprehensible in most cases. UI translations are messed up and don't fit the context in which they are used. For example, the average employee satisfaction UI element is awkwardly called \"Happiness of the employee\". It's AI or cheap outsourcing nonsense.\r\n\r\n- Text bleeds out of their respective areas and boxes constantly and UI clips into each other. The text of the \"Save and quit\" button in German (\"Speichern und beenden\") is double the length of the button that's supposed to hold it, cutting off on both sides.\r\n\r\n- I think the game should disclose a little more clearly that it's specifically simulating a certain kind of Japanese schools. The entire structure of the game and its school system is based on Japan, which was a disappointment for me as I was looking for a relatively relatable school management tycoon game, and the idea of sex-segregation, school uniforms and such are alien and offputting to me.\r\n\r\n- The art style and writing are so far generic and uninspired, it's very much the kind of dialogue you'd get in a free mobile game trying to make you buy ingame currency 'to speed up construction' or whatnot. You get utterly generic characters like \"Brick the Construction Assistant\" telling you how to use the demolition feature, while you can practically smell that \"Buy 5 gems now or watch an ad to instantly complete demolition!\" that thankfully never comes; it feels like no love or passion went into the game at all.\r\n\r\nEither way, this looks and feels very, very much like a cheap, barely functional, janky mobile game rather than a fully-fledged PC management tycoon.\r\n\r\nWorst of all (as mentioned) the translations – for German especially – are genuinely incomprehensible. Looking into the credits, they were made by some random Chinese company, with no actual translators or localisation QA folks credited by name. It's probably just AI. That's honestly the worst part. It's practically unplayable in German.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this had so much potential but there are so many bugs that developers refuse to fix, there hasn't been an update in over a year",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I actually really like the game. Especially designing the school is a delight.\n\nHowever, one aspect I feel is completely unnecessary and drags the game: Research.\n\nYou NEED to research because you will be required to teach advanced subjects that you need to research, and not just that, but to unlock things such as heating, cleaning, student club, etc. It's a drag on your economy as research requires you to hire staff dedicated to it. Also if you are behind, it basically bombs your game because you can't teach the subjects you need to teach. It's frustrating to deal with.\n\nI genuinely wish this game existed without research. I should just be able to hire teachers with qualifications to teach subjects, or upgrade them with money to teach these subjects. Anything regarding advanced cleaning equipment or kitchen should just be more money. Student club should be something that you need to fulfill requirements for.\n\nThis game would be so much more thematically sensible without research.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't enjoy my time with the game. Terrible UI",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "abandoned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is good, whatever good things people say about this game, it's true. I want to give this a thumbs up, i really do, \n\nbut then i learned that the devs abandoned this game and stated it officially, while there's still bugs and many room for QoL improvement, so, no more bug fixes, no more QoL update. you will play the game as it is, and no, the workshop doesn't help with the bug fix and QoL mod at all.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I played this game for a while now, everything good at the beginning, building a school from scratch, that's include management, facility, hiring and other technical things.\r\n\r\nBut as time went, I found bug by bug, facilities became unreachable after I upgraded the buildings, NPCs randomly stuck in a facility and many more. This game will be good for the chill part but cant satisfied me in optimization and smoothness.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So sad, this game could be really nice. It feels like a neat managemen simulation of a school. There is a big level of complexity, construction and management.\r\nHowever, the UI/UX is abyssimal. Most of the time you have no idea what influences what. Aside from that there are some terrible design choices. E.g. why is a class always linked to a room? I for one build in advance so I create a new classroom for the upcoming school year. However, that creates a new class that is shown as error (since there are no teachers or students in it). The next year then it gets promoted to grade 2 where as it was only meant for grade one by then.\r\nThis is just one of so many examples which makes the game cluttered and hard to understand. There are many values shown where you just don't have any idea where they are coming from nor what they do. Its basically learning by doing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h2] A fun SIM game that went the route of releasing on different consoles before finishing.[/h2]\n[h3] Did have fun with it, but development has stopped, sadly.[/h3]\n\nHad fun, but two dreadful things have seemed to happen:\n- The lead artist had RL medical issues and was unable to continue.\n- Management focused on releasing an unfinished game on multiple consoles.\n\n[b]Artist leaving:[/b]  I hope they are well and its really unfortunate to hear.  I love the artstyle in game.  Maybe in the future they'll be able to return.\n\n[b]Company focus on multi-platform:[/b]  Nope.  [u]Biggest sin of an indie game[/u].  Absolutely nope.\n\nThere are unfinished parts of the game:  \n❌ Only one student interacts with the Student Counsel room.  \n❌ There are only two clubs for Artist and Sports (Humanities and Science missing).  \n❌ There is a noticeable lack of world maps to choose from.\n❌ English translation isn't finished.  Specialist Teacher information boxes have badly translated terms that are ambiguous. \n❌ Doing athletic sports doesn't reduce character weight.  (you'll find out lmao)\n❌ The schoolbell sound 🔊 is going to get REALLY annoying.\n❌ There are two \"Sound Effect\" sliders in Settings, yet neither of those control the school bell independently.\n❌ NPCs don't even use the Training Room.\n❌ Cafeterias need seats for the total population, yet only ~4-8 people are in there at one time.\n❌ Early-Mid game, your biggest money maker is selling candy.  The playground area receives little to no visitors.  The entire student body seems to entertain themselves with candy.  \n❌ Guard station checkpoints are supposed to collect contraband and store in your inventory, but doesn't.\n❌ Student Field trips all seem to be done by foot, despite students commuting via bicycle, bus, metro, cars...  Doesn't make sense that one cannot send a class somewhere by bus.\n❌ When a field trip departs, the students are gone, but the teachers go to their schedule classrooms and teach.  Who is leaving with the kids???\n❌ Sending teachers to Training doesn't remove them from the building.  This is actually helpful as scheduling Teachers to specific classes isn't easy.  Likely, you're more meant to have a pool of teachers available at all times to teach.\n\nThe game feels fun, but it fades after your first playthrough.  On your second run, you're going to feel like you're playing a continuation of the first.  I get a lot of vibes from SimTower from back in the day.  Which isn't a bad thing, the Let's School formula is fun, but needs another year of polishing to really shine.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The UI is not very intuitive, and the tutorial doesn't do a very good job of explaining things. After trying three times (twice in career, once in sandbox) the gameplay feels sluggish and repetitive. Maybe after you get past the first 2-3 weeks of classes it improves, but overall it just wasn't fun. Wish I hadn't played for more than two hours since my refund request was rejected based on playtime. Oh well, at least it was on sale so it wasn't a total waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infuriating in how unpolished many game aspects are, how unclear many game aspects are, and how bugged it is. The writing's lousy, many interactions are frustrating, but overall the game's a decent sim game that'll appeal not only to fans of Two-Point Campus and similar games, but to most (civ, colony, tycoon, etc) simulation fans overall. ..if you're willing to expend the energy to deal with the fact that the dev clearly released the game in an \"expect post-release updates\" state, and never provided those. \r\n\r\nUltimately, your appreciation of the game's going to boil down to your commitment to the genre- I'm going to continue playing the game, despite the annoyances having given me a literal headache, but I just can't recommend the game in general, since the frustrations and weak tutorial are going to run off those unfamiliar with, or less invested in the genre. \r\n\r\nBasically, the same reason I wouldn't recommend the original ascii-form Dwarf Fortress. It's a game a certain niche is going to appreciate, but the frustrations make it not for everyone. And, I mean, at least that game has the excuse of \"this is an intentional design, since I want to focus on simulation development before graphic development\", whereas Let's School.. well, let's just say it graduated a bit too early, and not with flying colors.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not that fun , thought it would be a bit more similar to the two point games based on the demo ,  glad i got this as part of a bundle. its Fine as a dull podcast game i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I received this as a gift and I have absolutely no idea how this game has this positive reviews.\r\n\r\nGranted, I've only gotten 16 minutes into this game, but there's a reason for that:\r\n\r\n- Both the English and German translations are clearly either unreviewed AI/machine translation or created without providing the translators with any context. The German version of \"let's give back to the local community\" is translated literally, ending up as the equivalent of \"let us return items backwards toward the localised group\". It's incomprehensible in most cases. UI translations are messed up and don't fit the context in which they are used. For example, the average employee satisfaction UI element is awkwardly called \"Happiness of the employee\". It's AI or cheap outsourcing nonsense.\r\n\r\n- Text bleeds out of their respective areas and boxes constantly and UI clips into each other. The text of the \"Save and quit\" button in German (\"Speichern und beenden\") is double the length of the button that's supposed to hold it, cutting off on both sides.\r\n\r\n- I think the game should disclose a little more clearly that it's specifically simulating a certain kind of Japanese schools. The entire structure of the game and its school system is based on Japan, which was a disappointment for me as I was looking for a relatively relatable school management tycoon game, and the idea of sex-segregation, school uniforms and such are alien and offputting to me.\r\n\r\n- The art style and writing are so far generic and uninspired, it's very much the kind of dialogue you'd get in a free mobile game trying to make you buy ingame currency 'to speed up construction' or whatnot. You get utterly generic characters like \"Brick the Construction Assistant\" telling you how to use the demolition feature, while you can practically smell that \"Buy 5 gems now or watch an ad to instantly complete demolition!\" that thankfully never comes; it feels like no love or passion went into the game at all.\r\n\r\nEither way, this looks and feels very, very much like a cheap, barely functional, janky mobile game rather than a fully-fledged PC management tycoon.\r\n\r\nWorst of all (as mentioned) the translations – for German especially – are genuinely incomprehensible. Looking into the credits, they were made by some random Chinese company, with no actual translators or localisation QA folks credited by name. It's probably just AI. That's honestly the worst part. It's practically unplayable in German.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is really good, i really love it, until I realized that I couldn't get 4 achievements, namely population win, facility win, club victory and teaching win in one playthrough, it was very stupid, I had spent a lot of time to achieve all of that, and I only got one, I had to repeat it again to get 3 other achievements and had to use tricks to get the remaining 3 achievements. Why wasn't there a notice that each achievement could only be obtained in one playthrough, waste my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fantastic! However, if you expect new contents, do NOT download the game. It has been abandoned.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this had so much potential but there are so many bugs that developers refuse to fix, there hasn't been an update in over a year",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☑ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☐ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I actually really like the game. Especially designing the school is a delight.\n\nHowever, one aspect I feel is completely unnecessary and drags the game: Research.\n\nYou NEED to research because you will be required to teach advanced subjects that you need to research, and not just that, but to unlock things such as heating, cleaning, student club, etc. It's a drag on your economy as research requires you to hire staff dedicated to it. Also if you are behind, it basically bombs your game because you can't teach the subjects you need to teach. It's frustrating to deal with.\n\nI genuinely wish this game existed without research. I should just be able to hire teachers with qualifications to teach subjects, or upgrade them with money to teach these subjects. Anything regarding advanced cleaning equipment or kitchen should just be more money. Student club should be something that you need to fulfill requirements for.\n\nThis game would be so much more thematically sensible without research.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't enjoy my time with the game. Terrible UI",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TOO MANY BUGS AND TOO MANY YEARS TO NOT TO PATCH IT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "abandoned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is good, whatever good things people say about this game, it's true. I want to give this a thumbs up, i really do, \n\nbut then i learned that the devs abandoned this game and stated it officially, while there's still bugs and many room for QoL improvement, so, no more bug fixes, no more QoL update. you will play the game as it is, and no, the workshop doesn't help with the bug fix and QoL mod at all.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I played this game for a while now, everything good at the beginning, building a school from scratch, that's include management, facility, hiring and other technical things.\r\n\r\nBut as time went, I found bug by bug, facilities became unreachable after I upgraded the buildings, NPCs randomly stuck in a facility and many more. This game will be good for the chill part but cant satisfied me in optimization and smoothness.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So sad, this game could be really nice. It feels like a neat managemen simulation of a school. There is a big level of complexity, construction and management.\r\nHowever, the UI/UX is abyssimal. Most of the time you have no idea what influences what. Aside from that there are some terrible design choices. E.g. why is a class always linked to a room? I for one build in advance so I create a new classroom for the upcoming school year. However, that creates a new class that is shown as error (since there are no teachers or students in it). The next year then it gets promoted to grade 2 where as it was only meant for grade one by then.\r\nThis is just one of so many examples which makes the game cluttered and hard to understand. There are many values shown where you just don't have any idea where they are coming from nor what they do. Its basically learning by doing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h2] A fun SIM game that went the route of releasing on different consoles before finishing.[/h2]\n[h3] Did have fun with it, but development has stopped, sadly.[/h3]\n\nHad fun, but two dreadful things have seemed to happen:\n- The lead artist had RL medical issues and was unable to continue.\n- Management focused on releasing an unfinished game on multiple consoles.\n\n[b]Artist leaving:[/b]  I hope they are well and its really unfortunate to hear.  I love the artstyle in game.  Maybe in the future they'll be able to return.\n\n[b]Company focus on multi-platform:[/b]  Nope.  [u]Biggest sin of an indie game[/u].  Absolutely nope.\n\nThere are unfinished parts of the game:  \n❌ Only one student interacts with the Student Counsel room.  \n❌ There are only two clubs for Artist and Sports (Humanities and Science missing).  \n❌ There is a noticeable lack of world maps to choose from.\n❌ English translation isn't finished.  Specialist Teacher information boxes have badly translated terms that are ambiguous. \n❌ Doing athletic sports doesn't reduce character weight.  (you'll find out lmao)\n❌ The schoolbell sound 🔊 is going to get REALLY annoying.\n❌ There are two \"Sound Effect\" sliders in Settings, yet neither of those control the school bell independently.\n❌ NPCs don't even use the Training Room.\n❌ Cafeterias need seats for the total population, yet only ~4-8 people are in there at one time.\n❌ Early-Mid game, your biggest money maker is selling candy.  The playground area receives little to no visitors.  The entire student body seems to entertain themselves with candy.  \n❌ Guard station checkpoints are supposed to collect contraband and store in your inventory, but doesn't.\n❌ Student Field trips all seem to be done by foot, despite students commuting via bicycle, bus, metro, cars...  Doesn't make sense that one cannot send a class somewhere by bus.\n❌ When a field trip departs, the students are gone, but the teachers go to their schedule classrooms and teach.  Who is leaving with the kids???\n❌ Sending teachers to Training doesn't remove them from the building.  This is actually helpful as scheduling Teachers to specific classes isn't easy.  Likely, you're more meant to have a pool of teachers available at all times to teach.\n\nThe game feels fun, but it fades after your first playthrough.  On your second run, you're going to feel like you're playing a continuation of the first.  I get a lot of vibes from SimTower from back in the day.  Which isn't a bad thing, the Let's School formula is fun, but needs another year of polishing to really shine.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The UI is not very intuitive, and the tutorial doesn't do a very good job of explaining things. After trying three times (twice in career, once in sandbox) the gameplay feels sluggish and repetitive. Maybe after you get past the first 2-3 weeks of classes it improves, but overall it just wasn't fun. Wish I hadn't played for more than two hours since my refund request was rejected based on playtime. Oh well, at least it was on sale so it wasn't a total waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infuriating in how unpolished many game aspects are, how unclear many game aspects are, and how bugged it is. The writing's lousy, many interactions are frustrating, but overall the game's a decent sim game that'll appeal not only to fans of Two-Point Campus and similar games, but to most (civ, colony, tycoon, etc) simulation fans overall. ..if you're willing to expend the energy to deal with the fact that the dev clearly released the game in an \"expect post-release updates\" state, and never provided those. \r\n\r\nUltimately, your appreciation of the game's going to boil down to your commitment to the genre- I'm going to continue playing the game, despite the annoyances having given me a literal headache, but I just can't recommend the game in general, since the frustrations and weak tutorial are going to run off those unfamiliar with, or less invested in the genre. \r\n\r\nBasically, the same reason I wouldn't recommend the original ascii-form Dwarf Fortress. It's a game a certain niche is going to appreciate, but the frustrations make it not for everyone. And, I mean, at least that game has the excuse of \"this is an intentional design, since I want to focus on simulation development before graphic development\", whereas Let's School.. well, let's just say it graduated a bit too early, and not with flying colors.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not that fun , thought it would be a bit more similar to the two point games based on the demo ,  glad i got this as part of a bundle. its Fine as a dull podcast game i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I received this as a gift and I have absolutely no idea how this game has this positive reviews.\r\n\r\nGranted, I've only gotten 16 minutes into this game, but there's a reason for that:\r\n\r\n- Both the English and German translations are clearly either unreviewed AI/machine translation or created without providing the translators with any context. The German version of \"let's give back to the local community\" is translated literally, ending up as the equivalent of \"let us return items backwards toward the localised group\". It's incomprehensible in most cases. UI translations are messed up and don't fit the context in which they are used. For example, the average employee satisfaction UI element is awkwardly called \"Happiness of the employee\". It's AI or cheap outsourcing nonsense.\r\n\r\n- Text bleeds out of their respective areas and boxes constantly and UI clips into each other. The text of the \"Save and quit\" button in German (\"Speichern und beenden\") is double the length of the button that's supposed to hold it, cutting off on both sides.\r\n\r\n- I think the game should disclose a little more clearly that it's specifically simulating a certain kind of Japanese schools. The entire structure of the game and its school system is based on Japan, which was a disappointment for me as I was looking for a relatively relatable school management tycoon game, and the idea of sex-segregation, school uniforms and such are alien and offputting to me.\r\n\r\n- The art style and writing are so far generic and uninspired, it's very much the kind of dialogue you'd get in a free mobile game trying to make you buy ingame currency 'to speed up construction' or whatnot. You get utterly generic characters like \"Brick the Construction Assistant\" telling you how to use the demolition feature, while you can practically smell that \"Buy 5 gems now or watch an ad to instantly complete demolition!\" that thankfully never comes; it feels like no love or passion went into the game at all.\r\n\r\nEither way, this looks and feels very, very much like a cheap, barely functional, janky mobile game rather than a fully-fledged PC management tycoon.\r\n\r\nWorst of all (as mentioned) the translations – for German especially – are genuinely incomprehensible. Looking into the credits, they were made by some random Chinese company, with no actual translators or localisation QA folks credited by name. It's probably just AI. That's honestly the worst part. It's practically unplayable in German.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is really good, i really love it, until I realized that I couldn't get 4 achievements, namely population win, facility win, club victory and teaching win in one playthrough, it was very stupid, I had spent a lot of time to achieve all of that, and I only got one, I had to repeat it again to get 3 other achievements and had to use tricks to get the remaining 3 achievements. Why wasn't there a notice that each achievement could only be obtained in one playthrough, waste my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fantastic! However, if you expect new contents, do NOT download the game. It has been abandoned.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this had so much potential but there are so many bugs that developers refuse to fix, there hasn't been an update in over a year",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☑ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☐ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I actually really like the game. Especially designing the school is a delight.\n\nHowever, one aspect I feel is completely unnecessary and drags the game: Research.\n\nYou NEED to research because you will be required to teach advanced subjects that you need to research, and not just that, but to unlock things such as heating, cleaning, student club, etc. It's a drag on your economy as research requires you to hire staff dedicated to it. Also if you are behind, it basically bombs your game because you can't teach the subjects you need to teach. It's frustrating to deal with.\n\nI genuinely wish this game existed without research. I should just be able to hire teachers with qualifications to teach subjects, or upgrade them with money to teach these subjects. Anything regarding advanced cleaning equipment or kitchen should just be more money. Student club should be something that you need to fulfill requirements for.\n\nThis game would be so much more thematically sensible without research.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't enjoy my time with the game. Terrible UI",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TOO MANY BUGS AND TOO MANY YEARS TO NOT TO PATCH IT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "abandoned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is good, whatever good things people say about this game, it's true. I want to give this a thumbs up, i really do, \n\nbut then i learned that the devs abandoned this game and stated it officially, while there's still bugs and many room for QoL improvement, so, no more bug fixes, no more QoL update. you will play the game as it is, and no, the workshop doesn't help with the bug fix and QoL mod at all.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I played this game for a while now, everything good at the beginning, building a school from scratch, that's include management, facility, hiring and other technical things.\r\n\r\nBut as time went, I found bug by bug, facilities became unreachable after I upgraded the buildings, NPCs randomly stuck in a facility and many more. This game will be good for the chill part but cant satisfied me in optimization and smoothness.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So sad, this game could be really nice. It feels like a neat managemen simulation of a school. There is a big level of complexity, construction and management.\r\nHowever, the UI/UX is abyssimal. Most of the time you have no idea what influences what. Aside from that there are some terrible design choices. E.g. why is a class always linked to a room? I for one build in advance so I create a new classroom for the upcoming school year. However, that creates a new class that is shown as error (since there are no teachers or students in it). The next year then it gets promoted to grade 2 where as it was only meant for grade one by then.\r\nThis is just one of so many examples which makes the game cluttered and hard to understand. There are many values shown where you just don't have any idea where they are coming from nor what they do. Its basically learning by doing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h2] A fun SIM game that went the route of releasing on different consoles before finishing.[/h2]\n[h3] Did have fun with it, but development has stopped, sadly.[/h3]\n\nHad fun, but two dreadful things have seemed to happen:\n- The lead artist had RL medical issues and was unable to continue.\n- Management focused on releasing an unfinished game on multiple consoles.\n\n[b]Artist leaving:[/b]  I hope they are well and its really unfortunate to hear.  I love the artstyle in game.  Maybe in the future they'll be able to return.\n\n[b]Company focus on multi-platform:[/b]  Nope.  [u]Biggest sin of an indie game[/u].  Absolutely nope.\n\nThere are unfinished parts of the game:  \n❌ Only one student interacts with the Student Counsel room.  \n❌ There are only two clubs for Artist and Sports (Humanities and Science missing).  \n❌ There is a noticeable lack of world maps to choose from.\n❌ English translation isn't finished.  Specialist Teacher information boxes have badly translated terms that are ambiguous. \n❌ Doing athletic sports doesn't reduce character weight.  (you'll find out lmao)\n❌ The schoolbell sound 🔊 is going to get REALLY annoying.\n❌ There are two \"Sound Effect\" sliders in Settings, yet neither of those control the school bell independently.\n❌ NPCs don't even use the Training Room.\n❌ Cafeterias need seats for the total population, yet only ~4-8 people are in there at one time.\n❌ Early-Mid game, your biggest money maker is selling candy.  The playground area receives little to no visitors.  The entire student body seems to entertain themselves with candy.  \n❌ Guard station checkpoints are supposed to collect contraband and store in your inventory, but doesn't.\n❌ Student Field trips all seem to be done by foot, despite students commuting via bicycle, bus, metro, cars...  Doesn't make sense that one cannot send a class somewhere by bus.\n❌ When a field trip departs, the students are gone, but the teachers go to their schedule classrooms and teach.  Who is leaving with the kids???\n❌ Sending teachers to Training doesn't remove them from the building.  This is actually helpful as scheduling Teachers to specific classes isn't easy.  Likely, you're more meant to have a pool of teachers available at all times to teach.\n\nThe game feels fun, but it fades after your first playthrough.  On your second run, you're going to feel like you're playing a continuation of the first.  I get a lot of vibes from SimTower from back in the day.  Which isn't a bad thing, the Let's School formula is fun, but needs another year of polishing to really shine.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The UI is not very intuitive, and the tutorial doesn't do a very good job of explaining things. After trying three times (twice in career, once in sandbox) the gameplay feels sluggish and repetitive. Maybe after you get past the first 2-3 weeks of classes it improves, but overall it just wasn't fun. Wish I hadn't played for more than two hours since my refund request was rejected based on playtime. Oh well, at least it was on sale so it wasn't a total waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infuriating in how unpolished many game aspects are, how unclear many game aspects are, and how bugged it is. The writing's lousy, many interactions are frustrating, but overall the game's a decent sim game that'll appeal not only to fans of Two-Point Campus and similar games, but to most (civ, colony, tycoon, etc) simulation fans overall. ..if you're willing to expend the energy to deal with the fact that the dev clearly released the game in an \"expect post-release updates\" state, and never provided those. \r\n\r\nUltimately, your appreciation of the game's going to boil down to your commitment to the genre- I'm going to continue playing the game, despite the annoyances having given me a literal headache, but I just can't recommend the game in general, since the frustrations and weak tutorial are going to run off those unfamiliar with, or less invested in the genre. \r\n\r\nBasically, the same reason I wouldn't recommend the original ascii-form Dwarf Fortress. It's a game a certain niche is going to appreciate, but the frustrations make it not for everyone. And, I mean, at least that game has the excuse of \"this is an intentional design, since I want to focus on simulation development before graphic development\", whereas Let's School.. well, let's just say it graduated a bit too early, and not with flying colors.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not that fun , thought it would be a bit more similar to the two point games based on the demo ,  glad i got this as part of a bundle. its Fine as a dull podcast game i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I received this as a gift and I have absolutely no idea how this game has this positive reviews.\r\n\r\nGranted, I've only gotten 16 minutes into this game, but there's a reason for that:\r\n\r\n- Both the English and German translations are clearly either unreviewed AI/machine translation or created without providing the translators with any context. The German version of \"let's give back to the local community\" is translated literally, ending up as the equivalent of \"let us return items backwards toward the localised group\". It's incomprehensible in most cases. UI translations are messed up and don't fit the context in which they are used. For example, the average employee satisfaction UI element is awkwardly called \"Happiness of the employee\". It's AI or cheap outsourcing nonsense.\r\n\r\n- Text bleeds out of their respective areas and boxes constantly and UI clips into each other. The text of the \"Save and quit\" button in German (\"Speichern und beenden\") is double the length of the button that's supposed to hold it, cutting off on both sides.\r\n\r\n- I think the game should disclose a little more clearly that it's specifically simulating a certain kind of Japanese schools. The entire structure of the game and its school system is based on Japan, which was a disappointment for me as I was looking for a relatively relatable school management tycoon game, and the idea of sex-segregation, school uniforms and such are alien and offputting to me.\r\n\r\n- The art style and writing are so far generic and uninspired, it's very much the kind of dialogue you'd get in a free mobile game trying to make you buy ingame currency 'to speed up construction' or whatnot. You get utterly generic characters like \"Brick the Construction Assistant\" telling you how to use the demolition feature, while you can practically smell that \"Buy 5 gems now or watch an ad to instantly complete demolition!\" that thankfully never comes; it feels like no love or passion went into the game at all.\r\n\r\nEither way, this looks and feels very, very much like a cheap, barely functional, janky mobile game rather than a fully-fledged PC management tycoon.\r\n\r\nWorst of all (as mentioned) the translations – for German especially – are genuinely incomprehensible. Looking into the credits, they were made by some random Chinese company, with no actual translators or localisation QA folks credited by name. It's probably just AI. That's honestly the worst part. It's practically unplayable in German.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is really good, i really love it, until I realized that I couldn't get 4 achievements, namely population win, facility win, club victory and teaching win in one playthrough, it was very stupid, I had spent a lot of time to achieve all of that, and I only got one, I had to repeat it again to get 3 other achievements and had to use tricks to get the remaining 3 achievements. Why wasn't there a notice that each achievement could only be obtained in one playthrough, waste my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fantastic! However, if you expect new contents, do NOT download the game. It has been abandoned.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this had so much potential but there are so many bugs that developers refuse to fix, there hasn't been an update in over a year",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☑ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☐ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I actually really like the game. Especially designing the school is a delight.\n\nHowever, one aspect I feel is completely unnecessary and drags the game: Research.\n\nYou NEED to research because you will be required to teach advanced subjects that you need to research, and not just that, but to unlock things such as heating, cleaning, student club, etc. It's a drag on your economy as research requires you to hire staff dedicated to it. Also if you are behind, it basically bombs your game because you can't teach the subjects you need to teach. It's frustrating to deal with.\n\nI genuinely wish this game existed without research. I should just be able to hire teachers with qualifications to teach subjects, or upgrade them with money to teach these subjects. Anything regarding advanced cleaning equipment or kitchen should just be more money. Student club should be something that you need to fulfill requirements for.\n\nThis game would be so much more thematically sensible without research.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't enjoy my time with the game. Terrible UI",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TOO MANY BUGS AND TOO MANY YEARS TO NOT TO PATCH IT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "abandoned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is good, whatever good things people say about this game, it's true. I want to give this a thumbs up, i really do, \n\nbut then i learned that the devs abandoned this game and stated it officially, while there's still bugs and many room for QoL improvement, so, no more bug fixes, no more QoL update. you will play the game as it is, and no, the workshop doesn't help with the bug fix and QoL mod at all.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I played this game for a while now, everything good at the beginning, building a school from scratch, that's include management, facility, hiring and other technical things.\r\n\r\nBut as time went, I found bug by bug, facilities became unreachable after I upgraded the buildings, NPCs randomly stuck in a facility and many more. This game will be good for the chill part but cant satisfied me in optimization and smoothness.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So sad, this game could be really nice. It feels like a neat managemen simulation of a school. There is a big level of complexity, construction and management.\r\nHowever, the UI/UX is abyssimal. Most of the time you have no idea what influences what. Aside from that there are some terrible design choices. E.g. why is a class always linked to a room? I for one build in advance so I create a new classroom for the upcoming school year. However, that creates a new class that is shown as error (since there are no teachers or students in it). The next year then it gets promoted to grade 2 where as it was only meant for grade one by then.\r\nThis is just one of so many examples which makes the game cluttered and hard to understand. There are many values shown where you just don't have any idea where they are coming from nor what they do. Its basically learning by doing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h2] A fun SIM game that went the route of releasing on different consoles before finishing.[/h2]\n[h3] Did have fun with it, but development has stopped, sadly.[/h3]\n\nHad fun, but two dreadful things have seemed to happen:\n- The lead artist had RL medical issues and was unable to continue.\n- Management focused on releasing an unfinished game on multiple consoles.\n\n[b]Artist leaving:[/b]  I hope they are well and its really unfortunate to hear.  I love the artstyle in game.  Maybe in the future they'll be able to return.\n\n[b]Company focus on multi-platform:[/b]  Nope.  [u]Biggest sin of an indie game[/u].  Absolutely nope.\n\nThere are unfinished parts of the game:  \n❌ Only one student interacts with the Student Counsel room.  \n❌ There are only two clubs for Artist and Sports (Humanities and Science missing).  \n❌ There is a noticeable lack of world maps to choose from.\n❌ English translation isn't finished.  Specialist Teacher information boxes have badly translated terms that are ambiguous. \n❌ Doing athletic sports doesn't reduce character weight.  (you'll find out lmao)\n❌ The schoolbell sound 🔊 is going to get REALLY annoying.\n❌ There are two \"Sound Effect\" sliders in Settings, yet neither of those control the school bell independently.\n❌ NPCs don't even use the Training Room.\n❌ Cafeterias need seats for the total population, yet only ~4-8 people are in there at one time.\n❌ Early-Mid game, your biggest money maker is selling candy.  The playground area receives little to no visitors.  The entire student body seems to entertain themselves with candy.  \n❌ Guard station checkpoints are supposed to collect contraband and store in your inventory, but doesn't.\n❌ Student Field trips all seem to be done by foot, despite students commuting via bicycle, bus, metro, cars...  Doesn't make sense that one cannot send a class somewhere by bus.\n❌ When a field trip departs, the students are gone, but the teachers go to their schedule classrooms and teach.  Who is leaving with the kids???\n❌ Sending teachers to Training doesn't remove them from the building.  This is actually helpful as scheduling Teachers to specific classes isn't easy.  Likely, you're more meant to have a pool of teachers available at all times to teach.\n\nThe game feels fun, but it fades after your first playthrough.  On your second run, you're going to feel like you're playing a continuation of the first.  I get a lot of vibes from SimTower from back in the day.  Which isn't a bad thing, the Let's School formula is fun, but needs another year of polishing to really shine.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The UI is not very intuitive, and the tutorial doesn't do a very good job of explaining things. After trying three times (twice in career, once in sandbox) the gameplay feels sluggish and repetitive. Maybe after you get past the first 2-3 weeks of classes it improves, but overall it just wasn't fun. Wish I hadn't played for more than two hours since my refund request was rejected based on playtime. Oh well, at least it was on sale so it wasn't a total waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infuriating in how unpolished many game aspects are, how unclear many game aspects are, and how bugged it is. The writing's lousy, many interactions are frustrating, but overall the game's a decent sim game that'll appeal not only to fans of Two-Point Campus and similar games, but to most (civ, colony, tycoon, etc) simulation fans overall. ..if you're willing to expend the energy to deal with the fact that the dev clearly released the game in an \"expect post-release updates\" state, and never provided those. \r\n\r\nUltimately, your appreciation of the game's going to boil down to your commitment to the genre- I'm going to continue playing the game, despite the annoyances having given me a literal headache, but I just can't recommend the game in general, since the frustrations and weak tutorial are going to run off those unfamiliar with, or less invested in the genre. \r\n\r\nBasically, the same reason I wouldn't recommend the original ascii-form Dwarf Fortress. It's a game a certain niche is going to appreciate, but the frustrations make it not for everyone. And, I mean, at least that game has the excuse of \"this is an intentional design, since I want to focus on simulation development before graphic development\", whereas Let's School.. well, let's just say it graduated a bit too early, and not with flying colors.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not that fun , thought it would be a bit more similar to the two point games based on the demo ,  glad i got this as part of a bundle. its Fine as a dull podcast game i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I received this as a gift and I have absolutely no idea how this game has this positive reviews.\r\n\r\nGranted, I've only gotten 16 minutes into this game, but there's a reason for that:\r\n\r\n- Both the English and German translations are clearly either unreviewed AI/machine translation or created without providing the translators with any context. The German version of \"let's give back to the local community\" is translated literally, ending up as the equivalent of \"let us return items backwards toward the localised group\". It's incomprehensible in most cases. UI translations are messed up and don't fit the context in which they are used. For example, the average employee satisfaction UI element is awkwardly called \"Happiness of the employee\". It's AI or cheap outsourcing nonsense.\r\n\r\n- Text bleeds out of their respective areas and boxes constantly and UI clips into each other. The text of the \"Save and quit\" button in German (\"Speichern und beenden\") is double the length of the button that's supposed to hold it, cutting off on both sides.\r\n\r\n- I think the game should disclose a little more clearly that it's specifically simulating a certain kind of Japanese schools. The entire structure of the game and its school system is based on Japan, which was a disappointment for me as I was looking for a relatively relatable school management tycoon game, and the idea of sex-segregation, school uniforms and such are alien and offputting to me.\r\n\r\n- The art style and writing are so far generic and uninspired, it's very much the kind of dialogue you'd get in a free mobile game trying to make you buy ingame currency 'to speed up construction' or whatnot. You get utterly generic characters like \"Brick the Construction Assistant\" telling you how to use the demolition feature, while you can practically smell that \"Buy 5 gems now or watch an ad to instantly complete demolition!\" that thankfully never comes; it feels like no love or passion went into the game at all.\r\n\r\nEither way, this looks and feels very, very much like a cheap, barely functional, janky mobile game rather than a fully-fledged PC management tycoon.\r\n\r\nWorst of all (as mentioned) the translations – for German especially – are genuinely incomprehensible. Looking into the credits, they were made by some random Chinese company, with no actual translators or localisation QA folks credited by name. It's probably just AI. That's honestly the worst part. It's practically unplayable in German.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is really good, i really love it, until I realized that I couldn't get 4 achievements, namely population win, facility win, club victory and teaching win in one playthrough, it was very stupid, I had spent a lot of time to achieve all of that, and I only got one, I had to repeat it again to get 3 other achievements and had to use tricks to get the remaining 3 achievements. Why wasn't there a notice that each achievement could only be obtained in one playthrough, waste my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fantastic! However, if you expect new contents, do NOT download the game. It has been abandoned.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this had so much potential but there are so many bugs that developers refuse to fix, there hasn't been an update in over a year",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☑ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☐ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I actually really like the game. Especially designing the school is a delight.\n\nHowever, one aspect I feel is completely unnecessary and drags the game: Research.\n\nYou NEED to research because you will be required to teach advanced subjects that you need to research, and not just that, but to unlock things such as heating, cleaning, student club, etc. It's a drag on your economy as research requires you to hire staff dedicated to it. Also if you are behind, it basically bombs your game because you can't teach the subjects you need to teach. It's frustrating to deal with.\n\nI genuinely wish this game existed without research. I should just be able to hire teachers with qualifications to teach subjects, or upgrade them with money to teach these subjects. Anything regarding advanced cleaning equipment or kitchen should just be more money. Student club should be something that you need to fulfill requirements for.\n\nThis game would be so much more thematically sensible without research.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't enjoy my time with the game. Terrible UI",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TOO MANY BUGS AND TOO MANY YEARS TO NOT TO PATCH IT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "abandoned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is good, whatever good things people say about this game, it's true. I want to give this a thumbs up, i really do, \n\nbut then i learned that the devs abandoned this game and stated it officially, while there's still bugs and many room for QoL improvement, so, no more bug fixes, no more QoL update. you will play the game as it is, and no, the workshop doesn't help with the bug fix and QoL mod at all.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I played this game for a while now, everything good at the beginning, building a school from scratch, that's include management, facility, hiring and other technical things.\r\n\r\nBut as time went, I found bug by bug, facilities became unreachable after I upgraded the buildings, NPCs randomly stuck in a facility and many more. This game will be good for the chill part but cant satisfied me in optimization and smoothness.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So sad, this game could be really nice. It feels like a neat managemen simulation of a school. There is a big level of complexity, construction and management.\r\nHowever, the UI/UX is abyssimal. Most of the time you have no idea what influences what. Aside from that there are some terrible design choices. E.g. why is a class always linked to a room? I for one build in advance so I create a new classroom for the upcoming school year. However, that creates a new class that is shown as error (since there are no teachers or students in it). The next year then it gets promoted to grade 2 where as it was only meant for grade one by then.\r\nThis is just one of so many examples which makes the game cluttered and hard to understand. There are many values shown where you just don't have any idea where they are coming from nor what they do. Its basically learning by doing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h2] A fun SIM game that went the route of releasing on different consoles before finishing.[/h2]\n[h3] Did have fun with it, but development has stopped, sadly.[/h3]\n\nHad fun, but two dreadful things have seemed to happen:\n- The lead artist had RL medical issues and was unable to continue.\n- Management focused on releasing an unfinished game on multiple consoles.\n\n[b]Artist leaving:[/b]  I hope they are well and its really unfortunate to hear.  I love the artstyle in game.  Maybe in the future they'll be able to return.\n\n[b]Company focus on multi-platform:[/b]  Nope.  [u]Biggest sin of an indie game[/u].  Absolutely nope.\n\nThere are unfinished parts of the game:  \n❌ Only one student interacts with the Student Counsel room.  \n❌ There are only two clubs for Artist and Sports (Humanities and Science missing).  \n❌ There is a noticeable lack of world maps to choose from.\n❌ English translation isn't finished.  Specialist Teacher information boxes have badly translated terms that are ambiguous. \n❌ Doing athletic sports doesn't reduce character weight.  (you'll find out lmao)\n❌ The schoolbell sound 🔊 is going to get REALLY annoying.\n❌ There are two \"Sound Effect\" sliders in Settings, yet neither of those control the school bell independently.\n❌ NPCs don't even use the Training Room.\n❌ Cafeterias need seats for the total population, yet only ~4-8 people are in there at one time.\n❌ Early-Mid game, your biggest money maker is selling candy.  The playground area receives little to no visitors.  The entire student body seems to entertain themselves with candy.  \n❌ Guard station checkpoints are supposed to collect contraband and store in your inventory, but doesn't.\n❌ Student Field trips all seem to be done by foot, despite students commuting via bicycle, bus, metro, cars...  Doesn't make sense that one cannot send a class somewhere by bus.\n❌ When a field trip departs, the students are gone, but the teachers go to their schedule classrooms and teach.  Who is leaving with the kids???\n❌ Sending teachers to Training doesn't remove them from the building.  This is actually helpful as scheduling Teachers to specific classes isn't easy.  Likely, you're more meant to have a pool of teachers available at all times to teach.\n\nThe game feels fun, but it fades after your first playthrough.  On your second run, you're going to feel like you're playing a continuation of the first.  I get a lot of vibes from SimTower from back in the day.  Which isn't a bad thing, the Let's School formula is fun, but needs another year of polishing to really shine.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The UI is not very intuitive, and the tutorial doesn't do a very good job of explaining things. After trying three times (twice in career, once in sandbox) the gameplay feels sluggish and repetitive. Maybe after you get past the first 2-3 weeks of classes it improves, but overall it just wasn't fun. Wish I hadn't played for more than two hours since my refund request was rejected based on playtime. Oh well, at least it was on sale so it wasn't a total waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infuriating in how unpolished many game aspects are, how unclear many game aspects are, and how bugged it is. The writing's lousy, many interactions are frustrating, but overall the game's a decent sim game that'll appeal not only to fans of Two-Point Campus and similar games, but to most (civ, colony, tycoon, etc) simulation fans overall. ..if you're willing to expend the energy to deal with the fact that the dev clearly released the game in an \"expect post-release updates\" state, and never provided those. \r\n\r\nUltimately, your appreciation of the game's going to boil down to your commitment to the genre- I'm going to continue playing the game, despite the annoyances having given me a literal headache, but I just can't recommend the game in general, since the frustrations and weak tutorial are going to run off those unfamiliar with, or less invested in the genre. \r\n\r\nBasically, the same reason I wouldn't recommend the original ascii-form Dwarf Fortress. It's a game a certain niche is going to appreciate, but the frustrations make it not for everyone. And, I mean, at least that game has the excuse of \"this is an intentional design, since I want to focus on simulation development before graphic development\", whereas Let's School.. well, let's just say it graduated a bit too early, and not with flying colors.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not that fun , thought it would be a bit more similar to the two point games based on the demo ,  glad i got this as part of a bundle. its Fine as a dull podcast game i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I received this as a gift and I have absolutely no idea how this game has this positive reviews.\r\n\r\nGranted, I've only gotten 16 minutes into this game, but there's a reason for that:\r\n\r\n- Both the English and German translations are clearly either unreviewed AI/machine translation or created without providing the translators with any context. The German version of \"let's give back to the local community\" is translated literally, ending up as the equivalent of \"let us return items backwards toward the localised group\". It's incomprehensible in most cases. UI translations are messed up and don't fit the context in which they are used. For example, the average employee satisfaction UI element is awkwardly called \"Happiness of the employee\". It's AI or cheap outsourcing nonsense.\r\n\r\n- Text bleeds out of their respective areas and boxes constantly and UI clips into each other. The text of the \"Save and quit\" button in German (\"Speichern und beenden\") is double the length of the button that's supposed to hold it, cutting off on both sides.\r\n\r\n- I think the game should disclose a little more clearly that it's specifically simulating a certain kind of Japanese schools. The entire structure of the game and its school system is based on Japan, which was a disappointment for me as I was looking for a relatively relatable school management tycoon game, and the idea of sex-segregation, school uniforms and such are alien and offputting to me.\r\n\r\n- The art style and writing are so far generic and uninspired, it's very much the kind of dialogue you'd get in a free mobile game trying to make you buy ingame currency 'to speed up construction' or whatnot. You get utterly generic characters like \"Brick the Construction Assistant\" telling you how to use the demolition feature, while you can practically smell that \"Buy 5 gems now or watch an ad to instantly complete demolition!\" that thankfully never comes; it feels like no love or passion went into the game at all.\r\n\r\nEither way, this looks and feels very, very much like a cheap, barely functional, janky mobile game rather than a fully-fledged PC management tycoon.\r\n\r\nWorst of all (as mentioned) the translations – for German especially – are genuinely incomprehensible. Looking into the credits, they were made by some random Chinese company, with no actual translators or localisation QA folks credited by name. It's probably just AI. That's honestly the worst part. It's practically unplayable in German.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is really good, i really love it, until I realized that I couldn't get 4 achievements, namely population win, facility win, club victory and teaching win in one playthrough, it was very stupid, I had spent a lot of time to achieve all of that, and I only got one, I had to repeat it again to get 3 other achievements and had to use tricks to get the remaining 3 achievements. Why wasn't there a notice that each achievement could only be obtained in one playthrough, waste my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fantastic! However, if you expect new contents, do NOT download the game. It has been abandoned.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this had so much potential but there are so many bugs that developers refuse to fix, there hasn't been an update in over a year",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☑ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☐ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I actually really like the game. Especially designing the school is a delight.\n\nHowever, one aspect I feel is completely unnecessary and drags the game: Research.\n\nYou NEED to research because you will be required to teach advanced subjects that you need to research, and not just that, but to unlock things such as heating, cleaning, student club, etc. It's a drag on your economy as research requires you to hire staff dedicated to it. Also if you are behind, it basically bombs your game because you can't teach the subjects you need to teach. It's frustrating to deal with.\n\nI genuinely wish this game existed without research. I should just be able to hire teachers with qualifications to teach subjects, or upgrade them with money to teach these subjects. Anything regarding advanced cleaning equipment or kitchen should just be more money. Student club should be something that you need to fulfill requirements for.\n\nThis game would be so much more thematically sensible without research.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't enjoy my time with the game. Terrible UI",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "TOO MANY BUGS AND TOO MANY YEARS TO NOT TO PATCH IT.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "abandoned",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is good, whatever good things people say about this game, it's true. I want to give this a thumbs up, i really do, \n\nbut then i learned that the devs abandoned this game and stated it officially, while there's still bugs and many room for QoL improvement, so, no more bug fixes, no more QoL update. you will play the game as it is, and no, the workshop doesn't help with the bug fix and QoL mod at all.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I played this game for a while now, everything good at the beginning, building a school from scratch, that's include management, facility, hiring and other technical things.\r\n\r\nBut as time went, I found bug by bug, facilities became unreachable after I upgraded the buildings, NPCs randomly stuck in a facility and many more. This game will be good for the chill part but cant satisfied me in optimization and smoothness.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So sad, this game could be really nice. It feels like a neat managemen simulation of a school. There is a big level of complexity, construction and management.\r\nHowever, the UI/UX is abyssimal. Most of the time you have no idea what influences what. Aside from that there are some terrible design choices. E.g. why is a class always linked to a room? I for one build in advance so I create a new classroom for the upcoming school year. However, that creates a new class that is shown as error (since there are no teachers or students in it). The next year then it gets promoted to grade 2 where as it was only meant for grade one by then.\r\nThis is just one of so many examples which makes the game cluttered and hard to understand. There are many values shown where you just don't have any idea where they are coming from nor what they do. Its basically learning by doing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h2] A fun SIM game that went the route of releasing on different consoles before finishing.[/h2]\n[h3] Did have fun with it, but development has stopped, sadly.[/h3]\n\nHad fun, but two dreadful things have seemed to happen:\n- The lead artist had RL medical issues and was unable to continue.\n- Management focused on releasing an unfinished game on multiple consoles.\n\n[b]Artist leaving:[/b]  I hope they are well and its really unfortunate to hear.  I love the artstyle in game.  Maybe in the future they'll be able to return.\n\n[b]Company focus on multi-platform:[/b]  Nope.  [u]Biggest sin of an indie game[/u].  Absolutely nope.\n\nThere are unfinished parts of the game:  \n❌ Only one student interacts with the Student Counsel room.  \n❌ There are only two clubs for Artist and Sports (Humanities and Science missing).  \n❌ There is a noticeable lack of world maps to choose from.\n❌ English translation isn't finished.  Specialist Teacher information boxes have badly translated terms that are ambiguous. \n❌ Doing athletic sports doesn't reduce character weight.  (you'll find out lmao)\n❌ The schoolbell sound 🔊 is going to get REALLY annoying.\n❌ There are two \"Sound Effect\" sliders in Settings, yet neither of those control the school bell independently.\n❌ NPCs don't even use the Training Room.\n❌ Cafeterias need seats for the total population, yet only ~4-8 people are in there at one time.\n❌ Early-Mid game, your biggest money maker is selling candy.  The playground area receives little to no visitors.  The entire student body seems to entertain themselves with candy.  \n❌ Guard station checkpoints are supposed to collect contraband and store in your inventory, but doesn't.\n❌ Student Field trips all seem to be done by foot, despite students commuting via bicycle, bus, metro, cars...  Doesn't make sense that one cannot send a class somewhere by bus.\n❌ When a field trip departs, the students are gone, but the teachers go to their schedule classrooms and teach.  Who is leaving with the kids???\n❌ Sending teachers to Training doesn't remove them from the building.  This is actually helpful as scheduling Teachers to specific classes isn't easy.  Likely, you're more meant to have a pool of teachers available at all times to teach.\n\nThe game feels fun, but it fades after your first playthrough.  On your second run, you're going to feel like you're playing a continuation of the first.  I get a lot of vibes from SimTower from back in the day.  Which isn't a bad thing, the Let's School formula is fun, but needs another year of polishing to really shine.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The UI is not very intuitive, and the tutorial doesn't do a very good job of explaining things. After trying three times (twice in career, once in sandbox) the gameplay feels sluggish and repetitive. Maybe after you get past the first 2-3 weeks of classes it improves, but overall it just wasn't fun. Wish I hadn't played for more than two hours since my refund request was rejected based on playtime. Oh well, at least it was on sale so it wasn't a total waste of money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Infuriating in how unpolished many game aspects are, how unclear many game aspects are, and how bugged it is. The writing's lousy, many interactions are frustrating, but overall the game's a decent sim game that'll appeal not only to fans of Two-Point Campus and similar games, but to most (civ, colony, tycoon, etc) simulation fans overall. ..if you're willing to expend the energy to deal with the fact that the dev clearly released the game in an \"expect post-release updates\" state, and never provided those. \r\n\r\nUltimately, your appreciation of the game's going to boil down to your commitment to the genre- I'm going to continue playing the game, despite the annoyances having given me a literal headache, but I just can't recommend the game in general, since the frustrations and weak tutorial are going to run off those unfamiliar with, or less invested in the genre. \r\n\r\nBasically, the same reason I wouldn't recommend the original ascii-form Dwarf Fortress. It's a game a certain niche is going to appreciate, but the frustrations make it not for everyone. And, I mean, at least that game has the excuse of \"this is an intentional design, since I want to focus on simulation development before graphic development\", whereas Let's School.. well, let's just say it graduated a bit too early, and not with flying colors.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not that fun , thought it would be a bit more similar to the two point games based on the demo ,  glad i got this as part of a bundle. its Fine as a dull podcast game i guess",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I received this as a gift and I have absolutely no idea how this game has this positive reviews.\r\n\r\nGranted, I've only gotten 16 minutes into this game, but there's a reason for that:\r\n\r\n- Both the English and German translations are clearly either unreviewed AI/machine translation or created without providing the translators with any context. The German version of \"let's give back to the local community\" is translated literally, ending up as the equivalent of \"let us return items backwards toward the localised group\". It's incomprehensible in most cases. UI translations are messed up and don't fit the context in which they are used. For example, the average employee satisfaction UI element is awkwardly called \"Happiness of the employee\". It's AI or cheap outsourcing nonsense.\r\n\r\n- Text bleeds out of their respective areas and boxes constantly and UI clips into each other. The text of the \"Save and quit\" button in German (\"Speichern und beenden\") is double the length of the button that's supposed to hold it, cutting off on both sides.\r\n\r\n- I think the game should disclose a little more clearly that it's specifically simulating a certain kind of Japanese schools. The entire structure of the game and its school system is based on Japan, which was a disappointment for me as I was looking for a relatively relatable school management tycoon game, and the idea of sex-segregation, school uniforms and such are alien and offputting to me.\r\n\r\n- The art style and writing are so far generic and uninspired, it's very much the kind of dialogue you'd get in a free mobile game trying to make you buy ingame currency 'to speed up construction' or whatnot. You get utterly generic characters like \"Brick the Construction Assistant\" telling you how to use the demolition feature, while you can practically smell that \"Buy 5 gems now or watch an ad to instantly complete demolition!\" that thankfully never comes; it feels like no love or passion went into the game at all.\r\n\r\nEither way, this looks and feels very, very much like a cheap, barely functional, janky mobile game rather than a fully-fledged PC management tycoon.\r\n\r\nWorst of all (as mentioned) the translations – for German especially – are genuinely incomprehensible. Looking into the credits, they were made by some random Chinese company, with no actual translators or localisation QA folks credited by name. It's probably just AI. That's honestly the worst part. It's practically unplayable in German.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is really good, i really love it, until I realized that I couldn't get 4 achievements, namely population win, facility win, club victory and teaching win in one playthrough, it was very stupid, I had spent a lot of time to achieve all of that, and I only got one, I had to repeat it again to get 3 other achievements and had to use tricks to get the remaining 3 achievements. Why wasn't there a notice that each achievement could only be obtained in one playthrough, waste my time",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fantastic! However, if you expect new contents, do NOT download the game. It has been abandoned.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this had so much potential but there are so many bugs that developers refuse to fix, there hasn't been an update in over a year",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☑ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☐ Teens\n☐ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☑ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☑ Short\n☐ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐ If it's on sale\n☑ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☑ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I actually really like the game. Especially designing the school is a delight.\n\nHowever, one aspect I feel is completely unnecessary and drags the game: Research.\n\nYou NEED to research because you will be required to teach advanced subjects that you need to research, and not just that, but to unlock things such as heating, cleaning, student club, etc. It's a drag on your economy as research requires you to hire staff dedicated to it. Also if you are behind, it basically bombs your game because you can't teach the subjects you need to teach. It's frustrating to deal with.\n\nI genuinely wish this game existed without research. I should just be able to hire teachers with qualifications to teach subjects, or upgrade them with money to teach these subjects. Anything regarding advanced cleaning equipment or kitchen should just be more money. Student club should be something that you need to fulfill requirements for.\n\nThis game would be so much more thematically sensible without research.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}