{
  "positive": [
    {
      "review": "[quote=The Narrator][h3][i]\"Once again teetering on that terrible precipice...\"[/i][/h3][/quote] \n\nDD2 is a schizophrenic sequel. The first game was released nine years ago but remains a must-play, a radical indie title with a killer artistic direction ([url=https://steamcommunity.com/id/stscylla/recommended/262060/]here's my review/introduction[/url]). \n\nAfter its critical and commercial success, Red Hook could have milked their playerbase and simply packaged some new content as a fully-priced sequel. It's pretty standard practice and would have been an easy sell to players who wanted more of the same. But these devs don't settle for easy. For the record the final expansion of DD1 added an unexpected PvP mode - for free.  \n\nWith DD2 they decided to redo all visuals in 3D, update the combat system, break down the progression structure and build two roguelite modes. \n\n[quote=The Narrator][h3][i]\"What is it, then, that gazes back so intently from the abyss?\"[/i][/h3][/quote] \n\nThe new 3D visuals retain the gorgeous art style of the original game and fix its issues: body proportions are much healthier, depth feels better and animation transition make it all look smooth.  \n\nThe updated combat system has dropped traditional stats such as Accuracy and Armor, which were responsible for weird RNG spikes like failing three consecutive attacks at 90% accuracy. DD2's battle flow revolves around positive and negative tokens, such as Blind and Guard, which are applied or cancelled by combat actions. The result feels less random and more predictable, which is helpful in a tactical game, but harder to pick up: new players must first learn all tokens. Fortunately there's a quick reference guide available in the options. \n \nVeterans will also note that stress no longer acts as a second health pool, but impacts a number of other mechanics such as relationships. \n\n[quote=The Narrator][h3][i]\"The sumtotal of violent equation, unfavourably rounded down!\"[/i][/h3][/quote] \n\nDitching the permanent progression of the original game, DD2 introduces two roguelite game modes: Confessions and Kingdoms. \n\nConfessions are gauntlet runs with multiple regions to cross and a different final boss in each of the five difficulty levels. You need to carefully build a party of 4 heroes as opportunities to replace any casualty are very limited.  \n\nProgression between runs is made of permanent unlocks of skills, paths (subclasses) and trinkets (gear), which open up new synergies and tactics. If you want to turn your Leper into a killing machine, equip the Goading Gargoyle trinket and choose between the Monarch and the Tempest paths. If you need him to tank, go down the path of the Poet and make sure to take the Withstand and Solemnity skill upgrades. \n\nKingdoms offer longer runs against one of three factions: the beast clan, the witch coven and the cursed courtiers. Rather than a party of four, you control the full roster of heroes spread on a world map. The goal is to simultaneously defend local inns and keep a mobile task force to complete a series of quests. \n\nBoth modes benefit from mod support and a range of settings to tailor the experience to your liking. As much as I enjoy upgrading my heroes and inns in Kingdoms, I find runs in this mode to feel rather long and repetitive. Confessions have a narrower focus but get to the point. \n\nIn any case, DD2 is a poison I prefer taking in small doses. This game is equally intoxicating and deadly. The challenge posed by the final bosses is honestly beyond my current skill. But I've faith in the Narrator's words. \n\n[quote=The Narrator][h3][i]\"Persistence will overcome even the greatest of threats.\"[/i][/h3][/quote] \n\nIn 2025 DD2 received a burst of updates: the Kingdoms mode and its three factions, the Inhuman Bondage DLC with the Abomination and the Catacombs, and a bunch of class balancing and interface polishing patches. It's my nominee for the Labor of Love award. You can check [url=https://store.steampowered.com/steamawards/nominations/2025/76561197992891947?k=16186207227725582]my other 2025 Steam Awards nominees here[/url].",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "This game is what I would call, an exemplary Darkest Dungeon sequel. I see a lot of people have a lot of grievances with the way this game plays, but I would say, Redhook deserves credit and praise for trying to differentiate this game from DD1. If people want to play a \"true\" sequel, then they can play Black Reliquary whenever that comes out. I feel that the Rougelite implementation has been done incredibly well, and it's important for games to innovate on sequels, especially within reason, which RedHook did IMO. The game looks fantastic, feels great to play, is a pleasure to listen to (SFX and Music wise), and overall, just a fun time, unless you're getting Darkest Dungeon'd, which happens. I also have to give more props to RedHook for the extensive class reworks, new content, and updates they've been consistently pushing out for the past two years since launch. Besides that, not much else to say, DD2 still feels like a Darkest Dungeon game and it's good as f.\n\nAlso, rest in peace Wayne June. You brought something to this game that can never be replicated.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "Very different from darkest dungeon 1, but I find it refreshing. I definitely think it was worth getting on sale.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Really rough to start with because you have to unlock additional character skills and bonus stats via meta progression, which opens up the game a lot. Once you do that for some of your favorite characters, the number of different combinations of play styles really increases and makes it a lot more fun combat than the first game.\r\n\r\nWould recommend to give it a try, but needs a bit of patience to get started.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "As of November 2025, I assume the dev cycle on this game is done since there hasn't been any word about forthcoming content. If something changes I'll edit my review.\n\nI really love this game even though it is obviously not perfect. The visual style, the combat, and theory-crafting synergistic teams are all incredible. I don't fault it for being different from DD1. I like that they went with a divergent and ambitious sequel instead of resting on their laurels. That being said, there are some things prospective buyers should know if you're on the fence.\n\nBeginning the game on a fresh account will be very difficult. Unless you are already extremely familiar with the mechanics, you will likely lose repeatedly while unlocking necessary progression with each run that will eventually make the game manageable (it's roguelike, duh). You should only buy this if you are intent on steamrolling through early setbacks and getting your progression up. But even after your progression is up, the game is still hard. There are many difficulty modifiers I haven't tried because even the basic difficulty is pretty challenging in my opinion. \n\nThe game launched with a mode called Confessions, which is essentially Slay The Spire type runs with DD combat. It also has narrative elements and really cool bosses, but at the end of the day is kind of paltry as a standalone offer. Clearly Red Hook agreed, which is why they created the Kingdoms game mode later. Kingdoms is closer to the persistent base building of the first game, with a longer gameplay loop than Confessions. Having both Confessions and Kingdoms to play is a better value proposition, but also bifurcates the game into two modes with no relation to one another, which sort of highlights the confused direction of DD2. \n\nThis part is not necessarily relevant to prospective buyers, but hero balance has also been a persistent problem with this game. From early access onwards, I feel Red Hook did not have a firm grasp on their balancing approach to heroes. This is somewhat understandable, considering the heroes are much deeper than their DD1 counterparts. But over the years, Red Hook has spent an inordinate amount of time balancing these heroes to make up for early mis-steps that they could have spent in other ways. The Steadfast Stewards updates were very cool, but in the end applied seemingly different design philosophies to different characters as time went on, leading to inconsistent choices across the roster. For example, giving some Leper moves extra actions, which is a very powerful mechanic that could have really helped other characters in the past. As of writing, the entire hero roster is still not quite balanced, but hopefully the vibrant modding scene will fix that. \n\nOverall I've had a ton of fun with this game despite some annoyances over the years. It's one of my favorite turn based games ever, and I hope Red Hook learns lessons from it that improve the development of their future games.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Not exactly what I wanted from the sequel before I played it, but it turns out to be a fresh spin on the original. It's great, but different than the first.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Excellent design and character stories, each playthrough is interesting in a new way, the music is also a separate art form, I give it 10 out of 10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love this game! \r\nExcellent replay ability, similar to the previous game but also quite different. Reworked mechanics and exciting camera movement in the combat when heros and villans hit a power shot. Visually stunning and sound quality superb. Buy the game and enjoy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best games I`ve ever played, period.\n\nIt has beautiful and clever art style, terrific narration, great worldbuilding and storytelling - and the gameplay is superb. \n\nThe best thing about the game for me though is the atmosphere. The switch from grimdark of the first DD to the nobledark (or even hopepunk, with all the forgiveness themes woven into narration) is just chef kiss. \n\nYes, the world is in shambles, everything is slowly consumed by madness, raving cosmic insanity and all too human degeneracy and decadence, but you can fix it. It won't be easy. You will fail, you will struggle, you will have to endure - but with enough commitment to the cause, the damage to the world - and to the characters (most of them, looking at the Flagellant ;)) - can be and will be undone. \n\nI wholeheartedly recommend this game and encourage everyone to at least try it. \n\n[i]In this weighty gloom, a spark.[/i]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Darkest Dungeon 2 takes the combat of the first game and further refines it while giving us further glimpses into the story and setting established in Darkest Dungeon, overall it makes for a very enjoyable roguelite.\n\n[h1]Comparisons To The Original[/h1]\nIf you're new to Darkest Dungeon and are unsure which game to buy or have played the first game and are on the fence about buying 2, read on as I've attempted to list some similarities and key differences between the two games below, although with more of a focus on 2 as this is a review of the second game and not the first.\n\n[h2]Similarities[/h2]\n[list]\n [*] Combat is turn based, with your group of 4 heroes pitted against 4 enemies.\n [*] Turns in combat are decided by the speed of each character present, with faster characters acting first.\n [*] Position determines what abilities a character may use and who they may target, for example Hellion's Iron Swan ability requires her to be at the frontmost rank and may only target an enemy in the 4th position.\n [*] Dead heroes and enemies leave behind corpses that take up a position in combat.\n [*] Heroes may equip alternate abilities allowing them to fill different roles, only so many abilities may be equipped at once.\n [*] Heroes may equip up to two trinkets providing various benefits and maluses depending on the trinket.\n [*] Heroes posses both a health bar and a stress bar, where enemies only possess health. Reaching 0 health means getting put into the \"Deaths Door\" state, afterwards any point of damage has a chance of landing a deathblow and killing the character, healing above 0 health will cause the character to leave Deaths Door and act as normal. Maxing out the stress meter gives a character a chance at having a meltdown/outburst of some form, taking damage and typically carrying some malus that varies depending on the outburst, or steeling themselves and becoming resolute, healing them and reducing stress.\n[/list]\n\n[h2]Darkest Dungeon 1[/h2]\n[list]\n [*] Features an almost X-Com like focus on building and managing a wide roster of characters, death means the loss of a character and having to train a replacement.\n [*] A run takes the form of a prolonged campaign, with progression between missions involving upgrading your town to better equip and maintain your heroes, with the ultimate goal being to get your heroes strong enough to tackle the titular darkest dungeon and win the run.\n [*] Characters exist as classes, you can and will have multiples of the same character in your roster and a party may double up on the same class.\n [*] Missions involve dungeons crawls with varied layouts, as you traverse each dungeon you are met with various encounters such as interactable curios that give different results depending on the choices made/items used or combat encounters.\n [*] Resource management is crucial to keep your heroes topped up in missions so as not to lose a war of attrition.\n [*] Features a separate PvP mode, the Butcher's Circus. I cannot speak on how active this mode is at the time of writing.\n[/list]\n\n[h2]Darkest Dungeon 2[/h2]\n[list]\n [*] Features two game modes, Confessions and Kingdoms.\n [*] Confessions plays like a more typical roguelite, with meta progression between runs. Permanent unlocks are acquired between runs using Candles obtained throughout the course of a run, speaking from experience the grind is pretty quick as so long as you're making good progress a failed run will still net you enough Candles for a large number of unlocks and upgrades.\n[*] Kingdoms runs are self contained, in that unlocks from confessions and other Kingdoms runs do not apply, and take the form of longer campaigns (albeit still significantly shorter than a typical Darkest Dungeon 1 run) where you move your party and other heroes around a map, defending and upgrading Inns (acting as your various bases) with the ultimate goal being to progress a quest and defeat a campaign dependant boss. At the time of writing three different campaigns are available, with different unique enemy factions and quests.\n[*] Missions in both game modes have you travel along branching paths between various points of interest and potentially facing encounters as you travel. Your party members may indicate a preference for certain paths, rewarding you with a stress heal or taking stress damage if you follow or ignore their suggestions, and heal passively as you travel.\n [*] The game features a narrower but deeper roster where each character is an individual (the presets forms of classes from the first game alongside some newcomers) with a large amount of unlockable alternate abilities/customisations and whose backstory is explored throughout the Confessions game mode (doing so permanently unlocks new abilities for the hero). In Kingdoms, alternate abilities are instead purchased at Inns with the required upgrade.\n [*] Heroes possess paths (subclasses) that you unlock through progression in Confessions, or again at upgraded Inns in Kingdoms, that can drastically change how they play and allows for varied team comps and synergies, making up for the inability to double up on classes.\n [*] Death in Confessions means losing the hero for the rest of the run and receiving a replacement hero if you make it to the next inn, this replacement is selected randomly from the heroes you have not yet lost this run. Death in Kingdoms is configurable at the start of a run, permadeath is on by default on most difficulties, however it may be configured so that a dead hero respawns at a penalty or a fresh untrained replacement spawns after losing a hero.\n [*] Heroes form relations, rewarding you with positive boons such as a heal or DoT removal when using specified abilities or randomly attacking alongside or defending eachother at good relations and at bad relations debuffing themselves or eachother when using specific abilities or doing/taking stress damage. These relations are influenced by the choices made by the player throughout a mission as well as items used while resting.\n [*] After a successful mission in Confessions you arrive at an Inn where you may spend mastery to upgrade abilities, purchase equipment and consumables, upgrade and repair your coach, and use Inn items to heal, buff, or improve the relationships of your heroes.\n [*] As previously mentioned, Inns play a different more important role in Kingdoms and are only located at specific points on the map. If you travel to a location without an Inn, you will instead make camp which allows you to use consumables as you would an Inn but does not feature a merchant or upgrades and has the possibility of a surprise ambush, as in the first game.\n [*] Does not feature the Butcher's Circus.\n [*] Combat is similar to the first game, but features new tokens and mechanics such as the combo token which sets up for secondary effects on the abilities of various characters and enemies. Stall tactics like healing have had restrictions placed on them so that they may only target characters under certain conditions, such as being below 33% health or having specific tokens applied.\n [*] In combat consumables are equipped to and carried by party members in a dedicated slot, with each character able to carry only one type of item at a time (they may carry multiple of the equipped item however). Using consumables does not take an action.\n[/list]\n\n[h1]Should You Buy?[/h1]\nIf you're coming from Darkest Dungeon 1 and find that your favourite parts of it were the wide roster management and the dungeon crawling, and are explicitly looking for more of that gameplay then Darkest Dungeon 2 may not be for you.\nIf your favourite elements of Darkest Dungeon 1 were the combat and strategy, or are looking to immerse yourself in more of the games lore and setting then I can thoroughly recommend 2.\nIf you're new and were intimidated by the longer campaigns and roster management of 1, you may find 2 a bit easier to get into.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is indubitably a great game, compelling, absorbing, with fenomenal art and sound (doing better of the already striking beautiful first iteration). I've dabbled a bit in teh classic (Confessions) mode, but the good stuff is in the challenging Kingdoms mode, which is actively maintanined. The game is HARD, unforgiven and not rarely a bit unfair (RNG could blow a perfect run in a moment), so beware. But it's woth the frustration.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DD2 doesn't follow the game play loop of the first game, its connection to the first game is the core game play which is the combat system which I think is majorly improved upon. The game is balanced much better in this sequel especially in time of writing compared to DD1, making the game much more challenging to me as many heroes broken or easy value abilities are nerfed. The game is definitely more grindy than the first game which is a drawback but for me the grind is worth it for the game. If your enjoyment of Darkest dungeon is primarily for its combat system you should love this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a big fan of the original Darkest Dungeon. I tried this sequel when it came out and I was disappointed. But I heard the game had improved a lot and tried again -- massive improvement it's now an amazing sequel with two totally different game modes. The new \"Empires\" mode I really like. It's different to DD1 but in a good way that makes it hard to pick between DD1 and DD2 now. \r\nOne thing: The interface is rough (confusing, unclear) until you learn it -- stick with it or read 3rd party guide.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I actually like this better than the original. The progression feels way more substantial, no longer like bashing your head against a wall over and over just to get a lucky enough run to make it through the first region.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game, hard to get into at first but I really enjoy the combat and the animations. Stellar job, loved also darkest dungeon 1 but this one takes the cake! <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite different from the first game, but both games are really enjoyable in different aspects. This second entry is way less RNG based (even if it can still get you in tough spots) and finishing the game is faster but there is so much content to pursue aside of just \"finishing\" the confessions that the game is as addictive as the previous one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fair and balance game, suitable for people who just want to relax after a stressful day!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I held off on this game when it initially came out because of the mixed reviews and fan dissapointment but after picking it up on a sale and giving it a chance I think its actually a fantastic roguelike thats just doing it's own thing. The biggest mistake the devs made was marketing this as a sequel and not a spin-off.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I always feel safe when a Crusader, a Highwayman and a Vestal is present. Everything falls into place.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very different from Darkest Dungeon 1 but not in a bad way. game looks amazing each character is unique and fun with many 3 different paths to change up how they play.\r\nGreat overall game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love it when my character i spent hours grinding to max level gets syphilis and aids from a dying pig and then fucking dies\r\n\r\n11/10 would recomend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The overall experience, soundtrack and story of DD1 is better. The minute-to-minute gameplay, graphics and balance of DD2 make it more fun to me. DD2 is good, I just think it sorta lost something from the original.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game by itself, but It's a questionable sequel.\n\nOkay, let's make one thing clear. First Darkest Dungeon, is NOT a rogue-like. It has too much intergrity between each dungeon and the default game mode of it is literally called \"Campaign\". The tag on steam was wrong. It's a rogue-LITE at best and it's still a stretch for my taste.\n\nDarkest Dungeon 2 on the other hand, the Rogue-like/lite fits right in the spot. I get why they did do it, but it kinda takes away the infamous, irreversable consequences to every action you have commited in the first iteration. Losing a run in DD2 doesn't feel significant. You just retry and get better with whatever candles you have collected during previous attempts. Sure, losing memories and qirks on your characters sucks to lose, but they still come back 90% of unlocks still on them, as the progress is permanent. It just doesn't feel right.\n\nNow, despite the last paragraph, here is why I actually really enjoy this game:\n\n-Combat. Darkest Dungeon 2 has took the already established via trail and error combat system of original and improved upon it. They even took daze mechanic from the Butcher's circus, which was definitely a good choice and a segway to the exhibit A.\n The nerf of stun. It was far too easy to best the dungeons in the first game by just spamming stuns and bullying \nthe adversaries. Here, you need to spend (in most cases) at least two turns, just to take one from the opposition.\nAnd daze itself isn't too useless either. Change was imperative. \n Exhibit B. New skills and paths. I adore the amount of flexibillity classes have, often focusing on a specific playstyle, not only improving it in the long run, but also pulling twists on them. Really hits the spot in case you lose a character and you need to fill in the gap. It's a lot of fun and gives room for experimentation.\n Exhibit C. Mechanics. Tho I'm not entirely sold on the tokens replacing majority of buffs, it does help to keep the flow of the game faster, more likely letting you complete the run in a single sitting. When it comes to gimmicks for the fights, I would describe them as understandable in the majority, not making you study entire wiki so that you may have a shot at winning against bosses. They are new, refreshed or revamped.\n\n-Lore Extention. While the plot of DD2 in general is rather confusing for where it takes place, why does it all happen and how is it connected with the prequel. At least we get a look on the world outside of the hamlet. It absolutely nails expanding of Character's backstories tho, especially Abomination's, which I won't elaborate on for the sake of not spoiling. Point is, that we get to learn more about our heroes' personallities and tell reasons why are they the way that they are. Instead of putting archetypes into these characters for our own headcanons, seeing them as a base colored canvases, Red Hook made them into fully finished pieces of art, where we see ourselves in some of them.\n\n-Atmosphere. Keeps the same mood and aesthetic from the predecessor. It's amazing how well they transferred from 2d to 3d with their action comic artstyle. The special effects tendfolds from what we had, giving us satifaction and thrill with each attack. Constant voice lines of our irreplacable Narrator, Wayne June (R.I.P, you legend [*]) are simply a perfection. Not much more to say, 10/10. Frankly, he's the reason why I always improve on my english vocabulary and learning the most obscure synonyms I can find.\n\n-Community Feedback. These people listen to us and give what we want. New characters, Old characters brought back, so the enemies, Character update for those in need, and best for last, Kingdoms Mode. The throwback to the original game, where you can't just restart the run and try again where you last reached the checkpoint. This is why Indie studios are the best. We want Leper's Monarch path to actually exist? Boom, now it's the best late game option! You miss the nostalgic campaign aspect from 10 years ago? Boom, enjoy new game mode, coming in three flavours! More skins (especially for Bounty Hunter)? Say no more, chum.\n\n  To summarize, Darkest Dungeon has been my favorite series for a long time. I've exploded when The sequel was released and felt little disappointed when the first early access came out, but I got over it and so did the game. And while there's still plethora of issues with the second game, They are mere nauseances in the bigger picture. Nothing's flawless and I'm ready to forgive those hiccups. We shouldn't judge the game sequel purely by comparing it to the original, because it's not the same game.\n\n\"WE ARE THE FLAME, BURNING BRIGHTLY FOR ALL THE WORLD TO SEE!\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great follow up of the first game. Both game modes are very entertaining and challenging, and the overall theme provides a positive outlook which I personally found very inspiring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like DD1, then you might not like DD2, this game is pretty good but its not a sequel, there's loads of gameplay changes and it's mostly story focused, the progression honestly isn't the best it's pretty grindy and sometimes slow, other than that the game is not bad actually, Gameplay is fun and focused on the relationship mechanics, the bosses and enemies are 50% fun and 50% gimmicky / a lil annoying.\nThe game is not the best but also not the worst its at most a 7/10\nI'd recommend this to people who like Darkest Dungeon and want to try a kinda similar experience with new gameplay mechanics, or if they want to get into the story of the characters. \nBut if you want more DD1, get the DLCs and get Black reliquary.\n\nTL;DR: DD2 is not too bad and not recommended to those who want more DD1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is not quite like the first, but it’s definitely worth it. I actually prefer this one over the first due to repeatability  of the levels. It’s not as punishing and you don’t love the specific character just the class character but in the end I feel you actually feel for them more. Also reading a story explanation before helps because the game explains nothing until the final boss (and then barely anything) and it can be discouraging with the lore being hidden for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game.  different from the first one,  not necessarily better.   Still very enjoyable,  the exploration of the character backgrounds is amazing.  The less persistent world make it harder to generate the same satisfaction building combos with different character,  equiment and skill compared to the first game(imo)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very different from DD1 but the excellent combat and dark atmosphere remain. Much less micro managing everything and it gets right to the action. Hard to stop playing once you start!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very different then the first but the vibes are the same. This is what you want when a game advances and matures over the previous title.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked this game in the very early access way back when, I waited years to play this game at its best and I'm not at all disappointed.\r\nThis is peak Darkest Dungeon, a glorious sequel, excellently roguelike and as dreadful as it should be. Can't stop playing.\r\n100% recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Darkest Dungeon 2 is a game which I feel scratches that itch for a turn-based roguelike. The combat is a significant improvement from the original game, and allows for so much more customizability. \r\nThe introduction of hero paths have made each hero so much more replayable and adds a significant level of adapatablity to each hero, making characters fit into teams they wouldn't have before. Furthermore the way buffs and debuffs are applied has changed with the introduction of the new token system, which uses tokens in place of generic text based stat changes.\r\n\r\nThe two modes, kingdoms and confessions, allow for a variable gameplay type where kingdoms plays a bit similarly to the traditional Darkest Dungeon and confessions being the full roguelite mode of the game. \r\n\r\nThe artwork puts the first game to shame with the introduction of better 3D attack animations and the use of the iconic Darkest Dungeon art style in a 3D format. Overall the game looks stunning with each monster and boss looking very distinct. The sound and music design is also improved over the first game making each area feel distinct.\r\n\r\nOverall I feel that Darkest Dungeon 2 is a good game with fun mechanics, but one thing to keep in mind is that THIS IS NOT DARKEST DUNGEON. The sequel is more of a spiritual successor rather than a proper sequel, you could call it a spin-off if it fits. Don't expect the same experience as the first game and remember that this can be a signifcantly shorter experience over the first, depending how willing you are to attempt the completion of confessions or kingdoms.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still Dark , Still Unforgiving , Still my guilty pleasure .\n\nDifferent enough from the first to provide a new experience while still keeping the feeling of darkest dungeon.\n<3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The rogue like style is very fun and I still enjoy playing the original to me both have their place.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The genre this game and the game before it have set a foundation for how hard but rewarding a game can be. I love the Darkest Dungeon 2 for it's heavy focus on giving your best and trying. Many times games set for you a road map of what to do and so it can be done. However with games like Darkest Dungeon 1 & 2 you have to find a way to make it work when everything is failing. I love these games very much and would like anyone trying to find a challenge to try this game and the first one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hot take but this is better than DD1. There is a lot less ramping of heroes in DD2 which makes the party wipe pretty reasonable unlike DD1 where you have so much investment in heroes and grinding to optimize them. Trinkets are also much better with nearly all adding some net benefit. The move sets and hero paths make a single hero able to fit multiple party comps and build styles. After 80 hours in the game, and having some hundreds in DD1, I feel like DD2 is just now finding it's prime for me in terms of learning and play style. The reduction in randomness in DD2 is also nice. It becomes a lot more of a strategy game, which can make optimization harder, but also easier to master given the lower luck amount. The biggest draw back is slogging through the unlocks. The stories are great, but the ramp is pretty tedious and does not compliment the learning curve. I would go DD2 over DD1 any day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game, played about 2-300 hours on epic before swapping to steam. this is a GOAT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game different as hell when compared to DD1, but Redhook lowk cooked a bit and still got my favourite white boy, Dismas, absolutely slaying.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nalso plague doctor mating press and reynauld x dismas tragic yaoi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the aesthetic and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love that the game is still getting updates, the Kingdoms campaigns are super fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty different from its predecessor, but still has the same spooky vibe.  Brutally difficult but still fun enough for you to want to keep getting better.  Add this one to your Lovecraft inspired games collection, same great narrator as the first Darkest Dungeon, same great characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just because it isn't a carbon copy of DD1 doesn't make this a bad game. It's different and it retains the core identity. Just give it a chance and you'll find yourself playing until you finish all the Confessions. And then you'll realize there is also the Kingdoms.\r\n\r\nR.I.P Wayne June (1954 - 2025) \"A moment of valor shines brightest against a backdrop of despair.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It takes a while to adjust to the differences between the first game, but you're as hooked once your into it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't usually like turn based games, but this one stuck with me. The soundtrack, artstyle, and overall gameplay feel was fantastic. It is difficult to get used to at first, especially the kingdoms game mode, but over time it will become easier to understand. Overall amazing game with tons of hours of gameplay and characters that you will enjoy building up with the best quirks and trinkets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just wanna say that this is a very good game. I liked DD1, i like DD2 too, its a very good roguelike and it is cool. Combat is improved compared to DD1, yes the old management system is gone but the new system is cool too. I've now officially gotten all achievements as well, all 3 kingdoms beaten on bloodmoon, all confessions done a long time ago. The new changes to heroes were relatively intuitive, it did make it weird to play some classes, while others felt more natural. All in all, good fun, might have spent way too much time in this game though :D.\r\nRIP Wayne June, ty for the amazing narration in both games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's like it's own darkest dungeon... but still a darkest dungeon... but i love it because it's like a darkest dungeon but a different darkest dungeon... a darkest dungeon truly....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The combat is worse than dd1. '1' run is quite lengthy as you need to go through 5 confessions, and each confessions has 3-4 region you need to visit. Overall not that bad i guess. Just don't expect it to be anything like the previous game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Outstanding visual style and music.\r\nDoes a fantastic job of maintaining the atmosphere of the first game.\r\nThe gameplay is a bit less replayable as the first game for me, but some of the new changes are great improvements such as combat items.\r\nOverall a great sequel to the first Darkest Dungeon.\r\nAlso, narration is just as epic as the first game. Rest in Peace, Wayne June",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "quite different from the first game but overall i believe it to be an improvement/ still very difficult but feels more impactful to move forward in the story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While I am disappointed that they didn't build on the DD1 formula, the game is still quite enjoyable by its own merit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just like its predecessor, this game is essentially a casino in disguise. The pressure checks are intense and thrilling as always, but the whole mechanism (and the updates) for paths of hero and the altar complicates the game (not in a bad way), it takes more hours to get a grasp of the game. When you attempt a seemingly winnable (especially at the start of an expedition) encounter, the game will always punish you for your lack of preparation, and this is why it makes this game hard but fun at the same time. \n'Be weary, triumph and pride precipitate a dizzying fall'\nOther than that, soundtrack and animations were cool. Need a buff on the vestal and the duelist, the mechanism of latter is really confusing to play with.\n:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love love love this game! Such a huge transition from the first game and we actually get some backstories! I love learning how these adventurers came to be and the animation is smooth and crisp. I can't recommend this game enough, definitely one of my favorites to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Darkest Dungeon 2 is one of those games I never asked for a prequel to, yet still eagerly jumped into the moment it came out.\n\nMy first impression of this series goes all the way back to 2013, back when the Rock Paper Shotgun site “existed” (yes, they’re dead to me at this point). I remember seeing an article about this very peculiar-looking game with a striking art style and a buzzword I had never seen used as a mechanic before: “Stress.”\n\nIt took me a couple tries with the first game to understand what the developers were going for. The core mechanic of Darkest Dungeon is all about managing a team of heroes through brutal dungeons while wicked music and a very iconic narrator describes every action. If you’ve heard certain quotes floating around the internet, chances are they came from this game.\n\nThe core gameplay loop was simple: recruit a bunch of random-stat heroes, throw them through a trial by fire, and hope a few come out with good pros and minimal cons. The rest? “Letting go.” I remember a quote from Rock Paper Shotgun: “You have to play this game like an HR manager if you want to excel.” That sentence alone tells you exactly the mindset you need, because the game doesn’t show an ounce of mercy with some of the worst RNG encounters I’ve ever seen.\n\nSo why am I talking so much about the first game before reviewing the second? Because DD2 keeps the core mechanics almost identical—but improves a lot more. Here’s how:\n\n\n---\n\n1. Major visual upgrade\n\nThe graphics are massively improved. The characters feel present instead of cut-out animations, yet the devs still preserved the original art style. Everything is more beautiful—and more horrifying—at the same time.\n\n2. Heroes are no longer disposable clones\n\nYou’re not just managing random faces you can throw away anymore. Each hero exists as an individual character with their own identity. This opens the door to a “backstory” mechanic, which ties directly into unlocking their unique skills.\n\n3. A new travel system with the Stagecoach\n\nInstead of selecting a dungeon and side-scrolling through it, you’re always moving through stages on a Stagecoach. This introduces path choices that affect your run, rewards, suffering, and even your ability to collect “Hope” (the currency that lets you “fail better” next time).\n\n\n---\n\nThese are the big changes you’ll notice immediately. But there’s another major one fans will spot right away: the behavior system.\n\nIn the first game, when a hero hit max stress, they’d gain a Resolve state—good or bad—based on RNG, and you could later remove bad quirks by tossing them into the Sanitarium. But in DD2, you can only remove negative traits during Field Hospital encounters, which are not guaranteed to appear at the end of each region. This adds even more tension, since stress and quirks stack up with no guaranteed reset button.\n\nI’ve seen many hardcore fans express disappointment because these changes remove the opportunity to create hilarious setups like the infamous “Gang of Crusaders” or the “Pain Train”—broken but fun duplicate-hero teams. In DD2, duplicates are no longer allowed.\n\nDespite that, the game is still as unforgiving as you remember. But I think they improved the gameplay loop significantly. It works especially well on Steam Deck (runs smooth as butter, by the way). It’s the kind of game you can pick up, fail horribly, put down, and come back to later. Rinse and repeat. Somehow you still feel like you’re progressing, even with all the glorious failure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard but very fun and challenging your skill to manage the turn base fight.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a Turn based game, DD2 offers pretty fast paced action.  Quick group setup and a variety of journey lengths let you learn the mechanics with lots of different parties and then galvanize one team to push for glory.  The cart path ride is a little tedious but there are plenty of challenges to keep each run fresh and make different trinkets viable based on item synergies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good. Yes, it is nothing like the first game, but if you want to play DD1, just play DD1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bruhh, the game is hard af beyond the scope of my skills... I kepy dying in the stage two like literally everytime...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I guess I'd describe this one as more a \"re-imagining\" of the first game, rather than a proper sequel. Some of the original's mechanics have been either muted or expanded upon. Some interesting, alternate mechanics have been introduced. There's more visual flourish to the already-nice art style. There's a bit of a learning curve here, but it's one of those thing that \"just clicks\" with a few hours of play. Overall, it's a nice little turn-based strategy game in it's own right. I've enjoyed it well enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still dark and grim but not as grim-dark as the original. Now on a road trip to face your literal personal demons! \r\n\r\nMost of the original classes are back with a few new ones. The relationship mechanic is a new twist that can lead to literal backstabbing. The game actively encourages learning from your mess ups and TPKs and you will mess up guranteed. \r\n\r\nReally the only major gripe I have is unlocking the Crusader has to be unlocked by a quest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is surprisingly different from the first game while still keeping the core gameplay aspects",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love this game!! it's very much as advertised - punishing, dark, all that. but it's also really fun!! i love my little guys even though they keep getting murdered!! you don't have to be super great at the game to enjoy it, and there's a good difficulty curve that eases you in to it's more unforgiving mechanics!! really good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. If you liked the first one, you'll most likely love this one too. There are pros and cons to this game, just like its predecessor, but in my opinion, the good exceeds the bad in a huge way.\nThe combat is beautifully crafted; it maintains the essence of dd1, and expands on it, changing many small mechanics, and making it feel similar, yet very different at the same time. It's grindy, just like the first one, but it's SO MUCH FUN. \nI have to recommend this game, but only if you know what you're getting yourself into, these games are not for everyone, but again, if you liked the first one, surely get this one as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very challenging learning curve. Not for the feint of heart. Highly enjoyable game play experience through and through. 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SO after like 80 hours\n\nThe game is pretty interesting, it takes a different way from the first one. I am a minority of the player of DD;because I play the first in radiant mode (with mods that eradicates the farming from the game), and the second in radiance with some mods for a better experience. With These I could appreciate a game that would be too unforgiving for me and would be perceived that is wasting my time.\nother than that DD2 have 2 game modes, very different from each other (kingdoms is the real endgame),that can follow really different kind of players.\nAfter the first it seems like a downgrade but it is not, it want to create a different experience in both atmosphere and game design; the combat now is more complex and is the center of the game, the characters are very well balanced now (after some reworks); the mod community is not active like the first one but you can find some Quality of life mods that are really appreciated.\nAbout the atmosphere lost a little, the OST are not remarkable as the first one and the story is not as interesting as the investigating horrors of the manor in DD1; but as I writed before the gameplay loop is a lot better and more catchy, and the animatios are a real gem.\nAlso it have the same negative things of the first one, like critical attacks out of nowhere that nearly one shot one of you characters and the RNG that hates you in the crucial moment, but it is part of the experience.\nSo, in the end I would recommend only if you like a LOT the combat part of the first one (Like me) and would try something different\nAlso a good note is that the game receive constant patches and \"content\" as I write the review.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A damn good amount of fun with the Darkest Dungeon aesthetic. I really enjoy the kingdoms game mode.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Darkest Dungeon II has the same flavor of the original with mechanical improvements. The run based system provide a lower time commitment and allows space for the player to make mistakes because the consequences of building a hero in a particular way resets at the end of a run. The game has a great sense of progression. The initial hopelessness of reaching your goal in the beginning gradual opens up as you gather more upgrades and improve your skill at the same time. All the heroes have a unique feel to them and completing the shrine of reflections to learn more about their backstory added a sense of depth to their character. If you enjoy turn based strategy games, consider giving this one a shot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, addictive, and easy to get into. Unfortunately the freedom of customizing your team and playing how you enjoy comes at the cost of fighting the final boss. This game is built on failure and persistent growth, but can feel disappointing when you consistently get to and fail the finale. You can look up meta strategies to finish the end, but it takes the fun out of the journey. Still worth your time, just not as much as it thinks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man, I was already obsessed with Confession mode, but once I tried Kingdoms, it blew my mind. It’s got that perfect mix of chaos, strategy, and freedom.\n\nPicking your team from the start feels great, the balance hits just right, and every run feels like a new story waiting to collapse in flames. it’s dangerously addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El juego esta increible, una de las mejores secuelas, que de otra forma no creo que podrian haberlo mejorado mas. Tiene sus fallos, eso si, todavia me falta pasar el jefe final de la 5ta confesion y jugar el otro modo, pero habiendo desbloqueado todo casi y el loop jugable es muy bueno, el autoguardado es muy de agradecer porque las confesiones largas son de sentarte como 4 horas seguidas xd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More of the same darkest dungeon you liked, but they gave it the worst UI i've ever seen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On and on, over and over, until the truth is laid bare, and you are finally free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this has allowed me to let go of things, to not fear what is to come next. The Gothic art and sounds, as well as the announcer sell the whole game. Seeing how friendships are bonded and enemies are made between each other, is magical. One can start over again, and again, and again. Ah-men",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very solid turn based roguelike. I enjoy the pacing and the puzzling and in many ways it is a nice improvement from the last game which I also enjoyed. Solid bit of fun, and often a beautiful bit of poetry for those who struggle with their mental health.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love just about everything. Amazing art, gameplay, atmosphere, music, everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game with tons of options and possibilities but sometimes very frustrating. Recommended for patient players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The entire game so far has been a constant downward spiral of agonizing misses and painfully low amounts of healing\n10/10 its just like the first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game  since darkest dungeon, if they bring back a sort of color of madnnes DLC the game will be finished perfectly   i recomend it if u like rpg or rogue like games",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its not like the first game but is certainly a pretty good game , very enjoyable to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Replayability through the roof, much simpler in terms of progression but also it's a nice departure from the heartache and migraine of losing a champion in the first game. REALLY enjoyed art, animations and how they reworked paths to provide more unique (all be it, sometimes not perfectly balanced) playstyles. I enjoyed Confessions the most but Kingdoms is a really fun addition to the game that gives you something similar to the first game in terms of harsh punishment and building up to something. Absolutely love this game with all my heart, flaws and all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Darkest dungeon two is an excellent successor to the first game in the franchise  and improves on every single aspect of the first game\n\nIn my opinion, if this game didnt have the most bada** narrator and lines in gaming history, it would be missing its greatest asset, but dont take that to mean the game is lacking in anything\n\nIt can be brutal, but if you're smart and do right throughout your runs, then winning isn't too difficult, this game will* punish you if you make mistakes so it's important to really think about each action or route you take through each attempt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MAMAT KUNЬIM NAHUI ME DO THIS PIZDEC LUCKY EBANAYA MYA MYA PEG I WANNA BE HAVE LOVE IN MY COCONUT IF I PLAY AGAIN IN THIS GAME I DOWNLOAD ZIP AND LEONCHIK AND DONT LEARN NORTH KOREA LANGUAGE... THANKS FOR THIS GAME I LOVE THIS TY NAHUY",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Liked the first dd and i bought the second one and i can say by far its better than the first part (if you dont like games which are depended on rng and can rage quite easily, dont pick this up)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Также как и 1 часть, продолжает традицию унижения игрока рандомными событиями, критами, промахами.\nМногим не зашло внедрение метапрогрессии в виде того, что ты теперь один ран хуяришь от 1 часа, но лично мне это зашло намного лучше, не знаю в чем-то это сложнее, а где-то и легче. \nЕдинственное что мне не нравится, что начиная с 3 акта, тебе уже необходима определенная стратегия для того чтобы победить боссов, но эта же стратегия может не дойти до этого самого босса, либо наоборот, отчего ты хуй пойми чё делать то, ну и жопа горит ещё больше. \nВизуал это просто ахуй, анимация подготовки и после использования скиллов вообще не надоедает, сделано ахуенно и это подкупает. В общем, жрать эту серию игр я могу и буду всегда \n7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, very replayable and hard as hell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "kill yourself\nterriffic art style\nweird balancing\n\nwould crit with leper again while Wayne June whispers in my ear 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As the sequel to Darkest Dungeon, I think it works.\r\nThe RNG elements are much more forgiving compared to the first game (Red Hook must of given in to all the negative reviews complaining about the RNG for DD1).\r\n\r\nThe narration and music is on point, much like DD1. Stuart Chatwood and Wayne June (God rest his soul) continued to excel at creating the pressing atmosphere via soundtrack and narration respectively.\r\n\r\nThe only dig I have at DD2 is the enemy variety, specifically for the individual locations, is a bit lacking. I understand the jump to 3D animations may have limited the enemy variety, but it's still a shame (hopefully future modding can fix this at some point).\r\n\r\nSo, overall, if you played and enjoyed DD1 then it's a must to play DD2.\r\nIf your curious about the Darkest Dungeon games but aren't too familiar with difficult roguelike, then it may be best to start out with DD2 first as it's a lot more forgiving than DD1 as less time investment is needed for each 'run' (a run in DD1 is a 40-50 hour campaign more-or-less while DD2 runs are 2-3 hours).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a group of people in a wagon with pain and small bits of hope what more do you need?  (But serious talk. one of the best games i think i have played this year)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a big fan of the original Darkest Dungeon but I held off on buying this one at release due to the change from dungeon crawling to the wagon system. Bought the game on sale and immediately was hooked, the gameplay is a little different than the original but the core systems are all the same. \n\nInstead of focusing on amassing a bunch of trinkets and a high level roster of heroes over the course of multiple runs the progress is mainly contained within a single run; leveling up a team over the course of a run and hope they become strong enough to beat the boss. This new system offers much more variety unlike the original game where you could tend to just always use the same high-level team with overpowered trinkets to solve every level the same way. \n\nBig thumbs up for any fan of the first game, especially if you got tired of the hamlet/hero management aspect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, play and suffer or bathe in inglorious bloodshed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It takes a little while to get into after having played DD1 a lot. But once you do, its awesome.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall fun (once everything is unlocked) and cool backstories, but who tf thought it was a good idea to lock all the good skills behind Shrines of Reflection??? Literally fire them, sorry not sorry.\r\n\r\n14 main heroes * 5 reflections / 3 shrines per run = AT LEAST 23 runs to get all the skills, assuming you mainline 1 shrine per region. And most of the time, the region nodes are hidden so you won't even get to the shrine unless if you're lucky. So average 1.5 shrines per expedition pretty much. \r\n\r\nLimiting the choice of pathing through regions = unfun. Limited skills and combos in the beginning = unfun. Horrible candle econ for unlocking items = unfun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I hope they add Musketeer with a fully animated gun. Just- the clicking bits. Her having a reload animation between attacks. That would be peak and I'd love it.\n\nOf course, def wouldn't complain about a whole new hero either ;P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game so far, enjoying it more than the first one actually!  Artstyle is sublime",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest narrator of all times strikes again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hard as always and I wish I would stop playing.  Never ending grind to the mountain leaving me with a hallow despair.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cheers to the devs who keep tweaking and improving characters and add more kingdom campaigns, and making the updates available for free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Darkest Dungeon 2 wants you to survive. To live. To thrive.\r\n\r\nBut it wants you to do so hounded by doubts, struggles, and whether or not you're prepared for what's to come.\r\n\r\nIt's a beautiful grim-dark fantastical journey I can't recommend enough!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not really in the business of making those enormous reviews, so I'll keep mine brief. Specifically: I love DD1. When I first played DD2 I was so disappointed by the changes that I don't think I completed a single successful run. However, when I heard about the new Kingdoms game mode earlier this year, I gave it another shot and LOVED it. Probably like 300 if my hours are kingdoms. By the time I was done, I had come around on it enough that Confessions didn't feel so bad anymore. So I definitely think if you're on the fence, it's worth giving Kingdoms a shot.\nStill hope that if we get a DD3 it'll bring back a proper Hamlet and stuff, but I'm no longer nearly as bitter about this as I once was.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A literal aspect of Death killed me just after a boss 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An exhilarating adventure through the trials of heroes facing the horrors of madness inducing monsters and terrors. The effects of your choices on your party can help or hinder your ability to be successful. All set to the back drop of the amazing theme and art Red Hook is known for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Much strategy.  Such sanguineous.  Very good game.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This is not a sequel to darkest dungeon, i have 200 hours on epic 50 on steam, and it never at any point hit the same as the first. the 3d animations and tweaks to the artstyle are the high point and not much else, if you want a sequel to the original, just play black reliquary",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not a fan of the direction that red hook decided to take the sequel to Darkest Dungeon. All the other reviews saying not to expect the same type of experience as the first game but my question is, why would you expect anything else from what made the first game so much fun? There is not any real linear progression, and a lot of the mechanics are very bland and uninteresting. The carriage driving mechanic is strange to me and feels almost like a subway surfer clone type of design, this game has little in common with its predecessor in terms of the progression and the mechanics of the game. I am personally frustrated with the rogue like design because they had a great game with the original and what I wanted this game to be was a sequel with some new classes and mechanics but it doesn't feel like a darkest dungeon game at all. The animations are neat and all but it feels like a red herring to distract from the mechanics of the game being repetitive and grindy with no real satisfactory succession until many failures later. I would strongly prefer Red Hook to take the new animations and upgraded visuals and combine them with the linear progression and difficulty that came with the first game because they did it just right. I think it's a shame they deviated from the design of the first game and I am hoping they go back to it if they decide to make a 3rd game. With that being said if you are a fan of the original Darkest Dungeon I would say save your money as this game simply doesn't scratch that itch in the same way.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Took all the unique fun of the first game, tossed it into the trash. Then made two different game modes that are shitty rogue-lite modes. God, I hoped Kingdoms would be fun, but its the same crap as the first mode.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "too much farming. 60 hours and still haven't unlocked everything--would be OK if it wasn't actual buffs being farmed. too much dice rolling--90% death resistance is unfun. i beat one run by succeeding at the death save roll like 15 times in a row which was undeserved, then i lost the next run because i failed my first death save. and in the latter case, the enemy brought my guy from 100% to 0% before i had any opportunity to do anything about it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'd have very likely recommended this game before Supdate1, even probably before Supdate2, but after that, all I'm seeing are a tandem of bad decisions on the dev side that made me just stop enjoying the game at this point.\r\n\r\nProbably a new player would enjoy it, and I can say that even after that, the game is good, but I can't in good faith recommend this game at this point.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Somehow, this game feels like a downgrade from the first part. There's no more persistent progression or castle leveling. The reworked mechanics feel strange and confusing. Most of the characters seem useless or locked. I don't see it as a direct upgrade over the original and can't really recommend it in its current state. On top of all this, it lacks any form of multiplayer",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Take all the jank/flawed stuff from Darkest Dungeon, put it in a new game, streamline all the stuff that people actually enjoyed. Add in time wasting and a significantly worse Slay the Spire gameplay loop. \n\nThat's this game. Also there are almost no actual dungeons. 5/10\n\nEdit: Also I thought of something a bit later as well, this is just a bad roguelite. The very best roguelikes in the genre (binding of isaac, slay the spire, etc.) will let you feel utterly super omega broken if you get an insanely good run, this game just...doesn't. The power fantasy is part of what makes the best roguelikes, roguelikes. Even Elden Ring: Nightreign (which people don't call a roguelike because you can't really become super broken) is still better than DD2 in that respect.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's just kinda mean. And not in a fun challenging way, more in a 'I think this game hates me' way. \n\nIt's actually quite a good way of systemising the existential despair of trying to live under late stage capitalism because it's just an inevitable unfair cruel grind. And I know that's kindof the intention, but you know. I'm alright thanks. I already get this in my day to day life. I don't need it from my games as well.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unnecessarily difficult in a particularly frustrating way. The game penalizes skills based on an internal relationship mechanic which is pretty clouded, when this happens every time you use that basic ability you get penalties. This can be annoyingly crippling when you get basic skills for your hero's build cursed.\r\n\r\nThe original game with mods is better than the sequel",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wish I could give a 'meh' rating for this game but will have to settle for just not recommending this game.\n\nI understand Red Hook wanted to make a sequel that was distinct from the original, but unfortunately the majority of changes they made were for the worse..\nThere's a lot of criticisms for this game, but the number one problem I have is that the game feels like there's no stakes and no continuity. \nYou make a mistake and get a hero killed? No worries they'll show up in your next run. \nYou spend a bunch of money, time and effort levelling up skills, developing relationships, and outfitting heroes with unique trinkets? They're all gone and back to square 1 once you start a new run.\nI no longer feel like I'm playing a cohesive campaign, but rather like I'm playing an arcade machine starting from scratch every time I start a new run\n\nOne of the main praises about the original DD is that you grow attached to each of your heroes as you slowly build up their quirks, skills, trinkets, etc and so when you lose one of them it hits HARD. That same feeling just doesn't exist in the sequel and so unfortunately, losing a hero is now more of an annoying nuisance rather than a crippling loss to your campaign\n\nRed Hook needs to take a long hard look at the original Darkest Dungeon while they work on their third installment..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really wanted to like this game, but winning doesn't feel earned and losing feels like RNG bullshit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The early game was immensely frustrating and I figured I would push through it to see if things got better on the other side. Don’t bother. It never gets better. No matter how much you unlock, the same unfair, uncaring boss monsters await you. There is nothing for you here. Don't follow me in.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love the first game and spent around a thousand hours in it. With this one, it took me only about 20 hours to realize it just isn’t worth it. Some of the new combat mechanics, the hero stories, the visuals, and that familiar atmosphere are all appealing. But the overall concept didn’t work for me at all, partly because of the unnecessary roguelike elements, and the game became uninteresting for me very quickly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't recommend. You need to grind for a long time to unlock the necessary skills/equipment for your team. I expected that, it's that sort of game. I put 63 hours in. I unlocked all the team assist options and got 5-6 characters to full unlock. It doesn't help. The problem is that even after all that grind, it is still too damn hard. There are no viable options to perform better - the only exception is if you happen to RNG into the right piece of equipment for the right character.  You're better off spending your time and money elsewhere.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you thought the writing for darkest dungeon was bad, just wait until you experience 2. (If it sounds archaic, cram it in there!) Other negative reviews say the rest better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its not darkest dungeon 2, its something different and its just bad, its more repetetive than first one since run takes hours easily, and more grindy since you can basicly end up with zero progress. mygod stagecoach control is still bad after years, i wish the very worst in life whoever is responsible for that mechanic.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If I could give a mixed review I would. It has the potential to be an amazing roguelike squandered by some bad design decisions.\r\n\r\nA lot of the bosses are \"puzzle\" bosses, meaning if you aren't aware of what the gimmick of those bosses are, you will either suffer greatly or lose entirely which can be extremely frustrating losing a several hour run at what feels like no fault of your own.\r\nArguably the biggest problem is how bad the unlocks system is. With how little you have unlocked at the beginning, you have to use candles to unlock new items. This wouldn't be such an issue if most of the items you have unlocked at the start weren't almost worthless, making the starting experience feel miserable and tiresome as you won't have many reliable or good ways to manage the relationship system or stress.\r\n\r\nIn some aspects it seriously exceeds the first game and I feel if the unlock system was done differently or not done at all I feel like I'd really enjoy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "more fluff than depth. overly complex and not rewarding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unbalanced,  bad game design.  what a letdown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Why are only two characters viable?\nWhy is Vestal a completely wasted slot?\nWhy can I get a critical 0 Heal that bleeds my character?\nWhy is Abomination guaranteed to destroy your team's relationships?\nWhy is Duelist, a dedicated Riposte character, capped at the lowest health in the game?\nWhy does my entire run's success depend on how much alcohol they sell at the inn?\n\nI understand the gimmick of \"Lose, and learn from your mistakes\" but what's to learn about gambling, other than learning patience whilst rolling the dice on whether your characters are going to respect each other?\nMaybe it's a skill issue. Maybe I'm bad. But I can't enjoy a game that doesn't reward me for my efforts, emotionally or literally.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I feel like I have to sink so many hours into this game just to get a win any other rougelike I would feel fine with losing but this game I'm losing to bs bc of relationships,stress meter,or bad quirk combinations(I had a PD that had a quirk where they would go to the front line...) simple buff displays would be nice like hovering over skills in the menu why would I bring a skill I have no clue what the skills do and they find out it doesn't go with my team comp I dont want to study the glossary for symbols that should be there I was a semi fan of the first one but this game needs more work still.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope. 1 > 2. See the active players on both, nuff said.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TOOO MUCH RNG. AND WHY TF IS MY BOY CRUSADER LOCKED BEHING 10€",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no arbalest or shieldbreaker, what's even the point.\n\nin all seriousness it's funny to me that DD2 would squander what made DD1 so memorable and brutal by stripping away any legitimate consequence via the implementation of rogue elements and meta progression, but I'd be lying if I said I didn't have *any* fun. I don't think it holds a candle to the original, and it certainly demands far less of your attention and long-term strategizing (ironic given the insurmountable bloat of systems upon systems), but combat is enjoyable and I might be the only person in the world who actually likes the stagecoach and Slay The Spire-esque map mechanics. Unfortunately, the system bloat is absurd. There's so much shit to keep track of and the game simply is not fun enough as a whole to justify it.\n\nI just really cannot get over how not Darkest Dungeon this is. I’ve been forced to outright abandon 30+ hour runs on the original due to my poor decision making, bad planning or just shit luck. I’ve gotten to the Darkest Dungeon and found I had no idea what I was doing, and I’d royally fucked myself by putting all my trust in just a handful of characters and not optimizing my town and skill progression. Skill issue or whatever. But here, it doesn’t matter, because the meta game progression (a benign concept to mash with this series to begin with) is linear, runs are short and can be beaten in a matter of hours at most, and consequence only lasts as long as the run. Sure you keep your living heroes, but that's more a boon than a broken knee. I feel shitty to admonish a game because its different from the first game and attempted to reinvent itself, but I really do not like it here. Execution is lacking, my time is better spent in the Estate from the first game. \n\nwish i could give this an inbetween kind of rating because I did find some enjoyment, but there's no real reason to get this when you could just get the original.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "kinda odd compared to the first, if you like long roguelikes though, go for it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Play the first game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "worthless pain in my ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Total disappointment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dogshit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "imposes stress",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "--",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Let's start with this: Darkest dungeon 2 is a good game. It improves on a lot of factors that the first fell short of but still falls short on a lot of others. This game is a complete downgrade in comparison to the first one but I just cannot pin point exactly why, yet i hope my review is still coherent.\n\nI will point out what I find nice first.\n\nStarting the game, It was really pleasant to see a different fighting mechanic. I think the tokens were a really good addition in order to make AOE attacks more useful, as well as make buffs and debuffs more impactful. My second favourite character, leper, has really benefitted from the changes, and the jester leper combo is as strong as it could ever be. I am happy with that change. \n\nThe new art direction is really nice. Of course the first one had a unique style, but so does this one. I personally prefer the style of dd1 better, but I can see the appeal here too. The lore is still grounded in the world it's made for, and even good in some aspects (i'm a big fan of the burnt city), the enemy design (art wise at least) was really good, and as a guy who loves the crusades, and especially just medieval Europe in general, i ALWAYS go through the forest with knights every single playthrough with no fail. Regardless of reward. I just genuinely love my own cohort, carefully hand picked to make for a good contingent of war ready men and women, against a barely alive levy leftover from an army long forgotten. It feels nice. It tickles me well.  The music, in my opinion, is on par with the first game, but the first game will win any comparison when it comes to sound design in general - exception for the draggi ng of weapons, the gurgling laughter of your enemies and the cries of babies immediately afterwards your heroes get assaulted.\n\nThat being said, those are the only good things I have to say. It goes downhill from now.\n\nFirst and foremost, the most popular hero and arguably the mascot of the game, the crusader is hidden behind a paywall. I would've been fine with the fire girl being a dlc - but two main game heroes from the old game, and one of them arguably the mascot of DD as a whole and probably the most popular vanilla hero in general? Behind a paywall? I was completely turned off at launch from the game because it didn't feature my boy. So buying it WAS a requirement. And now Abom is hidden behind a paywall? Abhorrent. You do get a new area - crimson court style - but give us the main game heroes and make new ones for the dlc, Duelist style. It's incredibly scummy to have beloved characters from the first game locked behind a paywall. I personally wouldn't have played dd2 at all had I not been able to buy my boy. Deus vult bro. \n\nsecond point, it's hard for no reason. I do mean this in a bad way. It seems like the developers went: \n\"How do we make the game stand out from the first one?\" \"I know! Let's just make it artficially harder!\" \nit was the same design choice as dark souls 2. I'm a big fan of ds2, but the enemy placement was extremely unfair and only there to make it arbitrarily harder. DD2 also suffers that issue. Enemies have bloated health pools, borderline busted combos and, thanks to how much slower and how much of a slog the game is (fights almost always take around 10-15 minutes, unless it's 3 enemies), it just makes you feel like you're not really doing much other than wasting your time. The sea area specifically is much harder than the rest. I had more success in the forest, the countryside with cannibals, the burning city and the warrens combined, in a failing run, than I ever did in the sea level. The enemies there have just about everything except burn. Shuffle, big health pools, a unique and impactful debuff, strong team comps, etc. So fuck you if you play leper and jester. Your jester needs to push your leper up front so he can do something. And then bam. Another push. Of course there's counter play - and I did have fun playing the game. But when most attacks do so little damage... what's even the point? Only on your side of course, the enemy will always top roll on damage rolls. And heals? They're limited. And always weaker than enemy heals. Lore reasons? You have to ration them throughout the run and the brigand doctor doesn't. Gameplay reasons? Lol git gud.\n\nStarting out is way too sluggish. To get all your heroes abilities, you need 5 shrines. So you basically need to go through purposely bad roads to get to something that will allow you to team and character build better. I think that's stupid. With how many characters there are in the game, it will take you hours to get all abilities for just 1 - and god forbid you want a crusader support from the get go. Starting abilities tend to be strong but often mismatched. Card games like slay the spire often suffer from card bloat - as you progress, especially with after play level ups, your deck draw gets more bloated and so, where as before you would almost always get at least a few useful cards every 2nd or 3rd encounter, every single encounter now has you see whether or not you need an exhume, an intimidate or a bastion. And you are going for a strength build. DD2 suffers the exact opposite problem. You start really weak and have to force yourself to make probably bad choices you're not ready for just to probably have fun later on. The upgrade system though, with candles, i find really good. They should've put the abilities there. \n\nIn my opinion, dd1 is a better game. Fights tend to go out faster, but they are at least not sluggish like they are in dd2. In dd1, you can slow them down with certain team comps. In dd2, if you try to rush, you will be punished for it, and even so, it will still take far more time than most modded bosses too. I think my umibozu and plague priest fights took around 9 minutes. A single encounter in the flaming city often takes me around 12. It's sluggish and you cannot do anything about it. In dd1, it snaps and goes by quickly if you want it to but you can force it to slow down. Plus the fact that dd1 has better mods, in my opinion better areas and heroes, and the fact that it's also a better rogueLITE, it's a superior game with just enough control for you to do as you wish. DD2 only offers one dish. And that's fine, maybe the dish was made well and i don't recognise the taste, so those that love that taste WILL love this game, but to me, it is an inferior product. It is an inferior product that forces you to buy your favourite characters. Fuck you if you want to play crusader or abom, buy our game. Not to mention, the whole bounty hunter system that... in my opinion sucks. \n\nDD1 has more bang for your buck. It regularly goes on sale for... maybe 15 euros for all dlcs. Dd2 on other hand, on sale, is still around the 50 euro mark if you want the dlcs too. Granted, the abom dlc does come with a new area, but at least in DD1 the CC dlc didn't lock a main game hero behind a paywall, and just gave a wholly new one. DD1 is superior in mods, gameplay (especially for busy people), art design in general and price. But, if you enjoy roguelikes with a strategy aspect, like an XCOM x Pixel dungeon... you won't really find it with dd2 but the experience will be relatively close, if you're willing to pour more than 30 hours to get half of the main cast some decent abilities and buffs.",
      "voted_up": false,
      "votes_helpful": 93
    },
    {
      "review": "I've tried this game twice now, once at launch and just recently over about a week, and things just don't make sense.\r\n\r\n1. Maths not mathing - a 50% damage reduction buff doesn't always reduce the incoming damage by 50%, it often reduces it by less. For example, I've seen 12 damage get cut to 8 but the 50% damage reduction buff is still used up. I assume this is because of how the damage equation is written but it feels like the game lying to me about what something does.\r\n\r\n2. No respect for my time - The game spends so much time that could just be skipped over because it either A) adds nothing to the game or B) you heard this one many times before. \r\nExample for A: having to \"drive\" the stagecoach from the Field, to the Alter, then on to the Inn to spend your candles, pick you act and heroes. You're just watching the stagecoach drive between these places to go pick some options.\r\nExample for B: Every time you start, you have to listen a little story bit for that act. Doesn't matter if you've tried and failed to finish act x 10 times in a row, you have to listen to the story bit again. Yes there are a few story bits for each act but after a few hours of play, I'm just over listening and want to get the next run up and going again.\r\n\r\n3. What dose this buff/debuff do - There are a lot of buffs and debuffs in the game and not all of them are in the ALT window to explain what it does. Many times I look at a hero's ability, see a buff, look at the ALT screen and it's not there.\r\n\r\n4. Healing and Damage - healing is now restricted to the target having HP at of below a percentage of their max hp, this is really not fun to interact with. DD1 let you heal whenever and enemies could regularly crit you for over 75% of your hero's max HP, so keeping people topped up made a lot of sense. Now, you can't do that. You have to sit and risk a big crit putting you on death's door because the game says no to healing minor wounds yet enemies can and will still crit your heroes for 75%, or more, of that hero's max hp. The occultist can heal over 50% of a hero's hp if he has three stacks of empowered buff and you get lucky on your rolls, but it can take two or three turns to get the occultist buffed properly. You can also land the heal, then get hit for the big crit and have all that effort essentially reset. I've had a character crit for 30 damage and their max hp is just 39.",
      "voted_up": false,
      "votes_helpful": 143
    },
    {
      "review": "Playing this game is more annoying than fun!\n\nI don't really understand what to love about this game. This game has so many weird, unnecessary and annoying gameplay mechanics. And those are my first impressions, which actually turns people away from this game I believe.\n\n1. Right from the get go, why every time I have to start confessions with that stupid stagecoach intro? Why I can't Instantly pick my heroes and start the journey? It's just a time waste every single time!\n\n2. Stagecoach riding is very bad, it just doesn't feel good controlling it, no matter the settings, actually it feels very bad and cheap.\n\n3. First DD game you can pretty much play with mouse only, this game kinda tries to achieve that, but it just fails, cause you can tell playing with keyboard is much better...\n\n4. It doesn't really matter much which path you take, whatever you're trying to avoid, you're gonna have double of that in the path you choose. And the places you're trying to reach are really underwhelming. Risk & reward factor in this game is just terrible!\n\n5. Fights are all about meta builds and techniques, there's no fun in trying out different things, cause you're just gonna lose whenever you're trying to have some fun in this game...\n\n6. What the hell is this relationship mechanic? Probably can't make it any more tedious and complicated...\n\nWhat the hell were they thinking? I had way more fun in DD1 (and I'm no fanboy like the others) from the get go than with this one...",
      "voted_up": false,
      "votes_helpful": 101
    },
    {
      "review": "This is definitely not the DD1 experience.\n\nI was hoping for something similar, maybe even better than DD1 (my mistake, I know) — but this game just isn’t that.\nI’ve played for a while now, and at first I was impressed — but then the small details and minor gameplay issues broke my rose-colored glasses.\n\nIt may still be a good game for some, but for those who fell in love with DD1, it will likely be a heartbreak in the end.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "I want to like this game, I really do.  But its possibly the worst experience I have ever had in a game.  Confessions was never my thing, I preferred the more sandbox approach and DD1 (which is a game I still adore), so when kingdoms got announced I was elated.  But holy hell, I hate kingdoms.  Its extremely punishing, and do the nature of the game, skills and RNG, you are more likely to lose in the first 10 days than after, so you just keep playing the same goddamn days over and over and over.  You cant be creative or experiment without risk of losing the run, and the hours you've sunk into it.\n\nI have never had a game make me for frustrated, feel more cheated.   Every time I play this I step away angry, not just at the events in the game, but at the time I wasted on it rather than doing literally anything else.  Id rather shovel shit than pick this back up.\n\nThe style, the character relationship system, hell even some of the game mechanics are great.  But the permadeath, insane amounts of single hero targetting, the absurd amounts of stress damage ruin this game.\n\nAlso, can someone explain why tf I lose faster on normal than stygian?  Like seriously, I am losing heroes before day 3 on normal but regularly reaching day 15 on stygian.\n\nIf you want to give it a shot, go for it, but be prepared for absolutely dismal experience that virtually never rewards you.",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Reviewing (mostly) every game (or DLC) in my library, part 362:\n\n⭐️⭐️⭐️⭐️⭐️☆☆☆☆☆ (5/10)\n\nSo, this is a weird one. I picked up [i]Darkest Dungeon 2 [/i]hoping for a refined, tension-filled follow-up to the first game, but… wow, it really didn’t stick. The first game’s slow, punishing crawl through dungeons is replaced here by a road trip roguelike that feels half-baked. The stress and affliction systems are still there, but stripped of their suspense and weight. It markets itself as a “rogue-lite with tactical tension,” but it’s more like a tactical-lite with the tension dialed way down and some baffling dev choices. Sure, you’ve got the same grim Lovecraftian atmosphere and art style, but the gameplay loop lacks the same gripping edge. It’s not a good sequel, and as a roguelike-lite, it fails to measure up to the first game’s carefully calibrated systems. I'm sure I could grind it out (5 hours isn't that much tbf), but I don't really want to.\n\n[b]⚱️ Pros:[/b]\n[list]\n[*] Gothic painterly visuals. The hand-illustrated, 3D, grotesque character designs and environments are still phenomenal. Every background, monster, and hero portrait is carefully crafted to evoke a sense of dread and decay, with heavy use of muted colors, deep shadows, and visceral textures. Even when the gameplay drags, it’s hard not to admire the sheer artistry of the world, which manages to retain that signature [i]Darkest Dungeon [/i]vibe. I wish I knew more about art, but I think this is the most beautiful art style in any game.\n\n[*]Streamlined combat. Battles are noticeably faster than the first game, which can be both a blessing and a curse. The fights are more digestible, and you’re less likely to get bogged down in overly long encounters. This can make the game easier to approach for newcomers or casual players, but it also removes much of the tension that made the original so addictive. It’s cleaner but at the expense of the original’s strategic depth.\n\n[*]Persistent character roster. Carrying heroes across runs adds a sense of continuity, and some of your favorite characters from DD1 return. You can invest in them, see their quirks play out over multiple trips, and feel a little attachment as you manage stress, injuries, and abilities. That said, these returns are hollow—the roster is cut dramatically, many fan favorites are gone, and characters feel weaker and less distinct than before. \n\n[*]Creepy Lovecraftian atmosphere. The game still nails the grim, oppressive mood through lighting, monster design, and ambient sound. Fog, shadows, and grotesque details make you feel like you’re on a road trip through a nightmare, even if the gameplay itself fails to sustain tension. It’s easy to get lost in the aesthetic, which is arguably the one area where DD2 succeeds consistently, though it can’t carry the rest of the game on its own.\n\n[*] Post-launch support. From what I've seen so far, the devs have continued to support the game with large patches and DLCs.\n[/list]\n\n[b]🪦 Cons:[/b]\n[list]\n[*] UI is difficult to read and frustrating to navigate. The interface is cramped, icons are tiny, and there’s not a lot of hover or tooltip information. This makes it extremely hard to understand what your characters are doing, what abilities do, or how stress and buffs are stacking. Combined with the already steep learning curve, it makes managing your party more difficult than needed.\n\n[*]Road trip loop feels shallow and tedious. The main “caravan” mechanic replaces dungeon crawling, but it’s repetitive and low-stakes. The navigational minigame with the carriage is more busywork than meaningful gameplay, and the stops you make along the route rarely feel consequential. Unlike the dungeon runs in the first game, where every decision carried risk and reward, the road trip loop lacks drama or suspense. It becomes a slog of low-stakes encounters rather than an engaging roguelike journey.\n\n[*]Runs are long, draining, and fixed in difficulty. Unlike the first game, which offered short, exhilarating bursts of tension, DD2 runs feel punishingly long with little variation in the challenge. The first game had a beautifully calibrated rhythm—you could take careful, strategic runs or go for desperate high-risk runs for valuable loot. The stakes felt tangible, and surviving a dungeon made your party’s story feel earned. In DD2, that urgency is gone. Everything drags, decisions feel less impactful, and you aren't able to quit either mid-run. I'm also not a fan of the new loot and progression and how it's tied to a currency system.\n\n[*]Deciding to leave behind hero investment and resource management. One of DD1’s strongest points was how much you cared about your heroes. When a character died, it could be heartbreaking; you named them, invested in their quirks, and shaped a story around their journey. In DD2, that investment evaporates. A death feels meaningless—you just shrug and restart the run with a new copy. There’s no reason form a narrative with them because you know they’ll return with the name next time. There's also no Hamlet :(\n\n[*]Roster cut and weakened heroes. Many fan-favorite characters from DD1 are gone—Abomination, Arbalest, Crusader, Houndmaster, Musketeer, and Shieldbreaker, I believe. Returning characters feel weaker, too. But that might just be me.\n\n[*]Arbitrary design restrictions. The game punishes heal-stalling or exploiting minor mechanics like having multiple of the same heros. It is a single-player game, so that tweak bugged me a bit. \n[/list]\n[hr]\nIf you enjoyed this review, please check out my curator page to find more: [url=https://store.steampowered.com/curator/45814768-Verdict-Play-or-Pass/]Verdict: Play or Pass. [/url] Also, please leave a like and visit [url=https://steamcommunity.com/groups/Indie_Gems]IndieGems[/url] and our YouTube channel for more reviews like this one. \n[/hr]",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Not sure what they were thinking of putting this weird wagon cart mini game in between the combat sessions. Darkest Dungeon one was great. But they over engineered this one.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I've played about 30 hours and have bought everything at 60% off and feel that was way too much to pay for this.\n\nI loved playing Darkest Dungeon 1, but Darkest Dungeon 2 is pretty bad.  And not in the sense of \"it's not like DD1, therefore bad\", but in the sense of as a standalone game, it's bad.\n\nIt's a confusing, \"lol! Gotcha! FU!  Go grind again\", RNG grindfest.\n\nOn the confusing part, you don't really know what's going on.  The UI is fairly bad.  Before an expedition, I wanted to change a path for one of my guys.  Must be in their character sheet, right?  Nope.  Changing a character's path is not in their character sheet, but somewhere else.  \n\nIn the beginning I did a multi-part quest to get the Crusader character unlocked.  Okay, that must be how I unlock the other characters.  After about 10 hours I didn't get any quest for other characters, so I googled it.  Well apparently you can just buy them outright, but nothing ever mentioned it.  You're supposed to just find out about it somehow.\n\nThese seem like a minor nitpick, but this happens all the time, especially when in combat you got SOME icon that applies to you/enemy but you don't know what it is.  It was surprisingly hard to find out what they do.\n\nAlso, before the expedition, you have an opportunity to buy things like items and wagon modifiers.  Why bother buying there when I could just find them during adventuring?  So I went about 20 hours before I (accidentally via google) found out that you need to purchase them here to have the potential to unlock them during your adventuring -- i..e you buy them to gain the opportunity to RNG them in future runs.  And there are hundreds of items, so the more you get, the more RNG you have to conquer to get what you want.  \n\nYou also don't retain items between runs.  Yep, you start from scratch.  Because screw you and your time.\n\nSpeaking of bad UI, there's tutorial popups that you can click on to learn about the game.  However, if there's more than one popup at the same time and you click on one, ALL of them go away -- including the ones you didn't click on.   Did you memorize the topics for the other ones?  No?  Lol, screw you.\n\nIn combat, if you blink at the wrong time you miss something that happened.  Or maybe you have a question on what roll and modifiers just happened.  Well, look no further, because screw you.  You ain't seeing it.  There's no log or details of what happened.\n\nIn addition to the grindfest for items, I grinded out the right quirks (and got rid of the negative ones) over 10 hours.  Then I swapped out one of my characters for a new one.  It didn't work well and that new guy died.  Realizing I wouldn't be able to make it to the next checkpoint, I decided to just end the expedition and return before everyone else died.  Lol!  Screw you!  All quirks you've been grinding for 10 hours gone -- there's no warning or explanation that would happen.  Returning with 3/4 characters alive is literally the same as a party wipe!\n\nBut that's not the only way you get screwed.  Want to fight a boss and didn't google it beforehand to find the \"correct\" party composition?  Lol!  Screw you and your 10 hours grinding.  Grind it again noob.  Have a balanced party that was fine for everything until you wanted to try whatever was in the library?  Lol screw you!  This boss requires all back row damage!  Now go back and regrind those 10 hours and make sure to google every boss beforehand you noob.\n\nYou may think, \"well just save the game before something risky\".  Lol!  Screw you.  There are no saves.  You can't go back.  If you spent 10 hours grinding something and just lose it all due to horrible game mechanics, stay screwed noob.\n\nThat's when I uninstalled.\n\nAnd that's the bottom line of why this game is bad: the developers do not respect the player's time.  All the grinding, random RNG, confusion are carefully designed to screw over your time.  It's like they realized the game is too short if you retained these things, so they brainstormed ways to screw you over and force you to regrind just to make the game a decent length.\n\nDo not get this game if you actually value your time.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Too random and expensive, all the cool characters are in paid add-ons.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I really gave this a chance, I loved the first one so much I bought it twice (once on PC and once on switch). But the core design loop of this sequel doesn't encourage and reward repeated plays or strategic thinking. \r\n\r\nI GET THE GAME IS MEANT TO BE CHALLENGING - its the feeling of learning to overcome the challenge and still being messed over by poor design that is the issue. \r\n\r\nThe relationship system means you can play well, overcome challenges and then RNG decides to punish you because there is no solid option to avoid two guys just messing up relationship during travel. \r\n\r\nHaving to spend on repairing the wagon feels punishing when you have no option to avoid damage. \r\n\r\nThe bounty hunter being not selectable from the start means you make a team and you have to mess up your pre-planned team composition if he appears and you want him. So I often don't pick him as he wouldn't fit in the team. If I KNEW i could select him i'd be able to build around it, poor design. \r\n\r\nKingdoms is a complete design mess, its tutorial is non existent and is awfully laid out, is far too complex and lacks any rewarding progression. I have 100's of hours in DD1 and 50 odd in this and I still don't get wtf to do in Kingdoms",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The devs have said in interviews that they were burnt out of Darkest Dungeon from all the time they spent developing the first game. It shows, because while the first game was difficult, it was still fun. There was a feeling of making progress in the game even when it was absolutely killing you. The gameplay loop was simple, but there was a lot of depth to the combat and the way you went about fights. They've eliminated pretty much everything that made the first game good. \n\nThe systems in this game aren't fun to interact with. The relationship system sucks. People start hating each other and then they make each other's skills put debuffs on each other. So if one person uses the skill that's randomly chosen when the negative relationship starts, the other person gets a debuff, like being blinded or gaining a point of stress. The stress system is worse now. Hitting 100 stress in the first game was rough since the character might begin acting on their own, using a skill you don't want them to or just not hitting the target you were going to have them hit. In this game, they just instantly drop to around 10% hp and cause their relationship with everyone to drop by 3 points, which is a lot. Combat is less fun as well. Almost every fight I get into has enemies applying dodge or block to themselves constantly. It feels like the devs were far too focused on making a difficult game and forgot that it's supposed to be fun as well. They've also arbitrarily stopped you from being able to heal from most skills unless the target is below 50% or 33% hp. Sure, you heal passively while riding around in the stage coach, so you don't need to try and micromanage hp all the time in fights, but you still want to be able to stop people from getting too low in fights to begin with. \n\nThere are some good things I like about the game as well. One of which being the healing while riding in the stage coach. The art direction of the game is good. I think that the 3D models are great. Having more story behind the characters is nice. There's definitely a bigger focus on story telling for the narrator and the characters behind each of the classes. I think it's a nice touch for building on the overall lore of the world in addition to the story of the game. I think the UI for the game is really nice. There were some small things I wasn't a big fan of when I first saw it, but I got used to it pretty quickly and enjoy it now. \n\nOverall, I would recommend just not playing this game. I don't think it matters much whether you've played the first game or not. If you want a fun but difficult turn-based game, there are much better ones out there. This game is a lot of style and not a lot of substance. I still want to see more out of the world and lore of the game, I just hope it's in a better game next time.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I think the ultimate reason I can't recommend this game is due to the lack of player agency. In DD1, the player had more freedom in terms of what they could do, that whenever a run went south and the party got wiped it felt like it was the player's fault. Here, there is no player agency in terms of actual run management that it all feels so pointless or contrived.\n\nIn DD1 you could run from encounters and abandon the quest entirely whenever you felt it was best to do so. In DD2 most encounters that matter cannot be skipped, and even skippable encounters are met with resistance that further hampers the run.\n\nAlso the token system is so fucking annoying, like what do you mean this enemy has a guaranteed 75% dodge for my next attack? What do you mean it stacks those tokens every other turn until it's basically untouchable?",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I wanted to love this game so badly but it's just so boring and the gameplay loop isnt satisfying at all. \n\nalso minus points for the crusader being behind a paywall",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’m over 10 hours in and it’s simply not fun. The first game was such a fun loop and progression. This one is not. It’s that simple. I won’t buy Darkest Dungeon 3. They really let me down.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This is not a sequel to darkest dungeon, i have 200 hours on epic 50 on steam, and it never at any point hit the same as the first. the 3d animations and tweaks to the artstyle are the high point and not much else, if you want a sequel to the original, just play black reliquary",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Not a fan of the direction that red hook decided to take the sequel to Darkest Dungeon. All the other reviews saying not to expect the same type of experience as the first game but my question is, why would you expect anything else from what made the first game so much fun? There is not any real linear progression, and a lot of the mechanics are very bland and uninteresting. The carriage driving mechanic is strange to me and feels almost like a subway surfer clone type of design, this game has little in common with its predecessor in terms of the progression and the mechanics of the game. I am personally frustrated with the rogue like design because they had a great game with the original and what I wanted this game to be was a sequel with some new classes and mechanics but it doesn't feel like a darkest dungeon game at all. The animations are neat and all but it feels like a red herring to distract from the mechanics of the game being repetitive and grindy with no real satisfactory succession until many failures later. I would strongly prefer Red Hook to take the new animations and upgraded visuals and combine them with the linear progression and difficulty that came with the first game because they did it just right. I think it's a shame they deviated from the design of the first game and I am hoping they go back to it if they decide to make a 3rd game. With that being said if you are a fan of the original Darkest Dungeon I would say save your money as this game simply doesn't scratch that itch in the same way.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Took all the unique fun of the first game, tossed it into the trash. Then made two different game modes that are shitty rogue-lite modes. God, I hoped Kingdoms would be fun, but its the same crap as the first mode.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Not the same magic from the 1st Darkest Dungeon. They could have made it so much better, and is sadly a big disappointment. Improvements in the 2nd game are pretty much cosmetic only. They really double downed on obnoxious RNG and made everything much less intuitive and enjoyable. No town to hire heroes, no feeling of accomplishment or respite after succeeding in challenging battles. No feeling of growth of improvement.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I played the Hell out of the game this free weekend and really gave it a fair chance and I was really conflicted by the End of it. I´m just gonna write my thoughts here. They are probably not in order and convoluted.\n\nMy final progression was to the Endboss of Act 3. I died to it because I didnt have the right heroes/equipment/abilities with me. This would´nt be an issue if the run to that boss wasn´t taking so long. I think I invested about 3 hours into that particular run only to get run over and start again. I´m a slow player and take my time with my decisions so I thought that wasn´t the norm and other players would play through it way faster than I was. I was surprised that wasn´t the case after watching a few review videos about it. \n\nThe runs for me are just too long to die to a random RNG element. Of course I´m learning how to fight, use my abilites countering regions or enemies but it doesnt really feel like I´m making any real progess. I liked having progress on my characters. There is no real progress here.\n\nSpeaking of progress. Whoever decided to let the professor guy yap the same thing over and over again after your 10th attempt with no abilty to skip it is just sadistic. The same with having to drive to your first Inn. Why not cut this completely and let your heroes recruit there instead of basically wasting 5 minutes everytime you wanna get into your first region?\n\nFor the story. I really didnt care about it like in the first one. A huge Element in DD1 was, how you unreveil how your ancestor was being involved in creating the bosses. Here you basically have someone at the beginning slowing down your progress to get into the game again.\n\nUnlike others I dont mind the coach driving. You can set it to 1,5x speed and it definitely enhances your experience between locations. \n\nThe Characters\n\nThese are mostly the same as DD1. You have to unlock more abilites through their backstorys. A lot of those abilites I didn´t use at all and they felt wasted. I really like that you can select classes for a character but you tend to just stick with one for each character being the best for each situation.\nMy favorite characters are the new Runaway, Flagellant which I didnt play before bc it was paid in DD1 and Graverobber. \nAlmost forgot about the bounty hounter. Probably would be my favorite if he wasnt locked for one region and is only occasionally there. Such a shame. \n\nThe menus overlapping in the Inn are a bit annoying. I´m sure you could´ve solved that a bit different like having a different background for provisioner, region etc.\n\nI really dont like the relationship system. Even if you buy all the items in an Inn it doesnt seem enough to get them over 8 which is the threshold for developing bad relationships. If you try to boost them with Inn items like booze these characters can suddenly develop the quirk to not drink anymore, so you have to get rid of it in the next map which is after your characters already established their relationship for that region. \nThe most frustrating thing I had was, when my 2 damage dealers didnt like each other and their primary attacks would blind them constantly. Meaning my damage would drop off significantly either not using those abilites or missing every 2nd attack.\n\nI didnt play the kingdoms mode yet so I cant say anthing about that.\n\nGraphics and character models are very well done. \nThe atmosphere is definitely lacking. Doesnt even feel like the darkest Dungeon. Feels more like \"a bit dark here Dungeon\".\n\nI´m mixed about the bosses. I didn´t like every endboss of every chapter. They felt as though they had no personality. The lair bosses definitely were better except the Dreaming General. \nI´m against most mechanics that just stun you into oblivion and don´t let you do anything. The dreaming General is the epidemy of that. If you dont know his mechanic you´re screwed. If you do know his mechanic he becomes the most boring enemy ever. He just spams 2 abilites and LITERALLY just sits there and lets you kill him.\n\nOk I´m done with yapping.\nTo summarize: Too long runs to the Endboss, no character progression, lackluster bosses, good graphics, boring story, good areas with unique ideas with great mob designs, music honestly didnt catch me that much like DD1.\n\nThe devs definitely put their work in this game but doesnt feel as well tested as it should´ve been.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Darkest Dungeon 1 was great because it constantly tempted you back despite all the hardship and frustration. Darkest Dungeon 2 doesn't do any of that. It's boring and repetitive and constantly presents you with fully hopeless situations where the only thing to do is die and start over. In the first one, the stakes made you want to keep trying, even if it felt impossible, because the difference between success and failure was so great. #2 is just dice rolls and Aborts. This game sucks. I uninstalled Darkest Dungeon 1 many times, after returning to it like one of the cursed \"heroes,\" because the allure and the fear were balanced, like in the world of the game. I will uninstall Darkest Dungeon 2 exactly once, right now, because it is boring.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "So, DD2. The game's kinda bad. At least the main gamemode, Confessions. \n\nConfessions is generally not super good, since it's run structure is extremely repetetive with barely any change to differentiate between runs. You build a team, then stay with that team for 2-3h. During the run, your playstyle barely changes, meaning you'll likely feel that every fight just feels the same, with pretty much every hero having a designated \"opener button\" which you will press on the first turn for 90% of fights. The entire team also just functions the same at the start of the run and the end of the run, since mastery often just upgrades your numbers and Trinkets don't do enough to change your playstyle. This means a team at the Crossroads will just have less numbers, but the same playstyle as a Mountain-ready team after 3h of playtime. All of this results in a very repetetive grindfest that feels unbelievably similar to the last run. \n\nThe meta progression also isn't very good. Not being able to see what you actually unlock is probably my main gripe, since you cannot see which skills you will unlock down the line, only leaving you to see the first 5 skills you start with. The same applies to Trinkets/Paths/Stagecoach gear etc etc. This is a really bad feeling, since you basically have to watch a starting guide somewhere, since without a good start getting more candles quicker will be more difficult, mainly bc you don't have the good unlocks to get good runs, which give more meta progression. This is on top of some unlockable Trinkets and items being extremely bad, cluttering the pool from allowing you to find your actually good Trinkets. \n\nThe game also runs into it's predecessors issue of not telling you shit. Some mechanics aren't explained, the glossary doesn't update when the token in question changes it's effects and the tutorials are one long textwall you have to read through, often even with outdated screenshots. This wouldn't be a big issue, but losing a run 2h deep to a mechanic the game never tells you about just feels extremely bad. \n\nThe Boss design is also baffling. Some Bosses basically need specific things to beat, which you have to build around. The issue? Well, you have to bring those things at THE START OF THE RUN WITH NO INDICATION DURING THE RUN YOU NEED THOSE THINGS. This often leads you to just not having the correct team to beat a boss, which means 2-3h of playtime down the drain. \nAnother issue is that the Bosses have \"Dark-Souls Boss design\", aka you need to make mistakes, learn from those mistakes and then build your team better for that specific boss until you figure out the way to counter them. In Dark Souls, that's the attack patterns and dodge timing, in DD2, that's teambuilding and Items. Small issue, the walkway to try again at the boss is 2-3h long. This leads to an unecessary amount of waitng to try again at a boss, only to see that your planned strategy actually doesn't counter the boss and you losing all that progress. This just means you should look up a Boss guide, since otherwise you'll be wasting loads of time trial-and-erroring at the Boss. \n\nThe main system of the game is also extremely snowbally. Relationships tend to win you the run by generating an insane amount of recovery/tokens, but can also do the same in the negative sense, losing you the run with crippling +Stress or negative tokens. This means you either know what you are doing, get good relationships early and cruise through the run, or struggle early and get clapped by half your skills generating Blind suddenly. If you get the hang of it, it feels great, but to get the hang of it, you need to get gud first, which is very difficult with the negative relationships.\n\nThere is some good stuff though. \n\nThe path system essentially gives each hero 4 playstyles, which allows for some creative teambuilding. Of course, not all 4 paths are made equal, but a lot of the fun is taking a bad path/playstyle, building around it and then trying to make it work. This CAN be fun, but heavily depends on what you like doing. I personally like running these weird, off-meta comps, but that's not everybody's cup of tea. \n\nThe token system tends to be more reliable than DD1's pure numbers. Being able to plan ahead like in DD2 is a really cool way of allowing people to express skill, instead of just being bailed out by a random dodge. There IS still RNG, but it's much less overbearing than in the first game. \n\nKingdoms. If you noticed, all my negative stuff was only really applicable to Confessions. Kingdoms doesn't have meta-progression and while it does take longer, the final Bosses aren't an all-in fight like in Confessions. You actually get multiple tries to learn the Bosses' mechanics within one run, which is really nice. The Trinkets are still a bit hit or miss, but since you can keep them out of the drop pool by putting them into Inn storages, you can usually get something good. It also allowing much more access to a shop to specifically buy the good stuff, since then the cluttered garbage can just get ignored and you can just get to the good stuff. The relationships are still very snowbally, but being able to just ignore a really bad relationship by swapping that hero out mid-run for a new one, then getting that hero back after you have items to fix that bad relationship also makes it much easier to avoid snowballing into 4 bad relationship on an unplayable team. \nThe one gripe about Kingdoms will always be it's extremely steep learning curve. Since you HAVE to manage your resources well from the start, you could just waste a bunch of important materials on upgrades you don't need, which leads to a worse midgame, which leads to an even worse lategame. This and essentially having 8-12 heroes at your disposal at the same time basically means you have to have some experience with all of them to have a shot at actually winning the run. Outside of that, Kingdoms is a really really good mode. \n\nNow, in conclusion, should you buy DD2? Well, not really unless you are willing to grind Confessions until you have learned most of the heroes to swap to the actually good Kingdoms mode, which will take a LOT of hours to fully unlock each hero to learn them. The other option is to watch someone who has experience in the game, learning from them without actually playing the game and then immediately jumping into Kingdoms. If the devs deleted confessions and instead made a tutorial kingdoms module that allowed you to experiment a bit with all of the heroes, this would easily be a positive review, but with the bad gamemode dragging down the learning experience with insane amounts of grinding and unrewarding boss design, attached to the good gamemode essentially being skill-locked with it's overwhelming amount of learning needed, it just ends up being a negative review.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I keep trying to get into it, and everytime I find myself frustrated and not having fun. after 10 whole hours of trying, i'm deleting this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't think I've ever played a game for as long as this one without really being sure where I stand. Ultimately since I can't muster up any motivation to play it at the moment I'm going to have to go with I don't recommend it. I probably should've gone with Kingdoms mode before burning myself out of the main game, so I may come back, give that a shot, and change my tune eventually. \n\nComing to this from DD1 felt like a series of steps forward & steps back that left the final product feeling muddy. \n\nPros: The game is beautiful, the music is fantastic, Wayne did an amazing job again (rest in peace), the animations are solid, changes to stun meta and stall meta for healing are nice, changes from accuracy focus are nice\n\nCons: Each run feels like it takes way too long and the benefits on failure are negligible. Optimal candle farming is NOT a satisfying gameplay loop and the investment to get all the heroes set up, all the trinkets/stagecoach items/etcetecetc is just a fucking agonizing process. The shrines system for unlocking moves fucking sucks. If I hard focus them I can unlock a few moves for a character or two PER RUN. And these were runs that went all the way to the mountain.\nI considered getting a mod for one trillion candles just to fast track the progression but I then realized, is this even all that fun besides satisfying the monkey brain progression? Eh? Then I played something else and didn't really look back for over a month. \n\nAgain, maybe when I try kingdoms mode I'll see the vision for this game and really change my tune, but for base game I definitely don't think it's worth half the asking price unfortunately. I'm hopeful DD3, if that ever comes out, is able to walk the line better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unironically, I will not continue to play this game until they balance this shit, finally rework all of the characters like they promised to, and there is enough mods in this game for all the quality of life shit I want I'm genuinely sick of this shitass game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Other than the new, cooler graphics DD2 just makes me want to play DD1.\n\nDD2 is unnecessarily complex and confusing compared to the the streamlined elegance of the first one. If you never played the first one this might be your thing. But if you did play the first one this probably won't scratch that itch.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It’s difficult for me to write a negative review for this game — but here we are. I’m a huge fan of the original Darkest Dungeon. It’s one of my favorite games of all time, and naturally, I kept comparing DD2 to it. But that’s not really fair. these two games are very different. So, I decided to judge DD2 as its own title.\n\nAnd yet, even when treated as a standalone experience, I still have to leave a negative review.\n\nIf you don’t own the first game — buy that one instead. If you already do and want more of that experience, check out the incredible mods made by the community. Darkest Dungeon II is not Darkest Dungeon.\n\nMy first problem is bad game design.\n\nLet’s start with the most glaring issue: the grind.\nThe game only begins to feel like a roguelite once you’ve unlocked nearly everything — but to get there, you’ll need an absurd amount of candles. Each “Confession” run can take anywhere from 2 to 6 hours (yes, really), and the upgrades you unlock are often mediocre or even detrimental. Every new trinket you add to the pool dilutes your chances of getting something actually useful, and there’s no way to ban unwanted items from appearing.\n\nThen there’s the token system — possibly the worst offender.\nCombat may technically rely less on RNG now, but the token mechanics make it insufferable. Enemies can use any skill from any position, and most of those skills either pile negative tokens on your heroes or stack buffs like Evasion endlessly. The player doesn’t get the same luxury and often has to waste turns managing tokens instead of actually fighting.\n\nStuns are a joke — you need to pass two resistance checks to pull one off, while enemies can stun your heroes freely. Taunt tokens? Enemies sometimes just ignore them. Meanwhile, stress constantly hovers over your party like a curse. You can only reduce it mid-battle once it’s above 5/10, which feels punishing and unnecessary.\n\nAdd to that the relationship system, which becomes a chore. Outside of inns, you can’t meaningfully manage relationships, and when things go bad, someone inevitably becomes the scapegoat to concentrate all of the negative reactions from your team. Over long runs (again — 2 to 6 hours!), losing a hero usually means you’re done for. And negative relationships highly increase the likelyhood of that.\n\nAnd honestly, this is only half of the design issues. I’ll spare you the rest, since there are already plenty of YouTubers who’ve dissected the game’s flaws in detail.\n\nMy second problem is the story\n\nI’m usually considered a “lore guy.” I love diving into the story and piecing together the world — but Darkest Dungeon II makes that almost impossible. The story exists, I guess, but it’s scattered and barely coherent.\n\nThere are no item descriptions, no lore entries, no real sense of world-building. You only get occasional comments from the Academic, which start to make some sense by the final confession — but even then, it’s thin. We never learn what happened to the cities, who the minibosses are, or even what most of the confessions bosses are.\n\nYes, I understand it’s supposed to be Lovecraftian — fear of the unknown and all that. But even the unknown needs a foundation. In the first game, and this is the only time when I will make such a comparison as I think it is apropriate, we knew why the Ancestor did what he did. We understood that he created many of the horrors, and even the greater beings beyond him had their place in the world’s logic. Notes, trinket descriptions, and boss lore tied it all together.\n\nIn DD2, there’s almost nothing. The only thing we truly learn about is “The Body of Work.” Even the hero shrine stories are retreads of the short comics released for the first game.\n\nAs for positives - I’ll give credit where it’s due: the visuals, animations, music, and sound design are phenomenal. The art team, composer, and sound designers truly outdid themselves. They’re the reason I managed to enjoy parts of my time with this game at all.\n\nAs a side note - I also waited to play the full Kingdoms module before writing this review. It’s certainly better than the Confessions mode — much better, in fact — but it still suffers from the same core design problems, especially the token system.\n\nIf you really want to give Darkest Dungeon II a try, go ahead — there are moments of brilliance here and there. But if you came for the spirit of Darkest Dungeon, you’ll be disappointed.\n\nThe developers said they wanted DD2 to be different from DD1.\nAnd in that, they truly succeeded.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Boring gameplay loop and leveling system. I don't really see anything better in this game compared to last except animations that I don't care about. Got about 100 candles from successful run (used for progress), uninstalled the game for few hours cuz I needed disk space, installed again and lost all the candles.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Red Hook put a lot of work into this one. Unfortunately a lot of work doesn't necessarily mean the game is fun. To start, this is not Darkest Dungeon. It is not a sequel to Darkest Dungeon. This is an entirely different game slapped with the same name and skin. Where DD1 was a strategic, longterm campaign with a lot of depth, DD2 is a strict roguelike with wayyyyy less variety and cohesion.\n\nMy recommendation if you really want to give it a try:\n\n1) give yourself 300-500 candles (the only progression currency) at the start\n\n2) enjoy the game for a bit, without the mindnumbing tedium\n\n3) shelve it for something better when you inevitably get bored\n\nEvery enemy is overtuned. Every character is undertuned. Character relations can make or break a team in seconds, entirely rng. Stress loss/gain was heavily simplified from the first game, effectively making it just another healthbar instead of a longterm mechanic to plan around. 99% of runs will end in failure, so there is no feeling of accomplishment like eeking out a challenging victory like in DD1. I'd estimate you need to have around 30-40 hours of farming candles to make remotely competent teams. Overall, the game feels like a slog. Maybe that changes with a few dozen hours invested, but I'd rather play something that's fun from the start.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really wanted to love this game. I really wanted to like it.\n\nBut i cant. \n\nThe core game mechanics feels like such a downgrade compared to the first one. I keep returning and playing the first. I cant say the same about this one. \n\nSuch a damn shame.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "too much farming. 60 hours and still haven't unlocked everything--would be OK if it wasn't actual buffs being farmed. too much dice rolling--90% death resistance is unfun. i beat one run by succeeding at the death save roll like 15 times in a row which was undeserved, then i lost the next run because i failed my first death save. and in the latter case, the enemy brought my guy from 100% to 0% before i had any opportunity to do anything about it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's kind of like Darkest Dungeon 1 but the gameplay loop outside of the fights is less enticing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game feels stuck and less player agency than DD1. Also Reynauld is paywalled",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Mediocre game riding on the success of its predecessor, and reskinning a UI/formula that isn't as interesting in modern gaming standards.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I was bored and decided to give this game a chance even after reading the negative reviews about it being unfair to players and wasting their time... I did not even get that far with the game: after over an hour reading the tutorial and trying to navigate all the mechanics through tiring wall of texts that keep popping up, I give up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is exactly why we need neutral reviews... It's not bad, but being a sequel comes with burdens and expectations from the previous iteration to fulfil, and since this one came with the bold choice of changing main loop and several core mechanics, sometimes you end up with a gamble that doesn't pay off. This is the case. I can see how a new player could entirely enjoy it, but as a 'returning' from DD1, it isn't what I expected or wanted, and I suppose many of other negative reviews shares just the same sentiment.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If i could i would rate this game as neutral but if i had to say as a fan of Darkest Dungeons then i have to say that the game is bad in comparison.\n\nWhat i wanted from darkest dungeon as a sequel was typical things you imagine you will get from a game series that has 2 or 3 etc in its name depending on the success of the previous game in the series, more content, more story an expansion/improvement on existing game play elements, more QOL features etc.\n\nWhat i get is a completely different game with almost completely different mechanics or really revamped that they just alter what they did before and just straight up changed genres.\n\nLike you might as well change the name of your game, but it's typical of a company to use a previous existing brand to sellout to previously existing fan base while at the same time trying to reach out to a potentially larger market to make even more money for profit driven people and this makes it more understandable when said company takes a exclusive deal from epic game stores when this game first came out to cash out early in case there greedy ideas potentially failed at least they get that money.\n\nBut hey what i can say is that in the time frame this games been out in 2 years ish it has half the active players as the 1st game has since 9 ish years ago and that game hasn't had content updates for a very long time while this game gets constant updates yet has half the active player base on steam.\n\nAdditional info would be the 1st game has over 120,000 players all time all languages with a 91% positive review \nthis game has around 20,000 players all time all languages with a 75% positive review\nso clearly more people hate this game if know how to do the math right.\n\nit shows it even more when they announce free game weekends etc on the 1st game for the 2nd game like saying please play our 2nd game and like it lol.\n\nanyway just make the 3rd game like the 1st game and i might support your game company in the future if not then good luck getting my money again because if this is what i get then im out peace",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I gave it 11 hours... Its just a bloody grind. Either you are busy healing your teammates because they are getting wrecked by status effects, Monster damage, or getting wrecked by stress - Doing that while trying to murder monsters.\n\nI feel like the game only starts after 90 hours or so, after getting enough candles to Max every character, and then unlock all the Memory/Skills.\n\nIt just seems dumb, I need to grind to then fully enjoy the game...\nThis seems like a game that i need to download the wiki to understand what to do, to finish the game.\n\nAlso the carriage, why am i driving around a horse - Just seems dumb \n\nLiterally the first 2 minutes of every game is driving through the black - watching spooky ghost talk, then the crossroads choosing a team, then driving to kill 4 zombies, then driving more to reach the Inn to actually just start the game.\n\nNot a fan of the gameplay or meaningless grind\n\nI'm begging someone to change my mind - I want to enjoy the game but I just cant",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'd have very likely recommended this game before Supdate1, even probably before Supdate2, but after that, all I'm seeing are a tandem of bad decisions on the dev side that made me just stop enjoying the game at this point.\r\n\r\nProbably a new player would enjoy it, and I can say that even after that, the game is good, but I can't in good faith recommend this game at this point.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It may look much better than the previous game but its just an absolutely dreadfull experience. Incredibly hard because of the heavy rng that advantages the AI massively.\n\nThey crit more often than you, they attack more times than you, they also do more dmg in general. For example, right before the end of chapter bose you have a fight right before it. This is mainly to screw you over since the massive amount of handicaps you get were not enough. I happened to have Flagelant have him use his taunt move and guess what, enemy crits in the very first move and puts him at the fucking death s door. Had I not had certain upgraded then the run would have been over right there and then since many useful skills are locked behind some bullshit lore dumping filler wasting nonsense.\n\nThere would be plenty more examples but the game is just not worth it nor will it ever be. Avoid unless you are looking for a game to make you jump out of the window if you needed a motivation.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Somehow, this game feels like a downgrade from the first part. There's no more persistent progression or castle leveling. The reworked mechanics feel strange and confusing. Most of the characters seem useless or locked. I don't see it as a direct upgrade over the original and can't really recommend it in its current state. On top of all this, it lacks any form of multiplayer",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Take all the jank/flawed stuff from Darkest Dungeon, put it in a new game, streamline all the stuff that people actually enjoyed. Add in time wasting and a significantly worse Slay the Spire gameplay loop. \n\nThat's this game. Also there are almost no actual dungeons. 5/10\n\nEdit: Also I thought of something a bit later as well, this is just a bad roguelite. The very best roguelikes in the genre (binding of isaac, slay the spire, etc.) will let you feel utterly super omega broken if you get an insanely good run, this game just...doesn't. The power fantasy is part of what makes the best roguelikes, roguelikes. Even Elden Ring: Nightreign (which people don't call a roguelike because you can't really become super broken) is still better than DD2 in that respect.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It's just kinda mean. And not in a fun challenging way, more in a 'I think this game hates me' way. \n\nIt's actually quite a good way of systemising the existential despair of trying to live under late stage capitalism because it's just an inevitable unfair cruel grind. And I know that's kindof the intention, but you know. I'm alright thanks. I already get this in my day to day life. I don't need it from my games as well.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you enjoy smashing your dick in a door with random results, this game was hand crafted specifically for you, by your future self.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unnecessarily difficult in a particularly frustrating way. The game penalizes skills based on an internal relationship mechanic which is pretty clouded, when this happens every time you use that basic ability you get penalties. This can be annoyingly crippling when you get basic skills for your hero's build cursed.\r\n\r\nThe original game with mods is better than the sequel",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wish I could give a 'meh' rating for this game but will have to settle for just not recommending this game.\n\nI understand Red Hook wanted to make a sequel that was distinct from the original, but unfortunately the majority of changes they made were for the worse..\nThere's a lot of criticisms for this game, but the number one problem I have is that the game feels like there's no stakes and no continuity. \nYou make a mistake and get a hero killed? No worries they'll show up in your next run. \nYou spend a bunch of money, time and effort levelling up skills, developing relationships, and outfitting heroes with unique trinkets? They're all gone and back to square 1 once you start a new run.\nI no longer feel like I'm playing a cohesive campaign, but rather like I'm playing an arcade machine starting from scratch every time I start a new run\n\nOne of the main praises about the original DD is that you grow attached to each of your heroes as you slowly build up their quirks, skills, trinkets, etc and so when you lose one of them it hits HARD. That same feeling just doesn't exist in the sequel and so unfortunately, losing a hero is now more of an annoying nuisance rather than a crippling loss to your campaign\n\nRed Hook needs to take a long hard look at the original Darkest Dungeon while they work on their third installment..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoyed the art style, but the gameplay is just grinding just for the sake of grinding. No guidance on what does what so you're blindly just doing random actions until you can figure it out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When I played Darkest Dungeon II for the first time, I thought, \"What a mess. What were they thinking? Where's the dungeon?\" After playing some more, I realized it should rather be called \"Crossroads – A Darkest Dungeon Stagecoach Story.\" They tried to make the game more accessible and focus on the combat loop, zipping from scene to scene like in FTL. Unfortunately, the genius of DD1 isn’t properly captured by the combat scenes alone. The sense of exploration, dread, and wear-down came from the sum of the whole.\n\nWhile DD2 was simplified in some areas, a lot of additional layers were added—so many, in fact, that it feels cramped and forced. I can't quite put my finger on it, but the story feels weak and the world feels wrong. The background stories of the characters have essentially become the game itself (confessions). They really tried to make a \"Super Darkest Dungeon II Turbo Plus\", indulging in the original’s strengths so heavily that it starts to hurt. Even the otherwise brilliant voice acting began to grate on me after a short time.\nYes, expectations were high, and it’s a bold move to redesign the game rather than simply deliver a \"better graphics\" successor—but things can go wrong, as we see here.\n\nThe game isn’t a complete mess, and the studio clearly still believes in it. But it’s kind of \"mid\"—and that’s the worst thing I can say about a Red Hook game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "MY favourite part of playing a game is definitely watching the enemies play the game instead of me getting to play. Like c'mon if you are going to put an unbeatable boss as a roadblock, at least make it quick. Who wants to sit there and watch the enemies take multiple turns over and over and you can do nothing about it. Glad I got to play it for free before wasting my money on it. \nThe game also just feels super slow because of how it is formatted. The carriage section is just so boring; just get me to my objective and stop wasting my time",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "OMG this is sooooo boring! DD1 was fun, this just seems to be an endless ride in a stagecoach with mindless backstory. Not wasting my money.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Really wanted to like this game, but winning doesn't feel earned and losing feels like RNG bullshit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The early game was immensely frustrating and I figured I would push through it to see if things got better on the other side. Don’t bother. It never gets better. No matter how much you unlock, the same unfair, uncaring boss monsters await you. There is nothing for you here. Don't follow me in.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Massive disappointment! As someone who played and enjoyed the first DD, I've come to hate this one very quickly. The worst part of sequel is it's randomness. Nothing really matters if rng is not on your side. And one unlucky roll ruins entire run. Unlike in first game where strategy and preparation meant 99% of success, second game is just brain-dead, random, like-mobile-cash-grabs and feels very cheap. Despite massive improvement in visual quality, game itself, sometimes in 5 minutes after starting the run, defeats the whole purpose of playing it. I was very excited when sequel was announced and I purchased it instantly upon release. I've come to regret it 30 minutes after I started to play the game. Despite years of post development and many promises nothing changed regarding core mechanic of the sequel, which is just random-random and even more random stuff so play 1000 runs to get lucky once or screw you. \nThis game is a perfect example of how cutting coupons from the franchise works. If sequel's mechanics and gameplay was literally to the dot with first one but with improved graphics and few additional systems introduced in the second game, it would have been a massive hit. But as it is up to this point, it's just a waste of time (both yours as a player and developers who thought that dressing cheap, mobile skeleton into PC clothing will make for a great game because of the brand.\nIf this game caught your attention, steer away from it and go play Darkest Dungeon 1 instead. You will spare yourself massive disappointment and at the same time you will get to play one of the best roguelite dungeon crawler games on this platform.\nI give up on all hope regarding sequel. It just is a very bad game.\nI'll wait for another one in the franchise but there is no way I'll be buying it in pre-order or on release. This developer is burnt.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I love the first game and spent around a thousand hours in it. With this one, it took me only about 20 hours to realize it just isn’t worth it. Some of the new combat mechanics, the hero stories, the visuals, and that familiar atmosphere are all appealing. But the overall concept didn’t work for me at all, partly because of the unnecessary roguelike elements, and the game became uninteresting for me very quickly.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1] 4/10 - A step backwards for the series [/h1]\n\nAs a huge fan of Darkest Dungeon 1, I avoided this sequel for years due to the mixed reception on release. Having given them two years to expand and bugfix and seeing the reviews shift to Mostly Positive, I decided to follow the advice of the positive review givers and give DD2 a try with an open mind, letting go of my preconceptions of what DD1 was and allowing it to be its own, new, different game. Unfortunately after playing a few runs it has quickly become clear that these new and different changes are overwhelmingly bad, and I don't think that's my bias as a DD1 enjoyer speaking. Almost all the new mechanics and additions are either extremely grindy, heavily RNG-based, deeply derivative, or just plain old frustrating and unfun, and the abscence of many charming and useful features from the first game are sorely missed. \n\n[h2] The Good [/h2]\n\n+ Voice Acting/Sound Design. This is a shoe in for DD2, featuring the late and great Wayne June reprising his role as the iconic narrator. Music and sound is on point as always and add a lot to the atmosphere.\n\n+ Writing and Character Lore. This is basically the only thing in my opinion that DD2 truly does better than DD1. DD1 had good writing, but DD2 really leans into the character backstories and lore, featuring new 'shrines' you can explore to delve into the hero's pasts and the traumas that made them who they are, featuring special dream combats. These are really fun, like a better version of the shieldbreaker's dream trauma thingys from the first game. Probably the best new feature of the entire game.\n\n+ Artstyle. This is another shoe in. DD2 maintains the series' distinctive and striking artstyle, a gorgeous blend of lovecraftian fantasy raging against the withered humanism of its unlikely but determined heroes. Things look great in the new 3d artstyle, and I'd say that things are generally more striking, dynamic, and fully rendered than in the first game, giving DD2 an edge in the art department (although I still think the Crimson Court is the single best looking area between both games). The new areas are visually interesting and beautiful, from the burning city to the twisted forests, it all looks great. This is where the negatives start showing up though, because DD2 has significantly less enemies and locations than the first game, while simultaneously expecting much, MUCH more playtime from you. That means that art and enemies start repeating much faster and harder than the first game, and you'll have to fight the same things over and over and over again. Despite looking better, it gets tiresome much faster than DD1.\n\n[h2] The Bad [/h2]\n\n- Grind. Everything is a million times slower. It takes forever to do anything and after two full 2 hour runs it has become clear the game expects me to do like 5 more of these (10 hours) before I can even unlock the most basic of character features and effective consumables. It seems like game developers these days are trending towards being less and less respectful of player time and DD2 is unfortunately a great example of devs with a fun formula just streeeeeeeeeeeeeetching it out as thin as possible to juice out everything they can get from their players without doing hard stuff like making new content or modes. This game has noticeably less content than DD1 but demands like 20x the playtime. \n\n- Setting Lore. Despite having better character backstories and more fleshed out, quality writing for its heroes, the binding lore of DD2 is much, much worse than the first game, which is really annoying, because the actual core idea of the top line lore is still excellent but the execution is just terrible. Where in DD1 you're a distant noble cousin brought to the ancestor's estate to fight evil lurking below, in DD2 you're an academic on a quest to destroy the evil artifact you accidentally brought into the world that is destroying it. So what's the problem? The lore in DD2 is COMPLETELY disconnected from its gameplay. \n\nIn DD1, as the noble heir, you manage your estate, recruit heroes who show up hearing rumors of riches, and plan expeditions to the depths. When you lose a run, those heroes are dead and your work continues without them at the estate. In DD2, as the protege, you summon a magic carriage from hell imbued with the physical essence of the last hope of humanity, summoning heroes gacha-style through a magic portal to fight horrors on the way to the mountain, and whenever those heroes die you are teleported into the multiverse to enter a new dimension where you summon your magic carriage and magic gacha heroes with another, new physical essence of the last hope of humanity to try again. This fucking sucks. It's the kind of lazy, disconnected writing that clearly only exists as an excuse to get the player into the gameplay loop as quickly as possible, the kind of slop you'd expect from a mobile game that practically demands you not think too hard about it. Incredibly, incredibly dissapointing. \n\n- RNG. Now, RNG has always been a major element of Darkest Dungeon, but in this game it's so much worse than it was in DD1. Whereas deaths in DD1 were almost always due to a combination of bad luck and ineffective planning causing you to trip into a death spiral, you can literally just randomly get fucked off the bat at any time for absolutely nothing in your control in DD2. HP pools are smaller, enemy damage is swingier, and much, MUCH less is in your control. Trinkets are no longer meta-progressed but completely randomly generated each run. Relationships randomly appear impacting random abilities between characters. Afflictions randomly appear and cannot be removed unless you randomly stumble across a field hospital with enough gold at that exact moment to deal with it (remember when you could send heroes to the sanitarium in the hamlet between runs?) Many enemies can either kill or stressbomb full HP/0 stress heroes in one turn if you get particularly unlucky - and while this was possible in DD1, it's downright *common* in DD2. And since it's a multi region formula, if you get fucked in region 1 or 2, you're just fucked. If a random set of crits kills your DPS before your plague doctor gets their turn, or if you generate a negative relationship that causes your most important ability to make your tank vulnerable or your DPS weakened, your run is over. Basically every aspect of Darkest Dungeon 2 is far more dependant on RNG than its predecessor, and this increased dependency on luck serves to make the game considerably more frustrating and less skill based.\n\n[h2] The Ugly [/h2]\n\n- Relationship system. I really like the idea of this system actually. But in practice it's just fucking awful. As mentioned above, this is a purely RNG based system, where player impact is EXTREMELY limited.\n\n- Metaprogression. Metaprogression still exists in DD2 but it is objectively worse in every way than it was in DD1. Metaprogression is less permanent, less impactful, and less fun, despite there being a lot, LOT more of it. In DD1, maybe you upgrade your hero's sword or armor, or find a good trinket that enables a strong build. Cool, now you can do harder runs. In DD2, you unlock one of like 250 trinkets (1-2 candles apiece, you earn maybe 30 on a good 2 hour run), most of which are awful and totally useless, and hope that one of the good ones shows up on your run to make it not suck. Oh, or you can spend 5 candles to give one hero +5% death's door resistance only for them to die on the first check anyway. Some of the trinkets you can unlock don't suck, but this metaprogression system absolutely does. If DD1 was chipping through the mines to go back to the hamlet and upgrade your pickaxe, DD2 is chipping through the mines to go back to the crossroads and get 1/10th of a respirator that has a 5% chance of showing up on your run to prevent some of the charcoal fumes, sometimes. It is much slower, much less impactful, and just awful.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Don't recommend. You need to grind for a long time to unlock the necessary skills/equipment for your team. I expected that, it's that sort of game. I put 63 hours in. I unlocked all the team assist options and got 5-6 characters to full unlock. It doesn't help. The problem is that even after all that grind, it is still too damn hard. There are no viable options to perform better - the only exception is if you happen to RNG into the right piece of equipment for the right character.  You're better off spending your time and money elsewhere.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every now and then I come back to try this game again, I love the art direction, Wayne June's voice is amazing as ever, and I really, really want to like it.\n\nThen I go to a fight in like area 1, take disgusting amounts of damage from everything and go \"Oh yeah now I remember why I don't play this fucking thing.\"\n\nI'm sure some of it's a skill issue, I'm sure I'm doing something wrong, I'm just not sure what, and I find the game's difficulty incredibly obnoxious. I also despise that you can get stuck with a bunch of characters with absolutely appalling traits due to them being the only option; I don't know who decided that 'breacher' was a good idea for a positive trait that can spawn on characters who don't belong in the front, but they should not be allowed to design anything.\n\nThere is an easy mode available, but it feels like a cop out; taking it means earning less meta progress resources, and it also just feels like it ingrains bad habits where I'll start to think I can get away with stuff that I actually can't on the intended difficulty.\n\nThen again, not like I'm learning much other than 'don't get into a fight with one of the enemies that just mulches you', but I don't really know how I'm supposed to know ahead of time if I'm about to run into one of those, so...\n\nIt has the FTL problem where runs are long enough that it feels  *awful* to run into an end boss that wrecks you, or really, to run into any one of several things that just ruin your day. \n\nA lot of this is stuff I could potentially look past if I liked the game, but I just don't enjoy the approach they took with it as much as the first one. I find it more frustrating, less fun, and it bums me out because I really *want* to like it, I just simply don't.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Coming directly from the first one this one just felt off. \nEverything just seems to random with very frustrating mechanics. \nnot sure who the target audience but players of the first game arent it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Do not play this game in its current state. They edited every character for artificial difficulty, nerfed my favorite healer into the dirt. DO NOT BUY THIS GAME",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you thought the writing for darkest dungeon was bad, just wait until you experience 2. (If it sounds archaic, cram it in there!) Other negative reviews say the rest better.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its not darkest dungeon 2, its something different and its just bad, its more repetetive than first one since run takes hours easily, and more grindy since you can basicly end up with zero progress. mygod stagecoach control is still bad after years, i wish the very worst in life whoever is responsible for that mechanic.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If I could give a mixed review I would. It has the potential to be an amazing roguelike squandered by some bad design decisions.\r\n\r\nA lot of the bosses are \"puzzle\" bosses, meaning if you aren't aware of what the gimmick of those bosses are, you will either suffer greatly or lose entirely which can be extremely frustrating losing a several hour run at what feels like no fault of your own.\r\nArguably the biggest problem is how bad the unlocks system is. With how little you have unlocked at the beginning, you have to use candles to unlock new items. This wouldn't be such an issue if most of the items you have unlocked at the start weren't almost worthless, making the starting experience feel miserable and tiresome as you won't have many reliable or good ways to manage the relationship system or stress.\r\n\r\nIn some aspects it seriously exceeds the first game and I feel if the unlock system was done differently or not done at all I feel like I'd really enjoy this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "more fluff than depth. overly complex and not rewarding.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unbalanced,  bad game design.  what a letdown.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Why are only two characters viable?\nWhy is Vestal a completely wasted slot?\nWhy can I get a critical 0 Heal that bleeds my character?\nWhy is Abomination guaranteed to destroy your team's relationships?\nWhy is Duelist, a dedicated Riposte character, capped at the lowest health in the game?\nWhy does my entire run's success depend on how much alcohol they sell at the inn?\n\nI understand the gimmick of \"Lose, and learn from your mistakes\" but what's to learn about gambling, other than learning patience whilst rolling the dice on whether your characters are going to respect each other?\nMaybe it's a skill issue. Maybe I'm bad. But I can't enjoy a game that doesn't reward me for my efforts, emotionally or literally.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I feel like I have to sink so many hours into this game just to get a win any other rougelike I would feel fine with losing but this game I'm losing to bs bc of relationships,stress meter,or bad quirk combinations(I had a PD that had a quirk where they would go to the front line...) simple buff displays would be nice like hovering over skills in the menu why would I bring a skill I have no clue what the skills do and they find out it doesn't go with my team comp I dont want to study the glossary for symbols that should be there I was a semi fan of the first one but this game needs more work still.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope. 1 > 2. See the active players on both, nuff said.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TOOO MUCH RNG. AND WHY TF IS MY BOY CRUSADER LOCKED BEHING 10€",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no arbalest or shieldbreaker, what's even the point.\n\nin all seriousness it's funny to me that DD2 would squander what made DD1 so memorable and brutal by stripping away any legitimate consequence via the implementation of rogue elements and meta progression, but I'd be lying if I said I didn't have *any* fun. I don't think it holds a candle to the original, and it certainly demands far less of your attention and long-term strategizing (ironic given the insurmountable bloat of systems upon systems), but combat is enjoyable and I might be the only person in the world who actually likes the stagecoach and Slay The Spire-esque map mechanics. Unfortunately, the system bloat is absurd. There's so much shit to keep track of and the game simply is not fun enough as a whole to justify it.\n\nI just really cannot get over how not Darkest Dungeon this is. I’ve been forced to outright abandon 30+ hour runs on the original due to my poor decision making, bad planning or just shit luck. I’ve gotten to the Darkest Dungeon and found I had no idea what I was doing, and I’d royally fucked myself by putting all my trust in just a handful of characters and not optimizing my town and skill progression. Skill issue or whatever. But here, it doesn’t matter, because the meta game progression (a benign concept to mash with this series to begin with) is linear, runs are short and can be beaten in a matter of hours at most, and consequence only lasts as long as the run. Sure you keep your living heroes, but that's more a boon than a broken knee. I feel shitty to admonish a game because its different from the first game and attempted to reinvent itself, but I really do not like it here. Execution is lacking, my time is better spent in the Estate from the first game. \n\nwish i could give this an inbetween kind of rating because I did find some enjoyment, but there's no real reason to get this when you could just get the original.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "kinda odd compared to the first, if you like long roguelikes though, go for it.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}