{
  "positive": [
    {
      "review": "Very fun and entertaining game to play with friends. If you like the story behind the Backrooms and liminal spaces, you might give this one a try, it really gives you that feeling (iykyk).\n\nOne of the best Backrooms games I've played. Please, let me know if you've played similar or better ones. 🙏🏼\n\nNote: I've only played the beta version and it was good enough for me. I might give the full release a try and update my review.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Nice game to play with friends, I recommend playing with friends and (if you are a little tryhard) then go play alone, it'll make you sweat a little. You could say that some levels are not according to the original lore, but if you do a pretty extensive search, you will find that everything is (or at least is almost) at point with the original lore.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "[h1]Game which [b]MUST[/b] be played with friends[/h1][h3](or you're psycho)[/h3]\n\n[hr][/hr]\n[h2]In a nutshell[/h2]\n[i]If you enjoy playing horror games which has puzzles — trust me, you will like it, but don't forget 'bout your buddies![/i]\n\n[b][i]Game was made for playing with friends[/i][/b], so I wouldn't recommend buying it if you're loner. Just compare two completely different types of gameplay: violent abusing of mics as someone's chased by an unknown entity accompanied by loud laughter and overall team play - or tense, thoughtful gameplay, accompanied by silence, solitude and ambient of the level.\nTherefore, I [u][b]strongly recommend[/b][/u] exploring this game in the company of your [strike]braindead[/strike] friends.\n\n[h2]Going into details[/h2]\nI'll mention only main/needed aspects which may help users who need detailed analysis before buying:\n[olist]\n    [*]Gameplay\n    [*]Graphics\n    [*]SFX\n    [*]Optimization\n    [*]How fun was it to play (Based on friends opinions)\n    [*]My opinion & conclusion\n[/olist]\n[b][i]BUT[/i][/b] if you're lazy to go through tons of text here's overall tab:\n[table]\n    [tr]\n        [td][b]ASPECT[/b][/td]\n        [td][b]SCORE[/b][/td]\n        [td][b]QUICK TAKE[/b][/td]\n    [/tr]\n    [tr]\n        [td][u]Gameplay[/u][/td]\n        [td]9/10[/td]\n        [td]Co-op exploration and puzzles demand precise teamwork[/td]\n    [/tr]\n    [tr]\n        [td][u]Graphics[/u][/td]\n        [td]7/10[/td]\n        [td]Not eye-rgasm but completely enough for game like this[/td]\n    [/tr]\n    [tr]\n        [td][u]SFX[/u][/td]\n        [td]9/10[/td]\n        [td]Spatial audio and ambience build unrelenting tension[/td]\n    [/tr]\n    [tr]\n        [td][u]Optimization[/u][/td]\n        [td]7/10[/td]\n        [td]Can be laggy for potato pc's on some lvls[/td]\n    [/tr]\n    [tr]\n        [td][u]How fun was it[/u][/td]\n        [td]11/10[/td]\n        [td]Proximity chat elevates multiplayer far beyond solo[/td]\n    [/tr]\n[/table]\n\n[h2]Gameplay[/h2]\nCore gameplay based on [b]co-op exploration across 30+ backrooms levels[/b], including puzzles, navigation, and [strike]trash talking friends[/strike] running from [i]entities[/i]. Each level draws from creepypasta lore, featuring unique layouts like endless yellow rooms, electrical stations, cave systems, or flooded areas (poolrooms, thalassophobia). Puzzles vary: aligning electrical panels, searching for needed code in area, combining environmental items (e.g., keys, levers, tv's), or timing sequences under pressure.\nThere are no tons of mechanics, one of them is useless: leaning left/right. Also there's type of mechanics as sanity, which will go down over time, and go faster if you see something scary. You can restore it by consuming items like almond water, juice, energy bar, moth jelly [strike]or liquid death[/strike].\n\n[h2]Graphics[/h2]\n[i][b]Perfectly serviceable horror visuals[/b][/i], way sharper after 1.0 and now genuinely impressive for an indie backrooms game that doesn’t try to melt your GPU.\nClassic mono-yellow hell is spot-on: endless damp carpets that look like they’ve never been cleaned, wallpaper peeling like it’s trying to escape, and those buzzing fluorescent lights flickering in the exact rhythm that makes your eye twitch. The volumetric fog is thick enough to cut with a knife, legitimately hides corners and turns every hallway into a coin-flip between “safe” and “random jumpscare”\n[b][i]Entities[/i][/b] look properly unsettling: \n[list]\n    [*][b]Smilers[/b] glow like discount neon signs from hell\n    [*]These dog-like [b]Hounds[/b] look worse than my drunk uncle\n    [*]Comically wired [b]Bacteria[/b] with long odd arms\n    [*][b]Partygoers[/b] whose appearance and 7ft height genuinely scare shit outta you\n    [*]Forgot 'bout [b]Skinstealers[/b] - entities which can [i]change[/i] their appearance to regular player, then turn into giant bulk monster and demolish you with single smash\n[/list]\n[b][i]Animations[/i][/b] are [i]smooth[/i] as butter, chases feel fast and scary, and ragdoll deaths occasionally produce accidental comedy gold. You literally explode and then your body lays on the floor without legs and arms like starfish.\nTextures hold up close, post-processing is tasteful (light bloom, subtle vignette, just enough chromatic aberration to make everything feel “off”).\nDoesn’t chase photorealism and doesn’t need to. Does [b]exactly[/b] what it has to do, nothing more, nothing less.\n\n[h2]SFX[/h2]\n[b][i]Exemplary spatial audio[/i][/b]. 3D sound positions footsteps, water splashes, and breaths directionally — headphones are [u][b]REQUIRED[/b][/u]. No cheesy music, just subtle drones that creep under your skin like existential dread.\n[i][b]Entity SFX not the best[/b][/i], but it does its function perfectly - [i]inspires fear[/i]. Hound's wet snarls of rabid dog, Skinstealers mimic warped voices as [i]\"Hello?\"[/i] which turns into a growl after few seconds, same with Partygoers, but they're ain't greeting you.\n[i][b]Proximity VC[/b][/i] integrates seamlessly, with entities detecting raised voices for added risk. In group play, hearing teammate's panic heightens realism and sustain paranoia. \n\n[h2]Optimization[/h2]\n[b][i]It is quite good[/i][/b], 'cause on my ancient pc (i7 920, 6gb ram, 1050ti) everything was great except few levels.\nIf your pc's better than mine, you can play on high settings without thinking about lags or freezes.\n\n[h2]How fun was it to play (friends opinions)[/h2]\n[quote=Max] it (8/10) [/quote]\n[quote=Andrey] Game's peak, atmosphere slaps, would complete this game 19 times but mid updates (9/10) [/quote]\n[quote=Michael] Pretty good if playing not alone (7/10) [/quote]\n\n[h2]Conclusion[/h2]\nSanity-draining exploration, clever puzzles, and entity chases that demand real teamwork via proximity chat. Great SFX and atmospheric visuals turn endless hallways into pure dread. Buttery optimization means your weak PC squad joins the panic without lag.\n[i]Solo?[/i] It's playable but feels like wandering a party alone — functional, yet missing the screams and chaos that makes it legendary.\n\n[b]Final verdict: [u][i]HIGHLY RECOMMENDED[/i][/u] — but grab the squad first, or stay a solo psycho forever[/b]\n\n[spoiler] You'll thank me later after first hour of gameplay[/spoiler]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Very fun game to play with friends!\nI did a total of 2 playthroughs\nFirst one like 2 years ago with most of the levels in about 8h\nSecond one today (22.11. 2025) with the full game in about 7h\nI must say there are some very fun levels down the line, but there some levels which are really drag and could've been shorter. \nOverall very fun game\nI'd say about 8-9/10\nSadly i cant get 100% completion because of the nightmare achievement :(\nMe no want to spend 100h playing this game lol",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Played this game back  in 2022 when the 1.0 was not released yet with the same group of friends that are now playing the full release with me, and tbh this is an amazing game.\n\nWe had a lot of fun the first time we played back when it was not released and we are having as much fun now, we are even thinking in getting all the achivements even the nightmare mode one since we have so much fun. \n\nI can´t really wait to see what the future has in store for one of my favorite games to play with my friends, and what new levels get added since i know for a fact that this game will have us coming back time and time again, \n\nI trully and utterlly recomend this game to anyone who is looking for a very entertaining game, again specially with friends, and people that like puzzles, high adrenaline chases and a lot of \" Guys...I think I´m dead\" and of course infinite laughs and funny moments with your friends,",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "When you play a fucking Ukrainian game with your cousin for 17 hours,and then the game ends,Ukrainian idiot looks at the floor in the arcade, this is what the ending of the game looks like in 2025 XD",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "me and my friend after playing the game it made friendship into war its cool and it made me gay but still its cool and tramatizd",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Escape the Backrooms nails the eerie, liminal atmosphere perfectly, making every hallway feel unsettling in the best way. The levels are much more refined than in most other Backrooms games, giving it a cleaner, more immersive feel. It’s also a great game for co-op, where the tension really ramps up as you explore together.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Extremely thrilling and fun, especially when playing online with friends, where all sorts of amazing moves always make you laugh out loud.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun game to play with your friends if you enjoy the backrooms lore although it may get a bit frustrating at times cause some levels are a bit too hard imo. Even with the existing bugs and stuff BUY IT IT S SO FUN WHEN THINGS CHASE U AND SEE YOUR FRIENDS DIE NEXT TO YOU !! Waiting for new levels!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Escape the Backrooms is a good fun multiplayer game if you got friends to play it with. This game has all the funny and scary mechanics to give you a scare or laugh! I recommend this game to those who got atleast 8 euro laying around and friends to play it with. And don't worry the game has open lobbys so if you do not got any friends you can always play with randoms. 9.9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun game to play with certain people\nmost of the fun comes from the game not working as expected ironically. the short jumpscares really do it in",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are very nice and the game has proximity chat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "is a fun game to play with friends, the puzzle solving might not have great replay-ability but is still very enjoyable and worthwhile! Very fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Best Backrooms game in my opinion with very good speedrun capabilitys. with Friends, there is just so much fun stuff to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fancy has put so much effort into this and I think it paid of. \ngreat game better with friends.\ncan't wait to future new content",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After playing this game for many hours, I still  love it. Escape the Backrooms has been very fun playing with friends or alone. I've beaten the game several times and never get tired of the play throughs. Since Escape the Backrooms has left early access we can now expect new levels and more fun with friends. I recommend the game to anyone who enjoys playing with friends and a good challenge.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is quite fun with friends and has a certain charm to it that I enjoy quite a lot.\n\nVery nais.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Escape the Backrooms: A game, where you and your friends are on a journey to defeat \"the fingerer\", \"Doodlebob\" \"Mr. Fussy\" \"Old lady with crowbar\" and many other entities. (Note: Not remotely their names, just what we called them). You will get pissed off at your friends to the same degree as a late night game of UNO, every single time. You will come across many urine-yellow walls, but I'm only here for that one chase sequence (The fingerer) with crazy DnB music in the background.\r\n\r\nNot scary at all, but 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just a really fun and sweet backrooms experience especially with friends. Has that classic indie jank but honestly adds to the experience. The creator cares a lot about the game and it shows.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game to goof around and watch your friends die in the funniest way possible. And I love the enemies, many of them look so silly while devouring your friends :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Entertaining experience with friends or alone. Unfortunately the game is still very buggy even after the early access period. The level design and atmosphere is very on point and eerie. There aren't many puzzles, and it it more like a maze experience, which I prefer for a Backrooms game. But honestly no overly significant improvments gameplay-wise with the full release. The interface is really poor, and the physics are janky. Still probably one of the better backrooms games, compared to the massive amout of junk on Steam.\nHopefully, the devs will add new levels, improved interface and remove janky physics and bugs (although I don't have high hopes for that).\n4.67/10 for a coop-game.\n8.67/10 for a Backrooms game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you have the right ppl to play with then this is the best Backrooms game so far that i can say it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Thought this game would be another \"rush trough the levels\" game but I was very wrong. Got deeply immersed in the gameplay and it has fantastic music/ambiance (shout out to ins0mnic)! \r\n\r\nps, crouch and use the walkie talkie when playing with friends",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very fun to play with friends, highly recommend :3 encountered a few bugs but nothing major.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't care about the bugs. This game is still the best backrooms game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game was awesome, a lot of screaming and raging on my friends were done. 10/10 would recommend, not the lighthearted.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Bought and played originally in 2022 in early access, now played it again and it grew to like 5x the original game.\r\nRequires some polish, especially in terms of enemy AI, but I'd be lying if I told you it isn't worth it for the sheer amount of content and fun you can have in it. Absolute banger, that will only get more and more polished with future patches.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "WHY THERE ISN'T 3440 X 1440 RESOLUTION ?! , before the last update the game was just fine. Now with it's new menu UI it's just bad",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played this game in early access and just finished replaying it now that the full release is out. Lots of fun to play! A few of the levels are super unique too, so if you're looking for something to play with friends I recommend this. Loved it!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of levels with variety, good co op game or even solo if you're good enough, different modes for different skill sets",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The door mechanics are absolutely incredible.  Since the game is mainly comprised of running from hostile entities and other abnormal anomalies, the doors' hinges are designed to swing in both direction (inwards and outwards) in order to ensure smooth continuous gameplay. Astounding!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Extremely good multiplayer game. Cutscenes have some of the best cinematic visuals I have ever seen.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely such a fun game to play with friends. Can't wait to see the future updates and the hopefully many more levels to come!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "AMAZING game I was attacked by a skin stealer and ran to my teammate's screaming and they closed the door on me.\n\nPeak game however I had to wait for the update as my friends beat it without me.\n\nIf your reading this you know who you are thank you for helping me beat the game.\n\nYour not living life to the fullest if you haven't played this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Can't rebind the walking buttons so my left-handed friend has to bend his hands in unimaginable ways to play this game. 10/10, please torture him more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great casual game with friends. Some spooky stuff.\r\n\r\nThe newest last level with the new entity is next level compared to the rest of the game though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just finished the game and realized that the backrooms is the friends we mad along the way",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a game that resides within my heart in a different way, I probably have never felt more fear, adrenaline, excitement, and happiness all mixed in at once playing a game. One of the only games I truly love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "really good game, especially since the new update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game.  Best played in Multiplayer, IMO. Be ready to solve puzzles, run for your life, and sometimes both at once!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "after the 1.0 update, this game now has several secret levels, and several secret endings, all with varying, but still fun difficulty. i enjoyed this game even before and completed it fully with one person (not dropping their user) we beat the game in about 8 hours if i remember right, but we also took our time, scavenging everything for things like almond water, power-ups, and radios and stuff",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very funny game with friends, I encountered a few bugs here and there but nothing too game breaking.\n\nYou should buy it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stared into the eyes of my \"Friend\" as he shut the door in my face letting a monster rip me to pieces.\n\nThis game is good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my fav game EVER, its super fun to play with friends or even alone, but i recommend with friends, the gameplay is great and just everything about this game is amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun game to play with friends. Terrifying and fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the best game among the games of 'Backroom'\nThis game will give you great experience for sure\n\nAlmond waterl",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super good game. Cool graphics and addictive gameplay. I love this game. Better with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Finished it with a buddy, and now looking for more levels or another game. We are laid back so played on easy to avoid sanity loss. We tried backrooms escape together and did not want to deal with sanity levels so this game really won us over.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun with friends if all your friends are idiots. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I very much enjoyed this as a multiplayer game. The variety of the levels kept it interesting and engaging. Even on normal it was quite difficult but still doable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good multi-player horror game. Its not just the trashy friendslop that's been getting made lately. It's mainly jump scares which is fun when playing with friends. Some of the puzzles can be kind of annoying to solve but usually other teammates can carry when needed. The only actual issue my friends and I had while playing is you can't walk through your teammates so getting through doorways or running down hallways can be very frustrating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun with friends and interesting creative levels",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun with friends, otherwise if single player it'll be more eerie. Based on which preference you like more there's something you'll like about the game, whether it's about how beautiful some parts look, how liminal, how funny, how scary, something has to fit. \n\nThe only down sides I see of this game is that the sanity system can feel a bit underwhelming and there should be more mechanics towards health or status. Some parts of the game have quality drop off's while some others look really good. And some levels just feel like fillers toward progression, nothing to special. \n\nOverall most of the down sides can be look past since it's incredibly funny playing with other people which is what's most intended. Plus being able to mod the game is nice too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game. Weird to get used to in the beginning but once familiar with the game mechanics I couldn't stop playing and finishing all the endings with my friends. Awesome game. 10/10 Highly recommend :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly one of the best games I played. me and my dad have played through at least 6 times. \ngreat job devs!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I escaped the backrooms, a week later it gets update and I have to escape it again :( Truly giving me the backrooms feel of being an eternity in there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a good backrooms game that's fun solo or with friends this is it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great and also enjoyable to play with your friends, but i think they should do some changes regarding the sanity system and the spawn of almonds, taking in consideration the amount of players in the party. There have been quite a few times where the availability of almonds were simply just not enough for everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fire, haven't played since the update but highly recommended, especially with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best multiplayer horror games I have ever played, definitely more fun with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good, well polished, replay-ability is chopped ash however.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game to play with friends but can be frustrating sometimes especialy on the higher difficulties",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best backrooms games good graphics, good gameplay, and its easy to learn most of the controls. Good to gain friends, have funny moments with random people, and scary but fun moments in solo and more! Over 100 hours on this game and i still dont know all of the bugs, and other glitches so yeah, its really hard to master, but easy to learn \r\n\r\ni'd give this game a solid 9.9/10 because there are some annoying moments like entity's killing through walls, and more so yeah, if you love Horror games, Puzzles, and 4 player coop, this game is for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love hanging out here; it's perfect (I loved the innocent character design and the backroom concept!). It's really fun to play with people from all over the world. The Americans are great friends, and the Chinese... the funniest! I had some great, entertaining times in multiplayer and some terrifying moments playing solo. I recommend it as a bedtime game—don't forget the warm milk!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super fun game if you have friends to play with. Ive played this game more than once and i will prob play again soon. honestly worth the buy its pretty enjoyable if you are into scary games :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game! I really enjoy it, but I really need to play it with someone else for once. If you're reading this, feel free to hit me up to play this with you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very funny and scary game. best played with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been following this game through some stages of development. Ever since the release of 1.0 it has added a good amount to the story. We finally make it out of the backrooms with this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game Good with friends and the new room are fun all around good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of my favorites to play with my friends. It has tons of levels to explore and multiple entities that roam the levels with some lore. Me and 5 others have made some great memories playing this game and I hope it goes to continue on with other people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun scary game def recommended to play with more than 3 friends its rlly hard when its jus two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Backrooms game i have 12 different ones and this one is the best solo or with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played with friends, friends made blood curdling screams. Would play again 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and goofy experience for friends, one of the best games I've ever downloaded, replay it all the time since the demo version. 10/10 Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed this a lot with my friends and cant wait for the next updated!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game you absolutely must try with your friends. All achivements are easy to get except the nightmare mode with four friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pure jank, but it's fun jank. It's unfair at times, and definitely could use a LOT more polish. It's also much more goofy than scary, but it's fun and doesn't crash!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, play it with friends to make it hilarious, or play it by yourself to make it terrifying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☑ Old Fashioned\n☐ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☑ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☑ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best games I have ever played, the music is incredible with every level. It's so fun solo and multiplayer. the FUN level and RUN level live rent free in my head.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played most backrooms/liminal games on steam and this is the best one. It has the most diverse settings and paths, many entities and gameplay mechanics, and an unbeatable atmosphere. The developers are consistent in putting out quality updates. Even more fun if you play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game to play with friends!\nalthough a lot of bugs from 1.0 update-",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really need a freind to backup or support the gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NEEDS MORE ROOMS/MAPS AND ADD NEW MONSTERS AND ADD JUMPSCARES TO MAKE IT MORE SCARY, ALSO SHOULD MAKE HARD MODE A BIT HARDER, GAME FEELS A LITTLE TOO EASY, ALSO ADD VARIETY, SO ITS NEVER THE SAME MAP/PUZZLE EVERY TIME. IT ADDS MORE REPLAY-ABLILITY AND MAKES THE GAME MORE FUN. (sorry for caps)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game, which changed my life: nothing can be more pleasant and dare for me. I have completed this game 7 times, which 2 of them were solo game. I highly recommend playing this particular backroom game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun game when you like beeing chassed by big black creaturs (i love this game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game, needs more levels tho. In few years(hopefully devs continue to push hard) its gonna be one of the best CO-OP horrors out there. With few tweaks of the enemy AI, plus some realism, its gon' be FIRE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun to play with friends. If you're gonna play this game, definitely play it with a group of friends and definetly make use of the proximity chat. \n\nMy recommendation is for your first playtrough you should play it on normal mode as it is by far the best mode to truly experience the game, this way you'll also experience the funniest possible moments the game has to offer. Further if you wanna go for a second playtrough, the choice is yours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect game to play in a dark room, alone, in middle of the night, and then your neighbour knocks and you sh*t yourself..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice Game to play with Friends. Active dev (always new things and BTS on YouTube).\nFun to play and good Levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with friends, some levels are really creatively made. Worth buying to play with a few friends. Currently about 11 levels, more being added, it's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best backrooms game ive played alot of levels and there all good 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Backrooms game out there 100 percent recommend and its amazing with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was very fun to play with friends,im now scared of emtpy rooms",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best, \"best with friends\" games I've ever played. Love th unique charm of the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great with friends and is about 7-10hours worth of content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun, scary, never boring, great to play with good friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game to play with your friends. Hands down the best backrooms game on steam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game when you're not playing with idiots in nightmare mode 4 players",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game is a bunch of indies ideas poorly executed and is quite bad. If it was not with my friends I would never reach to the point I`ve reached before quitting. \n\nThere are rooms that are just empty.....just a very bad soundtrack.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "the game itself is not bad necessarily\ni bought the game on early access and was informed that the full game update would fix many issues with the gameplay loop and add a lot of new content\n\nin truth it was about 3/4 cutscene's for going to places you explored before and about 3 levels worth of content \nif you have 3 people willing to buy the game with you than it can be a lot of fun, but that's most games\nyou will get your money's worth from this as a group but maybe find something else to use your money on",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Finished the game with friends, and oh, I’ve got some complaints.\n\nI want to start with a few nice things. For starters, the game uses the Backrooms concept well — the whole adaptation is alright and the levels are generally on point. The graphics are very nice, and the environments are genuinely enjoyable to look at — some levels, like the Poolrooms, were incredibly immersive. The overall control and perceiving the game were executed comfortably, and one last good thing worth mentioning is that puzzle progress saves after dying.\n\nBut uh, the game is only moderately enjoyable with great friends. In our opinion, playing it solo would be insufferable. So here's a list of the things we found frustrating, without dwelling on each one too long:\n\n- You're either lucky or unlucky, which often turns the game into a long spectating simulator — made worse by the lack of voice chat for dead players.\n- No storage spot to manage equipment efficiently, and too many items feel pointless.\n- Sanity does not refresh between levels, so surviving one level usually just means you’re doomed early in the next one.\n- Cannot refresh sanity as it's starting to eat you.\n- On the flooded city level, sanity drains unless you’re piloting the boat, so you’re either alone and suffering irl, or on the boat with a friend and eventually die.\n- The ID card feels pointless against mimics and is barely useful in general.\n- Monsters poorly executed: weird mechanics, random deaths, random kill distances, repetitive, and almost no real counterplay besides being \"lucky/unlucky\". Models and death animations are also disappointing.\n- Not particularly scary.\n- Lacks novelty.\n- Far too little almond water. \n- Instructions are sometimes overly direct—ruining the fun—and other times completely absent when needed.\n- There was a lot of untapped potential: adding notes from other workers as clues or as world-building, making the database rich and informative, and implementing microphone-based mechanics where monsters react to the player’s voice.\n\nTaken together, the game leans on the presence of friends to carry the fun, and unfortunately, it still doesn’t deliver a genuinely satisfying experience.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Be careful. \r\nDo not play this game if you have:\r\n\r\nJoy\r\nFree Time\r\nDignity\r\nEnough money for anything else\r\n\r\nIf you or a loved one has been affected negatively by this experience, please spread awareness to help others avoid such a fate. Thank you.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Garbage... This game made me question my life choices... I stared at the screen for 10 minutes straight questioning what the fuck I was doing with my life wasting my limited and precious time in this god forsaken planet playing this dogshit game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Shit game, crashes frequently, lost progress multiple times, voice chat is hit or miss, and is very glitchy when it does work. Levels are long, tedious, and many times the objective is unclear for a while. Do not buy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "unfortunately, the game is way worse once it came out. in total they added like three new levels and all of the endings are just like random 30 second long animations. it wasnt good. it has left me very disappointed unfortunately",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Garbage game, 1.0 my ass\n\n1) Borderless Fullscreen doesn't work (Keeps switching back to Fullscreen)\n2) Progression isn't saved beyond the second level neither for me or my friend",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Play Backrooms: Escape Together if you want a fun experience. This sh!t is like having swamp ass during a wedding.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The long awaited update was confusing and disappointing. its very glitchy. It made us wait this long for not more 10 seconds cut scenes.  I do not recommend this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even when the game announces a 1.0 release (which should means that the game is entirely completed and polished for a full release btw), the previous levels have not been changed in the slightest and still have the same problems and glitches than in the alpha.\r\n\r\nThe game design isn't great, you basically drink almond water constantly (or not depending on the level, but it is never clear which level drains your sanity or not). Half of the items you get are only beneficial in one or two levels and take up inventory space.\r\n\r\nEntities have unpredictable behaviour and can sometimes kill through walls and small gaps due to their stupidly large detection range. A lot of entities have only one animation for moving around and are always reused between levels. It is simply not fun.\r\n\r\nLevel design is... what it is to be honest. Some levels are waaay too long (hello level 2), unbalanced or both. You can be killed by things in the levels without knowing about them beforehand.\r\n\r\nOverall this game feels like an incomplete student project despite its long dev time and good ideas here and there. Everything is just poorly executed, which is a bummer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[strike] puzzle and mapdesign is crazy boring but atleast you can laugh with friends [/strike]\n\nOk nah nevermind its just boring as hell",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I cant believe that this game has been in development for this long and still is super buggy or even buggier than what i played last time ( July 2023 ) im sorry but i just cant recommend this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Frustrating gameplay... The character will pant and slow down after running for like only 10m... Also, I played the Early Access version in 2023 and now the 1.0 version still feels buggy and boring :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "In almost every level I played, I encountered bugs that prevented normal completion, and even playing with a friend couldn't save it from being boring.\n\nSometimes I play low-quality games, but this one is just too much for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is the most shittiest thing i have ebver played it is the worst game erver worst than a grandmas toe",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely miserable experience but I had to finish it out of sunk cost fallacy. Super glitchy, very little communication with the player in some levels (the moth level, the fun level) making it take a lot of deaths and eventually just giving up and using a walkthrough rather than finding things out on my own in a more fun way. Not a fan of the sanity meter since most of the game just consists of moving very slowly/sneaking/exploring which takes up a lot of time, especially when there is very few items around the maps to keep yourself from dying.\r\nThe creature designs are super boring considering how creative the environments are as a concept, I like the dog though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am dissapointed on this 1.0 release\r\n\r\nI have been following Fancy’s updates on the game ever since his first video posted on the topic, and I was a big fan! You could tell he had a passionate idea of transforming the backrooms into an expansive game with a bunch of different levels to make you really feel immersed in this experience.\r\nAnd as the game first launched as early access, I played every single update, and experienced all the things the game had to offer, and it was really fun! \r\nFor the time, backrooms games weren’t as common, and this game really was different than others. But, as time passed, nothing really changed much…\r\nSure, there were new updates, and new levels eventually got into the game, even if it took a while, but nothing really got refined. Old levels basically stayed the same and entities are all as basic as spot and chase, almost no difference between them at all.\r\nEven then, all of this was actually completely fine FOR AN EARLY ACCESS GAME from a developer who is learning to use new tools.\r\n\r\nAnd then 1.0 launched, and basically nothing changed.\r\n\r\nA few new levels were added, but that is about it, all the old stuff is unrefined and buggy as ever, the entities are too basic and lame, and the levels all have fixed structures, no randomness or procedural generation (as once teased by the developer that there would be)\r\nAs someone who had a lot of expectations on this game, I am disappointed. The growth I saw this game have throughout the YEARS felt like meant nothing, as it felt like the developer decided to launch this “1.0” to justify it coming to consoles soon (Why would you want to port your game to consoles if it isn’t even a full game yet?)\r\n\r\nBut after all, I will still keep my eye on this game, and I hope it changes for the better in the future, but for now, I can’t recommend it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it made me laugh a lot, i dont think the game was supposed to do that. also the game is extremely buggy and some of the shit in this game is unbelievably tedious and unfun which outweighs the funny stuff so probably skip this game!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is ok, but there's a problem with the audio (it's like my friends are near a very loud waterfall) and the online servers keep crashing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just to many bugs/ cursers is to far from the real one/ windoes borader does not work at all/ and it get stuck in the mittal ramdomliy if you dont have mosin bur on????/ syetem I5 6500, 16gig of ram, 1030gtx,",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ive never felt the need to leave a review but this game is actually terrible, the levels are 90% empty open room with nothing to interact with, the monster\"s\" were the same each time, can be outran forever\ncontrols are bad, the ambient soundtrack is just 1 noise playing at full volume the entire time and doesnt loop?????? makes for a completely non immersive game experience \ndont buy this game 6 bucks are better spent on a god damn scratch off ticket",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have been a fan of this game for a very long time. But I cannot in good conscience recommend this to you and your friend group in its' current state. Here's why:\n\nThis game relies on it being the backrooms (and to be honest, it's the best backrooms adaptation. But that's not high praise, most backrooms games are shovelware garbage) to make it fun. I like the backrooms. That means I like this game.\n\nHOWEVER, the new content is incredibly disappointing. Everything in the game feels more like a chore, with repetetive enemies, repetetive objectives. It's buggy still. Even with multiple paths and exits/endings, very limited player free choice to explore the game. You and your friends will have fun at first, but you'll soon realize it's because you're playing with friends, not because the game is a genuinely good game.\n\nI had high hopes for the updates. Even skipped the previous update to play in tandem with the 1.0 content drops. I've seen everything the game has to offer firsthand minus level \"You cheated\", which is just a room for lore purposes.\n\nSave your money. Keep an eye on this game. If content is steadily added over the next two years, so the game has double the levels it has now and ONLY IF THE CONTENT IS NOT REPETETIVE I could see this being worth the time and money investment (10$/person) for a group of friends. But for now and the forseeable future, I don't think it's worth it. You'd have more fun with some of the new-wave roblox horror titles.\n\nI appreciate the dev for making a good backrooms game. I will continue to support the dev in spirit. But I cannot condone shipping this out, calling it good, and raking in bank from something that, underneath it's lore/backrooms exterior, quite frankly sucks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "(holy yap lmao)\nWhile I agree that this game can be fun, it mostly boils down to finding an item or activating a lever, with a few exceptions. Essentially, 60% of the game consists of variations on the same task and mechanic, while the remaining 40% feels slightly more unique.\nJank:\nPlayer movement, animations, and character model behavior are basic - and let's be honest - janky. The AI is extremely simplistic and dumb: it follows a straight line along the nearest pathfinding lane and gets stuck on uneven terrain, or sometimes it goes where it shouldn't (like Clumps can drop into pools). The only differences between enemies are movement speed and the fact that some can be countered with the flashlight.\nLevels:\nThe levels gradually improve in visual quality toward the end of the game. Even the reworked early levels don't show noticeable differences. In maps with hiding spots, the holes are either too large or too small, making them stand out awkwardly against the environment. The thalassophobia level and the moth-pipe level force you to wander aimlessly if you don't know the path (tested with multiple groups - our record for the pipe one was 1.5 hours of circling without progress). Also, thanks for the checkpoints; saving your location is nice, but respawning everyone at a previous checkpoint just because one player wandered there accidentally is even better, right?\nEnding:\nThe ending is completely confusing. You finish the final level, hit a black loading screen, and then get an \"unlocked ending\" message before waking up in a room full of beds. Did you actually beat the game? Was that the real ending or just bait? Short answer: yes, you completed it. Feel free to Alt+F4 and uninstall - the experience and structure don't inspire replays. The funniest part? A simple prompt asking if you want to continue would have cleared up the confusion.\nConclusion:\nIn my opinion, the game is okay-ish - neither good nor bad. Yes, it's the dev's first full solo project, and sure, there are worse games out there for a higher price. But when I sat down to decide whether I'd give it a thumbs-up review, I kept thinking about my friends' disappointment after we waited eagerly for 1.0, only to replay the same underwhelming experience we had in Early Access. For me, it simply doesn't clear the bar of \"good enough\".\nAdditional developers joined late in development, and the hype train started, after a full year of radio silence on the Steam page. So what did they actually deliver? A handful of extra levels (hardly a game-changer), maybe some bug fixes (every EA bugs I reported are all still present), and... the removal of a few existing levels? No matter how hard I try, I just don't see a polished, finished product here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you like running around a maze until you get killed by a crappy looking monster that sounds like a dinosaur this game may be for you. It's just an over-hyped crappy indie game with no content.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No quality of life features whatsoever. This game was programmed by poop from a butt.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DISCLAIMER: This review is mainly based on the disappointing 1.0 update. \n\nAs I have been a long time fan of this game and its developer, it’s hard for me to say that this game has officially persuaded me to write a negative review. The 1.0 release was one of the most disappointing updates that I have ever seen in a game. We waited two years for an update half the size of previous updates that took half as long to release. In addition, on discord the developer promised features that never came to be, while updating us every 1-2 months max with barely any information, besides: UPDATE IS 99.99999999999% done, which had been the case for the past year. Promised us a console release, while claiming that the update had been finished since January 2025 and hadn’t been released due to “console store requirements”, while then launching the game this October still without console support. \n\nTL;DR: The dev can no longer be trusted to give us accurate and consistent feedback on updates. \n\nNow on to the actual game:\nThe dev hired a group of individuals to help him polish his game, and while the update took nearly two years to release, there were far more bugs introduced than were removed. My friend and I had game-breaking bugs during our playthrough of the update, one of which being that we were unable to interact with many of the necessary items needed to complete the game, forcing us to scrap our save file after attempts to fix it. In regards to the “new” levels added, one is the new “base” area, which is not actual gameplay but rather an area that takes 20 seconds to walk through, another is a walking sim that takes about 5 minutes, one is based on a weak, easy knockoff of weeping angel mechanics, and the only one that is actually pretty good is another reskin of level 0 with entities we have already seen. \n\nThis review has been completely negative, but I will say that the dev does at least “seem” passionate about the game. If you haven’t played before it can be a fun experience, minus the bugs, especially when you are with friends.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is unpolished. Months without updates that don't fix issues but add them. No native ultrawide support, terrible mouse controls that cause me motion sickness.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I dont know how a game can get worse after \"officially\" being launched in 1.0 but these guys did a pretty good job at ruining it. Now the only good backrooms game left is Inside the Backrooms.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Entirely boring rendition of the backrooms, every level is a back and forth grab an item go back, the party levels are the worst of all with the enemies having terrible AI and one of the sections literally being popping every balloon in the level hoping to find a key, the games animations are entirely unpolished and the enemies are not scary at all, with the only good one being the mimic enemies. \r\noverall this game is an unpolished mess with terrible controls bad mechanics and downright boring puzzles and is not worth whatever amount of money is being asked for it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is incredibly unfun. It's a walking simulator relying on the concept of a backrooms game to be interesting. The id mechanic does nothing whenever skinwalkers just turn and instantly run towards you, and they're not disguised half the time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Look, I'm not going to lie, I have had a few laughs with friends playing this, but I do have alot to say. The level design is very repetitive, and it gets old very quickly. Many levels introduce new enemies which is fun and keeps things fresh, however this is't enough to offset the sheer amount of times the siren head and the imposter are simply cut and pasted across different levels. The animations for the enemies themselves are not well polished to say the least, and most of them just end up coming across as goofy instead of scary. I understand that the game is made by single developer, however it is far less polished than you would expect for a game that has just had it's official release.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Refunded, graphics are insanely bad, all of the game mechanics are so simple its just boring to play. All you do is go through levels with monsters chasing you that have just a little bit of difference between them. Game feels like an standard asset flip",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not saving your inventory upon entering a new level and then dying in that level makes the game a speed run simulator because of the almond water, which takes away from the atmosphere.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dont understand why this was so hyped to be out of early access. it still feels like its in early access.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game was fun till the last update which i waited for approximately  2 years !!!! just for confusing \"NEW ending scenes\" which btw they said new levels plus every thing is glitched and laggy and the ending scene is not nice at all dont recommned the game at all thank you :)  DONT WASTE YOUR TIME",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bugs... So many bugs... Always bugs... I've had this game for a while and its only rly tolerable with friends but sometimes the bugs are just so bas I can't even do that. The game is super linear so replayability doesn't rly exist, and I just wind up either bored from the lack of stuff to do or annoyed by the constant game breaking bugs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most of levels boring piece of shit. No good co-op mechanics, just few semi-interesting levels.\n1.0 Launch have 4 new levels (which going around 10 minutes of gameplay, 1.5 year of \"development\") and had nothing special. \nAnd with 1.0 launch developer broke old save files and you must REPLAY ALL SHIT LEVELS AGAIN FOR FUCKING 10 NEW MINUTES OF GAMEPLAY.\nBiggest disappointment of indie games",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "We REPLAYED 8 hour's of the game to play new levels for 10 minutes and see 2 custscenes. It's just pathetic for new 1.0",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pre-dog-maze: The game is spooky and fun!\n\nPost-dog-maze: Why are these dogs so much louder than everything else in the game, why are there so many of them, and why do is there absolutely no pointers on what to do or where to go? Also the game bugged twice and didnt open doors even when we unlocked everything. Absolutely a boring, loud, unnecessary drag and we quit playing after dying the 3rd time, if that level was removed I think the game would be a lot better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish I could say it was good but it wasnt. I wish I could refund it but I cant. This is a bad game with bad level design. Its unfun beyond the second hour. 1.0 release is bad, and likely it would take update after update after update to fix.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game blows shit out of its ass and anyone who says this game is a fun time with friends probably has the IQ to unironically enjoy backrooms content.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im sorry but this is lowkey a dogshit low quality version of inside the backrooms, has potential to be good but it would need a nearly complete redo, sorry I would love to like this game but its fr kinda ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is not enjoyable and is poorly designed for a player's experience.\n\nIt's a multiplayer, puzzle based exploration game. This would be a decent formula, except there's also player death with checkpoint-based respawns. This leads to a terrible and unenjoyable experience for players.\n\nYou're in a group of up to 4. When you die, you just sit there spectating someone who is alive until some predefined checkpoint. Given that the game is a mystery exploration, monsters are going to be a surprise with how they work. A player can't (and shouldn't) be expected the first time to understand how they work to avoid being killed. So, the game should be either forgiving with this in some way, or make it so that the players left alive are somehow on a timer to solve the puzzle/complete the level / get to a respawn point.\nOtherwise, players that have died are just spectating, unable to help with the puzzle, unable to move around and explore, potentially indefinitely. This is just not fun and ruins the experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "genuinely one of the worst games ive ever played, unfun and terrible levels with jank monster designs and isnt scary.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not sure how this game is rated so highly when only 30% of players have completed the first level, which consists of running around a maze until you find an exit. Having to traverse \"30 different eerie levels\" sounds engaging at first until it falls flat with each level consisting of the same recycled mazes and puzzles (flip 10 switches and open 20 empty doors), along with enemy AI which could be made with a 5 minute tutorial.\n\ntldr: game plays like a 24 hour horror game challenge and is overrated",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is the scariest ass hair pulling example of bad level design ever concieved in a videogame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it dont work, when the tab is selected my mouse icon gets squished down, and i have to move the mouse ABOVE the button to PRESS IT. i hover over the button it selects the one below it. WHYYYYYYY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game blows ass, groupslop up my cock and more. How this game is popular is beyond me. Unless people are using it to go to bed, cause it is boring as fuck -- a real fucking sleeper. $10 nap time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was going well, until I did not follow the \"fun\" sign. I got sent back 3 or 4 levels, levels that are extremely tedious. It is a shame, I do not care if it is a lore accurate mechanic, I do not have the time to replay another two hours to get back to where I was. The game was showing promise, but this is quite frankly a slap in the face for no reason. Sorry, it showed promise but I do not have time for this nonsense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Since the new update started, the game has slight changes but gained some errors, the cursor mouse is not fixed! in game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game isnt scary at all, i didnt scream not fun \nnot recommended !\nvery very bad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun at the start but gets boring after a while with friends.\nIts just boring all by you're self.\nEscape the backrooms its fun playing with friends but when you finish the game for first time and you go for a second play though. it's not fun and then you realise the game is built like trash there some bugs you find and you wonder why it's not fix yet.\n\nSummary: Just play with friends",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play with friends and laugh at the jank, but no more than once. Also why is this game 25 GB?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The release introduced numerous game breaking bugs, none of the annoying / boringly long parts were changed, the playthrough follows the same linear path as before (but with additional endings), THEY LITERALLY ADVERTISED THEIR PLUSHIE MERCH BEFORE ROLLING OUT A PATCH. If that doesn't say enough about the game, I don't know what could.\nThis game was fun to complete once while it was still in early access, but not more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it definitely needs more polish, it is very rough with all the audio, the graphics are not great either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Buggy and kind of blows. Too hard for the wrong reasons and flashlights suck. Gotta give it a 4/10. Sorry",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "theres some sort of softlock or something in level 2 with the smilers. the gate to electrical station wont open or not being triggered, the smiller in the tunnel wont chase me all the way, it keeps running back where it spawns in. also the meg door up the ramp wont open, theres no option to open it/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game file is larger than most AA game \nyet runs terribly with countless glitches and bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is the worst backrooms on steam my character has asthma and cant run for more than 3 seconds   with huffing and puffing and that smiler level is the worst deigned thing known to man and I hope if the developer ever sees this that he fixes the stamina amount and don't make every floor a guessing game of what to do, and if u are the developer fuck you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game yet gets boring fast, hard levels often made to unlogically complicate things just to add bad puzzle or just a copy of another level with same monster (Such as pool level, you literally deal with the same monster you've dealt before) game lacks the necessary different spices that makes the Backrooms THE Backrooms. I've played and finished it with my friend, and trust me, even with a friend this game bores you. At least it bore me. My suggestion is go an spend your money on another co-op horror game. I respect the developer knowing he made this game as a single dev and honeslty he did a pretty solid job but the level design and pacing deals a heavy blow to my score to the game. I don't recommend it until a new update that fixes these comes. Hope I helped you decide, peace <3",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game REALLY doesn't like it when you try and remap the keybindings. It's like it fights you every step of the way if you reconfigure them. Some examples I encountered:\n[list]\n[*]Sometimes the old configuration sticks while the new configuration is in place\n[*]The tutorial prompts don't change based on your configuration, which is usually fine until you actually need to know which interaction key to press\n[*]Some monitor interactions simply didn't like that I had reconfigured my keybindings that it locked progression until I restored the keybindings to their defaults. Unlocking the M.E.G. Base door was more difficult than it should have been even when I was pressing the correct interaction key, then in the computer room, if you have a keybinding set to one of the keys that share the same letter as a letter in the password you have to input, it'll trigger the action you set in the configuration. For example, I set my text chat setting to Y, because that's what the default is in most of Valve's games, instead of locking out that configuration for the password input prompt, it opened up the bloody chat window.\n\nOn a more positive note, actual gameplay and level design isn't too bad. Still has that indie developer jank, but it's stable, and looks good enough. Props to the devs for actually remembering to provide an invert Y-axis option in the control settings.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So here's my experience... i fully finished the game, but i'll tell you what's wrong with the game and not. \nETB is a beautiful game with impresive design, loved the environment, the rooms, etc.  It's a fun game to play with your friend (if you want to ragebait them). The promblem are the enemies, they are too fast, too quick and for some what reason multiple monster was used repetly on different levels. We died so many times because when we're trying to do an objectives the monsters spot you from 50km across the room and chase you like he's usain bolt. Like my guy i'm trying to do an objective and have a fun experience and not doing the death version of the olympics. It was pretty harsh sometimes because of that... Also the dev, instead of putting 3 different enemies with some weird mechanics, concentrate maybe instead on 1 monster per level but make it insane, crazy, huge, etc with some crazy mechanics. Also the game felt alot like a try and die game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do you like mazes? NOT THESE ONES! every level is either a maze filled with BS enemies or a get from A to B that is super monotonous. insanity is more annoying than scary because most of the time it was just poor RNG or having to wait for my friend at the exit for too long that caused it. Then theres just a general lack of polish and direction, the last one is probably intentional but that doesnt make it any more enjoyable. \nthere are only 2 types of enemies, wandering ones that can spot you from a different continent and stationary ones that force you to move super slow, so as long as you are going 0.1 MPH the whole time you cant die. theres a leaning mechanic but if you lean around a corner they still spot you instantly and you cant move at all while leaning so its strategically advantageous to just throw yourself around every corner and be prepared to run and hide for the rest of the day. Then when you come out of hiding, SURPRISE theyre still standing there and they instakill you before you can get back in the hiding spot.\nI had high hopes for this game and tried to like it but i couldnt.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfun maze hell with terrible enemy design\nI really wanted to like this game but the way the enemies interact is so goofy, the only challenge is hit registration, and aimlessly walking around.\n\nObviously with the backrooms I expect mazes and walking around but this does a ton of lazy copy pasting, and is designed to waste the users time, instead of bring an experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so frist the mouse is brokein it very hard to play and you cant git out of it even whtht tast manger",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was a great game and now all of the sudden on launch it's a buggy mess. It's taken an hour so far just to get 3 people in a lobby with how hard it is to get a lobby stable enough to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game erased all of my progress after the latest update. Fuck y'all",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible Game play, You cant do anything if a monster comes for you because your legs are noodles.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Over two years of development, the game has gotten worse. The monsters from the old levels have been made so weak that they don't catch you at all and are now completely useless. And the new levels are extremely tedious and boring. There isn't a single good level left in the game.\r\n--------\r\nЗа 2 года разработки игра стала хуже. Монстров из старых уровней сделали настолько лёгкими, что они вообще тебя не ловят и совсем теперь бесполезны. А новые уровни крайне нудные и скучные. В игре буквально не осталось ни одного хорошего уровня.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is terrible dev only updates to sell his plushies and abandons game other wise, added basically nothing after several years",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I purchased this game based on the massive amount of positive reviews for me and my friends to play... I am shocked and appalled that this garbage is so highly rated. This is a shockingly low quality piece of trash. I just don't even have words to fully express how confused I am that this has 90% positive reviews, I really don't get it.\n\nThe maps themselves are decent enough quality wise, as are the controls but the monster quality and game play are... awful, just awful.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got it during early access and its still as janky and buggy as ever... I mean it says 1.0 release, but it's wonky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was an enjoyable jaunt for a while with some friends but the game is a poorly designed asset flip. Wouldn't play it to the end if you want to have fun, but not bad for an hour or so. \r\n\r\nCan't reccomend, the lack of minimum effort and polish, not to mention lobby breaking bugs and crashing really tarnished the ride.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I get existential dread by playing this nightmare. Not because it's that good, quite the contrary, as a standalone game, it is a horrible, sloppy chore.\nIt has good overall tone, an interesting (but lacking) narrative concept, but fails to deliver on gameplay and atmospheric horror.\nMy friend and I had to sit down to finish this game multiple times because how big a chore it was to get through the levels.\nAudio logs or more readable story aspects could improve this game but overall, just get a better game designer. I had more fun playing The Maw in Wow: Shadowlands than this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i think this game could have stayed in early access, as there are many issues in the early levels. no hate to the developers but please prioritize refining the already existing levels before adding new ones. it is very easy to get softlocked, making it impossible to progress without dying. at certain points the game forces you into death which can be very frustrating. the game has much to be fixed, and i would like to see improvement in the next updates. i have no doubt this can be a great game to play with friends, but as of now i will not be able to continue playing this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So i'm reviewing no because this is a 1.0 release and there feels like theres a lot of polish that should have been done. Some of the levels seem kinda glitchy, like the second fun room with the eyes on the walls. There didnt seem to be a rhyme or reason as to what triggered the mobs because no matter how many eyes we shut they just kept coming.\r\n\r\nOutside of that, I do have to say that me and my friends had a lot of fun, but I still think that this game should be a bit more finished.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ai is trash, controls are wonky, lore could be better and game is overall boring. only bought it because of my friend wanting to play it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Over a year to get from beta to 1.0 and only 4 new levels (2 normals, 2 secret).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is terrible. glitched out on the first level and was unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game isn't as fun as I'd hoped for and was hyped up to be :( - Crashes very frequently, sometimes to the point of restarting my whole PC. It's also insanely difficult for just wanting to play, and isn't very well made.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Super fun game and cool but my progress got restarted TWICE and i was super close to the end,do you guys have any ideas of why?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I do not know how you can be an escape/survival horror game where doors mean nothing because enemies can grab you through walls/doors.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Graphics are only alright, But the gameplay is unstable and there is nothing really special about the game, its just like any other backrooms game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even get into the game as it keeps crashing. What I did manage to play looked like someone's first stint at game development.\n\nThis was made in Unreal??? Really???\n\n3+ years of development, and we get a poorly animated single play through game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a terrible game!\r\n\r\nI came from Escape Together, which I loved, but got this seeing as 1.0 came out.\r\n\r\nI assume the people who are reviewing this well haven't played Escape Together. This game is junk in comparison.\r\n\r\nTerrible animations, poor visuals, crashes, bugs, glitches, models clipping through walls, etc, etc, etc...\r\n\r\nOn top of that, it has almost zero guidance. We were playing 3 player, and all 3 of us were just bored.\r\n\r\nAt one point, while navigating a level, I accidentally stumbled through a passageway that took EVERYONE back to the HUB. My friend was at the exit and was waiting for me. We then turned around, and we all had to navigate the maze again. Literally nothing indicated that it was an exit. The screen just faded out.\r\n\r\nEventually when it crashed and kicked one of us out, we all just quit rather than rejoining.\r\n\r\nIt sucks so much.\r\n\r\nPlease, get Escape Together instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basic ass cash grab game with assets slapped together with poorly designed levels combined with shitty enemy AI. literally could spend 10 bucks on anything else and it would be better than this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is not for me. To start, this is your typical Unreal Engine game, meaning its assets are unnecessarily detailed and there are a bunch of PBR effects that ultimately make the game look worse. The flashlight creates absolutely zero ambient lighting unless you're playing at very high graphics settings. It makes its surroundings either completely bright or completely dark, and when combined with bloom, makes the flashlight is as disorienting as it is useful. And there's your typical Unreal Engine Motion Blur™ that makes you want to vomit yourself to sleep. Motion blur is absolutely [i]not[/i] something you want in a low-light game. There is no reason for this game to be 20 gigabytes in storage and run mediocre on an average graphics card.\r\n\r\nThe game is not scary. I don't personally find mutilated creatures creepy by default. A character does not need to be covered in human skin or be full of teeth to be scary. But this game relies heavily on that sort of definition of creepy. Effectively every character has the same gameplay loop: wander around its world and, upon spotting the player, chase them until they die or escape. After the first few creatures, it gets old. I do appreciate the various gimmicks added here and there. (Level 2 spoiler) [spoiler]The creature in the garage level that initially looks like a human can be spooky at times. Here's a suggestion: if the players are using voice chat, take small snippets of their conversation and play them from the creature when it is disguised. Try to convince the players its one of their friends. It would fit much further in the \"uncanny valley\" side of things and possibly produce a scarier effect.[/spoiler] But the character design is overall poor, and the animations certainly don't help things. Often times the death animations are too funny to be scared of. Ugly thingy makes funny faces and then Blue Screen Of Death \"End Tape\" Fade To White.\r\n\r\nThe game is not fun. You're going to die a lot in this game, and the actual gameplay loop becomes a chore once you've died in a level enough times. I played in hard mode with my friend because it felt unfair to keep playing when the other died. When either of us died, we both started over. The challenges the game requires you to do are interesting enough at the start of a level, but become fairly benine towards the end. (Level 3 spoiler) [spoiler]The dog level was particularly tedious. There were a certain number of electrical switches that were randomly placed across the level. Fair enough, could be cool. The problem is that it's a 5-10 minute endeavor to locate all of them, and when you die all three are reset. I'll give it credit, at least there are save points every set of three, but the last set of 3 took us almost two and a half hours alone to complete.[/spoiler] When it wasn't a \"die or be dead\" situation, it was a \"wander around for a few minutes and chat situation,\" because there were zero enemies or obstacles of any kind. I'm not going to claim it was completely unenjoyable, but it became an entirely different game. It felt like we were accomplishing a task rather than playing a game. In many of the levels, our movements would become quite choreographed, we would execute a specific sequence of actions every time. Again, we found our own fun, but I wouldn't call this a successful horror experience by any means.\r\n\r\nThe game is unpolished. For the later creatures, there is either effectively no jumpscare sound or literally no jumpscare sound. The creature animations are pretty terrible, and the jumpscares are often just them wiggling their face at you or moving towards you at a medium pace. The third-person animations are equally as terrible/humorous. There are far fewer sounds in the game than there should be. Some levels have no ambient sound or music whatsoever. There are also plenty of bugs. The worst case being Level Fun. (Level Fun spoiler) [spoiler]I don't fully understand the glitch, but when targeting a player, if a monster clips the edge of a wall trying to chase the player, all currently aggro'd monsters freeze. This action is undone by crawling under a table, which cancels all aggro's. In addition, if a \"fixed\" monster comes in contact with a \"broken\" monster, both monsters become broken, leading to a cascading effect. This bug has been in the game since at least September 2022. Hell, they even replaced the models of the monsters without meaningfully fixing the bug.[/spoiler] There are also plenty of small bugs that occur here and there that overall reduce my immersion in the game. However, I'll admit that this is on the minor spectrum of things.\r\n\r\nThe game isn't the backrooms. Effectively every level after (Game progression spoiler) [spoiler]\"The End\"[/spoiler] feels like an entirely different game. It felt as if that level was intended to be the end, and then the game became popular and extra levels were slapped on top. Here are a few examples.\r\n\r\n(Level [spoiler]\"The End\"[/spoiler] spoiler) [spoiler]The clown section blew me away with how completely and utterly unrelated to the backrooms it was. It was just straight-up a different horror experience. It was almost the [i]exact[/i] antithesis. Rather than being in a vast space that's easy to get lost in, the clown section is in a single open room. Rather than exploring and hoping not to get caught, it was better to shove myself in a corner and wait for the guy to try and attack. It also had such obvious intentions. As soon as you see the clown statue you know he's going to start moving and attacking you. It was never unexpected for a moment. The axe scene was a completely different style of horror than what is typically in internet creepypasta horror (the backrooms, SCP, you get it), being much more down-to-earth and physical. And after the roller coaster in the dark with the clown definitely still around and no exit opened, the map just claims that's a win state and calls it a day.[/spoiler]\r\n\r\n(Level 6 spoiler) [spoiler]This level featured possibly the best gimmick in the entire game. I love the intention of the LiDAR scanner, and it's surprisingly polished as well. However, this absolutely does [b]NOT[/b] belong in a backrooms game! The implementation here was terrible. It was \"navigate a complicated maze nearly completely blind, with zero meaningful landmarks, while a creature roams around and occasionally bumps into you.\" The creature itself was trivial to negate by simply being constantly crouched. When crouched, the creature won't kill you even if you're moving and it literally bumps into you. The insanity meter almost felt as if it depleted faster than normal, and when either one of us went insane we had to completely start from the beginning, with zero leftover dots. The implementation of LiDAR would have been much better if you had to do more than try and run from a fella. I think if you had to solve a simple puzzle or two in a smaller maze with more landmarks, that could be interesting. And completely get rid of the insanity meter, maybe the fella too, make the entertainment factor some other form of horror, or maybe not horror at all. But this obviously can't be done in a game that trys to be the backrooms. That's totally fine, but [b][i]this[/i] level should not be in [i]this[/i] game[/b].[/spoiler]\r\n\r\nOverall, this game feels like a streamer game rather than a genuine attempt at good horror/game design. It suffers from similar fates as most other comedic multiplayer horror games (with some notable exceptions). There are Garry's Mod maps that capture the feeling of the backrooms better than this game. There are some genuinely good ideas in here for sure, but they're polluted by plenty of not-so-good game design choices. It's fun to play, but not for the purpose of immersion. It's fun to make fun of and occasionally be sick of together with a friend.\r\n\r\nIf you want a good horror experience, maybe pass on this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has been so ass :sob: can't play 5 mins straight without it kicking me, and then I can't get invited \r\nback. go play inside the backrooms if you want a backrooms game. hopefully they fix the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played it in pre-release and wasn't impressed. Was a little fun with friends. \r\n\r\nThought to try it again with its 1.0 release. Still feels incredibly boring even with friends. NPC's look and sound terrible. The AI is underwhelming along with the objectives. Navigating the levels can feel not intuitive. All sounds and animations are lackluster.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the first time a game has left me feeling so crushingly disappointed I felt the need to write a bad review for it. This is a glorified 9 hour long walking simulator with 2 good levels at the very end to grab your attention through youtube shorts, to trick you into thinking the whole game will be that. The devs clearly didnt playtest anything before releasing this game because wow... just wow.... some of these levels are truly so lazy and uneventful it'll leave your jaw on the floor. The audacity of these people to charge any amount of money for this piece of garbage makes me feel a type of anger I didn't know was humanly possible. This game sucks and nobody should ever subject themselves to this level of boredom, ever. I mean it literally when I say I would rather watch paint dry than play this. 0/10, booooooo. Please don't do this to yourself.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New update is kind of disappointing but also not. Level 974 was actually the most interesting level in the majority of the game. They upped the polish but the game is more buggy and crashes way more. It repeatedly crashed on my new hardware and my friend's old hardware, one time bricking both of our PCs into a soft lock simultaneously. I appreciate what this game has done for the genre but for the amount of time it has taken for this update and all of its issues, as well as declaring this a 1.0, is kinda crazy. I would still buy and play it because it has a few decent levels and is fun with friends but I cannot officially recommend it as it stands. But on that as well, they neutered some levels and removed others that were previously available. And the infinite staircase level? A lesson in poor game design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "half baked ideas top to bottom. I'd say go get Backrooms: escape together. still a bit undercooked but seems to be way more thought out and well exectuted than this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Second worst Co-Op game i've played in my life I'm not even joking, Nuclear Nightmare being the first worst game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Terrible game. What is the point of playing when most of the levels are RNG. If I wanted to experience RNG torture I would go play any gooner gacha game because atleast I like what I see.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some levels are fine, but its mostly just losing your own sanity.\n\nPlease add these tags on the game\n/Walking Simulator\n/Simulator\n/Point & Click\n\nNothing interesting happens in the game. All you do is wander around looking for a exit. \n\nLiDaR is impossible to use on ultra settings due to lens flare.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got this game as a gift from a friend, and that's pretty good, because, in my humble opinion, if you are playing this game by yourself, it's not really worth it. \nNow, I must confess that the game by itself is not necessarily bad. It looks good, it runs well on my machine and, at some points, the gameplay can be quite entertaining (the castle level and hallway chase were very cool). Having said that, I found most of the levels to be unfun, sluggish and unexciting. This was not because of a lack of instruction or clarity; instead, most of my frustrations came from my personal biases in regards to the setting - which I believe is bland and uninteresting -, the tedious navigation and the boring puzzle structure.\nThe only reason I managed to play this game as long as I have (and also finish it while it was on early-access) is because I have neat friends which made the experience engaging enough for me to stick around. \nSo, yeah. I really wouldn't recommend this game for solo-playing, but it could be an enjoyable (albeit a bit tedious) time with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a buggy, poorly designed game. Get Escape Together instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I died a year ago and while spectating the homie he died and glitched my camera.\n\na year later, the same glitch still exists.\n\ndont buy the game, braindead devs tbh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The worst shit that i have ever played so many bugs that its unplayable",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}