{
  "positive": [
    {
      "review": "To be honest, this game is amazing, but the lack of major updates, significant/interesting gameplay changes and bugfixes makes it boring, repetitive and annoying sometimes once you played for around 200 hours or more. Ofc there are mods for LC that will bring new stuff to it. But I'm not really complaing because this game was made by solo gamedev and it turned out to be very funny, yet still challenging and scary. 10/10 combination of comedy and horror.",
      "voted_up": true,
      "votes_helpful": 63
    },
    {
      "review": "Okay, this game has a few pros and a few cons. [i]Before[/i] I get into those, I'd like to make it clear that [b]I do recommend and enjoy this game.[/b] Now that that's out of the way:\r\n\r\n[h1]Pros[/h1]\r\n1. Really fun to play multiplayer, whether it's friends or strangers. The experience is always enjoyable.\r\n\r\n2. The art style is charming.\r\n\r\n3. The game can run on computers of all varieties, including potatoes.\r\n\r\n[h1]Cons[/h1]\r\n1. The grind is [b]INSANE.[/b] If you miss quota [i]once,[/i] say goodbye to [u]everything[/u] you've worked so hard to achieve. Personally, I like to collect new jumpsuits for my crew and I, so watching my collection reset time and time again is really upsetting. Also, this makes me less and less likely to play more as each time I get further, it's just another roll of the dice.\r\n\r\n2. It's much harder to play single-player than it should be. Quotas don't adjust for the number of players in the slightest, so if you're further in the game, you better grab some friends.\r\n\r\n3. Death is too fast. I've heard this complaint before, and I stand behind it. Dying in this game is too unavoidable and too easy. Yes, the clips are funny, but there has to be a middle ground.\r\n\r\n4. The inventory is [i]so[/i] small. Yeah, it works when playing alone, but when you're with friends? One slot will be used up on a flashlight, another for a walkie-talkie, and maybe even a [b]third[/b] for a weapon, key, jetpack, etc. At that point, you can only grab one thing at a time, which is insanely frustrating.\r\n\r\n[h2]My Suggestions[/h2]\r\n1. I think that when you die, all your equipment (such as flashlights, walkies, and shovels) should reset. However, the jumpsuits you purchased should stay attached to that save permanently. \"But bro, that means we'll have unlimited jumpsuits!\" No. Add a reasonable maximum number on the rack, as well as the option to sell existing jumpsuits. This way, the collection can stay with you, but change over time.\r\n\r\n2. On the health matter, there's a few possible solutions. On one hand, you could add a cheap med-kit item, but you'd also have to increase inventory space by a [b]minimum[/b] of 1 to compensate.\r\n\r\n3. Either increase health or stamina. If neither of those, make the enemies less insta-kill.\r\n\r\n4. Increase the inventory size. Either that or have designated slots for things like the flashlight and walkie.\r\n\r\nThank you for your time.",
      "voted_up": true,
      "votes_helpful": 43
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☑ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☑ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☑ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---( Compatibility )---\n☐  Doesn't even work well on MS Windows 10/11\n☐ It doesn't support GNU/Linux or Proton\n☑ It works well on all platforms\n☐ It works well and has a native version for GNU/Linux\n☐ It's compatible as having support for FreeBSD (Probably never gonna happen.)\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Lethal Company is the only game where your job description is literally:\r\n“Go into the abandoned facility full of nightmares. Bring back trash. Try not to die. (You will die.)”\r\n\r\nThe Company sends you to moons that look like a post-apocalyptic IKEA parking lot, and the moment you step outside, the universe politely informs you that every living creature wants to end your employment contract AND your spinal column.\r\n\r\nLet’s talk about the monsters—because these things feel like the devs opened the “deepest human fears” wiki and just said “yes.”\r\n\r\nThe Bracken (a.k.a. The Gaslight Gatekeep Girlboss Vine Man)\r\n\r\nThis creature does not kill you immediately.\r\nNo no. That would be merciful.\r\nThe Bracken just stalks you silently like it’s scrolling your social media history. You turn around? Nothing. You turn back? He’s in your personal space asking if you’ve accepted death into your heart today.\r\nHe breaks your neck in the exact same vibe as someone closing a book they’re bored of.\r\n\r\nThe Forest Keeper (a.k.a. Daddy Long-Legs With Anger Issues)\r\n\r\nThis big wooden disaster sounds like a tree being bullied by the wind. You’ll hear it before you see it—boom… boom…\r\nThen you do see it, and suddenly you’re sprinting like you never have in your life trying not to get slurped up like a Go-Gurt.\r\nHe grabs you, stares at you for exactly one (1) second, then eats you like a mozzarella stick.\r\n\r\nThe Coil-Head (a.k.a. The Reason I Now Sleep with the Lights On)\r\n\r\nOh, the Coil-Head.\r\nImagine a mannequin.\r\nNow imagine it moves only when you’re not looking, like a horror version of peak hide-and-seek competitiveness.\r\nThe entire “fight” is just you backing away slowly while your teammates yell:\r\n“WHO TURNED AROUND?! WHO BLINKED?! WHICH ONE OF YOU BETRAYED GOD?!”\r\n\r\nBunker Spiders (a.k.a. Homeowners Association Threats)\r\n\r\nThey live in corners. They wait. They judge.\r\nYou don’t see them at first—then suddenly you’re in a sticky web, rethinking every decision that led you here, including your choice of friends, career, and rental agreement.\r\nEvery encounter feels like being mugged by a hairy dinner plate.\r\n\r\nEyeless Dogs (a.k.a. Sonic the Hedgehog But Traumatized)\r\n\r\nThese beasts patrol the outside like nature’s security guards, except they hate all life and sound like they’ve swallowed a train whistle.\r\nThey can’t see you, so you think staying quiet helps… until your friend accidentally coughs and suddenly the whole planet is sprinting toward you at Mach 2.\r\n\r\nMeanwhile, your teammates will cause 90% of the deaths.\r\n\r\nYou’ll be sneaking carefully through a dark corridor, whispering, “Guys… I think something’s here,” and then your buddy behind you just decides to break into full Broadway tap-dance mode, summoning EVERYTHING within a mile.\r\n\r\nYou will also absolutely leave your friends to die.\r\nNot intentionally at first.\r\nBut the moment you hear footsteps behind you that aren’t YOUR footsteps, morality evaporates.\r\nYou run.\r\nYou don’t look back.\r\nYou show up at the ship alone.\r\n“Where’s everyone else?”\r\n“…collecting scrap.”\r\n\r\nVoice chat makes the game 10x funnier and 10x worse. Hearing someone scream “BIG GUY BIG GUY BIG GUY” before cutting to radio silence should legally count as cardio.\r\n\r\nAnd at the end of this nightmare?\r\nThe Company looks at the three pounds of bent metal you risked your life for and says:\r\n\r\n“Huh. That’s it?”\r\n\r\nIf I ever meet the CEO I’m dropkicking him into an Eyeless Dog pit.\r\n\r\nAnd yet—\r\nYou keep going back.\r\nYou keep dying.\r\nYou keep selling your friends’ corpses because Company quota does not care about your grief.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Without any shadow of a doubt one of the greatest games you will ever play. Every time I load this game to play with my friends, it feels like a sitcom episode. The funniest shit happens in this game, and it can not be replicated anywhere else. I have almost died from this game multiple times because I was laughing so hard. And it still manages to scare the shit out of you. And the mods, the mods add so much. I don't recommend always loading up sessions loaded with mods, especially with how unoptimised some of them are, but once in awhile they are great to just have some fun and laugh with your friends.\nCan not recommend this game enough, I always look forward to playing it again. One of my favorite games of all time.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "\"Run, buddy, run!\"\n\n\"Hang on, grab this stuff first and then run - screw your life. We need MONEY!\"\n\nThat was pretty much the kind of conversation I had with my buddies while gaming. XD\n\nThe game doesn't exactly have the most captivating potential, but it doesn't need to since, in my opinion, it's a casual game.\n\nMy last words - ring the bell over and over again ;)",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Lethal Company is a co-op horror game that’s equal parts funny and terrifying. You and your friends explore creepy, randomly generated facilities to collect scrap while a strict quota and deadly monsters pressure you every second. Voice chat chaos, panic screams, and dumb decisions make it insanely fun with friends.\n\nThe movement and combat are simple, but the tension, teamwork, and hilarious failures are what make it special. Great if you love co-op games and horror vibes.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best game to play with friends!!!\r\nThis game has gotten some Tom and Jerry type screams out of me, and I AM LOVING IT.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love it just have no one to really play with because they are all scaredy cats about it. :p",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if you have the right friend group who enjoys lowkey gameplay loops to goof off and chill too then this game is a good fit for you. light horror and progression, can feel like uve hit a wall quickly but if u dont think too hard about it you can keep playing as much as you want!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Awesome game but needs some new major content!\n\nSome recent additions are also a bit unfair. I know there’s a lot of ways you can die quickly. But the one hundred robot army that spawns outside on some moons is impossible to survive. If they were more like the other outdoor creatures that could kill you but also had a point of weakness/ some way to just avoid them, then it would be a reasonable thing to have in the game. Instead they launch Israel’s arsenal of missiles at you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. One moment alive, next moment neck is snapped by my bed paralysis demon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The gameplay loop and the modding scene makes this game always a joy to play with friends. Probably my personal fave game to play with friends at this current time. No matter how many other voice proximity horror esque games I play like REPO (or peak) I just find myself always coming back to good ol lethal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lethal Company is a perfect game for getting friends together if you're too scared to play alone, especially since the ambient sounds are just too good at making being alone the most terrifying thing imaginable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a super fun game! It's definitely quite scary as well. It is a little graphic for my personal tastes, but otherwise, this is a fantastic game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lethal Company is such a good game to play with friends. most of my friend group has the game so its really fun when we all mod and play the game together !\n\nA really fun game would recomend\n\naside from the bees",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I LOVE THE COMPANNY!!!!! mods make  this  game a JOY  to play, the base game is also really fun! pick it up with friends!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So, here's the deal with Lethal Company.\n\nThis game is a chaotic co-op and a factory for the most absurd, laugh-out-loud gaming moments. The concept is quite simple: you're a space-faring scrap stalker-collector for a shady Company, risking your life on haunted bum's planets to meet a profit quota. The atmosphere is thick and the lore is intriguingly sparse.\n\nWhen you have a crew that knows what they're doing, it's all you need. It's a game where communication isn't just helpful - it's your primary survival tool. This is also where the game shines as a social platform. I've met amazing people from all over the world, and joining a lobby based on language is a fantastic way to practice and have fun.\n\nWhat you should consider is - you will die. A lot. You'll watch your teammate attempt a graceful leap over a Slime, only to be consumed by it. You'll get snatched by a tentacle because someone didn't call out the noise. Without a coordinated team (or friends you bring along), the game can feel brutally unfair and short-lived.\n\nLethal Company doesn't hold your hand, and it punishes you for not knowing its secrets. If you don't have the monster behaviors and map layouts memorized, your run often ends in a two-minute sprint straight into the loving embrace of the Electric Bees. It forces you to either study the wiki or play enough to become a burden to your team until you learn. This can be a major turn-off for casual players.\n\nIt's a game that can absolutely hook you and provide unforgettable moments. Just be prepared for a rocky start and know that your team is the real endgame content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun with friends (if you have any). Also laughing and screaming makes me hungry :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Lethal Company\" is an amusing, fun, and scary game, best played at late hours with friends!\r\n\r\nI feel as if \"the more, the merrier\" couldn't be more true than with this game. It is especially fun to play with a full squad, and some of the monsters are certainly geared towards the idea of multiple players being in the lobby. \r\n\r\nI enjoy that there's a big variety in moons, monsters, and scrap that make every run feel unique, as well as all the lore tidbits stuffed into the world, which I can't wait to learn more about! I think it still comes off as a pretty complete game, despite still being a work-in-progress and lots of features/lore still being added in, just with a few areas that you definitely feel like should have something there! \r\n\r\nIt's an easy game to lose time in, because there are so many different ways to play or customize your experience by visiting different combinations of moons and changing up routes, and it's ultra-satisfying to build up those scrap numbers, collect upgrades, and deck out the ship. \r\n\r\nI find it very immersive with the thorough logs; however, I recognize the lore is probably not the most unique thing. Still, I think the designs and game dynamics of the monsters definitely steal the show. There's a lot of potential for story here too, and you can tell there was a lot of care and effort put into the game. \r\n\r\nThe overall community also does a lot to build this game up and help it stand out against other games that have a similar style/format. A lot of fun challenges have come from the streaming community, and I think it's fascinating that this game, while there are still speed-runners, has a robust community of high-quota runners that hype up the game's potential as well.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "game is very fun, easy to replay with or without friends. absolutely worth every penny for the amount of things to do. easy access with modding to make the game unique each way. very easy to play over and over for a great laugh with friends. anyone who says otherwise probably doesnt havent alot of fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "zeekerss update pls, 2 moons and 2 monsters, maybe 1 interior PLEASE. Lethal is too peak i need more content to sink my teeth into. pls update im itching for lethal updates",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A friend ran me over with a truck and I experienced the horrors\nVery fun game 11/10 will play again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "crazy fun game, especially with people who dont know what they are doing. I've never played a game that can be so terrifying yet hilarious at the same time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Is it a good game? Yeah just lacking updates. Developer released singleplayer solo game recently and promised previously to get to working on lethal again. Hopefully good things for this game in 2026",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You work and you work and you work, someone gets richer... not noticeably, just on paper. Just 0,0000001%\r\nAnd then you die.\r\nThe people who got rich off our labour don't even know we ever existed. To them we are \"human resources\", hires, fires, casualties... numbers in a spreadsheet somewhere in the cloud.\r\n\r\nTerrible game. And that's the point. Grab some mods if you want to have fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an extremely fluid game, definitely don't play it alone, play it with a friend, then you'll be able to play it for hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its lethal company. PLAY IT. My friend gifted it to me and it is peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good and fun witth friends and mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played on Steam Deck OLED\n—\n\nPerformance: Runs pretty good overall, except in the ship when levels are loading\n\nGameplay: A lot of fun to play with friends. The proximity sound effects are really neat (like when players are muffled) and it’s the perfect blend of comedy and horror. I always have a great time playing this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely goated game to play with friends.\r\n\r\nEach monster has their own unique traits, and ways to deal with them.\r\nThe start is quite slow, but once it gets going, its a ton of fun. Play it with some good friends, and be sure to record any funny moments.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Completely unfair\nCompletely BS\nCompletely fun\n\nPlay it, and enjoy the feeling of wanting to die",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never thought that I will get a jump scare in this low graphics game.\n\nA good game if you want to spend a fun and scary time with your buddies. Simple gameplay that anyone can learn easily but still difficult to reach your quota. Laugh, scream, blame, run, hide, stay silent, damn! a lot of emotions in this game same time. :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere, the lore, the gameplay, it's all fantastic. I've tried to get into similar games like R.E.P.O, without success. There's something about lethal company that keeps pulling me back, both alone and with people, Every action I do feels critical, there's always something to learn, the monsters are all horrifying and unique, the graphics and performance are all stellar, and there's always something new about this game that I discover that I enjoy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game hoarding bugs are funny and  coil heads",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, please bless us with more updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very difficult and the key remap system doesn't work for me, but overall the game is good and it's fun to play with friends. I met a long term online friend here and it's fun + it encourages teamwork. Some of the monsters are silly and some are really scary, it's a nice mix of horror and comedy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its very fun with friends but gets a bit stale fast solo, unless you have fun trying to speedrun/minmax the game. Slowly being able to learn each unique monsters behaviour and weaknesses is a fun learning curve. Each moon feels unique in their own ways with their layout and enemy spawns or even unique dungeons. Having around 3-4 friends is definitely the way to play the game although 2 is still fine but will be hard for new or inexperienced players. Personally i dont have any major problems with this game as a party game so i recommend it for people looking for a game like that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love going into this game thinking im gonna have the time of my life and not be scared at all. then this shadowy figure sneaks up on you and breaks your neck in half. im now having fun and screaming into my mic to the point where i break the sound barrier. totally recommend for people who like funny moments. also modded is way too much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "must try with friends, but you need prior knowledge about the game before playing it so keep that in mind otherwise it is a fun game to play with friends and grind together.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely,dearly,whole heartedly, doily, gyatly, sigmaly love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Me playing this game: \"Jeez this sure is a Lethal Company\", Evil scary monster: \"Say... that again\" 10/10 would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kinda silly and clanky, but I guess that's the whole point of it. It's also punishingly difficult and the lack of any form of story makes it hard to keep you engaged and return to it. It's ok for its price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hands down the best \"friend-game\" I have played. Every run is just so much fun with or without mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "O ISHAAN N QUER JOGAR LETHAL COMPANY, PQ É MUITO BOM ELE É MUITO MAUZÃO. NÃO QUER SABER DOS AMIGOS E SÓ JOGA SOZINHO PQ LHE DOI OS DENTES",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its so fun its so scery and idk what to say the forcing me pls help",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is groundbreaking. Get some friends together (or find some from a Lethal discord server) and you have hours of entertainment. Get into the mods on Thunderstore - some of them have enough content to turn this into a completely fresh game (shoutouts to Lategame Upgrades for giving money more purpose, a whole heap of new scrap mods for making the game seem personal/silly and fun, and Wesley's Moons for basically inventing a story mode for the game). Just be prepared for some bugs when you go wild with the mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favorites to play with friends\n\nalthough i am a giant scaredy cat so its probably not their favorite to play with me xdddddd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game beyond belief, some of the most important people in my life right now- we bonded thought this game. I crochet characters from this game. For me it never gets old, i love the aesthetic,  i love the subtle story,  environment, the monsters, everything. truly unique, one of a kind game. all the \"clones\" that came after dont even light a match to Lethal Company. I really do love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good fun with friends, this works with small groups or as a party game with mods that expand lobby limit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and simple game. yo friends gonna leave ya hangin sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games with friends! Love the fact the devs are still pumping out updates and love the community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ahhhhhh lethal, a gorgeous mix of 90s/early 2000s computer aesthetics, horror, sheer funniness, and teamwork.\nWhen I started playing, I actually really didnt enjoy it due to how boring I thought it was, but as the updates came out and it became heavily moddable, I realized I enjoyed the mindless collecting and parkour (fuck the pit of death I still suck at it).\nWhile it isnt a masterpiece by any means, it is still one of the most fun games I have ever played. \nZeekers, I hope you manage to continue adding new content, and improving on what already makes it fun!\n8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fun horror game to play with friends or others a bunch of afk people playing stuff in there mic though super annoying we dont wanna hear your beliefs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great yet difficult game, If you are willing to risk your life for loot, or love blowing up friends with Landmines this game is for you... Bonk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun with friends! and I enjoy that its actually scary",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has become one of the most beloved since its launch.\nThe gameplay and overall atmosphere are very engaging. When you get separated from your friends and hear strange noises in the dark, it can really make you feel uneasy.\nBut unfortunately, it gets boring when you play alone.\nThe game is also developing slowly, which is why it is losing popularity. However, this can be understood. As I remember, only one person is working on this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it but the only issue is that there isn't a single player mode like in repo which would make it better if you got no one to play with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and interactive; play with others!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very helpful tip that was found in game!\n\nIf an entity has come in contact with a crew member, please refrain from immediate self-defense. Instead, ask the crew member the following:\n\n1. Is the entity being aggressive?\n2. Are you injured?\n3. Do you need assistance?\n\nIf the answer to all of these questions is yes, you begin your self-defense measures.\n\nIf the crew member is stressed, strike a question like: \"How was your day?\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, love the ennemies. Unfortunatly the level design is pretty dull",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game made by a person who knows how to make games, and, most importantly, likes to make games. possibly the most based dev of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! That flower guy must be a chiropractor because he cracked my neck really well!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Childrens game, would recommend for 10 and under!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lethal Company is one of the best examples of simple design executed brilliantly. It’s chaotic, creepy, hilarious, and perfect for gamers who love cooperative misadventures. A must-play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My friend found two red blinking lights and stared at them. Not even a second later he got crushed by a 10 ton force platform with spikes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing the only problem is it lack updates and the only ones you do get are bug fixes. The community carry this game through mods but either than that It's a game you come back to every so often its can be very scary but also provides funny moments. (Game is better with friends)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Fun with other players, the proximity chat causes for many funny events. Worth every penny!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great co-op game with friends that does get challenging as you progress. Mods do add to the game and make it more enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. If you're looking for a game that is a perfect mix between scary and fun with friends, this is it. Game has always been amazing and I love to play with my cousins. Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love this game. That much more modded. Once you get used to it and dont find it scary anymore, it has this relaxing beautiful feel. Learning to mod this game is also fairly easy and really REALLY fun! :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, great monster designs and lore. \n10/10 with friends or alone.\nGood and skillful developer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love playing this game with friends or scaring myself into a corner solo. Exploring various haunting moons and expand the game with more mods to add to the chaos and spooks...may have summoned a braken in my house now...he's just staring at me- OH! He mad, he big mad!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "watch your mates get ripped limb for limb by a mobile slug with arms or a floating bug because you took a key off it. Mods do add to the experience you can turn mobs into FNAF characters or for some reason Diddy... none the less the game runs amazingly gameplay is phenomenal and gets more fun with more friends you play with.\r\n\r\n100/10 truely a indie masterpiece, Drop a new mob that clones your friends voice and draws you close and jumpscares you and brutally beats you down for being so niave. Then add a new item boxing gloves so you can have a fair 1 on 1 boxing match with it possible call it \"the tysonator\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun \"friendslop\" game. being a corposlave has never been so fun with friends. great mod support with 3rd party software.\r\n10/10tacles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the very fun co-op game that started all of the repo and peak and all that other stuff. Co-op horror at its finest.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Somehow this game keeps getting better and better, having friends to play makes it100x more funnier too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and scary game. Its much better with friends and with mods. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lovely game! Whether you're playing modded, or vanilla, it's super fun! The gameplay is surprisingly basic toward the beginning, and learning how every entity works by coming across them, scanning them (before dying), and reading the bestiary log. The difficulty ramps up after each quota, but the scrap doesn't increase at all, so you gotta really split up with your crew (or just get good solo like me lol). Zeekerss is a great person, and created such an amazing game. The updates he brings are also great, and brings alot of great ideas, even if they aren't pulled off well. Even back when the Kidnapper Fox was still around, the game was still lots of fun! The Fox was a lil unbalanced, but was a great idea! Too bad Zeekers prolly isn't gonna bring him back.\n\nIf it was on a scale of 1-10, I would prolly rate this game a solid 9. It's a shame this game isn't as popular as it was when it went public... It's still in Early Access tho, so I CAN'T WAIT FOR FULL RELEASE!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game to play with friends! Pretty much to explore, lots of reasons to laugh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very goot Very goot, waiting for more updates but mods will do perfect for now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even after all this time out of the spotlight, even with it's flaws (not perfect collisions that may decide life or death), it is still a great horror to play with friends. The fear is not all lost when you with your friends are laughting non-stop (Yeah, it is less frightening, but somehow even these situations can be scary).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, definitely better with friends but can still be enjoyable solo. Really gets my heart pumping sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun if you have friends to play with. \r\n\r\nShame it isn't updated more frequently, but i've had more than 100 hours of fun with it. So I can't really complain. Though, more updates would help keep the game fresh for longer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great co-op experience, be it in a private party or with complete strangers. Some may find it horror, but I'd say that it's more of a psychological thriller due to the tension and the suspense that one may feel not knowing when they'd encounter - and preferably counter - the creatures, and if they'd get spotted by them at an inappropriate time (e.g. carrying a pricey, heavy double-handed item that could help you make the quota while the Thumper starts chasing you and it is close to the end of a working day). Knowledge is power, and depending on the player who understands how the creatures, the loot, the bought products and the maps work, one can have tons of fun or little to no fun with all of that information in mind. Spontaneity lies in the randomized spawning points and time stamps for both the loot and the creatures, and otherwise, it is the same routine of trying to make it out alive while bringing as much loot to the ship as possible. I personally really like routine and don't get bored easily, so I never fell out of love with this game. Make sure to meet high expectations! You wouldn't want to upset the Company... or Jeb for that matter.\r\nModded Lethal Company is pretty fun, as well. I used ThunderStore for client-side mods in my parties with friends.\r\nI personally keep coming back to it as to challenge myself with the solo survival gameplay, to reminisce good ol' times with close friends like the oddballs that we are and to experience the developer's updates on lore and patches. Shout out to Zeekerss, that one Furry game developer that spent time in his dark corner to research and make this entertaining jewel! And on that note, shout out to creative, ingenuous Furries! You're giving us more reasons to be loud 'n' proud!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of strategizing and fun with friends, and the continuous updates help it stay feeling fresh! In my opinion this is the game that has really made the casual co-op genre take off in recent years (Among Us started it, but this focused on higher quality gameplay).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game, more fun if you play with others in my opinion. Can make for some very funny moments, lethal company is very fun if you use Thunderstore to add mods to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a really good game and its really fun with friends or randoms",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was pretty fun during the huge craze over it. i haven't returned to the game recently though D:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I personally love this game, and every aspect of it. I have nothing to complain about. I love the style, the art, and all the monsters. Amazing game to play with your friends. I rate this game 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game! really fun when played with friends and if you ever get bored from the vanila experience there are awesome mod creators out there! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i  play would it is good but when it comes to getting the scrap it is hard\r\n i mean i just spent 10 minutes running from monsters in the cave or whatever survived the worm thing that turn it to whatever that is just to get eaten by a tree monster and then later i get like 110 dollars of stuff and just get struck but it is a really good game just hard you should make a weapon (i have never made it past 3rd moon so idk if it is a thing ngl)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun, once you've gotten used to it, beating everything including friends is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is 2 lethal i work at company and it gets lethal. I am ashamed of my actions i have moved on i will recomend this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice to play with scaredy cat friends! I enjoy it very much and they keep updating the game sometimes. \nIf you like to colect things and run from monsters with your friends, this game is sertenly for you ;)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ABSOLUTE CINIMA\r\nat times when i join any public server, it sometimes crashes, but that mainly goes to my potato pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very great game. Very fun, especially with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I strongly recommend this game to those looking for an exciting game to play with their friends and/or family.   I've seen so much wild stuff in this game, I cannot even begin to describe it.  Lethal Company is one of the most memorable multiplayer games I've ever played.  Top 10, for sure.  Top 5, quite possibly.  Give it a shot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "brilliant. better than Repo or peak or any of the other knock off games like that out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A well known survival loot game, this platform is able to deliver a multitude of fun for up to 4 players as they scramble around various maps to find 'scrap', avoid monsters, and sell them to the entity for profit. Despite being an indie game with laughably low graphics quality (think Minecraft), this platform is able to turn these disadvantages around by advertising itself as a VERY light-weight and rapid-loading game with minimal computer and temperature stresses. \r\n\r\nUp to 4 players are placed on particular 'moon' maps of one's choosing, and all have access to proximity voice and text chat. Clearly distinct and important items are brightly colored to contrast with the surrounding background, and more valuable loot are usually smaller or darker colored in nature. A variety of different monsters all require different strategies for management, adding to the tension, with some being able to more punish solo players than others. Tools become paramount in managing one's playthrough and can be picked up from dead players to prevent permanent loss. All of these aspects combine together as players eagerly or terrifyingly shout at their teammates for instructions or assistance as they strive to gather enough scrap and survive their moon maps. \r\n\r\nAs mentioned earlier, graphics are ridiculously low quality, but it is clear that the game was deliberately designed as such. Still however, this may prove unattractive to some players who seek visual beauty and details. As players progress through more and more moons and scrap selling, they will eventually hit near impossible scrap goals, guarenteeing their inevitable game-over and restart, which may prove discouraging to some. Having a mic is almost a requirement, as most hosts often kick players who do not have any. The learning curve is quite sharp, as this game provides minimal hand holding and instead kicks their baby chick players out of the nest to die and learn anew. \r\n\r\nAt the end of the day, this light-weight and computer friendly game provides an easy-to-pick up platformer with simple and straightforward goals. Even the most veteran players remain vulnerable to death, as the focus revolves not around combat, but survival and looting. Highly recommend with friends with mics, and for its relatively low price and computer stress, this game is a must-try for even the most casual players.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "zeekerss leaves the game in a odd spot to work on a mediocre text game, if this game had constant updates it would change the industry",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "I will try to be very objective in this review. This game has brought me many hours of fun and enjoyment with my friends. However, I can’t turn a blind eye to the current state of things. The game, as it stands right now, is very lacking—no significant updates, extremely basic “changes,” and a complete lack of effort to keep players engaged. Sadly, it seems to be heading down the same path as many other indie games. What I mean by that is it appears to be stuck in Early Access hell forever.\n\nIt wouldn’t really be an issue if the game were free-to-play or sold as a complete product. My biggest gripe with all of this is that this is no longer a small project. The game has sold well and even had a collaboration with Epic Games. The means were there to continue developing the project and not leave players in the dark for so long. However, the predictable choice was to almost fully abandon the game and focus on other things while the game you paid for rots in Early Access limbo.\n\nIn conclusion, as of right now, I cannot recommend the game unless it somehow gets back on track.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I love this game, but it is by no means worth getting into these days. It's a coding nightmare with frustrating bugs at every corner and seemingly no desire to patch them from the lonesome creator. In fact, there's a whole remap button feature that just straight up does not work (my last straw), you input the new buttons and confirm the changes - just for the buttons to work just as before and for the game to forget even that you tried to change the controls at all as soon as you restart.\n\nIf you want to play a fun, well moderated, multiplayer, horror looter - play REPO which has been getting better and cleaner with every update.\n\nNot this, a game that pulls in thousands of dollars just to receive the occasional bloat of nonsense mechanics and one off creatures instead of anything to fix or even fundamentally improve the game.\n\n\n\nStill a 3/5 though I love this game man.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game reminds me of the novel Shogun, by James Clavell, particularly the part where Blackthorne doesn't know how to find Japan (it's not that hard) but finds it anyway by crashing like an idiot.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game has the potential to be fun if only the lobbys actually worked on a reliable basis. how can you have fun on a game if 7/10 times you try to join a lobby and it says theres an error. this game simultaneously is awesome and sucks at the same time.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "good game but too many toxic ans sweaty players. game nowadays is filled with salties that will kick you if you dont have mic or you end up with a map with not much loot. alot of speed runners and wanna be streamers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Seems like the developer forgot to add fun to the gameplay loop. All you do is land, try (and fail) to find any loot, then get instakilled by an unseen assailant.\nNo tutorial, no beastiary, no guides on how to kill, find, or maneuver around anything, and blurry graphics.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My game is lagging, I can barely see with the graphics, and it is very hard to join a game with friends when it continues to give audio problems.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games slowly dying if you dont own a michrophone then your out of luck with communicating as well as other things was it worth now? no no ones really playing right now so things could change but i recemmend playing REPO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seems like the developer forgot to add fun to the gameplay loop. All you do is land, try (and fail) to find any loot, then get instakilled by an unseen assailant.\nNo tutorial, no beastiary, no guides on how to kill, find, or maneuver around anything, and blurry graphics.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EXTREME performance issues somehow, i can run ELDERN RING BUT NOT THIS slop, so much rubberbanding. How in the hell can i run The Finals with less rubberbanding and lagging issues than this game?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sadly, not much updates and the game feels the same as it did last year. REPO and other games have surpassed this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "See the fun aspect of the game, but the game is kinda shit",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "MY FRIEND really likes this GAME but hes also a small fat 3,9 cheeto dust fuck ass and now i hate this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was good for the initial years.\nNow it's rubbish\nRubbish game with crappy coding.\nI join a game and minutes later, it stops working and all progress is lost.\nThis game and dev sucks.\nMoney consumed them.\nVery stinky. -12/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Had a ton of promise, but fell by the wayside. Shame. It's quite cheap but I just can't recommend it because everything leads to nothing. Not that every game has to 'have an end' nor should every game not be a death march, but this is stupid. And the game you play in between isn't fun enough to merit it. It's a great idea, just overall didn't have enough behind it to be worth it I feel. Shame to have to keep waiting for a decent game to come around that isn't some fotm trash early access. I really need to stick to my guns and stop buying EA crap.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "My game is lagging, I can barely see with the graphics, and it is very hard to join a game with friends when it continues to give audio problems.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game gets pretty boring, and its impossible to progress unless you have super serious tryhards, WHICH THAT IS NEVER FUN IF UR PLAYING WITH FRIENDS!!! basically a goof around and watch your friends die game. but not a ACTUAL game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like this game and everything but the most stupid thing ever happened with me is I changed my name and it deleted my save... I had like 8k quota.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This video game is more of a game that you would see in roblox. If it were free I would recommend it but a whole 10 euros for a game that is very boring and not even scary. It is very, very repatetive game without a room for creativity. 2/10 but would be a 5/10 if free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Too scary and difficult. Grinder-friendly. Needs mods to be playable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played a lot of this game. When it was huge, this game ruled. Not to be a dick to the dev, but he needs to just let this one go unless he intends to actually do stuff with it. The gameplay loop is good, the premise is good, the areas are interesting and the monsters are fun. after a few hours however it gets old, and the dev updates once every three to six months and those updates are not substantial. This game has unfortunately died. if you have friends who have it and you don't have it try to convince them to get R.E.P.O. instead. This feels like a waste of potential and money now.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game breaking bug ?? Where, once the game hits some weird Unity crash, it will never launch again. I have wiped literally every shred of this game off my PC, all mods, all files, everything. \n\nI was playing perfectly fine a week ago. Now my game refuses to ever launch on my PC.\n\nThis is a recurring problem for so many people and absolutely none of them got a fix or answer and it's slowly taking the playerbase down and will continue to do so. \nI love this game. I really do. But if it's refusing to let me play ever again, then I have to give it a negative review.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not fun, its too hard and doesnt tell u what to do so your running around and collecting little, whle you dont know how to sell",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shittest game, just steals 400 credits worth of shit. whats the point. fuck off company",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game really isnt much if you dont have other people to play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know how this game got so many positive reviews, probably from youtubers playing it, but I don't like this game. I thought it would be fun, went into it with a few different people I know, and it is a game I regret buying. I regret buying most games that are \"Early access\" (indefinite beta stage). Just don't fucking \"release\" your game if it isn't done. Why are people (yes, even I am a victim) still falling for \"Early access\" shovelware crap? It's insane how over 400,000 reviews leaves it with a 97% positive when it's just not good or fun in the slightest.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like watching videos of people playing, but I feel like when I play I just get lost or die and hardly bring anything back",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Two meatheads made me buy this game just for them to never get it themselves. IT'S BEEN TWO YEARSSS.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THERES A PIT IN DINE YOU CAN FALL IN AND BE TRAPPED AND THE HANDY UPDATE IS BULLSHIT EVERYTHING ELSE ABOUT THE GAME IS GOOD BUT THIS IS SILLY",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was too good of a game, got addicted, and my wife left me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "for some reason  every lobby  is either \"tell me something interesting\" or \"ask  me something\" or some other dumb  roleplaying  shit. idk what happened, this game  used  to be fun but seems like all the adequate players stopped getting  on  and now   you just  have degens and  kids and degen  kids and roleplayers and furries  idk go play some fking  vrchat lmao",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pure friendslop. thankfully i was gifted this so i didn't waste any money on it. don't buy this, or repo or peak or whatever, none of your friends will be playing this in a month or two, it's not worth it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is a COPY of content warning but even more BORING dev i think you should give the game to aggrocrab and add a braken to PEAK",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no update? come on, your game is 'Early Access Game'. PLEASE UPDATE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is badass af! we are charlie kirk RIP to the kirkinator.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I picked this up when it was all hype back in 2023 and it just didn't do it for me, I wasn't a fan of the art style and I never felt like I was in space or some sort of moon so I refunded. I love the idea of a helmet overlay like in Republic Commando or even Halo 4 even. I picked it up recently to see if I could get into it but unfortunately there's no 32:9 support without mods, I joined one random server as I don't have anyone to play it with atm and it was just someone preaching religion. I'd rather just refund it again. Maybe if my girlfriend picks it up and I'll get it on a discount but not on my own.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Download the game to play for 120 minutes and never played again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "games slowly dying if you dont own a michrophone then your out of luck with communicating as well as other things was it worth now? no no ones really playing right now so things could change but i recemmend playing REPO",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't change keybinds since last update 2 months ago. Plenty of time to fix a critical bug. Yet another great game ruined by lack of bug fixing. Please stop trying to solo dev.\r\n\r\nHighly recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I fell for all the hype on socials and bought this. None of my friends fell for it so it’s not very fun playing with randos",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks now and days. Lethal Company used to be fun but the lack of content and major updates make it just stale. If your looking for horror games to play with your friends get R.E.P.O or Phasmaphobia. I hope the game get's updated and becomes fun again but in till then don't buy.\n\nQuick note: This game was launched in 2023 and is still in early access. The last update that was important was version 60 which was added in AUG 17 2024. the rest are QoL updates and bug fixes not much new content.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i really enjoyed this game until it just made my screen go white and freeze as far as i know there is no way to fix this and this has been an issue since i got into 10 hours of the game you can sell your likeness to epic games for a skin but yet cant fix ur own damn game such s shame this had so much potential to be something great.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you need mods to make your game even remotely enjoyable then it's probably not a good game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant play with friends because of errors",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "would rather stare at a clock with my friends than play this with my friends",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Did not have a fun time, and I was excited to play this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is not that good how it gets showd on youtube",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "longest fcking cutscene i saw  in my whole life",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THE GAME KEEPS CRASHING! DO SOMETHING WITH YOUR UPDATES YOU USELESS DEVS!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "buggy and scary",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Friend Slop.\nStarted a terrible trend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this company is lethal. game is pretty mid tho",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Beyler oyun 1/10 hiç sarmadı",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute dogshit slop your friends made you buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There's nothing to do in this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A hoarding bug stole my children from me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Walking sim that likes to kill you",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "springtrap is annoying",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "total tits game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass cheeks game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Rubbish game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bad game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dumbass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lost its charm",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "overrated flavor of the month slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tung tung tung sahur",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Network laggy mess also hard to figure out",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I DIDN'T KNOW ABOUT THE F***ING BEES",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "... boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "your ERROR = HERROR  :(",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "sucks as$",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "improve spectating",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "nothing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "butt",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "scawy :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ts ahh asf",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "zeekerss leaves the game in a odd spot to work on a mediocre text game, if this game had constant updates it would change the industry",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Was pretty fun at first until I realized the gameplay loop is pretty boring and that the dev's philosophy at game mechanics is a letdown. Boilerplate guardrails that only serve to punish players for thinking outside the box exist. One of them is dropping baby maneaters in a death pit makes it teleport to the interior entrance and instantly aggro it to all players. It's already invulnerable regardless, so it would've been cool if it was the only monster that could be killed without involving a melee. Meanwhile, glitches that hinder players like loot spawning in walls or being dropped through world geometry don't get patched which almost feels purposeful. Sure it's funny at first, but it gets old. Lots of wasted potential.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Honestly it was a fun game but the developer kind of ditched the game after they made their money and unfortunately I don’t think this game is ever coming out of early development",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "The V73 update broke the game for one of my friends: I bought the game with him to be able to play toghether with some of our other friends and this problem just kinda killed the vibe. We looked around for a fix but we haven't found anything about it so I feel sorta obligated to leave a negative review. I'm not gonna go into the negatives of the game (like saves corrupting every other update, or the sometimes BS balancing) because there's probably many other people who did. I'll rescind this review IF this problem gets fixed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Enter a never-ending cycle of death as you struggle against the janky controls only to realise each planet has the same monsters and meagre selection of collectibles.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Random \"minor security\" update.  completely destroyed mods, and introduces memory leaks in both ram and vram. ggs mods carried this game now its worthless.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This guy HATES to update his game, He DESPISES having a successful game",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "This game reminds me of the novel Shogun, by James Clavell, particularly the part where Blackthorne doesn't know how to find Japan (it's not that hard) but finds it anyway by crashing like an idiot.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The other players that join public lobbies often cheat in ways that make it impossible to continue with saves. The Terminal will be placed outside the ship or players will no-clip through the map to loot and prank. Most of the time the people that join spew racist and inflammatory remarks at a constant rate using voice chat soundboards or say these things themselves. They leave when the game is launched which means you only end up with one or two players instead of a full crew. This could be ameliorated by allowing people to join in orbit. I did not have a good experience playing this. If you have close friends and want to play a party game in a private lobby this is a good experience. \r\n\r\nThe game does have some other issues. It won't run on SteamOS and by extension linux and the games content has not seen a significant update in over a year. I would have expected a new map or item by now. Most of the new content that players are excited about comes from the modding community.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Fun, but updates take a long time, and don't add enough to make it replay-able more than 2 or 3 runs on each moon, the game kinda needs mods to be super fun, will change my review when vanilla becomes fun enough without mods\n\n$10 is fair, but wait for literally ANY sale if you're comfy with waiting \n\nIMO game is 6.5/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I will try to be very objective in this review. This game has brought me many hours of fun and enjoyment with my friends. However, I can’t turn a blind eye to the current state of things. The game, as it stands right now, is very lacking—no significant updates, extremely basic “changes,” and a complete lack of effort to keep players engaged. Sadly, it seems to be heading down the same path as many other indie games. What I mean by that is it appears to be stuck in Early Access hell forever.\n\nIt wouldn’t really be an issue if the game were free-to-play or sold as a complete product. My biggest gripe with all of this is that this is no longer a small project. The game has sold well and even had a collaboration with Epic Games. The means were there to continue developing the project and not leave players in the dark for so long. However, the predictable choice was to almost fully abandon the game and focus on other things while the game you paid for rots in Early Access limbo.\n\nIn conclusion, as of right now, I cannot recommend the game unless it somehow gets back on track.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "good game but too many toxic ans sweaty players. game nowadays is filled with salties that will kick you if you dont have mic or you end up with a map with not much loot. alot of speed runners and wanna be streamers.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game has the potential to be fun if only the lobbys actually worked on a reliable basis. how can you have fun on a game if 7/10 times you try to join a lobby and it says theres an error. this game simultaneously is awesome and sucks at the same time.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is quite the solid friendslop. I played this game for about 26.7 hours. I probably would've played for none if I had taste. 4/10",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "How can you sell an early access game as a solo developer literarly doing 10s of millions of dollars and then not even try to seriously finish your game. Its one thing when its evil corporation but to think a solo developer uses such scummy tactics after making such a bank is beyond me... Actually sad",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "An expired flavour-of-the-month game.\n\nThe basic graphics work because (like the DOS games) I think it leaves something to the imagination. The important thing was the small file size, allowing you to quickly download it and jump into a session with friends.\n\nThe gameplay feels chaotic though - you can get lost, and lose communication with teammates, and get killed instantly when you go through a door. The flashlight (if you even have one) only works for about a minute, which is frustrating when so much of the environment is pitch black, while other games handle lighting systems better (Aliens Vs Predator 2000, Half-Life). The lack of Workshop support is awkward, as mods could probably add value to the gameplay.\n\nI can't take it too seriously - it's the kind of game to have a laugh with friends, but does anyone still play it? I've had fun with it, but when I tried it in 2025, I only managed to get into one lobby, but the host seemed to be kicking everyone. At £8.50 it's more expensive than Garry's Mod, and certainly offers less value than Gmod as a place to goof around.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I love this game, but it is by no means worth getting into these days. It's a coding nightmare with frustrating bugs at every corner and seemingly no desire to patch them from the lonesome creator. In fact, there's a whole remap button feature that just straight up does not work (my last straw), you input the new buttons and confirm the changes - just for the buttons to work just as before and for the game to forget even that you tried to change the controls at all as soon as you restart.\n\nIf you want to play a fun, well moderated, multiplayer, horror looter - play REPO which has been getting better and cleaner with every update.\n\nNot this, a game that pulls in thousands of dollars just to receive the occasional bloat of nonsense mechanics and one off creatures instead of anything to fix or even fundamentally improve the game.\n\n\n\nStill a 3/5 though I love this game man.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stupid fucking game for masochists. Just because some people like getting their testicles stomped on doesn't make it fun for people who like to separate games from chores.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}