{
  "positive": [
    {
      "review": "If you liked the first Octopath Traveler, this one takes everything great about it and cranks it up even higher. The world, characters, music, and variety somehow all got better. It’s honestly crazy how much they improved something that was already amazing.\n\nThe new addition that really stood out to me is being able to get a boat through the merchant character. You can actually sail between the two big continents and even find hidden islands scattered across the ocean. It makes exploring feel fresh and exciting again.\n\nThe combat and storylines are just as strong, if not stronger, and the endgame content is no joke. The final boss might be one of the hardest fights I’ve ever done in a JRPG—and beating it felt awesome.\n\nEverything about this game shows how much effort the devs put into it. If you loved the first one, you’ll love this even more.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This was an absolutely incredible journey, The ending had me tugging at my heart strings and almost had me crying LOL. If you have the funds to play this game, this is A MUST PLAY!!! I don't usually leave reviews but I think this game deserves one. This is by far the greatest video game I've ever played. I can't recommended this enough.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "genuinely one of the best stories i've ever experienced in a game, and 8 of them at that! well except for the dancer, her story kinda sucked ass ngl.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Octopath Traveler 2 is a game that knows what it is, for better or worse.\r\n\r\nThe art style is the real winner here: nostalgic without being lazy and very reminiscent of FF6 for me. The music is excellent, which helps, because you’ll spend a lot of time listening to it while wandering through the game’s oddly disjointed world. Fantasy Mongolia? Fantasy Wild West? Sure, why not. It’s not seamless, but it’s charming in its own way.\r\n\r\nEight hours in, I’ve got four characters, all from the eastern continent, and their chapter 1s wrapped up. Some stories are pretty standard fantasy fare, but only one of those four origin stories has really piqued my interest so far. The disjointed narratives don’t bother me much: if anything, the idea of eight strangers crossing paths adds to the adventure vibe. That said, a few of these arcs could use a little more depth.\r\n\r\nThe turn-based combat is solid, with the weakness/break system an interesting addition. The Boost system takes a second to click, but once it does, battles feel tactical instead of tedious. The job system seems like it’s got potential, but I’ve barely touched it beyond the starter roles.\r\n\r\nThe Path Actions are a mixed bag. Hiring and 'enticing' NPCs to fight alongside you in a limited capacity (with bonus passive effects) are clever touches, but information gathering and bribing NPCs mostly just reveals low-tier loot or some lore, so far. Limiting the 'learned skills' capacity to 5 seems for one particular character seems a little restrictive, but maybe that changes. Still, the lack of hand-holding is refreshing, even if some of the character motivations feel a little underdeveloped.\r\n\r\nAll in all, it’s a great JRPG with room to grow. The combat and presentation are strong, but the story and world design are, 8 hours in, a little lacking. If the second halves of these character arcs deliver, this could be something special. If not? Well, it’s still pretty to look at and fun to play.\r\n\r\nEarly Verdict: 8/10—worth playing, but not without its quirks.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I loved playing this game from beginning to end.\nYou grow attached to every single character as they develop and come together as a party.\nThe ability to combine classes however you like is a fantastic feature, giving you plenty of room to experiment and create the combos you enjoy most.\nThe story is captivating, with lots to explore and rewarding discoveries to uncover.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After 73 hours and still haven't finished the game, I definitely recommend this game. ^^ If you like a good JRPG, this is it. Great characters and an interesting story. \r\n\r\n10/10 for me. ^^",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Was honestly kinda hesitant since this would be my first time playing a JRPG like this, but I really enjoyed. I initially only got it for the art style, but the gameplay/combat and sound track are so good. Would definitely recommend to anyone trying to get into the genre",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is such a hidden gem! The story for each individual character (even NPCS!) , the art, the visuals, the MUSIC; It's all so wonderful, I look at things related to it or listen to its soundtrack even when I'm not playing, I hope to see more people talking about it in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun adventure game and is great on ultrawide.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I do like it and recommend it, but I think it's too long. There's like 40+ chapters.  I'm more than 30 hours in, and I still see 9 tales on my world map, it's a bit discouraging.\n\nAlso, this game does not really reward grinding. Random encounters can get pretty long, and you are rewarded with little money and little experience. Everything is expensive in this game. \n\nI love grinding in J-rpgs, I think grinding is part of the experience, but in this case, the time invested to reward ratio is just not interesting. I ended up using a mod for the money because I don't have the patience to deal with this.\n\nOverall I do like the game, the stories are interesting. The battle system is very good and the graphics are amazing. It's just a bit too long in my opinion.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Better than Octopath 1, which was already very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite turn based game, the previous one being the first game. It improves a lot on the first game while keeping the charm of traveling with a group of 8 people alive. Good characters and story and satisfying combat. The paths of each traveler are thankfully more connected in this game as opposed to the last. This is my second play-through of the game (the first time being on the switch) and I still love this game to bits. A high recomendation from me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story, kinda ass\nvisuals, very nice\ncombat, very fun\n\nif itching for a turned based JRPG that isnt FF (yes i know this is still published by square) this satisfies that need. get it while on sale (like now!). Great on steam deck as well at low/medium settings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I sat down one day and I was like damn, this game looks pretty fun.\n\nIt's the GOAT. I can't imagine having never played this game. \n\nPartitio's theme plays every time I'm finishing up cardio at the gym and it turns me into a fucking monster.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the first and second game now and neither disapointed. Love the stories and the combat is top tier. Recommend for anyone who loves turn based",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's great at scratching the old fashion RPG turn base style itch\n\nno seriously it's fun, the story of each individual character is good, and what's even better you got Zoro in your team",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really fun, feels like everything great about Octopath 1, but cranked up a notch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gotta give it to JRPGs.\nThey make life so simple.\n\nThere is always a bad guy that is actually causing all the harm.\nWanna improve the world?\nBeat up a terrible person.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a superb turn-based JRPG and an amazing leap forward from the first Octopath game. Experience eight different storylines for each of your party members, and the plot then culminates with a cool final boss battle. The music and graphics are gorgeous and a throwback to the best of the 16-bit generation RPGs. I had absolutely no glitches or crashes and the game was rock solid all the way through. I found the difficulty pretty easy until the final boss and secret extra boss, which were both quite challenging. My overall playtime was about 60 hours for the main story and about 77 hours for 100% completion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5/5. I don’t normally leave reviews, but I felt compelled to do it for Octopath II because of how incredible my experience was playing it. For the record, playing it on the steam deck (which is flawless). Spoiler free.\n\nGood:\n- The game is very beautiful. I mean this in every way. The graphics are gorgeous and immersive, although I am sure I have a little nostalgia goggles by comparing it to JRPGS in 2000s. I especially liked the Crestlands (mountain autumn vibe). The writing is good, albeit a bit uneven throughout the game and there are a few moments that stick out to me even when not playing. And the music is truly incredible, on the level of Skyrim or morrowind. The haunting and eerily beautiful nighttime music especially stands out.\n- There are numerous little details in the graphics, the writing, and even the music that go towards the theme of the “Dawn” and other themes. The details really sell the the world and make the game stand out. I wish all games were treated the same. For example, little side quests that re completely optimal will tie back to the main story in a way that is touching and beautiful.\n- Characters. The main characters are likeable and sympathetic. It’s easy to sit in their shoes and get drawn into the story. I love the banter between party (wish there was more) and each characters story. You will naturally favor some over the others (I like Temenos and throne the most). Even voice acting is good.\n- Immersive world. I liked how you naturally learned about the world through the cutscenes and little details and chats with NPCs. I hated that there are minimal books or things that flesh out the world (like I have no clue even after 70 hours if the eastern continent is united or not). World generally made sense and world-building was consistent throughout. Lots of interesting side quests and content as you progress.\n- Hard to articulate, but it’s very smooth and easy to pick up and play for 15 minutes at a time (or longer for that matter). Very friendly for gamers like me that are constantly moving and doing things.\n- Very good value. It’s a long game and it actually keeps you sucked in. I paid $23.99 and anticipate playing for about 100 hours.\nOkay:\n- Combat is fun and immersive but it can get a little repetitive after a while. The main theme is creativity and combos. I liked the creativity of having multiple classes and the combos between characters and their latent abilities and ultimate powers. It’s immensely satisfying to experiment and find things that work. But it can be annoying to have to try to calculate every possible combo. I found myself skipping a lot of battles after like 40 hours.\nBad:\n- Uneven. Some plots felt a little rushed at times or simply didnt really speak to me as much as others. No plot was bad, but some chapters could probably be categorized as filler. \n- Little things broke some of the immersion. Like, you will never see other stuff party members during a cutscene in the main story for each character, let alone hear theme chime in. You will never hear your main character talk in side quests. I think these were probably compromises in development but they stick out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got hooked up the moment I opened the game. I loved the first game already and this one is even better. A few new things that just make the whole gaming experience way more interesting. I had good timing on buying it with other games in sale back then, but its definitily worth the full price aswell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally be able to review this game after 100%ed it. There's a lot of content to be explored, and many QoL updates that feels better than OT 1. 9/10 i should say, the story is just meh/standard, nothing too crazy, but everything else is a chef kiss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing sequel! Indeed! It is an amazing game that you should try and is worth the price.\r\n\r\nIt improves everything it can from Octopath Traveler 1 but the difficulty, because of how bigger this game is you might end up overleveled easy. \r\n\r\nThe music is incredible and even better than OT1 which had an amazing music!\r\n\r\nThe characters have really interesting stories! Temenos and Castti are my favorites so far.\r\n\r\nThe game loop is fun, the animations and art is really pretty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visually the game is a 100/10 if you love classic turn-based rpg. The 3D/2D environments takes that nostalgic feeling to a whole nother level.\r\nGameplay is an 8/10 experience for me. It's just too much monster encounter for my liking. It's not \"random monster encounters\" but i feel like it's a set monster encounter after you have moved a specific distance. It's annoying at the early levels. You can increase this distance with a support skill but it is still annoying.\r\nStory element is a 9/10. I cannot give it a full 10 because there are no interactions between the story of each traveler. When you start a story chapter for a traveler, the game pretends like your other companions dont exist.\r\nBut overall the game is a must play and I recommend it to everyone but especially to those 1who loves turn-based rpg.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love every bit of the games and the character story, I love, I cried and I even smiled. I still have a lot of finish tho because i wanna 100% this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Might be too premature for a review, but holy shii I just love it so much, incredibly faithful to the original with amazing new touches, soundtrack amazing as always. HOLY SHII\n\n\nHOLYY HIKARIIIIIII",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A beautiful sprawling RPG.  Takes the best elements from classic games like Final Fantasy VI (or III in the U.S.) and makes lots of modern improvements.  Wonderful nostalgic while bringing a lot of new additions. Give the demo a try if you haven't played this great game yet.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I first got Octopath Traveler II on PS5, and I liked it so much that I bought it again on Steam. It’s a beautiful game with an okay story and a really fun battle system. You can easily get around 20 to 40 hours of enjoyment out of it. There’s a bit of grinding, but nothing too crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "NPC BULLYING SIMULATOR! LOVE IT!\n\n1) PHASE 1 : Hit NPCs\n2) PHASE 2 : ?\n3) PHASE 3 : PROFIT!\n\nOh yeah, and there are quests too.\n\nStill, don't bother buying it full price, it's a lot of copy/paste areas, not so interesting story... and made by Square Enix, I bet there are better pixel-art J-RPG cheaper and better than those. Shame to SE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible jrpg, I really had a blast, despites many flaws.\r\nThe game has rewarding gameplay, great bosses, some great moments, and incredible modern 2d looking 3d. The music goes really hard and in the end the journey, though made up of disjointed sotries, was meaningful and had great moments. \r\n\r\nThis is story driven, not party driven, don't expect too much party chemistry like I did at first. \r\nOnce you're past this fact, and accept the game for what it is: 8 disjointed stories that mesh together in the final moments of the game, this is a really great game.\r\n\r\nThe free form nature of the game has its downsides and sometimes you can easily be under-leveled. I still think random encounters drag the sense of discovery down and would have liked at least more control over random battles rates on how to level up quickly.\r\n\r\nThe stories are all great let alone one or two that are kinda whatever. The devs visibly tried to include some party interactions but despite the good effort, yes it may be better than Octo 1 in that regard, but it's still lacking a great deal. In the end, your characters have NO reason to stick together, the banter feels off, since they barely speak to each other in the 1st place, the story sequences only feature the protag alone, the encounters are just \"well you seem nice I think I'll join you\" and then radio silence for 20h. \r\n\r\nDespite all that, I thouroughly enjoyed my time with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome sauce graphics fire music and scrummy combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No man, woman, child, or any combination of such has ever procured such a beautiful, tear jerking, perfect story. Let alone 8 of them,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stealing from children is fun and rewarding",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A game about traveling fisherman and his fear of octopi",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Art, and a thrilling battle system.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A beautiful game with an amazing rich story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like RPGs and retro you will like this game.,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like the first one, this one follows it's tracks well, making for an amazing sequel!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good music",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best JRPGs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "beautiful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's great. Buy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yep its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun if you like JRPGs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "actually sick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "kinda peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not bad",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "12/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredible x8",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ":)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What a masterpiece !\n\nOctopath Traveler 2 is not a lazy sequel, it improves almost every aspect of OCT1, while still being different enough to keep the first game interesting.\nDon't let the old school art fools you ! The J-RPG turn based combat system is modernized.\nThe gameplay has new mechanics, and all the classes have been rebalanced and fixed on many aspects.\nCrazy synergies are back.\nCharacters are a lot more flexible in battle, than they were in OCT1, but the first game keeps its charm and uniqueness in that regard, and is easier to understand (OCT2 is a bit complexified).\n\nThe 2D graphics are smoother and a bit less pixel art, there are now 3D effects and other visual ones like blur, which makes the game pretty, but not to everyone's taste.\nIt's different enough to enjoy OCT1 and OCT2 graphics diffently.\nThe musics are truly incredible, and the story still very touching.\nThe concept is still the same: you still have the freedom to go where you want and do the quests in the order you wish.\n\nThere is only one thing that disappoints: the challenge.\nOCT2 is a lot easier than OCT1, so I really advice to play a low lvl run, avoiding too many random fights and exp grinding.\nDon't pay attention to the quest level requirements, they are very over-exagerated, I was 20 levels lower than those most of the time and still doing fine !\nDespite all the qualities this game has, I enjoyed OCT1 more as it was harder, on top of being a complete new discovery.\n(But there are hard difficulty mods available, although I haven't tested them).\n\nBoth games are excellent and different enough to be complementary, I highly recommand to play OCT1 first as it is also less complicated gameplay wise.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "You've seen who it's made by. You've seen the big boy reviews. I promise you this game will not dissapoint you, if you're even slightly interested or intrigued by the JRPG genre, and I genuinely cannot praise this game enough.\n\nFor starters. It's Square Enix, and this is the 2nd game in the series. Besides the gorgeous graphics, the amazing gameplay, and the wonderful soundtrack, they've pretty much polished up every aspect of the game and made it better in every way compared to the first installment. (this isn't to say the first game is awful, it really isn't and you should definitely play it if you enjoyed this one)\nThe only thing that could deter people would either be the random enemy encounters (which is why I mentioned you should be a bit intrigued by the JRPG genre) or how the story pacing goes. Each character has a set number of chapters, each chapter is \"locked\" behind a specific level requirement. You COULD go underleveled, but it will be harder to beat the aforementioned chapter. So you might end up in a situation where you'd do the 2nd chapter of every character in your party, instead of doing all X chapters of a specific characters, and progressing their full story all at once. This way of storytelling has it's own charm, so don't feel too worried about it.\n\nIn-between chapters, you'll mostly find yourself doing either side quests, or wandering around enemy areas to level up your party. Besides that, what you should do is explore the map. There are hidden chests around every part of the map, and some contain strong/unique equipment that could easily mitigate the underleveled issue. Gear is really strong, so if you're bored, you should definitely explore the open-world and do side quests. If you aren't the exploring type, for the most part shop equipment will suffice assuming you're properly leveled.\n\nThe characters system is what makes Octopath stand out, as you're given the choice to pick between 8 travelers, each with their respective skill-set and role. Don't spend too much time worrying about who you choose, you'll end up recruiting all of them at one point. Parties are made of 4 characters, so depending on how you decide to level up your characters, you might end up having to level up 2 separate parties from the ground up. Alternatively, just keep 2 overleveled characters, and swap 2 underleveled characters, and level them up like that. It's up to you. While the characters themselves don't interact a lot between each other in their respective main stories, they have a lot of side banter that happens during a character's specific chapter. Say.. the Warrior experiences a scary moment in his chapter, and one of the party members offers to help during the \"banter dialogue\". Besides that, a few side stories exist where 2 characters end up working with each other, and during the final chapter of the game you'll see them all together in the story.\n\nThe soundtrack is 10/10, nothing to comment here.\nThe story might be a bit confusing at times, or have obvious plot twists, but overall I'd say it's a 9/10. Every character has a refreshing story that is different compared to everyone else's.\nThe HD-2D graphics is something that started with the Octopath series, but has been expanded upon by now in other games. Still extremely gorgeous.\nThe voice acting for this game has a few small hiccups sometimes, and you will notice it especially on a specific side character, but overall it's great, and they've worked with pretty big names this time around. You might definitely recognize some of them.\n\nThe combat is more complicated than it might seem at first. Enemies have different weaknesses. Find the weakness, keep hitting them with what they're weak against, and you'll end up stunning them. While simple on paper, every character has a different role, and a different type of \"action\" in combat. The Apothecary is able to make concoctions using items found in shops or while exploring. The Merchant can't do that, but the Merchant can summon NPC's from around the map, each with their own skills. So on and so forth.\nSide note for the tryhards out there, Square Enix has the tendency to hide final, optional boss fights that legit just feel unfair to play against. Have fun.\n\nThe open-world map is pretty big. You have a lot of terrain to cover and explore, and there are countless places you should/have to visit, either they be cities, caves, hidden entrances to whatever shenanigans the devs were thinking in that moment, etc. Every part of the map is part of a \"region\", and every region is different from each other. Deserts, actual Cities (not small towns), jungles, mountains, and many more.\n\nOverall, the story is 9/10, soundtrack 10/10, graphics 10/10, quality-of-life 8/10, gameplay/combat 10/10. Play the game, it IS worth every cent.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Octopath Traveler II is a JRPG masterpiece that should not be missed by anyone who considers themselves a fan of JRPGs. \n\nThe 10/10 soundtrack alone makes this game worth playing. There are many modern quality-of-life features that alleviate annoyances in older JRPG's. The boss difficulty is on the higher side and the game features what I consider the most challenging and enjoyable superboss I’ve ever encountered in the genre, even tougher than Penance from FFX or any of the superbosses from Etrian Odyssey.\n\nThe pacing is quite unique as you’re constantly switching between the stories of different characters instead of following a single main story.\nWhile this approach makes for a less emotionally impactful narrative overall, it keeps the gameplay fresh and varied since there’s always another character chapter available, and it’s easy to enjoy the game in short bursts (like spending 30 minutes to quickly finish another chapter). The open-world nature is also a standout feature in this regard since it allows you to explore the world freely and choose the next story chapter freely (as long as your party is leveled enough for it).\n\nVisually, the game also stands out. The unique and beautiful HD-2D art style is complemented with vibrant colorful lighting in the overworld and flashy animations in battle. Especially on the OLED Steam Deck, which I used for most of my playthrough, the colors really pop and the game ran flawlessly on it too.\n\nIf you’re a fan of particularly great soundtracks, enjoy challenging boss fights, and are looking for something fresh in the JRPG genre, then buying this game is a no-brainer.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "On a real, if the game goes on sale for anything <$40, buy it. The sound, art, voice and story design are phenomenal. Wouldn't even be wrong to call it a tragedy for anyone to miss this experience",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "I recommend starting as Osvald since he has a passive that reduces the amount of random encounters. I honestly can't imagine playing this game without it. Now onto the review\n\nProbably one of the most pleasant looking games have ever played. Every location feels like a painting that's alive. While playing I literally wished I could jump through my monitor and just live in that world. \n\nThe music is also just fantastic, almost as good as chrono trigger which has the best ost in any game I've played, so that's saying a lot. \n\nGreat stories as well but for some people the pacing might be a bit too slow. Some of the stories are also a lot more light hearted than others but it's a nice break from some otherwise pretty dark themes.\n\nOnly downside of the game is the difficulty spikes but that might be more of a personal problem of mine, rather than the game's. I wanted to play this game because of the visuals, story and music, not that much because of the combat. I'm not good at turn based games at all so that's also probably why I found it difficult. Normal enemies are pretty easy to kill but the bosses are A LOT harder. The final final boss is ridiculous imo and it's the first time I've used cheat engine in a game since I was a kid. Honestly couldn't be bothered learning the fight and I really wanted to see the ending.\n\nSo yeah, great game if you like a slow burner. Probably isn't for everyone but I'm really glad I gave this game a chance. Even if you don't play the game, i highly recommend you to look up the ost on youtube",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "If you liked the first Octopath Traveler, this one takes everything great about it and cranks it up even higher. The world, characters, music, and variety somehow all got better. It’s honestly crazy how much they improved something that was already amazing.\n\nThe new addition that really stood out to me is being able to get a boat through the merchant character. You can actually sail between the two big continents and even find hidden islands scattered across the ocean. It makes exploring feel fresh and exciting again.\n\nThe combat and storylines are just as strong, if not stronger, and the endgame content is no joke. The final boss might be one of the hardest fights I’ve ever done in a JRPG—and beating it felt awesome.\n\nEverything about this game shows how much effort the devs put into it. If you loved the first one, you’ll love this even more.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "This was an absolutely incredible journey, The ending had me tugging at my heart strings and almost had me crying LOL. If you have the funds to play this game, this is A MUST PLAY!!! I don't usually leave reviews but I think this game deserves one. This is by far the greatest video game I've ever played. I can't recommended this enough.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "genuinely one of the best stories i've ever experienced in a game, and 8 of them at that! well except for the dancer, her story kinda sucked ass ngl.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Cool concept, well executed. A fun retro aesthetic which makes me feel like I'm playing a classic JRPG of yore, but with modernised gameplay elements and a 3D open-world. The way you can interact with all the random npcs in all kinds of different ways, from learning their name and backstory to beating them up and robbing them blind, is extremely cool. Has a variety of interesting characters each with a unique story of their own to tell: unfortunately, spreading out its story across so many different characters leaves each one feeling rather short and diluted, and the writing as a whole just isn't strong enough to compensate. Still fun, although it is rather pricey - maybe wait for a sale.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I loved playing this game from beginning to end.\nYou grow attached to every single character as they develop and come together as a party.\nThe ability to combine classes however you like is a fantastic feature, giving you plenty of room to experiment and create the combos you enjoy most.\nThe story is captivating, with lots to explore and rewarding discoveries to uncover.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A great successor to the original Octopath Traveler.  The stories are engaging and heartfelt.  The combat is fun and challenging.  Getting your party leveled up can require some grinding, but overall it is not too bad.  The job system offers fun ways to customize and empower the characters, by far my favorite aspect of the games. 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "After 73 hours and still haven't finished the game, I definitely recommend this game. ^^ If you like a good JRPG, this is it. Great characters and an interesting story. \r\n\r\n10/10 for me. ^^",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "An essential RPG that proves the golden age of turn-based storytelling is far from over.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Was honestly kinda hesitant since this would be my first time playing a JRPG like this, but I really enjoyed. I initially only got it for the art style, but the gameplay/combat and sound track are so good. Would definitely recommend to anyone trying to get into the genre",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game's gameplay is literally like a SNES era Final Fantasy game of my dreams and I do wish all the old FF classics were remade in this style.\r\n\r\nInstead of a certain main character and a story, Octopath Traveler II decides to take a different approach and tells 8 different stories of 8 different party members. A thief, a cowboy, a samurai, a cleric etc. Although it was a bit confusing to understand how to progress in the game at the beginning for this reason, figuring out how man should progress did not take long: gather all party members first and then, follow their chapters corresponding to your level. Nowadays, this type of JRPGs rather come from indie studios and as a result, you don't get to see any voice acting at all. However, Octopath Traveler II being rich in this field is fantastic. A game that is actually not indie, but made with an indie spirit.\r\n\r\nI'm afraid I have to shelve the game for later because I currently am not in the mood to play any JRPG.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely wonderful game, it has an old school feel with modern QOL enhancements.  I have played thru multiple times with different starting characters.  Definitely recommend for RPG or JRPG fans",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome RPG, with a great cast of characters.\nTemenos is by far my favorite, even if we include the characters from Octopath I. \n\nNow, the question is, do I recommend the game? Well, if you disliked the first one, no, however, if you enjoyed the first one, you sure will love this journey, as it only improves on the formulae. \n\nThe way they implemented the music transition between Conversation x Boss Battle deservers bonus points by itself. \n\n[i] May the sacred flame guide you, or something like that [/i]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Started for the gameplay, stayed for the characters and banter between them.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Octopath I was a slow, moderately-flawed game that I had to come back to 3 times to finally finish, and appreciate. There's no reason to actually find its true ending but when you do it makes the rest all worth it.\n\nOctopath II is improved in every aspect yet, for me falls short of the first in terms of challenge and accomplishment.\n\nBoth games are a 7, and worth the time, just for different reasons. And the music is a 10.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful story, the music very good, the story of each character is good. Good game JRPG must try",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a superb turn-based JRPG and an amazing leap forward from the first Octopath game. Experience eight different storylines for each of your party members, and the plot then culminates with a cool final boss battle. The music and graphics are gorgeous and a throwback to the best of the 16-bit generation RPGs. I had absolutely no glitches or crashes and the game was rock solid all the way through. I found the difficulty pretty easy until the final boss and secret extra boss, which were both quite challenging. My overall playtime was about 60 hours for the main story and about 77 hours for 100% completion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5/5. I don’t normally leave reviews, but I felt compelled to do it for Octopath II because of how incredible my experience was playing it. For the record, playing it on the steam deck (which is flawless). Spoiler free.\n\nGood:\n- The game is very beautiful. I mean this in every way. The graphics are gorgeous and immersive, although I am sure I have a little nostalgia goggles by comparing it to JRPGS in 2000s. I especially liked the Crestlands (mountain autumn vibe). The writing is good, albeit a bit uneven throughout the game and there are a few moments that stick out to me even when not playing. And the music is truly incredible, on the level of Skyrim or morrowind. The haunting and eerily beautiful nighttime music especially stands out.\n- There are numerous little details in the graphics, the writing, and even the music that go towards the theme of the “Dawn” and other themes. The details really sell the the world and make the game stand out. I wish all games were treated the same. For example, little side quests that re completely optimal will tie back to the main story in a way that is touching and beautiful.\n- Characters. The main characters are likeable and sympathetic. It’s easy to sit in their shoes and get drawn into the story. I love the banter between party (wish there was more) and each characters story. You will naturally favor some over the others (I like Temenos and throne the most). Even voice acting is good.\n- Immersive world. I liked how you naturally learned about the world through the cutscenes and little details and chats with NPCs. I hated that there are minimal books or things that flesh out the world (like I have no clue even after 70 hours if the eastern continent is united or not). World generally made sense and world-building was consistent throughout. Lots of interesting side quests and content as you progress.\n- Hard to articulate, but it’s very smooth and easy to pick up and play for 15 minutes at a time (or longer for that matter). Very friendly for gamers like me that are constantly moving and doing things.\n- Very good value. It’s a long game and it actually keeps you sucked in. I paid $23.99 and anticipate playing for about 100 hours.\nOkay:\n- Combat is fun and immersive but it can get a little repetitive after a while. The main theme is creativity and combos. I liked the creativity of having multiple classes and the combos between characters and their latent abilities and ultimate powers. It’s immensely satisfying to experiment and find things that work. But it can be annoying to have to try to calculate every possible combo. I found myself skipping a lot of battles after like 40 hours.\nBad:\n- Uneven. Some plots felt a little rushed at times or simply didnt really speak to me as much as others. No plot was bad, but some chapters could probably be categorized as filler. \n- Little things broke some of the immersion. Like, you will never see other stuff party members during a cutscene in the main story for each character, let alone hear theme chime in. You will never hear your main character talk in side quests. I think these were probably compromises in development but they stick out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got hooked up the moment I opened the game. I loved the first game already and this one is even better. A few new things that just make the whole gaming experience way more interesting. I had good timing on buying it with other games in sale back then, but its definitily worth the full price aswell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally be able to review this game after 100%ed it. There's a lot of content to be explored, and many QoL updates that feels better than OT 1. 9/10 i should say, the story is just meh/standard, nothing too crazy, but everything else is a chef kiss.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing sequel! Indeed! It is an amazing game that you should try and is worth the price.\r\n\r\nIt improves everything it can from Octopath Traveler 1 but the difficulty, because of how bigger this game is you might end up overleveled easy. \r\n\r\nThe music is incredible and even better than OT1 which had an amazing music!\r\n\r\nThe characters have really interesting stories! Temenos and Castti are my favorites so far.\r\n\r\nThe game loop is fun, the animations and art is really pretty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Visually the game is a 100/10 if you love classic turn-based rpg. The 3D/2D environments takes that nostalgic feeling to a whole nother level.\r\nGameplay is an 8/10 experience for me. It's just too much monster encounter for my liking. It's not \"random monster encounters\" but i feel like it's a set monster encounter after you have moved a specific distance. It's annoying at the early levels. You can increase this distance with a support skill but it is still annoying.\r\nStory element is a 9/10. I cannot give it a full 10 because there are no interactions between the story of each traveler. When you start a story chapter for a traveler, the game pretends like your other companions dont exist.\r\nBut overall the game is a must play and I recommend it to everyone but especially to those 1who loves turn-based rpg.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love every bit of the games and the character story, I love, I cried and I even smiled. I still have a lot of finish tho because i wanna 100% this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very enjoyable and charming jRPG.\n\nThe negatives - it has a bunch of standard jrpg quirks:\n- the typical spam of random and annoying encounters as You traverse the world, this become extra annoying when (for whatever reason) You need to move through a low level zone with Your high level party (yes You can just 'flee' or just spam aoe attacks, but still it's just an annoying interruption more often than not)\n- again in typical fashion You are expected to grind some...this is inevitable if You want to beat the game to it's fullest, but even if You just want to finish the stories of characters that are not part of Your 'main party' just because the story expects You to use a 'path action' that is gated behind a certain character level.\nIn short the game expects You to level all 8 companions fairly evenly and if You prefer a play-style (like me) where You build a favorite squad and don't really care to min-max all the side characters then You will hit a wall at some point...\nSide note on the secret boss (which I did not finish at least for now...maybe will return to it at some point) is the peak of that approach, most of the strategies revolve around a cheese tactic around items/specific character skills, so if You never planned for that then You need at least couple of hours of level/item farming to be prepared. It's not bad per se, it's just something to be aware for all the completionists out there :) (my backlog of games is too long to do that for now)\n\nNow the positives: \n- if You enjoyed OT 1 - You will enjoy this one, it's more of the same basically, no massive changes (which is good and bad I guess)\n- the graphical style is beautiful, the environments, the boss design, it's just top tier, especially if You have that retro love in You\n- the music is fantastic, I honestly feel it's one of the best instrumental music available in modern games\n- story is really interesting and although has it's 'cringy' moments (I'm sorry maybe it's just the fact I couldn't really connect with a furry-kiddo Ochette...) it culminates in an interesting fashion and has a satisfying ending\n- game-play is good, it's simple enough that You can jump into it fairly quickly and understand the mechanics (shield/brake/vulnerability system and damage types etc) but still gives You enough job/secondary job/item/skill/passive skill combinations that You can play around different strategies to make it interesting and unique\n\nIn short - if You are an jRPG fan - no brainer, go for it, it's worth it. For anyone else, You should definitely try it if You have any craving for an interesting story, beautiful music and rpg elements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]4.9/10[/h1]\n\nNot a game. This is a story shown via cutscenes. \nif you expect a game, go find something else. \nif you want mediocre stories, you will find them here. \n\nIts not a good game, but its a \"expected\" sequel to OT1. \nThe didnt fix most of the issues of the first game, they added convoluted systems without any depth. they still have no codex in a \"game\" thats practically 80% codex filling. \n\nhere are the OT2 specifics:\n- the story is overall far flatter than in 1 though a insanely mixed bag, some like Castii or Ochette are really fun. others are so cheesy, you think a 12yo wrote them. \n- the characters are even less interesting as in 1\n- i dont know why, but the main char sprites are even worse (less sharp and less \"polished\")\n- [strike]and on top of that, it feels even more like fan service catering...[/strike]\n- it IS practically that. the characters are made for fanservice, not for story or depth. esp. compared to OT1. \n- the missing codex breaks the gameplay loop so hard. \n- there is no balance. you either steam roll or get steam rolled. \n- there are SO many missing features or depth, its not even funny.\n> codex, codex, codex\n> chest detection (would be nice)\n> combine that with better hidden chests/ longer, less linear paths, so exploring is actually fun and not a chore. \n> MAKE USE OF THE FEATURES. you have so much promise with the use of interaction and the ship but then, 90% of the quests are just cut scenes. \n> immersion breaking lazyness. i.e. no change of character when switching jobs outside of combat/menus. no selection of which costume you want. again, similar with the path actions. you have still a slight bias to have similar PA combination in the characters (two pair of AABB instead of all four combinations in a ABCD pattern. Which means you cant do everything with every combination)\n\nTLDR: \nits a good looking story teller with a bad gameplay loop. \na shallow, surface-level story and characters that just are. \nthe mechanics are an empty, hallow shell. \n\n[b]do not look for depth, as there is none. [/b]\n\nTurn of your brain and somewhat enjoy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The music, the combat system and the story which made the first game great is improved upon and makes this game even better than the first installment. Play this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What if we made octopath1 but better, and then they made octopath 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This isn't like any game I've ever seen. For some this may be great, but it won't be for everybody. This is a grand adventure. It's very heavy on exposition and story telling. If you enjoy this sort of thing and if you have a bit of patience, you will have a good time. Make no mistake: I'm nowhere in the game. Mild spoiler warning, but: You start the game alone and you have to get by with what you have. Then you have to get through the first hurdles, which you're at times ill prepared for. If you can find your way, you can start adding party members. This is not straightforward because many paths are softcapped, so way too high for your level. You have to find a survivable route, which makes for a tedious start. You think it gets easier then, but no. Every party member has an origin story. If you play that, you are back at one character at level 1. Then you have to scrounge for what resources and levels the best you can and finish up. Then you can continue with a bigger party. It's not THAT hard if you're patient, but some characters are really bad at solo fights, or, maybe I'm terrible at the game. Either way, the solo fights can take ages. On the other hand, at 22 hours in, I've not seen much combat or done anything that's actually that hard. If you're prepared for this, it's a good game. I'm still playing it after all. Having just a thumbs up or down doesn't do it justice: It has to be your cup of tea. *I've seen a fair bit now and there is a lot to do. The downside is the adventure becomes quite disjointed and the game is understandably, not very well balanced. The early quests for any later characters you might pick up are way too easy. On the other hand, you're underleveled for the main quest, unless you find other things to do. This is a bit of a fuss, but, you won't run out of stuff to do soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I suppose my criteria for a good story has increased with time, age, and an increase in data available -- but this game definitely feels new-old school and if that's what you're after it will very, much scratch the itch. I wish, sometimes, the stories were a bit more in depth and the gameplay was a bit more in depth, too, but overall I think the game achieved what it meant to do. This is better by any objective measurement than 99% of the RPGs released in the SNES/Genesis era.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely an improvement is made in achieving the potential of this wonderful title on the second installment. Difficulty scaling in the first game made the grinding and improving part of each character ineffective and in a way unimportant and unrealistic in narrative wise. Unbending blade achieving all the glory, and then struggles against some once upon a time lv 5 creatures at the late game didn't really made sense tbh. Absence of this unnecessary machanic truly made the overall experience more realistic and fun especially narrative vise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This takes everything from OT1 and does it better. It's 100% a more \"Fully Realized\" Octopath Traveler game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved OT1 and this just takes everything and makes it better. There is so much to do, see, explore. I can't get enough of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game!! this is my first Octopath Traveler and I simply love it. The art style is simply unique and the gameplay is extremely addicting, the story is engaging and everything is creative. I never felt mind numbed, instead i felt like i could live in this world. the amount of attention and dedication they putted into creating this masterpiece is definately something to be praised!!!! 10/10 in every aspect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wasn't sure about the game at first but it grows on you overtime, good soundtracks too, 100% recommend being played on the steamdeck great experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'M STARVINGGGGGGGG, I really like Castti and Ochette.  Most fun turn-based rpg gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some reason this game captures a similar feeling back in the day when I first played Final Fantasy IV (2). The music and battles somehow are just right, and are fun for turn base because of all the choices you have at your fingertips. The story elements are well done, maybe a little long winded for my taste, but you can skip when you feel like it.\nThe battles feel epic as is the music, especially the boss battle theme, one of the best I ever heard in all my years. The animations in battles are excellent and really bring it to life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't think I could recommend this game enough. Just like with the first game, Octopath 2 is a classic JRPG like early Final Fantasy but modernized in a way that really makes it stand out. The art and graphics are gorgeous, the music is beautiful, the combat is fun (can be repetitive), and the stories are engaging and meaningful. They've also reworked the classes to have more flexibility, there's fun synergies and combos, and new Path Actions! \r\nMy one negative from the original was the ending. You went through a gauntlet of bosses followed by a super hard end boss only for the end to have a brief end scene with a couple characters talking via text bubble and then that was it. It was very unceremonious and made it feel really not worth the work. \r\nOctopath 2 doesn't do that. The end has voice acted cutscenes, every character interacting with each other, a tough but not as impossible end boss (at least for me, even with a guide it took me countless tries to beat the end boss of Octopath 1, whereas I beat this one on my second try), and an awesome post credits cutscene. \r\nAll in all, Octopath Traveler 2 might just be one of favourite games of all time and I cannot recommend it enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, with fights that feel difficult but not unfair, and great Character stories",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quitando que  las historias son naif a mas no poder y alguna cosa menor es buen juego. Hecho con mimo aunque bastante continuista",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What it suffers in a bit too much story it more than makes up for it in deep, smart gameplay. Highly recommend. Also, props for telling a story of a world mired in the throes of classism and capitalism like our own",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was a fan of the first game this one was even better with more content, they innovated on the mechanics of the first game. Would recommend!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game desires a level of mastery from the player that is laudable to ask. Parallel to a souls game almost, you are expected to fail and learn. Every time I've stepped away from a session I've come back better with new strategies to overcome a roadblock the game puts in front of you. I am not the core audience for this game and the last boss proves it handily. Unlike other good hard games, I just feel it refuses to be interesting in the ways that matter to carry me to credits.\r\n\r\nCharacter stories in Octopath Traveler II range from vaguely predictable and insipid anime tropes sprinkled with standout beats that I feel satisfied with taking at face value. I don't believe any character story was bad, just on the whole unable to lift itself above 'just fine.' Cutscene skipping and speed-up options on offer were definitely appreciated. Using each character's special abilities to interact with side quests and garner resources from NPCs were novel at first, but also felt wrote over time. \r\n\r\nBut there's something about this experience that hooks me. I'm making a conscious decision to not jump back in and grind out another thirty hours, and I might jump on that in a few years. Too much of that desire is sunk cost fallacy for my taste.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "never ending random  encounters every 1 0 seconds and they take 5 + mins each to beat, made me quit.\n\ngraphics are nice and gameplay was smooth.\n\nstory was ok, but dialogue is very 7nireresting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Borrowed my friend's ns gamecard to play for 30 ish hours on ns before returning the game card, and decide to try another fresh round on steam. Did not buy this game earlier because I really hate octopath 1, and I would still say I hate octopath 2 for almost the same reasons. \n\nFirst HD2D has still been the game engine I hate the most for modern video games. Graphics looks disgusting and fake, pretending to be retro style but is mixed with weird modern visual effects. Normally for a modern JRPG with a price of 60 USD to present main plots developers need to carefully design the cutscene. With this miserable game engine this step is just skipped and only blurred pixels are presented. The funny thing is those pixels can carry so little information that the only way to put focus on a character is to make the character steps ahead before speaking. I should make it a rule for me that I need to avoid any HD2D games in the future. \n\nSecond the storyline is just a little better than octopath 1, but doing better than a game that probably has the worst story among all the jrpgs I've ever played is not something big. Start playing and immediately feel sleepy when reading those predictive stories copied from templated overused plots that have already been there for ages. Even a gacha game on smart phones can do a better job on making more creative stories. I happened to see someone claims that this whole octopath series is partially inspired by trpg, which makes complete sense because I equally hate trpg.\n\nGame play is also not new at all, basically a weak, cheap, and way less imaginative copy of Asano's own legendary bravely default series. The gameplay is especially awful considering bdff remaster has been released on ns2 and gave me a super sweet 100 hours of gameplay experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've always been hesitant when it came to checking out Octopath Traveler since I mostly play story focused JRPGs and haven't heard almost any positive opinions when it came to the first game's story. So I ended up skipping that game. Now, I haven't heard many favorable things about Octopath Traveler 2's story either, but I did hear that apparently it at least improved upon the first title. And as I suddenly found myself in a mood for a more gameplay focused experience, I decided to give 2 a shot.\n\nUnfortunately, as it turns out, this is one of the few RPGs in my life I actually had to drop without completing out of sheer boredom.\n\nAs I said, my expectations for the storytelling were low. On top of that, I usually prefer a more focused narrative centered around a main party of characters with strong character dynamics. So something like Octopath, which is split among 8 characters, each with their own story, already doesn't sound too appealing to me. But I heard that the character interactions were improved in 2, so I had at least a little bit of hope.\n\nBut even with my already low expectations, I was still left disappointed. The individual stories vary wildly in tone and atmosphere, making it difficult for me to get invested and immersed. The wide array of character backgrounds doesn't make the world feel like a single large diverse world to me, instead it makes it feel chopped up into separate, incohesive chunks, each with their own theme.\n\nThe plot of the individual character stories is played very much by the book and predictable. Predictable doesn't mean bad of course, but the execution is also mostly extremely basic. The dialogues, albeit well localized, are just... dull. Reading them sometimes felt like reading dialogues from a fairy tale for kids. It gets especially bad during dialogues of less important characters like random villagers. Not that the dialogue and characterization of side and main characters is much better. Again, not bad, just really basic and uninteresting.\n\nThe character dynamics between the main characters are also pretty much non-existant. There are a few dialogues you can trigger when reaching certain towns or story points that involve 2 characters from the party talking to each other. These are the only interactions between them that I've encountered so far. And they are in most cases just as simple and dull short conversations as the rest. Nothing that would even remotely get me emotionally attached to the cast.\n\nKeep in mind that I've only played chapters 1 & 2 for all characters, as well as chapters 3 or even 4 for those I enjoyed the most. I'm sure there might be more interesting content later, but I had to give up at this point.\n\nNow I've spent most of the time complaining about the story, which I didn't really have high expectations for. But the gameplay side disappointed me even more, for a lot simpler reasons. Perhaps the biggest culprit is the completely all over the place balance. Much like the storytelling, the gameplay challenge Octopath offers also feels totally incoherent to me. I don't think I've had a single fair encounter during all those hours I played. All the time I was either completely overleveling the enemy, making the fight a joke. Or I was completely overleveled by the enemy because I stumbled into a high level area, making the fight near impossible mathematically.\n\nI think the main reason for that is the split across 8 different stories. This resulted in the levels of my party being spread far and wide, making it impossible to really get a fair fight since my first few characters were massively overleveling any immediate story content. You could theoretically look for a challenge in some higher level optional areas, or when rushing a single character's story all the time, but I'm not a fan of a game's difficulty being reliant on the player intentionally handicapping themselves or having to look for enemies of a specific level to have a challenge. Not having higher difficulty options also didn't help I suppose.\n\nBut most of my complaints involve the words \"dull\" and \"boring\", which are of course entirely subjective impressions and matters of taste, so your mileage may vary. I simply found out that Octopath's formula of both gameplay and storytelling simply isn't fun for me.",
      "voted_up": false,
      "votes_helpful": 71
    },
    {
      "review": "I want to start with saying that the story and gameplay are good, the problem is how the two don't work together and causes jarring discrepancies between the gameplay and the story.\r\n\r\nFrom a gameplay perspective, this is mostly just Bravely Default's gameplay system, turn-based party combat since you'll have a party of 4 for the vast majority of the game unless you're actively trying a challenge run with less party members. As in Bravely Default, the gameplay is pretty good.\r\n\r\nHowever, the story NEVER acknowledges that you're not just one character but a party. Each character's story acts as if the party didn't exist and that that character was alone. This shows in how there's no interaction between the characters during the story and the story even acts as if fights that are happening are 1v1 fights and, outside some fights involving certain characters whose path actions let's them duel NPCs, it's actually a fight between the enemy and your party which is insanely jarring. There are some interactions between party members in the form of party banter, small chats between generally 2 party members which sometimes somewhat relates to the current story but is often just for light hearted fun. There's also a handful of crosspaths, stories involving 2 specific characters, but they're short and there's not a lot of them.\r\n\r\nThen there's also the world building which brings further inconsistencies with some NPCs acting like the world is big and it's a big deal to traverse a continent and even more so to cross the ocean between the 2 continents while the story and sidequests often act like the fast travel instant teleport is cannon. For example, you have a story that tells you an arms shipment is going to happen soon and needs to be stopped, but the place between where you learn of it and the place where the trade is happening are almost at the furthest points on the map they could have potentially been. Then a story that has a character traverse the ocean mostly on a small lake boat while uncounscious while it's supposed to be dangerous to be on the ocean.\r\n\r\nOverall, it seems square enix had a few good small stories and they decided to stuff them together with a world another team created over Bravely Default's gameplay and never bothered trying to make each of these three parts fit coherently together. If you can ignore these inconsistencies, then it's a pretty good game, however, if you care about the game having any semblance of coherence between it's different parts, you're going to have problems with this game.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "For transparency sake, I didn't complete the game. Furthermore, I only say I don't recommend it, because there is no \"Maybe\" option. \nThis has been at the same time one of the best jrpg's i played, and also one of the worst. \n\nI'm going to mainly list the issues i have, but art, sound/music, combat, progression and even the writing itself are all wonderful and i very much like those. \n\nBut...Man, is it weird. \n\nThe whole idea that you have these eight characters, all with their own goals and ambition's, is neat. None of them, bar Partitio, should be travelling together, really. Why is Throné travelling with...say Castti, holding off on her own, VERY URGENT, desires to help some random chick she happen to run into in the Desert for example. \n\nEach Chapter i completed came with...this curve, im gonna call it. I get intrigued, invested and then punched in the face with a brick. \n\nI'm going to use Castti's chapter 2 as an example.\n\n [spoiler]So, you travel to Sai on your quest to recover her Memories. You walk into the Village, a Village at War might i add, and immediately someone yells for help, and Castti being a healer wants to help. All good so far. You go to the field hospital, meet another Apothecary and the Soldier's mean, cold leader guy. Castti helps the other Healer with mending the wounded, then goes to the frontlines. She learns that the \"Enemy\" is injured and goes to help them, which is fair enough and makes sense, and Angy Leader Guy follows her. At this point, I figured we gonna have to fight him. You get to the injured, she yaps to Leader Guy to fetch Water and fire wood, which he declined. Then she yaps again and he is all of a sudden like \"Oh...okay yes i will go grab it.\" HE DOES A FULL 180 ON HIS MINDSET AFTER BEING TOLD TO FETCH WATER AND FIREWOOD! He suddenly comes to realise that War is bad and then turns into an entirely different character that helps everyone. And it's so fucking jarring, because its not given the time to properly unfold. You kill a big bug and then randomly the War is over because the other Leader Guy goes to beg the king and the Chapter is over. The amount of words it took to describe this is about as much dialog as there is in the chapter that drives that plot forward. Maybe you can see my issue here...its fucking rushed, because its one of EIGHT Characters story, and just a chapter in it. This should be an entire act in a game.[/spoiler] \n\nAfter that, you kinda just stand there, open the Map to find the next chapter and \"oh, well its 15 level above my current level, so i guess i do this Characters chapter instead.\" This shattered any immersion i had, any attachment. While it'd be dumb, I wouldn't care if i just grinded out levels and do one of the eight characters Story at a time...except then, for a large chunk of the chapters in each story, I'd be insanely over-leveled which would make the combat trivial. So instead, i dealt with being spoonfed bits and pieces of each story, which aren't exactly connected, with characters that realistically shouldn't be travelling together and instead do their own thing and...I don't know. I'm disappointed. If there was a main plot that would connect these Eight individuals, and their own stories would be their \"Companion quests\" if you will, i'd nothing but praise this game. \n\nIt's still decent, the writing is good to a point where yes, the Chapters are insanely rushed in some cases, but i still fully understand what is going on. I'm just over this cycle of \"Oh i can't wait to see whats next- Never mind, to low level, gotta do someone elses stuff first.\" This Cycle of being immersed in a story to just be ripped out of it. \n\nI know this is a mess to read but in conclusion...it lacks a main plot. Maybe there is one towards the end, maybe there isn't. I don't think I'll find out just yet. I'm over it. Can't believe im saying this but I'd prefer it if there was level scaling. Then i could just do one story after the other. It's like reading eight short stories at the same time, reading a chapter in one, then moving to another and so on all the way through and back to the first one. \n\nIf this doesn't sound bad or annoying to you...BUY IT! ITS GREAT! YOU'LL LOVE IT. For me...sadly, it's to jarring.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Hmm, One of those instances where I wish I could rate this out of 10 and not just good or bad, its not a BAD game, it just has a lot of annoying systems and flaws that drove me to frustration too many times to be able to rate it highly. The writing is pretty good, the characters are mostly good, there is a good amount of content, animation and music also good.\nI really didnt ever enjoy the way that the game made me scower the world for item upgrades, many times I far far out levelled an area but was very weak as items were not around, it makes you hunt from town to town to look for the upgrades which are scattered all over the world from different vendors, tedious.\nThe thing that drove me to close the game the most however were the bosses, they simply are not fair in many instances. You can be cruising through a boss then all of a sudden it goes into god mode and kills your party in one or two rounds, ... a puzzle you my say? sure, if I hadnt just spend 10-20 minutes whittling it down with zero issues to be killed almost instantly when it \"gets angry\" at 20% health. Oh, you want me to do it all over again and hope that I can push over the line at the last moment to make it exciting after the first 15 minutes was a cake walk? Come on, that isn't fun, its frustrating and un-realistic. Im most of the way through but these moments are happening more and more, and I am finding it harder and harder to come back to the game in order to finish it.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Gameplay is fun, but the story is so CORNY that it makes progressing the game really unenjoyable.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I played the first one and was disappointed with the blandness of the story. So when I heard that the sequel had improved on the stories, I was stoked to play it! Unfortunately, those improvements aren't enough to keep me interested. It's just too repetitive. They didn't improve on the combat enough from the first one to make this feel like it's own other game, it truly feels like a slightly better DLC for the first one. The Graphics are impressive and interesting, but it's been a long time for me since the graphic quality of a game made up for the fundamentally boring game play.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I would have loved this as a kid, reminds me of the god old days of final fantasy 7. however.....i think i out grew it or something because i feel the repetitiveness of it. Story, random battle, get item of chest that you had no choice in getting...equip it because its better. do it all over again. beautiful JRPG i just thank it lacks variety in play styles.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "never ending random  encounters every 1 0 seconds and they take 5 + mins each to beat, made me quit.\n\ngraphics are nice and gameplay was smooth.\n\nstory was ok, but dialogue is very 7nireresting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun at first, but becomes extremely repetitive.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is beautiful and full of interesting ways to interact with the world, its just a shame the bosses are overpowering broken for their levels. if you're a Dark souls fan you'll love the boss fights. if you're a more casual Jrpg fan with only a few hours to spend on it, you'll hate it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The boss fights are still ♥♥♥♥♥♥♥ stupid.\nJust had my party turn to stone - no ability to stop it because if they die after being stoned its permanent for the fight and I didn't purchase a specific anti petrification item.\n\nIt completly killed the enjoyment and desire I have to play the game and is the EPITOME until why I waited for this game to be over half off to purchase.\n\nAside form that, it shares all the stupid ♥♥♥♥♥♥♥ problems of the last game.\nYou can't go 5 feet without an encounter, even with evasive maneuvers.\nThe encounter rate is so bad there is a mod that reduces it to 0 when you put the evasive skill on.\n\nI'd have to spend another 5 to 10 hours grinding up levels to beat the end boss fight - that is with a party well over 50. \nTo top it off, you have to follow a specific strat to win, you can't do anything else because it just spams instant death, massive AOEs, and action blockers.\n\nThey some how ♥♥♥♥♥♥ up a perfect opportunity to make an epic battle...instead of giving you an 8 man party they let you swap back and forth.\nThis would be a mind blowing innovation in today's games designed by ♥♥♥♥♥♥♥ still living 30 years ago that for some reason give you 20 ♥♥♥♥♥♥♥ characters but only 4 party slots.\n\nThat is it....no epic 8 party battle vs a god...just swap back and forth between 2 groups of 4.\nIts a crime against humanity how many brain cells I lost witnessing the switching mechanic. Its just so ♥♥♥♥♥♥♥ stupid.\n\nJust give us a ♥♥♥♥♥♥♥ 8 party battle with all of them getting turns.....jesus ♥♥♥♥♥♥♥ christ its really not that hard.\n\n\nDon't by this unless its on a mega sale. The game was mostly boring and tedious.\nAnd fuck the retarded mouthbreathers with low standards giving me jeser icons.\n\nYou dumbasses are why we're getting charged over $60 for games and getting garbage. Get better standards you basement dwellers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried. The story is uninteresting and the story chapters are so spread far apart you have no choice but to grind a lot. I don't mind grinding, I've played Wow and other RPGs but the grinding is so boring. I didn't bother finishing it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I thought the first game was... kinda meh, but I heard this game was a lot better so I gave it a shot... it felt basically like the first game, there are some minor differences, but they're just that, minor.\r\n\r\nI got bored before even finishing everyone's first chapter.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game can randomly delete all of your save data at any time (this bug has been in the game since release and still hasnt been fixed lmao)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, it's just so meh. \r\nThe thing is from the onlooks you know \"story\" is going to be the major focus in this rpg. Eight characters, each with their own vingette(s), ect ect. The problem is after playing through about a dozen different segments there's just nothing remarkable or twisty going on. I don't want to use the word cliche, obvious is better. Combine that with video game writing and a lack of compelling combat and you'll konk out after 20 or so hours. I just don't really care what's going on with anyone. \r\n\r\nAs for the combat it does this thing where you use BP to boost attacks, and you get 1 per turn. The issue is anything that isn't boosted does terrible damage, so your skills are mostly for breaking shield points using attacks the enemey is vulnerable to. Not bad, okay, a little change up. The issue i had is sometimes a guy is only weak to one attack you have on hand, and you only attack once with it per bp point, so grinding down shield before you can do real damage or waiting for bp to build up turn after turn is irritating. Also magic kinda sucks or i just didn't jack up my character enough, but there is no multi hit spells save one, so using elements to break shields is pointless. \r\n\r\nAll in all there seems to be some niffty combat builds for each character because you get to take 2 classes, but, in the end your fairly limited on what you can be doing, and doesn't really play well past the mid game. Again a lot of \"meh\" going on. So i might plod on another ten hours to beat it, but it really didn't fly off the rails at all the way i had hoped.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Not exactly sure what it is, just doesn't feel smooth or immersive for an RPG. Starts off strong but then turns into traditional grinding.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Octopath Traveler 2 might look beautiful, but actually playing it is a chore. The most basic functions, like saving or exiting the game, are hidden behind outdated mechanics that make no sense in 2025. The PC version is especially bad: my mouse disappears constantly, menus don’t respond well, and the UI feels like it was made for a handheld console ten years ago.\n\nThe game forces you to find save points instead of letting you save anywhere, and the screen scaling is tiny unless you dig through settings or mess with your resolution. It’s baffling how a game with such gorgeous art and music can feel so unpolished and inconvenient to play.\n\nIf you value accessibility, usability, or just want to enjoy a game without fighting its interface, skip this one.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is borderline unplayable on the steam deck it just keeps crashing every 10 minutes I, ive tried every single \"fix\" i can find but nothing works i even used a different hand held and it still crashed. cant get passed the story because of this the only way to continue is to literaly skip the cutscenes... im so bummed about this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you really enjoy interactive storybook-style games, you'll probably love this game. But calling it a \"turn-based RPG\" is using the term a bit loosely, IMO. I only managed to get through the first chapter of one of the characters, hoping it would get better, but it never did. It's not terrible IF you know what you're getting and enjoy this type of game.... but if you're expecting something more action-packed with a more original story, this is definitely not it. I honestly don't get what the hype is about.\n\nBAD:\n- Story was generic and boring. Very cliche and unoriginal.\n- Tons of dialogue/text scrolling every few minutes, very little battling.\n\nGOOD:\n- It's pretty, I guess?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Borrowed my friend's ns gamecard to play for 30 ish hours on ns before returning the game card, and decide to try another fresh round on steam. Did not buy this game earlier because I really hate octopath 1, and I would still say I hate octopath 2 for almost the same reasons. \n\nFirst HD2D has still been the game engine I hate the most for modern video games. Graphics looks disgusting and fake, pretending to be retro style but is mixed with weird modern visual effects. Normally for a modern JRPG with a price of 60 USD to present main plots developers need to carefully design the cutscene. With this miserable game engine this step is just skipped and only blurred pixels are presented. The funny thing is those pixels can carry so little information that the only way to put focus on a character is to make the character steps ahead before speaking. I should make it a rule for me that I need to avoid any HD2D games in the future. \n\nSecond the storyline is just a little better than octopath 1, but doing better than a game that probably has the worst story among all the jrpgs I've ever played is not something big. Start playing and immediately feel sleepy when reading those predictive stories copied from templated overused plots that have already been there for ages. Even a gacha game on smart phones can do a better job on making more creative stories. I happened to see someone claims that this whole octopath series is partially inspired by trpg, which makes complete sense because I equally hate trpg.\n\nGame play is also not new at all, basically a weak, cheap, and way less imaginative copy of Asano's own legendary bravely default series. The gameplay is especially awful considering bdff remaster has been released on ns2 and gave me a super sweet 100 hours of gameplay experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For transparency sake, I didn't complete the game. Furthermore, I only say I don't recommend it, because there is no \"Maybe\" option. \nThis has been at the same time one of the best jrpg's i played, and also one of the worst. \n\nI'm going to mainly list the issues i have, but art, sound/music, combat, progression and even the writing itself are all wonderful and i very much like those. \n\nBut...Man, is it weird. \n\nThe whole idea that you have these eight characters, all with their own goals and ambition's, is neat. None of them, bar Partitio, should be travelling together, really. Why is Throné travelling with...say Castti, holding off on her own, VERY URGENT, desires to help some random chick she happen to run into in the Desert for example. \n\nEach Chapter i completed came with...this curve, im gonna call it. I get intrigued, invested and then punched in the face with a brick. \n\nI'm going to use Castti's chapter 2 as an example.\n\n [spoiler]So, you travel to Sai on your quest to recover her Memories. You walk into the Village, a Village at War might i add, and immediately someone yells for help, and Castti being a healer wants to help. All good so far. You go to the field hospital, meet another Apothecary and the Soldier's mean, cold leader guy. Castti helps the other Healer with mending the wounded, then goes to the frontlines. She learns that the \"Enemy\" is injured and goes to help them, which is fair enough and makes sense, and Angy Leader Guy follows her. At this point, I figured we gonna have to fight him. You get to the injured, she yaps to Leader Guy to fetch Water and fire wood, which he declined. Then she yaps again and he is all of a sudden like \"Oh...okay yes i will go grab it.\" HE DOES A FULL 180 ON HIS MINDSET AFTER BEING TOLD TO FETCH WATER AND FIREWOOD! He suddenly comes to realise that War is bad and then turns into an entirely different character that helps everyone. And it's so fucking jarring, because its not given the time to properly unfold. You kill a big bug and then randomly the War is over because the other Leader Guy goes to beg the king and the Chapter is over. The amount of words it took to describe this is about as much dialog as there is in the chapter that drives that plot forward. Maybe you can see my issue here...its fucking rushed, because its one of EIGHT Characters story, and just a chapter in it. This should be an entire act in a game.[/spoiler] \n\nAfter that, you kinda just stand there, open the Map to find the next chapter and \"oh, well its 15 level above my current level, so i guess i do this Characters chapter instead.\" This shattered any immersion i had, any attachment. While it'd be dumb, I wouldn't care if i just grinded out levels and do one of the eight characters Story at a time...except then, for a large chunk of the chapters in each story, I'd be insanely over-leveled which would make the combat trivial. So instead, i dealt with being spoonfed bits and pieces of each story, which aren't exactly connected, with characters that realistically shouldn't be travelling together and instead do their own thing and...I don't know. I'm disappointed. If there was a main plot that would connect these Eight individuals, and their own stories would be their \"Companion quests\" if you will, i'd nothing but praise this game. \n\nIt's still decent, the writing is good to a point where yes, the Chapters are insanely rushed in some cases, but i still fully understand what is going on. I'm just over this cycle of \"Oh i can't wait to see whats next- Never mind, to low level, gotta do someone elses stuff first.\" This Cycle of being immersed in a story to just be ripped out of it. \n\nI know this is a mess to read but in conclusion...it lacks a main plot. Maybe there is one towards the end, maybe there isn't. I don't think I'll find out just yet. I'm over it. Can't believe im saying this but I'd prefer it if there was level scaling. Then i could just do one story after the other. It's like reading eight short stories at the same time, reading a chapter in one, then moving to another and so on all the way through and back to the first one. \n\nIf this doesn't sound bad or annoying to you...BUY IT! ITS GREAT! YOU'LL LOVE IT. For me...sadly, it's to jarring.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "I want to start with saying that the story and gameplay are good, the problem is how the two don't work together and causes jarring discrepancies between the gameplay and the story.\r\n\r\nFrom a gameplay perspective, this is mostly just Bravely Default's gameplay system, turn-based party combat since you'll have a party of 4 for the vast majority of the game unless you're actively trying a challenge run with less party members. As in Bravely Default, the gameplay is pretty good.\r\n\r\nHowever, the story NEVER acknowledges that you're not just one character but a party. Each character's story acts as if the party didn't exist and that that character was alone. This shows in how there's no interaction between the characters during the story and the story even acts as if fights that are happening are 1v1 fights and, outside some fights involving certain characters whose path actions let's them duel NPCs, it's actually a fight between the enemy and your party which is insanely jarring. There are some interactions between party members in the form of party banter, small chats between generally 2 party members which sometimes somewhat relates to the current story but is often just for light hearted fun. There's also a handful of crosspaths, stories involving 2 specific characters, but they're short and there's not a lot of them.\r\n\r\nThen there's also the world building which brings further inconsistencies with some NPCs acting like the world is big and it's a big deal to traverse a continent and even more so to cross the ocean between the 2 continents while the story and sidequests often act like the fast travel instant teleport is cannon. For example, you have a story that tells you an arms shipment is going to happen soon and needs to be stopped, but the place between where you learn of it and the place where the trade is happening are almost at the furthest points on the map they could have potentially been. Then a story that has a character traverse the ocean mostly on a small lake boat while uncounscious while it's supposed to be dangerous to be on the ocean.\r\n\r\nOverall, it seems square enix had a few good small stories and they decided to stuff them together with a world another team created over Bravely Default's gameplay and never bothered trying to make each of these three parts fit coherently together. If you can ignore these inconsistencies, then it's a pretty good game, however, if you care about the game having any semblance of coherence between it's different parts, you're going to have problems with this game.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Hmm, One of those instances where I wish I could rate this out of 10 and not just good or bad, its not a BAD game, it just has a lot of annoying systems and flaws that drove me to frustration too many times to be able to rate it highly. The writing is pretty good, the characters are mostly good, there is a good amount of content, animation and music also good.\nI really didnt ever enjoy the way that the game made me scower the world for item upgrades, many times I far far out levelled an area but was very weak as items were not around, it makes you hunt from town to town to look for the upgrades which are scattered all over the world from different vendors, tedious.\nThe thing that drove me to close the game the most however were the bosses, they simply are not fair in many instances. You can be cruising through a boss then all of a sudden it goes into god mode and kills your party in one or two rounds, ... a puzzle you my say? sure, if I hadnt just spend 10-20 minutes whittling it down with zero issues to be killed almost instantly when it \"gets angry\" at 20% health. Oh, you want me to do it all over again and hope that I can push over the line at the last moment to make it exciting after the first 15 minutes was a cake walk? Come on, that isn't fun, its frustrating and un-realistic. Im most of the way through but these moments are happening more and more, and I am finding it harder and harder to come back to the game in order to finish it.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Gameplay is fun, but the story is so CORNY that it makes progressing the game really unenjoyable.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I would have loved this as a kid, reminds me of the god old days of final fantasy 7. however.....i think i out grew it or something because i feel the repetitiveness of it. Story, random battle, get item of chest that you had no choice in getting...equip it because its better. do it all over again. beautiful JRPG i just thank it lacks variety in play styles.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun at first, but becomes extremely repetitive.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is beautiful and full of interesting ways to interact with the world, its just a shame the bosses are overpowering broken for their levels. if you're a Dark souls fan you'll love the boss fights. if you're a more casual Jrpg fan with only a few hours to spend on it, you'll hate it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game desires a level of mastery from the player that is laudable to ask. Parallel to a souls game almost, you are expected to fail and learn. Every time I've stepped away from a session I've come back better with new strategies to overcome a roadblock the game puts in front of you. I am not the core audience for this game and the last boss proves it handily. Unlike other good hard games, I just feel it refuses to be interesting in the ways that matter to carry me to credits.\r\n\r\nCharacter stories in Octopath Traveler II range from vaguely predictable and insipid anime tropes sprinkled with standout beats that I feel satisfied with taking at face value. I don't believe any character story was bad, just on the whole unable to lift itself above 'just fine.' Cutscene skipping and speed-up options on offer were definitely appreciated. Using each character's special abilities to interact with side quests and garner resources from NPCs were novel at first, but also felt wrote over time. \r\n\r\nBut there's something about this experience that hooks me. I'm making a conscious decision to not jump back in and grind out another thirty hours, and I might jump on that in a few years. Too much of that desire is sunk cost fallacy for my taste.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The boss fights are still ♥♥♥♥♥♥♥ stupid.\nJust had my party turn to stone - no ability to stop it because if they die after being stoned its permanent for the fight and I didn't purchase a specific anti petrification item.\n\nIt completly killed the enjoyment and desire I have to play the game and is the EPITOME until why I waited for this game to be over half off to purchase.\n\nAside form that, it shares all the stupid ♥♥♥♥♥♥♥ problems of the last game.\nYou can't go 5 feet without an encounter, even with evasive maneuvers.\nThe encounter rate is so bad there is a mod that reduces it to 0 when you put the evasive skill on.\n\nI'd have to spend another 5 to 10 hours grinding up levels to beat the end boss fight - that is with a party well over 50. \nTo top it off, you have to follow a specific strat to win, you can't do anything else because it just spams instant death, massive AOEs, and action blockers.\n\nThey some how ♥♥♥♥♥♥ up a perfect opportunity to make an epic battle...instead of giving you an 8 man party they let you swap back and forth.\nThis would be a mind blowing innovation in today's games designed by ♥♥♥♥♥♥♥ still living 30 years ago that for some reason give you 20 ♥♥♥♥♥♥♥ characters but only 4 party slots.\n\nThat is it....no epic 8 party battle vs a god...just swap back and forth between 2 groups of 4.\nIts a crime against humanity how many brain cells I lost witnessing the switching mechanic. Its just so ♥♥♥♥♥♥♥ stupid.\n\nJust give us a ♥♥♥♥♥♥♥ 8 party battle with all of them getting turns.....jesus ♥♥♥♥♥♥♥ christ its really not that hard.\n\n\nDon't by this unless its on a mega sale. The game was mostly boring and tedious.\nAnd fuck the retarded mouthbreathers with low standards giving me jeser icons.\n\nYou dumbasses are why we're getting charged over $60 for games and getting garbage. Get better standards you basement dwellers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game can randomly delete all of your save data at any time (this bug has been in the game since release and still hasnt been fixed lmao)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, it's just so meh. \r\nThe thing is from the onlooks you know \"story\" is going to be the major focus in this rpg. Eight characters, each with their own vingette(s), ect ect. The problem is after playing through about a dozen different segments there's just nothing remarkable or twisty going on. I don't want to use the word cliche, obvious is better. Combine that with video game writing and a lack of compelling combat and you'll konk out after 20 or so hours. I just don't really care what's going on with anyone. \r\n\r\nAs for the combat it does this thing where you use BP to boost attacks, and you get 1 per turn. The issue is anything that isn't boosted does terrible damage, so your skills are mostly for breaking shield points using attacks the enemey is vulnerable to. Not bad, okay, a little change up. The issue i had is sometimes a guy is only weak to one attack you have on hand, and you only attack once with it per bp point, so grinding down shield before you can do real damage or waiting for bp to build up turn after turn is irritating. Also magic kinda sucks or i just didn't jack up my character enough, but there is no multi hit spells save one, so using elements to break shields is pointless. \r\n\r\nAll in all there seems to be some niffty combat builds for each character because you get to take 2 classes, but, in the end your fairly limited on what you can be doing, and doesn't really play well past the mid game. Again a lot of \"meh\" going on. So i might plod on another ten hours to beat it, but it really didn't fly off the rails at all the way i had hoped.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "never ending random  encounters every 1 0 seconds and they take 5 + mins each to beat, made me quit.\n\ngraphics are nice and gameplay was smooth.\n\nstory was ok, but dialogue is very 7nireresting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not exactly sure what it is, just doesn't feel smooth or immersive for an RPG. Starts off strong but then turns into traditional grinding.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you really enjoy interactive storybook-style games, you'll probably love this game. But calling it a \"turn-based RPG\" is using the term a bit loosely, IMO. I only managed to get through the first chapter of one of the characters, hoping it would get better, but it never did. It's not terrible IF you know what you're getting and enjoy this type of game.... but if you're expecting something more action-packed with a more original story, this is definitely not it. I honestly don't get what the hype is about.\n\nBAD:\n- Story was generic and boring. Very cliche and unoriginal.\n- Tons of dialogue/text scrolling every few minutes, very little battling.\n\nGOOD:\n- It's pretty, I guess?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Borrowed my friend's ns gamecard to play for 30 ish hours on ns before returning the game card, and decide to try another fresh round on steam. Did not buy this game earlier because I really hate octopath 1, and I would still say I hate octopath 2 for almost the same reasons. \n\nFirst HD2D has still been the game engine I hate the most for modern video games. Graphics looks disgusting and fake, pretending to be retro style but is mixed with weird modern visual effects. Normally for a modern JRPG with a price of 60 USD to present main plots developers need to carefully design the cutscene. With this miserable game engine this step is just skipped and only blurred pixels are presented. The funny thing is those pixels can carry so little information that the only way to put focus on a character is to make the character steps ahead before speaking. I should make it a rule for me that I need to avoid any HD2D games in the future. \n\nSecond the storyline is just a little better than octopath 1, but doing better than a game that probably has the worst story among all the jrpgs I've ever played is not something big. Start playing and immediately feel sleepy when reading those predictive stories copied from templated overused plots that have already been there for ages. Even a gacha game on smart phones can do a better job on making more creative stories. I happened to see someone claims that this whole octopath series is partially inspired by trpg, which makes complete sense because I equally hate trpg.\n\nGame play is also not new at all, basically a weak, cheap, and way less imaginative copy of Asano's own legendary bravely default series. The gameplay is especially awful considering bdff remaster has been released on ns2 and gave me a super sweet 100 hours of gameplay experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For transparency sake, I didn't complete the game. Furthermore, I only say I don't recommend it, because there is no \"Maybe\" option. \nThis has been at the same time one of the best jrpg's i played, and also one of the worst. \n\nI'm going to mainly list the issues i have, but art, sound/music, combat, progression and even the writing itself are all wonderful and i very much like those. \n\nBut...Man, is it weird. \n\nThe whole idea that you have these eight characters, all with their own goals and ambition's, is neat. None of them, bar Partitio, should be travelling together, really. Why is Throné travelling with...say Castti, holding off on her own, VERY URGENT, desires to help some random chick she happen to run into in the Desert for example. \n\nEach Chapter i completed came with...this curve, im gonna call it. I get intrigued, invested and then punched in the face with a brick. \n\nI'm going to use Castti's chapter 2 as an example.\n\n [spoiler]So, you travel to Sai on your quest to recover her Memories. You walk into the Village, a Village at War might i add, and immediately someone yells for help, and Castti being a healer wants to help. All good so far. You go to the field hospital, meet another Apothecary and the Soldier's mean, cold leader guy. Castti helps the other Healer with mending the wounded, then goes to the frontlines. She learns that the \"Enemy\" is injured and goes to help them, which is fair enough and makes sense, and Angy Leader Guy follows her. At this point, I figured we gonna have to fight him. You get to the injured, she yaps to Leader Guy to fetch Water and fire wood, which he declined. Then she yaps again and he is all of a sudden like \"Oh...okay yes i will go grab it.\" HE DOES A FULL 180 ON HIS MINDSET AFTER BEING TOLD TO FETCH WATER AND FIREWOOD! He suddenly comes to realise that War is bad and then turns into an entirely different character that helps everyone. And it's so fucking jarring, because its not given the time to properly unfold. You kill a big bug and then randomly the War is over because the other Leader Guy goes to beg the king and the Chapter is over. The amount of words it took to describe this is about as much dialog as there is in the chapter that drives that plot forward. Maybe you can see my issue here...its fucking rushed, because its one of EIGHT Characters story, and just a chapter in it. This should be an entire act in a game.[/spoiler] \n\nAfter that, you kinda just stand there, open the Map to find the next chapter and \"oh, well its 15 level above my current level, so i guess i do this Characters chapter instead.\" This shattered any immersion i had, any attachment. While it'd be dumb, I wouldn't care if i just grinded out levels and do one of the eight characters Story at a time...except then, for a large chunk of the chapters in each story, I'd be insanely over-leveled which would make the combat trivial. So instead, i dealt with being spoonfed bits and pieces of each story, which aren't exactly connected, with characters that realistically shouldn't be travelling together and instead do their own thing and...I don't know. I'm disappointed. If there was a main plot that would connect these Eight individuals, and their own stories would be their \"Companion quests\" if you will, i'd nothing but praise this game. \n\nIt's still decent, the writing is good to a point where yes, the Chapters are insanely rushed in some cases, but i still fully understand what is going on. I'm just over this cycle of \"Oh i can't wait to see whats next- Never mind, to low level, gotta do someone elses stuff first.\" This Cycle of being immersed in a story to just be ripped out of it. \n\nI know this is a mess to read but in conclusion...it lacks a main plot. Maybe there is one towards the end, maybe there isn't. I don't think I'll find out just yet. I'm over it. Can't believe im saying this but I'd prefer it if there was level scaling. Then i could just do one story after the other. It's like reading eight short stories at the same time, reading a chapter in one, then moving to another and so on all the way through and back to the first one. \n\nIf this doesn't sound bad or annoying to you...BUY IT! ITS GREAT! YOU'LL LOVE IT. For me...sadly, it's to jarring.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "I want to start with saying that the story and gameplay are good, the problem is how the two don't work together and causes jarring discrepancies between the gameplay and the story.\r\n\r\nFrom a gameplay perspective, this is mostly just Bravely Default's gameplay system, turn-based party combat since you'll have a party of 4 for the vast majority of the game unless you're actively trying a challenge run with less party members. As in Bravely Default, the gameplay is pretty good.\r\n\r\nHowever, the story NEVER acknowledges that you're not just one character but a party. Each character's story acts as if the party didn't exist and that that character was alone. This shows in how there's no interaction between the characters during the story and the story even acts as if fights that are happening are 1v1 fights and, outside some fights involving certain characters whose path actions let's them duel NPCs, it's actually a fight between the enemy and your party which is insanely jarring. There are some interactions between party members in the form of party banter, small chats between generally 2 party members which sometimes somewhat relates to the current story but is often just for light hearted fun. There's also a handful of crosspaths, stories involving 2 specific characters, but they're short and there's not a lot of them.\r\n\r\nThen there's also the world building which brings further inconsistencies with some NPCs acting like the world is big and it's a big deal to traverse a continent and even more so to cross the ocean between the 2 continents while the story and sidequests often act like the fast travel instant teleport is cannon. For example, you have a story that tells you an arms shipment is going to happen soon and needs to be stopped, but the place between where you learn of it and the place where the trade is happening are almost at the furthest points on the map they could have potentially been. Then a story that has a character traverse the ocean mostly on a small lake boat while uncounscious while it's supposed to be dangerous to be on the ocean.\r\n\r\nOverall, it seems square enix had a few good small stories and they decided to stuff them together with a world another team created over Bravely Default's gameplay and never bothered trying to make each of these three parts fit coherently together. If you can ignore these inconsistencies, then it's a pretty good game, however, if you care about the game having any semblance of coherence between it's different parts, you're going to have problems with this game.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Hmm, One of those instances where I wish I could rate this out of 10 and not just good or bad, its not a BAD game, it just has a lot of annoying systems and flaws that drove me to frustration too many times to be able to rate it highly. The writing is pretty good, the characters are mostly good, there is a good amount of content, animation and music also good.\nI really didnt ever enjoy the way that the game made me scower the world for item upgrades, many times I far far out levelled an area but was very weak as items were not around, it makes you hunt from town to town to look for the upgrades which are scattered all over the world from different vendors, tedious.\nThe thing that drove me to close the game the most however were the bosses, they simply are not fair in many instances. You can be cruising through a boss then all of a sudden it goes into god mode and kills your party in one or two rounds, ... a puzzle you my say? sure, if I hadnt just spend 10-20 minutes whittling it down with zero issues to be killed almost instantly when it \"gets angry\" at 20% health. Oh, you want me to do it all over again and hope that I can push over the line at the last moment to make it exciting after the first 15 minutes was a cake walk? Come on, that isn't fun, its frustrating and un-realistic. Im most of the way through but these moments are happening more and more, and I am finding it harder and harder to come back to the game in order to finish it.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Gameplay is fun, but the story is so CORNY that it makes progressing the game really unenjoyable.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I would have loved this as a kid, reminds me of the god old days of final fantasy 7. however.....i think i out grew it or something because i feel the repetitiveness of it. Story, random battle, get item of chest that you had no choice in getting...equip it because its better. do it all over again. beautiful JRPG i just thank it lacks variety in play styles.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun at first, but becomes extremely repetitive.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is beautiful and full of interesting ways to interact with the world, its just a shame the bosses are overpowering broken for their levels. if you're a Dark souls fan you'll love the boss fights. if you're a more casual Jrpg fan with only a few hours to spend on it, you'll hate it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game desires a level of mastery from the player that is laudable to ask. Parallel to a souls game almost, you are expected to fail and learn. Every time I've stepped away from a session I've come back better with new strategies to overcome a roadblock the game puts in front of you. I am not the core audience for this game and the last boss proves it handily. Unlike other good hard games, I just feel it refuses to be interesting in the ways that matter to carry me to credits.\r\n\r\nCharacter stories in Octopath Traveler II range from vaguely predictable and insipid anime tropes sprinkled with standout beats that I feel satisfied with taking at face value. I don't believe any character story was bad, just on the whole unable to lift itself above 'just fine.' Cutscene skipping and speed-up options on offer were definitely appreciated. Using each character's special abilities to interact with side quests and garner resources from NPCs were novel at first, but also felt wrote over time. \r\n\r\nBut there's something about this experience that hooks me. I'm making a conscious decision to not jump back in and grind out another thirty hours, and I might jump on that in a few years. Too much of that desire is sunk cost fallacy for my taste.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The boss fights are still ♥♥♥♥♥♥♥ stupid.\nJust had my party turn to stone - no ability to stop it because if they die after being stoned its permanent for the fight and I didn't purchase a specific anti petrification item.\n\nIt completly killed the enjoyment and desire I have to play the game and is the EPITOME until why I waited for this game to be over half off to purchase.\n\nAside form that, it shares all the stupid ♥♥♥♥♥♥♥ problems of the last game.\nYou can't go 5 feet without an encounter, even with evasive maneuvers.\nThe encounter rate is so bad there is a mod that reduces it to 0 when you put the evasive skill on.\n\nI'd have to spend another 5 to 10 hours grinding up levels to beat the end boss fight - that is with a party well over 50. \nTo top it off, you have to follow a specific strat to win, you can't do anything else because it just spams instant death, massive AOEs, and action blockers.\n\nThey some how ♥♥♥♥♥♥ up a perfect opportunity to make an epic battle...instead of giving you an 8 man party they let you swap back and forth.\nThis would be a mind blowing innovation in today's games designed by ♥♥♥♥♥♥♥ still living 30 years ago that for some reason give you 20 ♥♥♥♥♥♥♥ characters but only 4 party slots.\n\nThat is it....no epic 8 party battle vs a god...just swap back and forth between 2 groups of 4.\nIts a crime against humanity how many brain cells I lost witnessing the switching mechanic. Its just so ♥♥♥♥♥♥♥ stupid.\n\nJust give us a ♥♥♥♥♥♥♥ 8 party battle with all of them getting turns.....jesus ♥♥♥♥♥♥♥ christ its really not that hard.\n\n\nDon't by this unless its on a mega sale. The game was mostly boring and tedious.\nAnd fuck the retarded mouthbreathers with low standards giving me jeser icons.\n\nYou dumbasses are why we're getting charged over $60 for games and getting garbage. Get better standards you basement dwellers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game can randomly delete all of your save data at any time (this bug has been in the game since release and still hasnt been fixed lmao)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, it's just so meh. \r\nThe thing is from the onlooks you know \"story\" is going to be the major focus in this rpg. Eight characters, each with their own vingette(s), ect ect. The problem is after playing through about a dozen different segments there's just nothing remarkable or twisty going on. I don't want to use the word cliche, obvious is better. Combine that with video game writing and a lack of compelling combat and you'll konk out after 20 or so hours. I just don't really care what's going on with anyone. \r\n\r\nAs for the combat it does this thing where you use BP to boost attacks, and you get 1 per turn. The issue is anything that isn't boosted does terrible damage, so your skills are mostly for breaking shield points using attacks the enemey is vulnerable to. Not bad, okay, a little change up. The issue i had is sometimes a guy is only weak to one attack you have on hand, and you only attack once with it per bp point, so grinding down shield before you can do real damage or waiting for bp to build up turn after turn is irritating. Also magic kinda sucks or i just didn't jack up my character enough, but there is no multi hit spells save one, so using elements to break shields is pointless. \r\n\r\nAll in all there seems to be some niffty combat builds for each character because you get to take 2 classes, but, in the end your fairly limited on what you can be doing, and doesn't really play well past the mid game. Again a lot of \"meh\" going on. So i might plod on another ten hours to beat it, but it really didn't fly off the rails at all the way i had hoped.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "never ending random  encounters every 1 0 seconds and they take 5 + mins each to beat, made me quit.\n\ngraphics are nice and gameplay was smooth.\n\nstory was ok, but dialogue is very 7nireresting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not exactly sure what it is, just doesn't feel smooth or immersive for an RPG. Starts off strong but then turns into traditional grinding.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you really enjoy interactive storybook-style games, you'll probably love this game. But calling it a \"turn-based RPG\" is using the term a bit loosely, IMO. I only managed to get through the first chapter of one of the characters, hoping it would get better, but it never did. It's not terrible IF you know what you're getting and enjoy this type of game.... but if you're expecting something more action-packed with a more original story, this is definitely not it. I honestly don't get what the hype is about.\n\nBAD:\n- Story was generic and boring. Very cliche and unoriginal.\n- Tons of dialogue/text scrolling every few minutes, very little battling.\n\nGOOD:\n- It's pretty, I guess?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Borrowed my friend's ns gamecard to play for 30 ish hours on ns before returning the game card, and decide to try another fresh round on steam. Did not buy this game earlier because I really hate octopath 1, and I would still say I hate octopath 2 for almost the same reasons. \n\nFirst HD2D has still been the game engine I hate the most for modern video games. Graphics looks disgusting and fake, pretending to be retro style but is mixed with weird modern visual effects. Normally for a modern JRPG with a price of 60 USD to present main plots developers need to carefully design the cutscene. With this miserable game engine this step is just skipped and only blurred pixels are presented. The funny thing is those pixels can carry so little information that the only way to put focus on a character is to make the character steps ahead before speaking. I should make it a rule for me that I need to avoid any HD2D games in the future. \n\nSecond the storyline is just a little better than octopath 1, but doing better than a game that probably has the worst story among all the jrpgs I've ever played is not something big. Start playing and immediately feel sleepy when reading those predictive stories copied from templated overused plots that have already been there for ages. Even a gacha game on smart phones can do a better job on making more creative stories. I happened to see someone claims that this whole octopath series is partially inspired by trpg, which makes complete sense because I equally hate trpg.\n\nGame play is also not new at all, basically a weak, cheap, and way less imaginative copy of Asano's own legendary bravely default series. The gameplay is especially awful considering bdff remaster has been released on ns2 and gave me a super sweet 100 hours of gameplay experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For transparency sake, I didn't complete the game. Furthermore, I only say I don't recommend it, because there is no \"Maybe\" option. \nThis has been at the same time one of the best jrpg's i played, and also one of the worst. \n\nI'm going to mainly list the issues i have, but art, sound/music, combat, progression and even the writing itself are all wonderful and i very much like those. \n\nBut...Man, is it weird. \n\nThe whole idea that you have these eight characters, all with their own goals and ambition's, is neat. None of them, bar Partitio, should be travelling together, really. Why is Throné travelling with...say Castti, holding off on her own, VERY URGENT, desires to help some random chick she happen to run into in the Desert for example. \n\nEach Chapter i completed came with...this curve, im gonna call it. I get intrigued, invested and then punched in the face with a brick. \n\nI'm going to use Castti's chapter 2 as an example.\n\n [spoiler]So, you travel to Sai on your quest to recover her Memories. You walk into the Village, a Village at War might i add, and immediately someone yells for help, and Castti being a healer wants to help. All good so far. You go to the field hospital, meet another Apothecary and the Soldier's mean, cold leader guy. Castti helps the other Healer with mending the wounded, then goes to the frontlines. She learns that the \"Enemy\" is injured and goes to help them, which is fair enough and makes sense, and Angy Leader Guy follows her. At this point, I figured we gonna have to fight him. You get to the injured, she yaps to Leader Guy to fetch Water and fire wood, which he declined. Then she yaps again and he is all of a sudden like \"Oh...okay yes i will go grab it.\" HE DOES A FULL 180 ON HIS MINDSET AFTER BEING TOLD TO FETCH WATER AND FIREWOOD! He suddenly comes to realise that War is bad and then turns into an entirely different character that helps everyone. And it's so fucking jarring, because its not given the time to properly unfold. You kill a big bug and then randomly the War is over because the other Leader Guy goes to beg the king and the Chapter is over. The amount of words it took to describe this is about as much dialog as there is in the chapter that drives that plot forward. Maybe you can see my issue here...its fucking rushed, because its one of EIGHT Characters story, and just a chapter in it. This should be an entire act in a game.[/spoiler] \n\nAfter that, you kinda just stand there, open the Map to find the next chapter and \"oh, well its 15 level above my current level, so i guess i do this Characters chapter instead.\" This shattered any immersion i had, any attachment. While it'd be dumb, I wouldn't care if i just grinded out levels and do one of the eight characters Story at a time...except then, for a large chunk of the chapters in each story, I'd be insanely over-leveled which would make the combat trivial. So instead, i dealt with being spoonfed bits and pieces of each story, which aren't exactly connected, with characters that realistically shouldn't be travelling together and instead do their own thing and...I don't know. I'm disappointed. If there was a main plot that would connect these Eight individuals, and their own stories would be their \"Companion quests\" if you will, i'd nothing but praise this game. \n\nIt's still decent, the writing is good to a point where yes, the Chapters are insanely rushed in some cases, but i still fully understand what is going on. I'm just over this cycle of \"Oh i can't wait to see whats next- Never mind, to low level, gotta do someone elses stuff first.\" This Cycle of being immersed in a story to just be ripped out of it. \n\nI know this is a mess to read but in conclusion...it lacks a main plot. Maybe there is one towards the end, maybe there isn't. I don't think I'll find out just yet. I'm over it. Can't believe im saying this but I'd prefer it if there was level scaling. Then i could just do one story after the other. It's like reading eight short stories at the same time, reading a chapter in one, then moving to another and so on all the way through and back to the first one. \n\nIf this doesn't sound bad or annoying to you...BUY IT! ITS GREAT! YOU'LL LOVE IT. For me...sadly, it's to jarring.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "I want to start with saying that the story and gameplay are good, the problem is how the two don't work together and causes jarring discrepancies between the gameplay and the story.\r\n\r\nFrom a gameplay perspective, this is mostly just Bravely Default's gameplay system, turn-based party combat since you'll have a party of 4 for the vast majority of the game unless you're actively trying a challenge run with less party members. As in Bravely Default, the gameplay is pretty good.\r\n\r\nHowever, the story NEVER acknowledges that you're not just one character but a party. Each character's story acts as if the party didn't exist and that that character was alone. This shows in how there's no interaction between the characters during the story and the story even acts as if fights that are happening are 1v1 fights and, outside some fights involving certain characters whose path actions let's them duel NPCs, it's actually a fight between the enemy and your party which is insanely jarring. There are some interactions between party members in the form of party banter, small chats between generally 2 party members which sometimes somewhat relates to the current story but is often just for light hearted fun. There's also a handful of crosspaths, stories involving 2 specific characters, but they're short and there's not a lot of them.\r\n\r\nThen there's also the world building which brings further inconsistencies with some NPCs acting like the world is big and it's a big deal to traverse a continent and even more so to cross the ocean between the 2 continents while the story and sidequests often act like the fast travel instant teleport is cannon. For example, you have a story that tells you an arms shipment is going to happen soon and needs to be stopped, but the place between where you learn of it and the place where the trade is happening are almost at the furthest points on the map they could have potentially been. Then a story that has a character traverse the ocean mostly on a small lake boat while uncounscious while it's supposed to be dangerous to be on the ocean.\r\n\r\nOverall, it seems square enix had a few good small stories and they decided to stuff them together with a world another team created over Bravely Default's gameplay and never bothered trying to make each of these three parts fit coherently together. If you can ignore these inconsistencies, then it's a pretty good game, however, if you care about the game having any semblance of coherence between it's different parts, you're going to have problems with this game.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Hmm, One of those instances where I wish I could rate this out of 10 and not just good or bad, its not a BAD game, it just has a lot of annoying systems and flaws that drove me to frustration too many times to be able to rate it highly. The writing is pretty good, the characters are mostly good, there is a good amount of content, animation and music also good.\nI really didnt ever enjoy the way that the game made me scower the world for item upgrades, many times I far far out levelled an area but was very weak as items were not around, it makes you hunt from town to town to look for the upgrades which are scattered all over the world from different vendors, tedious.\nThe thing that drove me to close the game the most however were the bosses, they simply are not fair in many instances. You can be cruising through a boss then all of a sudden it goes into god mode and kills your party in one or two rounds, ... a puzzle you my say? sure, if I hadnt just spend 10-20 minutes whittling it down with zero issues to be killed almost instantly when it \"gets angry\" at 20% health. Oh, you want me to do it all over again and hope that I can push over the line at the last moment to make it exciting after the first 15 minutes was a cake walk? Come on, that isn't fun, its frustrating and un-realistic. Im most of the way through but these moments are happening more and more, and I am finding it harder and harder to come back to the game in order to finish it.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Gameplay is fun, but the story is so CORNY that it makes progressing the game really unenjoyable.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I would have loved this as a kid, reminds me of the god old days of final fantasy 7. however.....i think i out grew it or something because i feel the repetitiveness of it. Story, random battle, get item of chest that you had no choice in getting...equip it because its better. do it all over again. beautiful JRPG i just thank it lacks variety in play styles.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun at first, but becomes extremely repetitive.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is beautiful and full of interesting ways to interact with the world, its just a shame the bosses are overpowering broken for their levels. if you're a Dark souls fan you'll love the boss fights. if you're a more casual Jrpg fan with only a few hours to spend on it, you'll hate it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game desires a level of mastery from the player that is laudable to ask. Parallel to a souls game almost, you are expected to fail and learn. Every time I've stepped away from a session I've come back better with new strategies to overcome a roadblock the game puts in front of you. I am not the core audience for this game and the last boss proves it handily. Unlike other good hard games, I just feel it refuses to be interesting in the ways that matter to carry me to credits.\r\n\r\nCharacter stories in Octopath Traveler II range from vaguely predictable and insipid anime tropes sprinkled with standout beats that I feel satisfied with taking at face value. I don't believe any character story was bad, just on the whole unable to lift itself above 'just fine.' Cutscene skipping and speed-up options on offer were definitely appreciated. Using each character's special abilities to interact with side quests and garner resources from NPCs were novel at first, but also felt wrote over time. \r\n\r\nBut there's something about this experience that hooks me. I'm making a conscious decision to not jump back in and grind out another thirty hours, and I might jump on that in a few years. Too much of that desire is sunk cost fallacy for my taste.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The boss fights are still ♥♥♥♥♥♥♥ stupid.\nJust had my party turn to stone - no ability to stop it because if they die after being stoned its permanent for the fight and I didn't purchase a specific anti petrification item.\n\nIt completly killed the enjoyment and desire I have to play the game and is the EPITOME until why I waited for this game to be over half off to purchase.\n\nAside form that, it shares all the stupid ♥♥♥♥♥♥♥ problems of the last game.\nYou can't go 5 feet without an encounter, even with evasive maneuvers.\nThe encounter rate is so bad there is a mod that reduces it to 0 when you put the evasive skill on.\n\nI'd have to spend another 5 to 10 hours grinding up levels to beat the end boss fight - that is with a party well over 50. \nTo top it off, you have to follow a specific strat to win, you can't do anything else because it just spams instant death, massive AOEs, and action blockers.\n\nThey some how ♥♥♥♥♥♥ up a perfect opportunity to make an epic battle...instead of giving you an 8 man party they let you swap back and forth.\nThis would be a mind blowing innovation in today's games designed by ♥♥♥♥♥♥♥ still living 30 years ago that for some reason give you 20 ♥♥♥♥♥♥♥ characters but only 4 party slots.\n\nThat is it....no epic 8 party battle vs a god...just swap back and forth between 2 groups of 4.\nIts a crime against humanity how many brain cells I lost witnessing the switching mechanic. Its just so ♥♥♥♥♥♥♥ stupid.\n\nJust give us a ♥♥♥♥♥♥♥ 8 party battle with all of them getting turns.....jesus ♥♥♥♥♥♥♥ christ its really not that hard.\n\n\nDon't by this unless its on a mega sale. The game was mostly boring and tedious.\nAnd fuck the retarded mouthbreathers with low standards giving me jeser icons.\n\nYou dumbasses are why we're getting charged over $60 for games and getting garbage. Get better standards you basement dwellers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game can randomly delete all of your save data at any time (this bug has been in the game since release and still hasnt been fixed lmao)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, it's just so meh. \r\nThe thing is from the onlooks you know \"story\" is going to be the major focus in this rpg. Eight characters, each with their own vingette(s), ect ect. The problem is after playing through about a dozen different segments there's just nothing remarkable or twisty going on. I don't want to use the word cliche, obvious is better. Combine that with video game writing and a lack of compelling combat and you'll konk out after 20 or so hours. I just don't really care what's going on with anyone. \r\n\r\nAs for the combat it does this thing where you use BP to boost attacks, and you get 1 per turn. The issue is anything that isn't boosted does terrible damage, so your skills are mostly for breaking shield points using attacks the enemey is vulnerable to. Not bad, okay, a little change up. The issue i had is sometimes a guy is only weak to one attack you have on hand, and you only attack once with it per bp point, so grinding down shield before you can do real damage or waiting for bp to build up turn after turn is irritating. Also magic kinda sucks or i just didn't jack up my character enough, but there is no multi hit spells save one, so using elements to break shields is pointless. \r\n\r\nAll in all there seems to be some niffty combat builds for each character because you get to take 2 classes, but, in the end your fairly limited on what you can be doing, and doesn't really play well past the mid game. Again a lot of \"meh\" going on. So i might plod on another ten hours to beat it, but it really didn't fly off the rails at all the way i had hoped.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "never ending random  encounters every 1 0 seconds and they take 5 + mins each to beat, made me quit.\n\ngraphics are nice and gameplay was smooth.\n\nstory was ok, but dialogue is very 7nireresting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not exactly sure what it is, just doesn't feel smooth or immersive for an RPG. Starts off strong but then turns into traditional grinding.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you really enjoy interactive storybook-style games, you'll probably love this game. But calling it a \"turn-based RPG\" is using the term a bit loosely, IMO. I only managed to get through the first chapter of one of the characters, hoping it would get better, but it never did. It's not terrible IF you know what you're getting and enjoy this type of game.... but if you're expecting something more action-packed with a more original story, this is definitely not it. I honestly don't get what the hype is about.\n\nBAD:\n- Story was generic and boring. Very cliche and unoriginal.\n- Tons of dialogue/text scrolling every few minutes, very little battling.\n\nGOOD:\n- It's pretty, I guess?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Borrowed my friend's ns gamecard to play for 30 ish hours on ns before returning the game card, and decide to try another fresh round on steam. Did not buy this game earlier because I really hate octopath 1, and I would still say I hate octopath 2 for almost the same reasons. \n\nFirst HD2D has still been the game engine I hate the most for modern video games. Graphics looks disgusting and fake, pretending to be retro style but is mixed with weird modern visual effects. Normally for a modern JRPG with a price of 60 USD to present main plots developers need to carefully design the cutscene. With this miserable game engine this step is just skipped and only blurred pixels are presented. The funny thing is those pixels can carry so little information that the only way to put focus on a character is to make the character steps ahead before speaking. I should make it a rule for me that I need to avoid any HD2D games in the future. \n\nSecond the storyline is just a little better than octopath 1, but doing better than a game that probably has the worst story among all the jrpgs I've ever played is not something big. Start playing and immediately feel sleepy when reading those predictive stories copied from templated overused plots that have already been there for ages. Even a gacha game on smart phones can do a better job on making more creative stories. I happened to see someone claims that this whole octopath series is partially inspired by trpg, which makes complete sense because I equally hate trpg.\n\nGame play is also not new at all, basically a weak, cheap, and way less imaginative copy of Asano's own legendary bravely default series. The gameplay is especially awful considering bdff remaster has been released on ns2 and gave me a super sweet 100 hours of gameplay experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For transparency sake, I didn't complete the game. Furthermore, I only say I don't recommend it, because there is no \"Maybe\" option. \nThis has been at the same time one of the best jrpg's i played, and also one of the worst. \n\nI'm going to mainly list the issues i have, but art, sound/music, combat, progression and even the writing itself are all wonderful and i very much like those. \n\nBut...Man, is it weird. \n\nThe whole idea that you have these eight characters, all with their own goals and ambition's, is neat. None of them, bar Partitio, should be travelling together, really. Why is Throné travelling with...say Castti, holding off on her own, VERY URGENT, desires to help some random chick she happen to run into in the Desert for example. \n\nEach Chapter i completed came with...this curve, im gonna call it. I get intrigued, invested and then punched in the face with a brick. \n\nI'm going to use Castti's chapter 2 as an example.\n\n [spoiler]So, you travel to Sai on your quest to recover her Memories. You walk into the Village, a Village at War might i add, and immediately someone yells for help, and Castti being a healer wants to help. All good so far. You go to the field hospital, meet another Apothecary and the Soldier's mean, cold leader guy. Castti helps the other Healer with mending the wounded, then goes to the frontlines. She learns that the \"Enemy\" is injured and goes to help them, which is fair enough and makes sense, and Angy Leader Guy follows her. At this point, I figured we gonna have to fight him. You get to the injured, she yaps to Leader Guy to fetch Water and fire wood, which he declined. Then she yaps again and he is all of a sudden like \"Oh...okay yes i will go grab it.\" HE DOES A FULL 180 ON HIS MINDSET AFTER BEING TOLD TO FETCH WATER AND FIREWOOD! He suddenly comes to realise that War is bad and then turns into an entirely different character that helps everyone. And it's so fucking jarring, because its not given the time to properly unfold. You kill a big bug and then randomly the War is over because the other Leader Guy goes to beg the king and the Chapter is over. The amount of words it took to describe this is about as much dialog as there is in the chapter that drives that plot forward. Maybe you can see my issue here...its fucking rushed, because its one of EIGHT Characters story, and just a chapter in it. This should be an entire act in a game.[/spoiler] \n\nAfter that, you kinda just stand there, open the Map to find the next chapter and \"oh, well its 15 level above my current level, so i guess i do this Characters chapter instead.\" This shattered any immersion i had, any attachment. While it'd be dumb, I wouldn't care if i just grinded out levels and do one of the eight characters Story at a time...except then, for a large chunk of the chapters in each story, I'd be insanely over-leveled which would make the combat trivial. So instead, i dealt with being spoonfed bits and pieces of each story, which aren't exactly connected, with characters that realistically shouldn't be travelling together and instead do their own thing and...I don't know. I'm disappointed. If there was a main plot that would connect these Eight individuals, and their own stories would be their \"Companion quests\" if you will, i'd nothing but praise this game. \n\nIt's still decent, the writing is good to a point where yes, the Chapters are insanely rushed in some cases, but i still fully understand what is going on. I'm just over this cycle of \"Oh i can't wait to see whats next- Never mind, to low level, gotta do someone elses stuff first.\" This Cycle of being immersed in a story to just be ripped out of it. \n\nI know this is a mess to read but in conclusion...it lacks a main plot. Maybe there is one towards the end, maybe there isn't. I don't think I'll find out just yet. I'm over it. Can't believe im saying this but I'd prefer it if there was level scaling. Then i could just do one story after the other. It's like reading eight short stories at the same time, reading a chapter in one, then moving to another and so on all the way through and back to the first one. \n\nIf this doesn't sound bad or annoying to you...BUY IT! ITS GREAT! YOU'LL LOVE IT. For me...sadly, it's to jarring.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "I want to start with saying that the story and gameplay are good, the problem is how the two don't work together and causes jarring discrepancies between the gameplay and the story.\r\n\r\nFrom a gameplay perspective, this is mostly just Bravely Default's gameplay system, turn-based party combat since you'll have a party of 4 for the vast majority of the game unless you're actively trying a challenge run with less party members. As in Bravely Default, the gameplay is pretty good.\r\n\r\nHowever, the story NEVER acknowledges that you're not just one character but a party. Each character's story acts as if the party didn't exist and that that character was alone. This shows in how there's no interaction between the characters during the story and the story even acts as if fights that are happening are 1v1 fights and, outside some fights involving certain characters whose path actions let's them duel NPCs, it's actually a fight between the enemy and your party which is insanely jarring. There are some interactions between party members in the form of party banter, small chats between generally 2 party members which sometimes somewhat relates to the current story but is often just for light hearted fun. There's also a handful of crosspaths, stories involving 2 specific characters, but they're short and there's not a lot of them.\r\n\r\nThen there's also the world building which brings further inconsistencies with some NPCs acting like the world is big and it's a big deal to traverse a continent and even more so to cross the ocean between the 2 continents while the story and sidequests often act like the fast travel instant teleport is cannon. For example, you have a story that tells you an arms shipment is going to happen soon and needs to be stopped, but the place between where you learn of it and the place where the trade is happening are almost at the furthest points on the map they could have potentially been. Then a story that has a character traverse the ocean mostly on a small lake boat while uncounscious while it's supposed to be dangerous to be on the ocean.\r\n\r\nOverall, it seems square enix had a few good small stories and they decided to stuff them together with a world another team created over Bravely Default's gameplay and never bothered trying to make each of these three parts fit coherently together. If you can ignore these inconsistencies, then it's a pretty good game, however, if you care about the game having any semblance of coherence between it's different parts, you're going to have problems with this game.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Hmm, One of those instances where I wish I could rate this out of 10 and not just good or bad, its not a BAD game, it just has a lot of annoying systems and flaws that drove me to frustration too many times to be able to rate it highly. The writing is pretty good, the characters are mostly good, there is a good amount of content, animation and music also good.\nI really didnt ever enjoy the way that the game made me scower the world for item upgrades, many times I far far out levelled an area but was very weak as items were not around, it makes you hunt from town to town to look for the upgrades which are scattered all over the world from different vendors, tedious.\nThe thing that drove me to close the game the most however were the bosses, they simply are not fair in many instances. You can be cruising through a boss then all of a sudden it goes into god mode and kills your party in one or two rounds, ... a puzzle you my say? sure, if I hadnt just spend 10-20 minutes whittling it down with zero issues to be killed almost instantly when it \"gets angry\" at 20% health. Oh, you want me to do it all over again and hope that I can push over the line at the last moment to make it exciting after the first 15 minutes was a cake walk? Come on, that isn't fun, its frustrating and un-realistic. Im most of the way through but these moments are happening more and more, and I am finding it harder and harder to come back to the game in order to finish it.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Gameplay is fun, but the story is so CORNY that it makes progressing the game really unenjoyable.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I would have loved this as a kid, reminds me of the god old days of final fantasy 7. however.....i think i out grew it or something because i feel the repetitiveness of it. Story, random battle, get item of chest that you had no choice in getting...equip it because its better. do it all over again. beautiful JRPG i just thank it lacks variety in play styles.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun at first, but becomes extremely repetitive.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is beautiful and full of interesting ways to interact with the world, its just a shame the bosses are overpowering broken for their levels. if you're a Dark souls fan you'll love the boss fights. if you're a more casual Jrpg fan with only a few hours to spend on it, you'll hate it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game desires a level of mastery from the player that is laudable to ask. Parallel to a souls game almost, you are expected to fail and learn. Every time I've stepped away from a session I've come back better with new strategies to overcome a roadblock the game puts in front of you. I am not the core audience for this game and the last boss proves it handily. Unlike other good hard games, I just feel it refuses to be interesting in the ways that matter to carry me to credits.\r\n\r\nCharacter stories in Octopath Traveler II range from vaguely predictable and insipid anime tropes sprinkled with standout beats that I feel satisfied with taking at face value. I don't believe any character story was bad, just on the whole unable to lift itself above 'just fine.' Cutscene skipping and speed-up options on offer were definitely appreciated. Using each character's special abilities to interact with side quests and garner resources from NPCs were novel at first, but also felt wrote over time. \r\n\r\nBut there's something about this experience that hooks me. I'm making a conscious decision to not jump back in and grind out another thirty hours, and I might jump on that in a few years. Too much of that desire is sunk cost fallacy for my taste.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The boss fights are still ♥♥♥♥♥♥♥ stupid.\nJust had my party turn to stone - no ability to stop it because if they die after being stoned its permanent for the fight and I didn't purchase a specific anti petrification item.\n\nIt completly killed the enjoyment and desire I have to play the game and is the EPITOME until why I waited for this game to be over half off to purchase.\n\nAside form that, it shares all the stupid ♥♥♥♥♥♥♥ problems of the last game.\nYou can't go 5 feet without an encounter, even with evasive maneuvers.\nThe encounter rate is so bad there is a mod that reduces it to 0 when you put the evasive skill on.\n\nI'd have to spend another 5 to 10 hours grinding up levels to beat the end boss fight - that is with a party well over 50. \nTo top it off, you have to follow a specific strat to win, you can't do anything else because it just spams instant death, massive AOEs, and action blockers.\n\nThey some how ♥♥♥♥♥♥ up a perfect opportunity to make an epic battle...instead of giving you an 8 man party they let you swap back and forth.\nThis would be a mind blowing innovation in today's games designed by ♥♥♥♥♥♥♥ still living 30 years ago that for some reason give you 20 ♥♥♥♥♥♥♥ characters but only 4 party slots.\n\nThat is it....no epic 8 party battle vs a god...just swap back and forth between 2 groups of 4.\nIts a crime against humanity how many brain cells I lost witnessing the switching mechanic. Its just so ♥♥♥♥♥♥♥ stupid.\n\nJust give us a ♥♥♥♥♥♥♥ 8 party battle with all of them getting turns.....jesus ♥♥♥♥♥♥♥ christ its really not that hard.\n\n\nDon't by this unless its on a mega sale. The game was mostly boring and tedious.\nAnd fuck the retarded mouthbreathers with low standards giving me jeser icons.\n\nYou dumbasses are why we're getting charged over $60 for games and getting garbage. Get better standards you basement dwellers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game can randomly delete all of your save data at any time (this bug has been in the game since release and still hasnt been fixed lmao)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, it's just so meh. \r\nThe thing is from the onlooks you know \"story\" is going to be the major focus in this rpg. Eight characters, each with their own vingette(s), ect ect. The problem is after playing through about a dozen different segments there's just nothing remarkable or twisty going on. I don't want to use the word cliche, obvious is better. Combine that with video game writing and a lack of compelling combat and you'll konk out after 20 or so hours. I just don't really care what's going on with anyone. \r\n\r\nAs for the combat it does this thing where you use BP to boost attacks, and you get 1 per turn. The issue is anything that isn't boosted does terrible damage, so your skills are mostly for breaking shield points using attacks the enemey is vulnerable to. Not bad, okay, a little change up. The issue i had is sometimes a guy is only weak to one attack you have on hand, and you only attack once with it per bp point, so grinding down shield before you can do real damage or waiting for bp to build up turn after turn is irritating. Also magic kinda sucks or i just didn't jack up my character enough, but there is no multi hit spells save one, so using elements to break shields is pointless. \r\n\r\nAll in all there seems to be some niffty combat builds for each character because you get to take 2 classes, but, in the end your fairly limited on what you can be doing, and doesn't really play well past the mid game. Again a lot of \"meh\" going on. So i might plod on another ten hours to beat it, but it really didn't fly off the rails at all the way i had hoped.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "never ending random  encounters every 1 0 seconds and they take 5 + mins each to beat, made me quit.\n\ngraphics are nice and gameplay was smooth.\n\nstory was ok, but dialogue is very 7nireresting.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Not exactly sure what it is, just doesn't feel smooth or immersive for an RPG. Starts off strong but then turns into traditional grinding.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you really enjoy interactive storybook-style games, you'll probably love this game. But calling it a \"turn-based RPG\" is using the term a bit loosely, IMO. I only managed to get through the first chapter of one of the characters, hoping it would get better, but it never did. It's not terrible IF you know what you're getting and enjoy this type of game.... but if you're expecting something more action-packed with a more original story, this is definitely not it. I honestly don't get what the hype is about.\n\nBAD:\n- Story was generic and boring. Very cliche and unoriginal.\n- Tons of dialogue/text scrolling every few minutes, very little battling.\n\nGOOD:\n- It's pretty, I guess?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Borrowed my friend's ns gamecard to play for 30 ish hours on ns before returning the game card, and decide to try another fresh round on steam. Did not buy this game earlier because I really hate octopath 1, and I would still say I hate octopath 2 for almost the same reasons. \n\nFirst HD2D has still been the game engine I hate the most for modern video games. Graphics looks disgusting and fake, pretending to be retro style but is mixed with weird modern visual effects. Normally for a modern JRPG with a price of 60 USD to present main plots developers need to carefully design the cutscene. With this miserable game engine this step is just skipped and only blurred pixels are presented. The funny thing is those pixels can carry so little information that the only way to put focus on a character is to make the character steps ahead before speaking. I should make it a rule for me that I need to avoid any HD2D games in the future. \n\nSecond the storyline is just a little better than octopath 1, but doing better than a game that probably has the worst story among all the jrpgs I've ever played is not something big. Start playing and immediately feel sleepy when reading those predictive stories copied from templated overused plots that have already been there for ages. Even a gacha game on smart phones can do a better job on making more creative stories. I happened to see someone claims that this whole octopath series is partially inspired by trpg, which makes complete sense because I equally hate trpg.\n\nGame play is also not new at all, basically a weak, cheap, and way less imaginative copy of Asano's own legendary bravely default series. The gameplay is especially awful considering bdff remaster has been released on ns2 and gave me a super sweet 100 hours of gameplay experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For transparency sake, I didn't complete the game. Furthermore, I only say I don't recommend it, because there is no \"Maybe\" option. \nThis has been at the same time one of the best jrpg's i played, and also one of the worst. \n\nI'm going to mainly list the issues i have, but art, sound/music, combat, progression and even the writing itself are all wonderful and i very much like those. \n\nBut...Man, is it weird. \n\nThe whole idea that you have these eight characters, all with their own goals and ambition's, is neat. None of them, bar Partitio, should be travelling together, really. Why is Throné travelling with...say Castti, holding off on her own, VERY URGENT, desires to help some random chick she happen to run into in the Desert for example. \n\nEach Chapter i completed came with...this curve, im gonna call it. I get intrigued, invested and then punched in the face with a brick. \n\nI'm going to use Castti's chapter 2 as an example.\n\n [spoiler]So, you travel to Sai on your quest to recover her Memories. You walk into the Village, a Village at War might i add, and immediately someone yells for help, and Castti being a healer wants to help. All good so far. You go to the field hospital, meet another Apothecary and the Soldier's mean, cold leader guy. Castti helps the other Healer with mending the wounded, then goes to the frontlines. She learns that the \"Enemy\" is injured and goes to help them, which is fair enough and makes sense, and Angy Leader Guy follows her. At this point, I figured we gonna have to fight him. You get to the injured, she yaps to Leader Guy to fetch Water and fire wood, which he declined. Then she yaps again and he is all of a sudden like \"Oh...okay yes i will go grab it.\" HE DOES A FULL 180 ON HIS MINDSET AFTER BEING TOLD TO FETCH WATER AND FIREWOOD! He suddenly comes to realise that War is bad and then turns into an entirely different character that helps everyone. And it's so fucking jarring, because its not given the time to properly unfold. You kill a big bug and then randomly the War is over because the other Leader Guy goes to beg the king and the Chapter is over. The amount of words it took to describe this is about as much dialog as there is in the chapter that drives that plot forward. Maybe you can see my issue here...its fucking rushed, because its one of EIGHT Characters story, and just a chapter in it. This should be an entire act in a game.[/spoiler] \n\nAfter that, you kinda just stand there, open the Map to find the next chapter and \"oh, well its 15 level above my current level, so i guess i do this Characters chapter instead.\" This shattered any immersion i had, any attachment. While it'd be dumb, I wouldn't care if i just grinded out levels and do one of the eight characters Story at a time...except then, for a large chunk of the chapters in each story, I'd be insanely over-leveled which would make the combat trivial. So instead, i dealt with being spoonfed bits and pieces of each story, which aren't exactly connected, with characters that realistically shouldn't be travelling together and instead do their own thing and...I don't know. I'm disappointed. If there was a main plot that would connect these Eight individuals, and their own stories would be their \"Companion quests\" if you will, i'd nothing but praise this game. \n\nIt's still decent, the writing is good to a point where yes, the Chapters are insanely rushed in some cases, but i still fully understand what is going on. I'm just over this cycle of \"Oh i can't wait to see whats next- Never mind, to low level, gotta do someone elses stuff first.\" This Cycle of being immersed in a story to just be ripped out of it. \n\nI know this is a mess to read but in conclusion...it lacks a main plot. Maybe there is one towards the end, maybe there isn't. I don't think I'll find out just yet. I'm over it. Can't believe im saying this but I'd prefer it if there was level scaling. Then i could just do one story after the other. It's like reading eight short stories at the same time, reading a chapter in one, then moving to another and so on all the way through and back to the first one. \n\nIf this doesn't sound bad or annoying to you...BUY IT! ITS GREAT! YOU'LL LOVE IT. For me...sadly, it's to jarring.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "I want to start with saying that the story and gameplay are good, the problem is how the two don't work together and causes jarring discrepancies between the gameplay and the story.\r\n\r\nFrom a gameplay perspective, this is mostly just Bravely Default's gameplay system, turn-based party combat since you'll have a party of 4 for the vast majority of the game unless you're actively trying a challenge run with less party members. As in Bravely Default, the gameplay is pretty good.\r\n\r\nHowever, the story NEVER acknowledges that you're not just one character but a party. Each character's story acts as if the party didn't exist and that that character was alone. This shows in how there's no interaction between the characters during the story and the story even acts as if fights that are happening are 1v1 fights and, outside some fights involving certain characters whose path actions let's them duel NPCs, it's actually a fight between the enemy and your party which is insanely jarring. There are some interactions between party members in the form of party banter, small chats between generally 2 party members which sometimes somewhat relates to the current story but is often just for light hearted fun. There's also a handful of crosspaths, stories involving 2 specific characters, but they're short and there's not a lot of them.\r\n\r\nThen there's also the world building which brings further inconsistencies with some NPCs acting like the world is big and it's a big deal to traverse a continent and even more so to cross the ocean between the 2 continents while the story and sidequests often act like the fast travel instant teleport is cannon. For example, you have a story that tells you an arms shipment is going to happen soon and needs to be stopped, but the place between where you learn of it and the place where the trade is happening are almost at the furthest points on the map they could have potentially been. Then a story that has a character traverse the ocean mostly on a small lake boat while uncounscious while it's supposed to be dangerous to be on the ocean.\r\n\r\nOverall, it seems square enix had a few good small stories and they decided to stuff them together with a world another team created over Bravely Default's gameplay and never bothered trying to make each of these three parts fit coherently together. If you can ignore these inconsistencies, then it's a pretty good game, however, if you care about the game having any semblance of coherence between it's different parts, you're going to have problems with this game.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Hmm, One of those instances where I wish I could rate this out of 10 and not just good or bad, its not a BAD game, it just has a lot of annoying systems and flaws that drove me to frustration too many times to be able to rate it highly. The writing is pretty good, the characters are mostly good, there is a good amount of content, animation and music also good.\nI really didnt ever enjoy the way that the game made me scower the world for item upgrades, many times I far far out levelled an area but was very weak as items were not around, it makes you hunt from town to town to look for the upgrades which are scattered all over the world from different vendors, tedious.\nThe thing that drove me to close the game the most however were the bosses, they simply are not fair in many instances. You can be cruising through a boss then all of a sudden it goes into god mode and kills your party in one or two rounds, ... a puzzle you my say? sure, if I hadnt just spend 10-20 minutes whittling it down with zero issues to be killed almost instantly when it \"gets angry\" at 20% health. Oh, you want me to do it all over again and hope that I can push over the line at the last moment to make it exciting after the first 15 minutes was a cake walk? Come on, that isn't fun, its frustrating and un-realistic. Im most of the way through but these moments are happening more and more, and I am finding it harder and harder to come back to the game in order to finish it.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Gameplay is fun, but the story is so CORNY that it makes progressing the game really unenjoyable.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I would have loved this as a kid, reminds me of the god old days of final fantasy 7. however.....i think i out grew it or something because i feel the repetitiveness of it. Story, random battle, get item of chest that you had no choice in getting...equip it because its better. do it all over again. beautiful JRPG i just thank it lacks variety in play styles.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun at first, but becomes extremely repetitive.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is beautiful and full of interesting ways to interact with the world, its just a shame the bosses are overpowering broken for their levels. if you're a Dark souls fan you'll love the boss fights. if you're a more casual Jrpg fan with only a few hours to spend on it, you'll hate it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game desires a level of mastery from the player that is laudable to ask. Parallel to a souls game almost, you are expected to fail and learn. Every time I've stepped away from a session I've come back better with new strategies to overcome a roadblock the game puts in front of you. I am not the core audience for this game and the last boss proves it handily. Unlike other good hard games, I just feel it refuses to be interesting in the ways that matter to carry me to credits.\r\n\r\nCharacter stories in Octopath Traveler II range from vaguely predictable and insipid anime tropes sprinkled with standout beats that I feel satisfied with taking at face value. I don't believe any character story was bad, just on the whole unable to lift itself above 'just fine.' Cutscene skipping and speed-up options on offer were definitely appreciated. Using each character's special abilities to interact with side quests and garner resources from NPCs were novel at first, but also felt wrote over time. \r\n\r\nBut there's something about this experience that hooks me. I'm making a conscious decision to not jump back in and grind out another thirty hours, and I might jump on that in a few years. Too much of that desire is sunk cost fallacy for my taste.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The boss fights are still ♥♥♥♥♥♥♥ stupid.\nJust had my party turn to stone - no ability to stop it because if they die after being stoned its permanent for the fight and I didn't purchase a specific anti petrification item.\n\nIt completly killed the enjoyment and desire I have to play the game and is the EPITOME until why I waited for this game to be over half off to purchase.\n\nAside form that, it shares all the stupid ♥♥♥♥♥♥♥ problems of the last game.\nYou can't go 5 feet without an encounter, even with evasive maneuvers.\nThe encounter rate is so bad there is a mod that reduces it to 0 when you put the evasive skill on.\n\nI'd have to spend another 5 to 10 hours grinding up levels to beat the end boss fight - that is with a party well over 50. \nTo top it off, you have to follow a specific strat to win, you can't do anything else because it just spams instant death, massive AOEs, and action blockers.\n\nThey some how ♥♥♥♥♥♥ up a perfect opportunity to make an epic battle...instead of giving you an 8 man party they let you swap back and forth.\nThis would be a mind blowing innovation in today's games designed by ♥♥♥♥♥♥♥ still living 30 years ago that for some reason give you 20 ♥♥♥♥♥♥♥ characters but only 4 party slots.\n\nThat is it....no epic 8 party battle vs a god...just swap back and forth between 2 groups of 4.\nIts a crime against humanity how many brain cells I lost witnessing the switching mechanic. Its just so ♥♥♥♥♥♥♥ stupid.\n\nJust give us a ♥♥♥♥♥♥♥ 8 party battle with all of them getting turns.....jesus ♥♥♥♥♥♥♥ christ its really not that hard.\n\n\nDon't by this unless its on a mega sale. The game was mostly boring and tedious.\nAnd fuck the retarded mouthbreathers with low standards giving me jeser icons.\n\nYou dumbasses are why we're getting charged over $60 for games and getting garbage. Get better standards you basement dwellers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game can randomly delete all of your save data at any time (this bug has been in the game since release and still hasnt been fixed lmao)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Well, it's just so meh. \r\nThe thing is from the onlooks you know \"story\" is going to be the major focus in this rpg. Eight characters, each with their own vingette(s), ect ect. The problem is after playing through about a dozen different segments there's just nothing remarkable or twisty going on. I don't want to use the word cliche, obvious is better. Combine that with video game writing and a lack of compelling combat and you'll konk out after 20 or so hours. I just don't really care what's going on with anyone. \r\n\r\nAs for the combat it does this thing where you use BP to boost attacks, and you get 1 per turn. The issue is anything that isn't boosted does terrible damage, so your skills are mostly for breaking shield points using attacks the enemey is vulnerable to. Not bad, okay, a little change up. The issue i had is sometimes a guy is only weak to one attack you have on hand, and you only attack once with it per bp point, so grinding down shield before you can do real damage or waiting for bp to build up turn after turn is irritating. Also magic kinda sucks or i just didn't jack up my character enough, but there is no multi hit spells save one, so using elements to break shields is pointless. \r\n\r\nAll in all there seems to be some niffty combat builds for each character because you get to take 2 classes, but, in the end your fairly limited on what you can be doing, and doesn't really play well past the mid game. Again a lot of \"meh\" going on. So i might plod on another ten hours to beat it, but it really didn't fly off the rails at all the way i had hoped.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}