{
  "positive": [
    {
      "review": "I love this game, but before you get into the Korean brain-rot cult that is the Project Moon Universe, there are lots of pros and cons to this game, it ain't perfect, after all.\n\nLimbus Company is a side-sequel to Lobotomy Corporation and Library of Ruina, it is recommended to play both games to get more insight about the Universe and some terminologies, but not required, I'd say that this game by itself can be a good enough explanation to it all.\n\n-+-\nTHE GACHA ELEPHANT IN THE ROOM:\nYes, this game IS a gacha, there's absolutely no denying it, although it doesn't hinder the game in any way, it is a vital element of it, but you don't always need the shiny new stuff to get through.\nThe way it's put is by having the same 12 characters being possessed by their Mirror Worlds(parallel universes) counterparts, that way you can still use the characters you like(I much prefer this as opposed to just pulling for new characters).\nIn my opinion, I think it's implemented quite well, you do not need to ever spend any money in it, has good rates(compared to other gachas), a good \"pity\" system, and most important of all: no FOMO, all past identities can be acquired for free, at any time, with no truly Limited Runs(apart from the recent Arknights Collab).\nAnother feature from this is that the investment put into the game is actually noticeable, with later identities and chapters having fancier animations and such.\nThe only complaint I have about this feature is the massive discrepancy between early and later IDs, sometimes making it harder to use the ones you like, due to the huge numbers gap and some later IDs being straight up busted(also, it would be nice to be able to use the base IDs on later chapters).\n-+-\n\nPros:\n+The highlight of the game is it's story, with some interesting and odd world building, it does absolutely get better along the way, in both writing and presentation;\n+Good art style;\n+The fights, although simple for the most part, have nice animations, having very \"impactful\" hits and satisfactory sound design;\n+Great combat system, being a streamlined version of Library of Ruina's one, it still keeps the engaging mechanics and incentivized team building;\n+Likeable characters that get fleshed out in their respective chapters;\n+Great music and voice acting;\n+The game does not require any massive amounts of grinding at all, especially when the Hard Mirror Dungeon is unlocked;\n+Related to the point above, it has a very generous gacha system.\n\nCons:\n-The game is a visual novel, it's emphasis is in dialogue, but, due to budgetary issues, it was made with single body sprites(only having the faces change), though it might sound like a pet peeve, it CAN be very annoying and take away from some story beats, it certainly would be nicer to have different character sprites and/or more usage CGs instead(wich is a trend that the later chapters are starting to pick up on, but the early ones are left outdated), now that Project Moon isn't that strapped for cash anymore;\n-The world building can feel very one-dimensional at times;\n-Most of the side characters are really flat, especially at earlier chapters, where most of them are just fodder;\n-The Chain Battles are very repetitive and not as engaging as the Focused Encounters, the fight highlights are absolutely the Bosses, but it takes a lot of Chain Battles to get there;\n\n-+-\nDespite these flaws, I still recommend the game, it's free after all, so should be worth a shot. Two big thumbs up, would give it more if I had more thumbs.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "10/10 game, would lose a dominating clash, my sinner turns into a \"red mist\" and i start wanting to distort again.\r\nWould recommend for the clinically insane.",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "Win rate = lunacy = extractions = more win rate = more lunacy = more extractions=...",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "boring ass game with boring ass mirror dungeons snork mimimimiiimmi",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "absolutely phenomenal game. Love it when my sinners turn into a Red Mist and nothing but Black Silence echoes through my house as I shed a Purple Tear and watch my team get staggered by my sinner getting corroded and realize that the Gone Angels will not return. also Don Quixote.",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "This Game is really Good, the stories are amazing. might actually read the books they were based off. True Peak gambling.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Very good game, very f2p friendly with very good story",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game gabs you with its stylish visuals, intriguing story, and unique blend of strategy and narrative. The characters are compelling, the atmosphere is dark and moody in a good way, and the gameplay loop is rewarding enough to draw you back for more. If you enjoy games that mix story, strategy, and style this one’s worth diving into.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As my first actual gacha game i ever played i have to say this feels more game than gacha from what i percieved, gacha is only used for limited time banner or the colab stuff that passed a few months ago from the time im writing. gameplay is fun from start to as of now consider this game if u have too many hours to waste or want something to keep u occupied  for long hours\r\n\r\n8.9/10 would press P again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game, especially purely the story mode, is good. But MD is one of the most boring game modes out of any game ever, and you spend like 90%+ of the time there.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love the fun story and adorable characters as well as the humor through what i've player thus far. I heard the game does have a sharp difficulty increase once you get to a certain point in the late game. Its rarely even grindy but it can be at times, for the most part tho, its pretty fun and easy for most people. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "peak game\r\nhours look low because I've mostly played it on mobile but I can assure you I've sank at the very least 200 hours into this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Before I start my review, allow me to mention some things:\n1. I played this game from season 2, and tried to get every possible cosmetics you can obtain from the events \n2. I bought the Limbus pass from season 4, and also bought the current season Limbus pass\n3. Currently, I mostly play the mirror dungeon (basically the weekly gacha currency grind), and only play luxcavation (the upgrade materials grind) when required.\n\nSo, it this game good? Well, I enjoy playing this game and attempting the challenges it presented, whether its the main story's bosses, or the \"achievements\" you can finish in order to get rewards/cosmetics. I also like the world-building of this game, and the characters presented in it.  Gacha-wise, this game is also very generous, with the option to buy characters whose banners are finished, with the currency you can get for free.\n\nHowever, looking at the game's current state, I am not sure whether I should recommend this game for new players. In this game, the IDs (characters pullable from gacha) are divided into three tiers: the base ID you get when you start playing, two stars, and three stars. Needless to say, you are less likely to get the three stars from the gacha (even though as mentioned above, you also have the option to buy them without spending the gacha currency), and levelling up these three stars will require way more materials than the two stars. \n\nSeems pretty normal so far right? Well, the problem is, the current season (which started from may 2025) only dished out three stars, and even added new collaboration EGOs (the closest thing to this is the gacha-able \"items\" your characters use), which of course, you can only get when the collaboration is still going on. \nWith no new addition of two stars, the grinding you have to do to max out (or even just to get the three stars) became heavier, therefore putting more pressure on the newer players. This is especially bad due to the fact that in order to fully utilize the power of your team, a specific combination of characters is required (or in other words, getting one \"good\" character is not enough). \n\nAll in all, I love the game, and even more, the community. But the recent decisions made by the developer have been pretty shaky at best, which made me think that I (and of course, new players) should probably wait some time before deciding whether I should continue investing my money in this game or not. \n\nLastly, keep in mind that this review is in the end, just a single player's review, so it may be heavily biased. I would like to hear what other player's are thinking about the game, so feel free to comment (or even just straight up criticize this comment if you think it's wrong).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "good story, insanely good gameplay and cool characters make this one of the best gachas out there",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I’ve played this game enough (don’t look at my playtime I mostly play on mobile) and I can confidently say that this game and the franchise are overhyped as hell icl. But it still has its own good moments and Mili in it so it’s def good game but not as good as people make it out to be",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "no, its fine, i just didnt expect the first piece of media to ever make me weep to be a korean gacha game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like the story so far and game play is not bad... I LOVE FAUST!! RAH!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its peak trust, everything about it is peak :D. Also, what I like from the games was the character designs, but also their skills when it comes to use them.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I only started playing Limbus Company because my friends also played it. But let me be very clear: this is the kind of game you stumble into when you're hopeless and depressed, and it tells you a message you didn't know you needed to hear. There is (or will be) at least one Sinner whose story resonates with you on a personal level.\r\nThe overarching story and the world is very dark, but each Canto focuses on overcoming and accepting past trauma and that there are still things worth living for despite everything. The Sinners are very flawed people but you will love them anyways. It takes a bit to get going, but Canto 3 onwards is good.\r\n[i]Heed the content warnings[/i], but I'll say I normally avoid games with graphic content yet I had no trouble with Limbus Company. Once you get past Canto 1 (which sets the tone of the world) and the Sinners get more comfortable with each other, there's enough goofy, lighthearted shenanigans to help balance out the serious and heartfelt punches to the gut.\r\n\r\nIt's very easy to be F2P, compared to other gachas I've played over the past decade. For full disclosure, I've paid only for the battle pass (which is cheap and easy to complete in a fraction of the time it's available) and have bought no other packs/currency. You could probably subsist entirely on the shard crates you earn each week if you wanted to never touch the gacha. Other than the Arknights collab E.G.Os, nothing is truly limited-time only which I appreciate a lot! Please do not change that Project Moon, I beg of thee. (As an aside, I also love how diegetic everything is -- the gacha is real in-world and the UI is themed around Dante's office and PDA.)\r\n\r\nThe only lasting complaints I have are about the combat. Vertical difficulty walls are very real; boss fights at the end of Cantos can reach up to an hour and a half, and you can't save and quit partway through. That's all standard for Project Moon games (or so I have been told) but doesn't mean I like it. Nonetheless, I persevered through all of the currently-available content.\r\nThe in-game tutorial is still not great (despite updates), so I recommend either having a friend walk you through the combat system or watching a YouTube tutorial. Combat is fairly simple once you understand how it actually works. Be prepared to read a lot of skill and passive descriptions.\r\nI've seen people say Mirror Dungeons are boring, but I thoroughly enjoyed the Extreme mode they added to it this season and thought it was a fun challenge! I don't mind waiting for new story content, and am content to skip through my dailies and do my MD runs whenever I feel like it. If you want to play all the time you will probably get bored, but I prefer the relaxed pace.\r\n\r\nOverall: thumbs up and 4/5 stars, how did I manage to get 400 hours of playtime in this game already, please send help I'm obsessed. Can't wait for Canto 9!! (Heart heart star star, truly ideal, LIMBUSSSS COMPANYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I first chose to play this game because a friend was playing it, and also cause i previously heard that it was so peak that it brainrotted you to only see limbus, more than a day worth of time in the game and i can confidently say... IT'S NOT JUST PEAK, BUT THE DEFINITION OF IT, ITS A FAIR GACHA WITH THE OPTION, NOT THE OBLIGATION, THE OPTION TO SPEND MONEY INSTEAD OF BEING FORCED TO, ITS GOT AN AWESOME STORY LINE, BEAUTIFUL PROGRESSION, AWESOME EVENTS, AND ITS OVER ALL THE BEST GAME TO RELAX AND ENJOY WITH! NOT TO MENTION THE ABSOLUTE CINEMATIC MASTERPIECES MILI MAKES FOR THIS GAME!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "1.Launch game\r\n2.Drive-Inferno\r\n3.Win rate every stage\r\n4.Lose one stage\r\n5.Start reading\r\n6.Go back to win rate\r\n--Repeat--",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Story Canto IV,V,VI,VII, and VIII are peak asf fly broken wings my compass is my curiosity I could be the reason why  Hero on a plastic horse fighting like its real with a cardboard sword the angels are gone Tian Tian String Theocracy Wild Hunt Manchaland Dad is gone Chicken is chicken duh Gasharpoon Worm in your neck smth smth (i suck at this game)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive never been so stressed out but also in euphoira while playing this FREE game, id sell my soul for limbus but for it to be free is a christmas blessing first time ive sat down and played 6 hours in one sitting, also love the win-rate button",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want to suffer just like how koreans suffer every day living in korea. this game is perfect for you.\r\ngreat music, Great EVERYTHING. ALL OF IT.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Limbus Company is a turn-based Gacha single player rpg in which you take the role of manager as you lead the twelve “sinners”/“prisoners” in battle. \r\n\r\nThe game is set in Project Moons dark fantasy setting of “The City”, a country sized capitalist dystopian city where the poor have to fight to survive and the rich live carefree lives. \r\n\r\nThe twelve sinners are based on popular characters from literature, such as Don Quixote, The Odyssey and Moby Dick. Their stories are retold through the lens of the city in the games main story. \r\n\r\nThe gacha element ties into the combat system as sinners equip alternate reality versions of themselves in order to fight monsters and other foes. \r\n\r\nIt’s the kinda game that you don’t have to pay any money to enjoy, and I would recommend not spending any money until you’re sure you like it. I didn’t really get hooked until I was a decent way into the story and got attached to the characters. Also most of my playtime is on mobile.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is alright takes a little long to do and needs a lot of luck 8/10 game tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had to learn how to read to play this game.\r\n\r\nLimbus Company is the third installment in the project moon game trilogy and the most recent release (in terms of PM timeline and game/web comic releases). It's predecessors (Lobotomy Corporation: A roguelike monster-managment simulation) and Library Of Ruina (A turn based RPG taking place years after the ending of Lob Corp and expands on the world we see the game take place in) are great plays, just like Limbus is. LoR did a great job at giving us some of the world but Limbus company takes it many strides further and takes us all around the city and also gives us call backs to other characters and events in previous titles (and comics). While it is the easiest of the three titles, Limbus Company is a game that brings characters based on real life books and converts them to sinners working under a contract for Limbus Comany (the in-game company). The combat isn't hard to understand but where this game strives IS the story of Limbus. As stated before, it takes us all around the city and gives us (no so accurate) retellings of these sinners' stories. My favorite is definitely Heathcliff (Wuthering Heights By Emily Brontë) and his Canto/Chapter in the game. The character interactions are amazing and show the development of these characters. The different story points also have made me cry so many times. I would definitely recommend this game to any story lovers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game overall. However, though it gets a thumbs up there are many flaws that get very frustrating. I feel like this game needs a few things one is a better tutorial or if not a better tutorial maybe a guide book you can get in lobby that explains things is detail in writing. Another thing this game needs is an enemy archive. I love the enemies in this game and love how every enemy is a bit different and not just copy paste with more health and better stats. An enemy Archive would help players read lore or be able to after killing an enemy multiple times you can see their moves and their passives and stats that will help you in the future. Another thing the game needs is better debriefing before entering a mission. A system like this that allows you to see enemies coming up can help a lot with an archive to use that knowledge to make decks and if you want to keep an enemy in the next mission a secret then just show it as a ??? or a silhouette of said hidden enemy. This system also allows after failing against a boss instead of crying because your bleed deck heals them (talking about you Kromer) it allows to see why you failed and see the enemy's passive after defeat allowing you to come back with a moded deck instead of searching online. I mean I love searching online to find deck ideas and recommendations, but there are times I want to learn it myself. Finally the last flaw I see is in the side content, now don't get me wrong I love the side content, but the issue is that most side content is locked until you have gotten into canto 7 or 8. I mean i love certain stuff only for people who progressed far enough to get it, but i feel most half of the side content should be given to people who pass canto 5 or 4 because that is when the game starts to pick up in my opinion. Other than those three issues that i find the game is great. I love ever aspect of the story, I love the art style and how this gacha game feels more like a story game than just being just gambling, I love the gameplay as well I like how decks can be so creative and how every encounter feels unique and how every combat feels so thought out (most in focus encounters). I love this game a lot and love even more that it is free to play. I just feel that these three issues though aren't game breaking i feel like if they are fixed that the game would be become a lot more friendly to people who wish to learn things on their own than have to relay on online info and wikis that are pretty bad at times. If you agree with my review or disagree i would love to hear feedback on this I love to hear thoughts about this game and maybe someone in the comments can give me some advise. The game truly though does deserve a thumbs up.\n\"LIMBUS COMPANY\" (don quixote)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a goated game i lowkey may have spent to much money on this but it doesnt really matter because it was worth it, and i can garantee that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, and for being a gacha it is very f2p. Also the ending chapter songs are really good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wish this was on mac, using PlayCover to play it, had to use a barely working windows emulator to not get past loading screen and write this. Overall good game tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Animations and SFX are pretty good, very f2p friendly, great gacha system, very good story (except canto 2)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "makes my crippling gambling addiction tweak and shake because of the amount of rng there is in this korean masterpiece\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely the best free singleplayer game I've seen on Steam, a great choice to play during boredom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't played that much at all BUT so far i think this game is pretty good. If you have a good attention span and like reading, this game can be very fun. I have a decent attention span and somewhat like reading so i never play this game for more than 2 hours. But overall i think the game is great. Should definitely try out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the game but i couldnt get into it anymore and i waste banks of money on it but loved it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game good \r\nIt looks great and has a rely good story.\r\nCharacters are fun and endeering",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game,\r\nidk what else to say, other reviews probly explain this better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely phenomenal game. incredible story, soundtrack, worldbuilding and interesting and fun gameplay. expertly crafted experience with narrative peaks that are worth every ounce of pain and suffering in the leadup to them. \nonly downside is that it's a gacha, which is a rather large downside. even if it's 'forgiving' and 'generous', it's still a gacha.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fine i played it a little bit, the gameplay is boring but the story is really good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Funny fishmael guy. Besides that tho it has such a good story and some are still coming out so just play it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game fucking sucks and it sucks and uhm its sucks and yeah it sucks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 game, very f2p friendly, amazing story(i have cried multipule times)\nuhhh ig thats it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the few actually fun and fair gatcha games!\r\ni love it after playing lob corp and ruina and enjoying the world of PM limbus company has great characters to see this world through!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutely love the story and the gameplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is best considered as a \"free\" visual novel with barebones turn-based combat on the side. \n Interaction with the gacha monetization isn't a requirement for an enjoyable gameplay experience.  The story portion of the game is quite decent overall.  Where the game truly has flaws is in the gameplay portion.  It greatly lacks combat oriented content that is both enjoyable and replayable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has played Lobotomy Corp, its definitely a company and limbus.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've now played this game for a few months and have caught up with all the relevant content in the game (all cantos and intervallos), so I think I have a pretty good idea of what the game is like. Prepare for a lengthy and in-depth (spoiler-free) review.\n\nNote: I have not played Lobotomy Corporation or Library of Ruina. The only Project Moon game I have played is Limbus Company.\n\nGACHA:\n\nYou may have heard people say that the gacha in Limbus is really good and generous. It is not. The gacha mechanic itself is quite horrible. The rate up is similar to most modern gachas these days (that is to say, an absolute horrid 50/50 chance to get the featured units), but unlike most gachas, Limbus very commonly has two or more featured units at once, meaning that your chances of getting the specific unit you'd like is actually 25%! If you're unlucky like me, the experience can be genuinely depressing as the game can simply refuse to give you any rate-up unit over and over again.\n\nThe good news? \n\nYou don't have to rely on gacha to get the units you want. With the shard/ego crate system, you can basically just redeem the card you want by using the remnants of your failed pulls (each dupe gives shards of a certain character- you can also get them via crates which can be obtained during events etc.)\n\nObviously, this did not help AT ALL during the Arknights collab (which is why I am particularly salty at the game - 300 pulls not netting me a single rate-up EGO), but if you're joining NOW, you won't have a chance to get them anyways, so all obtainable units will be able to be 'sharded'. \n\nThe shards are relatively easy to get, which I appreciate because Limbus will absolutely 100% lock you behind relevant content if you do not have good enough units to clear it. \n\nWhich leads us to...\n\nGAMEPLAY:\n\nThe gameplay is basically a fancy version of a coin toss. Win the coin toss = good. Lose the coin toss = bad. Each unit has different ways of increasing their chance to win the coin toss. But sometimes you're just doomed.\n\nThat is to say, this game can be tough, but it, in my experience, is not challenging in any meaningful way. If you come here expecting really in-depth and interesting turn-based gameplay, you should probably look somewhere else. However, as someone who absolutely loathes Honkai Star Rail for basically being Button Clicker Simulator, I find Limbus gameplay to be passably enjoyable.\n\nNote that there is no AUTO botton, and the game does NOT save your progress in a fight. If your game happens to crash, your progress is GONE. \n\nMAIN STORY/CHARACTERS:\n\nThe main story chapters by themselves, in a vacuum, are good. \n\nThey're good. They're solid, well-written and emotional. Other people have praised the story to death, and I half-agree with them, and so while I maintain that the story is good, I'll offer some flaws for your consideration as well.\n\n1) Characters do very little to contribute in stories that are not their own.\n\nIn Limbus, each story (\"canto\") is centered around a certain character. This is where most, if not all, their character development lies. However, outside of their own canto, characters take action or offer input that could meaningfully affect the story (or at least the central character), with their relevance mostly being reduced to bit parts, or even NPCs. \n\nAfter their canto is done, you are basically begging for scraps for even a sliver of character development for your new favorite character. This means that if you were hoping to see our main characters regularly lifting each other up or helping their colleagues using the new wisdom they've gained from going through their own character arc, then you should probably forget that. The ONLY exception to this that seems to regular assert himself as a proper character in a story is Sinclair, who is the youngest and most immature character of the group, meaning the story treats him as though he still has room to grow. \n\nThis also sucks because if you happen to like any character who hasn't had their canto yet, you basically have to play the waiting game before your favorite PNG can turn into an actual, fully-realised character. This game has been out for years, and yet I do not know more than one or two meaningful things about half the cast. While I understand that most of their character development must be saved for their own canto, there is nothing stopping these characters from offering meaningful insights into the experience of their peers. \n\n2) The game can be unclear\n\nLimbus likes to keep its mystery aspect fairly strong, but it sometimes results in them under-explaining certain elements. In Canto 4, a group of individuals is introduced, but we are not given details of how many people are in the group, nor even all their names. Later on, new members of that group are introduced, and I was left confused, wondering if I had missed something in the flashback that happened in the previous story. I had not. they simply just decided to drop in an extremely important, relevant new character that was connected to a previous character without a single drop of foreshadowing. \n\nIt also likes dropping terminology from its other games inside the story with no real explanation. You ARE given what's basically a dictionary summarizing what each terms mean, however it can still take you out of the story/break immersion as you start wondering what on earth the characters are talking about now. Concepts are always introduced immediately before they start being used in-story and thus there is no room to breathe or properly take time to comprehend the new information that has been given to you.\n\nHowever, take note that despite these flaws, I do genuinely enjoy the story of Limbus Company. However, these flaws are also much too great for me to ignore, and actively hinder my enjoyment.\n\nAlso, side note, but I genuinely do not like the translation for Canto 4. It is extremely clunky and sometimes lacks flow that might have been present in the original Korean text. It actively made me start to dislike the story as I struggled to comprehend what on earth anyone was saying. However, the canto does end strongly and this issue nas never appeared in any canto since. \n\n\nGACHA CARD STORIES:\n\nEach gacha card, or 'identity', comes with its own small story about a mirror world, also known as an Alternate Universe. As someone who loves alternate universes and loves card-collecting gacha games (where the whole point is that each card possesses its own mini story), I do have some Thoughts on it.\n\nFirst, I want to point out that none of the gacha cards feature the characters before, during or after their character arcs in the main story. This is a huge point of frustration for me, as we are unable to PLAY as them as they are in the current story, but this is just a personal wish of mine and not something I hold against the writers.\n\nOkay, here we go. I'm running out of space, so lets blitz.\n\n1) There is a huge gap in story quality and length between each card\n\nSome stories offer an in-depth and introspective look at an alternate possibility for a character. Others just drop the premise into your lap, tease you a bit, and leave. Which Is An Issue, because the purpose of card-collecting stories is to let you learn more about the character outside of the main story, and that can't very well happen if the story provides absolutely 0 new character insight because the story is 3~5 minutes long and is more focused on making charas look badass!\n\n2) Cards sometimes struggle to reconcile with the base character\n\nSome IDs feel less like a proper alternate possibility for a character and more like the character LARPing, as they are so entirely disconnected from their base self. This is super obvious in some Sinclair stories, which sucks for me. \n\nI'm running out of space.\n\nUh, tldr, game good, but its not the best thing ever and think a lot of things can be improved. Looking forward to the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was expecting bad gameplay that was only based on the gacha. but Limbus is way better then that I love the gameplay, the mechanics, and the music oh. my. GOD, the music is so good in my opinion. and most importantly the world building is really great and in my opinion and I say in MY opinion. the world building is better than LOR now, now hold your tomatoes but it feels so good after yapping to your friends for a half-hour about Limbus company's lore. I absolutely love the way the story changes when you actually paid attention to the identity stories.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hopes and dreams game, I hate my life. 100% reccomended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This truly was our limbusbotomy corporation company of ruina. also game good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, interesting cast of characters who you'll grow to love more as you go over their past. Vast and interesting world lore that connects with their older games( No I haven't played them but I've gone on to reading the wiki out of curiosity).\n\nIn the beginning the game mechanic can be confusing but don't sweat it. Your understanding will grow with each defeat. It ends up being mostly auto mode until you reach the end of chapter 3/current 9. Then you'll have to level up a bit and try to either evade, guard or best case scenario, counter/clash the attacks that might hurt you.\n\nGlory to Limbus Company!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has a deep compelling, dark, and lore-rich story with a unique combat system.  The game is incredibly generous to free-to-play players and it’s pretty cool. That’s all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak storytelling and worldbuilding if u fw video game lore a lot\r\n\r\nunique fighting mechanics that actually makes sense the more you read (sometimes, you'll get it eventually) and feeds the brain by using these unique mechanics in interesting ways for strategy.\r\n\r\nsuper popular so youre bound to get help if you need/look for it\r\n\r\nplay now",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I learned this game from my friends. I downloaded it and I fell in love with it. The character design, the animation, the effect, the sounds and especially the lore of every canto. Play this game if you can i reccomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I don't think there are good enough words to say about Limbus company. Somehow it is so relaxing yet so stressful, the weird mix of the good with some of the negative but it somehow all works great together like a combo of two foods you would have expected to be terrible, but is heaven on earth, sent from the angels. I believe this game is worth trying out and supporting, the story, art, characters and gameplay are all so great and I believe firmly all 200+ hours I have spent on this game are worth it and I reccomend it to everyone who is willing to try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite being a Gacha, it's somehow good.\r\nThe gameplay was designed with the soul intention causing the most RNG induced misery, but Project Moon’s inability to make an exploitative Gacha system balances it out. You find yourself getting attached to the cast of characters, a bunch of jackasses in the beginning, who are forced to change, improve and self-introspect because of the BS the story throws them into. Oh, and Ishmeal is also there. No matter how much you dislike that, she is still in the game. \r\nThe gameplay mechanics can be fun if properly engaged with, unfortunately the tutorial segment sucks at introducing them, and what is worse, it even up and lies to you at times. However, the game’s main draw is still its characters, world, and story.\r\nThe Gacha can be ignored, at the small price of 20 bucks a year and selling your soul to the Mirror Dungeon Grind mines. No matter how much you dislike it, you will find yourself mining MDs again. So, for the sake of your sanity, get a Burn Team as fast as you can.\r\n\r\n\r\nSo That No One Will Cry out of 10, would spam Fluid-Sac again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, just be ready for a bunch of reading. Tip: don't get attached to the side characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so DEMON. Better than Honkai Starbuck, when I switched from HSR to Limbus I feel like i got out of toxic relationship and met someone that treats me better. That made me realized HSR is just that greedy\n\n\n10/10\n\nI LOVE THE CITY I LIVED IN!!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT game. MOST HORRIBLE EN COMMUNITY EVER, ITS FILLED WITH ROBLOX KIDS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is the definition of peak. I'm only on Canto 6 as the time of writing this and it is my favorite game of all time. I love literally everything about it. (except mirror dungeons.) The story is amazing and the gameplay is very fun. 10/10, Kim Jihoon really conceived a idea, most ingenious.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glory to the company. \r\n\r\nFr tho this game is peak I did not know a gacha game could make me tear up with a genuinely emotional moment and have 12 different characters who are all incredibly distinct and have immense personality just for the base cast god I love this game 412 hours isn't nearly enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game effects and voice actors cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The games great. I get to fuel my gambling addiction for FREE, and i also get to look at really cool graphics and be immersed in a amazing story. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing this game for a while, and even then, I can't tell you much on the story. As I'm only at Intervallo 1. But it has been going pleasant this whole time, I really liked Sinclair's Canto, same for Rodion's. It might be a cultural difference, but my only problem is that there's a few points where it feels like the game is bending over backwards just to blame Dante for something happening. I won't go into detail, but that's really it for my problems. And even then, I have been told that Dante's whole \"pushover-ness\" goes away after a few Cantos, so, that might not even be a problem. But you definitely should check this game out if you like this genre. It has good art, good combat, and I've really enjoyed the story so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, good story and the gacha isn't even that bad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly this game has changed me for the better. The way it continues the story of the city and makes its own path as a fellow corporate entity with \"L\" in its name. To each characters  canto showing true emotions and the actors that voice them portraying how I imagined they would be feeling. The city mirrors our world in Many ways and the feels are amazing 10/10 Kim you made a amazing game yet again.\n (Canto 7 or 6 was my favorite)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a first Gacha game? it. It's pretty damn amazing. With Canto 9 on the horizon i. i'm gonna be honest i can hardly wait. hell, even if you dont have the time for it right now, if you have Any intention of playing this game..\r\nGet it now, Wait through the unfortunate [i]Several Hour Install.[/i] (Director why) and just. log in every week with the updates to claim that sweet sweet 300 Lunacy every Maintenance.\r\nIt'll pile up Surprisingly quick.\r\n(...Lunacy is the currency for pulling, by the way.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If there's a game more deserving of the labor of love award it's this game, heck Project Moon itself deserves it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worst project moon game to date\n10/10\n(game only starts getting good during/after the 4th canto (chapter))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This Game is more so Directed to People who want a Story to Read rather than a Game to Play. The Gameplay Parts are alright but the amount of Grinding you need to do is Insane. I first entered this Game wanting to play for the Gameplay but now I play for the Story. This game has it ups and downs but I would suggest you this game if you're looking for a Good Story!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glory to Limbus Company! Third game of the Project Moon franchise, so there is a lot of pre-existing lore for the world building. Luckily, this game can be played without the context of the previous games.\n\nAs many people have probably already seen, the story follows twelve characters whom are named after various protagonists from classic literature from around the world... and they're anime boys/girls. Limbus Company, while not necessarily faithful to the narratives of the characters' original sources, showcases an acute awareness of the core themes from the sources and adapts these themes to reflect upon the values of modern society.\n\nWill warn that reading comprehension is vital to gameplay, especially since it is more graphic novel than rpg.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is gacha but f2p but still gacha, but the characters and story are amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So addicting that I have to uninstall it before my life falls apart",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Poor Peoples Gambling Game, but better than all other I played. Amazing story, great soundtrack.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is fun! until you get to the point where you put 26000 lunacy into a single banner and still dont get a single 3 zero id...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the game. its project moon so the difficulty spike is fucking vertical",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the gacha games that respect your wallet and your time. Doing daily doesn't take hours, and the gameplay is fun and engaging. The story and worldbuilding are also astonishing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is... phenomenal\n\n13 main characters\n\n150+ hours of playtime\n\n8 whole chapters of heart retching, beautiful stories of sorrow, envy, hope, mourning and acceptance. \nThis game is truly the best free story game on steam, maybe even across all platforms.\nI ask of you, if you're reading this review, even if the game seems boring or uninteresting as I once did, Delve into the inferno, claim the golden boughs and let your sinners surmount the city's greatest horrors.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Least-gacha gacha game, plays much better on pc that mobile, and manages to fit comedy into dark themes. back to maintaining the agenda.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so awesome sauce it is a tuff experience and should be experienced by a lot of people because it is so awesome sauce!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even with the infamous community it has garnered, Project Moon continues to put incredible amounts of love into their work. The characters are well-defined, the story is never afraid to shy from commentary on the human experience, and overall the game retains the challenge that drew me into their previous titles, although much of the main story is easier for a casual audience.\n\nIt is refreshing seeing a title in the gacha format that not only makes nearly every unit viable, but also allows players to reasonably grind for every identity outside of the limited time Walpurgisnacht IDs (which are still available to shard during the next Walpurgis) and a limited time collaboration event (which contained non-meta defining E.G.O.).\n\nThere is also the appeal of extensive literary references hidden within each of the main cast members. Their in-game character arcs usually play out as a twisted parallel to their book counterparts, and reading their original story is a very rewarding experience to explore what goes differently in the world of the City.\n\nIf you're interested in the plot and various multimedia related to this game (including webcomic/novel formats), consider diving into the lore and watching videos about the previous games. You can also play them yourself if you don't mind the difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great story, great music, fun gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has incredible story and world building with a memorable cast with their own backstories, each character always stays in character and acts true to themselves where you can see their own growth throughout the entire game. Even though it is a gacha game it still is incredibly f2p and really easy to get the characters you want. I also like the idea where instead of pulling for new characters, you pull for \"ids\" for the main characters which are basically other versions of themselves. The art styple is simple but good, the soundtrack is great, and it is a FREE game on top of it all. I could go on and on, but I don't want to spoil the entire experience for people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Limbus Company is one of those games that completely exceeded my expectations. It blends stylish presentation, sharp writing, and strategic turn-based combat into a uniquely polished experience. The atmosphere is striking—dark, surreal, and full of personality—and each Canto (or chapter) pulls you deeper into its unsettling world.\r\n\r\nThe story is one of the game’s strongest points. Every Canto builds on the last, introducing new characters, locations, and emotional gut punches. They feel like self-contained arcs that still feed into a bigger, overarching narrative. Whether you're traveling through a strange city, uncovering someone's regrets, or watching the crew of Sinners spiral in their own ways, each Canto is memorable and hits with that signature ProjectMoon flavor.\r\n\r\nCombat looks simple at first glance but becomes incredibly engaging once you start experimenting with Identities, passives, and resonance mechanics. When a turn lines up just right and all your clashes hit perfectly, it’s incredibly satisfying. The music and voice acting elevate every moment, and the presentation in battles and story segments is consistently top-tier.\r\n\r\nFor a free-to-play game, it’s also surprisingly fair. Progress feels steady without requiring spending, and the game rewards good strategy more than raw stats.\r\n\r\nIf you enjoy deep storytelling, turn-based combat with nuance, or anything connected to ProjectMoon’s universe, Limbus Company is absolutely worth jumping into. Stylish, weird, emotional, and full of substance.\r\n\r\nVerdict: A standout experience with some of the best chapter-based storytelling on Steam. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't let the fact this is a gacha game dissuade you, it's another excellent piece of storytelling and a delightful strategic challenge from Project Moon. The Gacha mechanics are also some of the most forgiving on the market, the 'grind' is an actual option here, rather than a ridiculous waste of time. \r\n\r\nIf you want quick and fast, this game might not be for you, but if you have patience with this one, you'll find a lot of enjoyment here for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty decent game, it first looks simple but there is a lot of depth in it which you will eventually have to learn due to some orbital high stone walls you can encounter.\n\nGacha is limited and if the creator gets all the new units in a single pull on stream: you get free currency!\n\n11/10, would like another poise/bleed unit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gambling, and also don quixote is in the game, so its a 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great, the story goes places that was not expected at times but always felt fitting and immersive. The don't hold back on the art and the gore and the music by Milim goes hard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the best written games i've ever played the story and the characters are amazing\n\nUnbreakable coins are still a Dog mechanic though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "> Be me.\n> Looking for Gacha games that aren't shitty and want all your money.\n> Ask friends if they know any.\n> \"Oh yeah, you might like Limbus Company.\"\n> Look it up, seems like a rather cool story.\n> Get hooked. (886Hrs currently at time of writing this review, 400 of that or more was me just- grinding not out of necessity, but for fun.)\n> Realize that others played this game too.\n> \"Hey, do you like the story?\"\n> Yes.jpeg\n> \"Why not try Library of Ruina and Lobotomy Corporation?\"\n> Whynot.wav\n> Proceed to buy both games and love them to death for their stories.\n\nProjectMoon is wonderful. The game is free, you don't gotta pay a dime if you don't wanna. When I say this, I talk about it in the sense that \"even for things you want\" you don't have to pay for. Everything, and I mean everything, can be shard farmed for, and with ease. (Shards are used to grab characters from the Dispensary)\n\nDifficulty is much like a mix between more Casual \"Auto\"-Battler and the intense difficulty of Ruina (not spoiling names). Fun is through the roof if you enjoy the story and nerding out about the characters, as there is plenty to both read into, learn, and develop with teams and sinners of the game.\n\nWhile not my usual want of being comprehensive, it's probably one of the few games I can say that I'm truly bias towards. This game has stolen my heart, and I can't thank the developers over at ProjectMoon for their services, be it Ruina, LobCorp, or Limbus. I can only hope that when Limbus does eventually finish it's main story, when it's just events should it reach that point- that the game will be given the ability to be downloaded completely, without a energy system. To allow players to play what has been giving me fun for well over 800 hours, so that when it's all said and done?\n\nWe have the game, just like LobCorp, just like Ruina, that we can play any time. Identities? get them still through shards. Mirror dungeon? Customizable endless mode of ever increasing difficulties. Teams? Develop them at your own pace. Levels? Threadspinning EGO?\n\nAll that and more. It'll be beautiful, I'm sure.\n\nCan't wait for Canto 9, for my favorite of the Sinners to have their turn!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I goddamn love running Mirror Dungeon from three to six times a day. The game’s got a great story, great characters, and goated battle theme. Might be slow at the start but its an interesting story later on the other canto. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have only did the tutorial, since i had to reinstall the game thrice, but i loved it! Truly recomend it, also had heard about it before installing it, but never knew the combat mechanics neither the gacha mechanics, soon one of my favorites!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Из минусом гачи-игри останеться тем , што есть чага и фарм (типа раз в неделю пройти Зеркальний Данж и все), но игри от студии я люблю.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish there were more scenes between cantos where heathcliff and ishmael make out but its alright other than that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TS GAME IS SO PEAK, First few cantos are slow but the second you hit Canto IV its Cinema. 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly one of the best action packed gacha games i have ever played. Super addicting and does require a shit ton of theory crafting to build a high level team, though the support tool makes it so you can borrow units from friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes twin. It has gambling, pleasing graphics for the eyes and it's story is interesting to me anyways. I like it, it's just very confusing at the start",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my favourite games, pmoon managed to make another great game, with great story and gameplay\nI recommend the game alot!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "flashy lights, gregor, and reading",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "LET ME FUCKING PLAY THE GAME GOD IM STUCK ON THE FUCKING LOADING SCREEN  GAHHHHHHHHHHHHHHHHHHHHH (otherwise this game a 10/10)",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Got the game, waited the entire time for it to install IN GAME then it just doesnt launch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Been stuck on the download screen, as it seems stuff doesn't save or so.\r\n\r\nWhen it comes to the first \"Fight\" (That i barely got to see), It ended up being a black screen with a bunch of icons, my \"3-hours experience\" in this game was all being stuck in whatever loop this is.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really wanted to write a big positive review because I’ve always enjoyed this game. But during this season, I’ve noticed that the quality has really dropped. If you’re planning to play, I’d recommend just going through the main story — it’s still worth it. However, the events feel repetitive now, and the new ones just don’t have the same spark or level of polish they used to.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "i like the game, from the gameplay especially cause its satisfying and challenging but i don't know why, so far my gacha is so bad, is it because the rate increase secretly? i guess it's not. Its just so weird that the gacha is so hard for now rather than the update before the collab banner. Now my account is in condition where i must become p2w because the gacha that i explain before. From the collab banner, i reached 200 and got ntg of 3 and its really frustrated cause i'm a f2p player and the daily sucks cause you can't get lunacy from daily and only need to wait for a week to get 750+300 then now, the walpurgis banner also happens the same. Cause i'm f2p, there's no way i reaches 200 now, so i can only reach 126 and i got ntg too. So i decided to not play this game anymore since the gacha is so bad for me now or my account is so curse that my gacha will always be bad. I also hates the cs, it's because they are ignorant and i never get a reply from them. Well the worst experience gacha game i ever play",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "they didint give me every faust id and ego this game fucking sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game makes me feel pain, play at own discretion. I think that lately the devs have been getting a tad lazy and think that we players will eat up any slop such as this last arknights event (which was good kinda, just the true limited things seemed a bit unfair) and now this walpurgis night (Which has no story to go along with it), I'm still going to play it just not as much",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "amazing soundtrack in the game however horrible balancing among everything past around the middle of canto 5 i dont hate the game its a fun game dont get me wrong but its balancing is horrible to be honest i am stuck on the final canto 7 boss and i cant do anything to get past the first 3 turns of the second phase no matter what i do if you want if this continues without clearly any balancing done im gonna stop playing this game its clearly not being taken serious enough and it will be once people start noticing its horrible balancing issues with its bosses.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE THISX  GAME I JUST SPENT LIKE £17 ON IT AND GOT NOTHING. FUCK YOU. FUCK YOU KMIM JI HOON. GUCK YOU ANFD CLOCKLIFF. I DONT EVEN CARE ANYMORE WHATEVER. WHATEVER. WHAYEVER.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Writing is bad and gameplay is kinda boring",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The fact I have to wait 11 hours to do anything in this game is so so stupid, not to mention I can't pull because I won't have the stamina and instead I gotta spend it on the stamina to then guess what be stuck with nothing useful and get stuck again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Uncertain whether to give positive or negative review...\r\n\r\nLong version: The good aspects i find myself enjoying is the story and world of the PM universe that Limbus Company takes place in along the other 2 prequels or so, and the combat feels satisfying to watch happen. But the major problem i have with this game... Is gacha. Also why an earth does a single player gacha still exist? It would make somewhat sense if it was somekind of MMO but why would i want to pay real money on gambling in singleplayer game? If dev needs money just sell the game itself rather than using the predatory methods of gaining money that is gacha. The only good thing about of this is that you can get the \"premium currency\" by playing the game, however it... Does not seem to do much justice seeing droprates of some identities and other things, but regardless, the point is why gacha in singleplayer game? And why does single player have to need online connection? I was disconnected from the game during my final fight in one of cantos because of maintenance, having to go through it again, and last time i had this issue made me want to quit for a year and seeing this problem still happens is kind of infuriating.\r\n\r\nShort version: Good story, satisfying combat to watch and interesting mechanics with abnormalities especialy. But please, stop with predatory gachas and requirement for connection in singleplayer games, that is huge no, don't fall in that path.\r\n\r\nEven shorter version: Game good, gacha practise in singleplayer game bad.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "installed the game on my G: drive. go to main menu, 12gb installation that went directly to my C: drive. game is also louder than the THX intro",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this even though its free, cant beat canto 4-48 even though i have all 3 star units",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Free game, but not worth the time for me . Clunky controls and repetitive fights made it tedious. The voice acting is grating and the art style just didn’t click; needs a lot more polish for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "0/10 cant play the game its just a black screen its just a fuck you to whoever wants to play on computer i honestly cant fathom how fun this game would be if it was made correctly and playable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its whatever. If you like story driven shit sure, but the gameplay is balls.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "what the fuck is the point of making a boss thats near impossible to beat if u dont spend money on this shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this was lame as fuck i regret ever falling for this snoozefest. learned my lesson",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is not so fun my friend glazes it alot and i dont get the hype just not my game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is weird. It plays, acts, looks, and story is told like gacha, but it expects you to invest time like you are not playing gacha game. While playing this game I sometimes think: 'Why is this gacha game taking so much of my time?' \n\nOther aspects of this game is annoying: \nFirst, why doesn't this game have autobattle or autocomplete function? For example, this game sometimes have a event where you are given rewards based on how much green stuff or stamina you use on that event's missions. I already completed those missions, but I still have to play the mission and hit \"win clash\" button so many times. This just sucks time and blows in tediousness to the game. \n\nSecond, the skills description is just lazily? organized. I never read these descriptions, but I still managed to complete the stories, mirror dungeons, and dailies. What the hell is the point of making such long and convoluted descriptions then? Feels like they are wrote like that to just make the game look more complex than its surface.\n\nThird, where's the faster battle function like x2? Yes, the animations are cool I guess, but these get old quick.\n\nFourth, the some bosses just ignore combat functions. For example, shield with sword icon means riposte. The boss wouldn't have that, but it gets to attack anyway. What the fuck?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty mid, some weird femboy tried to seduce me onto playing it for 2 weeks straight so I hate it even more",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is a shit fucking piece of filth. The community is shit and its full of gooners. The gameplay is terrible and the characters all look the same. My friend jaidon greaves used to hate on it, until he turned to the dark side Limbus Company isn’t just bad—it’s the kind of bad that feels intentional, like the developers were conducting a psychological experiment to test how long someone can stare at a loading screen before losing their will to live.\r\n\r\nThe gameplay is a disaster. Not a fun disaster, like watching a clown car catch fire—no, this is the slow, miserable kind, where every button press feels like a mistake and every fight feels like the game is punishing you for daring to participate. The combat system is somehow both overly complicated and mind-numbingly boring, which I previously believed to be physically impossible.\r\n\r\nThe story? Imagine someone shredded a philosophy textbook, fed it to a blender, poured in some dictionary entries, hit “purée,” and then told you to emotionally connect with it. That’s Limbus Company’s narrative experience.\r\n\r\nAnd the progression… I hope you enjoy grinding, because this game treats your time like it’s disposable. The resource economy feels like it was balanced by a committee of sleep-deprived pigeons.\r\n\r\nThe UI should be preserved in a museum as an example of “How to Make Every Menu Feel Like a Punishment.” Nothing is intuitive. Everything clicks like it’s resisting you. Even the sound effects feel like they’re sighing in disappointment.\r\n\r\nIn conclusion, Limbus Company is the kind of game that makes you question your life choices, your hobbies, and possibly your eyesight. It’s stylish, sure—but so is a garbage fire from a distance.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worse than deltarune and undertale combined",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "md so boring until you complete canto 7 and canto 7 is impossible without meta units and one section of the game (burn) is unusable for now. the gameplay is meh...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do i like this game? Yes. Does it have a good story and is a fun game? Yes. \n\nIs it also becoming increasingly unstable to the point that its barely possible to download a patch or log-in? Also yes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The story is undeniably good\r\nThe game mechanics are interesting\r\nThe gameplay after completing the current story is boring\r\nBut goddamn, leveling up and uptying your characters is expensive\r\nEven with the premium BP, I'm very often short on EXP\r\nIf you enjoy playing for story, would highly recommend, but it is a nightmare trying to get enough resources to bring your characters to a good level",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is going to be a weird review, \nbecause I love this game.\nHowever, I also can't recommend it fully.\nStory and characters are amazing. I like the whole ID system with the EGOs.\nBut fights can be very frustrating and outragesly difficult. As much as I want to praise Heathcliff's Canto, the amount of times I had to replay the final boss fight is ridiculous. \nThe main reason why I want to finally write a review for this game and a negative one on top of that,\nis the fact that the team likes to break their own game. Constantly.\nThe amount of times you had to find roundabout ways to even play the game is not even funny anymore.\nAnd now there's a bug where you can't even get past the main screen trying to connect you. Which simply sucks when it happens around the same time as an Event that comes around only every so often and allows you access to IDs and EGOs that are otherwise unavailable to you outside of this Event. And when you take a look around to see if there's some kind of solution to the problem, you only spot a quick message of like \"Just quit the game and try again!\". \nGame itself is amazing. But the quality control is horrendous.\nAs much as I want to praise Limbus Company, you can't recommend it to anyone without first warning people about the levels of frustrations it will also cause them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i did not get magic bullet outis, and In turn i got don fucking quixote, so it pissed me off very much, and outis was IN THE BG edging me, like what kinda shit is that? anyways dont play this fucking game all they do is edge you, also FUCK ricardo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is gas but the customer service cant help you if your a FTP ....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tbh, i could barely play LC with my \"3.2 hours\" of playtime. I was just waiting for my game to connect. (I didnt actually get to play it) :sob: Edited: \"3.9 hours of playtime\", Still waiting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game doesn't work. Tried every fix for an hour straight.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the 22 minutes i played were the 22 minutes i waited for the game to load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "idk i didn't really like it, didn't fit my style at all, would not recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "CarlitoMush/Mushfiqthehero made me play this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it's unfortunately a gacha game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When I Joined The Game It Told Me To Download An Update Or Smth I Downloaded for Hours And I Couldn't Even Play It",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME SUCKS WHERES MY 5000 FREE PULLS I WANT A SSR NOT A 3STAR WHAT IS THIS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "you cant cuddle and femboy roleplay with sancho",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "game sucks like dick and penis i hate it 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks fucking ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ass game pulled the same don quixote 9 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gave me a gambling addiction then burnt me out in canto 4",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I got lost hiking up a mountain, and I saw a shepherd. I asked him \"How far up are we?\" and he answered \"Limbus Company.\" That's how I realised, I already knew the answer. We were at the bottom of the barrel",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit bro idk it too hard or smth",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rodion didnt come out of my screen and smother me in her thighs",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "gam shit dont plsy if you waand live good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What the hell did I just download?  An audio book.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game gets good when you close it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "how do you even beat the tutorial bruh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "literally nothing to do in this game 😂🫱🫱🫱",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "holy fucking shit this walpurgis sucks ass",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "unfun as shit the stories fun tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is fucking shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Microwave_Lord-\"cant sex the clock dante (yet) :(\"",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "that fucking game that i hate",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't fuck the silly girl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't sex the funny Yellow Thing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I liked library of ruina better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game kinda ahh ngl",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Zzzz mimimimi Zzz mimimi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bum ah game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game SUCKS",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no porn or sex 0/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant fuck faust 0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "addicting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible nonsense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game jelek",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dude why is everything so expensive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "company got greedy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "don quixote sinclair hetgem",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BAD GAME I HATE THIS.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dongbaek makes me want to kill myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "playing this gave me cancer",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I DIED IN THE TUTORIAL FIGHT FUCK THIS GAME I HATE YOU",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't get shit when I roll",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too much dialog",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Roblox is toooo hardddddd :C",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do NOT play ts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dogshit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "im gonna kill someone",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no no no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "NOOOOOOOOOOOOOOOOOOOOOOOOOOOO NOT AGAIN I FIRST REVERSE 1999 NOW THIS NOOOOOOOO NO NO NO NO NOP NO NOEN OWN GIWREH GOILWH LIGOSH GFLVHDU JOFWYehr gY HWDEKUOFH,WEAFCHZSKAEHYFCDLOWQEJ FCHLOAKZ VZJKSGHVBYDSFR",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PLEASE ADD V-SYNC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "so boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Limbus Company",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they not have ###",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i hate incels",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "du",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DONGBAEK FUCK YOUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dsadaw rfsgtbhjrwshwiuoanianhifruhhuisurawoiransd\r\n\r\noutis..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LET ME FUCKING PLAY THE GAME GOD IM STUCK ON THE FUCKING LOADING SCREEN  GAHHHHHHHHHHHHHHHHHHHHH (otherwise this game a 10/10)",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "I've been a Project Moon supporter for a long time. I bought Lobotomy Corporation back in 2019 when it still had an incomprehensible EN translation, and before Library of Ruina was even a thing. I have been immersed in PM's world, lore, and setting for years. I have read Leviathan and Distortion Detective multiple times over and loved both of them to pieces.\n\nWhen Project Moon announced that Limbus Company was going to be a gacha game, I immediately felt that the future of the franchise would be tenuous. But I had faith in the Director's word, and his vision that he'd been sharing with us for years already. The gameplay was shallow and disappointing, but we were getting more Project Moon writing and lore, so it was serviceable for a time. The gacha was only in service of getting other games shipped anyways, supposedly. Distortion Detective was even cancelled because Project Moon claimed to have huge plans for it, so surely that's going to be a huge priority with all the gacha money the team will have to work with... right?\n\nWell, Project Moon have very thoroughly proven otherwise. They announced on an anniversary event that they'd be shuttering all non-Limbus projects indefinitely (utterly insane thing to do by the way, such incredible balls to spit in the face of all their old guard fans during a supposed celebration), they've slowly made the F2P experience more hostile by implementing a week waiting period on sharding to induce FOMO while increasing the rate of ID release to bleed players dry on shard boxes, and now they've implemented a truly limited collab event that can take up to 600 (SIX HUNDRED) pulls for players to get all the items. This is made much worse by the fact that the E.G.O pool is heavily diluted if you don't own all of the older ones already on top of having the worst rates in the game — I cannot imagine how horrific the pulling experience must be for newer players that still have a lot of standard E.G.O in their pool through no fault of their own, making the collab's gacha content even more difficult to attain.\n\nBut even worse than all that is the consequences this collab has on the actual core of the game! Project Moon choosing to sacrifice an entire Intervallo story arc, which probably would've been tremendously important for the development of a main character and built up their backstory going into their major story arc? What are we even doing? How can you choose to abandon content that belongs in the CORE GAME just to have an indulgent, masturbatory collab with another game just because the Director really likes it? If it's that easy to cloud his vision, then why should I have any faith in it moving forward? And that's just the tip of the iceberg — there's even more content being lost to facilitate this highly temporary, dubiously canon collab/fanfiction event that will be permanently removed from the game in four weeks. Great allocation of resources. I'm so glad that a ton of content needed to be cut to produce this transient, tasteless waste.\n\nIf you're curious about this game because you've been influenced by diehard secondary fans of the franchise going crazy about it on Roblox or underage Twitter, which is now Project Moon's main western fanbase, I would very much encourage you to go play and enjoy Lobotomy Corporation and Library of Ruina instead. The writing in those games and the subsequent novels are what made Project Moon truly soar. While Limbus Company has some high highs in its writing, the vast majority of its story content is a complete disappointment in comparison to the prior two games. Meaningless filler and empty prose, flanderized caricatures instead of characters (Did you know Rodion likes eating? The game will be sure to tell you every other time she speaks), terrible plot contrivances, and horrendous pacing/story restrictions due to the live service model's developmental time restraints. The tone between everything Project Moon has produced before Limbus and Limbus Company itself is like night and day, two entirely different universes, and it sucks. It's really disappointing.\n\nOn top of all of this, despite the fact that the game has been in service for nearly three years now, the management of the game is utterly atrocious. The game is constantly experiencing delays and gaps in content because the Director refuses to invest in company growth, due to the fact that he wouldn't be able to 'control' his employees as thoroughly. The game is riddled with bugs almost every patch, both big and small. There have been multiple instances of huge drama stemming from the incompetent and poor management of the project. Project Moon seem to want to be able to pull their \"small indie developer\" card and garner sympathy by having the Director cry on stream about how mentally ill and stressed it would make him to actually improve the production of the game, but also reap the rewards of the gacha model by raking in boatloads of cash to blow on superfluous things that the Director wants for vanity purposes, like an anime or this collab.\n\nHere's to another ten years of Limbus Company and nothing else. No city builder, no action game, no Distortion Detective, nothing. Because no matter how bad this game gets, its adherents will pronounce it to be \"PEAK\" and shatter spending records every time a new FOMO banner rolls out. It's painfully ironic to see the Director become the very definition of corporate greed that he's spent his entire career up until now criticizing with this very franchise. And if you read this and your first reaction is to feel offended, or feel that you need to defend Project Moon's transparently profit-driven decisions, then congratulations! You've developed a parasocial relationship with a businessman that openly says he just wants your money. Project Moon is not your friend and they will continue to fleece you dry if you let them. I will continue to play this game because I am still interested enough in where the story is going to see it to its conclusion, but my interest, faith, and patience for Project Moon as a studio has dried up completely. I will not spend another cent on this game, and I encourage you to do the same if you're reading this.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Mayors fight is just proof that the apology about unbreakable coins was a lie.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "I used to think that bad gameplay is tolerable for as long as the story was good; but the more I played this game the less I believed it. I really do love the character dynamics, music, art and especially the story. I even have plushies and keychains of Hong Lu, but I just cannot in good conscious recommend this game to anybody because it is purely masochistic. It's almost as if I had stockholm syndrome with this game for the past 2 years. The gacha is also one of the most polarizing things I've ever seen. I have never seen a game be so generous with pulls but make it nearly impossible to pull something you want without having to reach hard pity.\n\nMaybe I'm just salty about pulls, but honestly, it is a \"good\" gacha game but in the end it is still a [i]gacha[/i] game",
      "voted_up": false,
      "votes_helpful": 14
    }
  ]
}