{
  "positive": [
    {
      "review": "I played the game on mobile first and now i'm playing on pc and i must say feels a lot better using controller to play the game a lot of characters to choose from very fun can also play with a friend in dungeons for better drops in the game they have a store where u can purchase pact allies or pets and they have passive traits that give u damage boost or support and increases to loot and u have to get items to level up the allies it's like getting the same card 6 times to max them out and you can have a total of 6 on so can dump some money into the game if you are a fortunate to do so however the game also give u items to summon these for free from progression in main campaign and completing challenges along the way it is a auction house to purchase gear from but the main currency used to purchase from the auction house starts dropping after level 85 and the market place is inflated thanks to whoever selling the currency in the game like most games overall i give the game 8/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the grind is real. but i love it. the game is as simple as possible and you can make weird builds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aside from the heavy p2w aspect, game is pretty solid. Then again, you'd have to put in 3-4x the effort of an averagw whale to even feel rewarded for playing-which most people wont do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of Arcane and War Hammer Vibes  If you want roleplay Poe 2 or Last Epoch  In the future ! Such a good and Amazing grind ! Convert your Supressed & Excess energy into  a feeling of Victory and Joy .  Music and landscape Premium quality,  We await, come and try with us!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best ARPG after PoE 1, hands down.\r\n\r\nMTX are pretty bad tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is fun game has a lot of ideas to make it the only downside is the pet system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, will get you addicted :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont need a long time to feel the fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that I can fit it into my spare time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just got out tutorial seems fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "better than diablo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "borgar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "eyyy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked Diablo 3 / PoE1 because you could zoom around and 1 tap entire screens, u will love this game. P2W elements are so heavily blown out of proportion it's not even funny, easy way to determine whether it's going to be an issue for you is by asking yourself \"am I going to try to push for the top 1%?\" if your answer was no, then it's literally fine, it's a single player PvE game. Let the 1% of Chinese whales battle it out and pump a bunch of money into the game so they can keep releasing new seasons, updates etc, it's genuinely not that serious.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "I played the game on mobile first and now i'm playing on pc and i must say feels a lot better using controller to play the game a lot of characters to choose from very fun can also play with a friend in dungeons for better drops in the game they have a store where u can purchase pact allies or pets and they have passive traits that give u damage boost or support and increases to loot and u have to get items to level up the allies it's like getting the same card 6 times to max them out and you can have a total of 6 on so can dump some money into the game if you are a fortunate to do so however the game also give u items to summon these for free from progression in main campaign and completing challenges along the way it is a auction house to purchase gear from but the main currency used to purchase from the auction house starts dropping after level 85 and the market place is inflated thanks to whoever selling the currency in the game like most games overall i give the game 8/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its a fun poe alternative, like the Pepsi of ARPGs. Its not perfect, and the downsides are really big, but theres fun to be had here. \n\nThe pets system absolutely gates what type of content you can viably farm. And with \"viable\" i mean at a pace good enough to be sustainable and keep up with the rapidly growing inflation after a season start. \n\nInitially without any farm pets, you will be promptly be sent to the bossrush mines, its the content everyone recommends newcomers to do not because it simple (although it is) but rather cause it requires no investment. Unfortunately, Torchlight relies heavily on what farm pets you have and their level dictate your drops which lets you snowball even faster. So as a newcomer, you have one good strat, maybe two other objetively worse alternatives and thats it. \n\nIm not saying this to argue that the game is not worth playing, on the contrary it can be very enjoyable. but its clear that your options branch out the more seasons you play and therefore more pets you earn (or swipe to buy). \n\nMy favourite aspect of the game is how every strat is fairly digestible right off the bat so you can grind it easily. Ofc theres the aforementioned restriction on what is actually good, but design wise they are awesome. Your character growth goes from millions to billions and eventually trillions of DPS, and something such as D3 this process is fun and cohesive. You get access to higher item bases, more powerful uniques and stronger interactions the deeper you go, and that results in massive power spikes. \n\nTheres a lot of Quality of life ingame that could be an inspiration for its competitors. Ingame build guides, atlas templates and loot filters make the experience very approachable even for someone who isn't familiar with the genre, you can see that there is a lot of effort put into not having you rely on third party tools or esoteric knowledge buried deep within wiki pages. \n\nIgnoring monetization and how it affects design, its a solid 8/10. Taking into account how they affect your options and how not everyone wants to bossrush season after season, it drops to a 5/10. Play it once, beat traveller 8 and see for yourself whether its worth. And for F2P, think of the game as a long term investment. Log in for a few days every season to build your roster of pets, and you will steadily expand your progression pacing at the endgame.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This games is great. New characters are added every season and many classes can be brought into the late game. Mass dungeon destruction is accessible when chasing meta builds. Creators post enough external content about the game to make the late game accessible for new players within a week of grinding.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the grind is real. but i love it. the game is as simple as possible and you can make weird builds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I give it a 4/5 because it's pretty much the second best arpg on the market right now it just has some real p2w issues but if you have been playing long enough or can get past that it's one of the best arpg experiences you can get outside of poe 1 with the kind of quality of life you wish was in other arpgs. I have 2 level 6 drop pets so I am a bit biased and have been gifted alot of free pulls but they have been giving a free pet every season so the sooner you start the better experience you will have in the long run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is interesting but my old PC can't run it well with minimum graphics, it's a shame because the game is entertaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, lots of stuff to do all around. The game starts off relatively easy but progresses into a challenging and rewarding game down the line. Definitely give this game a good chance to prove itself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Aside from the heavy p2w aspect, game is pretty solid. Then again, you'd have to put in 3-4x the effort of an averagw whale to even feel rewarded for playing-which most people wont do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "2nd Best ARPG to the Path of exile series, if new to this genre play Diablo first, if you cant hack it in that game and figure it out, then this game is not for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game. Its mix of a few other ARPGs. it borrows elements from each and makes it a great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a 10/10 from a pure gameplay perspective. Its incredibly fun, amazing gameplay loop and easy to get into while being able to be accessed via PC and mobile. Also every character is free except the newest one which is always a part of the current Battle Pass. \r\n\r\nDownside is loot pets, they DO make a difference and can be considered P2W, but honestly I think how good the quality of life and gameplay is outweighs the negatives of these being in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An actual good game if you look past the Pay to Win with the pact spirits. you can do the same stuff, but it will just take longer to achieve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of cut seens easy game play but not allot of build explanations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yerp, it's good. good overall gameplay, graphics, and story! recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Second best ARPG, after PoE1. Lots of systems to get into, complex end game that keeps you entertained, and amazing character growth if you are willing to spend the time for it!\n\nThe game does have P2W elements to it, but you can very easily play without. You get a lot of \"freebies\", and if you play enough, you will see the benefits of just playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game . Downside P2W, but u can pretty much do almost all content F2P with a good build",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good to add in between your ARPG league rotations.  Surprising amount of content with past and present league mechanics (for you POE players).  Pay to win is more or less pay to progress faster in the form of Loot pets.  If you swiped and got Chalk (I do have $100 into the game and do not have him) you'll see more of the game's trade currency.\n\nNo need for third party programs or additional browser tabs since all the community guides are built in.  \n\nSome things to consider as season 12 is my first league (Bing2 chain lightning, my only character and can comfortably clear Timemark 8-2 and pushing into Profound).....Do yourself a favor and league start Thea3 if it isn't nerfed from the point of this review and then transition to another build...jk.  Though I had another friend start a week after me and she reached T7 mapping in 3-4 hours.  \n\nDon't compare your progress to long time players/creators.  Enjoy loot explosions when they happen.  Gameplay loop is fast paced.  Do not play if you have spending/gambling problems.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty cool as long as you like to be told you should spend more money every 12 seconds. Game play is worth ignoring this though",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "TLI is a great game!\nDoes it have P2W: yes\nIs it still worth playing? VERY YES\nThe devs put a lot of effort into every season and the QoL and crafting in this game is some of the best in the genre. I wish that every ARPG player would come and play for a season just so that other games would be forced to add stuff like in-game auction house, in-game build guides, in-game loot filters, and such much more.\n\nNote that this game is rather grindy to complete a season; however, it is really fun to do because you are always in the action. I barely touch my inventory and this game is NOT a loot management simulator like so many other ARPGs. \nMany other games could learn from TLI's endgame about how to help players set season-long goals. \n\nWhile I myself am not F2P, I have several friends who are F2P and they still have a good time with the game.  You can unlock a lot of pacts without spending and every character besides the new one is free to play.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "casual rpg game play pretty good, a combination of PoE and gensin impact",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An overall fun game. Pay for things if you want, but the game is put together well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game i beat most of the game content as F2P except deep space.\nIt aint the best arpg but its fun.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's not the same torchlight as seen before. I have to admit I love listening to an audiobook and just grinding away. My nintendo controller works pretty well, although it feels clunky and can be hard to grasp at first. It feels like a pattern of buttons that have to memorized rather than following the menus or icons.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Pretty fun, bunch of seasonal content integrated into the endgame so there's an \"atlas\" style passive tree where you can fine tune what mechanics you see in the endgame (which only takes like 5 or 6 hours to get to) you don't need to pay to win im not sure people who are saying that have played it to endgame. I've only played 3 or 4 seasons but its cool to throw 30 hours at to see how fast you can make the screen explode. It is a mobile game though, so once i get to endgame im just playing on my phone to grind out maps with my gigapsycho.\n\nJust don't swipe. use the free currency on the 80% off stuff its not that hard to figure out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice gameplay, interesting mechanics, solid ARPG, and the builds feel GREAT for end-game farming, everything explodes and casts automatically so you can zoom through the maps. That being said, as much as I like the gameplay, this is more of a mixed review for the reasons below...\n\nThe game has pay-to-win elements with the pets, and it's through a terrible gacha system. Expect people with lv6 pets to make 2x your loot while farming the same content/difficulty. You can slowly get them over time if you dedicate ~200h/season to get a free Legendary pet and crystals through bonuses and events, so yeah it's possible to be f2p but it will take a lot of dedication and time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of Arcane and War Hammer Vibes  If you want roleplay Poe 2 or Last Epoch  In the future ! Such a good and Amazing grind ! Convert your Supressed & Excess energy into  a feeling of Victory and Joy .  Music and landscape Premium quality,  We await, come and try with us!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best ARPG after PoE 1, hands down.\r\n\r\nMTX are pretty bad tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is fun game has a lot of ideas to make it the only downside is the pet system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, will get you addicted :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont need a long time to feel the fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that I can fit it into my spare time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just got out tutorial seems fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "better than diablo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LIKE IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "borgar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "eyyy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you liked Diablo 3 / PoE1 because you could zoom around and 1 tap entire screens, u will love this game. P2W elements are so heavily blown out of proportion it's not even funny, easy way to determine whether it's going to be an issue for you is by asking yourself \"am I going to try to push for the top 1%?\" if your answer was no, then it's literally fine, it's a single player PvE game. Let the 1% of Chinese whales battle it out and pump a bunch of money into the game so they can keep releasing new seasons, updates etc, it's genuinely not that serious.",
      "voted_up": true,
      "votes_helpful": 47
    },
    {
      "review": "I played the game on mobile first and now i'm playing on pc and i must say feels a lot better using controller to play the game a lot of characters to choose from very fun can also play with a friend in dungeons for better drops in the game they have a store where u can purchase pact allies or pets and they have passive traits that give u damage boost or support and increases to loot and u have to get items to level up the allies it's like getting the same card 6 times to max them out and you can have a total of 6 on so can dump some money into the game if you are a fortunate to do so however the game also give u items to summon these for free from progression in main campaign and completing challenges along the way it is a auction house to purchase gear from but the main currency used to purchase from the auction house starts dropping after level 85 and the market place is inflated thanks to whoever selling the currency in the game like most games overall i give the game 8/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its a fun poe alternative, like the Pepsi of ARPGs. Its not perfect, and the downsides are really big, but theres fun to be had here. \n\nThe pets system absolutely gates what type of content you can viably farm. And with \"viable\" i mean at a pace good enough to be sustainable and keep up with the rapidly growing inflation after a season start. \n\nInitially without any farm pets, you will be promptly be sent to the bossrush mines, its the content everyone recommends newcomers to do not because it simple (although it is) but rather cause it requires no investment. Unfortunately, Torchlight relies heavily on what farm pets you have and their level dictate your drops which lets you snowball even faster. So as a newcomer, you have one good strat, maybe two other objetively worse alternatives and thats it. \n\nIm not saying this to argue that the game is not worth playing, on the contrary it can be very enjoyable. but its clear that your options branch out the more seasons you play and therefore more pets you earn (or swipe to buy). \n\nMy favourite aspect of the game is how every strat is fairly digestible right off the bat so you can grind it easily. Ofc theres the aforementioned restriction on what is actually good, but design wise they are awesome. Your character growth goes from millions to billions and eventually trillions of DPS, and something such as D3 this process is fun and cohesive. You get access to higher item bases, more powerful uniques and stronger interactions the deeper you go, and that results in massive power spikes. \n\nTheres a lot of Quality of life ingame that could be an inspiration for its competitors. Ingame build guides, atlas templates and loot filters make the experience very approachable even for someone who isn't familiar with the genre, you can see that there is a lot of effort put into not having you rely on third party tools or esoteric knowledge buried deep within wiki pages. \n\nIgnoring monetization and how it affects design, its a solid 8/10. Taking into account how they affect your options and how not everyone wants to bossrush season after season, it drops to a 5/10. Play it once, beat traveller 8 and see for yourself whether its worth. And for F2P, think of the game as a long term investment. Log in for a few days every season to build your roster of pets, and you will steadily expand your progression pacing at the endgame.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This games is great. New characters are added every season and many classes can be brought into the late game. Mass dungeon destruction is accessible when chasing meta builds. Creators post enough external content about the game to make the late game accessible for new players within a week of grinding.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "the grind is real. but i love it. the game is as simple as possible and you can make weird builds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I give it a 4/5 because it's pretty much the second best arpg on the market right now it just has some real p2w issues but if you have been playing long enough or can get past that it's one of the best arpg experiences you can get outside of poe 1 with the kind of quality of life you wish was in other arpgs. I have 2 level 6 drop pets so I am a bit biased and have been gifted alot of free pulls but they have been giving a free pet every season so the sooner you start the better experience you will have in the long run.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is interesting but my old PC can't run it well with minimum graphics, it's a shame because the game is entertaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, lots of stuff to do all around. The game starts off relatively easy but progresses into a challenging and rewarding game down the line. Definitely give this game a good chance to prove itself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Aside from the heavy p2w aspect, game is pretty solid. Then again, you'd have to put in 3-4x the effort of an averagw whale to even feel rewarded for playing-which most people wont do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "2nd Best ARPG to the Path of exile series, if new to this genre play Diablo first, if you cant hack it in that game and figure it out, then this game is not for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game. Its mix of a few other ARPGs. it borrows elements from each and makes it a great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a 10/10 from a pure gameplay perspective. Its incredibly fun, amazing gameplay loop and easy to get into while being able to be accessed via PC and mobile. Also every character is free except the newest one which is always a part of the current Battle Pass. \r\n\r\nDownside is loot pets, they DO make a difference and can be considered P2W, but honestly I think how good the quality of life and gameplay is outweighs the negatives of these being in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An actual good game if you look past the Pay to Win with the pact spirits. you can do the same stuff, but it will just take longer to achieve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of cut seens easy game play but not allot of build explanations",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yerp, it's good. good overall gameplay, graphics, and story! recommended!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Second best ARPG, after PoE1. Lots of systems to get into, complex end game that keeps you entertained, and amazing character growth if you are willing to spend the time for it!\n\nThe game does have P2W elements to it, but you can very easily play without. You get a lot of \"freebies\", and if you play enough, you will see the benefits of just playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game . Downside P2W, but u can pretty much do almost all content F2P with a good build",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good to add in between your ARPG league rotations.  Surprising amount of content with past and present league mechanics (for you POE players).  Pay to win is more or less pay to progress faster in the form of Loot pets.  If you swiped and got Chalk (I do have $100 into the game and do not have him) you'll see more of the game's trade currency.\n\nNo need for third party programs or additional browser tabs since all the community guides are built in.  \n\nSome things to consider as season 12 is my first league (Bing2 chain lightning, my only character and can comfortably clear Timemark 8-2 and pushing into Profound).....Do yourself a favor and league start Thea3 if it isn't nerfed from the point of this review and then transition to another build...jk.  Though I had another friend start a week after me and she reached T7 mapping in 3-4 hours.  \n\nDon't compare your progress to long time players/creators.  Enjoy loot explosions when they happen.  Gameplay loop is fast paced.  Do not play if you have spending/gambling problems.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty cool as long as you like to be told you should spend more money every 12 seconds. Game play is worth ignoring this though",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "TLI is a great game!\nDoes it have P2W: yes\nIs it still worth playing? VERY YES\nThe devs put a lot of effort into every season and the QoL and crafting in this game is some of the best in the genre. I wish that every ARPG player would come and play for a season just so that other games would be forced to add stuff like in-game auction house, in-game build guides, in-game loot filters, and such much more.\n\nNote that this game is rather grindy to complete a season; however, it is really fun to do because you are always in the action. I barely touch my inventory and this game is NOT a loot management simulator like so many other ARPGs. \nMany other games could learn from TLI's endgame about how to help players set season-long goals. \n\nWhile I myself am not F2P, I have several friends who are F2P and they still have a good time with the game.  You can unlock a lot of pacts without spending and every character besides the new one is free to play.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "casual rpg game play pretty good, a combination of PoE and gensin impact",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An overall fun game. Pay for things if you want, but the game is put together well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game i beat most of the game content as F2P except deep space.\nIt aint the best arpg but its fun.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It's not the same torchlight as seen before. I have to admit I love listening to an audiobook and just grinding away. My nintendo controller works pretty well, although it feels clunky and can be hard to grasp at first. It feels like a pattern of buttons that have to memorized rather than following the menus or icons.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Pretty fun, bunch of seasonal content integrated into the endgame so there's an \"atlas\" style passive tree where you can fine tune what mechanics you see in the endgame (which only takes like 5 or 6 hours to get to) you don't need to pay to win im not sure people who are saying that have played it to endgame. I've only played 3 or 4 seasons but its cool to throw 30 hours at to see how fast you can make the screen explode. It is a mobile game though, so once i get to endgame im just playing on my phone to grind out maps with my gigapsycho.\n\nJust don't swipe. use the free currency on the 80% off stuff its not that hard to figure out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice gameplay, interesting mechanics, solid ARPG, and the builds feel GREAT for end-game farming, everything explodes and casts automatically so you can zoom through the maps. That being said, as much as I like the gameplay, this is more of a mixed review for the reasons below...\n\nThe game has pay-to-win elements with the pets, and it's through a terrible gacha system. Expect people with lv6 pets to make 2x your loot while farming the same content/difficulty. You can slowly get them over time if you dedicate ~200h/season to get a free Legendary pet and crystals through bonuses and events, so yeah it's possible to be f2p but it will take a lot of dedication and time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of Arcane and War Hammer Vibes  If you want roleplay Poe 2 or Last Epoch  In the future ! Such a good and Amazing grind ! Convert your Supressed & Excess energy into  a feeling of Victory and Joy .  Music and landscape Premium quality,  We await, come and try with us!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best ARPG after PoE 1, hands down.\r\n\r\nMTX are pretty bad tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is fun game has a lot of ideas to make it the only downside is the pet system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, will get you addicted :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont need a long time to feel the fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like that I can fit it into my spare time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just got out tutorial seems fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I know I clicked the \"not recommended to other players\". Let me explain:\r\n1. The artwork is solid. Really good. The music is also quite good.\r\n2. The action is passable. A little cartoony for my liking, but not a deal-breaker.\r\n3. I can never recommend a game that uses Gacha and FOMO mechanics to gain access to un-guaranteed significant player power. But I guess that's now a company goes from GGG-size to Nexon-size, amirite?",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "I’ve spent a lot of time on this game since its release, and it has slowly shifted from a genuinely good experience to an aggressively pay-to-win one.\nI don’t recommend it to anyone – your time is better spent elsewhere.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Came back to the game after a good long while and it changed into a mobile game at somepoint? Not sure when the switch from what it used to be to this one level at a time with a world map that resembles candy crushes. This game is weird now and I miss being able to create my own characters. Not sure why I have to pick random heroes like this is some other game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Has the look of a solid ARPG but none of the soul. Monetization, pacing, and bland loot progression make it hard to enjoy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They have terrible balance of the classes, only a couple are viable for early play making it hard to play something you want to if you play HC, controller players welcome to hell because they did not make this game for you",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tbh it feels like mobile game. playing with controller is absolutely afwul",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my ocd just cant the words dont match whats being said alot and that bugs me sry but i cant try this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game had potential, the gameplay and graphics are interesting. Otherwise, coop is complicated, the controller support for the ui is atrocious and it's filled with too much paid stuff",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Keybinds sucks . Certain keys cannot be bind ( somme basics of hack & slash games like numbers ) .\nWith this , game is unplaybable for me .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: I prefer games with less restrictive class systems, or at least more good looking to compensate negatives (yeah I liked Wolcen overall).\r\n\r\nI won't talk about P2W mechanics, as that is obvious to anyone with 2+ brain cells.\r\n\r\nGraphics is average, does not look BAD, but kind of dated for 2025 even for mobile. Sound/combat effects are... i would say bad.\r\n\r\nIt's not a bad ARPG, but the issue is that you are basically selecting specs within classes, rather than full classes themselves. These specs have strict passives that are often tied directly to specific active skills. This system effectively locks you into one playstyle until you decide to roll a completely new character/class.\r\n\r\nFurthermore, some of these classes (though not all of them!) are even more limited. Imagine if the Necromancer in Diablo IV could technically use any skill, but playing anything other than Decrepify would be so severely sub-optimal that it's not a viable choice.\r\n\r\nFinally, I don't like how magic wands look in this game, including the skins from the cash shop. They all look more like axes and heavy maces.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "extreme pay to win mechanics.  every purchase is rng.  I would buy what i wanted outright but the randomness of the store is a hard pass for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another diablo clone with basic ah characters. Some of the images look AI. Takes way too long to unlock multiplayer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrible UI alone is enough reason to not play this game.\n\n0.1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A joke. Insulting to gamers who expect a baseline of gameplay.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Have you played your previous games?\nIt feels like you missed the thing that made them amazing",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its what not i expected from torchlight franchise. Its sooo bad",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Reminded me of lost ark - had some good things going for it - but pay to win? Never again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "bland game no flavor",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's not Torchlight",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "XD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P2W...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Generally, the game is good.\r\n\r\nThere are plenty of things to do and smooth transitions between locations. FPS is stable.\r\n\r\nThat being said, the monetization is horrible.\r\nYou will never be able to achieve the same progress in the same amount of time as someone with level 6 pets. The predatory system is designed to exploit basic human instincts, making it difficult for those without strong willpower to resist the urge to swipe (spend money).\r\n\r\nLet me explain in detail just how bad the pet system is in this game, especially when compared to what a free player experiences:\r\n\r\n1. Seasonal Pets & Mechanics\r\n\r\nEvery season, a new pet is released along with a new endgame \"mechanic.\" The pet is directly tied to this mechanic and determines how much loot you can generate. Without the pet, you’re already behind.\r\n\r\n2. Massive Progress Gap\r\n\r\nFree players are stuck progressing around 14x slower compared to players with a level 6 pet. The gap is massive and discouraging.\r\n\r\n3. Unfair Early Advantage\r\n\r\nAnyone who swipes for the pet at the start of each league gains an immense advantage over free-to-play players. This early boost snowballs quickly, making it hard to catch up.\r\n\r\n4. Pet Leveling is Pay-to-Win\r\n\r\nPETS wouldn't be such a problem if you only needed to buy them once but they must be leveled up to level 6 to be effective. And to level them, you have to swipe and the odds are not in the favor of the spender.\r\n\r\nThe difference between a level 1 and level 6 pet is like night and day. A level 1 pet might give you 2x rewards from a mechanic, while a level 6 pet can generate 14x more loot in the long run, compared to a free player.\r\n\r\n5. Battle Pass Manipulation\r\n\r\nEach season, a battle pass is released. The issue? It includes an \"auto-loot\" function  but only if you own at least one pet.\r\nThat means free players are stuck clicking manually to pick up currency, while swipers enjoy full automation. Inconvenient, right? It’s just another predatory system designed to wear you down and make you spend.\r\n\r\n6. Two Types of Pets, Two Layers of Monetization\r\n\r\nThis game has two types of pets:\r\n\r\nCombat pets\r\n\r\nMechanic pets\r\n\r\nIf you thought only the mechanic pets created disadvantages, guess again. Combat pets are outright pay-to-win offering direct power gains.\r\n\r\nThis gives paying players a huge edge in reaching endgame faster and dominating the economy. Once they get there, gear prices skyrocket often inflated 20x. At that point, no matter how many hours you put in as a free player, you simply can’t keep up.\r\n\r\nAnd that’s by design another psychological lever in this monetization scheme.\r\n\r\nThe most concerning part?\r\nThis kind of monetization fosters negative experiences and targets the most vulnerable communities.\r\n\r\nPeople who can’t recognize the psychological tricks or who struggle with things like gambling addiction, fear of missing out, or a need for power over others are most at risk of falling into the trap.\r\n\r\nAnd the game preys on them deliberately.",
      "voted_up": false,
      "votes_helpful": 700
    },
    {
      "review": "Completely devoid of almost everything that made the Torchlight series so great. Anime marketing for some reason?\n\nThis studio has no idea what they're doing with this IP and it's really sad. Pay2Win content and predatory monetisation. Don't give this company money.",
      "voted_up": false,
      "votes_helpful": 265
    },
    {
      "review": "It's not Torchlight, it's just wearing the name to draw old fans in to a mediocre mobile game.",
      "voted_up": false,
      "votes_helpful": 173
    },
    {
      "review": "P2W Gacha Mobile Cash Grab. If mindless paying and grinding is your thing, then this is your game.",
      "voted_up": false,
      "votes_helpful": 168
    },
    {
      "review": "If you played and loved Torchlight 1 and 2, don't play this, its not Torchlight, its just a skin on a shitty mobile game",
      "voted_up": false,
      "votes_helpful": 129
    },
    {
      "review": "Pay to Win game. A terrible joke masquerading as a Torchlight game. The old Torchlight died for this? Terrible. Don't play it. Unless you want to dish out money to a game for digital advantages.",
      "voted_up": false,
      "votes_helpful": 81
    },
    {
      "review": "Do not try this game, it's not a fun experience or anything at all. This game is for a eastern oriented player base and doesn't give a damn about all other players. Basically you need to have all pets or buy illegally currency. For a normal player you need to have 500+ hours in a season( if you are lucky ) in order to even get near to a late game ( this doesn't mean getting \"free\" pets from \"events\" ). Predatory game with the intention of making you be frustrated for all of the time and money invested in it. Get you fingers away from this one, there's a plenty of games that you can try and buy for the amount of money that you will invest in this F excuse of a game and at the end after two years of frustration and realization you will end up realizing it is not worth! Huge Pass guys, do not try it!",
      "voted_up": false,
      "votes_helpful": 100
    },
    {
      "review": "As a new player who just downloaded the game, I sent an e-mail to their support saying I made an honest mistake and bought the season pass & hunter's fund a few hours before it ended because I had no idea when or what was going on. I totally thought this season pass was for the new one, but the great XD \"support\" team refused to help in any way or form and decided to grab the money and run away with it.\nI even tried to tell them I needed to speak to a manager and that they needed to understand and support new players who may make such errors. It isn't a matter of money, but rather about fair treatment and a sort of ethical approach towards human errors as I was overwhelmed and had zero clear indication. They still kept refusing and blaming me and literally telling me to pay attention!\n\nI got nothing out of the Season Pass and the Hunter's Fund... Zero ethics.\n\nOn a side note, be careful of the paid and fake positive bot reviews they're pushing out. Game is a full p2w gacha simulator. Try reading Mobalytics article to get a very tiny peek of the horrors getting cooked behind closed doors at XD, it will only get worse, you have been warned, read further if you need a small glimpse.\n\nBe very aware that the game's main direction now is to make it harder and harder to obtain Flame Elementium, game's main currency for trading between players, to force you to take one of two paths: either trading their RMT partners, yes they're partners, or buying the P2W pacts and gambling their gacha system for a hefty fee while no life farming, not exaggerating if I say you can lose your monthly salary in a matter of hours, then you will start spending your savings and become one of the addicts crawling this casino themed simulator.\n\nWhales and RMTs are the ones recommending this mobile gacha simulator because money is of no value to them, along with paid reviews and XD bots. Those saying they reached t7 and enjoyed the \"game\" or smooth sailed through the story or anything similar are basically NOT real reviews.\nYou don't even start to scratch the very far outer layer of end \"game\" till you hit t8 maps by having few billions of damage, and t8 has 3 internal tiers BTW each scaling harder, then you have to climb to profound by making sure you have billions on top of billions of damage which is the massive difference between t7 where you can do fine having just millions so you see the difference, then after profound you can do deep space, and that my friend requires trillions on top of trillions of damage, not to mention other actual \"game\" aspects of this simulator. Do the math and figure out the real reviews yourself.\n\nAvoid at all costs, this ISN'T a game.",
      "voted_up": false,
      "votes_helpful": 313
    },
    {
      "review": "I know I clicked the \"not recommended to other players\". Let me explain:\r\n1. The artwork is solid. Really good. The music is also quite good.\r\n2. The action is passable. A little cartoony for my liking, but not a deal-breaker.\r\n3. I can never recommend a game that uses Gacha and FOMO mechanics to gain access to un-guaranteed significant player power. But I guess that's now a company goes from GGG-size to Nexon-size, amirite?",
      "voted_up": false,
      "votes_helpful": 54
    },
    {
      "review": "I’ve spent a lot of time on this game since its release, and it has slowly shifted from a genuinely good experience to an aggressively pay-to-win one.\nI don’t recommend it to anyone – your time is better spent elsewhere.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "A potentiialy good game, ruined by constant gatcha marketing, abysmal controller support/implementation and clunky combat.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "Reach endgame and realise pact pets locked behind p2w GG. Those who have legendary pacts got advantage to farm FE + dmg boost.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Came back to the game after a good long while and it changed into a mobile game at somepoint? Not sure when the switch from what it used to be to this one level at a time with a world map that resembles candy crushes. This game is weird now and I miss being able to create my own characters. Not sure why I have to pick random heroes like this is some other game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Well. I was bored. I'm in between waiting for a game to come out, then play that until next PoE league. So I thought why not. Lets give this a shot finally. \n\nBoy...\n\nLook. The gameplay is pretty fun, mechanics are there, build crafting is cool and the game has clearly drawn huge inspirations from PoE(which is a very good thing). And this is as far as my positives go. \n\nIt's a coomer bait, P2W, gacha mobile slop with all the psychological tricks in the book to pray on people who struggle dealing with addiction. The ARPG aspects are not the game, they only serve as a platform for the actual \"game\" which is the cash store meant to drain every single penny you have and even then it will ask for more. \n\nStay away.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Tried this game because I heard it was fun to play. Was aware it had P2W mechanics but I tried anyway but after playing I can tell you it is a horrible F2P experience and you should keep that in mind when trying this game. Would be a much better experience if I spent around $300 but I wanted to give it a go without spending any money. Would not recommend if you aren't willing to spend some big cash. 3/10",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Trash game. Like really bottom of the barrel. Even for a mobile game this is really bad.\n\nJust looking in the shop you can figure out the problem right away.  They don't really want to make any money on anything direct purchase.  Everything must be gamba gamba gamba.  Can you buy loot? Nope.  Can you buy increased drop rates? Nope but you sure can buy a bunch of raffle tickets to gamba a pet that will give you increased drop rates!  Can you buy skins? A few crappy ones but the rest you better pull out your wallet and buy a pull on that slot machine.\n\nThe rest of the game isn't even worth exploring. If they're fixated on gamba to the point that they don't even really want to sell cosmetics then you know where this is going.\n\nWhen you experience the awful UI and see game play that isn't really different from other ARPGs the only thing this game has left is a different art style and theme.  That art style and theme might be nice but your better off just ignoring it. It's so hilariously bad that premiere website covering ARPG games refuses to even have content on it anymore.  It's a total dumpster fire.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game is a good option if you exhausted every other ARPG out there. Before you play this I would recommend to play Path of Exile 2, Path of Exile, Grim Dawn, Last Epoch, Diablo, Diablo II Resurrected etc.. those are the baseline top games in the ARPG genre. If you exhausted those games then this abomination is free and can scratch your itch. \n\n- Controller support is very bad (like insanely bad)\n- Monetisation is questionable",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I have played this game since pre-release early access. Early on they promised to not sell power.\r\nNow the game is riddled with p2w and anime coomer bait skins with a handful of gacha mechanics at the forefront of every aspect of the game with reminders, events everything imaginable to get you to spend money. \r\n\r\nAs a free to play player your entire purpose is to prop up the ego of whales, with a shared global market you will never be able to be competitive unless you have played for years and racked up legendary pets or swiped a ton.\r\n\r\nThe game is actually great, the devs are clever and the arpg mechanics are amazing but its upsides cannot distract enough and are overshadowed by how egregious the p2w is and how behind you are if you dont swipe.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Has the look of a solid ARPG but none of the soul. Monetization, pacing, and bland loot progression make it hard to enjoy.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The in-game cash shop is insanely overpriced. Nothing here has the visual quality or polish to justify a price beyond $2–$5. The overall design feels dated and uninspired, making the high costs even harder to accept.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Moba controls with mouse only, controller not supported well at all. I love the artwork, but the game feels terrible. If they had controller support, this would be much better to play. Menu heavy as well, and you can tell this is a mobile game with a shitty port to PC.\nKeep in mind the other negative reviews about the monetization as well.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I enjoy the gameplay, but this game is 1000% pay to win. Absolutely every aspect of the game is designed to funnel you into spending money. Absolute dogwater developers who have no idea how to create a successful league content that doesn't involve you having to pay $500. If you haven't played this game yet, don't bother.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Solid gameplay. Decent end-game loop. Huge variety of skills. The campaign is also really short so you're mapping quite quickly.\n\nIt all gets soured abruptly with the gacha pets system.\n\nWhich, in this game is quite important.\n\nBattle pets (more damage, more health, etc)\nLoot Pets (more drops, better drops, more currency drops)\n\nAre gated behind a literal slot machine.\n\nYou can NOT grind the game for pets. \n\nYou can NOT trade for pets.\n\nYou MUST spin the slot machine.\n\n\"But Pokimane Simp, the game gives you a ton of free rolls!\"\n\n\"Hey, Pokimane Simp.. you get a free legendary of your choice on day 7!\"\n\n\"Uh, Pokimane Simp... are you aware the pets aren't P2W? Like it's a 10% damage boost bro come on!\"\n\nBy design, there will be gamblers trapped here and defending this system until the day this game dies. It just doesn't belong in an ARPG and never will.\n\nThis company doesn't need 50 billion to upkeep this game either. The gacha system is an add-on that they KNOW drains money from their players and into their pockets. They KNOW people love gambling. It is a GREEDY decision.\n\nSolid ARPG with a decent end-game, brought down heavily by the inclusion of a gacha slot machine that is NOT grindable through gameplay. (pay money and hope you get the pet you need/want)\n\nWould recommend the game if there were no pet gacha.\n\n(P.S. There is a massive Psyop occurring in which thousands of people will try and gaslight you into saying that the legendary damage pets aren't even that good & that the legendary loot pets aren't that good either. Please avoid them.)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game has numerous issues concerning gearing for end game.\r\n1. Its very difficult to get gear for end game. You either have to have the luck of a god to get good gear, or have equally good luck in getting flame elementium. This is if you are a free to play player, if you pay, its super easy to get gear for end game due to pets.\r\n2. Everything is so damn expesnive.  In order to get to profound on any build, you need thousands of fe. And in order to get fe, you either need the luck of a god, or shill out s*** loads of money to the game to get pets.\r\n3. Horrible drop rates for f2p players. I get this game is pw2 but damn its bad. Not as bad as diablo immortal but its bad.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If you like paying 3x more compared to previous seasons while still progressing 14x slower than p2w whales this is the game for you. I have never had such a bad experience trying to get into profound(end game with more loot) trying to upgrade anything while making fuck all in currency is infuriating and I recommend anyone who respects their time to not get baited like myself",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm uninstalling this pice of s*\nToo much lag to be playable\nAlso they added a time limit on fight which it too little to overcome for both non-dps builds due to lack of damage and dps builds due to lack of survival\nAnd too many bad mechanics at point of being utterly unfair\nStay away as f*",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I have played all the torchlight games and by far this is the worst one (They found a way to make torchlight full of micro transactions just like every stupid mmorpg game out there, how unfortunate that this will happen to every game out there, good example is Skyrim & Fallout with the creation club mods) The future of gaming will be sad & horrible!!!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I thought it would be a nice ARPG to try, as I like POE2, Last Epoch and others.\nYet it turns out to be a Gatcha game, after a rather obtuse first chapters which does its best to hide the gatcha aspect and asks for review before it smacks the player over the head with it.\n\nI can appreciate a well made Gatcha game like Honkai Star Rail or even Genshin Impact, yet Torchlight Infinite is not even close to be on par with those. The gatcha mechanics are more obtuse and, to be frank, it looks ugly in comparison to either of those games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you play, pick a non Meta build that is cheap to gear. And dont expect to go Profound Zones, maybe not even Tiermark 8. Before that it's fun.\r\nGame does a ton right, maybe even better than other ARPGs. But for new players just too many mechanics and too income/shopping dependent. \r\nGearing/upgrading is primarily a \"go to auction house\", if you have meta build it's too expensive.\r\nFinding upgrades yourself is rare, since usually you need the upgrade first to be strong enough to go to the zone where it would drop in the first place....\r\nSo not that much Loot reward feeling, just small currency mostly. And rest is just a trading simulator.\r\nYou probably make 10-100x more by just trading than farming yourself...\r\nBasically breaks the whole I find upgrade, get stronger loop. You just hit a wall, \"item too expensive, have to grind for hours\".\r\n\r\nPets: DMG pets, 1 pet did about 30% dmg for me on lvl 1.\r\nLoot pet, probably similar impact.\r\nSo if you have the right pets for the build, you are so far ahead, then the economy works for you instead of against.\r\nAs it is, I felt like I was constantly treading water and not actually being supported by the mechanics to get ahead.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I tried playing it the hardcore you know the way by grinding & doing missions over & over but it just gets boring & it doesn't reward you well with the daily. Nor the RNG loot drops causing you to repeat 100 times a mission for one item that makes you slightly stronger, Truly a game for pay to win Not worth time spent",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "tl;dr\r\n\r\nStreamers/Content creators get paid to play the game and shill to viewers no matter what as far as claiming the game beeing f2p even thought  in game content are not worth runing\r\n if you dont have  xyz pets -> gacha only way obtainable -> or super rng luck to pull with free stuff aka ( the bait to get people with bad spending habits to spend money)\r\n\r\nContent creators will Ba Sing Se their statement on the game beein enjoyable as f2p \r\nwhile they get paid to play the game from the company + any content they monetize/stream so  no mater how bad the game is they get their income to pay their rent and gccha pull without any downsides while your pocket gets emptied by a predatory strategy.\r\n\r\n\r\nBa Sing Se - \"There Is No Content Locked behinde Gacha Pets\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's P2W game, required your spent money for gacha to get legendary pets - loot or battle.\r\nWithout loot pets you will get x2-x3 less items, without batlle pets you will loose a lot of dmg (depends on build, it can be from 10% to 50%)\r\nAnd big issues it's about money, you need to pay  about 50$ to get only 1 pet, with 50% guarantee. \r\nIt's okay to pay like 60-70$ for game, but no 100$+ every season (1 battle pet + 1 loot pet in best case scenario) or if you a new player, you need to pay much and much more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Predatory, greedy devs. Game mechanics are interested, but as usual, ruined by predatory monetization. \r\nCan't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Basically Path of Exile, but largely dumbed down for smombies and 30 different pay to win currencies that are not explained, but they make you need them. Skimming through the zones is fun but at some point any sub-boss starts oneshotting you and item upgrades are extremly scarce. I've been using a weapon I found with level 30 and it's still best in slot for some reason at level 80. Even Diablo IV is better than this.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Those who says that p2w system kick in only in super late game - wrong.\nAt t6-t7 (its a mid game) as a f2p player you already feel that you dont have necessary pets.\nFun few hours at the start of the season, much like d3, easy and chill\nBut then you have to pay or grind more than irl",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "graphics good\ngameplay  good\nplayable characters...  the fact that the one can call minions but cant use any weapons himself is probably the dumbest thing I've seen in game design, Like really I get cornered and cant even fend off the enemies when they lock my in a spot and the minions can't defend me so Im forced to sit their and watch my character die like an NPC... \nplus the whole season crap and the unskipable tutorial yeah Im over this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Got baited by POE streamers to this predatory and P2W garbage. This game could be fun if it was not this predatory and P2W.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "What the hell is this ? This is nothing like any of the previous Torchlight games. It lasted 17 minutes on my laptop until i uninstalled it. Who agreed to release this ? Absolutely terrible, definitely not recommend. What a waste of my time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No matter how many times I try to get into Infinite, I just can't. It requires very little thought, most builds are a 1 button spam with a ton of mobility abilities to rush through content - you basically start the game feeling like an optimized endgame build in any other ARPG (but if that's your thing you may love the mobile port floatiness). \r\n\r\nMonetization is aggressive (even for Chinese standards), and picking up loot is tedious without a high tier pet. Loot itself is uninspired stat % increases, and unique items aren't typically interesting. Cosmetically, your weapons will vary based on what you equip, but your whole armor/outfit is one piece locked to your starting class. That is, unless you spend money for alternative weapon/outfit skins that rival Beta League of Legends in fidelity and detail.\r\n\r\nEven the $50 class cosmetic conversion bundles fail to appeal. I guess if you want to pay a ton of money for a specific gothic loli demon conversion skin for your class, I'm happy that you're happy. In fairness to Infinite, [i] some [/i] of the character skins are alright, but there's not a lot of artistic consistency. The lewd nun feels out of place next to a cartoony bright oversized armor with 1/10 the poly count.\r\n\r\nAs a whole It just feels a bit half baked and stagnant. It's clearly more intended for a mobile audience, which obviously isn't me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game doesn't work. I have UE4 engine crash on launch for last 5 months and the company doesn't support or troubleshoot the issue at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ferrite Shit, control stops working at the same part not even 1 minute into the game. Im not sitting upright, playing a game like this on M&K. I have no patience for this shit anymore with dumbass bugs. Games been out for 2 years now. HOW & WHY IS THIS A PROBLEM 2 years into launch!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shitty monetization and 100% mobile appeal with 100 menus to click and claim things with a pinch of fomo if you wanna stay free to play, better log in all the time\n\ngameplay also rather bland tbh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "disgusting how predatory your PTW methods are...\r\n\r\nWhen you realise your almost 600% behind the people who have paid over a £1000 per season ..\r\n\r\noh ill just play F2P.. but then yoy're restricted with things like trade house slots \r\n\r\ngame is fun and i enjoyed my time until i realised how far behind the whales i am - usually not bothered by it, but this is FILTHY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Predatory gacha systems. The more you play and understand, the more it feels bad to not pay and its by design.\nMost people being fine with \"F2P\" seem to play since season 1 and have a lot of the free pets over time. Starting this season and later on, will be a lot worse and probably will get worse over time. \n\nThe game overall is very fun and has, at least to me, comparable endgame quality to path of exile (1), but i dont enjoy being constantly bombarded with \"if you pay, you get more loot, dmg, less time wasted\" impressions.\nTry it, make your own decision, to me its not worth in the current state with how predatory the gacha system is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They have terrible balance of the classes, only a couple are viable for early play making it hard to play something you want to if you play HC, controller players welcome to hell because they did not make this game for you",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I spent 60 minutes playing the game and I wish I could get my 60 minutes back.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Feels like a mobile port that forgot it’s on PC. The UI is clunky and unintuitive, damage feedback is practically nonexistent. Terrain/Object bound-boxes are weird. Mobs spawning directly under you makes positioning a joke. It’s hard to stay immersed when the game keeps tripping over its own design.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no mater what settings i try and change this stupid thing still opens my steam library every time i close out the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you're not ready to spend thousands on pacts or what most refer to as pets just play something else, it is a fun game but all the grind content is heavily gated by pets, pets that you can spend hundreds of dollars on  just getting 1 time and you need to get 6 times for full effect.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is amazing and very solid, but the big downside is the pet gacha system. You can play without any pets? Of course u can, the game is free. But.... you will never reach the true end game because ur farm will be very, i mean, very very slow no matter what u do.  And the market follow the big players... \n\nTry it by yourself. im done with this game, which  is very sad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy anything before playing at least 10 or more hours.\nYou can f2p and enjoy the game for now. But I highly doubt it will be the same in the near future.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tbh it feels like mobile game. playing with controller is absolutely afwul",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my ocd just cant the words dont match whats being said alot and that bugs me sry but i cant try this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Minions feel like dog shiit. im a minion enthusiast and minions here are absolute ass. Only made it to level 55 so far maybe they get batter later not shore. P.S its also pay to win bunch of greedy degenerates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "new season breaks ur characters completely and for no reason resets the entire talent tree and doesnt give u the build guide u where using for no reason. all my characters are bricked now why? idk thanks fucking disgusting slop game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't care for the graphics or the gameplay when compared to the 3 prior Torchlights.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has 20+ mechanics and none of them work (you don't get money from it to progress, you don't get items to progress). With so many mechanics, farming money only from boss rush is complete garbage. How do they expect after 20 hours of boss rush and nothing else any player to stay playing the game, the game is dead and doesn't work even for those who pay. All the drops have been reduced to an absolute minimum or there are bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved the original Torchlight games but this is turned it into a mobile game with infinite submenus, currencies, and pay to win or even pay to enjoy. Character classes are meh at the best with zero customization and zero visual progression at all unless you are willing to pay for a skin. Sad to say, but this where Torchlight died. The sexy women are nice tho.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The way you interface with a game is quite important. Single key keybindings aren't the way for accessibility.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is fine, but Account signing in on pc is the issues fix it! i cannot sign in due to mulitple issues with account log in.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It feels like soulless mobile slop where the exec wanted to maximise profit. It does have a neat art style but that's about it for the positives.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game had potential, the gameplay and graphics are interesting. Otherwise, coop is complicated, the controller support for the ui is atrocious and it's filled with too much paid stuff",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Keybinds sucks . Certain keys cannot be bind ( somme basics of hack & slash games like numbers ) .\nWith this , game is unplaybable for me .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, and how great it is to grind mobs for hours. If I were a millionaire, I'd screw up all the C6 pets and enjoy it to the fullest, but for now, I think it'll be okay to farm cubes, beacons and embers...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It’s fun — right up until your soul leaves your body somewhere between the 200th and 300th grind. Unless you’re a streamer with Level 6 pets and a PhD in masochism, you might want to sit this one out. T8 is where the “real game” allegedly begins, but to get there you’ll need to pay real money for the privilege of maybe, possibly, if the stars align, getting a legendary pet. The seasons? Imagine the creative spark of a wet napkin — that’s about the level of inspiration here. In short, TLI is the kind of grind that makes you question your life choices, politely smiling while it steals your time and sanity.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "when they say partial controller support, they mean basically no controller support. You start the game, the steam on-screen keyboard does not even work for entering your character name. You get into the the story, and kill a few mobs then you are locked from moving and using controller completely. Would not recommend to play if you want to use a controller..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Torchlight Infinite is a failed attempt at an ARPG. The entire game revolves around pets, and every new league feels like a cash grab where you need to spend hundreds of euros just to stay relevant. There is no real progression without opening your wallet, making it one of the most blatant pay-to-win experiences out there. Sadly, this game had potential, but greed completely ruined it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generally, the game is good.\n\nThere are plenty of things to do and smooth transitions between locations. FPS is stable.\n\nThat being said, the monetization is horrible.\nYou will never be able to achieve the same progress in the same amount of time as someone with level 6 pets. The predatory system is designed to exploit basic human instincts, making it difficult for those without strong willpower to resist the urge to swipe (spend money).\n\nLet me explain in detail just how bad the pet system is in this game, especially when compared to what a free player experiences:\n\n1. Seasonal Pets & Mechanics\n\nEvery season, a new pet is released along with a new endgame \"mechanic.\" The pet is directly tied to this mechanic and determines how much loot you can generate. Without the pet, you’re already behind.\n\n2. Massive Progress Gap\n\nFree players are stuck progressing around 14x slower compared to players with a level 6 pet. The gap is massive and discouraging.\n\n3. Unfair Early Advantage\n\nAnyone who swipes for the pet at the start of each league gains an immense advantage over free-to-play players. This early boost snowballs quickly, making it hard to catch up.\n\n4. Pet Leveling is Pay-to-Win\n\nPETS wouldn't be such a problem if you only needed to buy them once but they must be leveled up to level 6 to be effective. And to level them, you have to swipe and the odds are not in the favor of the spender.\n\nThe difference between a level 1 and level 6 pet is like night and day. A level 1 pet might give you 2x rewards from a mechanic, while a level 6 pet can generate 14x more loot in the long run, compared to a free player.\n\n5. Battle Pass Manipulation\n\nEach season, a battle pass is released. The issue? It includes an \"auto-loot\" function but only if you own at least one pet.\nThat means free players are stuck clicking manually to pick up currency, while swipers enjoy full automation. Inconvenient, right? It’s just another predatory system designed to wear you down and make you spend.\n\n6. Two Types of Pets, Two Layers of Monetization\n\nThis game has two types of pets:\n\nCombat pets\n\nMechanic pets\n\nIf you thought only the mechanic pets created disadvantages, guess again. Combat pets are outright pay-to-win offering direct power gains.\n\nThis gives paying players a huge edge in reaching endgame faster and dominating the economy. Once they get there, gear prices skyrocket often inflated 20x. At that point, no matter how many hours you put in as a free player, you simply can’t keep up.\n\nAnd that’s by design another psychological lever in this monetization scheme.\n\nThe most concerning part?\nThis kind of monetization fosters negative experiences and targets the most vulnerable communities.\n\nPeople who can’t recognize the psychological tricks or who struggle with things like gambling addiction, fear of missing out, or a need for power over others are most at risk of falling into the trap.\n\nAnd the game preys on them deliberately.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very bad game that do almost everything wrong, remove almost everything that made the Torchlight series so great. Anime marketing for some reason?\r\nAll the menu currency to click and popup, it's a mess.\r\nGame feel the same from lvl 10 to 80 even with differents skills, Ui is terrible.\r\nThis studio has no idea what they're doing with this IP and it's really sad. Pay2Win content and predatory monetisation. Don't give this company money.\r\n\r\nPoe, poe2, diablo 4, last epoch, grim dawn, even titan quest are farrrrrrrrr better.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game feels good but its micro transaction hell. A real shame but I'm not dumping money on this one.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "shit storytelling, shit voice acting, absolutely horrendous UI, gacha gacha gacha gacha",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I enjoyed the first Torchlight, but this one is kind of boring, aimed more at mobile devices.\nI've been playing for 30 minutes and I'm already at level 10. I keep getting notifications like, \"Hey, improve this.\" as if the developer had ADHD.\n\nAlso, the problem with skills is that you can have 5 skills, and one of your skills is replenishing HP instead of bottles or something like that. \nAnother skill is dash, which does nothing but teleport. Next is rage for the mage. xD The only one that can be used is the first one, which shoots fireballs.\nThe second problem is that the main skill consumes mana, the character says: \"I don't have mana\", and of course you don't have a bottle to refill it, because you have to put it as a skill.\n\nYou're leveling up too fast and spending more time in menus than in the game.\n\nThere are 10 types of mage characters, one is water, another is fire, another is electricity, etc. This should be just one, max two characters.\n\nCool animations, like a character doing four flips in the air, etc. It looks good, but it doesn't fit in there at all.\n\nLevels are short mobile arenas\n\nI see a lot of Pay2Win stuff there.\n\nThe developer is XD, and that's exactly what this whole game is like—one big xD.\n\nI think that playing on your phone somewhere on the bus or when you're really bored can be fun. But seriously, it's not something that should be on a PC.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "TL;DR: I prefer games with less restrictive class systems, or at least more good looking to compensate negatives (yeah I liked Wolcen overall).\r\n\r\nI won't talk about P2W mechanics, as that is obvious to anyone with 2+ brain cells.\r\n\r\nGraphics is average, does not look BAD, but kind of dated for 2025 even for mobile. Sound/combat effects are... i would say bad.\r\n\r\nIt's not a bad ARPG, but the issue is that you are basically selecting specs within classes, rather than full classes themselves. These specs have strict passives that are often tied directly to specific active skills. This system effectively locks you into one playstyle until you decide to roll a completely new character/class.\r\n\r\nFurthermore, some of these classes (though not all of them!) are even more limited. Imagine if the Necromancer in Diablo IV could technically use any skill, but playing anything other than Decrepify would be so severely sub-optimal that it's not a viable choice.\r\n\r\nFinally, I don't like how magic wands look in this game, including the skins from the cash shop. They all look more like axes and heavy maces.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "extreme pay to win mechanics.  every purchase is rng.  I would buy what i wanted outright but the randomness of the store is a hard pass for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Another diablo clone with basic ah characters. Some of the images look AI. Takes way too long to unlock multiplayer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Horrible UI alone is enough reason to not play this game.\n\n0.1/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A joke. Insulting to gamers who expect a baseline of gameplay.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Have you played your previous games?\nIt feels like you missed the thing that made them amazing",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "its what not i expected from torchlight franchise. Its sooo bad",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}