{
  "positive": [
    {
      "review": "I've been playing CounterSide since global launch on mobile (pre-Origin) and figured I might as well leave a review here as well. My playtime is a bit misleading since I also have hundreds of hours in the mobile version as well.\n\nAnyway, to get it out of the way: yes, this is a gacha game. If you do not like gacha games, this game won't entirely change your mind, but if you want a game that you can play easily on your commute while also having a genuinely good story, then this is it.\n\nAnd, yes, the story is genuinely, unquestionably good. I don't mean \"good for gacha\"; I mean, it's a legitimately well-written and conveyed story that has a lot of disparate elements that somehow manages to come together into a cohesive whole.\n\nIt has a lot of deep lore that it actually trusts the player to pick up as they play, drip-feeding small hints and tidbits, with earlier events and character stories making sense in new, revelatory ways as the story progresses. Every moment in the game is important, whether as a way to develop the characters or explain the larger story at hand. It's also really good at making players genuinely care about characters in short timeframes, with self-contained side narratives that deliver a lot of punch despite how little you spend with some of these characters in the grand scheme of things.\n\nIn short: the story is the strongest element of this game, and it is what most people play it for.\n\nProbably the only mild criticism I can give is that the actual play-order of the story is super opaque, since it's split between main story chapters and side story chapters, even though a lot of side story chapters are instrumental to understanding main story chapters. I hope they add a \"release order\" view for story eventually, so newcomers can play them in the order they were intended, instead of simply doing Main Story until they're roadblocked into doing a Side Story, which is what happens currently.\n\nAs for the gameplay, it's essentially Battle Cats or Line Rangers but with a few additional elements. In layman's terms, it's a bit like capture-the-flag, where you and your opponent start on opposite sides of a 2D horizontal plane with a base (usually a ship, in this game), and you use energy to send out units to destroy the opponent's base. It's simple but mostly effective, and an in-game reason is even given as to why battles are fought this way. It's not something you'll probably go out of your way to play, but it's at least more thought-out as a mechanic than other gacha combat.\n\nThe double-edged sword of CounterSide gameplay, however, is that you don't actually have to spend much time playing it. CounterSide is designed around bite-sized experiences, and after you clear a stage, you can easily auto-clear it to get additional resources, without having to replay it. In practice, this makes CounterSide an extremely friendly \"side-game\" for those who don't have much time to game because, after you complete most of the content, daily login quests take less than 30 minutes to complete, since you can basically just click several buttons to get through the majority of them. However, for those who want to play more of CounterSide, the game actually makes it hard to do so, which is a common criticism by the playerbase.\n\nAs someone who has ended up dropping basically all my other gacha games besides this one because I no longer have time to play them, I actually appreciate how much this game respects your time, but I can understand why, to some people, this might come off as a game with nonexistent or boring endgame content.\n\nIn terms of actual gacha generosity, I'd say this game is one of the better ones I've played. Blue tickets for SSR and below pulls are abundant, and I basically never have any trouble getting SSR characters I want. ASSR tickets are harder to come by, but the rollover pity and free selection ticket given during every six-month anniversary help alleviate this. As a collector, I've actually managed to finish my character collection up to 95% without actually trying, and I fully expect to hit close to 100 eventually, so that's definitely a mark in the game's favor in my book.\n\nAs for power creep, the game has added a new level cap of 120 since its release, as well as new reactors, but they've also bumped up resource acquisition and at least try to balance older units regularly, so it isn't too bad. The only criticism I'd give here is that: gear gacha (rolling for good latent skills) still kind of sucks, though it's a bit better now that there's finally pity, and they really need to increase fusion core acquisition.\n\nFinally, for those wondering what \"Origin\" refers to in some of these reviews, it was a bad update released by Bside after they started independently publishing their own game (after Nexon relinquished publishing rights). It changed a lot of user-friendly mechanics and made many of the game modes more tedious to play. Most of these changes have been walked back, however, and while the bad UI still remains (RIP old CounterSide UI), the game is generally fine now. While there's stuff I wish they had brought back that they didn't (like using dupes to limit fusion instead of having to use fusion cores), it's still leagues above most other gachas, so I'd encourage those who left because of Origin to try giving this game a second chance, if they liked the story back then and would like to see more of it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "the story absolute cinema , It's very rare for a gacha game to have complex lore like this which keeps me playing counterside",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not sure how I ended up in the game... but a few days ago I got my 3-year emblem and I think I missed only 2 days over those 3 years.\nI'm in the game mainly for the story, love the hell out of it.\nThe soundtrack complements it nicely.\nAs for the gameplay itself, well.... it is a gacha with surprisingly deep and complex mechanics.\nAs for the monetization - you don't need to pay at all, I only buy the counter passes and occasional quartz to accelerate things a bit.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "CounterSide is one of the best mobile game I ever played. It has one of the best storyline. The gameplay is not really unique but fun regardless. Also, it's a gacha game, but the grinding itself doesn't exactly require you to spend a lot of money, or at all.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing daily game to play, quite addicting too.\r\nGacha game but with really regular events and coupon codes and free end game ASSR.\r\nAwesome arts and animations with beautiful stories.\r\nVariety of squad builds and require proper skills and timing to win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hello Play community and the yesterday and Good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After almost 4000 hours, I can hardly say it's bad, right?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Good to play when bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good anime game highly reccommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was a free to play player got my favs maxed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "xdd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing CounterSide since global launch on mobile (pre-Origin) and figured I might as well leave a review here as well. My playtime is a bit misleading since I also have hundreds of hours in the mobile version as well.\n\nAnyway, to get it out of the way: yes, this is a gacha game. If you do not like gacha games, this game won't entirely change your mind, but if you want a game that you can play easily on your commute while also having a genuinely good story, then this is it.\n\nAnd, yes, the story is genuinely, unquestionably good. I don't mean \"good for gacha\"; I mean, it's a legitimately well-written and conveyed story that has a lot of disparate elements that somehow manages to come together into a cohesive whole.\n\nIt has a lot of deep lore that it actually trusts the player to pick up as they play, drip-feeding small hints and tidbits, with earlier events and character stories making sense in new, revelatory ways as the story progresses. Every moment in the game is important, whether as a way to develop the characters or explain the larger story at hand. It's also really good at making players genuinely care about characters in short timeframes, with self-contained side narratives that deliver a lot of punch despite how little you spend with some of these characters in the grand scheme of things.\n\nIn short: the story is the strongest element of this game, and it is what most people play it for.\n\nProbably the only mild criticism I can give is that the actual play-order of the story is super opaque, since it's split between main story chapters and side story chapters, even though a lot of side story chapters are instrumental to understanding main story chapters. I hope they add a \"release order\" view for story eventually, so newcomers can play them in the order they were intended, instead of simply doing Main Story until they're roadblocked into doing a Side Story, which is what happens currently.\n\nAs for the gameplay, it's essentially Battle Cats or Line Rangers but with a few additional elements. In layman's terms, it's a bit like capture-the-flag, where you and your opponent start on opposite sides of a 2D horizontal plane with a base (usually a ship, in this game), and you use energy to send out units to destroy the opponent's base. It's simple but mostly effective, and an in-game reason is even given as to why battles are fought this way. It's not something you'll probably go out of your way to play, but it's at least more thought-out as a mechanic than other gacha combat.\n\nThe double-edged sword of CounterSide gameplay, however, is that you don't actually have to spend much time playing it. CounterSide is designed around bite-sized experiences, and after you clear a stage, you can easily auto-clear it to get additional resources, without having to replay it. In practice, this makes CounterSide an extremely friendly \"side-game\" for those who don't have much time to game because, after you complete most of the content, daily login quests take less than 30 minutes to complete, since you can basically just click several buttons to get through the majority of them. However, for those who want to play more of CounterSide, the game actually makes it hard to do so, which is a common criticism by the playerbase.\n\nAs someone who has ended up dropping basically all my other gacha games besides this one because I no longer have time to play them, I actually appreciate how much this game respects your time, but I can understand why, to some people, this might come off as a game with nonexistent or boring endgame content.\n\nIn terms of actual gacha generosity, I'd say this game is one of the better ones I've played. Blue tickets for SSR and below pulls are abundant, and I basically never have any trouble getting SSR characters I want. ASSR tickets are harder to come by, but the rollover pity and free selection ticket given during every six-month anniversary help alleviate this. As a collector, I've actually managed to finish my character collection up to 95% without actually trying, and I fully expect to hit close to 100 eventually, so that's definitely a mark in the game's favor in my book.\n\nAs for power creep, the game has added a new level cap of 120 since its release, as well as new reactors, but they've also bumped up resource acquisition and at least try to balance older units regularly, so it isn't too bad. The only criticism I'd give here is that: gear gacha (rolling for good latent skills) still kind of sucks, though it's a bit better now that there's finally pity, and they really need to increase fusion core acquisition.\n\nFinally, for those wondering what \"Origin\" refers to in some of these reviews, it was a bad update released by Bside after they started independently publishing their own game (after Nexon relinquished publishing rights). It changed a lot of user-friendly mechanics and made many of the game modes more tedious to play. Most of these changes have been walked back, however, and while the bad UI still remains (RIP old CounterSide UI), the game is generally fine now. While there's stuff I wish they had brought back that they didn't (like using dupes to limit fusion instead of having to use fusion cores), it's still leagues above most other gachas, so I'd encourage those who left because of Origin to try giving this game a second chance, if they liked the story back then and would like to see more of it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "the story absolute cinema , It's very rare for a gacha game to have complex lore like this which keeps me playing counterside",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not sure how I ended up in the game... but a few days ago I got my 3-year emblem and I think I missed only 2 days over those 3 years.\nI'm in the game mainly for the story, love the hell out of it.\nThe soundtrack complements it nicely.\nAs for the gameplay itself, well.... it is a gacha with surprisingly deep and complex mechanics.\nAs for the monetization - you don't need to pay at all, I only buy the counter passes and occasional quartz to accelerate things a bit.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Decent visual novel, lol. Oh wait, Studiobside calls it an 'Urban Graphic Novel RPG'. So, decent Urban Graphic Novel RPG. Pft.\n\nSeriously though, not a *bad* game. Not bad at all. Maybe a bad gacha to some, but I treated it more like a visual novel (as stated) because that's...what the majority of the game is? That's a majority of what all gacha is!\n\nNot much in the way of graphic settings. Performance is good (as long as you meet the system requirements) and I found the game stable on various forms of modern hardware. Never had any issues. No crashes. Only real issue I can think some people might have in regard to performance is connection issues if you don't have great internet, but it is a game that requires internet, so go figure. Game battles *might* hang/have delays if you have slow speeds.\n\nI didn't expect much out of the story, but it ended up being enjoyable for me. Nothing groundbreaking of course. Slow to start, but worth sticking around. Lots of shenanigans, lots of really good moments and story beats. If you like sci-fi, it's certainly an interesting piece of fiction. Definitely helps that I kept my expectations low, as I'm very critical of 'gacha game writing'. This isn't the best gacha game story I've experienced, but it's certainly a notable one. There's also lots of side stories (I forgot what they're labeled as in game) and other little tidbits in game that act as supplements for characters etc. Lots of reading if you're into that, as a majority of story stuff later on is (unfortunately) unvoiced.\n\nGameplay. It is literally an idle game. Game description refers to gameplay as 'line battles'. Your units are on the left, enemy is on the right of the screen. You drop units to deploy on the field. Units will attack on their own (main goal being destroying enemy 'ship', boss or defensive position within time limit), but you can select their main ability to use once charged. If your characters get defeated, they simply enter a cooldown and you can either wait for them to become available or choose someone else to deploy. You lose if time runs out or if your ship gets destroyed by the enemy (a.k.a you get overwhelmed). There are certain mechanics like weaknesses whatever and finding the right moment to use your abilities on higher level battles, but general content is easy enough to get through with a general roster. Do pay attention to the game tooltips and tutorials, as gameplay mechanics do switch up from time to time in regard to events/special battles. Anyway, you mostly just watch your employees battle like it's a free for all in BlazBlue or something. The animations and some of the combat moves the characters have are actually visually impressive, in my opinion. Sucks that these cool animations/cut-ins and abilities are stuck in an idle gacha game, but that's the way the cookie crumbles unfortunately. \n\nLeveling and building characters/your ships is similar to other gacha games, so no need to really explain. You farm parts/materials/equipment from various stages to improve their stats. Straightforward stuff. You also have a form of 'logistics' (think GFL logistics) where you send out your units for maybe a couple hours of real time to bring back various types of resources. These logistic missions may also open up 'raids' that you can run for resources. They're mostly 'endgame' battles and you're supposed to do them with people on your friends list, but thought I'd mention this feature. \n\nCharacters are neat. Lots of favorites to have (Christina Brecht enjoyer here!). Each has their own little profile with employee info, kinda like Arknights. Nothing too extensive, but overall decent and at least gives a nice look into their personalities. Love the variety compared to other games where they milk the same damn fetishes over and over and over. This game just has the most random character designs, I swear. There's PMC dudes, soldiers, cops, security guys, musicians, mafia, artificial humans, mages and honestly so much more to give an idea on general designs. There's also units that are straight up robots, mechs, drones, tanks, air units, or transport vehicles. It's actually really interesting having those and it's something new compared to most gacha which constantly milk waifus. Yeah, there's bait in this game like every other, but the 'fanservice-to-cool' ratio is quite balanced. And of course, the male/female ratio is skewed, but I think there's at least something for everyone here. I don't exactly dislike any design in this game. Everyone is pretty great/unique and like I said, it's something different from the usual. My only nitpick with the characters is that there's a lack of voices for a majority of them, which sucks. There's KR audio for most chars, but I personally use the JP audio that's included because I don't fully understand Korean (which is where the lack of voices comes in). I forget the reason why they decided not to finish up adding JP voices, but whatever. Just wild to think about since games like Arknights has like 4 voice options (English, Chinese, Japanese and Korean) for *most* characters' battle lines/lobby lines now, lmao. Again, personal nitpick. I also wish there was more lobby dialogue. Some characters are obviously more developed/fleshed out than others and it sucks.\n\nMusic is fantastic. Always appreciate how most gacha games have remarkable music compositions (t's like their one saving grace when all else fails). This game is no exception. Wonderful job in this aspect of the game. No complaints.\n\nMicrotransactions are the usual. Same as every other modern gacha, really. Recharge stuff, premium currency, upgrade packs, battle passes, etc. Most skins cost premium currency. There were like two or three skins that I liked for a couple characters I had (Xiao Lin, John Mason, Han Sorim), but those were able to be bought with saved up in game currency, so...win win? The paid skins are cool, but at the end of the day, I have no interest in spending money on JPEGs....unless that JPEG is fan/doujin-made & specially designed for use on a 160x50cm pillowcase, heyo.\n\nThe gacha is whatever honestly. I've got through most of the story, done most events aside from the hardest difficulty stages, got most of the non-limited + awakened/limited units by saving the free in game currency (and refusing to pull on general bannners) + a few rearms and haven't spent a single thing. Most of the good characters that carried me came from FREE selector packs that they gave out. There's just not really much I find worth spending on? Every time I hit a roadblock, I took that as my cue to take a break from this game and focus on another gacha/video game. Never treat these games as a chore. Surefire way to burn yourself out. Simply logging in every day to do dailies for a little bit really adds up. I also don't care about meaningless 'PvP' leaderboards in gacha so there's another avenue for spending closed. Would honestly rather spend money on physical merch like every other gacha I play, but unfortunately I can't really find much for CounterSide, which is a shame. To reiterate, it simply takes time to progress. If you're patient and strategize your resources in game, you can easily play through general content without spending money. \n\nDo I recommend CounterSide? For the story and the adventure, sure. I enjoyed my time so far and appreciate the effort put into the game, despite it not being much of a 'game' by definition. Plus, it's free. All it requires is time investment and building up your roster over time can be fun as a side game. You literally have no obligation to spend any money, despite what people seem to claim about every single gacha. Just don't be a pawn to the system. If you have no intentions of investing time in a gacha game or dislike reading, definitely not the game for you. Probably best to go play something else.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "CounterSide is one of the best mobile game I ever played. It has one of the best storyline. The gameplay is not really unique but fun regardless. Also, it's a gacha game, but the grinding itself doesn't exactly require you to spend a lot of money, or at all.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing daily game to play, quite addicting too.\r\nGacha game but with really regular events and coupon codes and free end game ASSR.\r\nAwesome arts and animations with beautiful stories.\r\nVariety of squad builds and require proper skills and timing to win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve got over +200 hours in Counter:Side counting other platfroms and have spent some money here and there, and honestly, it’s been worth it most of the time. The gameplay’s really fun — it’s fast but still has a lot of strategy, and the art and animations are pretty good. There’s definitely a grind, especially when it comes to gear and tuning, and yeah, power creep can be frustrating when new units outshine older ones. But the pity system’s ehhh, and most of the stuff I’ve paid for (like skins and passes) felt worth it. Despite the flaws, I still find myself logging in every day — it’s just a fun game that’s held my attention for a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1k Hours, you know its gonna be a thumbs up\nthe only reason i still play this game is because of the story, this is the best gacha game story from all of other gacha games that I've ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a fun Unit Builder/Line Battler? This might be your vibe.\n\nPros- Really cute to cool characters. Awesome voice acting to use of music. Interesting ways to build up your teams.\n\nCons- Takes a bit to earn Pull Tickets. Easy to get lost in day to day missions. Ship upgrading takes a lot of items that take a lot of time to either craft or earn. \n\nAll and all? A very interesting game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a gacha game. Don't expect much in terms of gameplay. That isn't what I'd recommend it for anyway. If there was anything I'd recommend it for, it'd be the story. The story is unique and doesn't take a dip in quality after the first few arcs. The characters are likable and are worth reading the side stories for. I hate that it's locked behind gameplay in a gacha game (which is heavily dependent on grinding and gambling) but the sprites are great and story content doesn't require spending. Note: the pov character isn't some faceless nobody, which is a plus in and of itself. Don't get too invested in pvp arena.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game since global first release and how dev destroying player sanity with the equipment grind, but this game rn need better UI at story / side story / event story that can be grind, kinda confused with what i miss and where to grind that currencies since i stop playing for like 7 months and come back before",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mungkin salah satu game gacha yang newbie friendly jadi ya kalau tertarik sih cobain aja, gamenya lumayan ringan juga kok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Gacha Game Ever, Top Tier Animation, Good Story, most of all tons of waifu and cute girls, good outfit\r\nWorth the Time to Grind the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hello Play community and the yesterday and Good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love it hate it, the best for you if you wanna look at story or grow strong you do you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game Gacha ever, really f2p friendly, weekly coupon code (almost), saving pity next banner, fair play ranked multiplayer. very recomended gacha game with many gacha game nowadays",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After almost 4000 hours, I can hardly say it's bad, right?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Good to play when bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good anime game highly reccommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy shit Nana Mizuki the goat is here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute PEAK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gasme qua hay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was a free to play player got my favs maxed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "xdd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing CounterSide since global launch on mobile (pre-Origin) and figured I might as well leave a review here as well. My playtime is a bit misleading since I also have hundreds of hours in the mobile version as well.\n\nAnyway, to get it out of the way: yes, this is a gacha game. If you do not like gacha games, this game won't entirely change your mind, but if you want a game that you can play easily on your commute while also having a genuinely good story, then this is it.\n\nAnd, yes, the story is genuinely, unquestionably good. I don't mean \"good for gacha\"; I mean, it's a legitimately well-written and conveyed story that has a lot of disparate elements that somehow manages to come together into a cohesive whole.\n\nIt has a lot of deep lore that it actually trusts the player to pick up as they play, drip-feeding small hints and tidbits, with earlier events and character stories making sense in new, revelatory ways as the story progresses. Every moment in the game is important, whether as a way to develop the characters or explain the larger story at hand. It's also really good at making players genuinely care about characters in short timeframes, with self-contained side narratives that deliver a lot of punch despite how little you spend with some of these characters in the grand scheme of things.\n\nIn short: the story is the strongest element of this game, and it is what most people play it for.\n\nProbably the only mild criticism I can give is that the actual play-order of the story is super opaque, since it's split between main story chapters and side story chapters, even though a lot of side story chapters are instrumental to understanding main story chapters. I hope they add a \"release order\" view for story eventually, so newcomers can play them in the order they were intended, instead of simply doing Main Story until they're roadblocked into doing a Side Story, which is what happens currently.\n\nAs for the gameplay, it's essentially Battle Cats or Line Rangers but with a few additional elements. In layman's terms, it's a bit like capture-the-flag, where you and your opponent start on opposite sides of a 2D horizontal plane with a base (usually a ship, in this game), and you use energy to send out units to destroy the opponent's base. It's simple but mostly effective, and an in-game reason is even given as to why battles are fought this way. It's not something you'll probably go out of your way to play, but it's at least more thought-out as a mechanic than other gacha combat.\n\nThe double-edged sword of CounterSide gameplay, however, is that you don't actually have to spend much time playing it. CounterSide is designed around bite-sized experiences, and after you clear a stage, you can easily auto-clear it to get additional resources, without having to replay it. In practice, this makes CounterSide an extremely friendly \"side-game\" for those who don't have much time to game because, after you complete most of the content, daily login quests take less than 30 minutes to complete, since you can basically just click several buttons to get through the majority of them. However, for those who want to play more of CounterSide, the game actually makes it hard to do so, which is a common criticism by the playerbase.\n\nAs someone who has ended up dropping basically all my other gacha games besides this one because I no longer have time to play them, I actually appreciate how much this game respects your time, but I can understand why, to some people, this might come off as a game with nonexistent or boring endgame content.\n\nIn terms of actual gacha generosity, I'd say this game is one of the better ones I've played. Blue tickets for SSR and below pulls are abundant, and I basically never have any trouble getting SSR characters I want. ASSR tickets are harder to come by, but the rollover pity and free selection ticket given during every six-month anniversary help alleviate this. As a collector, I've actually managed to finish my character collection up to 95% without actually trying, and I fully expect to hit close to 100 eventually, so that's definitely a mark in the game's favor in my book.\n\nAs for power creep, the game has added a new level cap of 120 since its release, as well as new reactors, but they've also bumped up resource acquisition and at least try to balance older units regularly, so it isn't too bad. The only criticism I'd give here is that: gear gacha (rolling for good latent skills) still kind of sucks, though it's a bit better now that there's finally pity, and they really need to increase fusion core acquisition.\n\nFinally, for those wondering what \"Origin\" refers to in some of these reviews, it was a bad update released by Bside after they started independently publishing their own game (after Nexon relinquished publishing rights). It changed a lot of user-friendly mechanics and made many of the game modes more tedious to play. Most of these changes have been walked back, however, and while the bad UI still remains (RIP old CounterSide UI), the game is generally fine now. While there's stuff I wish they had brought back that they didn't (like using dupes to limit fusion instead of having to use fusion cores), it's still leagues above most other gachas, so I'd encourage those who left because of Origin to try giving this game a second chance, if they liked the story back then and would like to see more of it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "the story absolute cinema , It's very rare for a gacha game to have complex lore like this which keeps me playing counterside",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not sure how I ended up in the game... but a few days ago I got my 3-year emblem and I think I missed only 2 days over those 3 years.\nI'm in the game mainly for the story, love the hell out of it.\nThe soundtrack complements it nicely.\nAs for the gameplay itself, well.... it is a gacha with surprisingly deep and complex mechanics.\nAs for the monetization - you don't need to pay at all, I only buy the counter passes and occasional quartz to accelerate things a bit.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Decent visual novel, lol. Oh wait, Studiobside calls it an 'Urban Graphic Novel RPG'. So, decent Urban Graphic Novel RPG. Pft.\n\nSeriously though, not a *bad* game. Not bad at all. Maybe a bad gacha to some, but I treated it more like a visual novel (as stated) because that's...what the majority of the game is? That's a majority of what all gacha is!\n\nNot much in the way of graphic settings. Performance is good (as long as you meet the system requirements) and I found the game stable on various forms of modern hardware. Never had any issues. No crashes. Only real issue I can think some people might have in regard to performance is connection issues if you don't have great internet, but it is a game that requires internet, so go figure. Game battles *might* hang/have delays if you have slow speeds.\n\nI didn't expect much out of the story, but it ended up being enjoyable for me. Nothing groundbreaking of course. Slow to start, but worth sticking around. Lots of shenanigans, lots of really good moments and story beats. If you like sci-fi, it's certainly an interesting piece of fiction. Definitely helps that I kept my expectations low, as I'm very critical of 'gacha game writing'. This isn't the best gacha game story I've experienced, but it's certainly a notable one. There's also lots of side stories (I forgot what they're labeled as in game) and other little tidbits in game that act as supplements for characters etc. Lots of reading if you're into that, as a majority of story stuff later on is (unfortunately) unvoiced.\n\nGameplay. It is literally an idle game. Game description refers to gameplay as 'line battles'. Your units are on the left, enemy is on the right of the screen. You drop units to deploy on the field. Units will attack on their own (main goal being destroying enemy 'ship', boss or defensive position within time limit), but you can select their main ability to use once charged. If your characters get defeated, they simply enter a cooldown and you can either wait for them to become available or choose someone else to deploy. You lose if time runs out or if your ship gets destroyed by the enemy (a.k.a you get overwhelmed). There are certain mechanics like weaknesses whatever and finding the right moment to use your abilities on higher level battles, but general content is easy enough to get through with a general roster. Do pay attention to the game tooltips and tutorials, as gameplay mechanics do switch up from time to time in regard to events/special battles. Anyway, you mostly just watch your employees battle like it's a free for all in BlazBlue or something. The animations and some of the combat moves the characters have are actually visually impressive, in my opinion. Sucks that these cool animations/cut-ins and abilities are stuck in an idle gacha game, but that's the way the cookie crumbles unfortunately. \n\nLeveling and building characters/your ships is similar to other gacha games, so no need to really explain. You farm parts/materials/equipment from various stages to improve their stats. Straightforward stuff. You also have a form of 'logistics' (think GFL logistics) where you send out your units for maybe a couple hours of real time to bring back various types of resources. These logistic missions may also open up 'raids' that you can run for resources. They're mostly 'endgame' battles and you're supposed to do them with people on your friends list, but thought I'd mention this feature. \n\nCharacters are neat. Lots of favorites to have (Christina Brecht enjoyer here!). Each has their own little profile with employee info, kinda like Arknights. Nothing too extensive, but overall decent and at least gives a nice look into their personalities. Love the variety compared to other games where they milk the same damn fetishes over and over and over. This game just has the most random character designs, I swear. There's PMC dudes, soldiers, cops, security guys, musicians, mafia, artificial humans, mages and honestly so much more to give an idea on general designs. There's also units that are straight up robots, mechs, drones, tanks, air units, or transport vehicles. It's actually really interesting having those and it's something new compared to most gacha which constantly milk waifus. Yeah, there's bait in this game like every other, but the 'fanservice-to-cool' ratio is quite balanced. And of course, the male/female ratio is skewed, but I think there's at least something for everyone here. I don't exactly dislike any design in this game. Everyone is pretty great/unique and like I said, it's something different from the usual. My only nitpick with the characters is that there's a lack of voices for a majority of them, which sucks. There's KR audio for most chars, but I personally use the JP audio that's included because I don't fully understand Korean (which is where the lack of voices comes in). I forget the reason why they decided not to finish up adding JP voices, but whatever. Just wild to think about since games like Arknights has like 4 voice options (English, Chinese, Japanese and Korean) for *most* characters' battle lines/lobby lines now, lmao. Again, personal nitpick. I also wish there was more lobby dialogue. Some characters are obviously more developed/fleshed out than others and it sucks.\n\nMusic is fantastic. Always appreciate how most gacha games have remarkable music compositions (t's like their one saving grace when all else fails). This game is no exception. Wonderful job in this aspect of the game. No complaints.\n\nMicrotransactions are the usual. Same as every other modern gacha, really. Recharge stuff, premium currency, upgrade packs, battle passes, etc. Most skins cost premium currency. There were like two or three skins that I liked for a couple characters I had (Xiao Lin, John Mason, Han Sorim), but those were able to be bought with saved up in game currency, so...win win? The paid skins are cool, but at the end of the day, I have no interest in spending money on JPEGs....unless that JPEG is fan/doujin-made & specially designed for use on a 160x50cm pillowcase, heyo.\n\nThe gacha is whatever honestly. I've got through most of the story, done most events aside from the hardest difficulty stages, got most of the non-limited + awakened/limited units by saving the free in game currency (and refusing to pull on general bannners) + a few rearms and haven't spent a single thing. Most of the good characters that carried me came from FREE selector packs that they gave out. There's just not really much I find worth spending on? Every time I hit a roadblock, I took that as my cue to take a break from this game and focus on another gacha/video game. Never treat these games as a chore. Surefire way to burn yourself out. Simply logging in every day to do dailies for a little bit really adds up. I also don't care about meaningless 'PvP' leaderboards in gacha so there's another avenue for spending closed. Would honestly rather spend money on physical merch like every other gacha I play, but unfortunately I can't really find much for CounterSide, which is a shame. To reiterate, it simply takes time to progress. If you're patient and strategize your resources in game, you can easily play through general content without spending money. \n\nDo I recommend CounterSide? For the story and the adventure, sure. I enjoyed my time so far and appreciate the effort put into the game, despite it not being much of a 'game' by definition. Plus, it's free. All it requires is time investment and building up your roster over time can be fun as a side game. You literally have no obligation to spend any money, despite what people seem to claim about every single gacha. Just don't be a pawn to the system. If you have no intentions of investing time in a gacha game or dislike reading, definitely not the game for you. Probably best to go play something else.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "CounterSide is one of the best mobile game I ever played. It has one of the best storyline. The gameplay is not really unique but fun regardless. Also, it's a gacha game, but the grinding itself doesn't exactly require you to spend a lot of money, or at all.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing daily game to play, quite addicting too.\r\nGacha game but with really regular events and coupon codes and free end game ASSR.\r\nAwesome arts and animations with beautiful stories.\r\nVariety of squad builds and require proper skills and timing to win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve got over +200 hours in Counter:Side counting other platfroms and have spent some money here and there, and honestly, it’s been worth it most of the time. The gameplay’s really fun — it’s fast but still has a lot of strategy, and the art and animations are pretty good. There’s definitely a grind, especially when it comes to gear and tuning, and yeah, power creep can be frustrating when new units outshine older ones. But the pity system’s ehhh, and most of the stuff I’ve paid for (like skins and passes) felt worth it. Despite the flaws, I still find myself logging in every day — it’s just a fun game that’s held my attention for a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1k Hours, you know its gonna be a thumbs up\nthe only reason i still play this game is because of the story, this is the best gacha game story from all of other gacha games that I've ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a fun Unit Builder/Line Battler? This might be your vibe.\n\nPros- Really cute to cool characters. Awesome voice acting to use of music. Interesting ways to build up your teams.\n\nCons- Takes a bit to earn Pull Tickets. Easy to get lost in day to day missions. Ship upgrading takes a lot of items that take a lot of time to either craft or earn. \n\nAll and all? A very interesting game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a gacha game. Don't expect much in terms of gameplay. That isn't what I'd recommend it for anyway. If there was anything I'd recommend it for, it'd be the story. The story is unique and doesn't take a dip in quality after the first few arcs. The characters are likable and are worth reading the side stories for. I hate that it's locked behind gameplay in a gacha game (which is heavily dependent on grinding and gambling) but the sprites are great and story content doesn't require spending. Note: the pov character isn't some faceless nobody, which is a plus in and of itself. Don't get too invested in pvp arena.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game since global first release and how dev destroying player sanity with the equipment grind, but this game rn need better UI at story / side story / event story that can be grind, kinda confused with what i miss and where to grind that currencies since i stop playing for like 7 months and come back before",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mungkin salah satu game gacha yang newbie friendly jadi ya kalau tertarik sih cobain aja, gamenya lumayan ringan juga kok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Gacha Game Ever, Top Tier Animation, Good Story, most of all tons of waifu and cute girls, good outfit\r\nWorth the Time to Grind the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hello Play community and the yesterday and Good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love it hate it, the best for you if you wanna look at story or grow strong you do you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game Gacha ever, really f2p friendly, weekly coupon code (almost), saving pity next banner, fair play ranked multiplayer. very recomended gacha game with many gacha game nowadays",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After almost 4000 hours, I can hardly say it's bad, right?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Good to play when bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good anime game highly reccommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy shit Nana Mizuki the goat is here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not best game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute PEAK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gasme qua hay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was a free to play player got my favs maxed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "meh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "xdd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been playing CounterSide since global launch on mobile (pre-Origin) and figured I might as well leave a review here as well. My playtime is a bit misleading since I also have hundreds of hours in the mobile version as well.\n\nAnyway, to get it out of the way: yes, this is a gacha game. If you do not like gacha games, this game won't entirely change your mind, but if you want a game that you can play easily on your commute while also having a genuinely good story, then this is it.\n\nAnd, yes, the story is genuinely, unquestionably good. I don't mean \"good for gacha\"; I mean, it's a legitimately well-written and conveyed story that has a lot of disparate elements that somehow manages to come together into a cohesive whole.\n\nIt has a lot of deep lore that it actually trusts the player to pick up as they play, drip-feeding small hints and tidbits, with earlier events and character stories making sense in new, revelatory ways as the story progresses. Every moment in the game is important, whether as a way to develop the characters or explain the larger story at hand. It's also really good at making players genuinely care about characters in short timeframes, with self-contained side narratives that deliver a lot of punch despite how little you spend with some of these characters in the grand scheme of things.\n\nIn short: the story is the strongest element of this game, and it is what most people play it for.\n\nProbably the only mild criticism I can give is that the actual play-order of the story is super opaque, since it's split between main story chapters and side story chapters, even though a lot of side story chapters are instrumental to understanding main story chapters. I hope they add a \"release order\" view for story eventually, so newcomers can play them in the order they were intended, instead of simply doing Main Story until they're roadblocked into doing a Side Story, which is what happens currently.\n\nAs for the gameplay, it's essentially Battle Cats or Line Rangers but with a few additional elements. In layman's terms, it's a bit like capture-the-flag, where you and your opponent start on opposite sides of a 2D horizontal plane with a base (usually a ship, in this game), and you use energy to send out units to destroy the opponent's base. It's simple but mostly effective, and an in-game reason is even given as to why battles are fought this way. It's not something you'll probably go out of your way to play, but it's at least more thought-out as a mechanic than other gacha combat.\n\nThe double-edged sword of CounterSide gameplay, however, is that you don't actually have to spend much time playing it. CounterSide is designed around bite-sized experiences, and after you clear a stage, you can easily auto-clear it to get additional resources, without having to replay it. In practice, this makes CounterSide an extremely friendly \"side-game\" for those who don't have much time to game because, after you complete most of the content, daily login quests take less than 30 minutes to complete, since you can basically just click several buttons to get through the majority of them. However, for those who want to play more of CounterSide, the game actually makes it hard to do so, which is a common criticism by the playerbase.\n\nAs someone who has ended up dropping basically all my other gacha games besides this one because I no longer have time to play them, I actually appreciate how much this game respects your time, but I can understand why, to some people, this might come off as a game with nonexistent or boring endgame content.\n\nIn terms of actual gacha generosity, I'd say this game is one of the better ones I've played. Blue tickets for SSR and below pulls are abundant, and I basically never have any trouble getting SSR characters I want. ASSR tickets are harder to come by, but the rollover pity and free selection ticket given during every six-month anniversary help alleviate this. As a collector, I've actually managed to finish my character collection up to 95% without actually trying, and I fully expect to hit close to 100 eventually, so that's definitely a mark in the game's favor in my book.\n\nAs for power creep, the game has added a new level cap of 120 since its release, as well as new reactors, but they've also bumped up resource acquisition and at least try to balance older units regularly, so it isn't too bad. The only criticism I'd give here is that: gear gacha (rolling for good latent skills) still kind of sucks, though it's a bit better now that there's finally pity, and they really need to increase fusion core acquisition.\n\nFinally, for those wondering what \"Origin\" refers to in some of these reviews, it was a bad update released by Bside after they started independently publishing their own game (after Nexon relinquished publishing rights). It changed a lot of user-friendly mechanics and made many of the game modes more tedious to play. Most of these changes have been walked back, however, and while the bad UI still remains (RIP old CounterSide UI), the game is generally fine now. While there's stuff I wish they had brought back that they didn't (like using dupes to limit fusion instead of having to use fusion cores), it's still leagues above most other gachas, so I'd encourage those who left because of Origin to try giving this game a second chance, if they liked the story back then and would like to see more of it.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "the story absolute cinema , It's very rare for a gacha game to have complex lore like this which keeps me playing counterside",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Not sure how I ended up in the game... but a few days ago I got my 3-year emblem and I think I missed only 2 days over those 3 years.\nI'm in the game mainly for the story, love the hell out of it.\nThe soundtrack complements it nicely.\nAs for the gameplay itself, well.... it is a gacha with surprisingly deep and complex mechanics.\nAs for the monetization - you don't need to pay at all, I only buy the counter passes and occasional quartz to accelerate things a bit.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Decent visual novel, lol. Oh wait, Studiobside calls it an 'Urban Graphic Novel RPG'. So, decent Urban Graphic Novel RPG. Pft.\n\nSeriously though, not a *bad* game. Not bad at all. Maybe a bad gacha to some, but I treated it more like a visual novel (as stated) because that's...what the majority of the game is? That's a majority of what all gacha is!\n\nNot much in the way of graphic settings. Performance is good (as long as you meet the system requirements) and I found the game stable on various forms of modern hardware. Never had any issues. No crashes. Only real issue I can think some people might have in regard to performance is connection issues if you don't have great internet, but it is a game that requires internet, so go figure. Game battles *might* hang/have delays if you have slow speeds.\n\nI didn't expect much out of the story, but it ended up being enjoyable for me. Nothing groundbreaking of course. Slow to start, but worth sticking around. Lots of shenanigans, lots of really good moments and story beats. If you like sci-fi, it's certainly an interesting piece of fiction. Definitely helps that I kept my expectations low, as I'm very critical of 'gacha game writing'. This isn't the best gacha game story I've experienced, but it's certainly a notable one. There's also lots of side stories (I forgot what they're labeled as in game) and other little tidbits in game that act as supplements for characters etc. Lots of reading if you're into that, as a majority of story stuff later on is (unfortunately) unvoiced.\n\nGameplay. It is literally an idle game. Game description refers to gameplay as 'line battles'. Your units are on the left, enemy is on the right of the screen. You drop units to deploy on the field. Units will attack on their own (main goal being destroying enemy 'ship', boss or defensive position within time limit), but you can select their main ability to use once charged. If your characters get defeated, they simply enter a cooldown and you can either wait for them to become available or choose someone else to deploy. You lose if time runs out or if your ship gets destroyed by the enemy (a.k.a you get overwhelmed). There are certain mechanics like weaknesses whatever and finding the right moment to use your abilities on higher level battles, but general content is easy enough to get through with a general roster. Do pay attention to the game tooltips and tutorials, as gameplay mechanics do switch up from time to time in regard to events/special battles. Anyway, you mostly just watch your employees battle like it's a free for all in BlazBlue or something. The animations and some of the combat moves the characters have are actually visually impressive, in my opinion. Sucks that these cool animations/cut-ins and abilities are stuck in an idle gacha game, but that's the way the cookie crumbles unfortunately. \n\nLeveling and building characters/your ships is similar to other gacha games, so no need to really explain. You farm parts/materials/equipment from various stages to improve their stats. Straightforward stuff. You also have a form of 'logistics' (think GFL logistics) where you send out your units for maybe a couple hours of real time to bring back various types of resources. These logistic missions may also open up 'raids' that you can run for resources. They're mostly 'endgame' battles and you're supposed to do them with people on your friends list, but thought I'd mention this feature. \n\nCharacters are neat. Lots of favorites to have (Christina Brecht enjoyer here!). Each has their own little profile with employee info, kinda like Arknights. Nothing too extensive, but overall decent and at least gives a nice look into their personalities. Love the variety compared to other games where they milk the same damn fetishes over and over and over. This game just has the most random character designs, I swear. There's PMC dudes, soldiers, cops, security guys, musicians, mafia, artificial humans, mages and honestly so much more to give an idea on general designs. There's also units that are straight up robots, mechs, drones, tanks, air units, or transport vehicles. It's actually really interesting having those and it's something new compared to most gacha which constantly milk waifus. Yeah, there's bait in this game like every other, but the 'fanservice-to-cool' ratio is quite balanced. And of course, the male/female ratio is skewed, but I think there's at least something for everyone here. I don't exactly dislike any design in this game. Everyone is pretty great/unique and like I said, it's something different from the usual. My only nitpick with the characters is that there's a lack of voices for a majority of them, which sucks. There's KR audio for most chars, but I personally use the JP audio that's included because I don't fully understand Korean (which is where the lack of voices comes in). I forget the reason why they decided not to finish up adding JP voices, but whatever. Just wild to think about since games like Arknights has like 4 voice options (English, Chinese, Japanese and Korean) for *most* characters' battle lines/lobby lines now, lmao. Again, personal nitpick. I also wish there was more lobby dialogue. Some characters are obviously more developed/fleshed out than others and it sucks.\n\nMusic is fantastic. Always appreciate how most gacha games have remarkable music compositions (t's like their one saving grace when all else fails). This game is no exception. Wonderful job in this aspect of the game. No complaints.\n\nMicrotransactions are the usual. Same as every other modern gacha, really. Recharge stuff, premium currency, upgrade packs, battle passes, etc. Most skins cost premium currency. There were like two or three skins that I liked for a couple characters I had (Xiao Lin, John Mason, Han Sorim), but those were able to be bought with saved up in game currency, so...win win? The paid skins are cool, but at the end of the day, I have no interest in spending money on JPEGs....unless that JPEG is fan/doujin-made & specially designed for use on a 160x50cm pillowcase, heyo.\n\nThe gacha is whatever honestly. I've got through most of the story, done most events aside from the hardest difficulty stages, got most of the non-limited + awakened/limited units by saving the free in game currency (and refusing to pull on general bannners) + a few rearms and haven't spent a single thing. Most of the good characters that carried me came from FREE selector packs that they gave out. There's just not really much I find worth spending on? Every time I hit a roadblock, I took that as my cue to take a break from this game and focus on another gacha/video game. Never treat these games as a chore. Surefire way to burn yourself out. Simply logging in every day to do dailies for a little bit really adds up. I also don't care about meaningless 'PvP' leaderboards in gacha so there's another avenue for spending closed. Would honestly rather spend money on physical merch like every other gacha I play, but unfortunately I can't really find much for CounterSide, which is a shame. To reiterate, it simply takes time to progress. If you're patient and strategize your resources in game, you can easily play through general content without spending money. \n\nDo I recommend CounterSide? For the story and the adventure, sure. I enjoyed my time so far and appreciate the effort put into the game, despite it not being much of a 'game' by definition. Plus, it's free. All it requires is time investment and building up your roster over time can be fun as a side game. You literally have no obligation to spend any money, despite what people seem to claim about every single gacha. Just don't be a pawn to the system. If you have no intentions of investing time in a gacha game or dislike reading, definitely not the game for you. Probably best to go play something else.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "CounterSide is one of the best mobile game I ever played. It has one of the best storyline. The gameplay is not really unique but fun regardless. Also, it's a gacha game, but the grinding itself doesn't exactly require you to spend a lot of money, or at all.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing daily game to play, quite addicting too.\r\nGacha game but with really regular events and coupon codes and free end game ASSR.\r\nAwesome arts and animations with beautiful stories.\r\nVariety of squad builds and require proper skills and timing to win.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve got over +200 hours in Counter:Side counting other platfroms and have spent some money here and there, and honestly, it’s been worth it most of the time. The gameplay’s really fun — it’s fast but still has a lot of strategy, and the art and animations are pretty good. There’s definitely a grind, especially when it comes to gear and tuning, and yeah, power creep can be frustrating when new units outshine older ones. But the pity system’s ehhh, and most of the stuff I’ve paid for (like skins and passes) felt worth it. Despite the flaws, I still find myself logging in every day — it’s just a fun game that’s held my attention for a long time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1k Hours, you know its gonna be a thumbs up\nthe only reason i still play this game is because of the story, this is the best gacha game story from all of other gacha games that I've ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a fun Unit Builder/Line Battler? This might be your vibe.\n\nPros- Really cute to cool characters. Awesome voice acting to use of music. Interesting ways to build up your teams.\n\nCons- Takes a bit to earn Pull Tickets. Easy to get lost in day to day missions. Ship upgrading takes a lot of items that take a lot of time to either craft or earn. \n\nAll and all? A very interesting game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a gacha game. Don't expect much in terms of gameplay. That isn't what I'd recommend it for anyway. If there was anything I'd recommend it for, it'd be the story. The story is unique and doesn't take a dip in quality after the first few arcs. The characters are likable and are worth reading the side stories for. I hate that it's locked behind gameplay in a gacha game (which is heavily dependent on grinding and gambling) but the sprites are great and story content doesn't require spending. Note: the pov character isn't some faceless nobody, which is a plus in and of itself. Don't get too invested in pvp arena.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game since global first release and how dev destroying player sanity with the equipment grind, but this game rn need better UI at story / side story / event story that can be grind, kinda confused with what i miss and where to grind that currencies since i stop playing for like 7 months and come back before",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mungkin salah satu game gacha yang newbie friendly jadi ya kalau tertarik sih cobain aja, gamenya lumayan ringan juga kok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Gacha Game Ever, Top Tier Animation, Good Story, most of all tons of waifu and cute girls, good outfit\r\nWorth the Time to Grind the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hello Play community and the yesterday and Good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love it hate it, the best for you if you wanna look at story or grow strong you do you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best game Gacha ever, really f2p friendly, weekly coupon code (almost), saving pity next banner, fair play ranked multiplayer. very recomended gacha game with many gacha game nowadays",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After almost 4000 hours, I can hardly say it's bad, right?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Good to play when bored",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good anime game highly reccommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "holy shit Nana Mizuki the goat is here",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "To be fair, it ain't bad, but it ain't a masterpiece either. Coming from  Metal Slug Defense, I find it a little disappointing.\n\nThe gameplay is just clicking and strategies for where to place your units, but the problem is theirs a limit of 8 spaces for your units and a very short arena, making the gameplay very fast and somewhat boring really quickly. The artwork aint nothing special either, but their some heroes here and there that do shine, but those are SSR tier, even then the matches go by so quickly you bearly enjoy the sprites because everything goes so fast in a very short space, leading to a jumbled mess. \n\nThe Story is kind of boring, it threw me 10 minutes of lore of some lady that I really didn't care about. As if I'm here for a history class, and the characters are forgettable and annoying.  For example, Yoo Shiyoon felt like a wanna be \"lay back\" character but came off as a clown trying to be cool. I end up skipping through the story since there was no hook, just a bunch of lore that bearly mentioned the protagonist.  I only saw like two times the protagonist was ever mentioned, and like one time you ever made a dialogue choice, and that was just simply to change your name.\n\nHeading over to the pricing, since this is a free-to-play game, you'll likely be hit by the pay-to-win very quickly, since each SSR+ where much stronger with better artwork. Each one has a unique way to enter the arena, some with a godly entrance, while others have a special AOE attack as they enter. Making me giggle and shout as I call my Mech to slam onto my opponents with an angelic form. Other than that, good luck even getting one because the SSR+ I'm talking about are the unique characters., You can tell that these characters are unique since each one glows with a golden aura, unlike the other regular SSRs. One way to get SSR+ is with Quarts, which can be obtained in-game (with a cooldown of 6 days per purchase) or with admin coin. You need 150 for the petty system to help you, and each one costs 300 coins, and each 300 coins costs 3$. We are talking about $450 just to get the character you want. This is without the promo or events and etc, etc. That's only mentioning the gotcha spect, their other purchases that can be made, but I find them simply stupid, like buying a JPG for your HQ that costs 3$. Utter bonkers. You can decide how to spend that hard-earned cash.\n\nLike I said, it ain't bad, it has potential. If you're here for the lovely art, then by all means. As it stands, I've been having a great time watching all the sprites go boom. That said, I don't recommend spending cash on the first few days unless you enjoy the story; otherwise, you'll just be wasting your cash since the gameplay gets boring quite quickly. I do see myself coming with hope and aeager to change my review once this game become more budget-friendly with better story and gameplay.\n\n$50 bucks would probably get you a better story and similar gameplay somehwere els,  even so, I do welcome you to try it since the first few hours are free and fun. Not worth the 450 tho.\n\nAs a recommendation to the dev(s), I do advise having the player be more related to the world before dropping lore of characters when I haven't even invested in the gameplay or the protagonist. Make the arena much larger, I can't see what's going on or how to strategies when theirs 3 trigger-happy throwing blinding light all over that painfully small map. And for crying out loud, can't we have our Mechs to be big? huge compared to the other units. kills the hype when I see my mech as short as my loly Magica girl!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a very poverty sort of tower defense gacha. The one thing that it sorta reminds me of is Battle Cats except Battle Cats mogs this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The art is great, but the game is bogged down by repetitive combat and way too much busywork. More chore than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gacha game with a honey moon phase and once thats over you pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Falling down the stairs is less painful than playing this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know wtf my team is doing, they don't rush B anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Rank in Korea BROKEN FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks like a game but it's just a Skinner box with anime babes designed to separate you from as much money as possible.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "pretty good game but after losing an assr unit from a serverside problem and then the support not wanting give me back the unit its just a no.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Monetization is terrible and deceptive. Says a package gives you 8 picks. It doesn't. Wasted a lot of money. Boring repetative gameplay. Poorly translated story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried CounterSide, but it quickly became boring. The gameplay didn’t keep me engaged, and I ended up quitting after only a short time. Not enough to hold my attention compared to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a very poverty sort of tower defense gacha. The one thing that it sorta reminds me of is Battle Cats except Battle Cats mogs this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game that gives a ton of SSRs for you to hit a wall in the main story at chapter 5 at the same level of the enemies, to get you to spend money.\r\n\r\nUninstalled, and recommend you find a different gacha game to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The art is great, but the game is bogged down by repetitive combat and way too much busywork. More chore than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To be fair, it ain't bad, but it ain't a masterpiece either. Coming from  Metal Slug Defense, I find it a little disappointing.\n\nThe gameplay is just clicking and strategies for where to place your units, but the problem is theirs a limit of 8 spaces for your units and a very short arena, making the gameplay very fast and somewhat boring really quickly. The artwork aint nothing special either, but their some heroes here and there that do shine, but those are SSR tier, even then the matches go by so quickly you bearly enjoy the sprites because everything goes so fast in a very short space, leading to a jumbled mess. \n\nThe Story is kind of boring, it threw me 10 minutes of lore of some lady that I really didn't care about. As if I'm here for a history class, and the characters are forgettable and annoying.  For example, Yoo Shiyoon felt like a wanna be \"lay back\" character but came off as a clown trying to be cool. I end up skipping through the story since there was no hook, just a bunch of lore that bearly mentioned the protagonist.  I only saw like two times the protagonist was ever mentioned, and like one time you ever made a dialogue choice, and that was just simply to change your name.\n\nHeading over to the pricing, since this is a free-to-play game, you'll likely be hit by the pay-to-win very quickly, since each SSR+ where much stronger with better artwork. Each one has a unique way to enter the arena, some with a godly entrance, while others have a special AOE attack as they enter. Making me giggle and shout as I call my Mech to slam onto my opponents with an angelic form. Other than that, good luck even getting one because the SSR+ I'm talking about are the unique characters., You can tell that these characters are unique since each one glows with a golden aura, unlike the other regular SSRs. One way to get SSR+ is with Quarts, which can be obtained in-game (with a cooldown of 6 days per purchase) or with admin coin. You need 150 for the petty system to help you, and each one costs 300 coins, and each 300 coins costs 3$. We are talking about $450 just to get the character you want. This is without the promo or events and etc, etc. That's only mentioning the gotcha spect, their other purchases that can be made, but I find them simply stupid, like buying a JPG for your HQ that costs 3$. Utter bonkers. You can decide how to spend that hard-earned cash.\n\nLike I said, it ain't bad, it has potential. If you're here for the lovely art, then by all means. As it stands, I've been having a great time watching all the sprites go boom. That said, I don't recommend spending cash on the first few days unless you enjoy the story; otherwise, you'll just be wasting your cash since the gameplay gets boring quite quickly. I do see myself coming with hope and aeager to change my review once this game become more budget-friendly with better story and gameplay.\n\n$50 bucks would probably get you a better story and similar gameplay somehwere els,  even so, I do welcome you to try it since the first few hours are free and fun. Not worth the 450 tho.\n\nAs a recommendation to the dev(s), I do advise having the player be more related to the world before dropping lore of characters when I haven't even invested in the gameplay or the protagonist. Make the arena much larger, I can't see what's going on or how to strategies when theirs 3 trigger-happy throwing blinding light all over that painfully small map. And for crying out loud, can't we have our Mechs to be big? huge compared to the other units. kills the hype when I see my mech as short as my loly Magica girl!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gacha game with a honey moon phase and once thats over you pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Falling down the stairs is less painful than playing this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know wtf my team is doing, they don't rush B anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no achievements or trading cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rank in Korea BROKEN FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks like a game but it's just a Skinner box with anime babes designed to separate you from as much money as possible.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "pretty good game but after losing an assr unit from a serverside problem and then the support not wanting give me back the unit its just a no.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Monetization is terrible and deceptive. Says a package gives you 8 picks. It doesn't. Wasted a lot of money. Boring repetative gameplay. Poorly translated story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried CounterSide, but it quickly became boring. The gameplay didn’t keep me engaged, and I ended up quitting after only a short time. Not enough to hold my attention compared to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a very poverty sort of tower defense gacha. The one thing that it sorta reminds me of is Battle Cats except Battle Cats mogs this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game that gives a ton of SSRs for you to hit a wall in the main story at chapter 5 at the same level of the enemies, to get you to spend money.\r\n\r\nUninstalled, and recommend you find a different gacha game to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The art is great, but the game is bogged down by repetitive combat and way too much busywork. More chore than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To be fair, it ain't bad, but it ain't a masterpiece either. Coming from  Metal Slug Defense, I find it a little disappointing.\n\nThe gameplay is just clicking and strategies for where to place your units, but the problem is theirs a limit of 8 spaces for your units and a very short arena, making the gameplay very fast and somewhat boring really quickly. The artwork aint nothing special either, but their some heroes here and there that do shine, but those are SSR tier, even then the matches go by so quickly you bearly enjoy the sprites because everything goes so fast in a very short space, leading to a jumbled mess. \n\nThe Story is kind of boring, it threw me 10 minutes of lore of some lady that I really didn't care about. As if I'm here for a history class, and the characters are forgettable and annoying.  For example, Yoo Shiyoon felt like a wanna be \"lay back\" character but came off as a clown trying to be cool. I end up skipping through the story since there was no hook, just a bunch of lore that bearly mentioned the protagonist.  I only saw like two times the protagonist was ever mentioned, and like one time you ever made a dialogue choice, and that was just simply to change your name.\n\nHeading over to the pricing, since this is a free-to-play game, you'll likely be hit by the pay-to-win very quickly, since each SSR+ where much stronger with better artwork. Each one has a unique way to enter the arena, some with a godly entrance, while others have a special AOE attack as they enter. Making me giggle and shout as I call my Mech to slam onto my opponents with an angelic form. Other than that, good luck even getting one because the SSR+ I'm talking about are the unique characters., You can tell that these characters are unique since each one glows with a golden aura, unlike the other regular SSRs. One way to get SSR+ is with Quarts, which can be obtained in-game (with a cooldown of 6 days per purchase) or with admin coin. You need 150 for the petty system to help you, and each one costs 300 coins, and each 300 coins costs 3$. We are talking about $450 just to get the character you want. This is without the promo or events and etc, etc. That's only mentioning the gotcha spect, their other purchases that can be made, but I find them simply stupid, like buying a JPG for your HQ that costs 3$. Utter bonkers. You can decide how to spend that hard-earned cash.\n\nLike I said, it ain't bad, it has potential. If you're here for the lovely art, then by all means. As it stands, I've been having a great time watching all the sprites go boom. That said, I don't recommend spending cash on the first few days unless you enjoy the story; otherwise, you'll just be wasting your cash since the gameplay gets boring quite quickly. I do see myself coming with hope and aeager to change my review once this game become more budget-friendly with better story and gameplay.\n\n$50 bucks would probably get you a better story and similar gameplay somehwere els,  even so, I do welcome you to try it since the first few hours are free and fun. Not worth the 450 tho.\n\nAs a recommendation to the dev(s), I do advise having the player be more related to the world before dropping lore of characters when I haven't even invested in the gameplay or the protagonist. Make the arena much larger, I can't see what's going on or how to strategies when theirs 3 trigger-happy throwing blinding light all over that painfully small map. And for crying out loud, can't we have our Mechs to be big? huge compared to the other units. kills the hype when I see my mech as short as my loly Magica girl!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gacha game with a honey moon phase and once thats over you pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Falling down the stairs is less painful than playing this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know wtf my team is doing, they don't rush B anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no achievements or trading cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rank in Korea BROKEN FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks like a game but it's just a Skinner box with anime babes designed to separate you from as much money as possible.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "pretty good game but after losing an assr unit from a serverside problem and then the support not wanting give me back the unit its just a no.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Monetization is terrible and deceptive. Says a package gives you 8 picks. It doesn't. Wasted a lot of money. Boring repetative gameplay. Poorly translated story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried CounterSide, but it quickly became boring. The gameplay didn’t keep me engaged, and I ended up quitting after only a short time. Not enough to hold my attention compared to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a very poverty sort of tower defense gacha. The one thing that it sorta reminds me of is Battle Cats except Battle Cats mogs this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game that gives a ton of SSRs for you to hit a wall in the main story at chapter 5 at the same level of the enemies, to get you to spend money.\r\n\r\nUninstalled, and recommend you find a different gacha game to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The art is great, but the game is bogged down by repetitive combat and way too much busywork. More chore than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To be fair, it ain't bad, but it ain't a masterpiece either. Coming from  Metal Slug Defense, I find it a little disappointing.\n\nThe gameplay is just clicking and strategies for where to place your units, but the problem is theirs a limit of 8 spaces for your units and a very short arena, making the gameplay very fast and somewhat boring really quickly. The artwork aint nothing special either, but their some heroes here and there that do shine, but those are SSR tier, even then the matches go by so quickly you bearly enjoy the sprites because everything goes so fast in a very short space, leading to a jumbled mess. \n\nThe Story is kind of boring, it threw me 10 minutes of lore of some lady that I really didn't care about. As if I'm here for a history class, and the characters are forgettable and annoying.  For example, Yoo Shiyoon felt like a wanna be \"lay back\" character but came off as a clown trying to be cool. I end up skipping through the story since there was no hook, just a bunch of lore that bearly mentioned the protagonist.  I only saw like two times the protagonist was ever mentioned, and like one time you ever made a dialogue choice, and that was just simply to change your name.\n\nHeading over to the pricing, since this is a free-to-play game, you'll likely be hit by the pay-to-win very quickly, since each SSR+ where much stronger with better artwork. Each one has a unique way to enter the arena, some with a godly entrance, while others have a special AOE attack as they enter. Making me giggle and shout as I call my Mech to slam onto my opponents with an angelic form. Other than that, good luck even getting one because the SSR+ I'm talking about are the unique characters., You can tell that these characters are unique since each one glows with a golden aura, unlike the other regular SSRs. One way to get SSR+ is with Quarts, which can be obtained in-game (with a cooldown of 6 days per purchase) or with admin coin. You need 150 for the petty system to help you, and each one costs 300 coins, and each 300 coins costs 3$. We are talking about $450 just to get the character you want. This is without the promo or events and etc, etc. That's only mentioning the gotcha spect, their other purchases that can be made, but I find them simply stupid, like buying a JPG for your HQ that costs 3$. Utter bonkers. You can decide how to spend that hard-earned cash.\n\nLike I said, it ain't bad, it has potential. If you're here for the lovely art, then by all means. As it stands, I've been having a great time watching all the sprites go boom. That said, I don't recommend spending cash on the first few days unless you enjoy the story; otherwise, you'll just be wasting your cash since the gameplay gets boring quite quickly. I do see myself coming with hope and aeager to change my review once this game become more budget-friendly with better story and gameplay.\n\n$50 bucks would probably get you a better story and similar gameplay somehwere els,  even so, I do welcome you to try it since the first few hours are free and fun. Not worth the 450 tho.\n\nAs a recommendation to the dev(s), I do advise having the player be more related to the world before dropping lore of characters when I haven't even invested in the gameplay or the protagonist. Make the arena much larger, I can't see what's going on or how to strategies when theirs 3 trigger-happy throwing blinding light all over that painfully small map. And for crying out loud, can't we have our Mechs to be big? huge compared to the other units. kills the hype when I see my mech as short as my loly Magica girl!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gacha game with a honey moon phase and once thats over you pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Falling down the stairs is less painful than playing this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know wtf my team is doing, they don't rush B anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no achievements or trading cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rank in Korea BROKEN FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks like a game but it's just a Skinner box with anime babes designed to separate you from as much money as possible.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "pretty good game but after losing an assr unit from a serverside problem and then the support not wanting give me back the unit its just a no.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Monetization is terrible and deceptive. Says a package gives you 8 picks. It doesn't. Wasted a lot of money. Boring repetative gameplay. Poorly translated story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried CounterSide, but it quickly became boring. The gameplay didn’t keep me engaged, and I ended up quitting after only a short time. Not enough to hold my attention compared to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a very poverty sort of tower defense gacha. The one thing that it sorta reminds me of is Battle Cats except Battle Cats mogs this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game that gives a ton of SSRs for you to hit a wall in the main story at chapter 5 at the same level of the enemies, to get you to spend money.\r\n\r\nUninstalled, and recommend you find a different gacha game to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The art is great, but the game is bogged down by repetitive combat and way too much busywork. More chore than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To be fair, it ain't bad, but it ain't a masterpiece either. Coming from  Metal Slug Defense, I find it a little disappointing.\n\nThe gameplay is just clicking and strategies for where to place your units, but the problem is theirs a limit of 8 spaces for your units and a very short arena, making the gameplay very fast and somewhat boring really quickly. The artwork aint nothing special either, but their some heroes here and there that do shine, but those are SSR tier, even then the matches go by so quickly you bearly enjoy the sprites because everything goes so fast in a very short space, leading to a jumbled mess. \n\nThe Story is kind of boring, it threw me 10 minutes of lore of some lady that I really didn't care about. As if I'm here for a history class, and the characters are forgettable and annoying.  For example, Yoo Shiyoon felt like a wanna be \"lay back\" character but came off as a clown trying to be cool. I end up skipping through the story since there was no hook, just a bunch of lore that bearly mentioned the protagonist.  I only saw like two times the protagonist was ever mentioned, and like one time you ever made a dialogue choice, and that was just simply to change your name.\n\nHeading over to the pricing, since this is a free-to-play game, you'll likely be hit by the pay-to-win very quickly, since each SSR+ where much stronger with better artwork. Each one has a unique way to enter the arena, some with a godly entrance, while others have a special AOE attack as they enter. Making me giggle and shout as I call my Mech to slam onto my opponents with an angelic form. Other than that, good luck even getting one because the SSR+ I'm talking about are the unique characters., You can tell that these characters are unique since each one glows with a golden aura, unlike the other regular SSRs. One way to get SSR+ is with Quarts, which can be obtained in-game (with a cooldown of 6 days per purchase) or with admin coin. You need 150 for the petty system to help you, and each one costs 300 coins, and each 300 coins costs 3$. We are talking about $450 just to get the character you want. This is without the promo or events and etc, etc. That's only mentioning the gotcha spect, their other purchases that can be made, but I find them simply stupid, like buying a JPG for your HQ that costs 3$. Utter bonkers. You can decide how to spend that hard-earned cash.\n\nLike I said, it ain't bad, it has potential. If you're here for the lovely art, then by all means. As it stands, I've been having a great time watching all the sprites go boom. That said, I don't recommend spending cash on the first few days unless you enjoy the story; otherwise, you'll just be wasting your cash since the gameplay gets boring quite quickly. I do see myself coming with hope and aeager to change my review once this game become more budget-friendly with better story and gameplay.\n\n$50 bucks would probably get you a better story and similar gameplay somehwere els,  even so, I do welcome you to try it since the first few hours are free and fun. Not worth the 450 tho.\n\nAs a recommendation to the dev(s), I do advise having the player be more related to the world before dropping lore of characters when I haven't even invested in the gameplay or the protagonist. Make the arena much larger, I can't see what's going on or how to strategies when theirs 3 trigger-happy throwing blinding light all over that painfully small map. And for crying out loud, can't we have our Mechs to be big? huge compared to the other units. kills the hype when I see my mech as short as my loly Magica girl!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gacha game with a honey moon phase and once thats over you pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Falling down the stairs is less painful than playing this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know wtf my team is doing, they don't rush B anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no achievements or trading cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rank in Korea BROKEN FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks like a game but it's just a Skinner box with anime babes designed to separate you from as much money as possible.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "pretty good game but after losing an assr unit from a serverside problem and then the support not wanting give me back the unit its just a no.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Monetization is terrible and deceptive. Says a package gives you 8 picks. It doesn't. Wasted a lot of money. Boring repetative gameplay. Poorly translated story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried CounterSide, but it quickly became boring. The gameplay didn’t keep me engaged, and I ended up quitting after only a short time. Not enough to hold my attention compared to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a very poverty sort of tower defense gacha. The one thing that it sorta reminds me of is Battle Cats except Battle Cats mogs this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game that gives a ton of SSRs for you to hit a wall in the main story at chapter 5 at the same level of the enemies, to get you to spend money.\r\n\r\nUninstalled, and recommend you find a different gacha game to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The art is great, but the game is bogged down by repetitive combat and way too much busywork. More chore than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To be fair, it ain't bad, but it ain't a masterpiece either. Coming from  Metal Slug Defense, I find it a little disappointing.\n\nThe gameplay is just clicking and strategies for where to place your units, but the problem is theirs a limit of 8 spaces for your units and a very short arena, making the gameplay very fast and somewhat boring really quickly. The artwork aint nothing special either, but their some heroes here and there that do shine, but those are SSR tier, even then the matches go by so quickly you bearly enjoy the sprites because everything goes so fast in a very short space, leading to a jumbled mess. \n\nThe Story is kind of boring, it threw me 10 minutes of lore of some lady that I really didn't care about. As if I'm here for a history class, and the characters are forgettable and annoying.  For example, Yoo Shiyoon felt like a wanna be \"lay back\" character but came off as a clown trying to be cool. I end up skipping through the story since there was no hook, just a bunch of lore that bearly mentioned the protagonist.  I only saw like two times the protagonist was ever mentioned, and like one time you ever made a dialogue choice, and that was just simply to change your name.\n\nHeading over to the pricing, since this is a free-to-play game, you'll likely be hit by the pay-to-win very quickly, since each SSR+ where much stronger with better artwork. Each one has a unique way to enter the arena, some with a godly entrance, while others have a special AOE attack as they enter. Making me giggle and shout as I call my Mech to slam onto my opponents with an angelic form. Other than that, good luck even getting one because the SSR+ I'm talking about are the unique characters., You can tell that these characters are unique since each one glows with a golden aura, unlike the other regular SSRs. One way to get SSR+ is with Quarts, which can be obtained in-game (with a cooldown of 6 days per purchase) or with admin coin. You need 150 for the petty system to help you, and each one costs 300 coins, and each 300 coins costs 3$. We are talking about $450 just to get the character you want. This is without the promo or events and etc, etc. That's only mentioning the gotcha spect, their other purchases that can be made, but I find them simply stupid, like buying a JPG for your HQ that costs 3$. Utter bonkers. You can decide how to spend that hard-earned cash.\n\nLike I said, it ain't bad, it has potential. If you're here for the lovely art, then by all means. As it stands, I've been having a great time watching all the sprites go boom. That said, I don't recommend spending cash on the first few days unless you enjoy the story; otherwise, you'll just be wasting your cash since the gameplay gets boring quite quickly. I do see myself coming with hope and aeager to change my review once this game become more budget-friendly with better story and gameplay.\n\n$50 bucks would probably get you a better story and similar gameplay somehwere els,  even so, I do welcome you to try it since the first few hours are free and fun. Not worth the 450 tho.\n\nAs a recommendation to the dev(s), I do advise having the player be more related to the world before dropping lore of characters when I haven't even invested in the gameplay or the protagonist. Make the arena much larger, I can't see what's going on or how to strategies when theirs 3 trigger-happy throwing blinding light all over that painfully small map. And for crying out loud, can't we have our Mechs to be big? huge compared to the other units. kills the hype when I see my mech as short as my loly Magica girl!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gacha game with a honey moon phase and once thats over you pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Falling down the stairs is less painful than playing this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know wtf my team is doing, they don't rush B anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no achievements or trading cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rank in Korea BROKEN FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks like a game but it's just a Skinner box with anime babes designed to separate you from as much money as possible.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "pretty good game but after losing an assr unit from a serverside problem and then the support not wanting give me back the unit its just a no.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Monetization is terrible and deceptive. Says a package gives you 8 picks. It doesn't. Wasted a lot of money. Boring repetative gameplay. Poorly translated story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried CounterSide, but it quickly became boring. The gameplay didn’t keep me engaged, and I ended up quitting after only a short time. Not enough to hold my attention compared to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a very poverty sort of tower defense gacha. The one thing that it sorta reminds me of is Battle Cats except Battle Cats mogs this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game that gives a ton of SSRs for you to hit a wall in the main story at chapter 5 at the same level of the enemies, to get you to spend money.\r\n\r\nUninstalled, and recommend you find a different gacha game to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The art is great, but the game is bogged down by repetitive combat and way too much busywork. More chore than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To be fair, it ain't bad, but it ain't a masterpiece either. Coming from  Metal Slug Defense, I find it a little disappointing.\n\nThe gameplay is just clicking and strategies for where to place your units, but the problem is theirs a limit of 8 spaces for your units and a very short arena, making the gameplay very fast and somewhat boring really quickly. The artwork aint nothing special either, but their some heroes here and there that do shine, but those are SSR tier, even then the matches go by so quickly you bearly enjoy the sprites because everything goes so fast in a very short space, leading to a jumbled mess. \n\nThe Story is kind of boring, it threw me 10 minutes of lore of some lady that I really didn't care about. As if I'm here for a history class, and the characters are forgettable and annoying.  For example, Yoo Shiyoon felt like a wanna be \"lay back\" character but came off as a clown trying to be cool. I end up skipping through the story since there was no hook, just a bunch of lore that bearly mentioned the protagonist.  I only saw like two times the protagonist was ever mentioned, and like one time you ever made a dialogue choice, and that was just simply to change your name.\n\nHeading over to the pricing, since this is a free-to-play game, you'll likely be hit by the pay-to-win very quickly, since each SSR+ where much stronger with better artwork. Each one has a unique way to enter the arena, some with a godly entrance, while others have a special AOE attack as they enter. Making me giggle and shout as I call my Mech to slam onto my opponents with an angelic form. Other than that, good luck even getting one because the SSR+ I'm talking about are the unique characters., You can tell that these characters are unique since each one glows with a golden aura, unlike the other regular SSRs. One way to get SSR+ is with Quarts, which can be obtained in-game (with a cooldown of 6 days per purchase) or with admin coin. You need 150 for the petty system to help you, and each one costs 300 coins, and each 300 coins costs 3$. We are talking about $450 just to get the character you want. This is without the promo or events and etc, etc. That's only mentioning the gotcha spect, their other purchases that can be made, but I find them simply stupid, like buying a JPG for your HQ that costs 3$. Utter bonkers. You can decide how to spend that hard-earned cash.\n\nLike I said, it ain't bad, it has potential. If you're here for the lovely art, then by all means. As it stands, I've been having a great time watching all the sprites go boom. That said, I don't recommend spending cash on the first few days unless you enjoy the story; otherwise, you'll just be wasting your cash since the gameplay gets boring quite quickly. I do see myself coming with hope and aeager to change my review once this game become more budget-friendly with better story and gameplay.\n\n$50 bucks would probably get you a better story and similar gameplay somehwere els,  even so, I do welcome you to try it since the first few hours are free and fun. Not worth the 450 tho.\n\nAs a recommendation to the dev(s), I do advise having the player be more related to the world before dropping lore of characters when I haven't even invested in the gameplay or the protagonist. Make the arena much larger, I can't see what's going on or how to strategies when theirs 3 trigger-happy throwing blinding light all over that painfully small map. And for crying out loud, can't we have our Mechs to be big? huge compared to the other units. kills the hype when I see my mech as short as my loly Magica girl!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gacha game with a honey moon phase and once thats over you pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Falling down the stairs is less painful than playing this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know wtf my team is doing, they don't rush B anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no achievements or trading cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rank in Korea BROKEN FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks like a game but it's just a Skinner box with anime babes designed to separate you from as much money as possible.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "pretty good game but after losing an assr unit from a serverside problem and then the support not wanting give me back the unit its just a no.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Monetization is terrible and deceptive. Says a package gives you 8 picks. It doesn't. Wasted a lot of money. Boring repetative gameplay. Poorly translated story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried CounterSide, but it quickly became boring. The gameplay didn’t keep me engaged, and I ended up quitting after only a short time. Not enough to hold my attention compared to other games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a very poverty sort of tower defense gacha. The one thing that it sorta reminds me of is Battle Cats except Battle Cats mogs this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trash game that gives a ton of SSRs for you to hit a wall in the main story at chapter 5 at the same level of the enemies, to get you to spend money.\r\n\r\nUninstalled, and recommend you find a different gacha game to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The art is great, but the game is bogged down by repetitive combat and way too much busywork. More chore than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To be fair, it ain't bad, but it ain't a masterpiece either. Coming from  Metal Slug Defense, I find it a little disappointing.\n\nThe gameplay is just clicking and strategies for where to place your units, but the problem is theirs a limit of 8 spaces for your units and a very short arena, making the gameplay very fast and somewhat boring really quickly. The artwork aint nothing special either, but their some heroes here and there that do shine, but those are SSR tier, even then the matches go by so quickly you bearly enjoy the sprites because everything goes so fast in a very short space, leading to a jumbled mess. \n\nThe Story is kind of boring, it threw me 10 minutes of lore of some lady that I really didn't care about. As if I'm here for a history class, and the characters are forgettable and annoying.  For example, Yoo Shiyoon felt like a wanna be \"lay back\" character but came off as a clown trying to be cool. I end up skipping through the story since there was no hook, just a bunch of lore that bearly mentioned the protagonist.  I only saw like two times the protagonist was ever mentioned, and like one time you ever made a dialogue choice, and that was just simply to change your name.\n\nHeading over to the pricing, since this is a free-to-play game, you'll likely be hit by the pay-to-win very quickly, since each SSR+ where much stronger with better artwork. Each one has a unique way to enter the arena, some with a godly entrance, while others have a special AOE attack as they enter. Making me giggle and shout as I call my Mech to slam onto my opponents with an angelic form. Other than that, good luck even getting one because the SSR+ I'm talking about are the unique characters., You can tell that these characters are unique since each one glows with a golden aura, unlike the other regular SSRs. One way to get SSR+ is with Quarts, which can be obtained in-game (with a cooldown of 6 days per purchase) or with admin coin. You need 150 for the petty system to help you, and each one costs 300 coins, and each 300 coins costs 3$. We are talking about $450 just to get the character you want. This is without the promo or events and etc, etc. That's only mentioning the gotcha spect, their other purchases that can be made, but I find them simply stupid, like buying a JPG for your HQ that costs 3$. Utter bonkers. You can decide how to spend that hard-earned cash.\n\nLike I said, it ain't bad, it has potential. If you're here for the lovely art, then by all means. As it stands, I've been having a great time watching all the sprites go boom. That said, I don't recommend spending cash on the first few days unless you enjoy the story; otherwise, you'll just be wasting your cash since the gameplay gets boring quite quickly. I do see myself coming with hope and aeager to change my review once this game become more budget-friendly with better story and gameplay.\n\n$50 bucks would probably get you a better story and similar gameplay somehwere els,  even so, I do welcome you to try it since the first few hours are free and fun. Not worth the 450 tho.\n\nAs a recommendation to the dev(s), I do advise having the player be more related to the world before dropping lore of characters when I haven't even invested in the gameplay or the protagonist. Make the arena much larger, I can't see what's going on or how to strategies when theirs 3 trigger-happy throwing blinding light all over that painfully small map. And for crying out loud, can't we have our Mechs to be big? huge compared to the other units. kills the hype when I see my mech as short as my loly Magica girl!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gacha game with a honey moon phase and once thats over you pay to win",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Falling down the stairs is less painful than playing this crap",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't know wtf my team is doing, they don't rush B anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "no achievements or trading cards.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rank in Korea BROKEN FUCK",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It looks like a game but it's just a Skinner box with anime babes designed to separate you from as much money as possible.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "pretty good game but after losing an assr unit from a serverside problem and then the support not wanting give me back the unit its just a no.",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}