{
  "positive": [
    {
      "review": "love this game thank you devs for fixing the house owning to 400 grace its a lot of grace to keep our spots but at least I can grind npc's at 2 gold a pop and daily loving 5 grace to keep my house.... sorry npc's mama got to make rent to keep her house lol 😆 \n but wouldnt recommend they have now set building a home behind a pay wall a monthly subscription witch isnt fair..i get wanting the world to stay over build free but that is an easy fix like if afk for more then a month or 2 then pick up the building and stuff and store it like they did on the wipes but to make us monthly pay is just unfair you want money sell clothes animals aka a horse stuff like that building meterial ect not a home on a pass. i do love how pretty this game is fun and i enjoy the grind 100% but fix the housing.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "Fantastic game. \n\nPlayed the Alpha and now the 1.0 release. The alpha was great to see come out in stages and to be honest it wasn't long between core changes. Was also very pleasantly refreshing that we were kept up to date with why, how long and the impact changes will have. They've also been great with listening to feedback whilst keeping their own vision for the game in tact as opposed to just catering for whingey players.\n\nWe have about 60 of us currently playing in our Guild, loving it. We've built a city essentially. Pushing into the PvP zone now in groups, farming castles, hassling players and watching the PvP zone slowly take shape as players level. \n\nThe building aspect has been incredibly cool. Levelling has to be worked for which is great. None of this crap where you power level everything and it means nothing after 2 minutes. It needs to be planned and is rewarding.\n\nHave been very happy with the dev teams transparency since the start of their venture. They were very clear about their intentions...have the screenshots to prove it for anyone who can't read or just loves to complain. So suck that up.\n\nFantastic system in being able to own a plot of land without paying for it also. They've enabled a patch that allows you to purchase it with \"grace\" in game. Which can be earned by logging in each day or simply just buying it with in game gold earned through killing NPC's of all levels and trading. I'm sure people will still whinge, if so, uppercut yourself.\n\nOverall this game has been brilliant. It's sad to see mixed reviews with information people were provided early but refused to acknowledge. Whinging always seems easier. But 60 of us are in an happy, a lot of converted mindsets here to. Get in and play it...It's like $40. If you can't afford that but buy take out, Netflix, Skins...I think I know what the problem is.",
      "voted_up": true,
      "votes_helpful": 76
    },
    {
      "review": "this game is pretty much Ultima Online if the dust was blown off of it and given modernized graphics. the game certainly has potential for greatness.. ONLY if they refine the combat. the combat in this game seriously needs some attention, it could be more immersive and action packed. as someone who is heavily pvp oriented, this is a snore festival.  for now, i'll maintain a thumbs up review because i have no other complaints other than a bug here or there (normal for new mmos). don't listen to these babies crying about a monthly subscription, i guess they prefer games that struggle on income and then they wonder later why the game can't afford to pump out new content",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "Ok so is Pax Dei fun?\nWell it depends on the type of player you are.. if you enjoy a extremely grindy game that takes hundreds of hours to complete levels of crafting solo then you will love this game. You also have to level everything from weapons to each piece of armor you wear. The house building in the game is some of the best I have seen . The exploration in the game is amazing and there is no hand holding' you have to figure out where to find plants and what mobs drop certain items you need to craft with.\nThis game is a crafter - gathers dream. \nYour attack skills in the game are based on the type of weapons your using and each weapon gets 3 unique skills . Your armors get 4 utility skills based on the type of armor you wearing.\nThe housing in the game allows you one free Grace Plot that cost 400 grace every 30 days and does not require money monthly,.. its easy to get 400 grace. Everyday you login without premium you still get 10 grace per day and you can also farm humans for gold and convert gold to grace, for example... for 90 gold you get 30 grace. that takes about 1 hour to make depending on your gear. The combat in the game is simple yet works and can be improved. The enemies in the game are not the type you can one hit and they use defensive skills on there selves and there ally's. The game does have issues like trees growing in your base that they have yet to fix and items need to stack higher.\nI feel the game is well worth the $30 if you enjoy games that take time and patience to accomplish what you craft.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "One of the reasons I’m supporting this MMO is because it’s being built by a Western dev team that is actually transparent, communicates clearly, and genuinely listens to its players. That alone is rare in the MMO space right now.\r\n\r\nFrom the early stages to the full release, the developers have consistently explained their decisions, outlined timelines, and invited player input on future features. They’ve even opened up certain upcoming systems to community voting — something you almost never see. It shows they’re committed to guiding the game with a clear vision while still involving the player base in the process.\r\n\r\nPositives\r\nTransparent, honest communication\r\n\r\nThe devs openly discuss what they’re working on, what’s changing, and why.\r\nThis builds trust — and it’s one of the main reasons players like myself want to support them.\r\n\r\nCommunity involvement in decision-making\r\n\r\nThey let players vote on specific new features and systems.\r\nThis creates a sense of investment and long-term ownership from the community.\r\n\r\nStrong foundation for a long-lasting MMO\r\n\r\nThe core systems — building, crafting, progression, grouping, PvP and world structure — show solid vision and room to grow.\r\n\r\nWestern MMO with Western sensibilities\r\n\r\nNo predatory monetisation, no pay-to-win, no time-gated nonsense.\r\nInstead, you can work for what you want through gameplay, not credit cards.\r\n\r\nDevs who stick to their vision\r\n\r\nThey listen, but they don’t panic and change direction every time someone complains.\r\nThis is exactly how long-lasting MMOs stay coherent instead of becoming disconnected feature-bloat.\r\n\r\n Negatives (and how they can be fixed if players give them time)\r\n\r\n Some systems are still light or early-stage\r\n\r\nAreas like solo content, late-game loops or quality-of-life features could use more depth.\r\n\r\nHow devs can fix it:\r\nThey are already gathering player feedback and conducting votes on future features.\r\nIf players remain constructive instead of writing the game off, the devs have shown they will refine and expand those systems.\r\n\r\nGame can feel grindy to some players\r\n\r\nLevelling and progression actually require effort — which some love, and some don’t.\r\n\r\nSolution:\r\nThe devs are actively tuning XP curves, adding more ways to progress, and expanding PvE and gathering options.\r\nMore feedback means better balancing.\r\n\r\nNot all promised features are fully realised yet\r\n\r\nThis is normal for any MMO at 1.0 — but some players expect a complete, end-to-end experience on day one.\r\n\r\nSolution:\r\nTheir transparency helps here. They openly publish roadmaps and timelines, and they’ve honoured the majority of their early promises.\r\nGiving them space and time will likely result in the remaining systems being finished properly rather than rushed.\r\n\r\nSolo players may feel underpowered\r\n\r\nMMOs are naturally group-centric, but solo players still need meaningful options.\r\n\r\nSolution:\r\nThe dev team has already acknowledged this and is planning adjustments — more solo dungeons, crafting balance improvements, more accessible content, and clearer progression pathways.\r\n\r\nOverall\r\n\r\nThis MMO has launched with a strong foundation, a dev team that actually communicates, and a community that’s starting to shape the world alongside them.\r\n\r\nIs it perfect? No MMO is at 1.0.\r\n\r\nBut the difference here is the direction, the transparency, and the willingness to evolve with meaningful player input.\r\n\r\nIf players give the game — and the developers — a fair chance, it has the potential to grow into something genuinely special.\r\n\r\nSupporting Western MMO devs who aren’t afraid to be open, honest, and community-driven is how we finally get MMOs with long-term vision again.",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "Developer are acknowledging player feedback and making adjustments. Giving this a general recommendation for people who enjoy slower paced MMO's. \n\nThis is 100% a game you will want to play with friends. Solo life is challenging in the beginning and, as you can see by the reviews, a lot of players are turned off by that. This problem should resolve itself as the games economy establishes and more guilds are able to support new players better.",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "I love the challenge and grind... \n\nThat being said, I'm wasting my life away in this vast, beautiful world.\n\nWife said I have to stop playing and get a job.\n\nBut she made me a deal that if I can get 50 likes then, I can keep collecting unemployment and play for another 1000 hours.\n\nHelp an addict out?",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Love the crafting and gathering.....old school takes lots of time to level.......",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Glad I didn't listen to the review bomb that obviously happened. \n\nAs someone who didn't participate in Early Access, as someone who has purchased this game without bias from the Early Access review bomb that occurred, I definitely think the hours I've played so far in just this short time from release speaks for itself. It's like a grindy mmo valheim, in a way, sort of. \n\nPlayer run economy, PVP is a choice (you can go to the map for it anytime you want), skilling is a tough grind that keeps the dopamine flowing if you choose to do it all. and the community inside the game are all really helpful.\n\nIs there room to improve? Of course, I'd like to do things like be able to fish, or have a trade cart or something to walk around with trading to other regions. \n\nIs it worth the price? For me yes, it's 5 bucks a month to play basically (without it you're just skilling, not playing).\n\nIf you can't afford a 5 dollar subscription for an mmo, then I recommend focusing on your career IRL before you take a dive into something like this. This game is the bare minimum, with a lot of momentum to grow into something greater.",
      "voted_up": true,
      "votes_helpful": 35
    },
    {
      "review": "Its a great game,but it still has a few bugs and needs work.  If you don´t  minde that . Its great fun . You have to work for everything , which is great, everyone is working himself up the ladder.  No cheatintg.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Despite some bugs* the game is very fun and very social. Trade and teamwork are touted but dont let that fool you. Solo players exist here too. \r\n\r\n* The dev team is very active",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good adictivie game. Looking forward for upcoming features.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Didnt play before release so going into it i didnt know what to expect. So far really enjoy it. Great crafting. I the difficulty leveling as it makes it very rewarding. I see lots of potential for new things to be added.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game is a grinder's wonderland! The crafting system is intricate and sensible. Much like the serene and gratifying experience of gathering herbs in WOW, the music and various immersive sound effects make for a satisfying run every time I go out to gather. There is no limit to what types of mats I can gather or what crafts I level up so my gathering runs always stay fresh, chopping trees and picking berries and plants, hunting animals for skinning and meat or mining ores and gems..there's plenty of options to change it up each run to prevent burn out. Then building the various refining and crafting stations awaits! This too is full of detail and is quite fun. There is a recipe and ingredients interface which is easy to use and a great tool for checking where I'm at with skillups, mats and even what type of station i will need to use to craft any particular item.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "good game..recent grace plot changes were needed. the game needs work in several aspects (mainly combat system and POIs/Dungeons) combat is not bad but needs tweaking.\nIt's a good game for 30 bucks. territory control coming soon too. most of the negative reviews are people unhappy about the plot subs right after launch which are gone now with grace plots.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love the grind and base/castle building! Combat is a bit janky, but they release updates weekly, so it's only a matter of time before it's fixed.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is still in beta and needs so many improvements but it's a great MMO for building lovers. Solid alternative to sandbox games like Valheim and Enshrouded in terms of base building. Thanks to recently introduced grace system it's now possible to play without a subscription.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good looking game for those who are not in rush and just wana do some material gathering and building",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I was impressed back in Alpha, and the full release has only reinforced how special this game is. The early stages offered a steady flow of meaningful updates, and the developers consistently explained what they were doing, why it mattered, and how long things would take. That level of communication hasn’t faded—it’s clear they genuinely listen to feedback while still steering the game with a confident, cohesive vision.\n\nBuilding is one of the game’s strongest features. Creating homes, settlements, and full structures feels genuinely rewarding, and progression has real weight to it. You can’t just sprint through levels and make everything meaningless; you need to plan, commit, and earn your way forward — and that sense of achievement is fantastic.\n\nThe team’s transparency has been consistent since day one. Their goals were laid out clearly, and the game has developed exactly along those lines. It’s refreshing to see that kind of honesty and follow-through.\n\nThe land-ownership system is another thoughtful design choice. Being able to claim a plot without paying real money — instead using “grace” earned through daily logins or in-game gold — keeps things fair, accessible, and aligned with the game’s core philosophy.\n\nAll in all, Pax Dei has been outstanding. Even with mixed reviews floating around, the actual experience has been deep, polished, and genuinely enjoyable. Don’t listen to the nay-sayers — they’re probably just being petulant children. For the price, it’s absolutely worth jumping in; there’s a rich, beautifully crafted world waiting to be explored.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Don't know what all the negative reviews are about. You can literally buy plots with grace now, and it is not hard to earn enough grace for it.  Other than that, this game is something you invest time in, for the exchange of piece of mind and relaxation. I literally login just to relax and it is very effective at it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game is fun if u find someone who has already sunk hundreds of hours into the game and convince them to let you live on their plot so you dont have to pay a monthly subscription to a game u already fucking bought. im in too deep. someone help.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is really good, but this whole plot system isn’t very appealing. You already pay a relatively high amount (especially in countries like Brazil, where the game costs over 100 reais), and then being forced to play like a maniac or spend real money just to keep your constructions is an extremely negative point for me. I’m an adult — I need to work, study, and keep my life in order. I don’t have the time to make the game into a profession, but I also don’t want to feel like I wasted the money I spent buying it.\n\nAnother negative point for me is the lack of translation and optimization. The game is huge and visually detailed, which makes it hard for an average PC to handle the experience, and there are very few optimization or graphic customization options. As for the translation, it doesn’t affect me much since I can read and write in English.\n\nThe positive aspects are the interactive gameplay, the insane level of freedom — you can choose your own path —, the massive map, and the overall atmosphere. The only real flaw is this mercenary approach of trying to force players to farm or spend money. The game is good! It doesn’t need a system that forces players to play! A few polish and optimization updates would make it perfect!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Played around 113 hours on another platform before purchasing on Steam (for the second time), one which has a Pass for Games.\n\nA visually stunning game when it comes to the scenery, especially if you're looking down onto the fantastic constructions others have done on their plots or as a clan.\nThe music and sounds are great though I've nearly been driven insane by several foxes screaming and not being able to find them to \"deal with it\". Several times I have fallen asleep with the music playing and the furnaces roaring, it can be quite peaceful.\n\nAs a solo player it's a bit of a slog but patience and perseverance gets you through. I've had several \"why am I bothering?\" moments but got rid of those thoughts and carried on.\n\nYes, the grind is real and it may sometimes feel like a lot of work but once you get going with building and crafting it really makes up for it. I loathe the hours and days I've spent running around looking for blueberries, mining copper and tin to eventually smelt bronze ingots, knowing full well I'm following someone else doing exactly the same thing moments before but when I get started with building or starting to craft the items needed for equipment, tools etc. there's a sense of satisfaction.\n\nIt's a bit laggy from time to time, some rubberbanding and I've experienced a crash to desktop every time I've played but usually around the 3 hour marker but that hasn't put me off, this could be a me issue though and I have not checked (probably wont either.)\n\nNow that you can continue your plot upkeep going with Grace now, which you get daily by logging in and can use in game gold to purchase more, there's no reason to pay for the subscription if you're happy with a small standard plot and happy to go around taking down the NPCs or crafting a bunch to get a gold income.\n\nOverall - If you're happy with the grind and willing to put in the work then go for it but don't feel disheartened when it does start to feel like a chore, you'll get over it.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A game I truly enjoy and for me it's something for a long run, I also love the fact that it keeps getting better and better - slowly, yes, but it's a game for years not just for few weeks. I come from 00's era when most of MMORPGs had ~10 EUR subscriptions and I don't mind paying for it if it keeps the game afloat. The biggest downsides for me currently are that it's missing weather system, mounts and some sort of farming features. On the plus side the building system allows you pretty much build whatever you want, the social aspect is nice with the player driven markets, the visuals are jawdropping and atmosphere is amazing. Combat is enough for me. Not too complicated and I'm not a big PVP fan, but it's getting an update soon that improves it much further. I have played Roma Victor, a Tale in the Desert, Life is Feudal, Wurm online, Conan Exiles, Dune, Enshrouded etc - all max 1-2 months. I played 4 months of Pax Dei during EA and now played almost daily since release. It's not for the people who expect to get everything done within few weeks and it is grindy - for a reason. It's different and not for everyone which might be a reason why I like it...",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "love the game just hope it does updates a little quicker,",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pax Dei, I have been playing this game nonstop for a couple to a few hours a day. I cannot speak for the end game or pvp aspect of it; however, this game is a dream come true for someone who likes to craft stuff and gather. \n\nThe game has a variety of stuff to do, just focus on some not all. \n\nI can also say that I have enjoyed my experience with going out and gathering, but, do bare in mind that this is a social sandbox MMO, it is somewhat punishing to go about it solo.. \n\nI do feel like this game has a strong foundation, I know for a fact that it is going to only improve as I am also apart of the discord and I see the changes that they are putting out.. Patches are coming regularly.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "PAX DEI is one of those games where the grind is the experience—and honestly, that’s what makes it so satisfying. Everything takes time, but because of that, every piece of gear you craft or structure you build genuinely feels earned. It’s got that slow-burn progression that rewards patience, and when things finally come together, it’s incredibly rewarding.\n\nThat said, the game really shines when you’re playing with friends. Having a group to motivate each other through the longer tasks makes the whole process way more fun. Still, it’s totally playable solo as long as you go in knowing that things will take a while. Turn on some tunes, throw on an audiobook, or multitask with some studying while you farm materials—it pairs surprisingly well with chill background activities.\n\nOverall, PAX DEI is a solid, immersive experience with a grind that actually feels worth it. Would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The building system is unmatched and a player created environment is worth seeing.\n\nThe crafting system is a bit casual unfriendly and traditional MMO fans may feel like there’s not nearly enough to do but others enjoy the open-ended sandbox quality of the game in its current state.\n\nMany updates are planned and it’s still early in what could be a game that maintains a dedicated fan base.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pax Dei has a lot of potential but there is no doubt that the Developers have to do a lot more work until the game reaches this potential. On the positive side: a very beautiful landscape, different biomes and a complex crafting system. The community is active and alive. \r\n\r\nThere are some NPCs and mobs to fight and the fighting system is ok, but not very sophisticated. It can certainly be improved to make it more interesting. There are PVE dungeons that offer items for higher tier gear and some gold. They are ok, but again not too exiting. There is basic PVP and the devs are working on more, but as I am not a PVP player its not something I am interested in. \r\nThe building system works. Sadly stone comes very early and thus there are a lot of ugly stone block buildings in game. But its possible to build nicer builds with higher skills and some time.  \r\n\r\nThe crafting is complex and most recipes need items from other crafts. It is a lot of grinding to gather the required resources and to craft. If you enjoy grinding, you will like this game. Joining a clan is highly recommended to make it more efficient.  \r\n\r\nTo conclude... there is a lot of potential in this game, but it feels still more like an early access game. If you don't mind its worth giving it a try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a very good Sandbox MMORPG, this is not a theme park MMO like Wow, it's more along the lines of Ultima Online.\r\n\r\nVery enjoyable and it's got a very good foundation.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Open world sandbox MMO with building and crafting. Really good graphics and atmosphere, and a good range from cozy village building, to world exploration, to running dungeons with friends. Already a lot of fun, and will only get better once the economy and community settles and more clans make it easier to invite new members into their folds.\n\nDevelopers listen to feedback and exciting to see how the game develops.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "great scenery, but the world feels empty atm. some mechanics are not in the game yet. the building your home part is great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great building/crafting game. Combat is much improved.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. The world is very immersive, the building system is great, and the combat system has made huge improvements. Looking forward to the Battle for Lyonesse update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game with a lot of potential to become a really addictive.\r\nCurrently skeptical about how the game will evolve to keep its playerbase with its current focus.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Before buying the game:\r\nThis is my review after 23 hours of gameplay. (Don’t pay too much attention to the negative comments about the subscription.) Being 100% honest and critical, here’s what I’ve noticed so far:\r\n\r\nThe game is fun. If you’re a player like me who enjoys sandbox-style games, this one’s for you. The leveling system is simple and interesting, which makes it enjoyable. The community is friendly and chill. The clan system is quite interesting (I’ve been playing solo the whole time, but I’ve seen a lot of unity and cooperation within clans).\r\n\r\nLike any game, it has its problems. The performance isn’t ideal, but if you have a mid-to-high-end PC, you should be able to run it just fine. I’m a very visual person — I enjoy graphics and detail — and visually the game has some bugs and rendering issues. Nothing game-breaking, but if you’re like me, they might bother you from time to time.\r\n\r\nSensitive topic:\r\nSubscription. Personally, I don’t see it as a problem. Every game needs to be self-sustaining. The cheapest subscription that includes a plot costs around $6 — probably what you’d spend on a couple of sodas and a snack. Most negative comments about it come from people who want a completely free game with full access, and that’s simply not sustainable unless the game includes heavy monetization. I much prefer this system over aggressive gacha mechanics or battle passes.\r\n\r\nI don’t consider it Pay-to-Win. Yes, you do gain XP faster if you pay, but this isn’t a competitive game, so there’s no real advantage over other players. And sure, it’s not ideal that if you stop paying, you lose your constructions — but it’s also a way to keep the world clean from abandoned plots (think of it as a wipe). You can always come back later and build something new.\r\n\r\nSome ping problems but nothing important.\r\n\r\nConclusion:\r\nTotally worth it — and very much so. The devs are actively releasing updates, and as long as the game continues to receive maintenance, it will keep being worth your time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Do you like grinding, crafting, building, and beautiful open world exploration? This sandbox MMO is pretty fun, if you know what you're getting into. That said, know that there's currently little in-game lore, combat could be improved, and one key aspect of the game - owning and building on a plot of land - is gatekeeped by either a paid subscription or by joining a group with their own property. Knowing that, I still recommend it overall",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I recommend this game for several reasons, especially since it has enormous potential, particularly if you enjoy cozy, simulation, and sandbox games. It has incredibly beautiful graphics, and you can see other players and build things together with them.\n\nIn the five hours I've played, I've already been able to build a small house and set up basic crafting equipment, as well as farm some materials. It's so relaxing, I love it.\n\nNow for the big \"no-no\": In some areas, it feels empty, with few wild animals. While traveling, sometimes you can see a seam where the map connects. (map/biome with map/biome kinda situation)\n\nSometimes trees and animals float, today for example, I encountered an invincible wild boar. lol\n\nBut the worst thing of all is the monetization! A game that consists of crafting and building should include one plot of land in the purchase price! Yes, it should be automatically deleted after one month of inactivity—problem solved. My suggestion is that you should only have to pay a subscription for two or more plots; anything else is just rip-off.\n\nSuggestion for the future, if a developer happens to read this: a donkey or horse to be able to move around a little better and faster. It would also be cool to have a small village with friendly NPCs for trading or with one or two quests. I'm thinking of people who work shifts, like me, when I am awake at 2 or 3 a.m., almost no one ist online. \n\nThank you and have a nice day!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very well developed. The attention to detail is impeccable. AND it looks great even on low graphics settings.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful game I fell in love with the first time I logged in <3\n\nI really enjoy the slow paced gameplay and the feeling you get when you explore this beautiful world.\n\nIf you like exploring, gathering, crafting and building this game is absolutely fantastic and you should give it a try.\n\nThere's lot more to come and be implemented and I can't wait to see how Pax Dei is gonna develope over the next months/years :).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is being review bombed with negative reviews because some people are salty about having to pay for land plots now. Paid services is what allows these companies to make the games you want without loading them with micro transactions. You should be thankful for that. Also, forcing players to pay 4 dollars for a plot reduces the server clutter where everyone just drops trash around the map and blocks resource spawns. \n\nOtherwise, the game is a 7/10. It's roughly similar to all survival craft except it actually has more content. You actually benefit from gaining skills and crafting items. It could be more in depth, but it's the most RPG a survival craft I have played. Decent graphics, a good balance between grinding and it feels like the work you do put in will always benefit you since everything you do levels a skill, and skills lets you craft items that you can sell. I hope with the monthly subscription they continue to build onto the game and it becomes a solid MMO. \n\nPros: you don't have to micro manage things like food and water. Their benefits are all for combat. \n\nCons: not many players so far. And maybe more early game content with more guides.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So far, 5 hours in with some pre-release game play. \nBetter with friends is an understatement. You can solo, it is just going to take a lot longer to get anywhere.\n\nReminds me of Valheim, just with very pretty graphics. It is released, but as all new releases things are still being ironed out. \n\nIs it fun, yes, it is relaxing, yes, was it worth paying for - time will tell - so far no regrets. (I also purchased the monthly pass for my own plot of land)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun sandbox MMO ned friends to play as solo is a grind but doable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its  grind but worth it! Its got it all...npcs, boars and bears Oh My!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Overall it is an awesome game that you will get hundreds if not thousands of hours into if you hate yourself and love gathering endless materials to craft.  The crafting systems are deeper than nearly any other game I have ever played and on top of that it is an mmo and I can play with my friends!!!!  That is a huge win! The building systems are great and the graphics are beautiful.  Lets dive deeper though.. \n\nIn Pax Dei, there are no quests, at all, so if you hate quests like I do, you will be happy.  This is a sandbox player driven economy mmo. Since I started playing the game it has gotten two solid patches. \n\nI could go on for a long time about the positives but lets talk about the negatives because there are many as well.  \n- No mounts\n- No backpack systems at all, your inventory will always be full and you will always be annoyed about it. \n- Certain crafting skill trees are incomplete.  \n- Carpentry soft caps at level 30 but you can get it to 40 there are just no more things to learn.  \n- Jewelcrafting provides ZERO benefit to your character. \n- Bows are only useful for killing deer and rabbits or fast moving animals.  They have no abilities or combat uses as of this time. \n- Balancing issues are everywhere and are extremely easy to fix the devs are just incompetent and refuse to patch them.  For example, white and red grapes provide 40+ stamina bonus (WHICH IS HUGE), cooking doesnt get better than that until level 20 (which takes a very long time btw) and it is barely better at that point.  Picking up white and red grapes is ez, takes no time and you get next to endless stamina.  This is one of MANY balancing problems.  I could write a LOTR novel on how many balancing issues there are that are just ignored. \n- Instead of finishing important elements in the game like I mentioned above, the devs are pushing out a feudal system.   Their priority is dogsht and I am calling it now, it will be what kills this game if they dont turn things around. \n- There are no automated systems available for gathering basic materials like gneiss (stone).  They need to pull some cards out of the myth of empires playbook and allow players to hire npcs to run makeshift mines so that the player can get resources without spending 1 billion hours on gathering the basic stuff. \n- Some skills are infinitely harder to level up.  Blacksmithing for example takes FOREVER, to max blacksmithing you are legitamitally looking at 700 hours of playtime but other things like carpentry you can get to end game in 1 evening.  Make that make sense.\n- THE SERVERS SUCK ASSSSSSSSSSS    you will be fighting a boar and it WILL teleport on your face.  We call them in game, Mage Boars (like the wow mage blink ability) because you WILL get jumpscared by blinking boars or other animals just that appear in front of you.    [EDIT: THIS HAS GREATLY IMPROVED AND MOSTLY BEEN PATCHED OUT]\n\nHonestly I could go on, there is a LOT to be desired in PD BUT even so the game is still very very fun and I am really looking forward to content updates and I pray the devs can learn to focus on what is important and not on stupid sht like pvp content that next to nobody partakes in. \n\nAlso, many of the other reviews are talking about subscriptions, they are no longer required to own a plot.  You can earn a plot in game, for free. \n\nHope this helps you, I highly recommend you give the game a shot even with all the negatives if you want a really unique mmo experience. \n\nThanks, \n~Ox",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing since before the 1.0 release. Major improvements in the existing systems since the early days, but still lacking quite a few things. I'd like to see an inventory sort function in place, an update to further refine the combat system so that it feels impactful, more additions to how the player interacts with the world--i'm not an RP guy but a lot of people want that and some form of farming. \r\n\r\nI know mounts are on the horizon so i'm looking forward to that--would love to see elks, bear and horses--none of the high fantasy stuff like dragons.\r\n\r\nGame also needs some performance tweaks. Random frame drops, the light blinding you when your character loads into the game while the engine adjusts itself and enemies teleporting/server latency issues are everywhere.\r\n\r\nThe pros like the building system, crafting and environment outweigh the negatives i mentioned above for me so i recommend the game, but we're at a precipice with the game where the improvements above are implemented in a timely manner or a massive player drop-off is going to happen--meaning no funds.\r\n\r\nRight now, they're focusing on feudal shrines and houses, which are pvp focused systems that will be enhancing that area of the game--i'm worried that getting these systems implemented in a working state within a reasonable time-frame, with the combat in it's current state, is not going to be ideal. I think they can do it, but it's going to be tough with the recent layoffs that happened--meaning some other areas of the game are going to be on the back burner. I'll update this review after some more patches have come out for those who are still waiting or sitting on the fence about getting involved with the game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Got to give my thumbs up! \nPlayed it in EA, at some point it became too grindy. Now its 1.0, so no wipes anymore.\n\n+ best building system I had in a game (played many builders)\n+ one hell of a grind, but it feels awesome to craft new gear and use it\n+ the music !\n\nFeels like life is feudal meets medieval dynasty, best medieval game to get lost in.\nPeople complain too much about the subscription, well even if u like to build a nice house one building plot will be enough, roughly 7 bucks a month! \nIf u cant handle 7 bucks a month better stick to f2p games, thats a price affordable for everyone, no excuses.\n\nCheers",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. The graphics and environments are fantastic. The combat system is nice. I've always wanted a game where I can build my base, explore dungeons, gather resources, level up, upgrade my equipment, and relax at the same time. This game offers me everything I could wish for. Even it's more fun when you have some friends with you.\n\nThere is different type of weapons and each of them has different clasess. Even same item with different skill inside it.\nYou have to get to certain level to use next tier of weapon. You can craft whatever you need or buy from others.\nI love it. I would highly reccomend this game to play. I barely reccomend games to people but this one is i don't know i have no words.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The game is jenky, combat is meh, Unreal built the world so not sure what the devs did for so long, feels like a game built in the early 2000s.  the game def needs help and more time, hopefully they are serious about this game and will fix everything.  That being said, I am a farmer, i love exploring and farming and this game delivers on both, the community on my server is AMAZING!! and that is the reason I still play and will continue to play. The founders pack issue with subs is driving away tons of people, you may need to think about spending time and money on this game because it may not be here very long IMO",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "the main focus of the game is being able to level your skills in order to craft your base and item needed throughout the game.  As the game currently is, that crafting ability is bugged and often times I cannot play because the game pauses in the middle of the crafting process over and over again until I just quit.  The premise of the game is nice.  The dungeon are meh.  There is no difference.  Tank grabs them and healer heals, dps just spams attacks.  If you want a dps can kick.  There are no mechanics at all other than just \"hulk smash\" mentality.  It is a beautiful game.  Also they have yet to fix the issue for putting down 4 plots together and getting a hole in the middle that you have to build around.  This has been present prior to release and hasn't been addressed.  I have bought all three founders packs, but I will not subscribe to this game if the crafting bugs are not corrected.  That tells me that there will be little thought for this game in the future if they cannot allocate resources to the primary focus of this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "this game is everything you want in an MMO RPG survival builder, open world game. It has everything, and what they don't have, they're adding. This has been a delight to get sucked into and i'll be playing it for a while to come!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I am gaming from from like 1985, this is one of, if not the BEST game i ever played. So far.\r\nDeep, relaxing, social, creative, and could add 1000 more words to it, and somehow when I log in and feel the game, wouldn't be enough words to describe it.\r\nBuy it and try it out, if you don't feel the vibe, it doesn't mean game is not for you, it means you are not for the game , YET ! Save it and play it later on.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very addictive game, is not regualr mmo just grind and fight. It more like social, roleplay, live, build. Looking forward for new updates and stuff.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Game is fun. A lot of the negative reviews are people salty about the early access plots, or people that don't like this niche of games complaining about the niche. This type of game is not for everyone, but try to separate out people who have legitimate fair criticism of the game with people who just bash the game because they don't like these types of games in general and never will.\r\n\r\nIf you like open world crafting type games it is fun. Just don't expect to be able to do every crafting skill in any reasonable amount of time, it is designed to be grindy so that you specialize and interact with other players. The community is also very friendly",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Beautiful game. Buggy, yes but still quite fun. Social Sandbox. Build a small cottage or a massive castle. SUBSCRIPTION IS NOT REQ TO PLAY!!!! Team up with friends or do a massive clan raid for resources. craft gather build. I like that there are no endless fetch quests or endless go kill 15 wolf quests. do what you want when you want how you want. NO microtransactions WOOHOO!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Give it a chance.  It might seem slow at first but it's all in how you approach the game.  Don't buy into the idea that it's just sand box grind game.  Go out and find mobs to kill and focus only on your area of expertise (don't try to level up skills to wide).  Rely on others to help you gain the gear and supplies you don't have crafting skill for.  The people in this game are super chill and the community is really great.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I'm absolutely falling in love with this game.  It returns you to the 'good ole days' of working hard for what you want, and being super proud of what you've built/accomplished through sweat and tears.  The reviews on here that are whining about the \"grind\" (more appropriately known as \"game play\") are the generation of gamers that want everything easy, want everything given to them, and expect to be granted everything everyone else has/does.\r\n\r\nThe game world is truly open and so is the gameplay.  You can go in any direction and do anything.  You will need to scale up to do the things you want, but generally you get to choose your character development.  You will need a little bit of most skills, but only need to focus heavily on the skills that make your character \"you\".\r\n\r\nWaaaaahhhhh, there's a $5 subscription to be able to have my own home plot, waaaaaah.  These whines are from the same aforementioned gamers that want everything for free.  I happily subscribed on day 3, not only to have my plot, but to financially support the additions the devs are making to this game.  \"Back in my day\", we paid $15 monthly just to play any MMO!  Couldn't even get into a game without paying.  Pax Dei brilliantly makes gameplay free so new players can try it out and explore the land.  You could play the entire game without a subscription, mooching off of the crafting stations of others, if you so desired, but life would be much harder.... jut like in real life, huh....\r\n\r\nI love building bases where other players can come and see what I've built.  That part of this game appealed to me the most.  I've made a pretty impressive inn, IMHO, and I plan to make it the coolest/prettiest/funnest in the region.  \r\n\r\nI have had immense amounts of fun in this game so far, and I encourage everyone to try it out.  It is early access, so take your time and work with what's already in the game... building is solid for sure.  The game is not meant to be rushed to the end game; it's designed for just enjoying.  More great releases and features are yet to come, and I'll be thrilled with each release, of that I'm sure.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Too early to tell, but the start is certainly immersive. The world is stunning. Reminds me a bit of Valheim and Ultima Online.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is not a game to play solo. You can, but it's really not intended to be. \nIt's a really pretty sandbox with a bunch of grindy mechanics, that aim to put value on equipment and \"stuff\" in general. The devs lean hard into making you work for levels in skills, crafting, gathering and in getting resources needed for crafting equipment, to play the more \"conventionally fun bits\".\nIf you have a guild/clan that helps each other out in these endeavours, this can be quite enjoyable and rewarding and it provides a gameplay experience and loop that reminds me a lot of the feeling I had playing old, pre-WoW MMORPGs. If you attempt doing any of this on your own, you will most likely quit and think this game is jank crap. This is an easy skip if you don't meet the game where it wants you to meet it. But if you do, it's a lot better than the mixed reviews might make you think. \nThis clearly isn't a game for everyone. Streamlining of modern gaming has made games like this nearly extinct. Especially on this scale. The game asks a lot of you and isn't afraid to implement harsh mechanics that many gamers nowadays consider bad game design. Many gamers nowadays also think Fortnite is the shit and haven't once played a videogame with good dialogue in it. It's an acquired taste, like root beer or Dr. pepper. At first you might think, how can anyone drink this crap? And if you keep on drinking despite yourself, you might lose yourself in this new flavour and all those other sugary delights you have access to all of a sudden seem bland and boring. \nIn short: If you are interested in this game, give it some time and try to get into a clan early to collaborate with other people. That's where the fun lies. And you don't get that a lot in modern video games anymore. Cause it takes effort and you have to deal with people. Which is as much intimidating as it is rewarding for many. Those social pains were streamlined out of modern MMO's that are just glorified LFG simulators. \nThis game is easy to dismiss. But if you stick with it and meet it where it's at, you might end up being very surprised about the experience this videogame can provide.  \nPS.: Game is on Xbox Game pass if you want to try it out before you buy and while they want your money for plots of land to call your own, you can sustain one plot via in-game currency. So you can play this game fine without having to pay for a monthly sub.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "SO.......... This is a VERY Grindy game..... like dang ... lol HOWEVER! I really do enjoy it . yes i have cut more wood and mined more mines then I feel like in any of the other survival game.... lol but there is real potential in this game!!!! I really LOVE Visual parts of the game! its so pretty. I love that each thing you do has its own XP . so like wood cutting gets xp for just that. if i want to be a Black Smith then the more i work on it the better i am. however on the professions side of things they really need to work on the success rates of crafting things... It really is very upsetting to have crafts that you worked hard to get the mats for to fail 90% of the time when its moderate to easy to craft it... (I think they already are fixing that.)   I HATE that water uses stamina and then kills you if you swim in it... its so pretty and water is always fun to play in or run to  ,, the Map is really BIG... and again SOOOOO PRETTY!!!  BUT.... because of that we really really need Mounts.... bad.. it sucks to run FOREVER  to then run FOREVER to try to get back to your base.. i dont like that I spend hrs just walking to get some place.... they have a teleport syestem but really mounts ( PLZ with like a wagon) would be great cuz you still get to explore and load up! also boats would be so sick for the rivers and fishing lol .... the building is okay my wife really likes it and she is the builder so ya..  \r\nthe people so far in Pax Dei has been great! I think there is a great community and they have been really friendly ...  OOOO also I feel like they should add in loot chests or some thing to find in the wild or in caves or bad dude camps... it really does make you feel good when you die 5 times with your team to try to clear a camp and you Finally clear it ..... wait .. there is nothing .. THAT was a real bummer .. i hear they have loot in the bigger dungeons , but I think ( just my thoughts) that having loot for beginners gets them pumped to keep trying to get the higher stuff... I feel like it takes way to long to grind out the xp and gear to get up to the high stuff and live... to not give us things to do in the lower areas... im 84 hrs into the game and just in the first Iron gear and get my butt KICKED if I go outside a city zone thing.... unless there is like 6 of you and you still get kicked a little ... \r\nREALLY tho this game is going to kill it if they add some things and keep making it better .. even now I def think you should get it and play for sure!!! Im NOT a smart guy... (as you can tell from this review lol ) but I love gaming and have played many of this style and for sure think you will love it if you like the survival grind  type of gaming !  IF anything i hope this game is another step in the right direction to making the perfect game :) good luck out there and have fun!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I see a lot of boys all saying something down the lines of \n\n\"I really want to like this game but [xyz].\"\n\nAnyway, the game is fun. Strong rewards systems and crafting and gathering for hours. Easy game easy life.\n\nDefinitely a lot of early bugs that aren't game breaking\nGame is definitely a work in progress.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The friendly community and slower pace allows me to chill and relax while I play. This game reminds me of early Ultima Online, before all the expansions. The crafting system reminds me of Everquest because of the items you need from other professions.\r\nI can't overstate how much I love this game so far.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If your into survival and do everything from scratch this is game for you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely beautiful brand new game, learn and raise your skills by harvesting resources and crafting everything you use in the game. Build your own home and explore more dangerous regions.  Doesn't have questing or mounts yet; but, I'm still loving this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Really cool game. Slight grind, but what game isn't these days.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game gives me that feeling of old school MMO's with new age graphics, fun progression with building & crafting, and encouraging positive player interaction and cooperation.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "im ngl im enjoying the grind so far... helped a player with a good set of useful starting gear after being aided by someone else on my first day to having a semi thriving location that im now hosting my own start faction, its a small community but the fact i dont rate games to much or leave feedback this says... meh at best but trust its a decent game IMO 7/10 maybe a 8,5",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game. Love the world and crazy base building. It has a Holy Trinity Tank, Healers, and DPS. Lots of Alblies  from different gear you wear. Everything is player made in the World. Game is pretty sick :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I recomend to play it and find a community in game to join and work together with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOADS OF IMMERSIVE FARMING +\r\n\r\nFUN WITH GROUPS, LOADS LOADS LOADS OF EXPLORING",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have high hopes for this game; perhaps too high.\n** Update ** I've been playing Pax Dei for about 5 days now (about 9 hours in game time from off and on through the day because that's about all i can stand). I still can't make a better weapon, tools, clothing, or armor. Really feels like a second job. No loot yet, have not seen any mobs other than deer and boars (wild pigs). I also have not seen very many other people running around looking successful. lots of nice-looking homes in the world; with not a lot in them. This game feels like it is in Alpha and my hopes for this game have diminished drastically in the last 8 hours. \nIf you like endlessly farming for tin, copper, iron, and trees among other things i am sure that will be needed for steady progression; then this is for you.\nWhile this game has immensely slow progression, it is fun (I don't mind the punishment; even though  I do not quite know what I am being punished for.) \nAlso something worth noting, I have not experienced any bugs yet which speaks volumes in my opinion. I still recommend this game; with caution.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful, just simply beautiful. Grindy but a ton of fun if you're into that sort of game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like a combination of SWG, Runescape, and a few others. Hope it keeps getting better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This a wonderful where you can decide what you will do when your in this world.  You can socialize with others or keep to yourself until you ready to venture out and seek help from others.   I am learning as I go and its fun to make discoveries through trade or competition. You should give this game  a try,   I think you might be suprised by what you find.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like crafting, building things this game is for you! But note it is a running simulation. So much running. Also it makes me sad they promised horses and farming during testing but we still don’t see them in live.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "New Review:\nAfter giving it a few more hours i must say its a GRINDFEST really.. you grind yourselve down to the bones. But graphics is nice, and overall. It has something. Its far from perfect, but it does its core quite well. For now i switch to recommended. Not for 30€ as there is the need for a monthly sub if u wana hold your house, but if u can get it for 20€ or less its ok.\n\n\nOld review below: \nTheoretically, it's a nice game with pretty graphics and good ideas, but the grind is way too much. Two hours just to farm the foundation for a building is something that someone with a job and family has to think twice about. The skill progression system is also extremely grind-heavy. It's basically like Ultima Online – you need a lot of time to grind your way into it. Added to this is the current token system for your building. You work hard for a piece of land, but then you have to maintain it every month with tokens (via subscription) or - from the next patch on also with grace.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not bad base building and PvP still yet to discover. Not expensive and worth a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pax Dei is at its best when played with friends: building together, sharing resources, organizing runs, and watching your settlement grow as a group is genuinely fantastic. The social side gives the world real life and creates memorable moments.\r\nThat said, the crafting progression needs serious balancing. Too much leveling is tied to repetitive, brain-numbing farming rather than meaningful choices or skill expression. It works… but it could be so much better.\r\nContent is also still on the light side, and players looking for long-term goals might run out of things to chase. But the foundation is strong, the world is beautiful, and the team seems set on expanding it. If you enjoy cooperative sandbox play and don’t mind a game that’s still growing into its full potential, Pax Dei is absolutely worth a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game visuals are beautiful and the sounds are amazing, I had more fun in the early access than when it came out live, having to pay for a sub after paying for the   founders platinum edition just doesnt feel right...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone who has had the game since EA and only put 40 something hours in, I was not overly pleased with how the game was. I did wanted to love it, but it was not fully allowing that. I enjoyed the idea of it, and overall it could of been fun, but it was way more grind/lack of information than fun back then. I am not against the grind, I just felt that EA was very clunky and hard to get into.\n\nNow, since 1.0, I gave it another try. I was pleasantly surprised with the new starting features, and the overall introduction to the game. As I slowly progressed, I found myself finding the grind much easier/funner and more bearable compared to EA. I found the crafting WAY more satisfying, and the game in general a much better experience. It is not going to be for everyone, especially many of us solos, but it scratches that itch that only true progress in a game can provide. I found myself getting pretty excited over the new gear crafting, seeing the new items, stats, etc. Also, when leveling professions up and you get the pop up for new items discovered, that little hit of dopamine is nice, haha. I typically toss on an audio book and chill while crafting, gathering, building, and exploring.\n\nSo, with that said. Is the game perfect? No. Far from it. It still needs work, it still needs polish, and it still needs features, but in its current state, I do find it enjoyable in areas. I am excited to see where they can take this as I feel it has great potential. I am really looking forward to features like farming, animal husbandry, being able to break down unused items, potential mounts, and such. There is a lot about the game I do not know and I mean A LOT, but it has been a fun experience since 1.0.\n\nSo, if you want a game that, despite being in 1.0 needs work, a bit more polish, but a game that looks beautiful, embraces the slow and steady, and leans fully into the medieval theme in all things, then give this a go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistic game with deep crafting system, good end game and pvp, fun to invest in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not perfect, but the devs are constantly improving the game and it has my support.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I enjoy a relaxing game with crafting and building so this has been ideal for me.  I do wish it was easier to put plots down as far as getting a birds eye view during placement to get the plot layout you want.  Other than that this game is a nice way to spend a few hours at a time and meet friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I definitely have mixed feelings about this game. I’ve played a lot of hours in it since Verse 1 and still feel like they need to fix a lot. I understand the pay system, it’s really not that bad all things considered. If you don’t want to build it’s only like $3 a month… that’s like a cup of black coffee 😂. The gameplay isn’t that bad, I’ve definitely played worse. It’s pretty easy to figure out and play the game. The part that is tough for a lot of people is the grind. If you like games where it takes a long time to master anything then this is the game for you. This is a heavy grind, that will take you months to get anything to mastery. If you plan to go solo it might even take you a year. From my experience the thing that makes the game good is the community. We are all in this together and most people are willing to help you out. If you can get into a bigger clan your life will be easier in the game and you will enjoy your grind a lot more. I’ve spent a lot of time and money on this game, and I can tell you if you don’t like grindy games, don’t play this one. If you like to mindlessly chop wood or mine minerals this game might be for you. The PvP is mediocre but again the community is what makes it fun. I would still recommend the game but be warned of the grind and the rigorousness of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the game outside of steam before for a decent amount of hours. The game is niche in its audience. It is really focussed on the civilization / town development and is best enjoyed in a group. Visuals are arguably best in genre, sound design is excellent, building is top notch, and social dynamics are excellent.\n\nCombat, while having improved, is lacking still. However, the developers appear to be live to the issues and are gradually improving it.\n\nPerformance wise, the game has hugely improved. I play on a 3070 and get a solid 80-90 fps on mid/high settings.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean... It's alright.\r\n\r\nNo but actually, this game is a drug that I can't put down. Very fun, very grindy. If you've tried games like Valheim it's like a multiplayer HD version of that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Interesting concept, seemingly easy start turning into a grinding meta. Very far from the endgame I can't tell too much, though. Awesome visuals, rather simple combat, bugs here and there, but the vibe is great, the atmosphere awesome. A bit afraid of PVP, didn't really get there, still enjoying the crafting and building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not a 1.0 game, its still very alpha.  I got this key for free, I would not recommend it for money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pax Dei is not a game for everyone — and that doesn’t make it a bad game.\nIt’s true that it still needs polishing and has plenty of bugs, but the core concept is fresh, ambitious, and genuinely interesting.\n\nIt reminds me of the early days of Rust: a niche survival sandbox, full of grind, heavy farming, mixed reviews, and a rough start. Over time, Rust improved drastically, the community grew, and the game became solid. Pax Dei is going through that same early stage.\n\nMany negative reviews mention that the game is demanding, slow to progress, not friendly for solo players, or that it feels empty. But it’s essential to understand something: Pax Dei is built around cooperation.\nIn a clan, everything becomes easier. Specialization makes the game flow: warriors who never craft, blacksmiths forging full-time, farmers, brewers, cooks, tailors… everyone contributes. It’s almost like real life: shared roles building something bigger.\n\nThe goal is not to wander alone with a tiny cabin —although you can— but to create towns and build a living world.\nAs a sandbox, it offers much more than PvP or city-building: it’s also a great environment for roleplay, which gives the world depth and helps players generate their own emergent lore.\n\nThis is a niche game focused on letting the community create its own world, its specialized characters, and its way of interacting. You are not the “all-powerful hero” of traditional MMOs. Here, you need others.\nThat old-school feeling —joining Discord, organizing tasks, helping your clan, building together— is exactly what gives the game its charm.\n\nThe fun comes from watching your clan grow, your town expand, and your characters develop. The lore isn’t explicit; it’s something you discover by exploring and engaging with the world.\n\nFor players who enjoy specialization, grinding, medieval fantasy, building, and meaningful social interaction, this game offers a lot. It’s demanding, yes, but it also helps you meet people, create communities, and build real bonds through gameplay.\n\nIf the developers continue improving it and make solid decisions, I believe Pax Dei can follow Rust’s path: better mechanics, better performance, a stronger community, and a game that will feel much more complete in the coming years.\n\nIt’s not a game for everyone, but for its audience it already is —and can become even more— a unique, innovative, and refreshing experience. In an industry where we are almost always lone superheroes, Pax Dei dares to bet on community, cooperation, and building something together. And that risk is exactly what makes it special.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very grindy if you like that - playing with friends is super helpful, find a big clan - even better :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like to grind and build this is the game for you. Be a hermit or a soldier, it is what you make. Foraging is a must and lots of skills available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a grind... so it's not for the ones who cannot commit to the struggle. It's a beautiful game, with lots of promise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a different game alright, a grind game times a thousand set in a open world with a option for PvP. Its a great game if you like a slow grind and how to shut your brain off completely. I like it tho, and don't think its far from a good game, just need a few updates and less pay to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying this game. It's very graphically pleasing, and I enjoy building things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I write this with < 10 hours in the game.\n\nI had an EA key I never used. Was hyped for the game prior to EA, watched a few streams once it opened and never bothered. It was too bare bones at the time.\n\nIt’s still relatively bare bones. Essentially it’s adult Minecraft.\n\nThat said it’s visually stunning. In 25+ years of MMO gaming (I will die on the hill it’s an MMO), I’ve never had as much awe and wonder just running around a map looking at stuff. The only thing comparable visually to me has been Elden Ring.\n\nYou’ll spend a lot of time gathering/crafting in the current interation. There isn’t much else yet, though there is PvE content to do - but to get there you need some basic equipment. Once you can fight Inquisitors for gold, you COULD ditch the gathering/crafting completely but that’s dependent on having a viable market in your area.\n\nThis game FORCES you to explore. You need to know which market stalls sell what you’re looking for as there are no NPC towns to buy things in. You WILL spend a lot of time running around because mounts don’t exist and fast travel is limited.\n\nThe game also appears to be far more challenging if you’re solo. The game is designed around player interaction, so if that’s not your jam you will probably struggle.\n\nAll this said - there is SO much opportunity with Pax Dei, I can’t help but be excited for what comes next.\n\nI’ll update the review after a month.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game - systems are amazing and the game seems to be set for becoming one of the best.  Too bad it released a long time ago in a bad spot... hope people all come back to see how fun it is now!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game looks amazing. I bought a founders pack last year but i struggled finding clay to build with. I regret not sticking with it after seeing some amazing builds.  When the version 1 came out last month i dove in again but i found that the UI scaleability slider had been removed due to it being buggy. Without it i cannot play as the menu text is too small to read on my laptop screen. Its very frustrating as subsequent patches have yet to restore it. I tried outputting my laptops display to my 55inch 4kTV but its no clearer. The game is looking amazing though. I am watching a ton of videos on YouTube every day. There are some fantastic builds taking place. Hopefully, one day i will get back in and build my own home on Pax Dei.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes. I love the crafting and open world exploration!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is hands down one of the best MMORPGs I have EVER played, and that's saying a lot because I've played every MMO since 1993. \n\nThe issues with the game being new and still in development are not really big issues - the devs are more actively patching and rebalancing things than World of Warcraft and other big MMOs. The building system in this game is similar to Ultima Online (UO) if UO had been a 3rd person action RPG. Basically you get a plot or plots in a region with limited land available, so land and resources actually have scarcity. All the gear and such is player made and breaks over time so crafters have real purposes and continue making money. The devs are still bug fixing and rebalancing combat, but every change they make has been positive and in the right direction. They listen to their players. This is definitely worth a try if you love building awesome castles and such. \n\nYeah, you have to pay for plots with your subscription if you want more than 1 plot, but you can now maintain a plot for free every month just through logging in once per day, or you can spend in-game gold to get \"Grace\" which can be spend for paying for your one plot, so you can actually get a plot for free, and with paying only $4 for premium monthly it gives you extra grace for logging in, and makes it easier to keep your free plot.\n\nI hope you give it a try because I love this game and hope it will be around a long, long time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is legit.  No coddling.  No hand holding.  It's a lovely grind.  Light effects and sound are exceptional.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Pax Dei is Beautiful. But Here's the Reality of the Grind.\r\n\r\nI've played a lot of building games over the years,  Ark: Survival Evolved, Ark Ascended, Dune Awakening, and more. But Pax Dei? Visually, it's on another level. The world is absolutely gorgeous. The scenery, lighting, and atmosphere pull you in immediately. And the building system? It's one of the most flexible and aesthetically pleasing I've ever seen.\r\n\r\nYou can build anything: cottages, taverns, gothic mansions, sprawling castles. The creativity they allow is staggering. Every wall, roof, and beam feels handcrafted. It doesn’t just look good, it feels good to build in this game. For a builder at heart, Pax Dei is a dream come true.\r\n\r\nBut here's the thing.\r\n\r\nOnce you get past the honeymoon phase, the reality sets in: Pax Dei is one long, slow grind. And I don't just mean a casual grind, 5-10 hours  just to move up one level in one crafting skill once you're past level 13 or so.\r\n\r\nCombat? It's Fine, But Shallow.\r\n\r\nThe combat system is very basic. Right-click to block. Left-click to swing. You get six skills based on your equipped armor, but they’re not flashy, dynamic, or deep. There’s no dodging or rolling. No parrying. No hit reactions that make you feel like you’re in a fight.\r\n\r\nIt works, but that's all I can say. It's functional. There's potential, but right now it feels placeholder for something to do between gathering runs, not something to build a character around.\r\n\r\nThe AI and PvE? Not Much There Yet.\r\n\r\nNPCs are dumb. Their AI is about as complex as a training dummy with legs. They run at you, swing, repeat. There are only a few types of animals to hunt, deer, wolves, bears, badgers, goats, and boars. That’s it.\r\n\r\nNo birds. No fish. No ambient wildlife. And there’s no fishing mechanic, despite having beautiful lakes and rivers. The world looks alive, but it doesn't feel alive once you interact with it.\r\n\r\nPvP? Full Loot, but Mostly a Zerg Fest.\r\n\r\nPvP exists, but only in designated zones. It’s full-loot, meaning if you kill someone, you can take all their gear. Sounds intense, right? But unless you’re wearing high-tier gear, you’re not going to win those fights.\r\n\r\nIf you're in iron gear and someone else is in wrought iron or steel, you’re toast. Even if you get their loot, you can’t use it unless your skills are high enough. So the reward is limited. And from what I’ve seen, most PvP ends up being chaotic zerg rushing with people spamming skills and swinging wildly.\r\n\r\nThe Grind is the Game, Because There’s Nothing Else\r\n\r\nThis is the heart of the issue.\r\n\r\nAt first, crafting feels satisfying. You’re unlocking new benches, new gear, new recipes. But once you pass level 11–12 in most professions, the XP curve spikes hard. To go from level 11 to 12 in Weaponsmithing, you need around 12,300 XP. Not bad, right?\r\n\r\nWell, by level 25–26, you're looking at 150,000+ XP per level.\r\n\r\nMost crafts give between 200–400 XP per item, if you’re lucky. That means hundreds of high-cost items just to gain a single level, and you can also fail the craft giving 20xp, and loss of the materials and that’s after gathering, smelting, refining, and crafting components for hours upon hours.\r\n\r\nThe problem? That’s intentional.\r\n\r\nThere’s not much to do once you’ve built your base and crafted your gear. The AI isn’t deep. The combat isn’t engaging. PvP is limited and niche. There are no real dungeons, no real exploration systems, no world events, no group content worth planning around.\r\n\r\nSo what do they give you? The grind.\r\n\r\nThe crafting loop is the game. It’s not a supplement, it’s the main attraction. And for someone like me who enjoys building and progression, that’s fine to a point. But the higher I climb, the more I realize:\r\n\r\n\"This grind isn’t here to challenge me. It’s here to fill the gap where gameplay should be.\"\r\n\r\nAnd what's worse,  the grind isn’t even rewarding. You don’t gather more resources as you upgrade your tools, you just unlock access to new nodes. A bronze pick lets you mine impure iron. An iron pick lets you mine iron. A wrought iron pick lets you mine pure iron. But if you go back and mine copper or tin with a wrought iron pick? You get the same amount as with bronze. There's no tiered benefit or efficiency scaling, just gated access. That feels like a huge design miss.\r\n\r\nEven the game’s monetization feels misaligned. I was a founder. I paid $100 during alpha. Supposedly that came with four plots but now I have to pay a subscription just to use the four I already bought. Otherwise, I get one free grace plot. It’s frustrating. There's no real benefit to having bought in early except a few cosmetic labels. No permanent advantage for supporting the game early on. That stings.\r\n\r\nAnd now that I look at the numbers? As of today,  exactly one month after 1.0 release: Pax Dei has only 2,546 players in-game. That’s alarmingly low. I’m genuinely concerned for this game’s future. I doubt it will still be online in two years. Maybe not even one.\r\n\r\nThe grind, the lack of content, the shallow combat, the subscription model, they all combine into a player experience that doesn’t give back what it asks. And that’s coming from someone who’s already dumped 287 hours into this world. Everything in this game takes so much time it's mind boggling, and even just moving around takes forever as mounts are not in the game. \r\n\r\nFinal Thoughts\r\n\r\nPax Dei is beautiful. It’s creative. It’s full of potential. But it’s not a finished game. It’s a stunning canvas with a basic sketch of a game loop laid on top.\r\n\r\nIf they ever expand the PvE, add real enemy AI, bring in more wildlife, introduce fishing, mounts, flesh out the skill trees, improve combat, and give players something to do besides gather and craft, this could be one of the greatest sandbox MMOs ever made.\r\n\r\nBut right now?\r\n\r\nIt’s the prettiest grind machine I’ve ever played.\r\n\r\nAnd if that grind ever did loosen up, the whole thing might collapse under its own emptiness.\r\n\r\n A solo crafter who's seen what lies past the iron wall.",
      "voted_up": false,
      "votes_helpful": 298
    },
    {
      "review": "Been playing on and off since early access. It started alright, actually quite enjoyable. Really liked the concept and the world. However as time went on, the crafting system went off the charts with the grind requirements and the performance gotten worse. A few months ago it was a miracle that we got a development road map, and now kaboom 1.0 released. Logged in to see it totally undercooked struggling with the same issues. And then paywalling  the building plots in a base building game that you already paid for (master founders edition) is as thick as it can get.",
      "voted_up": false,
      "votes_helpful": 55
    },
    {
      "review": "I loved playing this game in early access and bought the expensive pack. I was under the impression I would at least get a SINGLE PERMINANT PLOT IN 1.0 considering a plot is REQUIRED TO PROGRESS! Nope! You get a plot token for a month! A subscription is all but required to play! Considering the game is not finished, paying them more money would be insane! Taking the money you would spend on this game and lighting it on fire instead is a better value proposition because then you would at least get warmth for a few moments! This is a dead game unless serious changes are made and even then it's probably too late!",
      "voted_up": false,
      "votes_helpful": 110
    },
    {
      "review": "Been playing PAX DAE for 500hours but I find that in it's early access and current state Pax can become boring, this is why- So I get it, grind and get all the top end gear for PVP and bragging rights but not having the following is a thumbs down for me: There is no player agency ( NPC player story or in game mechanicsinteraction-other than enemy NPCs to fight), no loot or incentive to farm enemy NPCs, limited building with round plots to small, players can build on top of each other (dropping FPS, Lag, and game crashes in heavily populated areas. With updates for plots and being able to sub a plot or grind now to keep plots(s) going with constant grind to aquire gold for grace and keep a plot going. Plot system needs to be revamped to prevent massive amount plots in one area. LOCs  are repetitive, there is nothing unique and other than getting a small of coins no real incentive to farm/ go kill off the enemy NPCs in the camps. The grind vs losing so many mats and not being able to reuse them or recycle them sucks immensely ! there is no return for you time in crafting and farming mats. If you want to explore and adventure - your skills will suffer for it and vise versa. For a social \"MMO\" there is no social in game it's rare to have players interact with you let alone with anything a player has built or crafted. I've tried the RP and regular servers and it has been the same- not really alive. Relying on players to interact and have something to do in game is lazy and there are no towns or cities within that would fill that vacuum does not exist. So i think in its current state, it's not enough to recommend it.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "I really really wanted to love this game, I even bought it for a few of my friends... Sadly it was a complete waist of money.\n\nThe game is beautiful, and the atmosphere very good, there is not denying it that. The potential was incredible... \n\nBut as always, the developers came in guns blazing with a AAA subscription/cost for an unfinished and unpolished game. What absolute short sighted madness, business incompetence, and pure greed.\n\nBasically what I/you get for $100 + $15/mo is the ability to grind materials and build a house - and a whole lot of promises. \n\n- This game offers zero economy as it's pissed off 90% of its initial supporting base and in-turn scared away any comers.\n- No existing Raid content, let alone mechanics.\n- No real dungeons other then a few caves with simple mobs in them.\n- No mounts despite its beautiful gigantic world.\n- No purposeful PVP content. \n\nUnfortunately, we've all seen this movie sooooo many times already, a \"potential great game\" built on promises and our dollars; that will get abandoned right after birth once our checks have cleared their bank accounts so they can go do it again on another project as it will be more lucrative then doing the right thing and take the time and resources to build something meaningful. \n\nShameful,",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "It's a pity I didn't know that after a month I would have to buy something in the store, such things should be written before buying the game - to keep your plot/house you need to have a plot token, which unfortunately has to be bought in the game for cash :P I don't recommend it",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "bought the 100$ edition back at the start of this year sunk so many hours in building up a house just for the game to wipe i wasn't mad just decided to wait for launch so my time spent on my 4 advertised plots wouldn't be wasted. The janky pve was pretty fun, the janky building took way to long but all in all it was fun. then they got greedy once the game launched where are my 4 plots i paid my good money for. why lock a core game mechanic behind a subscription. you NEED a plot to craft, build and smelt your ores You NEED a plot to store you wears you NEED a plot to make stands to sell stuff you craft a ton of for levels and or aren't using anymore. Threw that all out the window because of GREED. Fu*king wild.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Imagine investing in this game, playing it and seeing an amazing concept, even invest in some upgrade packs, not because you really have time to play, but because what they built so far was so cool.. check back in to find out, \"thanks for your cash, please insert credit card in order to unlock your additional purchases...\n\nAs gamers, we really need to stop supporting these monetization strategies that ruin the things we enjoy. it encourages time spent in a direction of less fun, more profit.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This game was fun then became a cash grab. when it came back the grind is horendous and before it was complete b*****",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "after playing for days, I still do not have the ability to craft an axe that is strong enough to cut down a bush next to my house. somehow, I can use a lesser axe to cut down a giant tree. apparently in order to do something trivial and boring like build a limestone wall. I have to level my carpentry to level.....30! it seems like this game is a giant grind to do nothing at all. it is very pretty, but I just can not take this miserable grind to do ANYTHING in this game. I do not see any differences between release and beta versions of this game. it seems they released what I would call an alpha. it does not seem to be feature complete and it has strong mechanics but lacks fun. It seems to be a test of how much I hate myself. The answer seems to be 111 hours.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "The 1.0 release seems forced and not ready for prime time.  A large amount of fundamental things are broken or unbalanced like excessive crafting failures, disappearing/teleporting encounters that make 2/3 of the game effectively unplayable only a few weeks into its launch. I have concerns with UI messages popping up in the middle of the screen blocking my view and ability to make menu selections that get hidden underneath them effectively creating a lot of feel bad moments in the game overall by having to excessively wait or accidentally select the wrong choices.  I really liked the promise this game had when it was announced, enough to fund the early access, but overall my experience to date is extremely underwhelming and I would not recommend this to anyone I like. Development or community management right now is extremely tone-deaf, i.e. real core problems with the game with no ETA for fixes, but hey there's new content coming within the next 45 days.  With the track record that they've shown so far this will likely break more things so I wouldn't hold your breath.  Some recognition of priority, transparency in what's happening would go a long way to help me want to stay or bring friends into this game but right now IMO it is dead on arrival.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Just turn off lumen and all the UE5 crap, the game runs poorly and it gets all dithered on camera movement, low fps, stuttery, my frame time graph is a rollercoaster with a 9800x3D, im sorry i want to support mmos but this is not it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Pax Dei: tu vitium et maeror\nYour flaw and sorrow.\n\nI thought long and hard to name this review, just as I often wondered throughout the game where to build, what to do next, and whether the game had a place for a person like me, a stoic builder who loves the premise of self sufficiency and solo play merged with the joy of helping others and being a good samaritan.  I'm someone who truly appreciates beauty and art in games,  and marvels when I find a game that makes me stand on a hill and think 'Wow, this is quite something'.  Pax Dei sadly only did the latter.\n\nThe breathtaking vistas, gorgeous valleys and relaxing music set me up for a world in which the player had agency, and the player could enjoy that escape from reality where they could just build, enjoy and communicate. However, what I saw from day one was less an adventure through a bustling region filled with small holdings and mini towns, but more a landscape of ghosts.  Stone and timber revenants partially exposed and never completed.  \n\nIn a game as vast as Pax Dei, I hoped there'd be less abandoned buildings and more players on the horizon.  Sadly, that was rarely the case. \n\nThose ruins were everywhere. The sad tale of adventurers who arrived with the same hope I did, and left feeling that the world was not theirs and even if they could claim their land - they would never be able to truly master it due to the enormous mountain of grinding needed to create not just a plot, but a home.\n\nThe 'memorials to the fallen' are endless, and this should tell you all one really needs to know. When the majority of people don't even build a roof over their head before calling it quits, there's a problem.  \n\nPax Dei sells itself as a fantasy sandbox world in which emergent gameplay creates the rise and fall of empires who will fight for the 'chosen lands' in the middle of the map.\n\nThe reality is that this sort of gameplay involves mostly large clans, and statistically - large clans are the minority. Pax Dei scaled experience, and resources to an absurdly low level to slow progression. The reality, as proven in games like Last Oasis, Rust, Ark, Eve, Myth of Empires is that this almost never works, because large clans are organised, methodical and experienced in getting things done, systems be damned.\n\nThe end result is these pacing systems end up only hurting the people who join solo or in groups of two or three players, and it saps any sense of achievement or sense of pride they have in the game. As a result, large organised groups power ahead, and smaller groups and individuals wither and quit.\n\nCombat should be a dance of life to death, but it ends up being a struggle against stability due to poor design. Progress and rewards are also so tedious that it becomes frustrating. With successive updates - the devs have slowly reduced rewards and loot from NPCs that small groups can battle and today - the only thing of value on them is gold with which you can use to pay for one plot (via grace).\n\nBut - the most heartbreaking thing of all, is that as a solo player - I have no agency.  My life is to farm. \nRun to resources.\nGather resources.\nFill furnace.\nCraft.\nGather logs for furnace.\nRepeat.\nSession over.\n\nMy heroic deeds were giving the furnace a middle finger, and smiting a boar. I gifted a newbie a set of armour, but I'm not sure he'll play long enough to need to replace it.\n\nSo. the title stands.\nPax Dei - your flaw and sorrow. The flaw is the world whose systems deny the very agency it promises for players. A world in which you become part of the machine or you are eaten by the machine. The sorrow is in the beauty of the world, spoiled by a vision which tries to be everything, but excels at nothing but attrition.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After 400 hours here is my official Pax Dei review.\r\n\r\nThis game is unfinished and was forced into release for financial reasons.  With that being said the scenery is pretty, the building is nice, but everything else is subpar at best.  The games feel like layers of crap were added on top of one another without thinking how each layer would affect the other.\r\n\r\nThe Devs have no real concept of economy and attempting to build a player driven sandbox.  Scarcity doesn't exist for anything.  There is little need to travel very far to obtain any resource.  You can teleport to enter PvP territory, gather things from static resource spawns, then just teleport back home when your inventory is full.  You can do this with no gear and just a tool in inventory.  There is no real risk.\r\n\r\nThe crafting system is actually worse than Wurm Online and that is really saying something considering it takes years in Wurm to perfect certain skills.  People get pigeon holed into all crafting the same item over and over again making them worthless.\r\n\r\nThe combat is terrible with PvP strictly based on running out of stamina or body blocking people so you can kill them.  I get this is a small dev team, but this shows no real effort.  Bows are useless.  Everyone has to go max stamina builds with max stam/hp foods.\r\n\r\nThe building system is not new.  Wurm Online has been doing better for 20 years and that is coded in Java.  You can even sculpt the terrain in Wurm Online, but in Pax Dei you get trees growing through floors.  In Wurm if you cut a tree down and pave over that dirt its not coming back.  Pax Dei devs have said this would be hard to fix.\r\n\r\nRaw foods have better stats than crafted ones...\r\nAll Jewelry is useless with no stats...\r\nPvP has no purpose... (maybe in Verse 5)\r\nIts a walking and wood cutting simulator...\r\nNo mounts...\r\nNo way to place buy orders for items...\r\nMass abandonment by players...\r\nPermission system is terrible for plots...\r\nNo logs for markets stall or chests...\r\nNo notification when you sell something...\r\n\r\nThe list goes on...",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Unfortunately I can't recommend this game right now. \n\nAlthough it released as \"version 1.0\", it is nowhere near the quality of a full release. If I had to put a label on it, it would be barely past Alpha. Some systems don't work at all (jewelry), and the numbers required for just about everything don't seem to make sense. The game is unbelievably grindy. So much so, that the feeling of even reaching a new crafting level just doesn't hit as it should. you'll be grinding thousands of the same resources just to climb a single level, and some resources are so scarce and possibly far away from where you put your base, that it becomes extremely disheartening. \n\nThere is teleportation, but that is also not a very good option as it uses a special resource called \"grace\". you get not even 1 teleport worth of grace for free per day, which means you have to grind gold to buy grace, with each next amount you buy getting exponentially more expensive. It's only really viable to buy a couple of tiers of grace, which is better spent on other things than teleporting. That's not even considering the fact that grace is required to upkeep your base every month so it doesn't disappear if you want to play for free. And free is a stretch since you paid to play the game! \n\nFurthermore, as I have the premium buff because my friend gave me the game from his founder pack, the game is even MORE grindy if you don't have premium. I 'm already getting tired of the grind. I can't imagine how much worse it is without premium status. Anyway, this game is not yet worth it. I'm glad I didn't have to pay for it, but feel really bad for those that did. \n\nThe only redeeming quality is the building is very in depth, and you can make some nice things if you're artistic. My map has someone who put a giant sword monument on top of a mountain, and there's some impressive castles. One person made a bird nest with a bird overwatching it. Very impressive! However that's all there is to do in the game. Build or farm relentlessly. There's PvP as well, but don't even think about it unless you make friends and upgrade a couple tiers of gear.\n\nAs for the crafting, besides what I already mentioned, The devs have two very large problems. The stacks of everything are too small, forcing you to make hundreds of chests just to keep up, and that's with the special founder chests! the normal chests are even smaller. There is another larger chest later that is just as big as the founder one, but that takes a while to get to. The stacks need to be much greater. It's very difficult to organize things. The other issue, is the cost of materials to craft things make no sense. You need A LOT of wood to make charcoal. Like, A LOT. charcoal is used to make ingots. And often times, ingots are used to make bars. And then those bars are used to craft. So it takes multiple stacks of iron for example, to make 1 synth, to get 0.1% exp towards a level. And iron is kind of scarce in my area. Especially if other people are looking for iron, which they are. Someone has to tweak these numbers to make sense.\n\nNext the player trading system. ... What the hell is even this? This has to be the single most frustrating thing in the entire game. You can open the market menu from your menu, which allows you to see what people are selling in their markets. There's no search feature, so you have to scroll endlessly until you find what you want. IF you find what you want, you then have to travel to their base, and then when you get to their base, find where they placed their market stall. This system is a gigantic mess and borderline unusable. It's unbelievably difficult to find certain things unless you want to spend tens of minutes scrolling through pages. Firstly, this needs a search feature. and second, you need to be able to buy things directly from the market screen. There's enough tedium in the game. Trading between players should at least be easily accomplished.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Unfortunately, the game runs me out of video memory trying to load the new character into the game. This is new behavior (I've not played since July) and I find they only allow reports via Discord (which I no longer have) so I guess I'm just S.O.L.... which should tell you everything you need to know, really. \r\n\r\nI was very hyped for this game initially and put about 150 or so hours into it before realizing they weren't really planning for more than 'player managed' content. I'm sure there's a market for it, but I'm just not in the demographic and, since I can't test/play to see if there's anything else I'd enjoy more in the offering, I'm just putting this out here and pointing folks to my last screenshot, in which the error is displayed.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Great Game, Great Visuals, Great Concept, Fun Challenging Gameplay, ALMOST Perfect Game Except It's A PAY TO PLAY Game Even After The Developers Made It So You Could \"Purchase A Plot With 400 Grace Per Month\" UNLESS You PURCHASE \"Premium\" You ONLY Get 280 (Feb.), 300 (Apr., June, Sept., Nov.), or 310 (Jan., Mar., May, July, Aug., Oct., Dec.) Grace/ Month. Can't Personally Recommend Until \"Subscriptions\" OR \"Premium\" Is Removed.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Only one thing wrong with the game. Purchase AND THEN subscribe to keep your progress. You do not receive tokens if you switch to a new server to play with friends. You cannot maintain a home base without a subscription. This may be some peoples' cup of tea but it is not suited to me. Outside of this the game is wonderful. Visuals, sounds, buildings, exploration, social - really special \r\n\r\nIf ever the devs did want to consider my 10 cents on the game - I would encourage you to allow purchase but non-subscribers to spawn their base in while logged in, but not to allow it to stay in the world upon their log off. For players wishing to leave their mark on the world, the token system is perfect, but casual players, social players like myself who wish for light exploring with friends - this does not support my playstyle. Hopeful you may yet make adjustments to this system.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Combat still feels like absolute ass, Feels like your swinging at air no matter what your doing... 5 years of development and they still haven't figured this shit out i fear they never will. Until then.....I'm out....",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Was gifted a free copy from a friend with founders so I'll point that out.\n\nFor a game I didn't need to pay for it was alright but honestly I can't help but see this being \"1.0\" in name only just so the studio was able to try bringing in extra revenue. There's nothing wrong with them needing money lol but when the game launches into 1.0 with Bows and Fletching broken and needing to be reworked along with only a month in asking players to vote on reworking Bows/Fletching, Alchemy, Baking, Butchering, Cooking, and Jewelcrafting that clearly shows this came out of the oven a bit too early.\n\nGraphics were great from what I saw. Concept is fun enough till the grind starts hitting early on but with this kind of game I think you can miss the boat a bit say in my case of dropping it to wait and see how updates go. By the time I might come back I can imaging the community being mainly hardcore players though that's not to say they wouldn't be welcoming for fresh recruits.\n\nMight check it out after those reworks are done but for now its a 'No' from me",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Classic early access grift…. People want the concept but why does steam allow developers to do this",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game concept has potential, but I'm doubtful this game will ever reach its potential.\n\nI've played the game for 11 hours as of the time of this review and my biggest annoyances so far have been:\n\n1) Plots and natural vegetation. If you claim a plot there is no way to semi-permanently remove trees or rocks that spawn within your area. This means you can put down a foundation and a tree you chopped down a few minutes before will grow right through the middle of it.\n2) Limited and unrewarding resource collection system. You can travel to many different biomes, but the materials remain relatively the same except for some variation in plants.\n3) Simplistic Combat and NPC AI. It's a pvp game, yes, but there is no reason for the AI to be this bad, and more techniques and tools for fighting would make the game more enjoyable.\n4) No inventory sort. It's not required for these types of games (Valheim didn't have it), but it certainly helps.\n5) The crafting system doesn't feel rewarding or enjoyable. Not sure how to fix this. It's a PvE system in a PvP game, so its going to be an after thought and it shows. \n\nI could go on, but those are my major gripes after my short time in this game. I might check on the game from time to time since I already purchased it, but it needs major changes and should still be in early access.\n\nThe game is not worth purchasing in its current state.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It is a medieval building simulator.  If you do not enjoy hours of chopping trees, mining rocks and gathering plants, this in not the game for you.  Too many other games do this a lot better.  The only bonus I would give this game is it looks pretty.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have played with none stop material farm the game almoust 7h, but i cant even craft basic shit like bronze tools! This is FUCKING UNBELIEVABLE GRIND!!!!!!!!\n12H and there is absoulotely nothing  but the extreme grdin for basic matarials to grind a litle exp to get a basic shit. Can craft only few broonze weapons, no armor yet this is fuckinig ridiculous!\nThere are no mounts or anything  to reduce the fucking grind of running back to the plot!\nPVE is so basic, that it is even hard to call it simple and basic,.....\n\nWhat a waist of the money!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Honestly overall awesome looking game and mechanics are pretty great. really the only issue with this game is the plot of land needing 400 grace to stay yours each month. If you have a life outside of gaming you probably wont be able to be on enough to farm the gold required to get enough grace so you lose a really cool and really big mechanic of the game. Ill give it to the developers they did make it where you can use grace instead of cash but 400 grace takes a lot of Gold and a lot of in game time. The way Me and another of my friends is getting around this is we only have 1 plot and we farm the gold then give it to only 1 player so that they can pay to keep the 1 plot. Honestly a great game outside of this mechanic and i will still play it even to the dismay of having to farm to keep my things.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They lied to the early access players about what they were getting when the game went live.  The only people playing after the \"launch\" are the early access players and Main Frame is ripping them off as much as they can before this game inevitably shuts down.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This is a beautiful game, the detail game play is amazing. With that being said the other side of the game, crafting and leveling up on proficiency is awful. For the first week the xp was broken and minimal xp was gained for every crafting and armor proficiency. I realize this is a newly released game but there was an alpha and beta that should have worked out these small bugs. An update released today and it broke everything that wasn't broken and only half fixed what was broken. If you have time and patience for things to change after each new moon then this game might be fun. There is by no means insta gratification, it all takes A LOT of time. I personally will no be devoting anymore time to this game after 84 hours since its release on October 16.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Seriously while the base game is fun, i cannot recommend it to anyone in its current state.\nWhy on earth would you pay a monthly fee when there are so many survival games out there that are better. and don't ask for a subscription.\n\nSure it looks pretty, but is optimized very poorly as well. The playerbase is also very low and dropping fast.\nWhile i only played 5 hours, you can clearly see that the grind is just to much and not fun.\nSkip it, not even worth it on a sale tbh.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I played this back when it was still in Early Access. It is a fun game, at least during the initial rush of exploration, finding a spot to settle, building up your home base, gathering resources, upgrading gear, and taking on the local wildlife. But that loop is essentially the entire experience.\n\nThere are no NPC settlements to discover, no towns to visit. The entire game relies on players interacting with each other and forming their own clustered settlements at pre-determined building zones. Yes, the map restricts where you can build. So if you spent time traveling far away to find that perfect scenic cliff or quiet valley, only to discover you can’t build there… it kills motivation fast.\n\nWithout NPCs, there are no real quests. The only “questline” is the early tutorial that guides you through building your first base. At least in Early Access, that was all we had; I'm not sure if it's changed since. NPCs would have brought life to what is otherwise a dead, empty world. Even a lone outpost offering simple daily repeatable quests or procedurally generated tasks would’ve helped the world feel alive.\n\nThe player-driven economy is a cool concept, but it lacks grounding. There’s no baseline pricing for basic resources or starter gear because there are no NPC vendors buying or selling anything. This means prices swing wildly depending on who you happen to buy from or who you accidentally gouge. Without centralized NPC hubs, there’s also no true marketplace. Instead, you’re stuck traveling to scattered player settlements hoping someone has what you need, and hoping the prices aren’t absurd.\n\nFor context, I was part of Dual Universe’s Alpha, Beta, and release. Pax Dei is following the exact same pattern that DU’s developers went down… and we all know how that turned out. And for the record, only a handful of games have ever made a player-run economy actually work; Ultima Online and EVE Online, and both of those are still thriving. Interesting, isn’t it?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If I had known they would do this with the game, I would have not bought it. I spent 105.99 on this. Why would I want to spend more money on a game again when it showed, oh if you pay this you get that plot? That is just basically them stealing now because to have 4 plots it takes $19.00 a month. I have 189.3 hours with this game. I wish it was clear in the beginning because I could have easily used the money for something else for something that was worth my time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bought a Founders Edition, because the game looked promising. Graphics are very nice, building is good. But to to pay a monthly fee of 11 Euro to be able to have a nice building (one plot doesn't get you far)? And that in a game where you don't have much to do beside gathering, crafting and building? No, not my cake, esp. when I compare it to games like \"Once Human\", who are free (if you like, ofc you should pay a bit when you play it longer). Uninstalled.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Pax Dei is displaying all the red flags you don't want to see in your next online game, and I highly recommend not to buy it.\r\n\r\n- Early Access saw just 11k players peak.\r\n- The rushed out 1.0 launch saw just 6.5k players peak.\r\n- Everything in the game is build, made and storied by the players, but there barely are any.\r\n- The game is financed through box price and monthly subscription.\r\n- The game is very unfinished and lacks a lot of things that are rather obvious.\r\n- In two years of EA these things never made it in, but remain on a long to-do at a later point list.\r\n- The devs delete countless critical topics on the forums on a regular basis.\r\n\r\nIt is clear to me that this ship has sailed and some delusional devs are desperatly trying to damage control a total dumpster fire. When you think their finances through, the math doesn't add up. I'll be very surprised if Pax Dei is still operational by the end of next year.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Wish I could get a refund this developer is just money grabbing. I had so much hope for this game but greed seems to always win in this industry.\nUpdate: The developer responded which is cool but, I don't think getting on and grinding grace just to keep my camp is still worth it. While I farm grace everyone else on subscription gets to run around and explore with no worry about keeping the camp. How about you offer a refund and see how many people keep your game? That will let you know if your decision was good.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is trash and i'm not sure how anyone can even defend it. The combat is STILL a glitchy, clunky mess and there's really nothing to do besides grind lol. Please waste your hard earned $$$ on something else.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really enjoy this game — the concept, theme, graphics, and music are all great. I also like that you can play solo or with your team. However, after the recent update, I’ve been experiencing constant crashes (Asia server), which makes it nearly unplayable.\n\nWhat really frustrates me is that even though I already bought the full game, I still have to pay a monthly fee to rent land in the game. It feels unfair to keep spending money just to maintain access.\n\nIf you’re looking for a nice building simulation game and don’t mind dealing with frequent crashes and ongoing payments, this might be for you. But if you value stability and fairness, I’d recommend waiting until the developers fix these issues, and that will never happens, trust me ;)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Gimmick of a sandbox MMO.   You  will see loads of people defend the crafting progression in this game to justify their wasted hours on this mining and lumberjack simulator.  Fact of the matter is, its a poor release with no content.  Zero sense of progression.  Nothing rewarding.  Developers looked at every quality of life option from other established games that it tried to be like and said......auto sort inventory? Nah don't need it.  Or even an auto stack feature to where you inventory doesn't end up with 20 slots of the same thing but each one is a different value......Think you can traverse this vast map and come back with a haul later in the game.  Think again.  Backpacks or rucksacks are a think of the future.  No backpack upgrade for you buddy.  I will pull back a bit.  This game is beautiful.   Looks amazing.  Just shallow.  Nice to jump in on a free weekend and take a look at the graphics, as for game play, zero substance.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I appreciate what the developers are trying to do. There isn't enough time or money to make the game they want to make. Maybe in a year this game will be pretty great. In the mean time though I just can't justify wasting my time playing this game.\n\nIn one word I'd describe this game as wasteful. You'll constantly be picking up items you don't need, filling your inventory, in which the best option is to drop it on the ground. You'll constantly be crafting items you don't need, and no one else needs. Again, drop it to the ground. You'll find yourself crafting a heavy armor and weapons using an absurd amount of Iron, for piddly skill gains. Failure (which is semi-random mitigated by skill) causes you to lose 90% of your materials and the skill gain. More waste.\n\nI could spend a bunch of this review complaining about gold spammers, and technical details like mobs teleporting randomly, but I'm willing to overlook those things. It's a small dev team. But when I waste a bunch of bronze, to skill up into iron, only to find out that the iron (far more expensive and difficult) version of everything is almost exactly the same as the 'polished bronze' (far cheaper) alternative? I feel like it's kinda rude that they haven't tweaked some item stats to make it feel at least like I'm progressing. But instead it feels like I just need to waste a bunch of iron to get to the 'next tier'.\n\nEven then if I get to the next tier, what's the point? There's only a few different mobs to fight, grouping is mostly just smashing cooldowns and swinging randomly while someone aoe heals. Some people don't even care about looting because the mobs don't drop anything useful. It seems like the content kinda stops around Iron, and it's arbitrarily harder to skill up in it to prevent power gamers from running out of things to craft and then just throw on the ground.\n\nI'm sure I'll hear something like: Oh we're doing -you- a favor. This is an MMO, you need to group to progress. Meaning you need to manipulate others to mine, chop and smelt for you so you can waste it all on skill gains. It encourages specialization, not everyone should be able to level up everything. In theory that sounds nice... but the game just isn't there yet.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Bad business model for a building survival game. Without the sub you lose half the damn game. I bought the Master pack during Early Access and I wish I could refund this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "• The charm of the beautiful graphics/world and homebuilding quickly wore off after the 5th day. \r\n\r\n• The combat is just way too buggy and clunky. I don't need it to be a proper Action Combat, but at least have it be functional at its base level... come on.\r\n\r\n• Too many items that create a needless time sink of constantly sorting and organising. And I didn't even go for a know-it-all character that crafts everything.\r\n\r\n• Limited beginner's building structure options has you ending up with the world filled with the same boxed huts everywhere.\r\n\r\n• Having to destroy items to move them around is ridiculous.\r\n\r\n• There's no basic option to turn off your home lights (chandeliers) at daytime. You want the natural light not to be buried from the home lights? You guessed it, destroy it and put it back at night time.\r\n\r\nInitially It was enjoyable to build and gather until I stopped myself and decided not to sink anymore time polishing the home. Knowing I'll have nothing else to enjoy outside, based on the buggy combat and enemy NPCs flying out of existence literally in front of my eyes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Combat is not very engaging, 3rd person camera makes movement and controls feels very wonky, my characters body is constantly in my own way.\r\n\r\nCrafting progression needs a lot of work, professions often need items much deeper into another profession to progress. Often need to produce mountains of junk that you just throw away to get to the next crafting level.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game punishes progress with meaningless \"upgrades\", punishes the pursuit of progress with exponentially consumptive resource requirements, punishes gear obtainment with durability loss and permanent broken state, and pits players against each other within clans by having but a handful of meaningful crafting skills - 4 - but resource collection requirements for those who craft to need a clan of 10+ people to be online hours per day supporting them doing nothing but chopping trees and hitting rocks.  If you are a blacksmith in this game - expect to spend 2 hours idle at your desk as your character makes 200 useless daggers.  Lets not mention what happens when said blacksmith quits playing...  Oh, but there's PVE!  If you like killing boars, this is the game for you.  Every area has boars, and as you level up you'll be pleased to know there will be higher level boards to kill.  Only 3 races of humanoid NPC's, 3 species of dangerous animals, yet a world that feels as rich and real as a you might dream.   We said it in alpha and I'll say it again... with Pax Dei this fun is always right around the corner.  Always.  No matter how  many corners you take.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "(10 hours on Steam, couple hundred on the launcher before it shut down) As someone who funded this game at the start, calling this a 1.0 release is a joke and was only done in an attempt to secure funding in order to plug the holes in their sinking ship. I've played alphas with more polish, more features, more development and that delivered on more promises that what is on display in the games current stage of existence, this game is very clearly still alpha and since the EA began, the only thing's I can recall being addressed since that date in 2024 is that they've managed to accomplish half a dozen wipes, no instant-death from fall damage,  rebuilding the terrain map, while some how still not stopping trees from growing in foundations as they admitted to not knowing how to fix something that should have never been an issue in the first place and making a boring baseline combat system a more streamlined boring combat system all while some how not fixing anything of any actual significance that needed to be addressed at the games core and then to charge people a monthly subscription fee for a game in this state is one of the biggest FUs I've ever seen a company tell their supporters and shouldn't go unnoticed. I have supported hundreds of EA games that I believed in over the years and I've won some and lost some doing so, it is what it is, I understand EA is what EA is in every possible sense, but to literally call something a 1.0 release just to be able to charge a sub in an attempt to make a profit and continue development instead of actually charging the sub for maybe not a finished product but at the very least one that is polished and deserving of such a month expense like that in which they promised is one massive reason I can not recommend this game to anyone, if you brought it, I would suggest refunding it, if you are undecided about buying it, I would suggest you wait until the Devs offer a product that represents a build that warrants a sub and is actually reflective of a 1.0 release.  I would love a refund, I doubt it'll happen since I lost my transaction number through Xsolla at some point, however I can still urge you to save your money on funding this project and if you have money burning a hole in your pocket, literally pick anything else you would like to play and you'd be making the smarter choice.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is plagued  with crashing issues, teleporting NPC, crafting issues etc.... None of which were present in EA. This is not ready for release and the devs are charging for subscriptions. INSANE!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very nice game, promising, but ruined by a stupidly thought subscription model. You have 1 plot token when you start, the plot is really small and you have to pay to have more token. You can pay the plot with grace if you login almost every day to barely be able to pay for the plot.\n\nOther frustrating key points:\n- Extremely slow progression system\n- Crafting skill check that you have no control on (missed opportunity)\n- Building system is frustrating (no grid, limitations, visually not symmetrical)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is meant to be grindy and work together as a clan the but the maps resources are only enough for 1 person and the respawn timers are 30min+ so if there is one other person trying to farm the resources you are, then you will not get that much and have to wait 30min and hope that they respawn.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "being dropped from game many times a day is a real pain and does leave one to say screw this game.  getting kicked back to windows is strange and while playing game or crafting is starting to make me rethink my sub to play any longer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "take everything you hate about a grind based harvesting game, then multiply the grind by something like 50-100x more.  There is nothing seen in the game worth that kind of time demand, no adventure or interesting anything - to give new players anything to do.  Very much a big yawn.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[h1]I neither love Pax Dei nor hate it. It simply is.[/h1]\n\nI’ve played this game since Alpha—back when it still ran on the standalone launcher—and I can say without hesitation that Pax Dei has potential. Tremendous potential. But potential alone will not keep a community breathing. Not in 2025. Not when gamers have more choices than ever.\n\nAs it stands today, the game still leaves far too much empty space—both figuratively and literally. You can only coat “vibes” with so much romanticism before players start noticing there’s no real meat on the bones. And now, with the latest announcement from Mainframe Studios, it’s clearer than ever where they’re steering this ship: straight into pure PvP waters.\n\nIf you were hoping for a PvE growing experience—gardening, farming, livestock, caravans, mounts, dynamic events, zone bosses, wildland encounters, anything—then brace yourself. Because Mainframe has made it abundantly obvious that their idea of “content” is just more PvP. They’ve doubled down on it, and it shows. Hard.\n\nThe tragedy is that the weapon ability system was the strongest update this game has had to date—an actual good step toward variety, fun, and forward motion. But instead of expanding that creative momentum, the studio seems dead-set on funneling everything into a single, narrow playstyle.\n\nIf they want to maintain or grow their playerbase, they need to expand the world—not shrink it to a battlefield. They need systems, not just skirmishes. They need worldbuilding, not constant “player-driven conflict” marketing buzzwords.\n\n[h3]But is it worth buying?[/h3]\n\nI would only recommend purchasing Pax Dei if you genuinely enjoy full-PvP rulesets and don’t mind your world shrinking down to a single contested map. If you’re looking for a rich PvE experience, meaningful progression systems, or actual worldbuilding beyond player conflict, this isn’t the game for you—not in its current direction. \n\nIt’s worth a brief distraction, maybe a few weeks of novelty. But if you’re hoping the game will grow into a living, breathing sandbox full of depth, discovery, and cooperative systems? There’s no sign Mainframe is building that game anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not terrible but the entire game focuses on crafting and base building no matter what you choose to do...and they call it a \"sandbox\" MMO.  It's not a sandbox if everyone is forced into the same gameplay loop.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The craft fail rates are too high and ruin the game. The game just does not respect your tiime. You spend so much time gathering to build say armor tool weapon wall floor than go gather more for the next one and on top of that if ur not skilled enough u lose mats and then have to go all the way out again. Not to mention how far u travel too. Its good a good premise and design but wurm online does it 100 times better. Its just a endless loop time sink. You need so much to craft so little only to go and do it again. It does nothiing different than any other game in this genre if anything iit tries to be tedious on purpose. simply put the craft fail rates ruin the game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Horribly laggy for me. I have a laptop and am able to run almost any game but this one lags on any settings. Me and my friends were hyped to get it but then they announced subscriptions and the hype died quickly. Still, i believed that the base game would still be playable and i gave it a shot (16 loong and laggy hours). Then they took away our plots and are subscription only so that was what killed it even for me. Shame. Great idea, concept and graphics but greatly lacking in the execution department. 3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game may be worth playing in the future, but right now I wouldn't recommend it unless you are the type that absolutely loves gathering mats and slowly grinding skills.\n\nOne of the first things that drives me crazy is that you have to maintain plots with either grace or real money, but these plots are only for one character on your account. This makes it so that you grind all skills on one character rather than sharing the load between other characters on your account. So if you want to be a blacksmith you also need to work up leatherworking and tailoring on that same character to get all the necessary materials for blacksmithing. You could buy mats from other people, but you physically have to walk to their merchant stall to buy the materials, and that merchant stall could be on the other side of the map.\n\nDid I mention there are no mounts? Because with out mounts, traveling for materials, whether buying or harvesting yourself, could take hours to complete. Some materials such as cotton are only in 1 or 2 places on the entire map. This could be 2 or 3 zones away. Once you get there you run the risk of not finding anything because others have already harvested.\n\nAll of this traveling wouldn't be so bad if there were cool things to find in the different biomes, but unfortunately there is nothing that stands out as an exciting find.\n\nOnce you have filled your limited inventory space with mats, you can then use them to level up crafting skills, but in most cases, you farm mats for hours only to level a skill up by a quarter or half a level. This is especially apparent around level 20 for most skills. To make things worse, some materials required to make an items are harder to craft than the items themselves. Poor balancing of crafting makes it a pain. From gathering to crafting, everything is a repetitive grind.\n\nJoining a Clan would make things easier if you are okay with assuming a specific role within the clan, but with the player base dwindling I have heard stories of plot owners of the clan stop playing and all the plots they owned that were used by the clan are then deleted from the map. \n\nThe developers appear to be focused on making PvP a core aspect of the game, but until you can PvP, just leveling your skills is a grind. If PvP is to be the main focus, leveling skills should not be the grind it is now.\n\nWhen it comes to combat, you have 3 skills that are weapon dependent for attacking and 3 that are armor dependent for support skills. You can't remap which keys they are set to, which are Q, R and F for the weapon skills, then 1, 2 and 3 for the armor skills. I can't tell you how many times I press 1, 2 or 3 thinking I'm attacking only to replenish my spirit that didn't need replenishing. That makes me frantically press 4 which I have my weapon on, but if it was already out it puts the weapon away. If you bring it back out, or switch from a bow to the melee weapon, you have a 20 second cooldown to wait through before you can use the weapon skills.\n\nThe enemy NPCs are beyond simple. You can walk up behind them to get a first strike and murder one while another is 4 feet away. As long as their back is turned to you, you can do what you want without them noticing you.\n\nWith all of that being said, this game does have potential, but I think the developers need to take care of main complaints of the community first rather than barreling ahead with new features no one is asking for.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wouldnt recommend it due to the fact you spend most of your hours farming and building which is fun but once you pass that honeymoon phase as someone else called it, it indeed becomes apparant how lacking the game is in fulfilling features. Besides endless farming there is really not much to do or aim for. Game seems to be build on purely copium on what \"Might be\", hopeful for the game but dont recommend it in its current state.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So far my review of this game is it's still in Beta but it seems now they are working on it, it looks beautiful but it is a slog grind fest, paid $100+ to back and support project to then have to pay on release a monthly subscription to be cock blocked by mega clans from being able to use any resource and then be told I'm the nasty one for saying something (politely).",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game has potential but I feel there are more negatives than positives on this one.\n\nPositives (+):\n+ Crafting system is decent\n+ Many different career choices for RPGers\n+ Building system is decent\n\nNegatives (-):\n--- Monthly fee just to keep a tiny plot where you can build, otherwise you get no home! Stop paying and your home will decay, people will be able to loot your stuff.\n- (Opinion) Grinding is far too much , you don't get much wood from each tree, when there are too many players ore and other resources can be hard to find or too far from your home, making skill even more painful to progress (specially crafting ones). Consider that distance can be far, you can't carry much running is not too fast and there are no mounts or carts to carry your wood, ore, etc.\n\nHope this review is constructive to the developers, I'd gladly change it if improvements are made.\n\nOverall the concept of the game has potential.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "UPDATE AGAIN. \nA few things have made the game unplayable, \n- Crafting: WORST THING IN SURVIVAL GAMES EVER. you have a chance to fail a craft and you need to craft dozens of items to level up. this means you spend HOURS failing to craft and getting nothing done for hours. remove the chance to fail a craft PLEASE. \n- Combat: This is ok but the combat makes this game feel more like a 2001 game demo than an action RPG, you just stand and hit and hope the enemy dies before you do. blocking only works sometimes because of server lag sometimes causing the enemy to hit through your shield. Healing is the worst ive seen in a game in a long time. the healer just stands around and does nothing. the healer cant fight anything so you are better off having dps/tanks to burn enemies faster than to bother with healing. and I LOVE healing in games but this healing system is bad. I much prefer if the game adds a dodge/parry system to make combat more interactive, the enemies already show when and how they are going to attack as if the devs planned for a parry/dodge but there isnt one. \n- Potions: smaller problem but one that still bugs me to my core. if you drink any type of potion all others are blocked for about 30 seconds or so. so if you need a fire resist potion you can drink that but you cant heal yourself for another 30 seconds. you are better off drinking the healing making the fire resist potion pointless. this goes for all the others too. why reset your stamina to block more if you cant heal afterwards. \nThese are my top three problems and I hope to see them fixed over time. im tired of spending 5 hours farming just to fail to craft for 30 minutes and have achieved nothing. if you like old style survival games like medevil things. I would recommend, Valheim or Conan Exiles both offer fun worlds to explore and good combat. but for now this game isnt worth the price or the monthly payments to play. keep an eye on it though. it has potential to be one of the greats.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just not satisfied with the role out of the plot system. I thought it was getting extra plots and it was paying to maintain what I already had. Just not interested in paying that much for a game every month. I bought a founders copy for my gf too and i don't want to pay to maintain that many plots. Just not how I am investing my money. The price and what is offered doesn't match up. I am not paying nearly $20 x 2 to kind of cut trees down and kill boars to put the mats in a chest on a plot of land I get to call my own. I think I am done with the genre of gaming in general. Imagine paying monthly to cut trees and crack rocks with no end. I liked the concept of the game but this just isn't it. \n\nI logged in to check out the grace situation for lot rental and I am unimpressed. I had four plots and now I can maybe keep one. I am gonna take a walk and look at the houses one more time and this game is being placed on the uninstall black. Fun-ish while it lasted.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow, what a waste of money. Played before launch and the game ran better than it does now. Janky looking, no amount of adjustment in the settings changes this. I cant uninstall this fast enough and I will think twice about ever buying a game pre launch again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "game has wildly predatory behaviour mechanics to enjoy the game are broken and you will be forced into a paywall if you change servers but not warned about it the game is just bad insane design choices lead to insane wait times good luck to all future players..... at least its pretty",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had my eye on this game for a while whilst it was in early access, and decided to try it out when it had recently been fully released. Suffice it to say, the game is not in a state where I believe it should be classed as any form of a finished product. Poor optimisation, lacking in-game tutorials, progression system that feels complete only when signing up for a membership (I learnt after playing that this was only a recent change to the plot system). Overall, I'd rather play black desert. At least then I'm not paying extra to get the same quality of aboose",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Save your money. They grind is for nothing. There is nothing to do except gather, chop trees and hit rocks. Guilds want you to spend countless hours gathering for the chosen few favorite crafters so they can progress not you. Plus it’s a PAY to WIN game. Save your money!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What can I say? the only thing that changed from EA is window dressing at best.  its a grind fest that doesn't respect the players time and seems designed to just feed new players (Their materials) to the no lifers and full loot PVP has barely started yet! Yikes, I wish you guys the best, what a waste of potential.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don’t understand how the game is supposed to work – for example, for iron I need twice as many resources for just one level as there are on the entire map. Right now I’ve been waiting for over 7 hours for resources to appear. But 4 players can mine all the resources on a map so that I end up with 0. If the game already stops working with 5 players, what’s it going to be like if it’s successful and the “M” in MMO actually counts?",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "game is not even half complete i can say that this company is a scammer at best dont touch this bias",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is gorgeous, but this is pay to win and the pay monthly is crazy. Why not just offer the ability for us to run our own servers. I have to refund this as this goes against everything thaat pc gaming is.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Rng based crafting is a crime against gamers.\n\ni set this evening my goal to make bronze tools, i failed so many easy and moderate crafts that it took me 2 hours to make something that should have taken 20 minutes at most.\n\nafter couple of more hours ive chosen to quit this game, its the most boring shit ive ever played, basically the game is made for large clans, solo youre looking at 200-300 hours of manual labor before you get anywhere or get to do anything fun, just buy conan exiles, it does the same thing but much much better.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "So after playing for around 25 hrs this is what i have:\n\nFirst few hours, i didn't notice that a lot of grinding is necesarry, not until later at around 15hrs where crafting, mining, woodcutting and collecting suddenly seemed like a Job. I didn't buy the game to have a second Job, i did to enjoy and relax, which is not the case here, if you constantly have to think how to efficiently optimize everything to lvl up at a good pace, so you can unlock more stuff.\n\nif i calculated correctly i'd need to cut down 450 trees, that give around 250 exp per tree, to reach lvl 20 woodcutting from lvl 13. Calculated with 2min per tree ( Including movement) it would take me around 15 hrs. before i can start cutting down higher tier Oak tree (better axe required). becouse you're blocked to do so beforehand. Instead i'd use a system where you can use a lower LVL axe, but with a disadvantage... being something like lower dmg to the tree or using a higher amount of stamina per slash, still allowing you too cut down a higher tier tree.\n\nAnd that is probably not the only case.\n\nThey show you these grand houses and settlements, which is not true, not until you've waisted your life on the game. you might probably see that in the Future, where people have allready invested a lot of effort and time but until then, its pure grind.\n\nFor me, every thought i had, changed from being really invested in the game and liking it, to not liking it at all.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is lacking PvP - The players in the game are vile and 2 faced. They will place there plots with you and then rip them up when you don't agree with them leaving a hole in the base/castle.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Graphic is beautiful, but game has no objective, resource cost is too much, getting resource takes awhile and even waiting for resource to craft is long.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad game not worth money.Plus monthly payment for plot.Most of the time just runing,because inventory is limited.No teleports or horses.So takes a lot of time walking.Map is big and nice visualy.Very good chiil music in game.Combat is very bad,mobs just teleport at you and do dmg.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't recommend now for solos. The amount of grind / resource gathering is astonishing. After 33 hours I am still not able to properly create iron tools (maybe I'm just stupid and missed something obvious, but I wasn't really 'chilling').\r\nIf I pick it up again and it starts to make fun, I will adjust the review.\r\n\r\nAlso it could be entirely different as a group (maybe with 4 players the same amount of progress takes only 10 hours, but it is still a lot).\r\n\r\nThe patches were really good and the latest change to make bigger trees easier to harvest was a blessing.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Extremely beautiful game, very fun concept. Unfortunately they put the plots behind a monthly paywall. They are charging roughly the same amount of money per month as a another MMO called World of Warcraft that has thousand of hours of more content. Terrible choices like that are what cause mass amounts of people to leave.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its boring, empty, performs terrible. No npcs, no quests, nothing.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "good idea executed poorly, seems rushed and sloppy",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve been playing for 2 full weeks (over 84 hours), around 6 hours a day. It even shows less game time because I had to modify some startup files just to make the game run, which stopped the time tracker from working.\n\nI’ve had to reinstall or fix the game several times already because of the infinite loading screen. I even left it running for 3 hours once to see if it would load.\nThere are random LAG spikes for no reason and sudden crashes without any warning. In 2 weeks it crashed on me about 10 times, and it froze on the login screen at least twice a day.\n\nYou must really enjoy infinite farming. The progression and learning curve at the start are amazing, but the more you advance, the more it stalls. You end up with a character that’s skilled enough to use much better gear than what you can craft (if you play solo). Playing in a clan feels more balanced, but only if roles are well distributed: 1 cook, 1 armor smith, 1 weapon smith, someone for coal, wine, leather, tailoring, and several gatherers.\nPeople who focus on just one skill tree are basically useless outside of it. If you try to help with other tasks, you end up wasting materials someone else could use for better gear.\n\n\n---\n\nPvP isn’t mandatory, but it is necessary to gather some resources and coins.\n\nThe food system is pretty good: depending on what you eat you get more HP or stamina, and not eating is not really a penalty.\n\nIt never rains. Ever.\n\nThere’s water everywhere but apparently no matter how many houses you build, you can’t tie a few logs together to make a raft.\n\nBeds exist, but you can’t sleep in them. They’re just decoration (even though they could easily give a rested EXP buff).\n\nBy killing around 10 NPCs a day, you can gather enough in 2 weeks to pay the plot.\n\nCoins are basically worthless at this stage. They’re only used for exchanging grace for blessings or paying the 400 for plot upkeep.\n\nIf you play solo, your weapons will break faster than you can gather materials to craft new ones. Make more than one from the start.\n\nBows are useless.\n\n\n\n---\n\nThe environmental interaction system is excellent.\n\nThe game visuals are beautiful.\n\nIf you enjoy slow progression, this one’s for you.\n\nThe building system is very good. You have tons of options to expand your ideas and your territory, whether it’s a 1-plot tower or a 5-plot castle.\n\nPlaying with a clan is way more satisfying and faster. You can do your own thing and still join the others for bigger tasks. (I play as a tank specialized in crowd control to gather aggro in raids, and I work as a gatherer to support the crafting specialists.)\n\n\nI’m quitting the game, not because of the grind — I play with a clan, so it’s not that heavy and I actually enjoy farming. But the amount of bugs is forcing me to stop. For the last 2 days I’ve been trying different ways to log in and nothing works.\n\nMaybe after a big patch the game will be better.\nFor now, this is as far as I go.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "not sure where's my paid plot is gone, is it even allowed/legal to change things after purchase?",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The main hold of this game is a plot system. if you need to store anything in the game from its grinding progression, then S.O.L if you run out of plot points or pay a subscription to regain a plot. Watch as the grace redeem gets further from the current redeem. I think the goal of the game has changed after the release. I hope this game gets better in the future.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Terrible communication, and what they do say is usually 'soon', or in planning.\r\n\r\nThey think the pvp will solve content issues. I don't know any friends who play currently that want to pvp at all. Oh and lets make x resources in the pvp area only so people will be forced to do our content.(#dune.tried.it)\r\n\r\nThey think instead of introducing recycling, just increasing the fail rates, people will be happy.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Purchased, downloaded and refunded in an hour. Read many reviews and there was enough to peak my interest but as soon as I had made a character and logged in it became apparent that there was something dreadfully wrong with the graphics. It appeared blurry and my out of focus character just seemed to float over the out of focus background. Tried all the different video settings and resolutions. Drivers are up to date. Shame but still surprised at the poor quality of this.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is one of the absolute most grind filled games That I have seen in quite a while. The most simple of tasks require so much lateral progression it becomes a non-starter. Example: to make a minor healing potion, I first have to have many skills high enough to open recipes, in virtually every player class. you have to be a carpenter, a miner, a forager, a smelter, a cook, a glass maker, a blacksmith....just to make the easiest healing potion. It is a logistics nightmare. Purposeful grinding to make sure you keep that subscription fee paid each month or lose so much invested.  Worse than WOW, and 20 years too late to be relevant with the subscription model. Pay for the game, then pay to play, and pay more to win. No Thanks!",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Poorly made copy and paste medieval survival craft MMORPG bull. This has no heart and is a failed tech demo. DO NOT waste your time or money for steaming pile of washed out garbage. Developers are crooks of the industtry and should be ashamed and thrown in prison.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is currently in an unplayable state.   Enemies will freeze in place, pop up behind you and attack you.   Tried it out, sad to see it's a flop.   Maybe they'll improve it one day but still needs some time in the oven.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When i play this game, I feel like i'm a girl in a man's world.  Not because I'm getting owned in game; i'm the one doing the owning.  I feel like a girl just for playing the game because its the most estrogen-infused, low-T, insanely uninspired slop that only a girl could enjoy.  And not one of those badass gamer girls owning it up and making youtube shorts.  \n\nIf video games were people, this game would be a part-time walmart employee.\n\nThere is no skill ceiling in this game.  Its not that there is a low skill ceiling or that the skill ceiling is infinitely high...its that there is no vertical dimension of skill.  Everyone's skill exists on a 2-D plane impossible to descend or ascend below or above.  \n\nPlayers just swing on each other...or run away/after all using the same obvious choices for gear.  Combat looks like a bunch of people all grouped up into a ball just swinging through each other, almost like its a spaz contest.  The ones with the best gear win....and you get better gear by leveling up your ability to wear better gear by doing more of the same spaz-ball except against pve....for hours and hours and hours and hours and hours and hours.\n\nall my friends are playing this game, and i'm starting to both think less of them for it...and question if i want to be friends with them any more....not really but it's kinda that bad.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "1.0 was looking sweet, got back in the game! Went hard in the paint too! THEN my buddy was like \"you have to pay for plots\" I said what? Are you messing with me. Buddy said \"Nope\". I then verified this. Damn he was right. I sighed and said to him \"whelp that's it for me\". LOGGED OFF\n\nIf you want me to play this game drop the price to 1 dollar a plot per month. Otherwise you are losing a player for life. Later!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Okay.. in this update you added more ways to get plots based upon money or in game currency. Fine. There are people who play with wallets, so nbd.\n\nBut. Have you addressed how you betrayed every single pre 1.0 player you had? \nPeople who payed up to 100 usd to access 4 plots (advertised as) permanently that you then took from?",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The potential in this game is high and that's why I was a supporter from the get-go.  I realize now that I may have been aboard the hype-train and am seeing what many of us thought the game would be is slipping away more and more.  I'd like to clarify that all of my time played is prior to the release of the new map.  When they moved all of my stuff to the Redeeming queue is when I quit.  I came back to find all of my stuff in that queue was erased and my characters all gone.  Also, the entire system that I bought was redesigned so my purchase was *nearly* worthless.\n\n1.  The goods:\nThe game itself is amazing for open-world survival-craft types if that's your flavor.\nThe building is excellent, the graphics are top-notch.\nThe combat and other systems are still being fleshed out, but it's fairly rewarding to engage in.\n\n2.  The bads:\nI see now that the magic system is tied to a currency (Grace) that is gated behind daily logins or converting gold to it (at an increasing rate each time, resetting daily).\nThe game relies heavily on player interaction, but the players I've interacted with have always been rude and made the game feel toxic and unwelcoming.\nIn my opinion, the developers have created a toxic wasteland and have reinforced it heavily with this monetization. and implementation of systems designed to punish or penalize the player.  Any reasonably sane players have jumped ship.  Anybody left is either ignorant, on copium, or part of the toxic problem.  Timex's comment below of \"exploitative at worst\" feels incredibly accurate.  This game has attracted other exploitative-minded people that are okay with these systems that punish without reward.\n\nI'm going to re-post Timex's comment on the Master's pack as that sums up how I feel about this monetization situation in a neat and concise format.  As of writing this, to maintain 4 plots would cost $18 per month, not the $60 Timex mentions (likely due to a price drop), and also grant the \"premium\" bonus, which is just an increase to the Grace currency and experience you gain.  This Grace currency is designed to gate players and punishes those that aren't active enough.  Nothing player-friendly about it especially since it's used for many things in-game.\n\n\"I paid an extra $60 during early access for the Founder's Pack, which included 4 additional land plots and other perks like more character slots. Now with the 1.0 release, I'm being told I have to spend Plot Tokens (which are consumed monthly) just to obtain or maintain those plots. That means I'm essentially being asked to pay $60 every month for something I already purchased.\n\nThis isn't a change in design or balance, it's a retroactive devaluation of what I paid for. The original value of the Founder's Packs has been gutted. I expected evolving game play, not shifting monetization that undermines early supporters. As it stands, this feels misleading at best and exploitative at worst. I can't recommend supporting this model, company, or game.\"",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "200 hours in the early access, and they decided to reset everything including the character's level. okay bye~!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pax Dei delivers a shallow grind wrapped in subscription fees. The social sandbox is more of a social obligation, the visuals are stunning, but the combat is repetitive and generic, and the gameplay loop collapses under repetition. Unless drastic changes are made, Pax Dei risks being remembered not as a bold MMO experiment, but as another overhyped disappointment.\n\nThat said, the foundation is there. The idea of a living medieval sandbox where community and creativity drive the experience is compelling, and if the developers listen to feedback, refine the systems, and deliver on their promises, Pax Dei could still evolve into something special. For players who enjoy experimenting with new worlds and watching them grow, there’s a chance this game may one day fulfill its ambitious vision.\n\nTo that end, I will give it hope and plan to continue to play the game and give it support. I just hope the developers will correct the ship and make it into something that builds a long standing community.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "nothing to show how to do anything !!!! how do you remove a plot once youve set it??? i guess they want you to pay for more plots!!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Promising game ruined by bad monetization model.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ain't no way you're charging people a box cost and asking for a sub LMAO.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Played for about 4 hours and then returned it. You can gather materials to build or craft. You can sell stuff you craft to other players IF they decide to walk all the way to your location and buy it off of you. you can fight PVE or PVP by left clicking repeatedly. That appears to be absolutely everything you can do in this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game is an unreal engine asset flip from kids who can't develop. game is a buggy mess. unbalanced. and the combat system was done by an intern who also isn't good at what he does and also doesn't care.\r\n\r\nliteral zero game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is good, but there is one absolutely HUGE problem. Perfomance is really bad even on high-end pc on any settings. Event modern \"solutions\" like TSR and FSR are does not solve problem and turn game into blurry mess. Until they fix perfomance problems i can't recommend it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Promising idea - but I'd pass. I got my money's worth trying it out - but after looking at the tiered-subs sold in game, I think short term gains are the goal here. Hopefully I'm wrong.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was fascinated by the building system, and I still think it is among the best in survival games. However, this fascination with multiplayer, taken to the extreme of an MMO, has been as debilitating to this game as it has to many others like it. The game does not leverage a player's participation in the game world's economy; it relies on it. Without a strong player base, this game is just an expensive, grindy, and unrealistic survival builder. \n\nIn my experience, the developers have not attracted the player base needed to populate the bustling, thriving, fantasy world they imagined. What they have created is a dystopian, haunted, lonely landscape where you can eke out a living through the kind of toil and unrewarding efforts we come to games to escape from.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cant say, after reading more reviews, that im excited to play more. i played for a few hours, built a little house, couldnt figure out how to get clothes or a weapon, but i got the axe and cut trees. also annoying to find out you only get 1 land token and as i have learned you can have your house for 30 days; then you need to pay for a membership after to keep using it. thats kinda lame, definitly make me less interested in putting in the time to build anything, since its gone if i dont pay and i already bought the game. logically, it feels like that should be free. im not against buying micros i do it maybe to much but uggh being forced into it cause they take your build is just uggh also tf its not a free game if it was free then ok sure why not",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "An RPG wearing an unconvincing coat labeled 'Sandbox'.\nThis game is a simulator for all the waiting you have to do in crafting. Then, you already buy the game right, so surely there's nothing else to worry about? WRONG.\n\nYou can't even own more than one plot without adding a subscription onto this game even though you've already PAID to play it. There's nothing that can justify just such an obviously scummy move designed not to balance the game as much as it is to stuff more money into the dev's pockets.\nThere's almost 0 quality of life for how you handle moving things from location to location, bases can't be moved once placed down unless you strip it, somehow store every material somewhere then rebuild it from scratch. In a game this insensitive and disrespectful to a player's time (Something people don't have much of anyway nowdays), it's just not a good game to play or even crack your wallet open for.\n\nEven at 5 hours my eyes are wide open to the kind of monetisation hell they'll be setting up in the future. If I could get a refund, I would.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is Actually fun, but devs need fix crafting, and game crashing a lot. I start creating items go away than come back, and it was stuck...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The graphics are great and the sound design is excellent, but the game still feels very unfinished. There are many basic features missing, like inventory weight. Grass and terrain often clip through player-built structures, and the character movement feels rough — almost like Dark Souls, but without a proper dodge roll.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}