{
  "positive": [
    {
      "review": "Marvel Snap lets you build totally broken combos to get 100x the power you should, but keeps it balanced with good counterplay, and because the most broken combos are unreliable.  This game is a paradise for dreamers.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I mostly play it on my phone but, the desktop version is a refreshing experience.\n\nMarvel Snap is a fast, stylish card battler that mixes classic Marvel characters with clever strategy. You build a deck of 12 cards, each representing a hero or villain, with different energy costs, power levels, and special abilities. Matches are quick, typically around six rounds, and the surprise comes from the locations, each game has three different places that are revealed one by one, each with its own unique effect or rule.\n\nThe “Snap” mechanic adds a lot of tension. At any point, you can double the stakes, forcing your opponent to either back out or accept the gamble. This risk-versus-reward system makes every match feel meaningful, and even a small misstep can completely turn the tide.\n\nDespite the approachable appearance, there’s real depth in deck building and strategy. The game rewards creativity: you can create very different decks on reveal, destruction, discard, etc. and must adapt based on the locations that appear each match. The balance is mostly solid, though some newer or season-pass cards can dominate the meta.\n\nProgression in Marvel Snap comes through a collector-level system and a battle-pass style progression. Cards are earned rather than purchased in traditional packs, and while cosmetic upgrades are available, they don’t affect power. However, progression can feel slow, especially for players seeking meta-relevant cards without spending money.\n\nThe presentation is polished, with dynamic card artwork, animations, and effects. Matches are short and intuitive, making it easy to pick up even for players new to card games. The game is available on both mobile and PC, which adds flexibility for playing anywhere.\n\nThe main drawbacks include the slow card-earning system, occasional matchmaking frustrations, and some technical issues like crashes or glitches on PC. While it’s not strictly pay-to-win, there is a sense that spending money can accelerate progress, which may frustrate some players.\n\nOverall, Marvel Snap is one of the most refreshing digital card games available. It’s fast, strategic, and wonderfully polished, with the Snap mechanic adding a unique tension to every match. The deck-building is meaningful, and the Marvel theme is a major draw. It has some flaws, especially in progression and technical polish, but for card game fans and Marvel enthusiasts, it’s definitely worth checking out.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great casual game. Play for 5 minutes, or an hour. Play for free, or invest.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a great game, loads of fun to play and fast! It also actually helps me learn to stack triggers better for playing Magic the Gathering.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dont understand the hate, very good game, not pay to win at all, many free to play cards can counter everything in the meta, so you can climb even without the new shinie card and the token system is quite good, no more gacha style collection.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addictive and smart card games. Easy to start, hard to master, love the fast rounds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game.. wish i played sooner! i guess im not as jaded as people who have played from the start lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played and had fun for at least 57 hours not requiring purchase. Buggy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, takes strategy, recommend for card gamers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is decent and interesting card game. The issue is that sometimes stucks at 85 percent on loading screen and happends usually on PC rather than mobile version,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After almost 300 hrs on this game it is clearly something I enjoy daily, also easy to take break and come back to!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was a consistent hearthstone player and then it got repetitive and pay to win. This game, so far, has been new player friendly and with the upcoming beginner decks should even become more so.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Marvel Snap is a very addicting and not money throwing pressure card game. Cannot stop playing it for more than two years",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The thrill of building synergies and coming up with new combos as you get new cards is really right up my alley. Getting new cards does become a little bit of a grind later on but there is still lots of fun to be had. I've played for free for 99.99% of my time only getting the Premium Pass recently for the Punk Spiderman season and only after reaching a high enough level in the pass to make sure I get value. \n\nThe gameplay with all the special effects and animations especially on desktop is really great and even after about 358 hours I'm still having so much fun and figuring out cool combos and deck builds",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the snap mechanic, great card game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "as with any game, plenty of good and bad. thankfully, some of the bad stuff you can do to other players, so that's fun. RAHHHHHH GET ADDICTED LIKE ME AHAHAHAHA",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remember to login with an associated account, or else your data will be lost. But, still a fun game nonethless!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Melhor Card game da decada inovador e feito principalmente pra geração nova ai que n aguento fica mais de 10 minutos fazendo alguma coisa focada",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mostly play it on my phone but, the desktop version is a refreshing experience.\r\n\r\nMarvel Snap is a fast, stylish card battler that mixes classic Marvel characters with clever strategy. You build a deck of 12 cards, each representing a hero or villain, with different energy costs, power levels, and special abilities. Matches are quick, typically around six rounds, and the surprise comes from the locations, each game has three different places that are revealed one by one, each with its own unique effect or rule.\r\n\r\nThe “Snap” mechanic adds a lot of tension. At any point, you can double the stakes, forcing your opponent to either back out or accept the gamble. This risk-versus-reward system makes every match feel meaningful, and even a small misstep can completely turn the tide.\r\n\r\nDespite the approachable appearance, there’s real depth in deck building and strategy. The game rewards creativity: you can create very different decks on reveal, destruction, discard, etc. and must adapt based on the locations that appear each match. The balance is mostly solid, though some newer or season-pass cards can dominate the meta.\r\n\r\nProgression in Marvel Snap comes through a collector-level system and a battle-pass style progression. Cards are earned rather than purchased in traditional packs, and while cosmetic upgrades are available, they don’t affect power. However, progression can feel slow, especially for players seeking meta-relevant cards without spending money.\r\n\r\nThe presentation is polished, with dynamic card artwork, animations, and effects. Matches are short and intuitive, making it easy to pick up even for players new to card games. The game is available on both mobile and PC, which adds flexibility for playing anywhere.\r\n\r\nThe main drawbacks include the slow card-earning system, occasional matchmaking frustrations, and some technical issues like crashes or glitches on PC. While it’s not strictly pay-to-win, there is a sense that spending money can accelerate progress, which may frustrate some players.\r\n\r\nOverall, Marvel Snap is one of the most refreshing digital card games available. It’s fast, strategic, and wonderfully polished, with the Snap mechanic adding a unique tension to every match. The deck-building is meaningful, and the Marvel theme is a major draw. It has some flaws, especially in progression and technical polish, but for card game fans and Marvel enthusiasts, it’s definitely worth checking out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this a good bit on the phone. Fun, easy to get into, and lots to do. give it a try if you like card games, and dont wanna sink a ton of time into learning a new one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fastest ccg great cosmetics.  unfortunately not accessible for blind gamers :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This, personally, is my favorite deck building game. However, I quit a couple months ago, following repeated drama surrounding the developer's treatment of the playerbase, making it increasingly pay to win. However, I've been keeping track of their updates, and over time they have made repeated improvements to F2P players, and closing the gap between payers and free players down to only cosmetics once again. And I am so glad to be back on this game again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is fun and can get you playing for hours straight. It is a very polished and engaging system.\nThe problem is everything behind: prizes are too high, some cards are locked after hours of grinding, and the matchmaking makes little sense most of the time.\nStill giving a \"like\" cause I liked the game, but I stopped playing because it was taking too much time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, i stay away from all the paid content as they are always pushing that stuff. I have been playing since day one and during the first year i use to buy the monthly premium pass but stop after they got very aggressive and changed how you get items etc. Its a fun game and recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its definitely a grind for new players to get cards but one you get past that initial grind, you'll find that the game is very chill. Don't listen to the people in the comments yelling about the game being \"pay to win\" the truth is that, after about 5 hours, you will have more than enough cards to create a deck that can beat any \"pay to win\" deck. Newly released cards are really the only thing locked behind a paywall but you don't need them to succeed in matches. I'm normally the first person to critique a game that is pay to win and there are definitely some elements that give players with deep pockets the upper hand early on in the game. However, if you are 100+hrs into the game and still blaming your losing streak on the game being \"pay to win\", it might genuinely be a skill issue. Personally, I haven't spent a dime on this game and I've never struggled against \"pay to win\" players. \n\nIn short: the game is easy to learn, it's a bit of a grind for new players, there are some small pay to win aspects but most matches come down to strategy and skill, and its  a chill game that doesn't demand much outside those first couple of hours of grinding.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has kept my interest by the interesting gameplay mechanics of the cards for almost 3 years. The only other games to do that were Fortnite and Apex Legends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's fun once you get into it, the changing locations and wide variety of archetypes to play around with makes it a pretty fun game where unexpected and new interactions occur all the time, even with nearly 200 hours in. \r\n\r\nThat being said however, be warned, this game is NOT f2p friendly.\r\n\r\n It takes a long time to build your collection up to a point where you can consistently try and build new archetypes. There will be many games where you lose simply because you do not have the series 4 or 5 cards the enemy player does. Minor things like skipping seasons, events, etc. will cause you to lose out on strong cards, and it can be very frustrating. Card acquisition has gotten better, but I still think it's current state is pretty terrible all things considered. \r\n\r\nIt's still a fun game all things considered, I think your mileage will vary with your patience, and your willingness to buy a season pass every now and again. If that's not something your against, there's a lot to enjoy here. I probably wouldn't recommend it otherwise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I tentatively recommend this game as it is by far the most fun and accesible card game there is. It is incredibly intuative, always being worked on, and what's most important, really quite fun. However, the monetization is also the greediest (and I mean, diabolical levels of greediness) I have ever encountered in a game. That being said, it is not hard to enjoy the game without spending money but it can sometimes be quite discouraging to encounter OP cards that you have little chance of getting because they're stuck behind a paywall.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great CCG at first, the power levels of cards feel fair mostly but you either grind it to get series 5 cards or pay for them. I would say play it for fun but at some point to go competitive you have to put hundreds of hours. Personally fun experience but I don't think I will be coming back to the game anytime soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun time waste.  Nice collection variety.  You can get most of the cards just by playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is just the best card game. The monetization system is very fair as well, but there's a significant time gate to actually getting into the game and getting competitive, but once you're good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and innovated TCG, but just watch out on swiping the credit card on the bundle loll",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool card game can get creative tbf",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i play this game on mobile and had to try it on Pc i like it more on Pc the graphics a really good and game play stays the same !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the deck building, the art and the frequent updates always keeping it fresh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun but meta makes you buy season passes to keep up unless you've played for long enough to have a lot of things if your new you'll probably wanna buy the current pass but otherwise just have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game. wish i had better cards though i always get whooped by cards that make me hate pay 2 win",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Click click and click",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "full of personality fun and innovative fast action",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's kind of annoying and progress feels slow at times. You need to dedicate your life to this I feel like sometimes to get much progress. Some more info:\n\nThe matches are fun, but some decks are like very typical that everybody gets and it's really hard to get the unique powerful cards without money. The strategy is fun, and if anything its worth for the first few hours and later hours of the game. The system is by getting this currency from quests and battle passes (Which of course, are a lot better if you pay money) It's still a fun card game, and I recommend it. How the hell do I have so many hours in this?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The balancing and monetization have their ups and down but overall it's a still a fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Snap is another card based game. It's fun though and I enjoy time while I'm playing it, either for a quick game or two or grinding to Infinite Tier",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 192 hours in this! Why? Well guess I must be enjoying it enough. Never paid a penny so err I guess give it a shot. I have no idea. I just look up beginner decks and have unlocked pools 1-3 and game seems fairly generous with events and extra collectors tokens to get more cards.\r\n\r\nWill you ever compete with wales and sweats? No but that's ever F2P game. Games only take a few minutes so you have nothing to lose trying it out.\r\n\r\nPros\r\n- Quick matches\r\n- Card designs are mostly solid\r\n- Can still build a half decent deck after getting pool one which doesn't take long.\r\n- \r\n\r\nCons\r\n- Usual F2P economy.\r\n- Cool variants will take ages to get or you'll have to pay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Among the most unique and fun card games out right now, and offers a vast amount of options for deckbuilding/brewing your own setups. \n\nThe economy is actually very good as well after their big rework. It's pretty easy to f2p get specific cards you want for the decks you want to build, unless you want all the cards for all the decks, then it gets to be very expensive. If you're like me and you have pet decks or pet archetypes you like to mess around with, you can keep them updated without much difficulty.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Generally very fun, one of the better mobile games I've played. Not P2W at all, but can be kinda grindy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Super heroes and/or card games are what you are into, you will probably like this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's more of a mixed/neutral review than a positive one.\n\nPros: Great art. Very fast games with unique gameplay. Each match feels different. No rotation. Only 12 cards per deck, only 1 copy ever needed.\n\nCons:  Dailies can be a pain (i.e win 4 games) and they appear too often with no way to reroll them. Incredibly slow start (cl550 as of writing this review), don’t know if it gets better, heard it doesn’t. Incredibly grindy with a huge amount of monetization. No alt gamemodes. No reason to play matches except for dailies.\n\nDefinitely one of the better online tcgs out there but still leaves a lot to be desired, particularly long-term.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game but you can definitely tell that progression is super slow if you don't want to drop money but it's a fun fast paced game nonetheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its not p2w as most card games are.. HOWEVER..  Will still cost a fortune to collect the entire set as they are presented.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "para meterle unas buenas horas esta piola ,no recomiendo ponerle guita",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In terms of finances, Ben Brode is by far my #1 Opp.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just as good as Magic the Gathering",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game it’s really fun and I recommend this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quick games. All your favourite Marvel characters. Fairly F2P friendly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game if you're board!! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brode, nerf bots please",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hol up why are card games actually good?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not just your typical card game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty fun to play  to pass the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a relaxing strategy type game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool and fun card game!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big beautiful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good! Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fast, short games. Frequent updates, fun combos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "itsz good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "She Marvel on my cards till ' I Snap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best card game in recent years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best digital TCG ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greet time keeper",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always evolving, always fun !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "moved from hearthstone to here, haven't regretted it so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great casual game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT FUN AND CHILL GAME>>>>>>>>>>>>>",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best card games ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game freak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun as a bih",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So tuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love snapping on turn 6",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i luv marvel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "POW CABUM",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mahvel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ntaps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "snap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Really cool for it's first couple years, but man did this game fall off hard. The monetization is shameless and greedy. I'm all for the company making a fat bag off this game, but I certainly don't think single cards should be as expensive as they are.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This game has become a waste of time and you'll have to pay to win. I've played 1000 plus and it is has become harder and harder each season with new cards locked behind pay walls. This game will put you on uneven matchmaking a well I have spent the last week losing to pay to win cards. uninstalling game until this is fixed. pay to win has become a big problem with this game. I do not and will not recommend with the game in its current pay to win state.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "It's so sad because I really like this game a lot, the gameplay is really fun, I love card games, I love Marvel, but the game is completely ruined by the most aggressive and insidious monetization. I recently came back after getting a new phone and spent a few days being enthralled before realizing all the reasons I stopped playing before.\n\nYou can play for a week and not get a single card and that's just not fun at all. And you NEED new cards to progress because it works you up a ladder and after the first few months the game becomes impossible for you to get any more wins against the opponents it pits you against. Losing repeatedly is NOT fun and winning or losing is the only way to get crypto currencies so you can progress. You get points to increase your cards whether you win or lose but who the heck wants to lose 30 matches to make a card level up just at the chance of being able to get a card that might be helpful but isn't even sure to turn your losing record around.\n\nPlayers CONSTANTLY leave matches, instead of playing through the round they just LEAVE which makes it even more annoying. If you get close to winning on turn 4 they will just leave. If you take a second too long to take your turn, they will just leave. It's also hard to tell if you are playing actual people or bots because I swear I've played the same person repeatedly and they always have the same cards and general actions, and they don't even make sense. The gameplay is really fun, but they've shoved it into a PvP format which makes it hard to be strategic and think through moves. There should be a PvE specific mode where you aren't timed each turn.\n\nNow, I wouldn't be opposed to spending money on the game but they want $99 for just ONE card and a few of its accessories. That is absurd. I would pay $9 for a PACK of cards in other games.  So I would recommend the game if it was not so aggressively monetized, but as it is in its current state, it is a confusing mess of crypto currencies meant that even if you spend money you have to decipher what specific currency you need and it's purposefully confusing. A typical game should cost $70, if you spent that much you should have pretty much everything in the game, in my opinion. \n\nThis all makes the game less enjoyable. It's sad. Maybe when it dies people will be able to play it for free or on a private server.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Fun & unique game with probably the most interesting card customization of a VCG that I've seen.  That being said, I'd only recommend this game for the first ~400 collection levels (first month of playing). You get plenty of cards and you don't feel the crippling weight of the games' pricy economy in that period. \n\nOne of the negatives is that the game is expensive. If you want every card, which granted, you don't need every card but you have little control over what cards you get as a new player as you have to play catch-up VIA the snap packs. For example, if you want to play the Move archetype, you NEED Madame Web (a 2-cost, 1-power card that moved 1 character of your choosing away from its location). If you are new, you'll have to either:\n A) hope it rotates into the series 5 slot of the token shop, which is less than 1% chance if you have 0 Series 5 cards, and still have to pay the premium price of 6k tokens (which takes about 2 weeks to earn) or \nB) pull it from the Collector's Series 5 pack for 4k tokens, which is also less than 1%.\n\nAnother negative of the game is that it has bugs and other technical issues on a semi-frequent basis, which at best are mildly inconvenient and at worst could affect the meta. On release, Madame Web had a bug(?) where if you had 2 of them face-up in play, trying to move 2 different characters on your turn would close your client, forcing you to re-connect. To my knowledge, there was no way to prevent this. This affected the metagame a bit, as the best deck in the game at the time (Bounce Move) had its high roll potential neutered. This issue, granted, was a good thing in the context of the metagame, BUT if you are an individual that really liked playing Bounce Move, this was incredibly frustrating to have to be aware of and play around.\n\nThe last negative is that the game has every single engagement tactic dialed up to 100, which is really annoying in of itself, but gets compounded by the games’ terrible economy and pricing. Logging in every 8 hours for 25 credits, the best deal for gold being the monthly gold pass (which requires a daily login to redeem), pop-ups on login for limited time deals that are almost up, limited time events that’ll require you to play every 16 hours (Sanctum Showdown November 2025 as an example), or every 8 hours (High Voltage Overdrive June 2025). It comes off as extremely desperate, as if the player is going to quit because the gameplay sucks, and not because the game is priced towards in-denial gambling addicts.\n\nIn conclusion, I recommend this game only for the first month or so, anything beyond that should require the understanding that the games is priced for whales, and that if you do not want to whale but want to keep playing, you will have to stretch every resource to its max, engage with third-party systems to make sure you don’t buy a bad card, and mostly neglect the card customization aspect of the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dear devs. Stop changing the cards so much. Everytime I take a break from this game all my decks are useless. Unless you commit to this game like a full time job do not play it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game itself (on mobile and tablet) is good. There are some annoyances with how they want to make money but that's how these F2P games go, overall still a fun game and I recommend it.\r\n\r\nThe reason for my not recommendation is for the desktop application. It's been broken for MONTHS by getting stuck at the loading screen and no amount of re-installing, file verification, or total delete from the file system works. And I'm not alone in this problem.\r\n\r\nAt this point I consider the desktop application all but abandoned and will just keep playing on mobile and tablet.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I’ve been playing Marvel Snap since day one, and the game has changed a lot over time. Unfortunately, most of those changes haven’t been for the better. It’s now packed with in-game purchases, and I slowly lost interest—especially because the new cards are basically locked behind the season pass. If you want to keep up, you’re almost forced to buy the battle pass every month.\n-\nTo be fair, there are some good things left: the collector’s tokens and the dedicated shop where you can pick up specific cards are still solid features. But overall, with all these negative shifts, I eventually dropped the game.\n-\nOf course, this is just my personal opinion. If these issues don’t bother you, you can absolutely still enjoy Marvel Snap. But for me, the push toward constant spending took away the fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The core game engine is pretty interesting and enjoyable, and honestly just for that fact I will hop on to kill time every once and a while. However, if you're looking for a sandbox to play with Marvel Snap CARDS, this isn't for you. Monetization and card acquisition on this game is genuinely horrifying. If you don't mind playing the game for the sake of playing the game then go for it, but don't expect to build any specific deck on a fresh account.... ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun casual and fast game play. Bots need to be nerfed. Need better card acquisition for new players. Bring back series drops. Shop is too expensive. Bundle values for gold are horrible. The best card in this game is the credit card.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is pay to win and not 10-20$ to win here and there but more like 50-100$ every month to win. I am no stranger to buying DLCs but those price truly baffles me! It's a good game but it's not worth it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is extremely hard to be competitive when starting from scratch with no investment — but it’s not impossible. The key is understanding what kind of competitiveness we’re talking about and what advantages you can leverage even without paying upfront. \r\n\r\n1. Time\r\nIf you don’t have money, you need to invest more time learning, improving, testing, and iterating.\r\nThis is the classic “sweat equity” route.\r\n\r\n2. Skill\r\nIf you develop a skill that others pay for — writing, coding, design, marketing, editing, automation — you can leapfrog people who started earlier but lack skill.\r\n\r\n3. Niche focus\r\nPeople fail because they try to compete broadly.\r\nIf you specialize in a very specific niche, even without money, you can outperform bigger players.\r\n\r\n4. Consistency\r\nMost people quit.\r\nIf you simply continue for 6–12 months, you beat 90% of beginners.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Archetypes are incredibly narrow and leads to pretty much no room in interesting deck building. \r\n\r\nNew cards are gated behind money or good luck. Wanna specific card to try building around a certain strategy? Too bad pay up or hope to pull it in a pack. This system is actually BETTER than what came before it.\r\n\r\nSome cards are flavorful. Many aren't. \r\n\r\nBecause every game is poker, you end up not even playing through most of your matches. This is the antithesis of being a GAME. I want to play cards not bet cubes. \r\n\r\nRNG is a HEAVY part of this game's gameplay. \r\n\r\nNot knowing every card and every deck and its playlines puts you at a huge disadvantage. \r\n\r\nI probably only stuck this long because I love card games and I love Marvel. \r\n\r\nAt least cosmetics come at a decent pace, I'd rather have cards to play with though.\r\n\r\nNot sure what else to say, I just wish I had fun playing this game, reminds me of when I used to play destiny. I played and played out of sunk cost I guess? At least it passed the time I suppose",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was addicted to this game for a while, but the time I put in after awhile was no longer rewarded and they started super leaning into getting you to spend money to have any enjoyment - so I peaced out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Progression is fine up on till you need to start 4/5 rank cards you hit a wall hard.\nthen they deploy the fomo and hard gacha so full gamble mode.\nThe game it self is ok but stay away on till they implement i less predetory system again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game on mobile since its release but this game has become an ABSOLUTE MESS!!!\n\n1. The Card Collection area is so different compared to 3 years ago, all the variants were all in one card and not out and about like it is nowadays.\n\n2. WHO TF ASKED FOR CARD MASTERY, I opened the game and there is so much of that bullshit on top of each card and it's pissing me off.\n\n3. When this game came out I knew it was paid to win and now IT'S PAID TO WIN, I don't know who is paying €100 on a bundle of 2 cards, some gold and tokens and 2 avatars.\n\n4. The Events are just absolute garbage, the game went from a simple card collecting battle game to CLUNKY, GIVE YOUR KIDNEY TO WIN OF A MESS GAME.\n\nThey ruined it and there is no hope for it anymore.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Initially was a blast to play but as more time passed it has become harder and harder for new players to actually compete. Very hard to acquire new cards with steep prices. No way to just straight buy an entire deck or the cards you need. Toxic meta you are forced to play if you want to win and has just become not fun to play. I want this game to do well but the FOMO is pushed in your face constantly. (For reference, I achieved infinite in every season I played)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's a good concept, but man is the AI/CPU cheating in effect. The CPU knows what you put down even when it's not supposed to. The CPU will enable/disable effects so it can win. It's pretty bad. I wouldn't spend money on it as a result. if you want to play just to enjoy the card types that's fine, but I wouldn't expect more than that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play the hell outta this.\n\nI cannot recommend it anymore. I'm going to sum this up as quickly as I can because this game doesn't even deserve an in-depth review.\n\nScumbag devs. Blatant pay-to-win BS. Damn near zero variety in the gameplay anymore. It's awful. Do not give it your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do you like playing against the same 3 decks over and over? then this is the game for you.\nThe prices in the shop are beyond ridiculous\nOver the course of last about 2 years they have added many new power types for cards but, they haven't added any new filters to the card selection screen to make them easier to find only the original filters exist and worse still they removed the ability to hide variants so enjoy scrolling through 7 version of every card.\nIt is really difficult but not impossible to have a competitive deck with out spending money.  \nConquest game mode was added about 2 or so years ago and has been untouched since. Every one i know has long since stopped playing that mode.\nThey have added a few limited time game modes that come back pretty frequently i am already find them tired.\nhonestly i consider quitting this game almost every time i play it. i quit for about a year once already.\nif you are wondering my play time is inflated by me minimizing is and forgetting about it pretty often.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hello, I've been playing this game for almost 3 years and in these 3 years of marvel snap I can only tell you that it is a game that manipulates each match so that you don't win more cubes per day than is set and when you exceed the limit you are prone to losing 99% of it, the game is very monetized if you don't invest monthly funds you can't keep up with the series of new cards, certain packs are designed toxic just so that some players benefit because they bought every card in the game. I don't recommend it! It's a buy to win game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The fact that anyone still plays this trash is proof that gamers are complete morons with worthless opinions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Greedy monetization and overpowered combo decks sap the fun fast. It becomes less about strategy and more about tolerating the shop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even if the monetization aspect is poor, the bugs are inexcusable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Been playing since the game launched in October 2022.  Game was fun and enjoyable for even the F2P players, but they have just monitized the game and made it not fun.  The game has had META that have dominated for the good majority of the games life cycle and just isn't fun playing against the same deck type over and over again.  When you get matched against a CPU/Bot player, they just seem to cheat and have counters for every card you play.  Originally played it as one of my two mobile games, but haven't touched it in about a month and found I don't miss the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its nothing more then an actual card game it sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rng sim, want to get rng raped constantly? this is your game!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Haven't met a single human player.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just bad slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is still bugged. 11-8-25",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dog shit money grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pay 2 win",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Marvel Snap has an appealing presentation and a unique, fast-paced format that makes it easy to pick up and play. However, after spending a significant amount of time with it, several issues become hard to ignore:\r\n\r\nHeavy Monetization: Progression is slow unless you're willing to spend money regularly. New and powerful cards are often locked behind paywalls or time-gated systems, creating a noticeable gap between paying players and free-to-play users.\r\n\r\nAddictive Design: The game leans heavily into addictive mechanics rather than meaningful long-term engagement. Daily missions and reward tracks are designed to keep you logging in, even when the gameplay starts to feel stale.\r\n\r\nStale/Toxic Meta: Certain deck types dominate the ladder for extended periods, often relying on frustrating mechanics that reduce counterplay and variety. Innovation is limited by how slowly non-paying players can access new cards.\r\n\r\nCommunity Issues: Discussions around balance and monetization are often polarized, with critical feedback sometimes dismissed or downvoted. This makes it harder for constructive dialogue to take place.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Really cool for it's first couple years, but man did this game fall off hard. The monetization is shameless and greedy. I'm all for the company making a fat bag off this game, but I certainly don't think single cards should be as expensive as they are.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Its pay to win. Non stop new cards, meta always around the new cards. Sh!t game",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "This game has become a waste of time and you'll have to pay to win. I've played 1000 plus and it is has become harder and harder each season with new cards locked behind pay walls. This game will put you on uneven matchmaking a well I have spent the last week losing to pay to win cards. uninstalling game until this is fixed. pay to win has become a big problem with this game. I do not and will not recommend with the game in its current pay to win state.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Such a pay to win game, card acquisition system is trash. I used to like this game in the first year but now it's fallen off",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "It's so sad because I really like this game a lot, the gameplay is really fun, I love card games, I love Marvel, but the game is completely ruined by the most aggressive and insidious monetization. I recently came back after getting a new phone and spent a few days being enthralled before realizing all the reasons I stopped playing before.\n\nYou can play for a week and not get a single card and that's just not fun at all. And you NEED new cards to progress because it works you up a ladder and after the first few months the game becomes impossible for you to get any more wins against the opponents it pits you against. Losing repeatedly is NOT fun and winning or losing is the only way to get crypto currencies so you can progress. You get points to increase your cards whether you win or lose but who the heck wants to lose 30 matches to make a card level up just at the chance of being able to get a card that might be helpful but isn't even sure to turn your losing record around.\n\nPlayers CONSTANTLY leave matches, instead of playing through the round they just LEAVE which makes it even more annoying. If you get close to winning on turn 4 they will just leave. If you take a second too long to take your turn, they will just leave. It's also hard to tell if you are playing actual people or bots because I swear I've played the same person repeatedly and they always have the same cards and general actions, and they don't even make sense. The gameplay is really fun, but they've shoved it into a PvP format which makes it hard to be strategic and think through moves. There should be a PvE specific mode where you aren't timed each turn.\n\nNow, I wouldn't be opposed to spending money on the game but they want $99 for just ONE card and a few of its accessories. That is absurd. I would pay $9 for a PACK of cards in other games.  So I would recommend the game if it was not so aggressively monetized, but as it is in its current state, it is a confusing mess of crypto currencies meant that even if you spend money you have to decipher what specific currency you need and it's purposefully confusing. A typical game should cost $70, if you spent that much you should have pretty much everything in the game, in my opinion. \n\nThis all makes the game less enjoyable. It's sad. Maybe when it dies people will be able to play it for free or on a private server.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Greedy company went independent only to triple down on fucked monetization.... absolute waste of good core gameplay, play literally any other card game this aint it",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game is quite frustrating once you get to Ranked Level  70+ because it feels like you get matched with a person that has the exact counter to the deck you have 80% of the time. Also, some of the cards are totally unfair like \"Gladiator\". Only enjoyable until you get to Ranked Level 70+. This game is enjoyable for unranked people imo.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I have played this game since 2023, since I am a Marvel fan, but I am getting tired now.\n\nIn the early days, collecting cards without spending money, I could still beat friends who had the season pass. At that time, the cards are still quite balanced for people who are not willing to spend money to play, and collecting card variants is really interesting and exciting in this game. I still remember losing to my newbie friend in this game because I didn't have enough power to beat The Hulk. The Hulk is totally free, and you can get it when you start to play this game.\n\nSince the game becomes more and more expensive, I am losing interest in it. Now the game can get a lot of different variants with a few methods, but these don't attract me anymore since the methods of getting variants are quite repetitive. My High Evo, Loki, and Hope Summer, Nimrod are my collection keepers now, which are previous season main cards, and those cards, I didn't spend any money to get them, I just bought them with tokens (except Hope Summer, I used keys to get it, that time the new mode for collection vault to collect new Series 4 and Series 5 cards, now giving 3000 tokens). Without spending money, my tokens can't sustain me to get new cards and buy a valuable bundle with gold. Now the bundle is also getting expensive. The price of the bundle is ridiculous. You can buy a lot of great games from Steam for that price.\n\nAbout the season pass, I forgot which season I started buying a season pass. Previously, a normal season pass was enough to get new cards to play. Sometimes the season pass card is not even useful to play compared to the weekly new cards. Things have changed nowadays. Now I need to buy every season pass (must be a super premium pass, a normal pass is not enough to follow the meta).\n\nI missed those days like Shuri (sometimes still can be seen, but not often), The Hulk without High Evo skill, Bishop, Mysterio, Daredevil, Hawkeye, etc. are can still be seen everywhere in this game.\n\nI think I am considering quitting this game after this Spider Punk season, and saving my money for new interesting games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Fun & unique game with probably the most interesting card customization of a VCG that I've seen.  That being said, I'd only recommend this game for the first ~400 collection levels (first month of playing). You get plenty of cards and you don't feel the crippling weight of the games' pricy economy in that period. \n\nOne of the negatives is that the game is expensive. If you want every card, which granted, you don't need every card but you have little control over what cards you get as a new player as you have to play catch-up VIA the snap packs. For example, if you want to play the Move archetype, you NEED Madame Web (a 2-cost, 1-power card that moved 1 character of your choosing away from its location). If you are new, you'll have to either:\n A) hope it rotates into the series 5 slot of the token shop, which is less than 1% chance if you have 0 Series 5 cards, and still have to pay the premium price of 6k tokens (which takes about 2 weeks to earn) or \nB) pull it from the Collector's Series 5 pack for 4k tokens, which is also less than 1%.\n\nAnother negative of the game is that it has bugs and other technical issues on a semi-frequent basis, which at best are mildly inconvenient and at worst could affect the meta. On release, Madame Web had a bug(?) where if you had 2 of them face-up in play, trying to move 2 different characters on your turn would close your client, forcing you to re-connect. To my knowledge, there was no way to prevent this. This affected the metagame a bit, as the best deck in the game at the time (Bounce Move) had its high roll potential neutered. This issue, granted, was a good thing in the context of the metagame, BUT if you are an individual that really liked playing Bounce Move, this was incredibly frustrating to have to be aware of and play around.\n\nThe last negative is that the game has every single engagement tactic dialed up to 100, which is really annoying in of itself, but gets compounded by the games’ terrible economy and pricing. Logging in every 8 hours for 25 credits, the best deal for gold being the monthly gold pass (which requires a daily login to redeem), pop-ups on login for limited time deals that are almost up, limited time events that’ll require you to play every 16 hours (Sanctum Showdown November 2025 as an example), or every 8 hours (High Voltage Overdrive June 2025). It comes off as extremely desperate, as if the player is going to quit because the gameplay sucks, and not because the game is priced towards in-denial gambling addicts.\n\nIn conclusion, I recommend this game only for the first month or so, anything beyond that should require the understanding that the games is priced for whales, and that if you do not want to whale but want to keep playing, you will have to stretch every resource to its max, engage with third-party systems to make sure you don’t buy a bad card, and mostly neglect the card customization aspect of the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dear devs. Stop changing the cards so much. Everytime I take a break from this game all my decks are useless. Unless you commit to this game like a full time job do not play it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game itself (on mobile and tablet) is good. There are some annoyances with how they want to make money but that's how these F2P games go, overall still a fun game and I recommend it.\r\n\r\nThe reason for my not recommendation is for the desktop application. It's been broken for MONTHS by getting stuck at the loading screen and no amount of re-installing, file verification, or total delete from the file system works. And I'm not alone in this problem.\r\n\r\nAt this point I consider the desktop application all but abandoned and will just keep playing on mobile and tablet.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game was so fun since launch. Fast forward to now. It just got too repetitive. Its a micro transaction here and there. I think I spent more money per month to keep up with the new cards plus the monthly passes. I had to stop. I don't see many players playing different decks. Its meta now. What's hot. I love the alliance idea. You get to contribute to your clan and gain tons of rewards. I had a hard time getting an infinity border. it was too hard. The special events are like released once every 3 months. I had to buy micro transaction just to get by special events as well. I give a rating 4/10 or 2/5.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Don't let my hours played on steam fool you. I have been playing this game on my phone too. And with all that time spent on this game I can tell you to not play this game. It has potential. Great gameplay but the devs greed is far too great. They have ruined this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Complete and utter money grab. The game itself is fun, but you won't be able to compete unless you drop hundreds.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Awful predatory micro-transactions that makes this unplayable, which is a shame because the initial idea behind it is really good and i love the \"quick\" play of this format.\r\n\r\nSuch a shame greed won again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a money pit. Though they have made strides at making cards much more accessible than when the game first launched, Just trying to build 1 meta deck that can be remotely competitive is a frustrating grind or will require a months salary. I like the idea of the game but the endless power creep, gotcha mechanics, and multi currency system makes the game feel unrewarding to play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolute dog shiiit game with dog shiiit customer support. I have put $100's into a free to play game to support there development team. Not because I have to, but because this was a game I was passionate about for a good amount of time. Over a year of daily play on both steam and mobile. I take a break from the game for a few months and now I can't even access the game on my original account anymore. It's a wide spread issue that many are unfortunately running into. The game loads and stops at 55% - 60% on the initial loading screen. Customer support is absolutely useless. It's all A.I. and nothing positive has come from reaching out to them. Honestly such a shame to see such a great game with amazing potential be ruined by some absolute brain dead back end decisions. I hope and wish for nothing other than for Marvel to take away the Marvel IP and penalize the company of this game. Burn in hell you sleezy nasty greedy company!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is the best card game I have ever played in terms of mechanics and strategy. It beats yugioh, mtg, and pokemon. BUT their blatant greed and lies are disgusting. They lied to the community saying they would make card acquisition easier. Instead they made it impossible without spending hundreds of dollars a month. A SINGLE CARD will cost you $30 to $100. You can buy full unique skins in other games for $10. Thats just a cosmetic item not p2w. It can cost $10 for a cosmetic that changes THE BORDER ON A SINGLE CARD. Do not play this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When you boil down this game to its roots, its only really a cash grab.  or that is how i feel at least being a long term player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The core game engine is pretty interesting and enjoyable, and honestly just for that fact I will hop on to kill time every once and a while. However, if you're looking for a sandbox to play with Marvel Snap CARDS, this isn't for you. Monetization and card acquisition on this game is genuinely horrifying. If you don't mind playing the game for the sake of playing the game then go for it, but don't expect to build any specific deck on a fresh account.... ever",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun casual and fast game play. Bots need to be nerfed. Need better card acquisition for new players. Bring back series drops. Shop is too expensive. Bundle values for gold are horrible. The best card in this game is the credit card.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is pay to win and not 10-20$ to win here and there but more like 50-100$ every month to win. I am no stranger to buying DLCs but those price truly baffles me! It's a good game but it's not worth it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is extremely hard to be competitive when starting from scratch with no investment — but it’s not impossible. The key is understanding what kind of competitiveness we’re talking about and what advantages you can leverage even without paying upfront. \r\n\r\n1. Time\r\nIf you don’t have money, you need to invest more time learning, improving, testing, and iterating.\r\nThis is the classic “sweat equity” route.\r\n\r\n2. Skill\r\nIf you develop a skill that others pay for — writing, coding, design, marketing, editing, automation — you can leapfrog people who started earlier but lack skill.\r\n\r\n3. Niche focus\r\nPeople fail because they try to compete broadly.\r\nIf you specialize in a very specific niche, even without money, you can outperform bigger players.\r\n\r\n4. Consistency\r\nMost people quit.\r\nIf you simply continue for 6–12 months, you beat 90% of beginners.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Archetypes are incredibly narrow and leads to pretty much no room in interesting deck building. \r\n\r\nNew cards are gated behind money or good luck. Wanna specific card to try building around a certain strategy? Too bad pay up or hope to pull it in a pack. This system is actually BETTER than what came before it.\r\n\r\nSome cards are flavorful. Many aren't. \r\n\r\nBecause every game is poker, you end up not even playing through most of your matches. This is the antithesis of being a GAME. I want to play cards not bet cubes. \r\n\r\nRNG is a HEAVY part of this game's gameplay. \r\n\r\nNot knowing every card and every deck and its playlines puts you at a huge disadvantage. \r\n\r\nI probably only stuck this long because I love card games and I love Marvel. \r\n\r\nAt least cosmetics come at a decent pace, I'd rather have cards to play with though.\r\n\r\nNot sure what else to say, I just wish I had fun playing this game, reminds me of when I used to play destiny. I played and played out of sunk cost I guess? At least it passed the time I suppose",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was addicted to this game for a while, but the time I put in after awhile was no longer rewarded and they started super leaning into getting you to spend money to have any enjoyment - so I peaced out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Progression is fine up on till you need to start 4/5 rank cards you hit a wall hard.\nthen they deploy the fomo and hard gacha so full gamble mode.\nThe game it self is ok but stay away on till they implement i less predetory system again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shitty game I paid for a pass to get damage error in the game \"Oh, no sorry for the inconvenient error. Whoever is the head of the game fix this shitty game six are bankrupting the game people",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun card game, easy to learn, has so many Marvel characters. There are microtransactions, but everything can be obtained for free, it just takes longer.\n\nUPDATE -\nAfter playing a few more hours i can understand where the negative reviews are coming from, in terms of the game turning to greed. Cards are now unlocking much slower and it's becoming a grind. So many cards out there i cannot get unless i fork out a ridiculous amount of money. \n\nI think they could have priced this game better, maybe added a two hour demo and then made it so we purchase the base game for a reasonable price, then make 90% of cards obtainable for free without any ridiculous grind, still keep a small amount of microtransactions but nothing that's pay to win.\n\nI've still enjoyed my time with this game and will play some more hours until i get bored, all completely free of course.\n\nUPDATE (again) -\nSo after getting bored and quitting the game because card unlocks were so painfully slow, i thought about the question \"Do you recommend this game?\", no i do not, you may enjoy 20 hours like i did but then you will be disappointed with not having to continue that enjoyment to 100+ hours, all because they ask for ridiculous amounts of money. Changed to review to negative.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game data completely erased, its pretending im a new player after 300+ hours and a couple of in game purchases...all gone >.> when before it was connected to my steam account fine. Game has gone downhill and isnt worth playing at all anymore",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Second dinner is tanking fast its own creation.\n\nit's simply impossible to me, as a pay2play player, since i always buy season pass and gold pass, to keep up with the card acquisition system, now it's far far worse than before, i don't know what are they smoking at SD but they need to stop, this game will die very very fast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To have fun, you need to spend money, simple as. Fuck the greed ruining this great gameplay - Balatro is a better card game and if you enjoy the comics, just read them instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game on mobile since its release but this game has become an ABSOLUTE MESS!!!\n\n1. The Card Collection area is so different compared to 3 years ago, all the variants were all in one card and not out and about like it is nowadays.\n\n2. WHO TF ASKED FOR CARD MASTERY, I opened the game and there is so much of that bullshit on top of each card and it's pissing me off.\n\n3. When this game came out I knew it was paid to win and now IT'S PAID TO WIN, I don't know who is paying €100 on a bundle of 2 cards, some gold and tokens and 2 avatars.\n\n4. The Events are just absolute garbage, the game went from a simple card collecting battle game to CLUNKY, GIVE YOUR KIDNEY TO WIN OF A MESS GAME.\n\nThey ruined it and there is no hope for it anymore.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Waste of time. Paid DLC is lazy. Pay to win is unethical. This game has ONLY those aspects. It is bad. DO NOT download.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Somehow, they took a relatively fun game and made it feel like a tedious and exhausting full time job.  Played mostly on mobile and had less and less motivation to play each season.  Eventually just stopped trying to keep up with the constant barrage of new cards, obnoxious meta, and tedious missions/events.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Initially was a blast to play but as more time passed it has become harder and harder for new players to actually compete. Very hard to acquire new cards with steep prices. No way to just straight buy an entire deck or the cards you need. Toxic meta you are forced to play if you want to win and has just become not fun to play. I want this game to do well but the FOMO is pushed in your face constantly. (For reference, I achieved infinite in every season I played)",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "For context I've come from serious  Collectible Card Game (CCG) game such as Hearthstone and Legends of Runeterra. And regretably, Marvel Snap just fell short of that expectation. I can see Marvel Snap being a game that's really suitable for mobile and CCG casual player but for anyone who're into proper or serious CCG strategy game, Marvel Snap is a bit too simplistic for my liking.\n\nThe main reason why Marvel Snap fell short is because of the lack of interactivity. For the most part it's a numbers game where your card will gain number if certain conditions are met and their card have synergies as well. But funny thing is you don't attack their card and they don't attack your card. After 6 rounds or so the side with the higher number dominates that particular field and if you got 2 out of 3 field you win. Again, this is a very simplistic design that's probably more okay for casual CCG on the mobile platform. But serious CCG play will want more. There are no interaction like deathrattle, battlecry from Hearthstone. Or deep, support, elusive, mushroom cards from Runeterra. All those interesting playstyle is what made game like Hearthstone and Runeterra such as interesting game to play. I just don't see that in Marvel Snap. And just to confirm my suspicion, I've watched some Youtube clip where other players/streamers show their game. Even though there are a few cards that move cards from one field to another, or gain a lot of stat if certain conditions are met. The base format of pure number remains the same.\n\nTL;DR: Marvel Snap is a very basic CCG game. If you're only playing short simple CCG game on mobile it'll probably help kill a few minutes of boredom. I wouldn't recommend it to anyone looking for serious complex CCG experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Logged in on my old account from the mobile days, game gives error AFTER forcing me to play the long boring tutorial and starting me at Level 1.\nTry again, same thing. \nClose the game, upon restarting \"we couldn't log you in automatically, please try again\".\nSame thing happens EVERY TIME I restart the game.\nSigh* Decide to start from scratch.\nAfter a few boring matches (no cards, weak oponnents probably bots) game prompts me to go to the store and claim a bunch of freebies, \"error try again in a few minutes\"... click again \"error try again in a few minutes\"...\n\nTry to purchase something with in game currency, nothing happens...click again, nothing happens...\n\nClose game\nUninstall.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really liked it.\nstopped playing.\nnow im so far behind on cards it feels impossible or just not fun.\nmaybe starting now would be better, but i feel so out of the loop of whats meta.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Was great in the beginning but has become over whelming pay to win. Cards and their effects change faster than i can keep up with. new cards are introduced with overpowered effects to get you to buy the current pass or deck or card, etc. Just played 60 games straight and couldn't win a single game with the deck i've always used to get to Infinite. If you don't spend money every week you don't progress, you actually lose progress.\r\nGood for play once in a blue moon until the nostalgia wears off.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a good concept, but man is the AI/CPU cheating in effect. The CPU knows what you put down even when it's not supposed to. The CPU will enable/disable effects so it can win. It's pretty bad. I wouldn't spend money on it as a result. if you want to play just to enjoy the card types that's fine, but I wouldn't expect more than that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to play the hell outta this.\n\nI cannot recommend it anymore. I'm going to sum this up as quickly as I can because this game doesn't even deserve an in-depth review.\n\nScumbag devs. Blatant pay-to-win BS. Damn near zero variety in the gameplay anymore. It's awful. Do not give it your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Do you like playing against the same 3 decks over and over? then this is the game for you.\nThe prices in the shop are beyond ridiculous\nOver the course of last about 2 years they have added many new power types for cards but, they haven't added any new filters to the card selection screen to make them easier to find only the original filters exist and worse still they removed the ability to hide variants so enjoy scrolling through 7 version of every card.\nIt is really difficult but not impossible to have a competitive deck with out spending money.  \nConquest game mode was added about 2 or so years ago and has been untouched since. Every one i know has long since stopped playing that mode.\nThey have added a few limited time game modes that come back pretty frequently i am already find them tired.\nhonestly i consider quitting this game almost every time i play it. i quit for about a year once already.\nif you are wondering my play time is inflated by me minimizing is and forgetting about it pretty often.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The fact that anyone still plays this trash is proof that gamers are complete morons with worthless opinions",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Greedy monetization and overpowered combo decks sap the fun fast. It becomes less about strategy and more about tolerating the shop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even if the monetization aspect is poor, the bugs are inexcusable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been playing Marvel Snap since day one, and the game has changed a lot over time. Unfortunately, most of those changes haven’t been for the better. It’s now packed with in-game purchases, and I slowly lost interest—especially because the new cards are basically locked behind the season pass. If you want to keep up, you’re almost forced to buy the battle pass every month.\n-\nTo be fair, there are some good things left: the collector’s tokens and the dedicated shop where you can pick up specific cards are still solid features. But overall, with all these negative shifts, I eventually dropped the game.\n-\nOf course, this is just my personal opinion. If these issues don’t bother you, you can absolutely still enjoy Marvel Snap. But for me, the push toward constant spending took away the fun",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been playing since the game launched in October 2022.  Game was fun and enjoyable for even the F2P players, but they have just monitized the game and made it not fun.  The game has had META that have dominated for the good majority of the games life cycle and just isn't fun playing against the same deck type over and over again.  When you get matched against a CPU/Bot player, they just seem to cheat and have counters for every card you play.  Originally played it as one of my two mobile games, but haven't touched it in about a month and found I don't miss the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its nothing more then an actual card game it sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "rng sim, want to get rng raped constantly? this is your game!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Haven't met a single human player.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Just bad slop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is still bugged. 11-8-25",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dog shit money grab",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pay 2 win",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Marvel Snap has an appealing presentation and a unique, fast-paced format that makes it easy to pick up and play. However, after spending a significant amount of time with it, several issues become hard to ignore:\r\n\r\nHeavy Monetization: Progression is slow unless you're willing to spend money regularly. New and powerful cards are often locked behind paywalls or time-gated systems, creating a noticeable gap between paying players and free-to-play users.\r\n\r\nAddictive Design: The game leans heavily into addictive mechanics rather than meaningful long-term engagement. Daily missions and reward tracks are designed to keep you logging in, even when the gameplay starts to feel stale.\r\n\r\nStale/Toxic Meta: Certain deck types dominate the ladder for extended periods, often relying on frustrating mechanics that reduce counterplay and variety. Innovation is limited by how slowly non-paying players can access new cards.\r\n\r\nCommunity Issues: Discussions around balance and monetization are often polarized, with critical feedback sometimes dismissed or downvoted. This makes it harder for constructive dialogue to take place.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Really cool for it's first couple years, but man did this game fall off hard. The monetization is shameless and greedy. I'm all for the company making a fat bag off this game, but I certainly don't think single cards should be as expensive as they are.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Its pay to win. Non stop new cards, meta always around the new cards. Sh!t game",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "This game has become a waste of time and you'll have to pay to win. I've played 1000 plus and it is has become harder and harder each season with new cards locked behind pay walls. This game will put you on uneven matchmaking a well I have spent the last week losing to pay to win cards. uninstalling game until this is fixed. pay to win has become a big problem with this game. I do not and will not recommend with the game in its current pay to win state.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Such a pay to win game, card acquisition system is trash. I used to like this game in the first year but now it's fallen off",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "It's so sad because I really like this game a lot, the gameplay is really fun, I love card games, I love Marvel, but the game is completely ruined by the most aggressive and insidious monetization. I recently came back after getting a new phone and spent a few days being enthralled before realizing all the reasons I stopped playing before.\n\nYou can play for a week and not get a single card and that's just not fun at all. And you NEED new cards to progress because it works you up a ladder and after the first few months the game becomes impossible for you to get any more wins against the opponents it pits you against. Losing repeatedly is NOT fun and winning or losing is the only way to get crypto currencies so you can progress. You get points to increase your cards whether you win or lose but who the heck wants to lose 30 matches to make a card level up just at the chance of being able to get a card that might be helpful but isn't even sure to turn your losing record around.\n\nPlayers CONSTANTLY leave matches, instead of playing through the round they just LEAVE which makes it even more annoying. If you get close to winning on turn 4 they will just leave. If you take a second too long to take your turn, they will just leave. It's also hard to tell if you are playing actual people or bots because I swear I've played the same person repeatedly and they always have the same cards and general actions, and they don't even make sense. The gameplay is really fun, but they've shoved it into a PvP format which makes it hard to be strategic and think through moves. There should be a PvE specific mode where you aren't timed each turn.\n\nNow, I wouldn't be opposed to spending money on the game but they want $99 for just ONE card and a few of its accessories. That is absurd. I would pay $9 for a PACK of cards in other games.  So I would recommend the game if it was not so aggressively monetized, but as it is in its current state, it is a confusing mess of crypto currencies meant that even if you spend money you have to decipher what specific currency you need and it's purposefully confusing. A typical game should cost $70, if you spent that much you should have pretty much everything in the game, in my opinion. \n\nThis all makes the game less enjoyable. It's sad. Maybe when it dies people will be able to play it for free or on a private server.",
      "voted_up": false,
      "votes_helpful": 5
    }
  ]
}