{
  "positive": [
    {
      "review": "\"Look around you. This horrible bunch of psychopaths are all begging to join up with me, but unfortunately for them, I only take the best. And today, best means whoever can kill you. Come on out lads. It's initiation time.\"\n\n[i]Batman: Arkham City[/i] is an action-adventure game developed by Rocksteady Studios and published by Warner Bros. Interactive Entertainment.\n\n[b]Story[/b]\nI suggest playing through Arkham Asylum first, as events from that game are used as a setup to setting of this one.\n\nArkham City takes place 18 months after Arkham Asylum events. Taking credit for stopping Joker's siege, director Sharp becomes a Mayor of Gotham City. Declaring Asylum no longer suitable, he creates immense prison enclosure known as Arkham City inside Gotham's slums, taken care of by mysterious Hugo Strange while monitored by private military firm TYGER Security. Our protagonist, Bruce Wayne, opposes that idea and ends up in a titular prison himself. Here as Batman he wants to find out more about mysterious Protocol 10 and real intentions behind the prison.\n\n[b]Gameplay[/b]\nIf you played Arkham Asylum, you already know what to expect as City builds up upon gameplay from previous game, providing third person open world venture where you will investigate, explore, stealth and brawl through the prison as our favourite Caped Crusader, searching for truth (and few faces to soak your fists in).\nFirst thing you will experience is the main dish of the game- combat. Punch, kick, smack thugs before they smack you to avoid a dreadful fate of watching villians laugh in your face as you lose and reload a checkpoint. Counter or dodge incoming attacks, chain up combinations to gain speed and power, utilize plenty of gadgets to surprise your opponents. Game provides improved version of the \"Freeflow\" combat system, meaning you can now perform more moves, such as option to counter multiple attacks at once or being able to chain combinations for long enough to unleash deadly special attacks. Enemies can be armed with different armor and weapons, forcing you to adjust your moves accordingly.\n\nSometimes you get a chance to resolve encounters silently. Similar scenario as with first game, utilize vantage points, environment, detective vision and your gadgets to eliminate enemies without them noticing you. Watch as fear strikes their minds and heartpulse keeps rising with each performed takedown on their buddies, but just like in combat, thugs are a bit more Bat-proof this time so they come with more firearms, jammers and extra tools that will make your life harder, as tides can quickly shift back and forth. Know when to strike and when to wait for opportunity, or just create your own!\n\nArkham City opens up the area, providing way more space to explore. Glide, grapple and sprint around looking for collectibles that expand the narrative and lore, side activities, or just seek out local thugs waiting for a fight! (Or to be knocked out silently by a sneaky Bat.) Fans favourite Riddler returns with his trophies and riddles, while other villians make an appearance in side quests spread all over the prison, unlockable as you progress through the story. Same applies to gadgets, so you might have to wait a bit to obtain a tool or two before you can enter certain buildings or collect specific trophies. No pressure, you can always return to every area you visited.\n\nCombat and exploration grant you experience points, earn enough to level Batman up and unlock new skills, moves, or improve gadgets.\n\n[b]Playtime, other modes[/b]\nIt took me roughly 13 hours to complete everything in Arkham City. After beating the story you unlock New Game Plus where you can utilize everything you have unlocked with increased overall difficulty to balance it out. Additionally there is \"Riddler's Revenge\" mode, where you tackle on different challenge maps and campaigns for medals! Fair to say you can spend a bit more time in City than you might think at first glance, if interested. Especially as this version comes with extra DLC, Catwoman content, and extra characters in RR mode.\n\n[b]Impressions[/b]\nOut of the gate I will go out with a very bold claim- Arkham City is probably the best sequel I ever had a pleasure to play. A textbook definition of how they should be made. It's not a revolution, but an evolution. If you played Asylum you feel right at home almost instantly as game keeps same great controls and fantastic core gameplay allowing you to quickly get into action, increasing and opening up the location where game takes place, addition of side quests and expanded lore make it feel like an entirely new experience. Already great combat is now reaching superb levels, it's smooth, it's intuitive, with very tight controls and top notch precision when it comes to inputs as if game knows which thug you want to hit before you even do. Some annoying moments from Asylum where Batman in the middle of combination would decide to punch ghosts are gone, combined with new moves and gadgets it practically makes you beg for as many enemies on screen as possible to go wild.\n\nBut game knows when to slow down, when to give you a stealth section to showcase pretty solid enemy AI, allowing you to fully lean into Batman's strategic side with various gadgets, careful planning and utilization of environment to his advantage. Quite frankly it's a shame that because game is no longer as linear as first title, plus complete change of area where game takes place so it's almost impossible to just give you a stealth section in the middle of the city, it doesn't actually have that many of those section. But when you get them, it's an absolute treat to play.\n\nAsylum no doubt had it's own unique atmosphere, but City is no slouch in that department either. Prison filled with crime in the middle of gang wars, with secrets on top of secrets, the mash of destroyed slums with iconic locations, freedom you get to explore it and encounter many more and lesser known villians across short yet satisfying side quests, it hits right. Fortunately game never feels too long, it doesn't drag on, even if you decide to dive into the madness that is collecting those forsaken trophies.\nFantastic audiovisual side, strong art direction, top of the game performance from voice actors and animators, game even today looks fairly impressive. Forgot to even mention expanded extra side mode of the game in which you can spend plenty hours, if running around Arkham City gets boring for you.\n\nIf there something...mixed, I can say about this game, it would probably be about the story. In my book the main villian in this one was a bit..disappointing? Especially as he was pretty much a \"main face\" when it came to promoting the game. I expected a better conclusion of certain arcs and felt like it could have focus on just one story, instead of jumping around and trying to have two main storylines branching out and at least for me, that never really worked. So yeah, story is enjoyable but I would like it to go into a different direction.\n\nNonetheless, Arkham City is simply superb. Easy recommendation. Combat feels great, explorating feels enjoyable, still holds up visually and it's a treat for fans of DC/Batman.\n\n[b]Final words and conclusion[/b]\nSaid it before, gonna say it again, GOTY Edition comes with everything released so you get all the fun stuff- alternative costumes, post-main game DLC and extra characters- in one pack!\n\nBatman: Arkham City improves pretty much everything from first game while still focusing on core strenghts- fantastic combat, great audiovisuals and intriguing exploration. Buy it, play it, enjoy it.\n\nFeel free to check out [url=https://store.steampowered.com/curator/31947302/] my curator page [/url] for more reviews!",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "\"We have positive ID on Batman. He is kicking all kinds of ass down there\"\r\n\r\nWhat a game! This is what a sequel should be: bigger, better, and more responsive and accessible in almost every department, from graphics to combat, stealth, and exploration. It still holds up after all these years, and let me tell you, it's not just nostalgia. Games like these truly come once a generation.\r\n\r\nAnd on top of that, there are DLC stories with multiple characters, maps, and challenges. It's very hard to review this game in some text, as you need to experience this game. For me this is truly one of the few 10/10 games out there. And if you're Batman fans, this is a must-play.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Peak Arkham. The open world, combat flow, and story are all perfect — one of the best superhero games ever made.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Batman: Arkham City is Amazing! The story is deep and engaging, the animation is smooth, and I especially loved CatWoman’s moves, so stylish and perfect! \n\nDefinitely worth a try if you haven’t played it yet!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best batman game of all. Great gameplay, crazy story and plot twist's. Very challenging and exciting game. Only downside is the Riddler trophys",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Batman: Arkham City is the extremely popular sequel to Batman: Arkham Asylum and for good. This game takes everything that was great about the first entry in the series and expands on it, and then some. \r\n\r\nThe concept for Batman: Arkham City is a good simple one. A portion of Gotham city has been abandoned after a large flood. This led to it being constructed into a large open prison for the area's worst. The catch being Hugo Strange is in control and uses the prison city as the way of silencing his political opponents. This is where you find Bruce Wayne arrested at the start of the game and placed in prison. He naturally breaks free, acquires some Bat equipment and does what he does best. \r\n\r\nThe game features a lot of returning characters like the Joker, Riddler, Bane etc. There's also some great new additions like Mr Freeze. All of the characters (including Batman) are all very well represented with excellent script writing and voice acting. A far cry from what we get with more recent games. \r\n\r\nThe game play generally works the same. The combat is still rhythmic based. Basically, pushing attack in a slow pulse rhythm will cause the Bat to fly across the screen, hurting his foes whilst the combo rises. As you progress, you get more equipment and more moves to add to the combo. It ends up being some of the coolest game play in the entire Batman franchise. There's also the stealth, which is still really fun but isn't quite as focused here as it was in the first game. \r\n\r\nThe biggest difference this game has to its predecessor is the fact it's open world. Not just a large hub, but full on open world. Where the first game felt like an episode of the Animated Series, this game covers a large city area and feels a lot more grand in scope. It's gigantic and a lot more open by comparison. \r\n\r\nUnfortunately, there's no fast travel. But there is a means to move around. You've just got to complete the little side quest to do it. There's also no lack of things to do. There's a number of really good story based side missions and plenty of Riddler trophies/puzzles to solve. These are all of varying difficulty but something I have always enjoyed doing. It's got a great living breathing world that changes depending on which story point you're at it. \r\n\r\nPersonally speaking, I actually prefer the first game. The more focus hub and the linear story is more to my cup of tea. But whenever I revisit that game, I always come back and replay Arkham City. For good reason. This is an excellent game. Everything about it oozes high quality and it has aged really well. \r\n\r\nI just played through it on my Steam Deck. I had the graphics settings maxed out and I got through it without a single problem. It was quite smooth the entire time. I finished every main, side and Riddler quest. I had a great time and felt I should share that, as the Deck's popularity is sky rocketing. \r\n\r\nThis game goes on sale quite regularly and I couldn't recommend it more. The entire series is very good and well worth the time.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After finishing Arkham Asylum in 2025, I played this right away, and it's the ideal illustration of how a sequel should be done. It takes everything that made the first game special and expands it without losing focus.\n\nThe Open World: It's amazing to glide over Arkham City's streets after navigating the cramped hallways of Asylum. There is no problem with traversal.\nThe Villains: There are a ton of rogues in this gallery. In the history of video games, the boss battle with Mr. Freeze remains one of the best-designed interactions.\nThe Story: A more intricate and dark plot that keeps you interested right up until the very end. I was stunned by how it ended.\n\nIf Asylum is the foundation, City is the skyscraper. An absolute masterpiece that is mandatory playing in 2025.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game was great, a big leap compared to the previous ones.\r\n\r\nCombat flows, open world is nice, story is Intriguing and engaging, animations feel smooth. Definitely worth a try. Most achievements were straightforward no meme tier stuff, the story will take around 13 hours to complete and with achievements probably 25 ~ 30 hours depends on guides and skill.\r\nMy only complaint is the combat can get very repetitive especially if combos and special attacks are not being used so for the AVG gamer I can forsee repetitive combat.\r\n\r\nTLDR - Great game and worth the $.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Another fantastic Batman game! Although I’m not a huge fan of the shift to an open-world format, the story is absolutely amazing. The characters and voice acting are top-notch, and the entire series is a must-play. Runs perfectly on the Steam Deck too",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Same game as the first one but this time its open world, looks a little nicer.\r\nFighting is repetitive and side quests/activities are boring fetch / find stuff and destroy or rescue hostages\r\nOverall story is good, game is not worth full price\r\nget on -[SALE]-",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the very few games that really is close to be a perfect and flawless game. Especially if you are a Batman fan. This game is just sick in atmosphere and references to the Batman universe. So many design details and iconic characters while embedded in the dark tone that made Batman my favorite super hero. \nThe game mechanics, riddles and open exploration do a great job and offer enough variety to fully entertain me over hours. The fights feel fun and satisfying. Just too sad there aren't more games like this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "🌟 [b][url=https://store.steampowered.com/curator/45575657]Follow Ainsel Reviews - Curator for the weird & lovely[/url][/b] 🌟\n\n“You have one new message…”\nAnd it feels less like a voicemail — more like a confession.\nArkham City doesn’t just drag you through Gotham’s rot; it undresses you layer by layer, until all that’s left is guilt, lust, and a strange kind of devotion.\n\nBatman and Joker — not hero and villain, but twin flames feeding on each other’s madness.\nIt’s obsession masquerading as purpose. A dance where love tastes like blood and laughter sounds like a scar.\nYou’re not sure if you want to stop them or watch them burn together.\n\nThen there’s Harley — still spinning in the ruins, a jester crying through her smile.\nShe’s chaos trying to love something that was never capable of it.\n\nAnd when the city’s weight presses too hard, she appears.\nCatwoman.\nThe living embodiment of temptation and control — silk and steel wrapped in one impossible body.\nEvery glance, every whip crack, every purr feels like an invitation to sin your way out of the pain.\nShe doesn’t heal you. She ruins you beautifully.\n\nArkham City isn’t just a game.\nIt’s a fever dream of broken hearts and sharpened claws.\nAnd somehow, beneath all the violence and noise — it’s the most intimate story Gotham ever whispered.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A good sequel to Asylum, Arkham City features much of the same general gameplay and combat styles, and much of the same main characters, with some valuable additions and variations on enemies. Levels can often feel unintuitive and restrictive, but it's a good enough play, especially if you like the IP.\n\nPlaytime: 14.3 hours (PC, controller, Steam Deck)\n\n[b]Overall:  8/10[/b]\n\n[u]Narrative: 8/10[/u] - Arkham City follows the aftermath of the fall of the expansive penitentiary and has Batman attempting to foil Joker's and Harley's destructive plans. As with Asylum and fitting with the theme of Batman in general, the story is simple, but silly, isolated and effective, and has a slightly more entertaining and engaging story than Asylum. The fast-paced narrative doesn't necessarily touch on anything deep but fits perfectly in the world of Batman and never felt stale. Harley Quinn's Revenge was a thematic, valuable addition to the story. With the main story, there doesn't seem to be an appropriate narrative resolution with regard to the scale of chaos in Arkham City, which made it feel a bit disjointed toward the end.\n\n[u]Visuals: 9.5/10[/u] - An entirely new open world was crafted for this game and it looks great, even by today's standards. It's very well-built and looks great from almost anywhere, looking in any direction, especially with the inclusion of the background/sky box assets, which serve to make the already-large open world feel even larger. Batman has a very unique art style and it's executed quite well in this game (as in Asylum). The lighting effects and use of color in Arkham City are both done well and make the world feel almost cartoon-oriented, to the benefit of the game. Although the entirety of the open world is basically the same place (Arkham City), there is enough visual variation to make each part of the map feel distinct, and for indoor areas to not feel repetitive. Character models look great.\n\n[u]Audio: 9/10[/u] - Rocksteady upped their game on the music/score since Asylum. The score is fantastic and never got repetitive. The voice acting, like the first game, is great and fits the style of the subject content. Combat sound effects are done well and also in a cartoon-ish sort-of way. Spatial audio was a bit lacking but nothing audio-related got repetitive in this game.\n\n[u]Gameplay: 7/10[/u] - The gameplay in Arkham City is very similar to that of Asylum, sending you all over the open world to attempt to foil Joker's and Harley's plans, using numerous gadgets along the way to access different areas. Combat is much the same as in Asylum, with some minor changes and additions. The combat simple but fluid and fun and the player can be as creative as they want to with the gadgets during combat. Combat, character movement, and stealth are inventive enough, and game mechanics are introduced often enough, to not feel repetitive throughout the game. However, quite a few boss battles, and battles otherwise, are really just about figuring out what you're supposed to be doing whilst dying several times. What the player is supposed to do is often not self-explanatory and I often experienced the game telling what to do with text on screen. I think some better coordination with the level design team is in order to better align player expectations with what they are served in the game.\n\n[u]Character Design: 8/10[/u] - Arkham City features Batman and Catwoman, and at times, Robin, as they try to stop Joker and Harley from destroying everything and killing everyone, with some special appearances by Clayface, Mr. Freeze, and others, which provides some nice variety through a playthrough without simply recycling enemies from the first game. The dialogue is simple but entertaining and effective and fits the theme of Batman well. I appreciated the opportunity to switch between characters/character models after beating the game. Characters are modeled well, look good in game, and fit nicely with the environment design. What they did with Joker throughout the game was cool and advanced the narrative in a meaningful way.\n\n[u]Environment and Level Design: 6/10[/u] - One of my gripes from Asylum was that the interiors are easy to get lost in and it can be very difficult to find your way to an exit back to the open world. Indoor areas are maybe even a bit more confusing in City than in Asylum. I got lost several times and where the player is supposed to go is often unintuitive. In fact, a lot of what the player is supposed to be doing at any time is often unintuitive. The levels make it seem like there are many different ways to complete them, but they are often set up in a restrictive way which limits viable strategies immensely. There is also a lack of environmental storytelling as compared to Asylum. However, visually, all of the levels and world in general look great, and there is a great consistency and adherence to the art style.\n\n[u]Personal Engagement: 8/10[/u]\n\n[u]Personal Replay Value: 6.5/10[/u] - NG+\n\n[u]Performance: 9/10[/u] - 2k144 on PC, no performance issues. Flawless performance on Steam Deck. Steam Cloud saves enabled. Minus one for the annoying title sequence on launch. \n\n[i]i5-13600KF; RTX 4070 Super 12GB; 32GB RAM; OLED Steam Deck[/i]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great! The mechanics are nice, it has a lot of missions and side quests, aswell as some really good voice acting. I liked how the puzzles werent to hard and neither were the bosses, although mr freeze mad me almost break my controller. The game has a bunch of things to do and after finishing it im trying to 100% it, which is going to take like 50 hours",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a fun game. The stories are great and so is the combat. My favorite part about this game is the design! Very cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game the story the gameplay just the atmosphere and the graphics are great for a 2012 game  I just wish I got my memory wiped to play this masterpiece again .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I thought I was Batman for a while. Then the men in the white coats came and took me to Arkham.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Reminds me off the good ol xbox 360 days where i used to scream at MW3 for hours just to get 360 no scoped by faze adapt and rage quit to this...... the good days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game where batman meets all of his friends and has a nice party with them!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman Arkham city game Batman One-the only one that can use 2 main characters at once is an exciting game, there are improvements from the first game, especially the Batman character who can tackle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A genius classic, must play for batman fans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with some bugs. Applying Community Patch locks out Steam achievements wihich fixes lot of issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its torture. I like it. Sitting 6 hours on one mission. Feels like im killing a part of myself every minute.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i LOVE the batman arkham series, and this is probably the best story in it, i only recently was able to play though this series, but i imagine how big it mustve been when this one game came out. It massively developed the building blocks given by arkham asylum, it has a amazing story, and it added the open world. I love open world games, theyre probably the main reason why i would buy a game, now the one thing i dislike about this game is that its not set in gotham. While it is \"Arkham City\" a prison city, its not the same, although i understand the addition to the story, and its probably what made the story so great, i wanted to be able to arkham glide around arkham and explore wayne tech. (Although both of these were added in the next two games, origins and knight).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "honestly a good game. going into this it felt completely different from arkham asylum so i was in awe but after playing for a bit not much is different besides the look & feel but i don't mean that in a bad way",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic for reason. The story and styling are great and there's enough content unlocking to make me wanna keep playing. I will say that maybe streamlining the for that collectathon by reducing the obnoxious gun enemy presence in what is the post-main story mop up but that's a really small dandelion in an amazing garden. I'd imagine it's been hard to beat this as a batman experience unless one plays the previous game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my all time favorite games, been playing it since it first came out. Beat it time and time again and just can't stop playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really great game . The story is great and the overall combat system is great but the best part was ofcourse just to glide around in the arkham city and there is catwoman as well ; )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has many flaws, like too many flaws. Arkham City is easily my least favorite Arkham game but its still a good game just not by Arkham standards. Great story, fine gameplay, fun gadgets and bad traversal. I would recommend this game for anyone who likes Batman and is ready to handle some bugs.\n\n7.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Holy hell I was sleeping on this game! Everything Asylum was but bigger, better, & a cornerstone of the superhero genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being Batman is fun. The combat is great. The expanded world is awesome. The storyline kept my attention.  There is nothing I can say bad about this game. Well... except playing at Cat-woman. It slightly reminded me of having to do the missions as Mary Jane in Spiderman. Thankfully they were not too much of the main story. Playing as Night-wing and Robin in the Riddler challenges is awesome though so I suppose I go through some bad to really appreciate the good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had this game on PS3. But Anyways, This game is Actually Fun to Play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you play it casually, the game wears its age well, great gameplay and a good story, a worthy edition to the \"Golden Age\" of game development; until you try to hundred percent it. Then you start to notice every. little. piece of ancient jank; your enjoyment turns to cat piss in your mouth and you start to hate this game. At first, the challenges seem like they're going to be a breeze until you're on the hundredth challenge from the same 9 maps, for 4 unique characters each with their unique set of 3 repeating challenges.  \r\n\r\nThis game is the sunk cost fallacy in digital form. Some people on the spectrum will say completing all achievements is a badge of honor, but in reality, it's a sign, a wake up call, that you have no one in your life who loves you enough to tell you to stop. Even after getting my last achievement there was no sense of accomplishment just the weight of knowing what I had just done. And the realization that, like the journey itself, I meant nothing. When I'm in hell, hundred percenting this game as Catwoman will be how I'm tortured.\r\n\r\nAll in all a great game, 8/10, would not play again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This games still holds up, even compared to the remake. I'd even say its better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am playing this game over ten years after it was launched and it still remains a wonderful homage to all that is Batman. \r\n\r\nIf you want to be \"The Bat,\" this is a game for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quick answer: YES!\r\n\r\nGrowing up playing the Arkham games i grew to love a character more than i already have and i believe it can do the same for you if you haven't played them already.\r\n\r\nall in all i recommend the game on a bean scale of 5 million!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of those rare sequels that expands and improves upon literally everything that came before it. Snappier controls, more gadgets, better story, better visuals and presentation, better combat, better bosses, better Riddler challenges, more characters, side missions, double counters and takedowns. Has one of the best open-world designs I've seen. Massive improvement, but I wish it was perfect. Some Riddler challenges are stupidly easy while others are very obtuse or specific. Minor bugs, mostly goofy ragdoll physics (fun) but at least a few crashes or softlocks (not fun). Catwoman is fine in combat, but much worse in stealth and exploration. Still an excellent game overall.\n\n9/10 Easily the best of the Arkham series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good it really improves on the original. I think you have to over rely on detective vision which makes you ignore the amazing art direction the world is amazing but I’m not sure how I feel about some of the character designs. The writing feels like an old episode of the TV show but because this game is old there are a few moments that are in bad taste, especially with the fem characters. the boss fights were a huge improvement over the original but I think where they were placed was really strange also how did riddler get his trophies in the ancient abandoned underground city. Obviously, the combat is amazing it makes you feel like a vigilante. audio mixing was really bad every sound didn’t really fit and it made a lot of scenes feel weird. Obviously Kevin Conroy and Mark Hamill have an amazing performance as always. There’s not much to say apart from the games really good it’s not i’m masterpiece or anything but it’s a perfect Batman game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Improvement from the last game, a lot more quests and tasks to do, great looking map, story, and mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a fucking masterpiece, loved it on the ps3 and loving it on my steam deck, also is very cheap on steam, what are you waiting for? Play it, enjoy it! Trust me, you won't regret it 😌👍🏻",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game. Im sure the studio that made this has goes on to make good games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great. It looks amazing, feels amazing. The vibe is perfect for the setting. It's a masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent gameplay mechanics, animations, no bugs or errors, definitely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games I have ever played, with One of the best story twists in the Video Game history.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy to think I was 10 years old when I first played this...\n\nYesterday I revisited Batman Arkham City for the first time in many years, and completed the Main Story, the Catwoman Missions and the \"Harley Quinn's Revenge\" story DLC. Wow, what a great game to look back on! I completed the entire game in 5 hours, and after all these years, the story, and the gameplay holds up insanely well!\n\n8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Agree with Dr. Strange and Ras\r\nDidn't feel sorry for Joker for even a brief second, extremely annoying character\r\nThe game is awesome though, 3rd walkthrough!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A significant step up from Arkham Asylum. Everything is better from the story to the combat and how Batman traverses the world around him. Batman has a lot more gadgets and they are fun to use. Riddler is now interesting because you save hostages when you solve the riddles, so now there is a purpose for the Riddler, unlike in Asylum.\r\n\r\nCan play as Catwoman as well, which was very cool. Her style of combat is very fun as well.\r\n\r\nThe side quests are fun to play as well, they have interesting stories that keep you invested.\r\n\r\nSad about how it ends though (not going to spoil). Definitely recommend it, it was fun all the way through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Without a doubt in my mind, this game still holds up so fucking well man.\n\nOn the gameplay side alone, they added so many new things as well made improvements to both the combat and predator system, easily making this game really replay-able, especially in all it's challenge maps. Trying to shoot for a faster time while attempting to beat all the challenges is always a blast. Paul Dini once again knocked it out of the park with the story. Every plot point flows from another as we are lead on a chase all around Arkham City, a city always changes after a major story beat. Seeing the factions fight for territory, all for it come crumbling down as the last few hours reckon on with Protocol Ten being active.\n\nGo and play the Arkham games if you haven't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rocksteady at their peak. The open world feels alive without being bloated, combat is buttery smooth, and the story is top-tier Batman. It’s the game I would love to come back to every few years because it just never gets boring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A sequel is the most dangerous addition to story telling. Sequels are hard because the expectations are sky high after the success of the first/original title in a series. If it succeeds then it opens up a whole new world of possibilities, but if it fails or disappoints, not only does it ruin/end the future of the series but it also ruins the experience of the original as you know the end is not as great as the beginning. After the huge success of Arkham Asylum, expectations were over the top for this one. Not only did it meet those expectations but it ended up exceeding them in very significant ways. Combat was improved, stealth was improved, story was even better than the first, bigger open world than Asylum, amazing voice acting as always. As I said in my review of the first game, the graphics still hold up almost 15 years later. Definitely would recommend. Play it !!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Replayed it in 2025 for the first time in 10 years. I owned this on Xbox 360 before I ever got it on Steam - but this version was free from WB as I had bought Arkham Knight and it released with a lot of bugs - so WB gave early purchases the whole Arkham collection. \n\nStill a great game looks pretty good despite its age. The map is pretty small but dense, there are lots of interiors and the city always feels alive as enemies always swarm the streets and gain new dialogue as you progress the story. There are 440 Riddler trophies/challenges/riddles in total to get through, which isn't actually too hard and can be done without using a guide in a few days - but they are fun to collect. It's not just a matter of going to markers and picking them up, but most require some wit, a puzzle and a bit of finesse to unlock. \n\nThe puzzles are great and exactly how they should be in a game, you unlock progressively an assortment of gadgets that allow you to react to your environment, which can help in combat, or access new areas in places you have visited prior. (As opposed to games obsessed with skill trees, where you just hit quantitative checklists where you just boost stats until the game is too easy). There are perks to unlock here too, but they hit a nice balance to gives you some new abilities without feeling overpowered, because as you progress enemies too get new gear and as battles mix up the types of enemies you face, you need to react precisely or lose your flow. This is gaming done right, too many devs do not understand it and think that difficulty is simple integer modification: give them more health and damage, give you less of both, all perks just change integers - lazy, un-innovative development.\n\n The controls feel tight and you can easily manoeuvre Batman around the city, as well as in stealth and melee combat. \nThe game should pack at least 10 hours if you just focus on the main mission, and over 25 if you go for all side quests and Riddler trophies (keep in mind Steam doesn't log hours played, it logs hours the game is running). Unlike many other generic titles, going for 100% is fun and addictive in this game, even in 2025, where I have abandoned so many others. By contrast I gave Spiderman 2018 a go, but had a lot of dislike for it as it leaned so much into genericness without interesting puzzles, bland combat, non reactive AI and a map that is huge but just has you doing simple pickups or wave fights. \n\nOverall I can recommend this game, Asylum and Knight - the Triology - then pretend Origins never existed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game for both Batman fans and stealth game fans alike. Perfect blend of open-world discovery, collectibles grinding, challenging puzzles, and unique combat mechanics (stealth and head-on), all wrapped up in a fantastic story. Easy 10/10. Oh, you're also Batman which is sick as hell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely feel like this game defined Multi-directional Combat games for me, ended up beating 100% on console and still play on PC every once and a while. -Rating: 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Challenge Maps add a lot of extended play. It would be nice if Tyger substations were shown on Riddle Maps.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple. Essense of gritty comicbook batman in fun video game form.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still in 2025 its one of the best action/story game i have ever played with others like god of war and spider man",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the batman combat is really fun and the story is amazing. my gripes are that in boss fights the camera will feel like its fighting you sometimes and all cat woman sections are just annoying, he game play is slower in all regards. play it but just be warned this is not a perfect game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game holds up really well, even today.\n\nFantastic story, great combat and skills, visuals while not cutting edge anymore, are still more than passable.\n\nAdd a couple QOL mods, like unlocked fps, cleaned up video files and you have a great game still.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One my Favorite Video Games of all time and Best comic book video game all of time. 10/10 And Kevin Conroy Performance as Batman is top notch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good story, gameplay, scenery and characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the city, love the gliding AND love love LOVE having to see the LOA in here though they got kinda underutilized imo. Got the best skins out of all four games also (Animated). Not a big fan of some of the side missions in this game (iykyk) but the story makes up for it. Probably the most balanced one in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is about a billionaire who dedicated his life to cosplay and corporal punishment for the mentally.\n\n[quote]If you're a long time gaming fan or to refresh your good old games. Just watch my guide's. I'm sure you'll find good mods for your favorite games.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3000054506[/quote]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game and still stands time.\r\nStill one of the best games ever made, in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best story games I have ever played. And by far the best Batman game released (Lego Batman 2 on the same level)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When you think of great sequels there's probably numerous different types of media that come to mind. Terminator 2, Aliens, Half Life 2, Portal 2, etc. Every good sequel should take the source material and build on it, making marked improvements without alienating the OG fans and that's exactly what Arkham City does.\n\nArkham City improves on the formula that started with Arkham Asylum. Combat is more fluid, Batman is less stiff, the map is more interesting, there's more villains to ass kick, and more middle fingers from The Riddler delivered in a question mark format. \n\nGraphically it still mostly holds up well for being a 14 year old game (christ) in 2025. Speaking of, the game also runs incredibly well on modern hardware. No fucking around with settings, no stability mods, just install and play. \n\nEasy 10/10, one of the greats.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wasnt going to write a review but then I noticed id been playing for 69 hours, anyway game is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game from my childhood that brings back a lot of good memories. Even when I play it these days, it’s still the best at what it sets out to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "12/10 absolute cinema of a game story was really interesting highly recommend !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "✅ Great graphics for its time\r\n✅ Engaging gameplay\r\n✅ Well crafted environments\r\n✅ Interesting riddles\r\n✅ No bugs encountered\r\n✅ Fun combat\r\n✅ Great sound design\r\n✅ Great atmosphere\r\n✅ No microtransactions or online only requirements\r\n\r\n❌ Story is only so-so in my opinion\r\n\r\nConclusion: a must play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Really enjoyed it. The Harley Quinn dlc was pretty good too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best amazing Batman Arkham game.\n\nGreat characters, enjoyable gameplay, immersive story.\n\n10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The combat feels smooth and satisfying, the story is dark and engaging, and the open world perfectly captures Gotham’s gritty atmosphere. The addition of all DLC content makes this version the ultimate experience. Whether you’re gliding across rooftops or taking down thugs in a flawless combo, it never stops being fun. A must-play for any Batman or action fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally got around to playing this in 2025 and it was just as good as everyone said it was. Don't really have much to stay - its a phenomenal action game and one of the best superhero games ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The sequel to Arkham Asylum doesn't just continue thee same formula, but makes it even better. With a gripping superhero story, smooth counter combat and ability to glide across a larger map of Arkham City, this game is one that every superhero fan should experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing fighting moves, with different buttons. Awesome side missions along with the story missions. Loved every aspect of this game !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addicting gameplay loop and Arkham City is a character in itself. Another amazing all time classic in the Arkham series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing open world and great story.Really good boss fights especially Mr. Freeze",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved it. Fun game. Second character also very fun to play as, and not just some sidekick.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic, runs great on mac. However, I prefer Asylum, it's more atmospheric. This one's map is far too 'gamey' and the story is a bit a nonsense.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everything about this game is peak. from the soundtrack to even its smallest detail idk recently its become cool to hate on this game but i played this in my childhood and played it so much afterwards. i have like finished this game 13-14 times and i never get bored of the story. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game came as a bundle along with Asylum and Knight! I am dipping in and out!  The saves are always there so that isn't a problem! It is a solid beat em up with good character portrayals!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely banger of a game, missing new renditions and further continuations of the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my favorite games of all time and replaying it for the first time since its release was so much fun. If only I could have wiped this game from my memory right before booting it up. I kept thinking about how there is nothing like playing it for the first time, especially back in the early 2010s.\n\nYour first Batman Arkham game will always have a special place in your heart, similar to the way I feel about my first Far Cry and Call of Duty, because it is your first exposure to the greatness of the franchise. This was my first Arkham game and I first played it on the Xbox 360 when it came out in 2011. At the time, I was around 12 years old and this game was the coolest, most badass video game I had ever experienced. The gameplay, story, and aesthetic are all top notch.\n\nGliding around a derelict and dangerous Gotham is fun and provides a sense of freedom. While gliding was a feature present in Batman Arkham Asylum, it was limited and not a big part of the gameplay experience. This is the first video game I ever played with fun movement mechanics. Arkham City’s influence is undeniable and other game developers clearly took note, adding similar movement mechanics to their games.\n\nArkham City’s combat isn’t the best in the franchise but still a significant improvement from Arkham Asylum. My only complaint is that once again, Riddler is far too great of a time commitment to defeat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, upgrade over Asylum in almost every way. Visually it's holding up great. The only negative is that they maybe overdid it with Riddler things, I would prefer to have less amount of more involved puzzles than 500 puzzles where 80% are brain dead easy but you just have to spend time finding them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time playing through this was a blast. I loved how dark and gritty the game was and the villains in the game were awesome. Mr freeze and Penguin were my favorite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best super hero games i ever played\nThe game’s mechanics and gadgets were excellent — none of the tools felt unnecessary or out of place. Everything had a clear purpose, and they made the gameplay and combat feel dynamic rather than stiff or repetitive. The combat speed was perfectly balanced too — not so slow that it became boring, and not so fast that it felt confusing.\n\nAs for the game’s atmosphere, it was truly captivating. The dark and gloomy tone of Gotham was portrayed perfectly, and the characters fit right into that world — it genuinely felt like you were dealing with real maniacs.\n.\n.\nThe only downside was the handling of side mission boss fights. They didn’t get enough attention, and most of those fights felt underwhelming despite the effort needed to reach them. For example, the Riddler boss fight — after collecting tons of trophies and solving countless puzzles, it all ends in a simple room with an easy takedown. It was a bit disappointing, especially since Riddler had been part of the story from the very beginning.\nIn the end, though, I definitely recommend this game — it’s absolutely worth playing more than once. Each time you replay it, you’ll notice new details you might’ve missed before.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the first game was great this one is even better. faster gameplay and bigger map +cat woman playble character and darker and deeper story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly maybe just one of the best games ever. Can come back multiple times and still enjoy it and this is probably the best story out of any of the arkham games. 15 years later and it still holds up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Builds on the foundation of Asylum and does everything so much better than we thought amazing story and characters and overall gameplay, side missions were pretty good too 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most games released in the early 2010's have some age, I can hardly notice any with Arkham City. I have yet to finish Knight but City has always been my favorite in the Arkham series and continues to remain one of the greatest Batman experiences you could have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't know why I never played this one \nGame suprisingly still looks got best boss fights in the series imo definitely worth a play. \n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the classics which introduced a superior fighting mechanic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My personal favourite of the main Arkham series. Yes, I am biased with this being my first one too, but between the story and the improved combat from arkham asylum, I always find myself coming back to this entry of the arkham series over the others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the riddler trophy hunt is fun and i'm tired of pretending it's not 🤡",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ON PAR WITH ARKHAM KNIGHT (for me i cant decide which one is better)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "And THIS, my friends, is how you make a legendary video game. So much attention given to minute details, like it should always happen. If you're a Batman fan, Arkham City is an absolute must-play. A masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RIP Rocksteady, thank you for your work, Warner Bros you are a bunch of braindead morons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While my favorite is Arkham Knight, this is easily the best story of the Arkham series and perhaps the most nostalgic for me. Alongside Arkham Asylum. 10/10. Hopefully Rocksteady can come close to achieving what they were once capable of.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the single greatest game I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“Batman: Arkham City is still one of the best superhero games ever made. The combat feels smooth, the city is fun to glide around, and every mission pulls you deeper into Gotham’s atmosphere. It’s old now, but it still holds up amazingly well.”",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's tough to give this a binary \"Recommended / Not Recommended\" review here, but ultimately I think I have to give it a Thumbs Down. The continuation from Asylum was great. I enjoy the combat, even if some of the later brawls were just a ridiculous amount of enemies in single rooms. The rooms where you sneakily take down sentries one-by-one is fun, even if they copy/paste that formula repeatedly in the same rooms. The story is exactly what I would expect from a Batman game, and I enjoyed the inclusion of classic Batman characters throughout. I really liked the idea of the open-world map, and while I think Asylum's smaller map led to tighter segments, expanding that to a full \"city\" was a cool to see.\r\n\r\nThat being said, I think the city kinda collapsed under it's own weight. Movement was incredibly unfun. In a post-Insomnia Spider-Man world, it wasn't nearly as zippy enough, nor was it particularly dangerous to move between regions. It just felt like a slog. This was made worse by there being a large impenetrable wall in the middle of map, forcing you to go the long way around constantly throughout the game. It didn't take long to make this feel like a chore instead of an engaging part of the gameplay. It obviously wanted you to interact with the collectibles along the way, like the Riddler trophies, but so many of those require gadgets you get later, it feels bad to try and remember ALL of them to return to later. Once I decided I wasn't going to get them all, I didn't care to stop and explore the map.\r\n\r\nThis really was just made worse by the Catwoman DLC. Since I'm playing the GOTY version a decade after release, I didn't realize this was bonus content and just played her segments as part of the base experience. She shows up so infrequently, and her segments are so underbaked, it ultimately felt really bad to play her (especially since she had practically no upgrades by the end).\r\n\r\nWhile I did find the story serviceable, I did think the ending was very underwhelming, especially since it cuts right to a Catwoman segment. I felt like I was missing a good ending or something due to how abruptly things resolve. I guess they're hinting at the third game in the trilogy, but it still felt like it's missing something.\r\n\r\nI think at this point, you've made your mind up on whether you're playing this decade-old game in a lauded trilogy. It's definitely worth a shot if you want to experience the Arkham games. But I couldn't really see myself returning to this in the same way I might revisit Asylum in the future. Just too much busywork and not enough pay-off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Batman: Arkham City is in my opinion incredibly over rated, just like Arkam Asylum. The reasons why I didn't like this game are the same as before, which I described in detail in the review of Asylum.\r\n\r\nBriefly: It's not a bad game, it has a story, decent graphics (but it's always dark, because in the Batman world it's always night) and sound. But I don't like the combo based beat them up combat, that is clearly easier if you have a controller. It works fine when you have a few enemies around but when you are surrounded by 10 or 15 enemies each with their own attack mechanics to counter, it's just frustrating and leads to many reloads. Also the bosses battles are poor because each have only 1 formula or way to beat them. \r\n\r\nAnother thing I don't like is the concept of unending \"trophies\" and riddles to find/solve all around the map. I don't understand why many gamers find that paradigm amusing. It's the same as in Assasin's Creed, except in those games you only have trophies to find (and not too many), but here you have also all kinds of riddles and trophies that are unlocked by platforming puzzles. \r\n\r\nArkham City has an semi-open world, instead of being linear like Asylum, and you have main and side quests. But the side quests are very poor and not done well. They only give you some vague clues but basically you have to search the entire map for their locations. And each side quests has many spawning/trigger event locations. I only managed to solve 50% of side  quests. Who knows where the rest are, and some are bugged, they don't trigger. \r\nMediocre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the weakest one for me so far. Ive played asylum and I am currently playing origin. Loving origin so far but this game I hated getting through. The gameplay and combat was repetitive, the story was weak, the characters fell flat in this one, and overall this game didn't have the atmosphere asylum did which it was trying so hard to have. I wanted to give this one a good review but genuinely unlike asylum and origins (so far) it felt like a chore to get through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not feature the real Nightwing. He's flat as concrete",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games is boring and the same fights and mini games over and over I hope to finish this one day but the story is boring and the open world is to much imo like to many icons and objectives for lack luster rewards when you do any of them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is LITERALLY dead. like functionally dead. if you try to launch it on windows 11 you WILL be met with this error: \"QA_APPROVED_BUILD_JANUARY_2011 424000 11-04-2012 15:05.24 (Wwise: 2011.1.0#3886) Game address = 0xe129fd (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0x41fc12 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xc33866 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13110 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13257 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xdf6ea3 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe]\" there is no patch. there is no fix. the game itself is physically broken and will not launch. DO NOT WASTE YOUR MONEY.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't bother even trying to run this, it won't launch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's full of lags and crashes in some parts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-> Game crashes a lot . \r\n-> You get bored after playing this game for 10-12 hrs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nie można współżyć z ivy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's BORING AF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "highly overrated, boring and repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game won't open on Windows 11. I tried many things. It was playable on Windows 10 and it was fun. But I can't write a positive review for a game I can't play. Please fix the problems.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Batman: Arkham City is in my opinion incredibly over rated, just like Arkam Asylum. The reasons why I didn't like this game are the same as before, which I described in detail in the review of Asylum.\r\n\r\nBriefly: It's not a bad game, it has a story, decent graphics (but it's always dark, because in the Batman world it's always night) and sound. But I don't like the combo based beat them up combat, that is clearly easier if you have a controller. It works fine when you have a few enemies around but when you are surrounded by 10 or 15 enemies each with their own attack mechanics to counter, it's just frustrating and leads to many reloads. Also the bosses battles are poor because each have only 1 formula or way to beat them. \r\n\r\nAnother thing I don't like is the concept of unending \"trophies\" and riddles to find/solve all around the map. I don't understand why many gamers find that paradigm amusing. It's the same as in Assasin's Creed, except in those games you only have trophies to find (and not too many), but here you have also all kinds of riddles and trophies that are unlocked by platforming puzzles. \r\n\r\nArkham City has an semi-open world, instead of being linear like Asylum, and you have main and side quests. But the side quests are very poor and not done well. They only give you some vague clues but basically you have to search the entire map for their locations. And each side quests has many spawning/trigger event locations. I only managed to solve 50% of side  quests. Who knows where the rest are, and some are bugged, they don't trigger. \r\nMediocre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the weakest one for me so far. Ive played asylum and I am currently playing origin. Loving origin so far but this game I hated getting through. The gameplay and combat was repetitive, the story was weak, the characters fell flat in this one, and overall this game didn't have the atmosphere asylum did which it was trying so hard to have. I wanted to give this one a good review but genuinely unlike asylum and origins (so far) it felt like a chore to get through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games is boring and the same fights and mini games over and over I hope to finish this one day but the story is boring and the open world is to much imo like to many icons and objectives for lack luster rewards when you do any of them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is LITERALLY dead. like functionally dead. if you try to launch it on windows 11 you WILL be met with this error: \"QA_APPROVED_BUILD_JANUARY_2011 424000 11-04-2012 15:05.24 (Wwise: 2011.1.0#3886) Game address = 0xe129fd (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0x41fc12 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xc33866 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13110 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13257 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xdf6ea3 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe]\" there is no patch. there is no fix. the game itself is physically broken and will not launch. DO NOT WASTE YOUR MONEY.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't bother even trying to run this, it won't launch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's full of lags and crashes in some parts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-> Game crashes a lot . \r\n-> You get bored after playing this game for 10-12 hrs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nie można współżyć z ivy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's BORING AF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "highly overrated, boring and repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game won't open on Windows 11. I tried many things. It was playable on Windows 10 and it was fun. But I can't write a positive review for a game I can't play. Please fix the problems.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Batman: Arkham City is in my opinion incredibly over rated, just like Arkam Asylum. The reasons why I didn't like this game are the same as before, which I described in detail in the review of Asylum.\r\n\r\nBriefly: It's not a bad game, it has a story, decent graphics (but it's always dark, because in the Batman world it's always night) and sound. But I don't like the combo based beat them up combat, that is clearly easier if you have a controller. It works fine when you have a few enemies around but when you are surrounded by 10 or 15 enemies each with their own attack mechanics to counter, it's just frustrating and leads to many reloads. Also the bosses battles are poor because each have only 1 formula or way to beat them. \r\n\r\nAnother thing I don't like is the concept of unending \"trophies\" and riddles to find/solve all around the map. I don't understand why many gamers find that paradigm amusing. It's the same as in Assasin's Creed, except in those games you only have trophies to find (and not too many), but here you have also all kinds of riddles and trophies that are unlocked by platforming puzzles. \r\n\r\nArkham City has an semi-open world, instead of being linear like Asylum, and you have main and side quests. But the side quests are very poor and not done well. They only give you some vague clues but basically you have to search the entire map for their locations. And each side quests has many spawning/trigger event locations. I only managed to solve 50% of side  quests. Who knows where the rest are, and some are bugged, they don't trigger. \r\nMediocre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the weakest one for me so far. Ive played asylum and I am currently playing origin. Loving origin so far but this game I hated getting through. The gameplay and combat was repetitive, the story was weak, the characters fell flat in this one, and overall this game didn't have the atmosphere asylum did which it was trying so hard to have. I wanted to give this one a good review but genuinely unlike asylum and origins (so far) it felt like a chore to get through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games is boring and the same fights and mini games over and over I hope to finish this one day but the story is boring and the open world is to much imo like to many icons and objectives for lack luster rewards when you do any of them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is LITERALLY dead. like functionally dead. if you try to launch it on windows 11 you WILL be met with this error: \"QA_APPROVED_BUILD_JANUARY_2011 424000 11-04-2012 15:05.24 (Wwise: 2011.1.0#3886) Game address = 0xe129fd (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0x41fc12 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xc33866 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13110 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13257 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xdf6ea3 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe]\" there is no patch. there is no fix. the game itself is physically broken and will not launch. DO NOT WASTE YOUR MONEY.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't bother even trying to run this, it won't launch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's full of lags and crashes in some parts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-> Game crashes a lot . \r\n-> You get bored after playing this game for 10-12 hrs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nie można współżyć z ivy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's BORING AF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "highly overrated, boring and repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game won't open on Windows 11. I tried many things. It was playable on Windows 10 and it was fun. But I can't write a positive review for a game I can't play. Please fix the problems.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Batman: Arkham City is in my opinion incredibly over rated, just like Arkam Asylum. The reasons why I didn't like this game are the same as before, which I described in detail in the review of Asylum.\r\n\r\nBriefly: It's not a bad game, it has a story, decent graphics (but it's always dark, because in the Batman world it's always night) and sound. But I don't like the combo based beat them up combat, that is clearly easier if you have a controller. It works fine when you have a few enemies around but when you are surrounded by 10 or 15 enemies each with their own attack mechanics to counter, it's just frustrating and leads to many reloads. Also the bosses battles are poor because each have only 1 formula or way to beat them. \r\n\r\nAnother thing I don't like is the concept of unending \"trophies\" and riddles to find/solve all around the map. I don't understand why many gamers find that paradigm amusing. It's the same as in Assasin's Creed, except in those games you only have trophies to find (and not too many), but here you have also all kinds of riddles and trophies that are unlocked by platforming puzzles. \r\n\r\nArkham City has an semi-open world, instead of being linear like Asylum, and you have main and side quests. But the side quests are very poor and not done well. They only give you some vague clues but basically you have to search the entire map for their locations. And each side quests has many spawning/trigger event locations. I only managed to solve 50% of side  quests. Who knows where the rest are, and some are bugged, they don't trigger. \r\nMediocre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the weakest one for me so far. Ive played asylum and I am currently playing origin. Loving origin so far but this game I hated getting through. The gameplay and combat was repetitive, the story was weak, the characters fell flat in this one, and overall this game didn't have the atmosphere asylum did which it was trying so hard to have. I wanted to give this one a good review but genuinely unlike asylum and origins (so far) it felt like a chore to get through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games is boring and the same fights and mini games over and over I hope to finish this one day but the story is boring and the open world is to much imo like to many icons and objectives for lack luster rewards when you do any of them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is LITERALLY dead. like functionally dead. if you try to launch it on windows 11 you WILL be met with this error: \"QA_APPROVED_BUILD_JANUARY_2011 424000 11-04-2012 15:05.24 (Wwise: 2011.1.0#3886) Game address = 0xe129fd (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0x41fc12 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xc33866 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13110 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13257 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xdf6ea3 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe]\" there is no patch. there is no fix. the game itself is physically broken and will not launch. DO NOT WASTE YOUR MONEY.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't bother even trying to run this, it won't launch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's full of lags and crashes in some parts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-> Game crashes a lot . \r\n-> You get bored after playing this game for 10-12 hrs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nie można współżyć z ivy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's BORING AF",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "highly overrated, boring and repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game won't open on Windows 11. I tried many things. It was playable on Windows 10 and it was fun. But I can't write a positive review for a game I can't play. Please fix the problems.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Batman: Arkham City is in my opinion incredibly over rated, just like Arkam Asylum. The reasons why I didn't like this game are the same as before, which I described in detail in the review of Asylum.\r\n\r\nBriefly: It's not a bad game, it has a story, decent graphics (but it's always dark, because in the Batman world it's always night) and sound. But I don't like the combo based beat them up combat, that is clearly easier if you have a controller. It works fine when you have a few enemies around but when you are surrounded by 10 or 15 enemies each with their own attack mechanics to counter, it's just frustrating and leads to many reloads. Also the bosses battles are poor because each have only 1 formula or way to beat them. \r\n\r\nAnother thing I don't like is the concept of unending \"trophies\" and riddles to find/solve all around the map. I don't understand why many gamers find that paradigm amusing. It's the same as in Assasin's Creed, except in those games you only have trophies to find (and not too many), but here you have also all kinds of riddles and trophies that are unlocked by platforming puzzles. \r\n\r\nArkham City has an semi-open world, instead of being linear like Asylum, and you have main and side quests. But the side quests are very poor and not done well. They only give you some vague clues but basically you have to search the entire map for their locations. And each side quests has many spawning/trigger event locations. I only managed to solve 50% of side  quests. Who knows where the rest are, and some are bugged, they don't trigger. \r\nMediocre.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the weakest one for me so far. Ive played asylum and I am currently playing origin. Loving origin so far but this game I hated getting through. The gameplay and combat was repetitive, the story was weak, the characters fell flat in this one, and overall this game didn't have the atmosphere asylum did which it was trying so hard to have. I wanted to give this one a good review but genuinely unlike asylum and origins (so far) it felt like a chore to get through.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games is boring and the same fights and mini games over and over I hope to finish this one day but the story is boring and the open world is to much imo like to many icons and objectives for lack luster rewards when you do any of them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game is LITERALLY dead. like functionally dead. if you try to launch it on windows 11 you WILL be met with this error: \"QA_APPROVED_BUILD_JANUARY_2011 424000 11-04-2012 15:05.24 (Wwise: 2011.1.0#3886) Game address = 0xe129fd (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0x41fc12 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xc33866 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13110 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xe13257 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe] address = 0xdf6ea3 (filename not found) [in C:\\program Files(x86)\\steam\\steamapps\\common\\batman arkham city GOTY\\binaries\\Win32\\BatmanAC.exe]\" there is no patch. there is no fix. the game itself is physically broken and will not launch. DO NOT WASTE YOUR MONEY.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "don't bother even trying to run this, it won't launch.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's full of lags and crashes in some parts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-> Game crashes a lot . \r\n-> You get bored after playing this game for 10-12 hrs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nie można współżyć z ivy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's BORING AF",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}