{
  "positive": [
    {
      "review": "Bought this game on a whim this week, seemed to check all my boxes for a game. I've only put 13 hours into the game so far but I have to stop playing for now because of a few key issues for me. \n \nPros:\n- Love the ability to start a company and literally do whatever I want to make money.\n- Vehicles are intricate and have very detailed controls\n- There are a good number of vehicle choices, albeit some very confusing and arbitrary similarities and prices.\n- Belt and pipe systems that seem to follow real world physics, to an extent.\n- Maps are huge and detailed\n- Menu and settings are straight forward and include a wide range of control options for Keyboard, controller or joystick/wheel inputs.\n- For an game designed by people that don't speak English as their primary language, the game makes 100% sense to an English native and I was able to understand everything clearly. \n\nCons:\n- The shop needs a search bar that can search based on the item you are trying to mine. I should be able to put in \"asphalt\" and see everything in the game that corresponds to that material. \n- Dirt physics are cool until they just stop acting like dirt. Example, moving dirt in an excavator or loader works great, feels good and makes sense. However, using explosives is pretty much pointless if you want to gather the materials. Dirt gets blown up, yes, but it just moves like mud and sticks to a random spot, including the inside of the conveyor belt itself, and you have to re-use explosives to get all of it into a conveyor. Frustrating. \n- Vehicles are good but way too janky in small spaces. You will be going along, mining a section of a mound out with a loader and suddenly hit a pocket of hard rock that sends your loader flying and dumping out your bucket. \n- No huge issue but worth noting, you get a lot of floating particles in the air from rock that either caved in slightly or didn't get fully scooped out and it very annoying to clean up later on. \n- While there are quests and a skill tree, it just seems a bit pointless. A sandbox game shouldn't have levels just for the sake of levels. I'd much rather have to pay for the items in the shop and have the focus of the game to make enough to afford them.\n- There is no AI or way to hire help, so be okay with 0 automation for gaining materials aside from oil. That's fine, but you will eventually hit a wall with how much you can make per hour simply based on man power.\n- Powering conveyors is a nightmare and organizing a system out of a mine is the worst part of the game imo.\n\nLast thoughts. I was 100% into this game when I started it. An open world map with the power of demolition at my control? Management of my very own company and make money how I see fit? Perfect! It has all of this yes, but what I came to discover very quickly was that the game becomes very tedious quickly. Beyond the wonky mouse and keyboard controls that you have to remap to make the game work for a human, setting up conveyor systems to haul out debris, especially from a mine in the side of a mountain, is THE WORST. Trying to figure out how to power these systems when they can only be powered at the front or end of the line is just dumb. I have zero intention to use a loader to drive out every. single. bucket. of dirt when I have a conveyor network to do that for me. This needs to be re-evaluated. Simplify it please. The system would be perfect if the power required to drive the belts was able to be placed anywhere along the sides of the belts...\n\nOverall, I think this is a solid 6/10 that will one day be even better if the devs continue to hone it in, which they seem to be doing. The idea is great, just a bit unpolished. I'll be keeping my eye on it for sure.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "I am a Dwarf and im Digging a Hole.\nDiggy Diggy Hole.\n\nA Big Sandbox for you to Play around in,\nhavent tried multiplayer yet, but as my hours can confirm i got my fun out of it.\n\nPerfect game to get some slow progress while maybe watching some videos/podcasts.\n\nTo my gripes, its really hard to get a good even surface for your machines to widen your quarry,\ngot easier with the gps antenna, still finiky.\nAlso the shallowest built ramp you can get is still quite steep (25% incline).\n\nCurrently Eating away at the Hill blocking my Quarry with my quasi \"Bagger 288\" \nwhile watching some videos and silently singing bagger 288 to myself.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "by far one of the best open-world, terraforming game there is out there in my opinion",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "While it is still in development, the fact that the team posts a weekly notice every friday and a new beta update every month or so keeps things fresh and responsive. The gameplay is relaxing once you get into it, especially with the addition of the bucket wheel excavators. Building a simple processing plant doesn't take an absurd amount of time and can be figured out even without the tutorial thanks to the descriptions each item has in the shop.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Amazing game would definitely recommend big machines worth 24.99 dollars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, always enjoyable to play, and always happy to see them updating the game constantly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was looking for a heavy equipment simulator to use my joysticks. Found this on youtube. Bought it in the short time ive played its always getting better with updates. The greatest mining game ever. Is here want a excavator sim. Dozer etc. This is the one. Keep up the great work this small team amazes me every update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very active development and game is constantly changing. Had it from day 1 and it's a completely different game.\n\nIt is exactly what you would expect it to be. Dig ore, produce ingots, make components, sell. Or just dig to your heart's content -- choice is yours!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game for it's ever growing content and realism, the bar of potential raises higher and higher after each and every update. There is no other that exists that comes close to competing for the spot which this game currently holds, this is truly a hidden one of a kind gem in it's field. \r\n\r\nI appreciate how dedicated, interested and invested the developers are pertaining to their product, especially their community; You can feel both the love and the passion they have radiating off their game and through the people who support it. I'm always looking forward and excited to receiving and reading through the routine Friday news posts every week concerning the game's future development and continued progress.\r\n\r\nThis game has come a long way throughout the past years, I myself and many others that share similar beliefs and interests hope that it remains that way and continues to thrive for the many more to come; It would be a great and devastating loss otherwise, I hope and wish that day never comes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such potential! how love!\nbeautifully caring development adding new stuff and refining the older features. want more, can't wait!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutally love the game and the concept of the game i just wish there was achivement so you had something to work for. but other than the the friday news the regualr content updates are brillient.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some people can play in a sandbox in real life. Some are wvwn payed for this\nThe others can buy this game and also have some fun.\n\nGood:\n- It runs well on medicore PC (shadows -> low and you are ok)\n- Vehicle physics is good\n- Terraforming is great\n- You can dig deep, very deep \n- You can run a processing plant of your own design\n- You can earn money (virtual ;)) \n- You can play with firends or even some random people\n- Active devs\n- Many maps\n\nBad:\n- Your GPU will go crazy (but only on shadows -> high settings)\n- It takes a lot of time. Especially if you are alone\n- It still needs some polishing but so far it is very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Large number of vehicles,  huuuge maps to explore, and a great way to spend your hours.\nFun alone, great with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played a good bit. It can feel kinda clunky at times, but its very much a labor of love. Updates are super regular, Dev's keep us in the loop. New fun toys appear. I've loved this game since I started playing it. Can't wait to remove more mountains!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great fun with a group of friends!\r\nCool and most important, working mechanics.\r\n\r\nLot's of stuff to do in-game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.  And for me to say I like a game this day and age is a huge accomplishment. Bravo dev team.\n\nIt is like Satisfactory, Minecraft and a Construction Simulator game had an orgy and this is the child they spawned.\n\nI usually return games into two hours of it doesn’t interest me, but I went through the tutorial for around an hour, and I then blew past several hours in my own open world in the Arctic.  I am still figuring things out.  But there is a lot going on.  For example, I picked a mountain to excavate, bulldozed the side of it to square it up, got a grader to smooth out the road to my planned entrance, then got my mining excavators to start burring hole in it.  That quickly became too much hauling dirt out even after buying a dump truck so now that I hit Pay dirt I had to build a conveyor system to sort out things like diamond ore, gold ore, rubys, etc.  I have everything powered by 3 big ass windmills right now.  Got it in storage silo.  Figured out I can sell dirt once it is a waste product.  Tried a fuel setup but too tedious to keep filling it.  I hear you can find oil, haven’t got to that point.  Trying to figure out how to refine the ore, tried to make a smelter but spilled a bunch of melted ore on the ground, reloaded A quick save lol.\n\nThis game is scratching an itch I didn’t know I had.  So glad I didn’t buy construction simulator or “road craft” and bought this instead.  Snow runner got boring for me.  This is a nice depature.\n\nYou can run around in here. Get out and scope out things.  Something I feel is missing in the Snowrunner games.  The environment is fully destructible.  Can even use a pick axe to dig or a hammer to break things up.\nDug too much and had to add some dirt back.  Dug put a loft but a stair case and a bed.  It is raining all the time and lightning in the attic for some reason lol.  \n\nThe amount of equipment is kind of overwhelming at first but it is good it is so diverse and vast, allows for more fun.\n\nRight now I can see how I am reaching a man power issue.  I can only do so much and some things like hiring another AI operator or several would be nice.  I got 3 mining tunnelers going at different levels. \n\nIt is fun, 10 hours spent in only like 3 days and I want to play more, but have adult responsibilities lol.\n\nIt is like what I always dreamed of doing when I was a kid with my metal tonka trucks.\n\nIf I ever struck it rich I would start a mining company as an excuse to dig holes in a ground lol.   Be like a modern day Yukon Cornelius, licking my pick axe and looking for gold. \n\nThe digging is unlimited as far as I can tell.  I’m literally carving out a mountain one truck load at a time.  Really awesome.  I am sure it may become boring at some point.  But that maybe be when I reach the center of the earth if there is one.  Right now I’m practicing the art of placing  steel ceiling and wall skills lol.\n\nNot sure if the mine can collapse, I started seeing dirt and rock fall down so starting bracing everything and laying concrete floors.\n\nAwesome is all I can say.  Don’t know what the hell I am doing but having fun doing it lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I have been having fun. Of course their are still bugs, but still and enjoyable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Alot of brainpower needed sometimes when you scale your factory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a former coal miner (surface 6yrs/underground 7rs), we finally have our game :). I love everything about this game. Once you learn the mechanics it is hard to peel yourself away from production. Yet to play online, only solo. I do wished they would add an actual Joy style continuous miner, and dreaming one day maybe a highwall miner lol, one can dream",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well so this game just jumped onto tiktok as much as i know that is where i found it but here is the big thing i love these types of games. and it came out in 22 really for this game i would give it 9 out of 10 the big thing issues i have with it. i understand the need for real you get dropped into the world and start with nothing that is great but yall really need to work on teraforming when trying to build a flat piece of land its not easy even when you get up in lvl ya there are blocks and building in the game for you to build with but this is more a qol thing overall we had a few crashes but that is the beta life but overall really nice you can put some hours into this game and really never get board. there is always something to do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What I love about this game is that you have the options to play it as you wish.  For me it's more about building (running dirt is just a tool that's used for testing my systems), rather than about digging holes or running machinery.  For many others, it's about the team work, role playing, machine operation and Yes... digging holes and moving mountains.  The grind is available but not neccessary.  The Devs are great at staying on top of things, great team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game to play especially if you like to play mining game the game has come a long way from when i started playing i cant wait to see what more the game will have for it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dude I want to say to the developer or developers  thank you its a amazing what you have done to this game so thank you, And keep up the good work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is pretty addictive, especially as friends.  The dirt physics are impressive, it's not many games where you can move a pile of dirt that stays put.  Really having fun with this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a $25 heavy equipment sandbox game with building and material processing mechanics like Satisfactory; except you're not stuck trying to go around the terrain like in Satisfactory. Instead, you can dig and change the terrain to whatever you want. Bore an underground mine if you want.\n\nIt's not the same level of polish as Farming Simulator 25, but the digging and piling physics are pretty good and that matters more to me than if my handheld shovel swings like i'm whacking gophers when I dig. When you dig you don't end up with weird, janky stalagmites of dirt poking out of the ground like in older games in this construction sim genre. \n\nQuick tip: If you didn't know you can use Steam to rebind your Xbox controllers and add macro commands. I made the Left Bumper button \"toggleable\" and it made running the excavators and loaders so much easier since you have to otherwise hold LB when using your thumbsticks to dig.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i would like to see a few more things added/ thought about to make the experience greater for the more complex production builds.. first thing is a truck size between the moxy ( DX60E ) and the dump truck\r\n ( HT200 ) more or less a CAT 777 size just as it is a big step inbetween the two. also for the production side of things a way to pull only certain materials from the storage or have a splitter that only grabs certain ores so they can be processed in a different way to other materials. possibly even more outlets on the storage units that can grab certain ores that you an choose to be processed in a certain way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you like digging dirt ? \nIf you can answer yes to this then you are a dirt nerd and you NEED this game.\n\nI loved playing with my Tonka trucks in the dirt as a kid, Now get to play with the biggest and bested toy's to move dirt.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantastic game if you enjoy running machines and digging holes. and the washing, sorting and producing materials is super fun aswell",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Satisfying controls, great physics. Wonderful game!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great all around mining sim with just enough building options to keep it interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great sim, especially for the price point. Developers seem to be hard at work releasing updates with new content and improvements. Glad I made the purchase!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is what you get when you mix Gold Mining Simulator and Satisfactory together, Build a factory, Save money, Upgrade, Make more money, Become the king of the Klondike.\n\nLots of ways to mine,\nTunnel, Strip, Blast.\nLots of vehicles,\nExcavators, Wheel loaders, Dump trucks, Tunnellers, Paving machines, Rollers, Dozers, Graders, Drones. (And a lot more is being added)\n\nDifferent weathers,\nThunder storms, Snow, Fog, Cloudy, Blizzards.\n\nXP system, Quests, Skill tree.\n\nOverall the best mining game on steam, If your like me and played other mining games, The world is normally limited to a tiny plot, With this game its not the case, You can build anywhere you want! Want a base underground you can do it, Want one on top of a tree? You can do it. The developers of this game have given us the freedom todo what we want (Totally haven't sent an excavator to space).\n\nI would highly recommend you get this game if you enjoy mining. Its fun and very relaxing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It needs some more quality of life and growth but the overall basics are there. And yes, it is one of the best voxel based digging games I've seen.\nPersonal wish list:\n1 - Overhaul power systems because there is currently zero real incentive to buy anything except the top tier power lines. Current thought would be step down transformers and all power inputs have a maximum power input rating.\n2 - Conveyors carrying completed products need overhauling because there is currently no way to auto-sell refined products\n3 - Bulldozers need some cleaning up (it is currently possible to Wiley-E-Cyote them straight into the side of a mountain and leave a tunnel).\n\nOtherwise this is definitely a great game and I recommend it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got to take a bath after playing the game you fell the dirt in your clothes!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is becoming my new simulator game obsession.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game good physics enjoyable alone or with freinds",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game Had plenty of fun and got my moneys worth i do feel like it can get a bit boring in late game but with all the updates that is being constantly improved! the physics engine needs a bit more work but it seems to be improving also. highly recommend if coming from any other simulation games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "spawn in: play game how its supposed to be played\r\nget bored around level 40\r\nbuy 45 nukes\r\ntry to reach china \r\nrun out of nukes 30 mins later\r\nfree fall for a solid 30 seconds before hitting bottom of the hole\r\n10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wasnt sure if I would like this game. It has proven to be a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun and weekly updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with lots of potential",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not for everyone, but if you like heavy equipment this one is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game thanks to all the devs for the hard work",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Solid game. The most fun I've had in a while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Careful, this game is VERY addictive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good needs more build options tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game to relax after long day at work :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good, good, good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I only play this with because a youtube no cap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome keep up the good work",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sweet game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love to dig lets goooooo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dig the dirt, move the dirt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game love it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "GREAT GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dig good yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its cool",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its 67",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VCX Z",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dig Dig.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": ":3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ya",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "czdxvsdrweq",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ",",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought this game on a whim this week, seemed to check all my boxes for a game. I've only put 13 hours into the game so far but I have to stop playing for now because of a few key issues for me. \n \nPros:\n- Love the ability to start a company and literally do whatever I want to make money.\n- Vehicles are intricate and have very detailed controls\n- There are a good number of vehicle choices, albeit some very confusing and arbitrary similarities and prices.\n- Belt and pipe systems that seem to follow real world physics, to an extent.\n- Maps are huge and detailed\n- Menu and settings are straight forward and include a wide range of control options for Keyboard, controller or joystick/wheel inputs.\n- For an game designed by people that don't speak English as their primary language, the game makes 100% sense to an English native and I was able to understand everything clearly. \n\nCons:\n- The shop needs a search bar that can search based on the item you are trying to mine. I should be able to put in \"asphalt\" and see everything in the game that corresponds to that material. \n- Dirt physics are cool until they just stop acting like dirt. Example, moving dirt in an excavator or loader works great, feels good and makes sense. However, using explosives is pretty much pointless if you want to gather the materials. Dirt gets blown up, yes, but it just moves like mud and sticks to a random spot, including the inside of the conveyor belt itself, and you have to re-use explosives to get all of it into a conveyor. Frustrating. \n- Vehicles are good but way too janky in small spaces. You will be going along, mining a section of a mound out with a loader and suddenly hit a pocket of hard rock that sends your loader flying and dumping out your bucket. \n- No huge issue but worth noting, you get a lot of floating particles in the air from rock that either caved in slightly or didn't get fully scooped out and it very annoying to clean up later on. \n- While there are quests and a skill tree, it just seems a bit pointless. A sandbox game shouldn't have levels just for the sake of levels. I'd much rather have to pay for the items in the shop and have the focus of the game to make enough to afford them.\n- There is no AI or way to hire help, so be okay with 0 automation for gaining materials aside from oil. That's fine, but you will eventually hit a wall with how much you can make per hour simply based on man power.\n- Powering conveyors is a nightmare and organizing a system out of a mine is the worst part of the game imo.\n\nLast thoughts. I was 100% into this game when I started it. An open world map with the power of demolition at my control? Management of my very own company and make money how I see fit? Perfect! It has all of this yes, but what I came to discover very quickly was that the game becomes very tedious quickly. Beyond the wonky mouse and keyboard controls that you have to remap to make the game work for a human, setting up conveyor systems to haul out debris, especially from a mine in the side of a mountain, is THE WORST. Trying to figure out how to power these systems when they can only be powered at the front or end of the line is just dumb. I have zero intention to use a loader to drive out every. single. bucket. of dirt when I have a conveyor network to do that for me. This needs to be re-evaluated. Simplify it please. The system would be perfect if the power required to drive the belts was able to be placed anywhere along the sides of the belts...\n\nOverall, I think this is a solid 6/10 that will one day be even better if the devs continue to hone it in, which they seem to be doing. The idea is great, just a bit unpolished. I'll be keeping my eye on it for sure.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "fun game, great for people who love heavy equipment and factory elements",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Best game I've played in a long time 10/10\r\n\r\nGood graphics.\r\nAmazing physics.\r\nYes full recommended to any gamers.\r\nGood sound.\r\nGood driving.\r\nMultiplayer (easy to join other friends servers not like most games)\r\n\r\nMe and my son play together and haven't had this much multiplayer fun in a long time.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I love this game it is incredibly fun but I would like to see more vehicles like a bucket wheel excavator in the game it would helps a lot to reduce mountains fester",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It seems like it could be a lot of fun but the controls are really bad. even on m&k. It almost feels like you need to have an actual rig set up to be able to fully understand and enjoy the game. 5/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I am a Dwarf and im Digging a Hole.\nDiggy Diggy Hole.\n\nA Big Sandbox for you to Play around in,\nhavent tried multiplayer yet, but as my hours can confirm i got my fun out of it.\n\nPerfect game to get some slow progress while maybe watching some videos/podcasts.\n\nTo my gripes, its really hard to get a good even surface for your machines to widen your quarry,\ngot easier with the gps antenna, still finiky.\nAlso the shallowest built ramp you can get is still quite steep (25% incline).\n\nCurrently Eating away at the Hill blocking my Quarry with my quasi \"Bagger 288\" \nwhile watching some videos and silently singing bagger 288 to myself.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "by far one of the best open-world, terraforming game there is out there in my opinion",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "While it is still in development, the fact that the team posts a weekly notice every friday and a new beta update every month or so keeps things fresh and responsive. The gameplay is relaxing once you get into it, especially with the addition of the bucket wheel excavators. Building a simple processing plant doesn't take an absurd amount of time and can be figured out even without the tutorial thanks to the descriptions each item has in the shop.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I will recommend this game as it is a ton of fun once you learn the basics. I will however add that the game still needs a lot of work, most notably the physics. Vehicles are far too bouncy and need to feel a lot more weighty, especially the dozers. Digging feels very rudimentary and takes a bit of time to get use to the controls. There is a GPS in the game however it doesn't fully work as it's more grade awareness and doesn't have auto mode to lock in the grade. But other than that the game is really fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "soo relaxing chilled game and my kids are learning the vic and how hard working is in the mining world",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I want to update my review since I have been doing some experiments lately. After all the recent updates, I began having issues running the game. I have since started two new games, not deleting the old, that's too many hours to lose. Both seem to be running perfectly fine minus an occasional graphics glitch here and there, nothing major. But the fact that the updates have messed with old game saves, is irritating. Nothing I read in the updates mentioned that it would require nor cause issues with the saves we already had. This is not the original game, this all the new stuff. I didn't get to enjoy the original game, old conveyors, etc. That proves to me even more it is a game issue, not a pc issue. I have ran a standard and creative mode. I have ran in single and multiplayer. Lagging is gone. However the maps I have so many hours in, are useless. \nOver 400 hours in....This game has it's problems like any other game does. Yes updates may be slow but they do work to make the game better. This game has a ton of potential and it is unique, please don't waste it. The bugs are irritating but the game is still fun and enjoyable to all. I still highly recommend this to everyone.\n\nIssues that I experience are as follows:\nThe lag is terrible. Didn't have this issue before all these new updates. I don't believe for a moment that it is my gaming pc that is causing the problems. I run games with much higher demands with no issues. PC brand new in August 2024. Played this without lagging just fine. The dirt roller is slow as it is, the lag makes it 3 times worse. No difference between first or second gear the lag is so bad. Lasts a minimum of 10 seconds to indefinite depending on what equipment you are using. Also varies by each load in. Can load the game and it play fine for a while or it may do it immediately. \nThe machines are what seem to be too light weight, causing them to jump, slide, and inconveniently move around.\nMultiplayer is now requiring people to change their regions on steam which can result in licensing issues especially if you don't remember to switch it back. Didn't have this issue prior to the updates either. \nI have changed every setting on my pc to render this problem giving the game permission to rewrite my pc if it wanted to. I have uninstalled and reinstalled it. I have uninstalled and reinstalled Steam. I have changed regions, I have changed steam settings. This is not a pc issue. This is as the response to my ticket stated, a problem with the game. I know others having the same issues with the lagging. \nThe game will not run over 20 fps and at best runs steady at 10 fps. Wide range of 3 fps to 24 fps at best during and in between lagging. It will run up to 60 fps while loading into the game, not after. I'm told it demands 60 fps. I have no restrictions on what this game can run. \nIt is a fun game but it will not be enjoyable until these bugs are fixed. I don't care what equipment, machines, etc are added. It just won't be enjoyable in it's current state. \nI do recommend it. It has a lot of potential. Once the bugs are fixed it will be an amazing game once more. With consistent updates, it is worth checking back occasionally to see if the problems have been fixed. There is not another game like this on the market yet. \nMy advice is, don't throw away a decades worth of work. Fix it so it is playable and enjoyable. What good is new stuff if the game can't hadle it?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game has came a long ways. When I first bought it a year or two ago, the shopping and construction side of the game was, inconvenient at best, and the game was a mess. Now, thats all been refined, things snap properly, etc, shopping is so much simpler now. What I WOULD like to see, is multiplayer allows each player to have their own company; its kinda a big ask to expect friends to join your game only to share one company, and then only as workers. It would be nice if the ground had a little more resistance to bulldozing and digging, its still not as janky as logs are in FS22 though. The game is absolutely playable now, but you have to spend some time thinking about where and how you are building your infrastructure. And, yeah if your washplant doesnt get water, you have to run a powerline directly to the water pump sometimes because power isn't conducted by the conveyor belts. And, if you use the drill on the excavator, theres a little sign on the side that tells iyou what you are drilling into... Other than that, well, the name of the equipment should be fairly self explanatory at what it does and then look at the diagrams provided in the shop for them to see how they should hook up to your operation you've planned. And you still need the small stations for turning various things into usable things especially at the beginning. The small washplants for your gems, the small ore smelter for your aluminum and stuff.. Just trying to give everyone some quick help for what are sure to be problems right now. :) But hey, developers, please, give us the option to have multiplayer games with each player having their own company?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you try mining in FS22/25 and just can't find it impressive, this game definitely scratches that itch. It is a work in progress, but the devs have a clear and exciting roadmap. Some of the physics are a bit questionable, like it being almost impossible to dig out a flat surface with a dozer or grater, but hopefully it gets some attention. Also, not sure why steam says it's not deck compatible, I run it with no problems on deck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The kind of game you can play and then wonder where the time went you could feel like you have been playing for a hour but in reality its been 5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This f***in game man hooooooooly i bought it yesterday and i have 13hrs played in a day....i cant stop...i must keep the plant fed....i gotta make the hole deeper and wider.....fuck i need a bigger loader....oh let me set up this oil stuff for some money.....time to upgrader the loader.....holy shit the hole is getting pretty big.....ohhhhh fuck its 4am?!?!?!? \n\n-Me the first night playing this game   \n\n14/10 cant wait for more updates \n(ive gotten 2 friends also addicted. this game fucks heavy)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game would definitely recommend big machines worth 24.99 dollars",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, always enjoyable to play, and always happy to see them updating the game constantly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was looking for a heavy equipment simulator to use my joysticks. Found this on youtube. Bought it in the short time ive played its always getting better with updates. The greatest mining game ever. Is here want a excavator sim. Dozer etc. This is the one. Keep up the great work this small team amazes me every update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very active development and game is constantly changing. Had it from day 1 and it's a completely different game.\n\nIt is exactly what you would expect it to be. Dig ore, produce ingots, make components, sell. Or just dig to your heart's content -- choice is yours!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game for it's ever growing content and realism, the bar of potential raises higher and higher after each and every update. There is no other that exists that comes close to competing for the spot which this game currently holds, this is truly a hidden one of a kind gem in it's field. \r\n\r\nI appreciate how dedicated, interested and invested the developers are pertaining to their product, especially their community; You can feel both the love and the passion they have radiating off their game and through the people who support it. I'm always looking forward and excited to receiving and reading through the routine Friday news posts every week concerning the game's future development and continued progress.\r\n\r\nThis game has come a long way throughout the past years, I myself and many others that share similar beliefs and interests hope that it remains that way and continues to thrive for the many more to come; It would be a great and devastating loss otherwise, I hope and wish that day never comes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such potential! how love!\nbeautifully caring development adding new stuff and refining the older features. want more, can't wait!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I absolutally love the game and the concept of the game i just wish there was achivement so you had something to work for. but other than the the friday news the regualr content updates are brillient.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some people can play in a sandbox in real life. Some are wvwn payed for this\nThe others can buy this game and also have some fun.\n\nGood:\n- It runs well on medicore PC (shadows -> low and you are ok)\n- Vehicle physics is good\n- Terraforming is great\n- You can dig deep, very deep \n- You can run a processing plant of your own design\n- You can earn money (virtual ;)) \n- You can play with firends or even some random people\n- Active devs\n- Many maps\n\nBad:\n- Your GPU will go crazy (but only on shadows -> high settings)\n- It takes a lot of time. Especially if you are alone\n- It still needs some polishing but so far it is very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Large number of vehicles,  huuuge maps to explore, and a great way to spend your hours.\nFun alone, great with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played a good bit. It can feel kinda clunky at times, but its very much a labor of love. Updates are super regular, Dev's keep us in the loop. New fun toys appear. I've loved this game since I started playing it. Can't wait to remove more mountains!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great fun with a group of friends!\r\nCool and most important, working mechanics.\r\n\r\nLot's of stuff to do in-game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it.  And for me to say I like a game this day and age is a huge accomplishment. Bravo dev team.\n\nIt is like Satisfactory, Minecraft and a Construction Simulator game had an orgy and this is the child they spawned.\n\nI usually return games into two hours of it doesn’t interest me, but I went through the tutorial for around an hour, and I then blew past several hours in my own open world in the Arctic.  I am still figuring things out.  But there is a lot going on.  For example, I picked a mountain to excavate, bulldozed the side of it to square it up, got a grader to smooth out the road to my planned entrance, then got my mining excavators to start burring hole in it.  That quickly became too much hauling dirt out even after buying a dump truck so now that I hit Pay dirt I had to build a conveyor system to sort out things like diamond ore, gold ore, rubys, etc.  I have everything powered by 3 big ass windmills right now.  Got it in storage silo.  Figured out I can sell dirt once it is a waste product.  Tried a fuel setup but too tedious to keep filling it.  I hear you can find oil, haven’t got to that point.  Trying to figure out how to refine the ore, tried to make a smelter but spilled a bunch of melted ore on the ground, reloaded A quick save lol.\n\nThis game is scratching an itch I didn’t know I had.  So glad I didn’t buy construction simulator or “road craft” and bought this instead.  Snow runner got boring for me.  This is a nice depature.\n\nYou can run around in here. Get out and scope out things.  Something I feel is missing in the Snowrunner games.  The environment is fully destructible.  Can even use a pick axe to dig or a hammer to break things up.\nDug too much and had to add some dirt back.  Dug put a loft but a stair case and a bed.  It is raining all the time and lightning in the attic for some reason lol.  \n\nThe amount of equipment is kind of overwhelming at first but it is good it is so diverse and vast, allows for more fun.\n\nRight now I can see how I am reaching a man power issue.  I can only do so much and some things like hiring another AI operator or several would be nice.  I got 3 mining tunnelers going at different levels. \n\nIt is fun, 10 hours spent in only like 3 days and I want to play more, but have adult responsibilities lol.\n\nIt is like what I always dreamed of doing when I was a kid with my metal tonka trucks.\n\nIf I ever struck it rich I would start a mining company as an excuse to dig holes in a ground lol.   Be like a modern day Yukon Cornelius, licking my pick axe and looking for gold. \n\nThe digging is unlimited as far as I can tell.  I’m literally carving out a mountain one truck load at a time.  Really awesome.  I am sure it may become boring at some point.  But that maybe be when I reach the center of the earth if there is one.  Right now I’m practicing the art of placing  steel ceiling and wall skills lol.\n\nNot sure if the mine can collapse, I started seeing dirt and rock fall down so starting bracing everything and laying concrete floors.\n\nAwesome is all I can say.  Don’t know what the hell I am doing but having fun doing it lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. I have been having fun. Of course their are still bugs, but still and enjoyable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Alot of brainpower needed sometimes when you scale your factory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a former coal miner (surface 6yrs/underground 7rs), we finally have our game :). I love everything about this game. Once you learn the mechanics it is hard to peel yourself away from production. Yet to play online, only solo. I do wished they would add an actual Joy style continuous miner, and dreaming one day maybe a highwall miner lol, one can dream",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Good concept. Not ready yet. Lots of bugs and controls aren't ready.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The main task of the game, at least in the beginning, is to drive the loader and load dirt or paydirt in the hopper or the sell point. To do this with a mouse and keyboard, you need to play a lot with the loader's bucket and arm. However, the controls for those are very unintuitive, and if you're not very careful at how you set the bucket on the ground, you will make a mess, either by digging too much or not enough into the ground. Therefore, it's quite difficult, if not impossible, to control how deep you want to dig, or how flat you want the ground to be with a loader. Maybe the dozer can do a better job at that, but no dozer is available in the beginning of the game. This lack of control makes the gameplay annoying. I'll wait a year or two before trying this game again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THREE year old game and we rely on setting up a convoluted and unnecessary conveyor system just to get more than 5400KW of power. I get this is a game, but where you came up with the idea of using conveyors to get more power without blowing poles is beyond me. Make it so you can separate your main supply into a grid and put in larger capacity poles.\r\n\r\nSecond, limiting us to 60FPS because anything more will cause serious lag is insane. Upgrade your server. Fix your spaghetti code. \r\n\r\nThis is a decent game, but in reality I wouldn't recommend buying it unless it's on sale as there's far too much that just doesn't make sense and too many issues. The devs can use tools other similar games did to combat such issues but they just refuse to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Worst game i have ever played. tutorial is horrible also the sounds for all vehicles are the same. overall not worth 20 dollars",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cool idea and game, but it has serious issues with Memory usage, literally bricked my whole pc that has a 4060 and 32GB of memory...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Way too immature release. Free play test maybe. But an early access, well. No. That's wayyyy tooooooo early. But not even marketing as an early acess? That's just basically scamming people. Took 3 hours to get the washplant work. All it did was converted valuable paydirt into worthless dirt 1:1 ratio.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "building is super janky, they could have done alot betterr",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is a really good game and has amazing potential but there is one absolute major floor in the dirt physics you have a potentially a 20 ton loader/dozers and all the vehicles in fact that get stuck on a tiny mound of dirt the bucket on the loader being pushed away by the smallest amount of dirt moving the hole vehicle off line and same with the dozers and all vehicles makes this part of the game completely broke the devs need to sort this considering the game has been out for 3 years they seem to be more interested in adding more different types of vehicles etc. fix the dam dirt physics please",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EDIT: Last Update seemed to improve physics a bit though not documented - gonna play a bit more and see.\nUnfortunately the vehicle physics are just far too wonky for this to be enjoyable. In the short time I have been playing, the vehicles are weightless and have been bouncing around constantly, flipping if a single dropped piece of dirt hits the floor near your vehicle (which is constant and unavoidable). I can handle somewhat janky physics or gameplay, but unfortunately the core part of the gameplay, the vehicles, are downright undrivable.\n\nAlso, default settings have a deadzone.... for mouse and keyboard? Who ever wants a deadzone when looking around via mouse? And each movement (up, down, left, right, individually for Vehicle, Third Person and First person!) needs to be manually set. 16 changes to simply reduce mouse sensitivity or remove the pointless mouse deadzone?\n\nThe game has potential, but if you are fighting the game to even start playing, and then suffering the main mechanics, its just not recommendable. I may return if vehicle physics are updated.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Devs are creating something good here, don't get me wrong,(There isn't a maybe button),  but this new release/ update changes too much for the worse and adds alot of annoying things that you can't get rid of/ turn off, it's like they hadn't thought about it and released a pile that feels further behindd than the previous version, and it's likely that any time you put into it now, will be deleted again.\n\nThen they say \"it's ok you can always roll back... \" --You can, but to a point where alot of content is missing (A long time ago) and all of your old saves have already been deleted by updating.\n\nI've had to turn most noises off due to the audio screw up, alot of noises obscenely loud and you cant turn them down without kulling other noises, that said, i can't turn them back on again, audio is all messed up. going to try fresh install, all i wanted to do was dig some holes but now it's turned into a two afternoon bs fest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really really tried to like this game but the controls are god awful it's impossible to place anything down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who thought that this initial controller set up was good? It is maddening how yall had to go and do something against the norm when the norm was perfectly fine. And then to echo others about the how poor the flattening ability is in this game is interesting to say the least considering this is a mining game. And the connecting wash plants and conveyors during the tutorial were very annoying to get to snap in place and be accepted. If it wasnt for youtube and seeing some of the stuff you can do in here I would thumbs down, uninstall the game and ask for a refund because it hasnt been enjoyable at all. \n\nwell since i have to leave a recommend or not and cant be undecided Ill have to go with not recommended as it fits my experience better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the worst controls ever. Theres alot of potential in this game if you're into simulator games. But the vehicle controls are the reason why its a no for me rn.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I kind of liked the idea. \nA few points\n* I use steam for it's easy but this game doesn't have cloud save. So no sync of save between computer or reinstall, that shouldn't be allowed for a game on steam. \n* I like hard core mode, but why can't you start without money? Chopping down a few trees and you got plenty of money. \n* Gold is less worth than wood, a bit strange?\n* Color of ground is supposed to indicate if there is ore below. Is this the best way? You rarely dig straight downwards anyway. \n* Was kind of fun to combine different things, but the game is lacking so much what the pieces do.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game mechanics are terrible graphics are bad. Has a lot of graphical and sound glitches. Bad tutorial for your first time. Would not recommend this game to anyone unless if it is on sale for a couple dollars which seems this game should only be valued for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has the steepest learning curve of any game i've played. Nothing is explained well as to how the mechanics work, and lead to hours of trying to find tutorials on how to do different things with no good answers found. This game gave me nothing but frustration, and I believe that after 5 hours of game-play you should have a pretty good idea on how to get going, but this is not the case. \r\nBased on my experience, plan on 10+ hours of in game time before you have the faintest idea of how to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cool idea and game, but it has serious issues with Memory usage, literally bricked my whole pc that has a 4060 and 32GB of memory...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In time, maybe - but right now it's a mile wide and an inch deep. Prices of vehicles are senseless, things are gated with almost no real logic by levels which go excrutiatingly slow (yes you can change level speed to a degree) but the real issues are how unnecessarily difficult it is to do ANYTHING. Dozers spanw dirt magically, buckets pick up dirt upside down, dirt physics are hilariously bad, there's so little information and simultaneously too much (you get more than you need but not for the things you need) and there are things that you have to do with levels of painful manual intervention that after this amount of time are staggeringly concerning.\r\n\r\nI'll come back to it in a year.,..or five, but for now it's just more trouble than it's worth.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "THREE year old game and we rely on setting up a convoluted and unnecessary conveyor system just to get more than 5400KW of power. I get this is a game, but where you came up with the idea of using conveyors to get more power without blowing poles is beyond me. Make it so you can separate your main supply into a grid and put in larger capacity poles.\r\n\r\nSecond, limiting us to 60FPS because anything more will cause serious lag is insane. Upgrade your server. Fix your spaghetti code. \r\n\r\nThis is a decent game, but in reality I wouldn't recommend buying it unless it's on sale as there's far too much that just doesn't make sense and too many issues. The devs can use tools other similar games did to combat such issues but they just refuse to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good concept. Not ready yet. Lots of bugs and controls aren't ready.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too immature release. Free play test maybe. But an early access, well. No. That's wayyyy tooooooo early. But not even marketing as an early acess? That's just basically scamming people. Took 3 hours to get the washplant work. All it did was converted valuable paydirt into worthless dirt 1:1 ratio.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game i have ever played. tutorial is horrible also the sounds for all vehicles are the same. overall not worth 20 dollars",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Controls are awful... This is more like \" Dig where you don't want to and then repair-simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "inexperienced developer team. You can tell right off the rip as soon as you load into the game. very poor design and lots of areas and parts of the game you can tell the devs are lazy and have no idea what they are doing. Looks like a few nerdy friends that got picked on in highschool wanted payback by scamming everyone for this  game. Its been 6 months sinse an update. Why are these guys charging $25 dollars for an alpha stage game. I mean i have very little experience developing and i could make a better game than this. Its literally like some friends threw some pig shit together and threw it on the steam store cause they needed some money. its a joke. If i hadnt reached my limit on steam refunds for the year. This game would be refunded 100%. Ill come check it out again in 25 years when the devs release the next update.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The main task of the game, at least in the beginning, is to drive the loader and load dirt or paydirt in the hopper or the sell point. To do this with a mouse and keyboard, you need to play a lot with the loader's bucket and arm. However, the controls for those are very unintuitive, and if you're not very careful at how you set the bucket on the ground, you will make a mess, either by digging too much or not enough into the ground. Therefore, it's quite difficult, if not impossible, to control how deep you want to dig, or how flat you want the ground to be with a loader. Maybe the dozer can do a better job at that, but no dozer is available in the beginning of the game. This lack of control makes the gameplay annoying. I'll wait a year or two before trying this game again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "building is super janky, they could have done alot betterr",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "unless you know someone with endless hours on this game goodluck doing anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is a really good game and has amazing potential but there is one absolute major floor in the dirt physics you have a potentially a 20 ton loader/dozers and all the vehicles in fact that get stuck on a tiny mound of dirt the bucket on the loader being pushed away by the smallest amount of dirt moving the hole vehicle off line and same with the dozers and all vehicles makes this part of the game completely broke the devs need to sort this considering the game has been out for 3 years they seem to be more interested in adding more different types of vehicles etc. fix the dam dirt physics please",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EDIT: Last Update seemed to improve physics a bit though not documented - gonna play a bit more and see.\nUnfortunately the vehicle physics are just far too wonky for this to be enjoyable. In the short time I have been playing, the vehicles are weightless and have been bouncing around constantly, flipping if a single dropped piece of dirt hits the floor near your vehicle (which is constant and unavoidable). I can handle somewhat janky physics or gameplay, but unfortunately the core part of the gameplay, the vehicles, are downright undrivable.\n\nAlso, default settings have a deadzone.... for mouse and keyboard? Who ever wants a deadzone when looking around via mouse? And each movement (up, down, left, right, individually for Vehicle, Third Person and First person!) needs to be manually set. 16 changes to simply reduce mouse sensitivity or remove the pointless mouse deadzone?\n\nThe game has potential, but if you are fighting the game to even start playing, and then suffering the main mechanics, its just not recommendable. I may return if vehicle physics are updated.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Devs are creating something good here, don't get me wrong,(There isn't a maybe button),  but this new release/ update changes too much for the worse and adds alot of annoying things that you can't get rid of/ turn off, it's like they hadn't thought about it and released a pile that feels further behindd than the previous version, and it's likely that any time you put into it now, will be deleted again.\n\nThen they say \"it's ok you can always roll back... \" --You can, but to a point where alot of content is missing (A long time ago) and all of your old saves have already been deleted by updating.\n\nI've had to turn most noises off due to the audio screw up, alot of noises obscenely loud and you cant turn them down without kulling other noises, that said, i can't turn them back on again, audio is all messed up. going to try fresh install, all i wanted to do was dig some holes but now it's turned into a two afternoon bs fest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really really tried to like this game but the controls are god awful it's impossible to place anything down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who thought that this initial controller set up was good? It is maddening how yall had to go and do something against the norm when the norm was perfectly fine. And then to echo others about the how poor the flattening ability is in this game is interesting to say the least considering this is a mining game. And the connecting wash plants and conveyors during the tutorial were very annoying to get to snap in place and be accepted. If it wasnt for youtube and seeing some of the stuff you can do in here I would thumbs down, uninstall the game and ask for a refund because it hasnt been enjoyable at all. \n\nwell since i have to leave a recommend or not and cant be undecided Ill have to go with not recommended as it fits my experience better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the worst controls ever. Theres alot of potential in this game if you're into simulator games. But the vehicle controls are the reason why its a no for me rn.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I kind of liked the idea. \nA few points\n* I use steam for it's easy but this game doesn't have cloud save. So no sync of save between computer or reinstall, that shouldn't be allowed for a game on steam. \n* I like hard core mode, but why can't you start without money? Chopping down a few trees and you got plenty of money. \n* Gold is less worth than wood, a bit strange?\n* Color of ground is supposed to indicate if there is ore below. Is this the best way? You rarely dig straight downwards anyway. \n* Was kind of fun to combine different things, but the game is lacking so much what the pieces do.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game mechanics are terrible graphics are bad. Has a lot of graphical and sound glitches. Bad tutorial for your first time. Would not recommend this game to anyone unless if it is on sale for a couple dollars which seems this game should only be valued for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has the steepest learning curve of any game i've played. Nothing is explained well as to how the mechanics work, and lead to hours of trying to find tutorials on how to do different things with no good answers found. This game gave me nothing but frustration, and I believe that after 5 hours of game-play you should have a pretty good idea on how to get going, but this is not the case. \r\nBased on my experience, plan on 10+ hours of in game time before you have the faintest idea of how to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cool idea and game, but it has serious issues with Memory usage, literally bricked my whole pc that has a 4060 and 32GB of memory...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In time, maybe - but right now it's a mile wide and an inch deep. Prices of vehicles are senseless, things are gated with almost no real logic by levels which go excrutiatingly slow (yes you can change level speed to a degree) but the real issues are how unnecessarily difficult it is to do ANYTHING. Dozers spanw dirt magically, buckets pick up dirt upside down, dirt physics are hilariously bad, there's so little information and simultaneously too much (you get more than you need but not for the things you need) and there are things that you have to do with levels of painful manual intervention that after this amount of time are staggeringly concerning.\r\n\r\nI'll come back to it in a year.,..or five, but for now it's just more trouble than it's worth.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "THREE year old game and we rely on setting up a convoluted and unnecessary conveyor system just to get more than 5400KW of power. I get this is a game, but where you came up with the idea of using conveyors to get more power without blowing poles is beyond me. Make it so you can separate your main supply into a grid and put in larger capacity poles.\r\n\r\nSecond, limiting us to 60FPS because anything more will cause serious lag is insane. Upgrade your server. Fix your spaghetti code. \r\n\r\nThis is a decent game, but in reality I wouldn't recommend buying it unless it's on sale as there's far too much that just doesn't make sense and too many issues. The devs can use tools other similar games did to combat such issues but they just refuse to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good concept. Not ready yet. Lots of bugs and controls aren't ready.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too immature release. Free play test maybe. But an early access, well. No. That's wayyyy tooooooo early. But not even marketing as an early acess? That's just basically scamming people. Took 3 hours to get the washplant work. All it did was converted valuable paydirt into worthless dirt 1:1 ratio.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game i have ever played. tutorial is horrible also the sounds for all vehicles are the same. overall not worth 20 dollars",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Controls are awful... This is more like \" Dig where you don't want to and then repair-simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "inexperienced developer team. You can tell right off the rip as soon as you load into the game. very poor design and lots of areas and parts of the game you can tell the devs are lazy and have no idea what they are doing. Looks like a few nerdy friends that got picked on in highschool wanted payback by scamming everyone for this  game. Its been 6 months sinse an update. Why are these guys charging $25 dollars for an alpha stage game. I mean i have very little experience developing and i could make a better game than this. Its literally like some friends threw some pig shit together and threw it on the steam store cause they needed some money. its a joke. If i hadnt reached my limit on steam refunds for the year. This game would be refunded 100%. Ill come check it out again in 25 years when the devs release the next update.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The main task of the game, at least in the beginning, is to drive the loader and load dirt or paydirt in the hopper or the sell point. To do this with a mouse and keyboard, you need to play a lot with the loader's bucket and arm. However, the controls for those are very unintuitive, and if you're not very careful at how you set the bucket on the ground, you will make a mess, either by digging too much or not enough into the ground. Therefore, it's quite difficult, if not impossible, to control how deep you want to dig, or how flat you want the ground to be with a loader. Maybe the dozer can do a better job at that, but no dozer is available in the beginning of the game. This lack of control makes the gameplay annoying. I'll wait a year or two before trying this game again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "building is super janky, they could have done alot betterr",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "unless you know someone with endless hours on this game goodluck doing anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is a really good game and has amazing potential but there is one absolute major floor in the dirt physics you have a potentially a 20 ton loader/dozers and all the vehicles in fact that get stuck on a tiny mound of dirt the bucket on the loader being pushed away by the smallest amount of dirt moving the hole vehicle off line and same with the dozers and all vehicles makes this part of the game completely broke the devs need to sort this considering the game has been out for 3 years they seem to be more interested in adding more different types of vehicles etc. fix the dam dirt physics please",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EDIT: Last Update seemed to improve physics a bit though not documented - gonna play a bit more and see.\nUnfortunately the vehicle physics are just far too wonky for this to be enjoyable. In the short time I have been playing, the vehicles are weightless and have been bouncing around constantly, flipping if a single dropped piece of dirt hits the floor near your vehicle (which is constant and unavoidable). I can handle somewhat janky physics or gameplay, but unfortunately the core part of the gameplay, the vehicles, are downright undrivable.\n\nAlso, default settings have a deadzone.... for mouse and keyboard? Who ever wants a deadzone when looking around via mouse? And each movement (up, down, left, right, individually for Vehicle, Third Person and First person!) needs to be manually set. 16 changes to simply reduce mouse sensitivity or remove the pointless mouse deadzone?\n\nThe game has potential, but if you are fighting the game to even start playing, and then suffering the main mechanics, its just not recommendable. I may return if vehicle physics are updated.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Devs are creating something good here, don't get me wrong,(There isn't a maybe button),  but this new release/ update changes too much for the worse and adds alot of annoying things that you can't get rid of/ turn off, it's like they hadn't thought about it and released a pile that feels further behindd than the previous version, and it's likely that any time you put into it now, will be deleted again.\n\nThen they say \"it's ok you can always roll back... \" --You can, but to a point where alot of content is missing (A long time ago) and all of your old saves have already been deleted by updating.\n\nI've had to turn most noises off due to the audio screw up, alot of noises obscenely loud and you cant turn them down without kulling other noises, that said, i can't turn them back on again, audio is all messed up. going to try fresh install, all i wanted to do was dig some holes but now it's turned into a two afternoon bs fest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really really tried to like this game but the controls are god awful it's impossible to place anything down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who thought that this initial controller set up was good? It is maddening how yall had to go and do something against the norm when the norm was perfectly fine. And then to echo others about the how poor the flattening ability is in this game is interesting to say the least considering this is a mining game. And the connecting wash plants and conveyors during the tutorial were very annoying to get to snap in place and be accepted. If it wasnt for youtube and seeing some of the stuff you can do in here I would thumbs down, uninstall the game and ask for a refund because it hasnt been enjoyable at all. \n\nwell since i have to leave a recommend or not and cant be undecided Ill have to go with not recommended as it fits my experience better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the worst controls ever. Theres alot of potential in this game if you're into simulator games. But the vehicle controls are the reason why its a no for me rn.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I kind of liked the idea. \nA few points\n* I use steam for it's easy but this game doesn't have cloud save. So no sync of save between computer or reinstall, that shouldn't be allowed for a game on steam. \n* I like hard core mode, but why can't you start without money? Chopping down a few trees and you got plenty of money. \n* Gold is less worth than wood, a bit strange?\n* Color of ground is supposed to indicate if there is ore below. Is this the best way? You rarely dig straight downwards anyway. \n* Was kind of fun to combine different things, but the game is lacking so much what the pieces do.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game mechanics are terrible graphics are bad. Has a lot of graphical and sound glitches. Bad tutorial for your first time. Would not recommend this game to anyone unless if it is on sale for a couple dollars which seems this game should only be valued for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has the steepest learning curve of any game i've played. Nothing is explained well as to how the mechanics work, and lead to hours of trying to find tutorials on how to do different things with no good answers found. This game gave me nothing but frustration, and I believe that after 5 hours of game-play you should have a pretty good idea on how to get going, but this is not the case. \r\nBased on my experience, plan on 10+ hours of in game time before you have the faintest idea of how to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cool idea and game, but it has serious issues with Memory usage, literally bricked my whole pc that has a 4060 and 32GB of memory...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In time, maybe - but right now it's a mile wide and an inch deep. Prices of vehicles are senseless, things are gated with almost no real logic by levels which go excrutiatingly slow (yes you can change level speed to a degree) but the real issues are how unnecessarily difficult it is to do ANYTHING. Dozers spanw dirt magically, buckets pick up dirt upside down, dirt physics are hilariously bad, there's so little information and simultaneously too much (you get more than you need but not for the things you need) and there are things that you have to do with levels of painful manual intervention that after this amount of time are staggeringly concerning.\r\n\r\nI'll come back to it in a year.,..or five, but for now it's just more trouble than it's worth.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "THREE year old game and we rely on setting up a convoluted and unnecessary conveyor system just to get more than 5400KW of power. I get this is a game, but where you came up with the idea of using conveyors to get more power without blowing poles is beyond me. Make it so you can separate your main supply into a grid and put in larger capacity poles.\r\n\r\nSecond, limiting us to 60FPS because anything more will cause serious lag is insane. Upgrade your server. Fix your spaghetti code. \r\n\r\nThis is a decent game, but in reality I wouldn't recommend buying it unless it's on sale as there's far too much that just doesn't make sense and too many issues. The devs can use tools other similar games did to combat such issues but they just refuse to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good concept. Not ready yet. Lots of bugs and controls aren't ready.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too immature release. Free play test maybe. But an early access, well. No. That's wayyyy tooooooo early. But not even marketing as an early acess? That's just basically scamming people. Took 3 hours to get the washplant work. All it did was converted valuable paydirt into worthless dirt 1:1 ratio.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game i have ever played. tutorial is horrible also the sounds for all vehicles are the same. overall not worth 20 dollars",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Controls are awful... This is more like \" Dig where you don't want to and then repair-simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "inexperienced developer team. You can tell right off the rip as soon as you load into the game. very poor design and lots of areas and parts of the game you can tell the devs are lazy and have no idea what they are doing. Looks like a few nerdy friends that got picked on in highschool wanted payback by scamming everyone for this  game. Its been 6 months sinse an update. Why are these guys charging $25 dollars for an alpha stage game. I mean i have very little experience developing and i could make a better game than this. Its literally like some friends threw some pig shit together and threw it on the steam store cause they needed some money. its a joke. If i hadnt reached my limit on steam refunds for the year. This game would be refunded 100%. Ill come check it out again in 25 years when the devs release the next update.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The main task of the game, at least in the beginning, is to drive the loader and load dirt or paydirt in the hopper or the sell point. To do this with a mouse and keyboard, you need to play a lot with the loader's bucket and arm. However, the controls for those are very unintuitive, and if you're not very careful at how you set the bucket on the ground, you will make a mess, either by digging too much or not enough into the ground. Therefore, it's quite difficult, if not impossible, to control how deep you want to dig, or how flat you want the ground to be with a loader. Maybe the dozer can do a better job at that, but no dozer is available in the beginning of the game. This lack of control makes the gameplay annoying. I'll wait a year or two before trying this game again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "building is super janky, they could have done alot betterr",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "unless you know someone with endless hours on this game goodluck doing anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is a really good game and has amazing potential but there is one absolute major floor in the dirt physics you have a potentially a 20 ton loader/dozers and all the vehicles in fact that get stuck on a tiny mound of dirt the bucket on the loader being pushed away by the smallest amount of dirt moving the hole vehicle off line and same with the dozers and all vehicles makes this part of the game completely broke the devs need to sort this considering the game has been out for 3 years they seem to be more interested in adding more different types of vehicles etc. fix the dam dirt physics please",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EDIT: Last Update seemed to improve physics a bit though not documented - gonna play a bit more and see.\nUnfortunately the vehicle physics are just far too wonky for this to be enjoyable. In the short time I have been playing, the vehicles are weightless and have been bouncing around constantly, flipping if a single dropped piece of dirt hits the floor near your vehicle (which is constant and unavoidable). I can handle somewhat janky physics or gameplay, but unfortunately the core part of the gameplay, the vehicles, are downright undrivable.\n\nAlso, default settings have a deadzone.... for mouse and keyboard? Who ever wants a deadzone when looking around via mouse? And each movement (up, down, left, right, individually for Vehicle, Third Person and First person!) needs to be manually set. 16 changes to simply reduce mouse sensitivity or remove the pointless mouse deadzone?\n\nThe game has potential, but if you are fighting the game to even start playing, and then suffering the main mechanics, its just not recommendable. I may return if vehicle physics are updated.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Devs are creating something good here, don't get me wrong,(There isn't a maybe button),  but this new release/ update changes too much for the worse and adds alot of annoying things that you can't get rid of/ turn off, it's like they hadn't thought about it and released a pile that feels further behindd than the previous version, and it's likely that any time you put into it now, will be deleted again.\n\nThen they say \"it's ok you can always roll back... \" --You can, but to a point where alot of content is missing (A long time ago) and all of your old saves have already been deleted by updating.\n\nI've had to turn most noises off due to the audio screw up, alot of noises obscenely loud and you cant turn them down without kulling other noises, that said, i can't turn them back on again, audio is all messed up. going to try fresh install, all i wanted to do was dig some holes but now it's turned into a two afternoon bs fest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really really tried to like this game but the controls are god awful it's impossible to place anything down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who thought that this initial controller set up was good? It is maddening how yall had to go and do something against the norm when the norm was perfectly fine. And then to echo others about the how poor the flattening ability is in this game is interesting to say the least considering this is a mining game. And the connecting wash plants and conveyors during the tutorial were very annoying to get to snap in place and be accepted. If it wasnt for youtube and seeing some of the stuff you can do in here I would thumbs down, uninstall the game and ask for a refund because it hasnt been enjoyable at all. \n\nwell since i have to leave a recommend or not and cant be undecided Ill have to go with not recommended as it fits my experience better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the worst controls ever. Theres alot of potential in this game if you're into simulator games. But the vehicle controls are the reason why its a no for me rn.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I kind of liked the idea. \nA few points\n* I use steam for it's easy but this game doesn't have cloud save. So no sync of save between computer or reinstall, that shouldn't be allowed for a game on steam. \n* I like hard core mode, but why can't you start without money? Chopping down a few trees and you got plenty of money. \n* Gold is less worth than wood, a bit strange?\n* Color of ground is supposed to indicate if there is ore below. Is this the best way? You rarely dig straight downwards anyway. \n* Was kind of fun to combine different things, but the game is lacking so much what the pieces do.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game mechanics are terrible graphics are bad. Has a lot of graphical and sound glitches. Bad tutorial for your first time. Would not recommend this game to anyone unless if it is on sale for a couple dollars which seems this game should only be valued for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has the steepest learning curve of any game i've played. Nothing is explained well as to how the mechanics work, and lead to hours of trying to find tutorials on how to do different things with no good answers found. This game gave me nothing but frustration, and I believe that after 5 hours of game-play you should have a pretty good idea on how to get going, but this is not the case. \r\nBased on my experience, plan on 10+ hours of in game time before you have the faintest idea of how to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cool idea and game, but it has serious issues with Memory usage, literally bricked my whole pc that has a 4060 and 32GB of memory...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In time, maybe - but right now it's a mile wide and an inch deep. Prices of vehicles are senseless, things are gated with almost no real logic by levels which go excrutiatingly slow (yes you can change level speed to a degree) but the real issues are how unnecessarily difficult it is to do ANYTHING. Dozers spanw dirt magically, buckets pick up dirt upside down, dirt physics are hilariously bad, there's so little information and simultaneously too much (you get more than you need but not for the things you need) and there are things that you have to do with levels of painful manual intervention that after this amount of time are staggeringly concerning.\r\n\r\nI'll come back to it in a year.,..or five, but for now it's just more trouble than it's worth.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "THREE year old game and we rely on setting up a convoluted and unnecessary conveyor system just to get more than 5400KW of power. I get this is a game, but where you came up with the idea of using conveyors to get more power without blowing poles is beyond me. Make it so you can separate your main supply into a grid and put in larger capacity poles.\r\n\r\nSecond, limiting us to 60FPS because anything more will cause serious lag is insane. Upgrade your server. Fix your spaghetti code. \r\n\r\nThis is a decent game, but in reality I wouldn't recommend buying it unless it's on sale as there's far too much that just doesn't make sense and too many issues. The devs can use tools other similar games did to combat such issues but they just refuse to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good concept. Not ready yet. Lots of bugs and controls aren't ready.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Way too immature release. Free play test maybe. But an early access, well. No. That's wayyyy tooooooo early. But not even marketing as an early acess? That's just basically scamming people. Took 3 hours to get the washplant work. All it did was converted valuable paydirt into worthless dirt 1:1 ratio.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst game i have ever played. tutorial is horrible also the sounds for all vehicles are the same. overall not worth 20 dollars",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Controls are awful... This is more like \" Dig where you don't want to and then repair-simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "inexperienced developer team. You can tell right off the rip as soon as you load into the game. very poor design and lots of areas and parts of the game you can tell the devs are lazy and have no idea what they are doing. Looks like a few nerdy friends that got picked on in highschool wanted payback by scamming everyone for this  game. Its been 6 months sinse an update. Why are these guys charging $25 dollars for an alpha stage game. I mean i have very little experience developing and i could make a better game than this. Its literally like some friends threw some pig shit together and threw it on the steam store cause they needed some money. its a joke. If i hadnt reached my limit on steam refunds for the year. This game would be refunded 100%. Ill come check it out again in 25 years when the devs release the next update.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The main task of the game, at least in the beginning, is to drive the loader and load dirt or paydirt in the hopper or the sell point. To do this with a mouse and keyboard, you need to play a lot with the loader's bucket and arm. However, the controls for those are very unintuitive, and if you're not very careful at how you set the bucket on the ground, you will make a mess, either by digging too much or not enough into the ground. Therefore, it's quite difficult, if not impossible, to control how deep you want to dig, or how flat you want the ground to be with a loader. Maybe the dozer can do a better job at that, but no dozer is available in the beginning of the game. This lack of control makes the gameplay annoying. I'll wait a year or two before trying this game again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "building is super janky, they could have done alot betterr",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "unless you know someone with endless hours on this game goodluck doing anything",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is a really good game and has amazing potential but there is one absolute major floor in the dirt physics you have a potentially a 20 ton loader/dozers and all the vehicles in fact that get stuck on a tiny mound of dirt the bucket on the loader being pushed away by the smallest amount of dirt moving the hole vehicle off line and same with the dozers and all vehicles makes this part of the game completely broke the devs need to sort this considering the game has been out for 3 years they seem to be more interested in adding more different types of vehicles etc. fix the dam dirt physics please",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EDIT: Last Update seemed to improve physics a bit though not documented - gonna play a bit more and see.\nUnfortunately the vehicle physics are just far too wonky for this to be enjoyable. In the short time I have been playing, the vehicles are weightless and have been bouncing around constantly, flipping if a single dropped piece of dirt hits the floor near your vehicle (which is constant and unavoidable). I can handle somewhat janky physics or gameplay, but unfortunately the core part of the gameplay, the vehicles, are downright undrivable.\n\nAlso, default settings have a deadzone.... for mouse and keyboard? Who ever wants a deadzone when looking around via mouse? And each movement (up, down, left, right, individually for Vehicle, Third Person and First person!) needs to be manually set. 16 changes to simply reduce mouse sensitivity or remove the pointless mouse deadzone?\n\nThe game has potential, but if you are fighting the game to even start playing, and then suffering the main mechanics, its just not recommendable. I may return if vehicle physics are updated.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Devs are creating something good here, don't get me wrong,(There isn't a maybe button),  but this new release/ update changes too much for the worse and adds alot of annoying things that you can't get rid of/ turn off, it's like they hadn't thought about it and released a pile that feels further behindd than the previous version, and it's likely that any time you put into it now, will be deleted again.\n\nThen they say \"it's ok you can always roll back... \" --You can, but to a point where alot of content is missing (A long time ago) and all of your old saves have already been deleted by updating.\n\nI've had to turn most noises off due to the audio screw up, alot of noises obscenely loud and you cant turn them down without kulling other noises, that said, i can't turn them back on again, audio is all messed up. going to try fresh install, all i wanted to do was dig some holes but now it's turned into a two afternoon bs fest.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really really tried to like this game but the controls are god awful it's impossible to place anything down",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Who thought that this initial controller set up was good? It is maddening how yall had to go and do something against the norm when the norm was perfectly fine. And then to echo others about the how poor the flattening ability is in this game is interesting to say the least considering this is a mining game. And the connecting wash plants and conveyors during the tutorial were very annoying to get to snap in place and be accepted. If it wasnt for youtube and seeing some of the stuff you can do in here I would thumbs down, uninstall the game and ask for a refund because it hasnt been enjoyable at all. \n\nwell since i have to leave a recommend or not and cant be undecided Ill have to go with not recommended as it fits my experience better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has the worst controls ever. Theres alot of potential in this game if you're into simulator games. But the vehicle controls are the reason why its a no for me rn.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I kind of liked the idea. \nA few points\n* I use steam for it's easy but this game doesn't have cloud save. So no sync of save between computer or reinstall, that shouldn't be allowed for a game on steam. \n* I like hard core mode, but why can't you start without money? Chopping down a few trees and you got plenty of money. \n* Gold is less worth than wood, a bit strange?\n* Color of ground is supposed to indicate if there is ore below. Is this the best way? You rarely dig straight downwards anyway. \n* Was kind of fun to combine different things, but the game is lacking so much what the pieces do.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game mechanics are terrible graphics are bad. Has a lot of graphical and sound glitches. Bad tutorial for your first time. Would not recommend this game to anyone unless if it is on sale for a couple dollars which seems this game should only be valued for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has the steepest learning curve of any game i've played. Nothing is explained well as to how the mechanics work, and lead to hours of trying to find tutorials on how to do different things with no good answers found. This game gave me nothing but frustration, and I believe that after 5 hours of game-play you should have a pretty good idea on how to get going, but this is not the case. \r\nBased on my experience, plan on 10+ hours of in game time before you have the faintest idea of how to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "cool idea and game, but it has serious issues with Memory usage, literally bricked my whole pc that has a 4060 and 32GB of memory...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In time, maybe - but right now it's a mile wide and an inch deep. Prices of vehicles are senseless, things are gated with almost no real logic by levels which go excrutiatingly slow (yes you can change level speed to a degree) but the real issues are how unnecessarily difficult it is to do ANYTHING. Dozers spanw dirt magically, buckets pick up dirt upside down, dirt physics are hilariously bad, there's so little information and simultaneously too much (you get more than you need but not for the things you need) and there are things that you have to do with levels of painful manual intervention that after this amount of time are staggeringly concerning.\r\n\r\nI'll come back to it in a year.,..or five, but for now it's just more trouble than it's worth.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "THREE year old game and we rely on setting up a convoluted and unnecessary conveyor system just to get more than 5400KW of power. I get this is a game, but where you came up with the idea of using conveyors to get more power without blowing poles is beyond me. Make it so you can separate your main supply into a grid and put in larger capacity poles.\r\n\r\nSecond, limiting us to 60FPS because anything more will cause serious lag is insane. Upgrade your server. Fix your spaghetti code. \r\n\r\nThis is a decent game, but in reality I wouldn't recommend buying it unless it's on sale as there's far too much that just doesn't make sense and too many issues. The devs can use tools other similar games did to combat such issues but they just refuse to.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Good concept. Not ready yet. Lots of bugs and controls aren't ready.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}