{
  "positive": [
    {
      "review": "I remember playing the classic games and the trilogy when I was a little girl, getting so frustrated by the puzzles but completely mesmerized by the games themselves. I used to pour my whole soul and mind into them. Now I finally decided it’s time to play this one, see how it is and actually finish it, then continuing the series. Well, this game is absolutely phenomenal despite being an old one. It makes you feel like you're there with Lara and her crew the entire time. \nThe moment she realizes she's become a killer, that she has to kill others in order to survive, just after saying she hopes she won't become a murderer; the look on her face, her saying “oh god” gave me goosebumps. Her expressions, her attitude, the fear turning into determination and that shift from \"I don’t think I'm that kind of Croft\" to \"I must understand. I'm not going home\" ... Her transformation was incredible to watch.\nThe relationships she builds with the other members of the Endurance are so well done, you can actually see them evolving and changing over time. [spoiler]Roth's death left me with tears in my eyes. Sam's screams while being possessed, watching Lara's fear and concern mixed with her determination to save her... just incredible.[/spoiler]\nEvery climb, every fall, every fight keeps you on edge. I loved how the game makes you feel the danger and the struggle for survival as well, like it's not just about fighting, it's about adapting, pushing forward and becoming stronger together with her. Also, the way Lara feels so human.. being not just a hero; she is scared, she doubts herself but she never gives up and she is determined to keep everyone safe. Her transformation reminded me why she is my favorite. \nWhat a journey this was ♥",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☑ Very good\r\n☐ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☑ Potato\r\n☐ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☐ Minor bugs\r\n☑ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "Just replayed it for the first time since release. More of the TPS than exploration adventure, but the action is good and setpieces are fun. Still looks good and holds up well.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Tomb Raider is an awesome game. I bought it on sale for a pretty cheap price, and it was definitely worth it. Even though the gameplay isn’t extremely long, the story kept me hooked — it took me about 10 hours to finish. The game has a perfect mix of action, adventure, and combat.\n\nAfter finishing the story, I went for all the collectibles like relics and challenges. It didn’t take too long — in about 2 days I managed to collect everything on the map and complete all the challenges. A few achievements are still left, but they’re multiplayer, and unfortunately, the multiplayer is almost dead, so there’s no real way to get them.\n\nTomb Raider is an amazing experience, and it’s definitely worth playing.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Played the game, did my best and 100%ed the story, would genuinely recommend it, I'm not sure why people consider it a bad game",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Tomb Raider was sitting in my library for quite a while. I got it back when it was free on Steam, but I never touched it. Then, some time ago, I grabbed the whole trilogy bundle because I wanted to step out of my comfort zone a bit and try something different from what I usually play. And well… here it is: Tomb Raider. And wow, what a surprise.\n\nFor a game released in 2013, it looks stupidly good. The visuals are beautiful, the atmosphere is amazing, and honestly, even someone like me who usually doesn’t enjoy older games ended up completely impressed. The level design, the lighting, the environments, everything still holds up incredibly well.\n\nThe game itself wasn’t what I expected at all. I never followed anything about Tomb Raider before, I just knew it was a super famous series. So I went into this completely blind, and finishing it was absolutely worth it. The journey was amazing, from the combat to the exploration, the puzzles that were actually fun, the music that hits perfectly at the right moments, and the scenery that constantly makes you stop and look around.\n\nI even got stuck in the door glitch/bug at one point, which was… interesting, to say the least. But honestly, even that didn’t bother me much because the game was that good.\n\nIt ended up being way better than I imagined. Stepping out of my comfort zone for this was the right call, because Tomb Raider was a fantastic experience from start to finish. Definitely worth playing, and now I’m continuing the trilogy, or at least try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Tomb Raider is an awesome reboot of a legendary character. Everything about this game is awesome. The story, the world, exploration, the sound design and the characters. It takes about 15 hours to complete and will keep you on the edge of your chair. I have already finished it twice and can only say that Lara Croft is a badass!\n\nAlso, the game looks awesome for a game from 2013. I did have some crashes despite having good enough hardware, but turning down Anti-Aliasing and shadows helped with that.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Initial Thoughts: Just completed Edios's \"Tomb Raider\". I Finished in just under 12 hours; I'm slow at completing games, keep that in mind. This is one of those games that’s been sitting in my Steam library for years, always meant to play it, just never got around to it. After finally giving it a go, I wasn’t sure if I was vibing with it at first, but about halfway through, I started to enjoy it. In fact, I’m now considering picking up the sequels to see the series through.\n\nStory: Without giving too much away, the storyline is a great reimagining of how Lara Croft becomes the iconic adventurer we know and love. That said, it leans heavily on a few annoying clichés. There are moments in cutscenes where Lara clearly has better tools available but chooses the worst tool for the job instead; like using her fucking bow over the fully automatic rifle she was just using moments ago before the cutscene, purely of course to put her in a situation that pushes the plot forward. These are cheap narrative shortcuts that could’ve been handled way better imo.\n\nCharacters: The supporting cast is full of life and easy to connect with, and the developers deserve credit for that. However, the game throws a lot of chicky melodrama in your face too many times. While I appreciate their attempt to show Lara’s transformation from a young, innocent girl into a battle-hardened kickass explorer, a lot of the BS could’ve been trimmed without hurting her development or the pacing.\n\nGameplay & Mechanics: It’s a pretty standard third-person action-adventure. Oddly, there’s no dedicated crouch mechanic, and cover can feel pretty unreliable at times. You can jump and climb around freely; sometimes almost too freely, which can look a little goofy but also adds to the fun. My biggest complaint is the constant quick-time events. They interrupt the flow far too often, and the feedback during them isn’t satisfying at all. On the positive side, platforming is smooth, controls are tight, and the puzzles are straightforward but enjoyable.\n\nGraphics: Visually, the game holds up well for its time, this game is 12 years old as of writing this. The island setting is gorgeous, the weather effects are immersive, and the water physics look great even by today’s standards. Despite showing its age in some areas, the presentation overall does an excellent job of pulling you into the world.\n\nFinal Thoughts: Tomb Raider is a strong reboot of a phenomenal franchise that will leave you wanting more adventure after the pistol smoke clears.\n\n7.5/10. A good platforming experience and a solid pick for anyone who enjoys cinematic action-adventure games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is absolutly goated. I have never played the og Tomb Raider games and this is my first one. Hearing a lot of praise about this game I bought it, and i swear to god im glad i did. I personally do not like games which are lengthy, lot of exploration, etc but When i started playing it even i didn't realize i played for 4 hours in one sitting.\r\n\r\nThe gameplay, is absolutely top notch, i personally think as a kbm player its difficult to play such games on a keyboard but i didn't really think that was the case for this game. The realistic mechanics, upgrading skills, weapons, etc. Those quick interactive buttons randomly, absolute cinema.\r\n\r\nThe visuals too, for a game that came out in 2013 the visuals are so good, might be better than a few games of today's era.\r\n\r\nThis was a crappy review to be honest but i wrote what came to my mind and i apologise for that. Nonetheless, all i want to say is everyone should play this game before dying because it's just that good.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "just finished it and omg this game was actually so fun. the story and gameplay were smooth, but what i loved most was how it fed my completionist mindset. i kept telling myself “ok last collectible” then ended up running around the whole map again LOL super satisfying 100%.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Atualmente jogando de novo, porque a  simples o meu save sumiu. Fazer o quê, né? O jogo é maravilhoso mesmo assim 😭🎮\r\nLara Croft sua gostosa",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice gameplay, i like puzzle in this game, not complicated but fun to solved",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Игра на 9 из  10. \r\nОфигенное приключение которое надо обязательно пройти. Сюжет не плохо срежисирован. Прикольно что все записки озвучиваются, это дает больше проникнутся игрой и персонажами. Каждая локация по своему разнобразна, если будете обчищать карту то скучно вам не будет. В целом игра очень понравилась.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay wise it's great puzzles, optional chambers, combat which i really like because you can either play stealthy or like a madman if your good enough, story wise it's alright, pretty simple a bit unoriginal but very much playable. I recommend to 100% all the areas before you go to the next one and read all the books so you can understand the lore.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Loved this game❤️❤️\n\n..Except for that one part where i had to kill the wolf inside a cave. The game just wouldn't show me what to do so I had to search on you tube only to find out it was vsync issue..😑\n\nOther than that everything was great 👌👌",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Russian spoken by islanders is atrocious. \r\nSometimes you see stuff that is clearly bollocks for story reasons - rivers of fresh blood and mountains of skulls, dynamite loosely stored in the funniest places, etc.\r\nBut the game is still plenty fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love literally every thing about this game, its fun and challenging and I have beat it probably five times since it came out, I highly recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I actually really liked the game.  Mainly the gameplay part of the game.  The story is really goofy (especially the ending) although it's a relatively decent reboot origin whatever.  It's the 3.8 roentgen of story, not great not terrible.\r\n\r\nThe gameplay is really solid though.  The controls are mostly really solid and intuitive, although the game is starting to fray around the edges with the age of the game or code or maybe just windows 11 falling apart and barely able to run anything right anymore.  Rise of the Tomb Raider is my favorite in the series, but when I originally played this game way back in the day I was surprised at how much I liked it, and the whole reboot trilogy ended up being pretty good.  It helps if you get it on a nice cheap sale like I always did.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is a really good game but is very short i completed the game in 7 and a half hours well doing everything to 70% but the graphics are very good considering how old the game is. i played on steam deck",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "totaly recomand this game i start to chose story game insted of online games and i dont regret it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "no wonder it was a hit back then, this game hooked me into action adventure genre like no other game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tomb Raider is an unforgettable adventure that perfectly blends action, exploration, and storytelling. The game takes you on Lara Croft’s gripping origin journey, where every moment feels cinematic yet deeply immersive.\r\n\r\n🎮 Gameplay:\r\n\r\nThe combat is fluid and satisfying, with a great mix of stealth and action.\r\n\r\nExploration is rewarding—hidden tombs and puzzles make you feel like a true adventurer.\r\n\r\nThe progression system keeps you engaged as Lara grows stronger and more resourceful.\r\n\r\n🌄 Visuals & Atmosphere:\r\n\r\nStunning environments, from dense forests to ancient ruins, create a world that feels alive.\r\n\r\nThe attention to detail in weather, lighting, and sound design adds to the immersion.\r\n\r\n📖 Story:\r\n\r\nLara’s transformation from survivor to hero is emotional and inspiring.\r\n\r\nThe narrative keeps you hooked, with just the right balance of mystery and intensity.\r\n\r\nOverall, Tomb Raider is a must-play for anyone who loves action-adventure games. It’s not just a reboot—it’s a masterpiece that redefines the franchise.\r\n\r\n👍 Verdict: Highly Recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It never gets old to play this game. Although I am always stuck at 98% despite having everything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im usually not into these linear blockbuster type of games but this kinda hit the mark just right, I felt enough gameplay freedom to actually enjoy playing. Not the most revolutionary story atp but the gameplay is quite fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exceptional video game. Nearly perfect pacing. One of the great action games of recent memory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good reboot of the Tomb Raider series that doesn't quite hold up graphically anymore, but the gameplay, story and setting are still great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic. One of the best reboots IMO I enjoyed it, not enough to 100% but I liked the direction of story for sure. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tomb raider 2013 truely deserve to be the game of the year . The story is insanely good , gripping from startt to finish, overall evperience is f****** good and overall experience feels very polished and powerful.The games delivers intense acttion, beautiful environment, and thr stong character arc of Lara croft\r\n\r\n\r\n        However, is feels a lil bit shot on mapping and weapon system in 2013 but yehh its pretty ok o ok .They caan add more detail in maps and on weapons  \r\n       ALSO the games vibes feels like Last od us 2 and  unchattered lile the mall fight in last of us 2 and the mountain fight in unchartered .\r\n\r\n     Still everything is on point A MUST GAME FOR EVERY ADVENTURE AND ACTION LOVER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love all the Tomb Raider games so much, the story and gameplay is great. I really enjoy how they changed it up from the earlier titles. Solid game 8/10 !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!\nloved everything except grenades are hard to come by",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really thought i would hate this because its a completely new Lara and game compared to the old ones, but this game really surprised me. Beautiful scenery, fun gameplay, great vibes, honestly a really good game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Tomb Raider: what else is there to say? Great graphics, great story, great gameplay, great controls (unlike earlier parts).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tomb Raider is honestly one of the best gaming experiences I’ve had. The game feels incredibly realistic — from the environments to the combat, everything is detailed and immersive. The story is peak fiction with the perfect mix of adventure, mystery, and emotional depth. Watching Lara grow from a survivor into a fearless warrior makes the journey unforgettable. The pacing is sharp, the action is intense, and the world pulls you in completely. If you enjoy rich storytelling and cinematic gameplay, this game is an absolute must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really good Game , I find this game still awesome after a decade.\nIn my opinion it still holds up in terms of gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tomb Raider 2013 is a fast and gritty reboot that follows Lara Croft as she learns to survive on a dangerous island. The combat feels smooth, the bow is satisfying to use, and the exploration rewards you with upgrades that actually feel meaningful. The story moves at a steady pace and the cinematic moments are intense without being overwhelming. The game also balances puzzles, action, and quiet moments very well. Even with only a few hours of play, the atmosphere and progression pull you in quickly.\r\n\r\nA great action adventure game that still holds up and is worth playing on Steam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though, the storyline is a bit weird and nonsense, you can definitely enjoy playing this game where you need to solve the puzzle. For game around 2013, it's definitely great to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game. Although it's like, more than 10 years old now, it is still soo engaging and I am lowkey addicted to it rn xdd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, I can’t believe I’ve waited so long to play it.\nIntriguing story, good gameplay design, good map design, works really well on all platforms (windows, Mac, Bazzite Linux). There are even a few mods for it like costumes and light improvements \nLooking forward when finishing this to try the next one in franchise and hopefully it’s just as good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finished my 4th playthrough, always going for 100% and I don't do achievements normally.\nStill a blast!\nBest part of the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First in the trllogy, graphics still hold up.\r\nStory is decent and gameplay was a very fun throwback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great action adventure game. The only thing I didn't like is the number of shooting sequences, I wish they would focus on climbing and stealth more. Overall amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good good, smooth mechanics, good graphics, just wish she could sprint... sadly the multiplayer is a deadtown... sigh*.. overall 7/10 ☺",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game, i love achievements, i'm still playing to collect achievements.. too many achievements... might probably need to restart the game coz i didnt get to talk to a bunch of NPCs... now give me my achievements... huehue ☺♥",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the classics / greats. I remember playing this on X360 and thinking it was the best graphics I'd ever seen. I later played it on a decent PC rig at higher settings but couldn't quite manage Ultra. It's been years since then and who would've thought that I'd be replaying it now on Ultra on.. Mac? Yeah, as it turns out Mac's can game now.\r\n\r\nHonestly this game is so much better than I remember it being, and I have very fond memories of it. It holds up incredibly well, better than a lot of modern games actually. I love how the world is somewhat open and feels real and well realised, but it always steers you back to a linear path. I found the sequel too open and trying to do too much but it's been a long time since I tried it so I will probably give it another go after I'm done with this.\r\n\r\nGraphically it is gorgeous. I honestly can't get over how good it looks maxed out. Maybe it's the modern Macbook screens pushing an OLED-esque quality but holy damn, it is simply stunning. The detail in environments, the saturation, the foliage, the weather effects, the clarity, the ambient effects, the detail on Lara's face... It looks better in gameplay than cutscenes fr fr. \r\n\r\nGameplay is actually fantastic too, and way better than I remember. Gunplay is satisfying and puzzles are fun. Climbing is good, although I can get a little impatient with Lara's speed! I'm playing on Hard and it's a really satisfying challenge, makes it feel a lot more immersive than the regular difficulty.\r\n\r\nThere are so many awesome details that really do make this game feel so ahead of its time. I love the way Lara feels to control, her movements are very fluid and I love how she organically adjusts here posture based on context and moves into cover without being glued in. \r\n\r\nOther details like the way she reaches out to touch walls as you pass by and, a personal favourite of mine, her attention gets caught by the environment, such as rats: she will watch them as they run by, amused in a realistic, human way. It makes her and the game world feel alive, connected and natural. Super immersive. Devs really poured passion into this one and you can see and feel it.\r\n\r\nSo yeah, whether you haven't played this for a while or are yet to give it a go, I can sincerely recommend it. It's a classic and if you run it maxed out, it has barely aged a day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "O zamanına göre gerçekten BAŞYAPIT ! Şuanda da oldukça iyi bir oyun ve günümüzün bazı oyunlarına ders niteliğinde bir oyun. Diğer tomb raider oyunlarından çok daha fazla aksiyon sunuyor ve diğer oyunlarına göre hep aynı ilerlemiyor. Yani çoğu şey tekrar etmiyor. Bolca aksiyon sekansları ve quiq time eventleri de mevcut. Çoğunlukla sıkılmadan oynadım, güzel bir maceraydı. Tabii oyun 2013 te çıkmasına rağmen bazı animasyon hataları ve buglar ile karşılaştım. Geyik yürümüyor uçuyor, en çok güldüğüm hata o oldu. Onun dışında oldukça şaşırtan bir oyun oldu. 9/10 oyun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun to explore, and the combat is actually exiting, with some good graphics and character design.\nOn the bad side, puzzles are pretty boring since Lara hersel tends to “spoil” them too early with random lines. Story has got some flaws but overall it can manage to keep the player interested. 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A welcomed reboot! Tomb Raider 2013 brings back the iconic series, with Lara Croft as her protagonist. This new entry plays a bit differently than the OG trilogy; the gameplay, the cinematics, and even the puzzles, recall much the Uncharted games, perhaps a bit too much, but a copy that works well in my opinion. The game is simply fun to play, with linear but dynamic levels to roam around. Story wise there's not much to comment, more than the single events I enjoyed the atmosphere. This might be a different Tomb Raider game, but a fantastic one to play!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My First pc game ,it's the best game, the graphics, gameplay, cinematic, story all are out standing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite being more than decade old game its an amazing game. Must play for fans of story driven action adventure games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An action packed linear game, perfect for the casual thrill-seeking gamer. A bit too bloody at some parts but overall a very good game for it's time. And yes, that is 97h. Always worth the replay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it on ps3, then the remaster on Xbox one, then again on pc. One of my favourite games. Good story, combat and graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent, cinematic reimagination of a classic property. The story relies pretty heavily on the Lara taking beating after beating as a crutch in lieu of character growth but, otherwise, it's fun.\n\nShe has ditched the short shots in favour of pant pants which is not only a boon in jungle exploration but aids the player in feeling less lecherous without diminishing the ability to [b]be[/b] lecherous.\n\nThis game comes from an era in which every single player game got a multiplayer mode to extend gameplay duration but, reportedly, the multiplayer died immediately; yet, [i]miraculously[/i], it is still supported. Unfortunately, this means one has to scrounge up three other players if one wants to %100 the achievements. Minor point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tomb Raider is not bad overall, but the character controls and button layout can get really frustrating. Nothing feels smooth, and the game relies too much on remembering which symbol corresponds to which button in the middle of combat and fast-paced action. It breaks the flow and makes the experience more annoying than it should be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pros:\n- Easy and Fun\n- Map is huge and you can explore\n- Unlimited save slots\n- Has Cloud Save\n- Free Roam after finish campaign\n\nCons:\n- No NG+\n- Multiplayer is most likely dead\n- Hardcore gamers might dislike this game because puzzle and combat are too easy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tomb raider has come a long way. From here on out the movement and action is improved on instead of the puzzle system. This makes the gameplay enjoyable for a wider audience, but takes away the difficulty that original tomb raider games provided with obscure puzzles that required a guide to understand. Now climbing around the map is easy with obvious climbable surfaces and \"yellow paint\" guiding you everywhere. Overall a great game, and the following two instalments of the series are just as good as this one. Playing them consecutively is a very tiring experience though, since the gameplay is very similar with few improvements. I don't believe tomb raider has much else going for it after this trilogy and I wouldn't be surprised if we don't see a 4th instalment for a long time. If we do, it will be the same game with a different story and fresh coat of paint.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is just the classic Tomb Raider reboot experience, this game may not be my favorite in the new trilogy but it is pretty amazing. The game runs amazing on steam deck and my gaming laptop. Definitely pick this game up if u like the Uncharted franchise. I give it a SOLID 7.5/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still as amazing as it was 12 years ago. One of the best tomb raider games out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "if you enjoy Uncharted and The Last Of Us then you'll enjoy this, its oriental and supernatural themes are decent, i only played this to finish the main story but there is lots of exploration and treasure hunting to be had. overall its a good entry into the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant game.\nMy only minor criticism is that I think Lara goes from being horrified at having killed someone, to just gunning down everyone in sight without a care in the world, a little too quickly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Looks really good for 2013. Combat/weapon system is pretty cool though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game and I am getting into Tomb Raider. It is a great game as an Origin Story for Lara.\r\n\r\nRecommended! 8/10 from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice adventure with some of the best rag doll jank animations I've seen. It's pretty fun and the upgrades/gadgets you get along the way add to the game as you go along. Gun fights are just top notch here. The environment is not only a background but it fits itself into the gunfight so well. Lara interacts with it by positioning herself in spots like you would see in a movie. Cover gets blown to bits, burned off, I mean it's really nice to see how the landscape transforms to the fight. Really cool. The story is okay although I did have some stuff I was upset about. Okay so it's not really a spoiler and it's a nitpick to be honest. Just a thought I had. Again, not spoiler as you know about this within the first minutes of the game (really the reason for the adventure in the first place): \n[spoiler]So the thing that got to me was the fact that you were pretty much killing people that were just trying to get out of the island to go back to their families and such. They found a way to get out and that was to get that one girl and use her as sacrifice. Crazy right??? but but later in the game you find out that they weren't in the wrong, but Lara and that one girl had to be selfish and end up killing HUNDREDS of friggen men in the island just to save that one girl! When I finished the game I felt like Lara and that one girl could have come to an agreement and just chose to do the ritual and get it over with. Soooooooo many lives could have been saved!!! THAT GIRL COULD HAVE JUST SAID \"LOOK, GIVING UP MY LIFE FOR THE REST IS GOOD\", BUT NOOOOO. HERE WE ARE KILLING AND KILLING!!11! Don't get me wrong, it was fun shooting arrows at them dudes' heads, but when you compare this game with Uncharted (because you have to!) and you see how Nathan kills the others because they're trying to kill him for their own benefit WHILE the men in this island are just trying to kill you so you don't stop them from leaving this island they've been stuck in for YEARS it just makes it all give a bad taste. \"A survivor is born\" yeah no shnit. Cruel f***** world, dude.[/spoiler]\n\nMy score: Lara/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played TR4 and TR5 from the original series and was drawn to the parkour, puzzle-based gameplay, and mythology-driven stories. The cinematic cutscenes were also a nice touch. Curious about the reboot, I finally bought it when it went on sale.\r\nThe game opens with Lara on a ship that wrecks on a mysterious island. She’s captured by the island’s inhabitants, but escapes and begins her search for the remaining crew. Along the way, she gains new skills and weapons.\r\nThe developers did an excellent job with the parkour and graphics—I didn’t encounter any bugs. The level design is solid, though it becomes repetitive. Combat is enjoyable and the enemy AI is good, but the fight sequences also start to feel samey. Because of this repetition, I often lost interest and returned to the game only after taking breaks. Fortunately, the final portion improves with new enemy types and boss battles.\r\nOverall, I’d give it a 7/10. It’s not a must-play, but fans of the Tomb Raider series should enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. It is the first entry, and very good. Start here and move on to Rise of the Tomb Raider, which is the best of the series. You will not regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enormous fun to play / replay - visuals still mostly hold up even given the age of the game and the gameplay / story is very enjoyable. Possibly the only slight annoyance are the quicktime events (thankfully few / early game) and inability to hold versus button mash (an accessibility feature I appreciate in later titles now I'm a little older)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. It's nice to resite older game after long time. Overall still recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is overall great and is a must play game but it had some glitches here and there other than that no complaints and it is easily one of the best games of all time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love everything about all of the tomb raider games! great story and game play! other than the wolves in tomb raider are annoying lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nearing completion (memory error in the bridge cutscene, thanks Gabe) I can honestly say this isn't yer pappy's Tomb Raider. Lara is like a different character altogether, being far less confident and capable (there is no \"flip sideways in the air and shoot dual pistols\" button), not to mention overly emotional, bordering on hysterical sometimes, a bit like a highschool chearleader with the climbing skills and upper body strength of a chimpanzee. I get that she's suppose to be fresh off her training wheels in this one, finding her place in the world and all that, but if you've played any of the older titles, you'd be forgiven for thinking she's a new protagonist with the same ID as the previous one. That being said, this doesn't ruin the enjoyment of the game, which has quite a lot going for it. Gorgeous visuals, great tracks if a bit forgettable and at times ass-clenching gameplay. Where it falls short is in the story and characters, which I can kinda forgive since the game is more gameplay focused, although not by choice. I want to give this vidya a glowing review, I really do, and I'm excited to try the next tile in the series, I'm just not convinced it deserves it. It's more like a coming-of-age story than a grand adventure in uncharted territory type deal and that holds it back at times. Nevertheless, and with the caveat that I don't see this being anyone's \"ritualistically play every year on X holiday\" game, I do urge more people to try it, if only for the novelty of seeing an extremely vulnerable Lara Croft. Just make sure to buy the bundle when you do decide to give it a go. And for anyone asking, WOULD.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Never played tomb raider before but this game was so stunning. Played it through within 3 days. Highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tomb Raider is a fantastic story, i love this game. there are times when theres some obvious clipping and some points where the game sequencing just breaks. ive had it where a door that is supposed to be open to progress, just isnt. and it gets really glitchy on a second playthrough. might just be me tho. either way i had a ton of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice story with a lot of hints about what will happen. Genuinely enjoyed collecting stuff and progressing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say, I have played this on 3 different systems now and consider this a great game.  Rise is a tad better story-wise. 2025 and it's still a fun first entry in the trilogy!  9.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommended!\nI ablutely loved this game. The story, the atmosphere, and the sense of aventure kept me hooked from start to finish. The graphics are beautiful, the world feels alive, and the gameplay is smooth and immersive.\nHuge thanks to the developers for creating such a great experience, and to the Steam team for making it possible for us to enjoy it.\nIf you love exploration, action, and realistic world, l definitely recommend this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, fire graphics for the time, fun gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely satisfying adventure game...combat is great...exploration is good...overall just alot of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the PS1 title as a kid, got stuck at some point, lost interest and never finished. Decided to give this one a chance and I was hooked from start to finish! Beautiful protagonist, good gameplay, enemies, environments, sounds, story, all adding up to a high quality single player experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good story, fun game.  Not as good as Shadow, and not as refined in game play as the others, but still worth a play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You might be forgiven, looking at trailers and early hours of the game itself, that TR2013 is offering an experience not unlike The Last of Us. There is the \"survivor\" theme, emphasis on scavenging, simple weapons and stealth, and also a simple progression system. However, it turned out to be more like \"Uncharted at home\", with flashy explosions, hordes of enemies and cinematic QTE sequences. The only standout point for me was the exploration - opening out new parts of levels and figuris routes to get all collectibles proved quite interesting.\nTo me, it was the equivalent of an \"airplane movie\" - something light and short enough to distract for a few hours and forget soon after. But I might try the sequel (Rise of TR) if I find myself in a similar mood again (thanks to Epic for a giveaway of the whole reboot trilogy!)\n\n8/10\n\nPlaythrough statisics: 15.5hrs, hard difficulty; 95% completion: all collectibles done, some challenges missing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game, nice story and characters!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks amazing and runs well with great character development from Lara, I've got every collectable and can't wait to play the sequel when I get the chance. 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good story , a real fun time , cinematic experience indeed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is varied, exciting, and full of detail, without any boring repetition or side details that distract you from the main story. I enjoyed the game and didn't get bored or tired halfway through. The quality and graphics are excellent for a game from 2013.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] A weekend-sized adventure done right [/h1]\r\n\r\nWrapped it up in around 10 hours, which in 2025 feels borderline illegal. Most games these days try to keep you hostage for 60+ hours, but this one politely taps you on the shoulder, gives you a fun ride, and lets you go live your life.\r\n\r\nIt’s wonderfully linear too - no open world stuffed with glowing icons, no random NPC demanding, “bring me 5 wolf furs and 25 herbs and maybe I’ll give you a cure”. What it is: a focused, tight adventure with good mechanics, solid shooting/climbing that still feels good.\r\n\r\nThe story? It’s okay. The companions? Also okay. Nobody’s terrible, nobody’s amazing, everyone mostly exists so Lara has someone to yell at between explosions.\r\n\r\nDefinitely not AAA, but it’s a sturdy, well-built game that still plays great in 2025 and is perfect for a weekend. Short, fun, doesn’t waste your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, just odd that to get 100 you have to do the multiplayer stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☑ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☐ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☑ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☑ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☑ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☐ Good\r\n☑ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☑ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game, highly enjoyable and the story is a 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game but it's showing it's age in some aspects\r\n\r\nIf you play this on a newer build, you'll have to set a 60fps cap for the QTE and scripted events, otherwise the game gets very frustrating, damn near impossible to advance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Tomb Raider game ever made, a classic masterpiece. Everything is amazing about this game; the atmosphere is oppressive, the missions and history are 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is art, I love the Tomb Raider saga's and it's never a fail. I recommend a 100%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OMGosh was this game good!!! I would not call myself a gamer. Some high action games frustrate the ever-loving crap out of me, but this one scratched that itch of the perfect balance between the tension of a challenge and not banging my head on the desk. (I was playing in easy mode and will continue to do so) Still died plenty of times. Very balanced. Great story. A lot of fun. I loved exploring the island. Real 10/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very nice game. Environment, linear learning curve and interesting story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best tomb raider games ever the best part is the performance it can run very well on pretty much any laptop or pc for 2 dollars i suggest to buy the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is too cool and you will be more impress with graphics and effects if your interested about survival  game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, even years after release. Recently bought this trilogy and just finished this first one. On to the next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ [b]Gameplay[/b] }---\n☐ Excellent!\n☑ Very Good!\n☐ Good!\n☐ It's just gameplay!\n☐ Mehh!\n☐ Watch paint dry instead!\n\n---{ [b]Graphics[/b] }---\n☐ Reality looks disappointingly ugly in comparison!\n☐ Gorgeous!\n☑ Good!\n☐ Decent!\n☐ Bad!\n☐ Bus Simulator 16 Ultra Low settings!\n☐ $1 Budget game!\n\n---{ [b]Audio[/b] }---\n☐ Eargasm!\n☑ Very good!\n☐ Good!\n☐ Manageable!\n☐ Bad!\n☐ My ears!\n\n---{ [b]Audience[/b] }---\n☐ Fresh out the womb & up!\n☐ 8 & up!\n☑ 13 & up!\n☐ 18 & up!\n☐ 30 & up!\n☐ 60 & up!\n☐ You will never be old enough!\n\n---{ [b]PC Requirements[/b] }---\n☐ Potato!\n☐ Smart toaster!\n☑ Decent!\n☐ Fast!\n☐ Ask your employer if they can give you a 500% pay raise!\n☐ Invest in a Quantum computer!\n☐ Get into a rocket flying at 50% the speed of light. Wait 3 months, return to Earth, then play the game!\n\n---{ [b]Game Size[/b] }---\n☐ Floppy Disk!\n☐ Old Fashioned!\n☑ Workable!\n☐ Big!\n☐ Will eat 20% of your 4TB drive!\n☐ You will want an entire drive just to hold it!\n☐ Ask Google if they have a spare mega-datacenter!\n☐ You will need to invest in a black hole to hold all the data!\n\n---{ [b]Difficulty[/b] }---\n☐ Just press 'W'!\n☐ Easy!\n☑ Easy to learn / Hard to master!\n☐ Significant brain usage!\n☐ Difficult!\n☐ Learned to code in Brainfuck and wrote a whole OS in it! Playing this game is the hardest thing I have done in my life!\n\n---{ [b]Grind[/b] }---\n☐ Nothing to grind!\n☑ Only if u care about leaderboards/ranks!\n☐ It isn't necessary to progress!\n☐ Average paid game!\n☐ Average Free-To-Play game!\n☐ You'll need to clone yourself!\n☐ Invent anti-aging technology and time travel!\n☐ WarThunder!\n\n---{ [b]Story[/b] }---\n☐ No Story!\n☐ Some lore!\n☐ Average!\n☐ Good!\n☑ Lovely!\n☐ It'll replace your life!\n\n---{ [b]Game Time[/b] }---\n☐ The speed of light is slower!\n☐ Short!\n☐ Average!\n☑ Long!\n☐ You'll die before this game runs out of content!\n\n---{ [b]Price[/b] }---\n☑ Worth the price!\n☐ If it's on sale!\n☐ If you find some spare money behind the couch!\n☐ Not recommended!\n☐ Burning your money is better!\n\n---{ [b]Bugs[/b] }---\n☐ Never heard of!\n☑ Minor bugs!\n☐ Can get annoying!\n☐ Cities: Skylines II at launch!\n☐ Developers showing off their bug implementation skills!\n☐ Cyberpunk 2077 at launch!\n\n---{ [b]Special input devices needed?[/b] }---\n☐ Only if you like pain!\n☑ A controller is just as good!\n☐ Controller = better!\n☐ Unless you want to steer your car using your mind, get a controller of sorts!\n☐ Steering Wheel, if you want to improve!\n☐ Joystick!\n☐ You'll want to buy all the special input devices you can find for all the keybinds!\n\n---{ [b]? / 10[/b] }---\n☐ 1!\n☐ 2!\n☐ 3!\n☐ 4!\n☐ 5!\n☐ 6!\n☐ 7!\n☐ 8!\n☑ 9!\n☐ 10!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game served as an excellent reintroduction to the stealth and adventure genres. The visual presentation remains impressive, especially considering its original release date in 2013.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just finished Tomb Raider and honestly… what a journey. From the moment Lara steps on that island, the game just pulls you in. Watching her grow from a scared explorer to a total survivor was amazing — it actually made me care about her story.\r\n\r\nThe gameplay feels smooth, the combat is satisfying (that bow is pure perfection), and the world design makes you want to explore every inch. The visuals and music still hold up so well, even after all these years.\r\n\r\nIt’s emotional, cinematic, and full of those “holy crap” moments that keep your heart racing. If you love story-driven adventures — play this. Totally worth every second.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great playthrough, story , combat system , mechanics , 10/10 would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only game with a strong female character and feminist motif that i truly enjoy. The way she fight is so fucking hot, 1 of my favorite adventure games beside uncharted",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "[h1]5/10[/h1]\r\n\r\nFirst, there are fun parts to the game, the graphics look good(except Lara looks different from the original games), and the audio is good(except some really repetitive sections)  There are many problems with this game, and it's not just that the game is really buggy(game breaking in some sections.)   Near the beginning of the game I had to leave the area and come back to be able to continue.  Check the Discussions board for all the issues.  \r\n\r\nThis game is a pale imitation of the original Tomb Raider games.  It feels more like trying to play a movie with very clunky controls, which change often. There are way too many cutscenes, and Quick Time Events(QTEs are playable cutscenes.)  The real adventure is trying to figure out what the controls are going to be in the next cutscene/QTE.  As I said there were fun parts, but the annoying things outweighed the fun.  Aside from that, it was mostly very easy, and I played on the [i]Hard Setting[/i].\r\n\r\nThings I had an issue with:\r\n\r\n- Automatic hints, and the NPCs will give you the solution almost immediately,\r\n  before you've even had a chance to look around and figure things out\r\n- Very few challenging puzzles;  most are very, very simple(not really puzzles),\r\n   and just take common sense to solve.  Even so, you'll have NPCs telling you how\r\n   to solve it anyway.\r\n- Lara automatically crouches/changes stance when enemies are near, giving a player\r\n   a visual warning that enemies are nearby.  Just another example of dumbing down a game\r\n- Too Much Ammo Available - Even on Hard I rarely ever had any less than full ammo \r\n  on all ammo types.  Most of the time I couldn't pick up ammo because I was already full.  Again,\r\n  this was on the [i]Hard[/i] setting.\r\n- Zoom stops working in some area/times\r\n- Geometry issues in DLC Tomb with Crashed plane(req. leaving/restarting)\r\n- using Torch happens automatically, swithes to your handgun and you have to aim first to \r\n   be able to change back to your chosen weapon.\r\n- awkward controls that change based on your view\r\n- very restrictive view angles in some areas;  sometimes you can't look anywhere at all,\r\n   which adds to the feeling of the game being overly linear.\r\n- when dodging/countering, the camera always turns away from the view you're facing,\r\n   or pushes you around corners, leaving you exposed to enemies;  the camera will often\r\n   place your view away from the enemy; again leaving you exposed.\r\n- controls are all over the place, and work against you.\r\n-  Quick Time Events(QTE) that look like cutscenes, until you start seeing button cues pop\r\n    up on the screen, and after you've leaned back to watch the cutscene.\r\n- no warning when QTEs are over\r\n-  Many QTE's lead to actions which change controls in awkward ways;  running toward\r\n    the camera, away from the camera, at oblique angles,etc., so you have to figure out\r\n    the ever changing controls on the fly.\r\n - very clunky controls from time to time\r\n- the game feels very linear at times, forcing a player into a certain direction\r\n- useable surfaces splashed with white paint, rather than letting the player\r\n  explore and find out what they can climb\r\n- Crosshair shows a clean shot, but hits background surfaces when you shoot;\r\n    Blocking Geometry isn't taken into account when zooming in.\r\n- aiming near corners automatically puts you most of the way around the corner\r\n  allowing enemies to easily hit you\r\n- getting fired on and/or hit when an enemy has no line of sight\r\n- Weapons shoulder placement always changing for weapons(should remain till player toggles it)\r\n- DLC Tombs show the same video every time you clear a hidden tomb; Lara opening a generic treasure \r\n  chest which doesn't show any particular item.  Clearing the DLC Tombs isn't rewarding at all, except the\r\n  feeling of accomplishment from figuring out the puzzles(a few of them at least.)\r\n- Dynamite  sometimes moves through walls and barriers, or under the floor.\r\n- jumping and aiming stopped working on the Ritual Battle intermittently.\r\n- Can't shoot Mathius at the Ritual Battle until the game wants you to;  the crosshair blanks out.\r\n- I hit the Stormguard Boss, on Ritual Battle, from behind, and, somehow, \r\n  he picks me up by the neck?!\r\n- If you continue to play the game after the first playthrough, there are very few spawns;\r\n  most maps have no spawns, and it makes it hard to get some achievements.  So you have to\r\n  start the game from the beginning to try for some achievements;  this requires regaining the\r\n  skills you earned in the first playthrough.\r\n - random crashes\r\n - some cutscenes aren't skipable",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Unplayable due to the UI being stretched beyong the screen making it impossible to see notifications and respond to timed response events, and thats regardless of the resolution or the actual screen size as I tried on two monitors. Apparently the problem is well known, just wansn't solved during the time this game was relevant.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "one of the worst games i have played. Constant crashes unless you use beta version, taking damage from nothing, skill checks half of the time either don't appear or don't register, falling or clipping through the map.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am stuck in a cave with a wolf where I am told to press a button then another one but the game decides I am not pressing the button... Tried re-installing it and playing with a controller but none of that works.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tombs are optional. Feels like Lara was copied pasted in another game. Lot of shooting and warfare. Signature weapon the bow? I don't think so.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent game ruined by two things:\nThe camera wobble that cant be turned off without risking virus-infected mods.\nThe constantly respawning wolves.\nFail.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Audio does not work in this application once control is given to the player, after initial intro sequences. The game is made unplayable. Replugging audio devices is NOT an option, and cannot be performed. Other software works fine with current audio config; there is no reason for it to not work in the game, soley excepting incompetence. o.O",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate how this game demands a life to get all trophies, and most importantly, it's so poorly programmed that I have to go over and over a single jump just because it demands a perfect position and timing that makes no sense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, I would rate it 2/4.\nI went in blind without knowing the backstory and it felt off. I didn't really expect to understand all of the story, but at the main character's backstory.\nThe gameplay is more of a run'n'gun instead of an actual Tomb Raider, which I find quite funny.\nThe intro was the best, later on I could guess the story from a mile away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont know. i cant get it to work past the 1st part to start walking. she falls into the water the loading screen and doesnt move on to the next part",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The collectables achievements are insanely tedious to grind, the story is pretty dragged out, and the graphics for a 2013 game is pretty mid, Overall a 6/10, just play rise of TB",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "some VERY frustrating puzzles aside from all the fucking bugs and the shit exploration i tried to finish the game but i needed some kind of new equipment that the game doesnt provide shit on how to get it this game is just absolute fucking shit the only good thing about it is the graphics which i think it was good for its time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was not an interesting game. The gameplay is clunky. The puzzles are mid and kinda dumb. So is the story. The characters are almost all braindead. The part that is done the best is the \"feeling of pain\" of Lara. When she's injured is brutal and efective. If it was a movie it would be a decent summer blockbuster\r\n5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Potentially one of best adventure games with huge range and variety of quests.  But spoiled by almost impossible task of getting down the river without getting speared!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10\r\nI remember this game being good but the camera shake makes me want to throw up.\r\n\r\nI was really looking forward to playing a game I have fond memories of from my younger days but I do not know how I put up with the camera shake as a kid. Maybe it has something to do with playing the game on a monitor and not a tv on the other side of the room but I can not get through this game.\r\n\r\nI do remember the game having a pretty good story, and the graphics are what you'd expect for a game from the 360 era: not great not terrible. The combat is pretty generic with the issue of it being a cover shooter without a dedicated button to get into or out of cover. You kinda just have to press yourself up against a wall.\r\n\r\nI picked this game up on sale for super cheap so if you do as well and can find a mod to fix the camera shake then it's probably worth a play. But I can not be bothered to mod this game so I'm just going to hope the sequels to this game get rid of the awful camera shake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the gameplay is clanky, with slow movments, combat gets repetitive fast, and the few tombs you do find are more annoying than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is buggy as all fuck it's ridiculous. Corners cut off even though my aspect ratio is set correctly, and the game will completely crash your PC when you click the graphics options if they aren't set correctly. Also the QTEs are fucking dogshit. They're symbols instead of just telling you which button to press, so do I have to figure it out on my fucking own? dogshit game design. It's FULL of bugs. Buggy movement, and gameplay is slow and boring. Skip this and play rise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay, that gets easier the further one you go. Cute timing puzzles, nothing too fancy. Unfortunately quite buggy on Ubuntu. (sound and gameplay glitches mostly, no crashes, thankfully) \r\nThe story is pretty interesting, although horribly executed thanks to terrible dialogue and overdramatization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if playing with mouse and keyboard. once you get to the wolf den its gg. literally wont let you get past the quick time event.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After playing for several time, it crashed! It didn't open again. Filled with too much bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just wanted some Nostaliga Feeling BUT horrible QTE and Buggy Climbing RUINED whole game experiecen, what a shame...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically a worse but workable version of The Last of Us. TLOU is way better, go play that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe it was a good game in 2013 but now it is boring, graphics are old PS3-like, animations are jarring. Story is all about mystery, nothing realistic, and probably something you've heard many times before. Modern Lara Croft games are way better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I keep finding bugs that stop my progression. I have to search the internet for work arounds that may or may not work.  This is very frustrating!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't like the graphics so much. It's not a good looking game in 2025 but nice story. I don't reccomend it because I would chose something else to play in 2025.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to be handheld with yellow and white paint through some qte then yeah this is for you. utterly forgettable. it's called tomb raider but \"raid\" means do a simple puzzle to get some scrap and xp from an \"optional\" tomb area. also there is way too much shaky camera effects added for no reason. you have to edit the ini file to remove a lot of it from the gameplay. the cutescenes are like watching blair witch trial on a portable dvd player while riding on an unpaved road.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I physically can't play this game. The constant screen swaying makes me sick. Walking around casually makes me feel like I'm battling a sea on a ship. I get about 10 minutes in and get sick. No option to turn it off. I tried like 3 sittings of thinking it was just a fluke, but I just can't do it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth playing. Game is ruined by quicktime events.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unplayable due to screen shaking  :steamthumbsdown:",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trouble beating the huge guard in “Gone Missing” level.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lara gets tortured for 10 hours straight",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "punk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✪✪✩✩✩✩✩✩✩ (3/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]5/10[/h1]\r\n\r\nFirst, there are fun parts to the game, the graphics look good(except Lara looks different from the original games), and the audio is good(except some really repetitive sections)  There are many problems with this game, and it's not just that the game is really buggy(game breaking in some sections.)   Near the beginning of the game I had to leave the area and come back to be able to continue.  Check the Discussions board for all the issues.  \r\n\r\nThis game is a pale imitation of the original Tomb Raider games.  It feels more like trying to play a movie with very clunky controls, which change often. There are way too many cutscenes, and Quick Time Events(QTEs are playable cutscenes.)  The real adventure is trying to figure out what the controls are going to be in the next cutscene/QTE.  As I said there were fun parts, but the annoying things outweighed the fun.  Aside from that, it was mostly very easy, and I played on the [i]Hard Setting[/i].\r\n\r\nThings I had an issue with:\r\n\r\n- Automatic hints, and the NPCs will give you the solution almost immediately,\r\n  before you've even had a chance to look around and figure things out\r\n- Very few challenging puzzles;  most are very, very simple(not really puzzles),\r\n   and just take common sense to solve.  Even so, you'll have NPCs telling you how\r\n   to solve it anyway.\r\n- Lara automatically crouches/changes stance when enemies are near, giving a player\r\n   a visual warning that enemies are nearby.  Just another example of dumbing down a game\r\n- Too Much Ammo Available - Even on Hard I rarely ever had any less than full ammo \r\n  on all ammo types.  Most of the time I couldn't pick up ammo because I was already full.  Again,\r\n  this was on the [i]Hard[/i] setting.\r\n- Zoom stops working in some area/times\r\n- Geometry issues in DLC Tomb with Crashed plane(req. leaving/restarting)\r\n- using Torch happens automatically, swithes to your handgun and you have to aim first to \r\n   be able to change back to your chosen weapon.\r\n- awkward controls that change based on your view\r\n- very restrictive view angles in some areas;  sometimes you can't look anywhere at all,\r\n   which adds to the feeling of the game being overly linear.\r\n- when dodging/countering, the camera always turns away from the view you're facing,\r\n   or pushes you around corners, leaving you exposed to enemies;  the camera will often\r\n   place your view away from the enemy; again leaving you exposed.\r\n- controls are all over the place, and work against you.\r\n-  Quick Time Events(QTE) that look like cutscenes, until you start seeing button cues pop\r\n    up on the screen, and after you've leaned back to watch the cutscene.\r\n- no warning when QTEs are over\r\n-  Many QTE's lead to actions which change controls in awkward ways;  running toward\r\n    the camera, away from the camera, at oblique angles,etc., so you have to figure out\r\n    the ever changing controls on the fly.\r\n - very clunky controls from time to time\r\n- the game feels very linear at times, forcing a player into a certain direction\r\n- useable surfaces splashed with white paint, rather than letting the player\r\n  explore and find out what they can climb\r\n- Crosshair shows a clean shot, but hits background surfaces when you shoot;\r\n    Blocking Geometry isn't taken into account when zooming in.\r\n- aiming near corners automatically puts you most of the way around the corner\r\n  allowing enemies to easily hit you\r\n- getting fired on and/or hit when an enemy has no line of sight\r\n- Weapons shoulder placement always changing for weapons(should remain till player toggles it)\r\n- DLC Tombs show the same video every time you clear a hidden tomb; Lara opening a generic treasure \r\n  chest which doesn't show any particular item.  Clearing the DLC Tombs isn't rewarding at all, except the\r\n  feeling of accomplishment from figuring out the puzzles(a few of them at least.)\r\n- Dynamite  sometimes moves through walls and barriers, or under the floor.\r\n- jumping and aiming stopped working on the Ritual Battle intermittently.\r\n- Can't shoot Mathius at the Ritual Battle until the game wants you to;  the crosshair blanks out.\r\n- I hit the Stormguard Boss, on Ritual Battle, from behind, and, somehow, \r\n  he picks me up by the neck?!\r\n- If you continue to play the game after the first playthrough, there are very few spawns;\r\n  most maps have no spawns, and it makes it hard to get some achievements.  So you have to\r\n  start the game from the beginning to try for some achievements;  this requires regaining the\r\n  skills you earned in the first playthrough.\r\n - random crashes\r\n - some cutscenes aren't skipable",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Unplayable due to the UI being stretched beyong the screen making it impossible to see notifications and respond to timed response events, and thats regardless of the resolution or the actual screen size as I tried on two monitors. Apparently the problem is well known, just wansn't solved during the time this game was relevant.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "These game has many bugs. Played 35% of the came and was hardlocked because of it. Some bugs cane be overcome if you reload your checkpoint (the bell and wind puzzle was one of them where the bell beam would not break when you did the puzzle correctly). My game could not be continued at the gas explosion mini puzzle where you have to ignite the gas with a fire arrow to release a metal box on which you have to climb to reach the top of the wall to progress. Tried reloading the checkpoint, relaunched the game, changed my graphics setting to normal from ultra as recommended by the developer and it would not work.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "one of the worst games i have played. Constant crashes unless you use beta version, taking damage from nothing, skill checks half of the time either don't appear or don't register, falling or clipping through the map.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am stuck in a cave with a wolf where I am told to press a button then another one but the game decides I am not pressing the button... Tried re-installing it and playing with a controller but none of that works.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Audio does not work in this application once control is given to the player, after initial intro sequences. The game is made unplayable. Replugging audio devices is NOT an option, and cannot be performed. Other software works fine with current audio config; there is no reason for it to not work in the game, soley excepting incompetence. o.O",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate how this game demands a life to get all trophies, and most importantly, it's so poorly programmed that I have to go over and over a single jump just because it demands a perfect position and timing that makes no sense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, I would rate it 2/4.\nI went in blind without knowing the backstory and it felt off. I didn't really expect to understand all of the story, but at the main character's backstory.\nThe gameplay is more of a run'n'gun instead of an actual Tomb Raider, which I find quite funny.\nThe intro was the best, later on I could guess the story from a mile away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont know. i cant get it to work past the 1st part to start walking. she falls into the water the loading screen and doesnt move on to the next part",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The collectables achievements are insanely tedious to grind, the story is pretty dragged out, and the graphics for a 2013 game is pretty mid, Overall a 6/10, just play rise of TB",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "some VERY frustrating puzzles aside from all the fucking bugs and the shit exploration i tried to finish the game but i needed some kind of new equipment that the game doesnt provide shit on how to get it this game is just absolute fucking shit the only good thing about it is the graphics which i think it was good for its time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was not an interesting game. The gameplay is clunky. The puzzles are mid and kinda dumb. So is the story. The characters are almost all braindead. The part that is done the best is the \"feeling of pain\" of Lara. When she's injured is brutal and efective. If it was a movie it would be a decent summer blockbuster\r\n5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Potentially one of best adventure games with huge range and variety of quests.  But spoiled by almost impossible task of getting down the river without getting speared!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3/10\r\nI remember this game being good but the camera shake makes me want to throw up.\r\n\r\nI was really looking forward to playing a game I have fond memories of from my younger days but I do not know how I put up with the camera shake as a kid. Maybe it has something to do with playing the game on a monitor and not a tv on the other side of the room but I can not get through this game.\r\n\r\nI do remember the game having a pretty good story, and the graphics are what you'd expect for a game from the 360 era: not great not terrible. The combat is pretty generic with the issue of it being a cover shooter without a dedicated button to get into or out of cover. You kinda just have to press yourself up against a wall.\r\n\r\nI picked this game up on sale for super cheap so if you do as well and can find a mod to fix the camera shake then it's probably worth a play. But I can not be bothered to mod this game so I'm just going to hope the sequels to this game get rid of the awful camera shake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the gameplay is clanky, with slow movments, combat gets repetitive fast, and the few tombs you do find are more annoying than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is buggy as all fuck it's ridiculous. Corners cut off even though my aspect ratio is set correctly, and the game will completely crash your PC when you click the graphics options if they aren't set correctly. Also the QTEs are fucking dogshit. They're symbols instead of just telling you which button to press, so do I have to figure it out on my fucking own? dogshit game design. It's FULL of bugs. Buggy movement, and gameplay is slow and boring. Skip this and play rise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay, that gets easier the further one you go. Cute timing puzzles, nothing too fancy. Unfortunately quite buggy on Ubuntu. (sound and gameplay glitches mostly, no crashes, thankfully) \r\nThe story is pretty interesting, although horribly executed thanks to terrible dialogue and overdramatization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if playing with mouse and keyboard. once you get to the wolf den its gg. literally wont let you get past the quick time event.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After playing for several time, it crashed! It didn't open again. Filled with too much bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just wanted some Nostaliga Feeling BUT horrible QTE and Buggy Climbing RUINED whole game experiecen, what a shame...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically a worse but workable version of The Last of Us. TLOU is way better, go play that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't like the graphics so much. It's not a good looking game in 2025 but nice story. I don't reccomend it because I would chose something else to play in 2025.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe it was a good game in 2013 but now it is boring, graphics are old PS3-like, animations are jarring. Story is all about mystery, nothing realistic, and probably something you've heard many times before. Modern Lara Croft games are way better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to be handheld with yellow and white paint through some qte then yeah this is for you. utterly forgettable. it's called tomb raider but \"raid\" means do a simple puzzle to get some scrap and xp from an \"optional\" tomb area. also there is way too much shaky camera effects added for no reason. you have to edit the ini file to remove a lot of it from the gameplay. the cutescenes are like watching blair witch trial on a portable dvd player while riding on an unpaved road.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I physically can't play this game. The constant screen swaying makes me sick. Walking around casually makes me feel like I'm battling a sea on a ship. I get about 10 minutes in and get sick. No option to turn it off. I tried like 3 sittings of thinking it was just a fluke, but I just can't do it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth playing. Game is ruined by quicktime events.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unplayable due to screen shaking  :steamthumbsdown:",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lara gets tortured for 10 hours straight",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✪✪✩✩✩✩✩✩✩ (3/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[h1]5/10[/h1]\r\n\r\nFirst, there are fun parts to the game, the graphics look good(except Lara looks different from the original games), and the audio is good(except some really repetitive sections)  There are many problems with this game, and it's not just that the game is really buggy(game breaking in some sections.)   Near the beginning of the game I had to leave the area and come back to be able to continue.  Check the Discussions board for all the issues.  \r\n\r\nThis game is a pale imitation of the original Tomb Raider games.  It feels more like trying to play a movie with very clunky controls, which change often. There are way too many cutscenes, and Quick Time Events(QTEs are playable cutscenes.)  The real adventure is trying to figure out what the controls are going to be in the next cutscene/QTE.  As I said there were fun parts, but the annoying things outweighed the fun.  Aside from that, it was mostly very easy, and I played on the [i]Hard Setting[/i].\r\n\r\nThings I had an issue with:\r\n\r\n- Automatic hints, and the NPCs will give you the solution almost immediately,\r\n  before you've even had a chance to look around and figure things out\r\n- Very few challenging puzzles;  most are very, very simple(not really puzzles),\r\n   and just take common sense to solve.  Even so, you'll have NPCs telling you how\r\n   to solve it anyway.\r\n- Lara automatically crouches/changes stance when enemies are near, giving a player\r\n   a visual warning that enemies are nearby.  Just another example of dumbing down a game\r\n- Too Much Ammo Available - Even on Hard I rarely ever had any less than full ammo \r\n  on all ammo types.  Most of the time I couldn't pick up ammo because I was already full.  Again,\r\n  this was on the [i]Hard[/i] setting.\r\n- Zoom stops working in some area/times\r\n- Geometry issues in DLC Tomb with Crashed plane(req. leaving/restarting)\r\n- using Torch happens automatically, swithes to your handgun and you have to aim first to \r\n   be able to change back to your chosen weapon.\r\n- awkward controls that change based on your view\r\n- very restrictive view angles in some areas;  sometimes you can't look anywhere at all,\r\n   which adds to the feeling of the game being overly linear.\r\n- when dodging/countering, the camera always turns away from the view you're facing,\r\n   or pushes you around corners, leaving you exposed to enemies;  the camera will often\r\n   place your view away from the enemy; again leaving you exposed.\r\n- controls are all over the place, and work against you.\r\n-  Quick Time Events(QTE) that look like cutscenes, until you start seeing button cues pop\r\n    up on the screen, and after you've leaned back to watch the cutscene.\r\n- no warning when QTEs are over\r\n-  Many QTE's lead to actions which change controls in awkward ways;  running toward\r\n    the camera, away from the camera, at oblique angles,etc., so you have to figure out\r\n    the ever changing controls on the fly.\r\n - very clunky controls from time to time\r\n- the game feels very linear at times, forcing a player into a certain direction\r\n- useable surfaces splashed with white paint, rather than letting the player\r\n  explore and find out what they can climb\r\n- Crosshair shows a clean shot, but hits background surfaces when you shoot;\r\n    Blocking Geometry isn't taken into account when zooming in.\r\n- aiming near corners automatically puts you most of the way around the corner\r\n  allowing enemies to easily hit you\r\n- getting fired on and/or hit when an enemy has no line of sight\r\n- Weapons shoulder placement always changing for weapons(should remain till player toggles it)\r\n- DLC Tombs show the same video every time you clear a hidden tomb; Lara opening a generic treasure \r\n  chest which doesn't show any particular item.  Clearing the DLC Tombs isn't rewarding at all, except the\r\n  feeling of accomplishment from figuring out the puzzles(a few of them at least.)\r\n- Dynamite  sometimes moves through walls and barriers, or under the floor.\r\n- jumping and aiming stopped working on the Ritual Battle intermittently.\r\n- Can't shoot Mathius at the Ritual Battle until the game wants you to;  the crosshair blanks out.\r\n- I hit the Stormguard Boss, on Ritual Battle, from behind, and, somehow, \r\n  he picks me up by the neck?!\r\n- If you continue to play the game after the first playthrough, there are very few spawns;\r\n  most maps have no spawns, and it makes it hard to get some achievements.  So you have to\r\n  start the game from the beginning to try for some achievements;  this requires regaining the\r\n  skills you earned in the first playthrough.\r\n - random crashes\r\n - some cutscenes aren't skipable",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Unplayable due to the UI being stretched beyong the screen making it impossible to see notifications and respond to timed response events, and thats regardless of the resolution or the actual screen size as I tried on two monitors. Apparently the problem is well known, just wansn't solved during the time this game was relevant.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "These game has many bugs. Played 35% of the came and was hardlocked because of it. Some bugs cane be overcome if you reload your checkpoint (the bell and wind puzzle was one of them where the bell beam would not break when you did the puzzle correctly). My game could not be continued at the gas explosion mini puzzle where you have to ignite the gas with a fire arrow to release a metal box on which you have to climb to reach the top of the wall to progress. Tried reloading the checkpoint, relaunched the game, changed my graphics setting to normal from ultra as recommended by the developer and it would not work.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "one of the worst games i have played. Constant crashes unless you use beta version, taking damage from nothing, skill checks half of the time either don't appear or don't register, falling or clipping through the map.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am stuck in a cave with a wolf where I am told to press a button then another one but the game decides I am not pressing the button... Tried re-installing it and playing with a controller but none of that works.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tombs are optional. Feels like Lara was copied pasted in another game. Lot of shooting and warfare. Signature weapon the bow? I don't think so.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent game ruined by two things:\nThe camera wobble that cant be turned off without risking virus-infected mods.\nThe constantly respawning wolves.\nFail.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Audio does not work in this application once control is given to the player, after initial intro sequences. The game is made unplayable. Replugging audio devices is NOT an option, and cannot be performed. Other software works fine with current audio config; there is no reason for it to not work in the game, soley excepting incompetence. o.O",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hate how this game demands a life to get all trophies, and most importantly, it's so poorly programmed that I have to go over and over a single jump just because it demands a perfect position and timing that makes no sense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, I would rate it 2/4.\nI went in blind without knowing the backstory and it felt off. I didn't really expect to understand all of the story, but at the main character's backstory.\nThe gameplay is more of a run'n'gun instead of an actual Tomb Raider, which I find quite funny.\nThe intro was the best, later on I could guess the story from a mile away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont know. i cant get it to work past the 1st part to start walking. she falls into the water the loading screen and doesnt move on to the next part",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The collectables achievements are insanely tedious to grind, the story is pretty dragged out, and the graphics for a 2013 game is pretty mid, Overall a 6/10, just play rise of TB",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "some VERY frustrating puzzles aside from all the fucking bugs and the shit exploration i tried to finish the game but i needed some kind of new equipment that the game doesnt provide shit on how to get it this game is just absolute fucking shit the only good thing about it is the graphics which i think it was good for its time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Was not an interesting game. The gameplay is clunky. The puzzles are mid and kinda dumb. So is the story. The characters are almost all braindead. The part that is done the best is the \"feeling of pain\" of Lara. When she's injured is brutal and efective. If it was a movie it would be a decent summer blockbuster\r\n5/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Potentially one of best adventure games with huge range and variety of quests.  But spoiled by almost impossible task of getting down the river without getting speared!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the gameplay is clanky, with slow movments, combat gets repetitive fast, and the few tombs you do find are more annoying than fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is buggy as all fuck it's ridiculous. Corners cut off even though my aspect ratio is set correctly, and the game will completely crash your PC when you click the graphics options if they aren't set correctly. Also the QTEs are fucking dogshit. They're symbols instead of just telling you which button to press, so do I have to figure it out on my fucking own? dogshit game design. It's FULL of bugs. Buggy movement, and gameplay is slow and boring. Skip this and play rise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is very bad. The delay ingame is so bad that headshots on moving targets are impossible.\nAlso the game keeps either crashing or jumping to desktop.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Main character is too weak and emotional to make this story believable. also shotgun in this game is trash.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay, that gets easier the further one you go. Cute timing puzzles, nothing too fancy. Unfortunately quite buggy on Ubuntu. (sound and gameplay glitches mostly, no crashes, thankfully) \r\nThe story is pretty interesting, although horribly executed thanks to terrible dialogue and overdramatization.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if playing with mouse and keyboard. once you get to the wolf den its gg. literally wont let you get past the quick time event.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After playing for several time, it crashed! It didn't open again. Filled with too much bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just wanted some Nostaliga Feeling BUT horrible QTE and Buggy Climbing RUINED whole game experiecen, what a shame...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Basically a worse but workable version of The Last of Us. TLOU is way better, go play that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe it was a good game in 2013 but now it is boring, graphics are old PS3-like, animations are jarring. Story is all about mystery, nothing realistic, and probably something you've heard many times before. Modern Lara Croft games are way better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I keep finding bugs that stop my progression. I have to search the internet for work arounds that may or may not work.  This is very frustrating!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't like the graphics so much. It's not a good looking game in 2025 but nice story. I don't reccomend it because I would chose something else to play in 2025.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to be handheld with yellow and white paint through some qte then yeah this is for you. utterly forgettable. it's called tomb raider but \"raid\" means do a simple puzzle to get some scrap and xp from an \"optional\" tomb area. also there is way too much shaky camera effects added for no reason. you have to edit the ini file to remove a lot of it from the gameplay. the cutescenes are like watching blair witch trial on a portable dvd player while riding on an unpaved road.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I physically can't play this game. The constant screen swaying makes me sick. Walking around casually makes me feel like I'm battling a sea on a ship. I get about 10 minutes in and get sick. No option to turn it off. I tried like 3 sittings of thinking it was just a fluke, but I just can't do it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not worth playing. Game is ruined by quicktime events.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "unplayable due to screen shaking  :steamthumbsdown:",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trouble beating the huge guard in “Gone Missing” level.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lara gets tortured for 10 hours straight",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "punk",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✪✪✩✩✩✩✩✩✩ (3/10)",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}