{
  "positive": [
    {
      "review": "I have nailed my down-syndrome sister who received her genetic impairment (or blessing depending on how you view the downs community) from the inbreeding of my dynastic predecessors.\r\n\r\nI have taken money from the Jews knowing full well I would only expel them as repayment.\r\n\r\nI have created an antipope, who was also my gay lover.\r\n\r\nI have successfully recreated the Hapsburg dynasty in look alone.\r\n\r\nI have installed my own family as Byzantine emperor, only for them to imprison and execute me as thanks.\r\n\r\nThis game is so fucking good why haven't you gotten it?\r\n\r\nPROTIP: Don't waste your money buying all the DLC, Paradox is ripping you off. Buy the subscription for a few months, delete it when you get bored of CK2. You can always go back to it, you can never wash the feeling of being a sucker for being a few hundred for one game.",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "> Start a Kingdom with the country you live in IRL\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "[b]Crusader Kings II is still one of the deepest and most addictive strategy games I’ve ever played.[/b]\n\nI’ve put over 4300 hours into it, and most of that time has been with the AGOT mod — which honestly turns the game into its own world. CK2 might be old and rough around the edges, but the character-driven gameplay and all the unpredictable stories you get out of it are unmatched. No two campaigns ever feel the same, especially with the Westeros setting layered on top.\nIf you enjoy emergent storytelling, politics, and that classic Paradox chaos, CK2 (especially with AGOT) is still one of the best strategy experiences you can sink time into.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This one of three Paradox games that I would recommend the other being Hearts of Iron and Europa Universalis. It is slowed paced at times and there are periods where there is nothing much to do, but if you like micromanagement with a human touch and building something from next to nothing, this is for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great intro to one of my favorite simulators, it has always been a crash heavy game, but due to modern computer builds, it should be much faster to run (still crash frequent). The Game of Thrones mod is fun, but the base historical game of CK2 is just as pleasant, 9/10 would recommend trying it on a random weekend and try to learn the mechanics (Probably the only difficult thing about the game.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The free-with-no-dlc experience is pretty damn good. I've never won as I get attached to my initial King of Norway, and generally don't play after he dies, but I've still gotten pretty far with just him, and it's entertaining.\r\n\r\nWould recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favourite games, the best of the Crusader Kings series. The game is harder to get into, but once you grasp the basics, the world is yours! The game is out of development now, but that makes it even better, there are no bugs and no updates will mess your save games up.\n\nThe best argument for this game are the mods. Amazing, flavourful mods await you to enjoy. Don't be scared of the age of the game, it looks nice and the gameplay is deeper than in CK3...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm writing a review months after writing one for its sequel, I will update this once I redownload it and see how it holds up. I finished the game with over 1k hours right before I finally got my hands on it's sequel. I will say if you enjoy this game a lot you should buy the sequel if you have the money. I bought the majority of these DLC's through sales or simply from giveaways. DO NOT, I repeat DO NOT. Buy these DLC's full price, they are fun but anything above $5 is essentially a scam for a game that isn't developed anymore.\n\nCrusader Kings 2 is a game of intrigue, warfare and family bonding. Well \"bonding\", really you jockey members of your family around in marriages to either gain prestige, power or both. In the base game IIRC you play as a Christian, this is a pretty large section from Ireland to the Byzantine empire. If you can get past the aged graphics it is quite enjoyable. But everything else is locked behind a paywall. This includes Muslims, Monks, Cults & societies, Holy Orders, China, India, Plagues and a lot of flavor overall. So, its not surprising why the base game is free. \n\nThe majority of the things I just stated are free in it's sequel, but the cults & Societies, Holy Orders and Monks are behind a paywall or simply don't exist. The strength in this game is the storytelling, it is made with the intent of not being too serious and allowing the player to experience both the realistic part of the times and the more laughable ones. Maybe you want to hire a horse as a court member? go right ahead. Maybe you want to live in a world where bears took over the world and not Humans? here you can! (If you buy the holy fury DLC, which I recommend). Or maybe you want to clutch the crown off the French king and do what Napoleon narrowly failed to do? In this you can! \n\nBut as they say keep your friends close, and your enemies closer. Enemy and friend being your family, or even just genetics. Maybe you're the father of five kids, the second is strong, intelligent and very charismatic. Practically born to rule your kingdom you've spent your entire life building... then there's your firstborn. He's not terrible, but he's definitely nothing like his brother. So what do you do? Love him with all your heart because he's your son :)\n (Ship him off to war and hope he dies or simply gut him with a knife, your choice.)  \n\nThat's the kind of choice you may have to make in this game, Maybe you want to keep your dynastic claims across multiple kingdoms but don't want to go to war, befriend your relative and use blood as proof of your undying love!\n (Or marry your cousin and ensure you have a child to inherit both titles.)\n\nYou have a lot of options in this game, The majority of which are looked down in modern society, understandable. But for this time? all's fair in incest and war crimes. I feel I should clarify I don't advocate for any of this irl, but this is a different time, and different times call for different rules. The rule here? By any means necessary,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An alternative form of history lessons because of the rich content of history. Real grand strategy game, from marriage to diplomacy. Your brain power and planning skills are key to playing but many elements affect and determine your achievements and results.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rating: 8 - Highly Recommended\r\n\r\nI have 2046 hours in this game.\r\nI have done everything I wanted to do in this game.\r\nEven with the DLC scheme, I still got my pennies worth many times over.\r\nI am one of the few that does in fact enjoy the Sunset Invasion, because it gives me a late game challenge, and spices up the game in a different way, whereas otherwise I find the endgame to be boring. The Sunset Invasion makes it interesting to me, but that's a matter of taste.\r\nThis game propelled Paradox into the gaming sphere on a serious note.\r\nIt is better than CK3 - and it's not suppose to be.\r\nThis is like, they had fun making the game, and make a game they wanted to play themselves.\r\nCK3 is a game for commercial purposes, detached. \r\n\r\nIf I love the game so much why an 8?\r\nIt's top tier, but not seismic in gaming as a whole. Witcher 3 would be a 9/10 and it's not on that bandwidth. \r\n\r\nYou'd get more entertaining out of this game. It's not as new and shiny as CK3, but you'd get use to the veneer.\r\n\r\n---------------------------------\r\n\r\nRating System:\r\n\r\n10 – Transcended\r\n9 – Exceptional\r\n8 – Outstanding\r\n7 – Competent\r\n6 – Average\r\n5 – Below Par\r\n4 – Poor\r\n3 – Incompetent\r\n2 – Failed\r\n1 – Non-functional\r\n\r\nI rate harshly. The bell curve sits at 6, not at 9–10, on this grading system.\r\nWhy is the average rating a 6?\r\nBecause 1 is almost never used, whereas 10 gets used more often thanks to games that pushed the standards and envelope of gaming — and became part of global culture in the process.\r\n\r\nExample of a 1: Sigil 3D VTT.\r\n\r\nIndie Games:\r\nIndie games will often have a lower rating. If you’re taking your finals to become a doctor, you’re not judged relative to your personal effort - you’re judged against the standards required to be a doctor. Indie games are judged on the same scale as giants like vanilla WoW, Halo, and so on.\r\nSo yes, indie games will often rate lower - but that doesn’t mean they’re not good or not worth your time.\r\n\r\n\r\nIndie games will often roam at:\r\n\r\n7 - Usually the top notch indie games\r\n6 - Great indie game\r\n5 - Decent-Good, worth your time\r\n4 - Poor-Avarge-Decent (but unpolished), can be worth your time\r\n3 - Poor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Free game. That right there says a lot about Ck2. I will admit, The idea of buying a bunch of Dlcs for basic game mechanics sounds scummy, and it is. But Ck2 is suprisingly still fun without spending a dime, there are various mods for the game on the workshop and other sites (I think) and even then, the Dlcs go on large discounts suprisingly often.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like to play with history this is your game, although it is the second game of the saga and it was released in 2012 it is an excelent game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely love this game so much replayability and ive only been playing since 2020",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of game-play is behind a paywall, but the game is exceptionally good considering it's free. 8.5/10, would recommend if you're looking for an interesting way to kill time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "marry your cousins, stab your boss or wife in the back (literally), go on crusade or jihad, loot and pillage villages, play as your own great-great grandson and die of syphilis and that's just on single player.  DLC is a pain but if you play the free version and have friends or a subscription welcome to Crusader Kangs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cross between Paradox's highly simulative map-based style of grand strategy and event-and-flag-based storytelling. Your military may be important, but understanding the implications of your family tree will weigh heavily if you want to go around conquering anything. So compared to other grand strategy series from this studio, your playthrough might be satisfyingly dramatic.\n\nIn the course of play you will perhaps decide to:\n- Memorize the lyrics to “In Taberna”, a medieval poem in Latin (the actual medieval tune is also a banger)\n- Arrange your children’s marriages eugenically\n- Rewrite your will to leave your stuff in a tax haven trust fund for your firstborn because gavelkind succession will decisively destroy whatever generational wealth you’ve worked so hard to build\n- Convert religions for the most cynical reasons possible\n\nThe UI and discoverability of some of your policy levers was not great even when this came out, but get over that and you may come out the other side with the memory of Game of Thrones antics that the fickle finger of Fate forced you into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the deepest strategy games ever. You don’t play a nation, you play a dynasty — and every betrayal hurts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, UI leaves a little to be desired, but the game itself is fire!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The classic feudalism simulator. Probably still holds up to this day, but ck3 does exist so...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a classic that can't be replicated in today's day and age",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 10 years I kinda started to understand the game and decided I wanted to play North Wales Conquers Everyone, y'know, something nice and easy. \n\n>any time I seem to get anywhere, England unifies and saunters up like \"lovely county of Powys you got there, think I'll have that\"\n>buy Old Gods DLC for the earlier start date, see if I can get ahead of England, two more catastrophic failures\n>third time's the charm: abandon all careful politics and go fully maniac mode\n>assassinate my brother in law so my wife inherits his lands, switch to primogeniture succession before I'm a kingdom and have to answer to some sort of democracy\n>aggressively claim any English county I can to stop them getting too big\n>murder the king of Wessex, leaving them headed by a six-year-old Irish kid \n>Fratricelli heresy in Northern England? choo-choo here comes the holy war for Lancaster, it' mine now, heretics\n>any English noble looks a bit powerful I come down on them like a hammer of preemptive defence\n>any attempt to replace me with some cousin or half-sibling quickly runs into a severe case of assassination \n>it's all looking good and I've never had this much success\n\nOnly minor problem at this point in that game was that my dynasty, the noble house of Aberffraw, seemed to largely consist of rampant sex-maniacs and deviants. Character dies and I start playing as my heir? See he's got seduction focus and two lovers...[i]One of them is his sister[/i]. \"Your five year old nephew died comatose in his bed\" yeah, not that surprising, considering he was my son-phew. \n\nBack to back notifications about my daughter acting \"indiscreetly\" and getting knocked up before marriage. \n\nUnmarried sister? Unmarried sister with [i]four[/i] illegitimate children. Via our cousin, [i]of course[/i]. And her daughters were apparently the same as their alley-cat mother, so when I married them off I get notifications about both being nicknamed \"the unfaithful\" in the space of a year. One of them even killed the heir to West Francia. Not like an assassination plot, just y'know, because of the syphilis. \n\nNo army or political intrigue could stand against the might of Aberffraw, inbreeding and venereal disease though? Those seemed like a real danger. \n\nI [i]did[/i] eventually pull them out of that funk, and go on to found the (significantly less incestuous) Empire of Britannia and spread Welsh culture to the European mainland, but it sure was touch(ing your close relatives) and go there for a while. \n\nPhenomenal game, 10/10. And, while I don't generally like subscription models the all-DLC subscription that I bought after all that has been worth it. It's dead cheap and I can cancel if I'm going through another six months of not playing before it takes over my life again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ecclectic, detailed and malleable! It allows you almost full control and has great graphics! https://store.steampowered.com/app/203770/Crusader_Kings_II/#",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Explore one of the defining periods in world history in an experience crafted by the masters of Grand Strategy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is highly addictive and extremely tricky. There's a steep learning curve and the 'learning tutorial' does not help but once you kinda get into it its easy to accidentally stay up to 2am playing it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my boyfriend always gets annoyed when we play together because he has 950 more hours than me, and all I want is to be a satanist ruling the Holy Roman Empire. Still 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, my horse is more noble than you fools. Cope.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "107 hours in. No I have not come close to \"Winning\" yet... 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "le jeu est excellent mais le multi est bugé de fou",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crusader Kings II: Crusade of the King Two",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Watch a few tutorials then it's fire!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Historic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest game ever made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The things I've done\nThe lives I've ruined\nI sleep no more\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Still better than CK3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still enjoy it more than III",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I love. politics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "robbed my kid would play again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awwesome game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun asf",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Я сьел свою жену и получил +1 образованость",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DEUS VULT!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yay mappies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im a welsh guy :) 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dobra igrica",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "im in too deep",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Thumbs Up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better then CK3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My wife left and took the kids but I revived the roman empire!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "d e u s  v u l t",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "dawg dawg dawg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "~",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "accidentally married my granddaughter off to my half brother and created an inbred lineage that eventually caused the collapse of my empire. 10/10 gaming experience.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "I have nailed my down-syndrome sister who received her genetic impairment (or blessing depending on how you view the downs community) from the inbreeding of my dynastic predecessors.\r\n\r\nI have taken money from the Jews knowing full well I would only expel them as repayment.\r\n\r\nI have created an antipope, who was also my gay lover.\r\n\r\nI have successfully recreated the Hapsburg dynasty in look alone.\r\n\r\nI have installed my own family as Byzantine emperor, only for them to imprison and execute me as thanks.\r\n\r\nThis game is so fucking good why haven't you gotten it?\r\n\r\nPROTIP: Don't waste your money buying all the DLC, Paradox is ripping you off. Buy the subscription for a few months, delete it when you get bored of CK2. You can always go back to it, you can never wash the feeling of being a sucker for being a few hundred for one game.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "Giving a review to benchmark myself. I'm playing on steam deck only. never played a CK game before. and I have all of the DLC. starting at 2025.\n\nAt the time of the review I'm at 2 hours played. If I will stay under 10 then it's not really enjoyable on SD for a 100% new player. \n\nHowever, should my hours increase, this will be a silent yet powerful testimony for this game. GL future me.",
      "voted_up": true,
      "votes_helpful": 24
    },
    {
      "review": "> Start a Kingdom with the country you live in IRL\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies\n> Begin expanding and conquering\n> Feels good\n> Get a couple of children to secure your dynasty\n> Nice, now I don't have to worry about losing the game and my kingdom will thrive\n> King dies\n> Everything I worked for gets split up into several counties/duchies",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "An incredibly relaxing game once you learn the systems. Its essentially a cozy game where I see what crazy alt history I can make. CK3 is deeper in parts, but CK2 will always feel like home.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "After 7 long years humble bundle sold this game with all major expansions for 15$\n\nI never bought this game when it came out because i knew it will just eat my wallet whole with it's million expensive expansions.\n\nBut 15$ is completely worth it.\n\nJust wait 7 years guys!",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "the best paradox game made in history\nalso very playable with friends because its literally free\nnote that multiplayer is genuinely very buggy (corrupted gamestate, crashes etc)\nbut in general in both sp and mp probably the best game in both vanilla and mods",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Open to play, knowing nothing\nopening youtube...\nEasy to learn, cant even play\nopening youtube...\nHard to master, forget everything\nopening youtube...\nAgain",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game will suck you in and will never let you go. Plan for this game to be your entire evening after you smell a weak neighbour",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[b]Crusader Kings II is still one of the deepest and most addictive strategy games I’ve ever played.[/b]\n\nI’ve put over 4300 hours into it, and most of that time has been with the AGOT mod — which honestly turns the game into its own world. CK2 might be old and rough around the edges, but the character-driven gameplay and all the unpredictable stories you get out of it are unmatched. No two campaigns ever feel the same, especially with the Westeros setting layered on top.\nIf you enjoy emergent storytelling, politics, and that classic Paradox chaos, CK2 (especially with AGOT) is still one of the best strategy experiences you can sink time into.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This one of three Paradox games that I would recommend the other being Hearts of Iron and Europa Universalis. It is slowed paced at times and there are periods where there is nothing much to do, but if you like micromanagement with a human touch and building something from next to nothing, this is for you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great intro to one of my favorite simulators, it has always been a crash heavy game, but due to modern computer builds, it should be much faster to run (still crash frequent). The Game of Thrones mod is fun, but the base historical game of CK2 is just as pleasant, 9/10 would recommend trying it on a random weekend and try to learn the mechanics (Probably the only difficult thing about the game.)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It doesn't matter whether I'm playing fair or cheating with commands/mods, this game is never not fun. It brings out the emperor in me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is ideal if, like me, you're too poor to buy CK3, or if you want to get a taste of Paradox games.\r\nThere are a lot of features in CK2 that you don't have access to, if you only have the base game. But imo, the base game is already plenty enough.\r\nIt's a great game, I totally recommend it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The free-with-no-dlc experience is pretty damn good. I've never won as I get attached to my initial King of Norway, and generally don't play after he dies, but I've still gotten pretty far with just him, and it's entertaining.\r\n\r\nWould recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a grand strategy game that's as much about people as it is about empires. What makes it so special is the blend of political intrigue, dynastic storytelling. It feels like a medieval soap opera where I'm both the director and the main character. It's that mix of strategy and storytelling, history and chaos thats makes this game as amazing as it is.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah, I love the game. Yeah, I would recommend. Yeah, you'll become addicted.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of my favourite games, the best of the Crusader Kings series. The game is harder to get into, but once you grasp the basics, the world is yours! The game is out of development now, but that makes it even better, there are no bugs and no updates will mess your save games up.\n\nThe best argument for this game are the mods. Amazing, flavourful mods await you to enjoy. Don't be scared of the age of the game, it looks nice and the gameplay is deeper than in CK3...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm writing a review months after writing one for its sequel, I will update this once I redownload it and see how it holds up. I finished the game with over 1k hours right before I finally got my hands on it's sequel. I will say if you enjoy this game a lot you should buy the sequel if you have the money. I bought the majority of these DLC's through sales or simply from giveaways. DO NOT, I repeat DO NOT. Buy these DLC's full price, they are fun but anything above $5 is essentially a scam for a game that isn't developed anymore.\n\nCrusader Kings 2 is a game of intrigue, warfare and family bonding. Well \"bonding\", really you jockey members of your family around in marriages to either gain prestige, power or both. In the base game IIRC you play as a Christian, this is a pretty large section from Ireland to the Byzantine empire. If you can get past the aged graphics it is quite enjoyable. But everything else is locked behind a paywall. This includes Muslims, Monks, Cults & societies, Holy Orders, China, India, Plagues and a lot of flavor overall. So, its not surprising why the base game is free. \n\nThe majority of the things I just stated are free in it's sequel, but the cults & Societies, Holy Orders and Monks are behind a paywall or simply don't exist. The strength in this game is the storytelling, it is made with the intent of not being too serious and allowing the player to experience both the realistic part of the times and the more laughable ones. Maybe you want to hire a horse as a court member? go right ahead. Maybe you want to live in a world where bears took over the world and not Humans? here you can! (If you buy the holy fury DLC, which I recommend). Or maybe you want to clutch the crown off the French king and do what Napoleon narrowly failed to do? In this you can! \n\nBut as they say keep your friends close, and your enemies closer. Enemy and friend being your family, or even just genetics. Maybe you're the father of five kids, the second is strong, intelligent and very charismatic. Practically born to rule your kingdom you've spent your entire life building... then there's your firstborn. He's not terrible, but he's definitely nothing like his brother. So what do you do? Love him with all your heart because he's your son :)\n (Ship him off to war and hope he dies or simply gut him with a knife, your choice.)  \n\nThat's the kind of choice you may have to make in this game, Maybe you want to keep your dynastic claims across multiple kingdoms but don't want to go to war, befriend your relative and use blood as proof of your undying love!\n (Or marry your cousin and ensure you have a child to inherit both titles.)\n\nYou have a lot of options in this game, The majority of which are looked down in modern society, understandable. But for this time? all's fair in incest and war crimes. I feel I should clarify I don't advocate for any of this irl, but this is a different time, and different times call for different rules. The rule here? By any means necessary,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An alternative form of history lessons because of the rich content of history. Real grand strategy game, from marriage to diplomacy. Your brain power and planning skills are key to playing but many elements affect and determine your achievements and results.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rating: 8 - Highly Recommended\r\n\r\nI have 2046 hours in this game.\r\nI have done everything I wanted to do in this game.\r\nEven with the DLC scheme, I still got my pennies worth many times over.\r\nI am one of the few that does in fact enjoy the Sunset Invasion, because it gives me a late game challenge, and spices up the game in a different way, whereas otherwise I find the endgame to be boring. The Sunset Invasion makes it interesting to me, but that's a matter of taste.\r\nThis game propelled Paradox into the gaming sphere on a serious note.\r\nIt is better than CK3 - and it's not suppose to be.\r\nThis is like, they had fun making the game, and make a game they wanted to play themselves.\r\nCK3 is a game for commercial purposes, detached. \r\n\r\nIf I love the game so much why an 8?\r\nIt's top tier, but not seismic in gaming as a whole. Witcher 3 would be a 9/10 and it's not on that bandwidth. \r\n\r\nYou'd get more entertaining out of this game. It's not as new and shiny as CK3, but you'd get use to the veneer.\r\n\r\n---------------------------------\r\n\r\nRating System:\r\n\r\n10 – Transcended\r\n9 – Exceptional\r\n8 – Outstanding\r\n7 – Competent\r\n6 – Average\r\n5 – Below Par\r\n4 – Poor\r\n3 – Incompetent\r\n2 – Failed\r\n1 – Non-functional\r\n\r\nI rate harshly. The bell curve sits at 6, not at 9–10, on this grading system.\r\nWhy is the average rating a 6?\r\nBecause 1 is almost never used, whereas 10 gets used more often thanks to games that pushed the standards and envelope of gaming — and became part of global culture in the process.\r\n\r\nExample of a 1: Sigil 3D VTT.\r\n\r\nIndie Games:\r\nIndie games will often have a lower rating. If you’re taking your finals to become a doctor, you’re not judged relative to your personal effort - you’re judged against the standards required to be a doctor. Indie games are judged on the same scale as giants like vanilla WoW, Halo, and so on.\r\nSo yes, indie games will often rate lower - but that doesn’t mean they’re not good or not worth your time.\r\n\r\n\r\nIndie games will often roam at:\r\n\r\n7 - Usually the top notch indie games\r\n6 - Great indie game\r\n5 - Decent-Good, worth your time\r\n4 - Poor-Avarge-Decent (but unpolished), can be worth your time\r\n3 - Poor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Free game. That right there says a lot about Ck2. I will admit, The idea of buying a bunch of Dlcs for basic game mechanics sounds scummy, and it is. But Ck2 is suprisingly still fun without spending a dime, there are various mods for the game on the workshop and other sites (I think) and even then, the Dlcs go on large discounts suprisingly often.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like to play with history this is your game, although it is the second game of the saga and it was released in 2012 it is an excelent game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely love this game so much replayability and ive only been playing since 2020",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of game-play is behind a paywall, but the game is exceptionally good considering it's free. 8.5/10, would recommend if you're looking for an interesting way to kill time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "marry your cousins, stab your boss or wife in the back (literally), go on crusade or jihad, loot and pillage villages, play as your own great-great grandson and die of syphilis and that's just on single player.  DLC is a pain but if you play the free version and have friends or a subscription welcome to Crusader Kangs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cross between Paradox's highly simulative map-based style of grand strategy and event-and-flag-based storytelling. Your military may be important, but understanding the implications of your family tree will weigh heavily if you want to go around conquering anything. So compared to other grand strategy series from this studio, your playthrough might be satisfyingly dramatic.\n\nIn the course of play you will perhaps decide to:\n- Memorize the lyrics to “In Taberna”, a medieval poem in Latin (the actual medieval tune is also a banger)\n- Arrange your children’s marriages eugenically\n- Rewrite your will to leave your stuff in a tax haven trust fund for your firstborn because gavelkind succession will decisively destroy whatever generational wealth you’ve worked so hard to build\n- Convert religions for the most cynical reasons possible\n\nThe UI and discoverability of some of your policy levers was not great even when this came out, but get over that and you may come out the other side with the memory of Game of Thrones antics that the fickle finger of Fate forced you into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the deepest strategy games ever. You don’t play a nation, you play a dynasty — and every betrayal hurts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, UI leaves a little to be desired, but the game itself is fire!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good, would recommend. Its a shame that so many DLCs are required to play the game as someone might play CK3.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun medieval-skinned excel simulator. very daunting to first start, but thats pretty much standard for paradox games and very fun once you get the hang of it. Not very historically accurate once you get into it though, but thats not always a bad thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I once had a pop-up in this game in which a baron demanded the legal right to be allowed to take the virginity of freshly married women in his domain before they got to consumate the marriage with their husbands.\n\nI allowed him because that gave me a +15 opinion modifier with the baron for 2 years.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Each time you start the game, you are greeted with literal spam.\nI have used my own mod to remove this spam but uploading it to the steam workshop isn't allowed.\n\nI do not recommend supporting this professional scamming company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "paradox is garbage now. if its been updated in the last 6 years. its probably broken in some way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "text too dang small. got so angry just trying to read the words on the screen. a nightmare of inaccessibility, and the menus are also the size of a pea so i couldn't even find any options to make it easier to read.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "spent so much time trying to figure out wtf to do, all i managed to learn was how to insult and give gifts to others didnt really learn none of the strategy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it'd be a great game if it actually fucking launched for once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its really restrictive on what you can do both in battles and economic etc affairs.Also,wtf were these mechanics,i had my sons raise troops against me and a pretender that amassed triple my army in Byzantium,like that ever happened however crazy the ruler was historically,it was easier to assasinate than to create armies out of thin air(as i already had recruited all levies from my realm)...I did a last stand against some of them in Constantinople but they had 2000 more troops and they won the battle!!!! i guess the Theodosian walls didnt exist for the devs or logic at all for such matters...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant play a pagan without DLC - FUCK YOU Paradox",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gay game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "suuuper BORING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "*****",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun, but the obnoxious advertising of the six million DLCs and the scummy subscription service make it kinda hard to play",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "Crusader Kings 2 is a good example of Paradox's predatory DLC model and with CK2 becoming free-to-play, the base game essentially became a demo.\n\nThe DLC's are basically a locked content behind a paywall, which on it's own is not bad if it was expanding the scope of the playable world instead of allowing you to play non-christian religions.\n(Note: if your heir suddenly switches religion to any of the religious groups you don't own DLC'S for, it's instant game over upon succession- great game design)\n\nFor example, it would make much more sense for Rajas of Indie and Jade Dragon DLC expand the playable map far into the Asia with it's own more developed middle age period. \n\nInstead, they made it so that the only thing that owning either of the DLC's does is allow you to play basically knock-off Europe in India and access China through a stupid panel to call for stuff.\nThere's absolutely no reason to own Rajas of Indie, since it basically plays out like if you would play in Europe and Jade Dragon is only useful for the Casus Belli's it adds.\n\nThe other pointless DLC is Legacy of Rome, with it's most noteworthy feature being the retinues that totally wreck the game and turn it into a map painter, most efficiently combined with The Old God's DLC for maximum painting. With how tribal retinues are prestige based, if you start 867,  you can easily spew out a 80k army that will wreck anything early feudal states can field before it's even 1000. The trick for that is very simple- you go full North Korea mode, removing every vassal for prestige their counties/baronies give and kill of second suitable child for succession to prevent gavelkind destruction of your land, abuse the subjugation CB on neighboring tribal chiefs and generally paint the map without really needing to go feudal at all.\n\n\nI know it's a game from 2012 and no changes will be made to it, but it's a still good example of how Paradox operates. Their DLC'S are nothing more than cut features only to be sold as *brand new content* ones a month later after release.\n\nEdit:\n\nI just did my first Roman restoration playthrough and learned that in order to become Roman culturally, you HAVE to own Holy Fury DLC. Like, what? I have Legacy of Rome (Which is needed for restoring Roman Empire) and I NEED Holy Fury in order to become proper Roman???? How mentally challanged you have to be in order to come with this outlandishly stupid idea? Pure greed, hope Paradox dies to some Chinese dev studio that will eventually reach its hand for historical strategy games. I'll happily eat that Winnie the Pooh propaganda over this.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I originally paid a price for Crusader Kings II, and now it’s free-to-play. At first, that might sound generous—until you notice the staggering €309.70 worth of DLCs locked behind paywalls. Instead of rewarding loyal players, Paradox chose to nickel-and-dime every feature and expansion. The core game is solid, but this pricing model feels exploitative and leaves a sour taste. A strategy masterpiece buried under one of the greediest DLC practices in the industry.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I think that my negative review is because the game itself is very new-player-aggressive with too many things that can be done that affect the game, so, new-player-unfriendly. Good luck if you are deep into searching your way in... ( At least this was in my case ).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Folks, DO NOT even play games like this, please, spare yourself........ Save yourself from oblivion...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Each time you start the game, you are greeted with literal spam.\nI have used my own mod to remove this spam but uploading it to the steam workshop isn't allowed.\n\nI do not recommend supporting this professional scamming company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Had fun with the immersive sim elements, but the economic practices of Paradox are insane. You essentially are just buying the engine when you buy the \"game.\" If you want to enjoy yourself you have to shill out hundreds for the actual mechanics of the game through buying seemingly endless amounts of DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is maybe a good game, but unfortunatelly, is unplayable to me - the HUD and the texts are incredible small, and altough there is a UI scale option, it literally zooms in the very low res HUD and texts, which makes it larger, but blurry and just as unreadable, as without scaling (on a 24\" monitor at 1080p)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the tutorials were confusing i was lost the whole time i played. might be a me issue though, i dont know. its a lot of reading.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F**k this mfing game , how the f**k can f**king Hungary send troops to f**king Yemen wtf? Don't play this game if you want to play as any other religion other than Christianity, I mean wtf f**k this game f**k Paradox\n\n(For context- I lost my IDK how f**king long Seljuk run cuz idk, Hungary sent 10k troops to Yemen somehow)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought the game, then it's free and you got nothing from paying it, not DLC, nothing.\nAnd then you have advertisement for DLCs and a subscription even if you paid for the game. \n\nWorse that EA ???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "paradox is garbage now. if its been updated in the last 6 years. its probably broken in some way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "text too dang small. got so angry just trying to read the words on the screen. a nightmare of inaccessibility, and the menus are also the size of a pea so i couldn't even find any options to make it easier to read.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "No comment on the game, except it is a PARADOX game.\n\nParadox Interactive is a games publisher that has lost it's soul. Selling us beautifully promoted ideas which turn out to be illusions. With the same ethical standards as an Indian money scam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A textbook of a game, but 50% more boring than literal textbooks because you can't actually do anything for political or financial reasons. \r\n\r\nThis is not a marketable product, which must be why its free to play. I guess I am stupid for assuming Paradox is different from EA in that they actually offer something of value without bugs to play for free. The tutorial bugged out so I could not complete it. I tried to play a little on my own, even researching to determine which regions and eras would be the most \"beginner friendly.\" I had *great* fun staring at a small collection of city states for another four hours, unable to do anything of significance besides breed and spend money without earning any back. The game did not explain income in the portion of the tutorial I was able to play. After googling it, even stalwarts of the game who answer questions are generally unhelpful. After deciphering a lot of jargon, I understood their opinion was that I should earn money by building up my cities to raise tax income. That costs 287 gold at minimum. What are the poor kings of Ireland supposed to do with their 150 gold coffers? Nothing, apparently. You cannot wage war without the Pope's permission and he doesn't want you to wage war on your neighbors, so you can't steal anyone else's money. I could copy the tutorial and wage war on Africa but that's pretty stupid and historically inaccurate for multiple reasons... That's it! That's the game. \r\n\r\nI'm sure if I dedicated another 300 hours of gameplay and 50 2-hour, ad-infested YouTube tutorials, I might eventually understand the game's mechanics, but the learning process is so completely devoid of entertainment value that I never expect the game to become genuinely enjoyable to play. Absolutely nothing about any of the gameplay that I was able to interact with was exciting enough to motivate me to continue learning. Pop-up announcement, pop-up interaction, baby name, pop up announcement, defend your broke nation, throw a party, stare at the screen as months go by. Truly the gameplay of all time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "spent so much time trying to figure out wtf to do, all i managed to learn was how to insult and give gifts to others didnt really learn none of the strategy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it'd be a great game if it actually fucking launched for once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely not fun, anything i tried to pick was locked behind a dlc, but it could be expected from a free game. I do not recommend, at this point even roblox seems good enough",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its really restrictive on what you can do both in battles and economic etc affairs.Also,wtf were these mechanics,i had my sons raise troops against me and a pretender that amassed triple my army in Byzantium,like that ever happened however crazy the ruler was historically,it was easier to assasinate than to create armies out of thin air(as i already had recruited all levies from my realm)...I did a last stand against some of them in Constantinople but they had 2000 more troops and they won the battle!!!! i guess the Theodosian walls didnt exist for the devs or logic at all for such matters...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gay game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck paradox",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "suuuper BORING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun, but the obnoxious advertising of the six million DLCs and the scummy subscription service make it kinda hard to play",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "text too dang small. got so angry just trying to read the words on the screen. a nightmare of inaccessibility, and the menus are also the size of a pea so i couldn't even find any options to make it easier to read.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I think that my negative review is because the game itself is very new-player-aggressive with too many things that can be done that affect the game, so, new-player-unfriendly. Good luck if you are deep into searching your way in... ( At least this was in my case ).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Folks, DO NOT even play games like this, please, spare yourself........ Save yourself from oblivion...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Each time you start the game, you are greeted with literal spam.\nI have used my own mod to remove this spam but uploading it to the steam workshop isn't allowed.\n\nI do not recommend supporting this professional scamming company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Had fun with the immersive sim elements, but the economic practices of Paradox are insane. You essentially are just buying the engine when you buy the \"game.\" If you want to enjoy yourself you have to shill out hundreds for the actual mechanics of the game through buying seemingly endless amounts of DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is maybe a good game, but unfortunatelly, is unplayable to me - the HUD and the texts are incredible small, and altough there is a UI scale option, it literally zooms in the very low res HUD and texts, which makes it larger, but blurry and just as unreadable, as without scaling (on a 24\" monitor at 1080p)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the tutorials were confusing i was lost the whole time i played. might be a me issue though, i dont know. its a lot of reading.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F**k this mfing game , how the f**k can f**king Hungary send troops to f**king Yemen wtf? Don't play this game if you want to play as any other religion other than Christianity, I mean wtf f**k this game f**k Paradox\n\n(For context- I lost my IDK how f**king long Seljuk run cuz idk, Hungary sent 10k troops to Yemen somehow)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "paradox is garbage now. if its been updated in the last 6 years. its probably broken in some way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought the game, then it's free and you got nothing from paying it, not DLC, nothing.\nAnd then you have advertisement for DLCs and a subscription even if you paid for the game. \n\nWorse that EA ???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No comment on the game, except it is a PARADOX game.\n\nParadox Interactive is a games publisher that has lost it's soul. Selling us beautifully promoted ideas which turn out to be illusions. With the same ethical standards as an Indian money scam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A textbook of a game, but 50% more boring than literal textbooks because you can't actually do anything for political or financial reasons. \r\n\r\nThis is not a marketable product, which must be why its free to play. I guess I am stupid for assuming Paradox is different from EA in that they actually offer something of value without bugs to play for free. The tutorial bugged out so I could not complete it. I tried to play a little on my own, even researching to determine which regions and eras would be the most \"beginner friendly.\" I had *great* fun staring at a small collection of city states for another four hours, unable to do anything of significance besides breed and spend money without earning any back. The game did not explain income in the portion of the tutorial I was able to play. After googling it, even stalwarts of the game who answer questions are generally unhelpful. After deciphering a lot of jargon, I understood their opinion was that I should earn money by building up my cities to raise tax income. That costs 287 gold at minimum. What are the poor kings of Ireland supposed to do with their 150 gold coffers? Nothing, apparently. You cannot wage war without the Pope's permission and he doesn't want you to wage war on your neighbors, so you can't steal anyone else's money. I could copy the tutorial and wage war on Africa but that's pretty stupid and historically inaccurate for multiple reasons... That's it! That's the game. \r\n\r\nI'm sure if I dedicated another 300 hours of gameplay and 50 2-hour, ad-infested YouTube tutorials, I might eventually understand the game's mechanics, but the learning process is so completely devoid of entertainment value that I never expect the game to become genuinely enjoyable to play. Absolutely nothing about any of the gameplay that I was able to interact with was exciting enough to motivate me to continue learning. Pop-up announcement, pop-up interaction, baby name, pop up announcement, defend your broke nation, throw a party, stare at the screen as months go by. Truly the gameplay of all time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would love to love this game. Sounds and looks great. I have tried over and over to give it a shot.\n\nThat said, every time I try to open it up, the game starts, I click \"play\", and it fails. Sends Microsoft a report (like even they really ever expect themselves to do anything about it.. I wait a few months and try again, Wash, rinse, repeat.\n\n\n No wonder it's free. Cannot recommend in any seriousness. Unfortunate - how am I to trust CK3, now? (rhetorical question. I wont.)\n\nIf anyone knows a fix, I would love to try this out - and hopefully update my review to reflect the timeless classic it is rumored to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spent so much time trying to figure out wtf to do, all i managed to learn was how to insult and give gifts to others didnt really learn none of the strategy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having children to leave your inheritance is very fun, but it's so complicated. It took an hour to realize my time was paused and 4 hours to learn how to move an army. Now I accidentally left the Crusade and my peasants are revolting while I have NEGATIVE 400 gold....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it'd be a great game if it actually fucking launched for once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely not fun, anything i tried to pick was locked behind a dlc, but it could be expected from a free game. I do not recommend, at this point even roblox seems good enough",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its really restrictive on what you can do both in battles and economic etc affairs.Also,wtf were these mechanics,i had my sons raise troops against me and a pretender that amassed triple my army in Byzantium,like that ever happened however crazy the ruler was historically,it was easier to assasinate than to create armies out of thin air(as i already had recruited all levies from my realm)...I did a last stand against some of them in Constantinople but they had 2000 more troops and they won the battle!!!! i guess the Theodosian walls didnt exist for the devs or logic at all for such matters...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gay game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck paradox",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "suuuper BORING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun, but the obnoxious advertising of the six million DLCs and the scummy subscription service make it kinda hard to play",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "text too dang small. got so angry just trying to read the words on the screen. a nightmare of inaccessibility, and the menus are also the size of a pea so i couldn't even find any options to make it easier to read.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I think that my negative review is because the game itself is very new-player-aggressive with too many things that can be done that affect the game, so, new-player-unfriendly. Good luck if you are deep into searching your way in... ( At least this was in my case ).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Folks, DO NOT even play games like this, please, spare yourself........ Save yourself from oblivion...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Each time you start the game, you are greeted with literal spam.\nI have used my own mod to remove this spam but uploading it to the steam workshop isn't allowed.\n\nI do not recommend supporting this professional scamming company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Had fun with the immersive sim elements, but the economic practices of Paradox are insane. You essentially are just buying the engine when you buy the \"game.\" If you want to enjoy yourself you have to shill out hundreds for the actual mechanics of the game through buying seemingly endless amounts of DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is maybe a good game, but unfortunatelly, is unplayable to me - the HUD and the texts are incredible small, and altough there is a UI scale option, it literally zooms in the very low res HUD and texts, which makes it larger, but blurry and just as unreadable, as without scaling (on a 24\" monitor at 1080p)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the tutorials were confusing i was lost the whole time i played. might be a me issue though, i dont know. its a lot of reading.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F**k this mfing game , how the f**k can f**king Hungary send troops to f**king Yemen wtf? Don't play this game if you want to play as any other religion other than Christianity, I mean wtf f**k this game f**k Paradox\n\n(For context- I lost my IDK how f**king long Seljuk run cuz idk, Hungary sent 10k troops to Yemen somehow)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "paradox is garbage now. if its been updated in the last 6 years. its probably broken in some way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought the game, then it's free and you got nothing from paying it, not DLC, nothing.\nAnd then you have advertisement for DLCs and a subscription even if you paid for the game. \n\nWorse that EA ???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No comment on the game, except it is a PARADOX game.\n\nParadox Interactive is a games publisher that has lost it's soul. Selling us beautifully promoted ideas which turn out to be illusions. With the same ethical standards as an Indian money scam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A textbook of a game, but 50% more boring than literal textbooks because you can't actually do anything for political or financial reasons. \r\n\r\nThis is not a marketable product, which must be why its free to play. I guess I am stupid for assuming Paradox is different from EA in that they actually offer something of value without bugs to play for free. The tutorial bugged out so I could not complete it. I tried to play a little on my own, even researching to determine which regions and eras would be the most \"beginner friendly.\" I had *great* fun staring at a small collection of city states for another four hours, unable to do anything of significance besides breed and spend money without earning any back. The game did not explain income in the portion of the tutorial I was able to play. After googling it, even stalwarts of the game who answer questions are generally unhelpful. After deciphering a lot of jargon, I understood their opinion was that I should earn money by building up my cities to raise tax income. That costs 287 gold at minimum. What are the poor kings of Ireland supposed to do with their 150 gold coffers? Nothing, apparently. You cannot wage war without the Pope's permission and he doesn't want you to wage war on your neighbors, so you can't steal anyone else's money. I could copy the tutorial and wage war on Africa but that's pretty stupid and historically inaccurate for multiple reasons... That's it! That's the game. \r\n\r\nI'm sure if I dedicated another 300 hours of gameplay and 50 2-hour, ad-infested YouTube tutorials, I might eventually understand the game's mechanics, but the learning process is so completely devoid of entertainment value that I never expect the game to become genuinely enjoyable to play. Absolutely nothing about any of the gameplay that I was able to interact with was exciting enough to motivate me to continue learning. Pop-up announcement, pop-up interaction, baby name, pop up announcement, defend your broke nation, throw a party, stare at the screen as months go by. Truly the gameplay of all time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would love to love this game. Sounds and looks great. I have tried over and over to give it a shot.\n\nThat said, every time I try to open it up, the game starts, I click \"play\", and it fails. Sends Microsoft a report (like even they really ever expect themselves to do anything about it.. I wait a few months and try again, Wash, rinse, repeat.\n\n\n No wonder it's free. Cannot recommend in any seriousness. Unfortunate - how am I to trust CK3, now? (rhetorical question. I wont.)\n\nIf anyone knows a fix, I would love to try this out - and hopefully update my review to reflect the timeless classic it is rumored to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spent so much time trying to figure out wtf to do, all i managed to learn was how to insult and give gifts to others didnt really learn none of the strategy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having children to leave your inheritance is very fun, but it's so complicated. It took an hour to realize my time was paused and 4 hours to learn how to move an army. Now I accidentally left the Crusade and my peasants are revolting while I have NEGATIVE 400 gold....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it'd be a great game if it actually fucking launched for once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely not fun, anything i tried to pick was locked behind a dlc, but it could be expected from a free game. I do not recommend, at this point even roblox seems good enough",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its really restrictive on what you can do both in battles and economic etc affairs.Also,wtf were these mechanics,i had my sons raise troops against me and a pretender that amassed triple my army in Byzantium,like that ever happened however crazy the ruler was historically,it was easier to assasinate than to create armies out of thin air(as i already had recruited all levies from my realm)...I did a last stand against some of them in Constantinople but they had 2000 more troops and they won the battle!!!! i guess the Theodosian walls didnt exist for the devs or logic at all for such matters...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "gay game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck paradox",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "suuuper BORING",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun, but the obnoxious advertising of the six million DLCs and the scummy subscription service make it kinda hard to play",
      "voted_up": false,
      "votes_helpful": 39
    },
    {
      "review": "text too dang small. got so angry just trying to read the words on the screen. a nightmare of inaccessibility, and the menus are also the size of a pea so i couldn't even find any options to make it easier to read.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I think that my negative review is because the game itself is very new-player-aggressive with too many things that can be done that affect the game, so, new-player-unfriendly. Good luck if you are deep into searching your way in... ( At least this was in my case ).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Folks, DO NOT even play games like this, please, spare yourself........ Save yourself from oblivion...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Each time you start the game, you are greeted with literal spam.\nI have used my own mod to remove this spam but uploading it to the steam workshop isn't allowed.\n\nI do not recommend supporting this professional scamming company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Had fun with the immersive sim elements, but the economic practices of Paradox are insane. You essentially are just buying the engine when you buy the \"game.\" If you want to enjoy yourself you have to shill out hundreds for the actual mechanics of the game through buying seemingly endless amounts of DLC.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is maybe a good game, but unfortunatelly, is unplayable to me - the HUD and the texts are incredible small, and altough there is a UI scale option, it literally zooms in the very low res HUD and texts, which makes it larger, but blurry and just as unreadable, as without scaling (on a 24\" monitor at 1080p)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the tutorials were confusing i was lost the whole time i played. might be a me issue though, i dont know. its a lot of reading.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F**k this mfing game , how the f**k can f**king Hungary send troops to f**king Yemen wtf? Don't play this game if you want to play as any other religion other than Christianity, I mean wtf f**k this game f**k Paradox\n\n(For context- I lost my IDK how f**king long Seljuk run cuz idk, Hungary sent 10k troops to Yemen somehow)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "paradox is garbage now. if its been updated in the last 6 years. its probably broken in some way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought the game, then it's free and you got nothing from paying it, not DLC, nothing.\nAnd then you have advertisement for DLCs and a subscription even if you paid for the game. \n\nWorse that EA ???",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No comment on the game, except it is a PARADOX game.\n\nParadox Interactive is a games publisher that has lost it's soul. Selling us beautifully promoted ideas which turn out to be illusions. With the same ethical standards as an Indian money scam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A textbook of a game, but 50% more boring than literal textbooks because you can't actually do anything for political or financial reasons. \r\n\r\nThis is not a marketable product, which must be why its free to play. I guess I am stupid for assuming Paradox is different from EA in that they actually offer something of value without bugs to play for free. The tutorial bugged out so I could not complete it. I tried to play a little on my own, even researching to determine which regions and eras would be the most \"beginner friendly.\" I had *great* fun staring at a small collection of city states for another four hours, unable to do anything of significance besides breed and spend money without earning any back. The game did not explain income in the portion of the tutorial I was able to play. After googling it, even stalwarts of the game who answer questions are generally unhelpful. After deciphering a lot of jargon, I understood their opinion was that I should earn money by building up my cities to raise tax income. That costs 287 gold at minimum. What are the poor kings of Ireland supposed to do with their 150 gold coffers? Nothing, apparently. You cannot wage war without the Pope's permission and he doesn't want you to wage war on your neighbors, so you can't steal anyone else's money. I could copy the tutorial and wage war on Africa but that's pretty stupid and historically inaccurate for multiple reasons... That's it! That's the game. \r\n\r\nI'm sure if I dedicated another 300 hours of gameplay and 50 2-hour, ad-infested YouTube tutorials, I might eventually understand the game's mechanics, but the learning process is so completely devoid of entertainment value that I never expect the game to become genuinely enjoyable to play. Absolutely nothing about any of the gameplay that I was able to interact with was exciting enough to motivate me to continue learning. Pop-up announcement, pop-up interaction, baby name, pop up announcement, defend your broke nation, throw a party, stare at the screen as months go by. Truly the gameplay of all time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would love to love this game. Sounds and looks great. I have tried over and over to give it a shot.\n\nThat said, every time I try to open it up, the game starts, I click \"play\", and it fails. Sends Microsoft a report (like even they really ever expect themselves to do anything about it.. I wait a few months and try again, Wash, rinse, repeat.\n\n\n No wonder it's free. Cannot recommend in any seriousness. Unfortunate - how am I to trust CK3, now? (rhetorical question. I wont.)\n\nIf anyone knows a fix, I would love to try this out - and hopefully update my review to reflect the timeless classic it is rumored to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "spent so much time trying to figure out wtf to do, all i managed to learn was how to insult and give gifts to others didnt really learn none of the strategy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste Copy paste",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having children to leave your inheritance is very fun, but it's so complicated. It took an hour to realize my time was paused and 4 hours to learn how to move an army. Now I accidentally left the Crusade and my peasants are revolting while I have NEGATIVE 400 gold....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it'd be a great game if it actually fucking launched for once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely not fun, anything i tried to pick was locked behind a dlc, but it could be expected from a free game. I do not recommend, at this point even roblox seems good enough",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its really restrictive on what you can do both in battles and economic etc affairs.Also,wtf were these mechanics,i had my sons raise troops against me and a pretender that amassed triple my army in Byzantium,like that ever happened however crazy the ruler was historically,it was easier to assasinate than to create armies out of thin air(as i already had recruited all levies from my realm)...I did a last stand against some of them in Constantinople but they had 2000 more troops and they won the battle!!!! i guess the Theodosian walls didnt exist for the devs or logic at all for such matters...",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}