{
  "positive": [
    {
      "review": "Resident Evil 4 is really really good and probably the best resident evil game out there right now at least in gameplay. \n\nCapcom basically took everything that worked so well in Resident Evil 2 & 7, dialed up the action and gameplay by 10 while still managing to keep the iconic horror this franchise is known for. They have successfully struck the perfect balance between action packed power fantasy gameplay, and  iconic resident evil horror. This is something most studios can't achieve, yet Capcom not only did it, but also perfected it in this game.\n\nThe cut scenes, the environments, the art direction, the carefully designed details on every surface, it's all done with such surgical perfection and it's only further enhanced by the buttery smooth optimisation of this game. No stutters, No frame rate drops, not even a single bug to encountered in my entire 30 hour playthrough. Every section, level, terrain, item and location not only looks gorgeous, but plays perfectly and just like how it's supposed to. I cannot commend the people behind this engine and games enough. Truly talented tech geniuses and its their innovation that set the ground work for what has made this franchise ascend into god tier quality.\n\nWhat makes this game stand out so much though is the gameplay. Third-person Blood-curdling action packed linear levels with satisfying gun play that is only further enhanced by Capcom's insane sound design. Every foot step, every gun shot, even something as small as the sound of pages turning is so detailed. When you shoot someone in the head, you feel the impact of the bullet from the sound of skin tearing and blood splatter. When you round house kick, you feel the heavy impact of leon's foot on the enemies neck from the sound of it snapping and cracking. It really brings this game to life. It is truly a technical marvel and i swear no one in this industry does sound as good as capcom does.\n\nIts all further enhanced by the variety of weapons & upgrades in this game. There's enough here to keep a healthy level of flexibility in how you want to play. The progression system in how you upgrade your weapons is also incorporated into exploration, making it always feel rewarding and worth while. The enemies follow suit in quality, ranging from your classic terrifying big monster with dodge mechanics to a slippery assassin scorpion that intelligently uses the environment to sneak up and attack you. Many also have little twists and details that really enrich the way you can approach enemies. Villagers that hold C4's in their hand that you can shoot to blow them and their surroundings up. Infected with regenerative abilities that you need to shoot specific weak spots to kill. It's this rich variety in how you interact with the game that makes the moment to moment experience always feel new. It is what makes this franchise so iconically endlessly replayable.\n\nThe story is about what you'd expect from a capcom resident evil game. Nothing insane in narrative, but just enough lore dressing and interesting connections to umbrella to keep fans like me interested in the characters of this game and the world their in. What surprised me the most though is how hilarious the writing is. Leons dialogue in particular. It's bordering Devil may cry 5 levels of ironic but still being grounded enough to feel serious. I think the execution is the real MVP here as it's done well enough to make Leon's silly 2010 esq comments come off as charming and lovable rather than cringe and annoying. The writing really is a product of its time and i'm so happy Capcom did not touch it in this remake because i really love it.\n\nGenerally speaking, this extreme of a departure in any franchise, let alone one with horror as iconic as Resident Evil's, usually turns out to be a disappointment. But Capcom really stuck the landing here. They managed to create a satisfying action focused game whilst still having it feel like resident evil. They did it so well, infact, i might prefer this style over RE 2&7's more slow placed horror, as long as it's done well. \n\nAnd this game certainly does it extremely well. Which is why I highly recommend it.\n\n8.5/10",
      "voted_up": true,
      "votes_helpful": 39
    },
    {
      "review": "Leon Sex Kennedy saves Ashley Barely Legal from ugly terrorists, peak game play.",
      "voted_up": true,
      "votes_helpful": 53
    },
    {
      "review": "Resident Evil 4 Remake is pure perfection. Everything from the stunning visuals to the intense gameplay feels masterfully crafted. It captures the spirit of the original while making it even better in every possible way. This isn’t just a remake; it’s the ultimate Resident Evil experience and easily the best game in the entire series.",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "After playing several Resident Evil games, I can honestly say this one truly deserves its reputation as the best in the series. What makes Resident Evil 4 stand out for me is how different it feels compared to something like Resident Evil 2. The story here is more straightforward — you don’t need to constantly backtrack through old areas, which keeps the pacing exciting and smooth.\n\nThe bosses are absolutely amazing to fight, each appearing naturally as you progress, and every encounter feels satisfying. There’s a ton of action, and the combat system is easily the most enjoyable in the series — fluid, intense, and rewarding.\n\nI also loved that the puzzles are fewer, simpler, and can be solved right where you find them — no need to run around the map just to complete one. The characters are great, and the DLC featuring Ada adds a really nice touch to her character and the overall story.\n\nThe upgrade system and the shop are fantastic additions too — they make you feel stronger and really help you enjoy the gameplay even more.\n\nAll in all, Resident Evil 4 is a 10/10 action-horror experience with epic boss fights and an amazing flow from start to finish. I highly recommend it to any fan of the series or anyone who loves a great mix of tension, action, and fun.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I am here from the original Resident Evil 4 crowd, which I played on the Gamecube religiously - so I cannot say how it will be for new players that never played it. But I think it should be good.\n\nFirst off I want to say this is exactly how remake should be done. The graphics are excellent, the use of contrast, lighting and shadows provides a constant moody, cinematic feel throughout as does the close-following over-the-shoulder camera. It looks fantastic. But it isn't a remaster like so many developers are cashing in on (because like fuck working for money), it is a full on re-imagining of the game. It's not just quality of life improvements like better controls and character physics, the game has been completely redesigned by today's standards. \n\nThe action is fast paced and requires a lot of finesse. The game encourages you to be constantly moving and very aggressive (like Doom), if you stand in one spot too long or go for defence, you will be taking a one way train to fuck-town. If your hands sweat easily, like mine, then bring some tissues.\n\nThe controls feel great. I used keyboard and mouse - I increased camera sensitivity for looking (but not for aiming) so that I can turn the camera quickly without lifting the mouse. I can see what they did with the default control scheme: Q for Quickturn, E for Evade, M for Map, P for Pause - but those latter to are completely unergonomic - M and P are not reachable - remap those to something else. It also uses CTRL for commanding Ashley, again this is really awkward, especially when you use the same key for catching ammo from Luis - but I found remapping to C was perfect for this and doesn't interfere with other defaults. \n\nThe attache case now has auto sorting which really makes it much simpler, but keeps the joy that you can't become overpowered, you gotta pack the right gear and can't get greedy with ammo and healing items. There is a wide assortment of gear keeping the game interesting and encouraging multiple playthroughs as the items are designed to be unique, truly offering a different style of play (unlike the games that give you too many options, but they are all minor stat differences: AABA, ABAA, BAAA etc). There are challenges to complete and new items to unlock. Then there are some new additions such as charms which also tweak certain variables a little, like getting more ammo of a certain type from crafting, selling certain items for more - these are totally optional and add a nice flavour from the old shooting range (which too has been overhauled and improved). \n\nMy main criticism is that enemies do seem to be able to spawn on you or in areas you have just been and were empty. This is discussed - but I am not being paranoid, I had this happen in the Village house when you're with Luis at points where no entry was possible - enemies skipping the ladder and just appearing in a corner choking you. I know they are trying to keep the aggro and intensity up, but I don't like cheap shots. I don't mind enemies spawning in from outside of your accessible environment then walking in and I prefer to have the chance to react first than just getting jumped and choked. \n\nBut overall, the goods far outweigh the negatives in this title, and I am glad I was able to play it. This should have set a standard for how to remake a beloved classic - Looking at you Metal Gear Solid 3, still the same 20 year old game with new graphics. Well I just won't buy those, only excellence drives my purchases, and this is it.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "[h2] \"You'll get some bang for your buck, I guarantee it.\"[/h2]\r\n\r\nCapcom pulls out the biggest d*ck in their inventory, remakes and retunes it for this generation and it's easily one of the best survival horror games you can play today. Regardless whether you were a fan of the original or not, there's something here for everyone to scratch their itch when it comes to both horror and action. \r\n\r\n- RE Engine makes everything look creepier and more immersive than ever before, sick lighting\r\n- Some gameplay kinks have been worked out and other quality-of-life tweaks have been added, movement & gunplay is streamlined to fit today's standards and it just feels right\r\n- New flashy cinematics + rerecorded voice lines along with some new ones, they toned down the cheese and made it a bit more mature, Leon still serves up those priceless one-liners though\r\n\r\nGreat job by Capcom once again, and that price tag makes it even more worth it to enjoy the series' most accessible entry in a new way.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Absolute masterpiece. The visuals, story, setting, and a good balance of game mechanics combine to make one of the best games I've played and among the best in the RE series. It's between this and 2 for me. \n\nDon't forget to play Separate Ways, it's a must for the full experience!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It is for few games that I have seen it surpass the original, and with this one it did many times over!! Fabulous game . a must for any RE fans\n\nI enjoyed Separate Ways, a little more that the base story of Leon as it was more advanced on the difficulty front but overall both the base + dlc is a solid must have",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "the og resident evil 4 was my first and is also my favorite resident evil game. I love that they did a remake which im enjoying very much. absolute gaming",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Resident Evil 4 Remake makes an already amazing game into an even better one\nThis is just perfection\n10000000/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome remake. Story was great, visuals fantastic, and combat feels amazing. Get this game on steam sale if you can, 100% worth it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lineer akıcı gayet başırılı bir oyun başta tırstırsa da ilerledikçe aksiyona dönüyor.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Man, Resident Evil 4 Remake ain’t just a game it’s a full-course meal with extra seasoning. Capcom really said, “Let’s take the GOAT and make it even goat-er.” The graphics? Clean. The gameplay? Smooth like butter. Leon out here kicking doors, roundhouse-ing cultists, and lookin’ like he walked straight outta a GQ shoot.\n\nThe vibes are crazy spooky, intense, and funny in that old-school RE way. Every encounter got me sweatin’ but smilin’, and the sound design? Bro, you feel every shot. Even the merchant’s back, and he still talkin’ like he your sketchy homie with the best deals in town.\n\nIf you played the original, this remake gon’ hit that nostalgia vein hard. If you new to RE4, welcome to greatness.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After finishing the game, I wanted to play it modded but I could not find any other mods on the sites other than the naked Ada Wong mods",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game but the writing is more serious which killed the charm of the original game . \r\nIf you're zoomer play the original first then play the remake.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Halfway through the game so far, just made it to the castle, It took a bit for me to start loving the game as much as the original but once I beat the first major boss it clicked. Wow. This is one of the best remakes I've ever played. Incredibly faithful to the original while still feeling like a completely new and different game. You can tell how much love was poured into this 10/10 remake especially with all of the cool new bonus content. One of the best parts about this game is how well optimized it is (along with the price). Reccomended gtx 1070ti for a game that looks this good from 2023 is actually fucking bonkers. I remember being scared for this release as the original is one of my favorites of all time but I am blown away by this, so so so incredibly excited for the final portions of this game :) Everyone who likes horror (or wants to try a horror game out) should play this before they die. Thank you to everyone who worked on this game <333",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of those singleplayer games that deserves multiple playthroughs once you beat it for the first time because it's just that great.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lives up to the legacy of the original game. Also Ashley not being annoying in this game is a huge plus the Ada DLC is ok a little to short for me but in all a 10/10 game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is, without a doubt, the best Resident Evil ever made, My second playthrough was fantastic and didn't feel boring at all, so the replayability of the game is awesome. The locations and monsters are quite diverse and the game does not feel repetetive at all. If possible, buy the Gold edition so you can play as my wife in goated DLC. ;)\n\nWorth every penny.\n\n10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "First time experiencing this classic, the campiness was a little off-putting at first when compared to the (somewhat) more horror centered and serious RE2. This game had me jump a couple of times while RE2 had me actively shitting my pants, still very much enjoyed the game though! You can definitely see the direction where the franchise was starting to go from this game already but still a banger",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Never played the original Resident Evil 4, but this remake completely blew me away. The graphics are absolutely gorgeous, the atmosphere is perfectly creepy, and every location feels alive (and ready to kill you). The gunplay is insanely good  every weapon feels powerful and satisfying. I actually caught myself wasting ammo just because it felt so good to shoot things lmao.\nIt even gave me The Last of Us vibes at times with how overall gunplay feels. It's very satisfying\nHonestly, I went in expecting a fun horror game and ended up playing one of the best action games I’ve ever touched. Un Forastero!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic remake of the original game. Not a 1:1 recreation, so it doesn't outright replace the original game, but all the new mechanics and redesigned rooms and fights flow together incredibly well. I really enjoyed the improved Ashley section, all the new enemies as well as the added side quests. Parrying took some getting used to but it's smooth and feels good to perform. Regenerators still make me shit my pants. Insanely replayable both because of how fun the game is to just sit down and play and because it has a lot of fun extra content, such as different challenge runs you can do that unlock different rewards or the expanded upon Mercenaries mode. Can be quite challenging on higher difficulties. As for the negatives despite loving it's DLC, Seperate Ways as well, I'm not huge on how certain parts of the game were cut in order to be resold as DLC and selling all the weapon upgrade tickets feels kinda scummy. Anyway, still a great game that's worth the money, especially since it goes on sale pretty regularly at this point. But even at full price there's a lot to love about this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love everything about this game. It's a masterpiece. The graphics are beautiful, the gameplay is impressive, and Ashley is hot. One of the best games I've ever played, and I've been playing for almost 30 years.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing story, and combat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fantasic remake of the series. the original re4 was my favorite of the series owned that on several systems. capcom really out did themselves with this remake highly recommend this game. and even try the og game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MY FAVORITE STEAM DECK GAME \n\n\nAs a series resident evil games have usually been constantly good(with some roughies). But man is this one of my favorites. I love the gunplay. Every bullet feels so powerful yet so weak. And there’s so many details to it. And the shootings is really satisfying. The story is great also. I won’t spoil it but it’s a great concept to make a game on. \n\nOne more thing tho\n\nI’m sorry to say it.. this game has hotter women than the women from village \n\n\nAda Wong > lady Dimitrescu \n\nIM SORRY SHES SO BAD BRO \n\nanyways game rating: 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game i have played this year!!! I didnt play the original but the game brought me back to the old ps2/ps3 days. reminds me of uncharted. that game was iconic for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As someone relatively new to the franchise, this was a lot of fun. I have played the Resident Evil 2 Remake, but I would have to say I prefer this one. I like the atmosphere of Re2 remake a little better, but the health and crafting system in this game are much better in my opinion. This was a pretty long game. I am somewhat of a completionist, but I had to make sacrifices on my first playthrough; which I think is a good thing. The main campaign took me about 16 hours in total. I got a lot of the treasures and upgraded quite a few guns. I enjoyed how there were a lot of different gun choices. You have to weigh your options between variety or upgrading a couple of guns and sticking with them, I chose the latter. I think the replay value is high here if you like to grind out games to completion on multiple runs. I more so enjoying doing it all on one run, which is plain and simple impossible in this game. However, that is not a negative, more just personal preference for the player. Overall, great game. I highly recommend it for newcomers to the series and I am sure hardcore fans would enjoy it as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5090 suprim soc with a ryzen 7 9800x3d \r\naorus x870e elite \r\nQD-OLED 4k \r\nthis game looks amazing runs great. \r\nthe OLED really brings this game to life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After spending 109 hours with Resident Evil 4 Remake, I can confidently say it's one of the most enjoyable survival-horror experiences out there. The game stays true to the spirit of the original while modernizing everything from visuals and atmosphere to level design.\r\n\r\nCombat is tense and satisfying, resource management keeps you on edge, and Leon’s progression feels rewarding throughout the journey. The story is polished, the pacing is tight, and the characters are written in a way that makes you connect with them all over again even if you loved the classic version.\r\n\r\nIn short: a polished, thrilling, and unforgettable experience.\r\nHighly recommended for fans of the series or anyone looking for a top tier action horror game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the best third person shooter/horror game you're gonna find nowadays. I haven't played the original RE4 so I honestly can't tell you whether it's a good remaster. What I can say is that it's replayable, has fun additional content and an intriguing story, not to mention a hottie who follows you around. Overall, a solid 9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good graphic and very optimize game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "they did a great job on the remake. but the og story line is still better. they also removed the dipman glitch and they need to put it back.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it's a fun and experience and a good retelling of a classic game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever made. The original re4 was my favorite game ever from 2005 up until this remake released. Everything was improved even further beyond the pedestal of perfection the original once stood on. Ive 100% this game on ps5, xbox, and now steam. No matter what other games i play, i always come back to this one at some point. Without any hesitation i would 100% it again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time playing Resident Evil. Bought the Remake Trilogy (RE2, 3 & 4 Remake) earlier this months (November 2025) and played it in order RE2 then RE3 then RE4. It does feel longer than RE2&3 but I have the most fun with this one. It have more combat and less puzzle compare to the other two. If someone want to experience the best of RE, maybe find RE2&3 a bit boring or maybe first time into RE series and dont care about the order, this is it. But I do recommend doing the RE2 first, as the character and context is related.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Get the mod to fix Ada's monotone voice actress, and then game's almost perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helluva great game! Not only is it still true to the spirit of the original, but even improved upon it in a lot of ways, which is a feat in and of itself. I was a bit skeptical at first, but this remake totally exceeded my expectations. Ada's Separate Ways DLC is a huge upgrade over the original, and I enjoy playing her segment as much as the main game, if not more so. I highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely a blast for those who want to play a product on multiple occasions, even after completing their first walkthrough. I for one had it when I owned a PS5, but now am playing it on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Em quesito ação, é o melhor resident evil de todos. Não é terror, é ação.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4 hours in game/at chapter 4th and I already feel like it's a true spiritual remake of RE4(2004), a game I adored and loved.\n\nBut I still prefer the dialog writing tone in the original that still sticks and also a screenplay that delivered way more cooler moment. I can see a lot of effort that RE4R trying to replicate that but fail to do so, though the game-play change and visual upgrade make up for it.\n\nI still haven't hear Ada's voice but I'm not hoping for much. Modding community gonna fix that for me anyway.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dont hesitate to buy this game its really worth the price it is one of the best re remakes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love corny lines of sir Leon S kennedy \n\"September 30th, 1998. It's a day I'll never forget. The cop inside me died that day. And that night, Raccoon City was wiped out, thanks to the bioweapons created by Umbrella. Somehow, I made it out. But too many others...weren't so lucky. I was \"asked\" later to join a top-secret government program. Not that I had a choice. The training, the punishing missions...nearly killed me, but at least they kept my mind off everything. If I could just forget what happened that night - the pain, even for a second? This time, it can be different. It has to.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like what they did for this RE4 Remake its fun. I liked re1 up to until re code veronica are my favorite re games. Buy this game you won't be disappointed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the story line and this is helping me learn how people make games , maps and this really was the best game i ever play in a long time i just love i hope to see even more games like this it just peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, if you don't have it you are missing out. This is a masterpiece. At the very least it's as good as the original. Beautiful epic, sweeping game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just finished it! Runs well, looks amazing and the combat is fun. Character models are really well made with this faithful reimagination to the originals. Not 10/10, but it's really good. Scores doesn't matter. Play it if you'd like to have a good story and play a fun action-survival game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already compelted the game on PS5, bought the game on PC to kill those MFs with mouse aim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game even tho it's not as scary as the other re games. Definitely going to replay multiple times :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 4 — Survival Horror Perfected\n\nResident Evil 4 isn’t just a horror game; it’s a masterclass in tense action, strategic combat, and atmospheric storytelling. From eerie villages to sinister castles, every environment is packed with threats, secrets, and nail-biting encounters that keep players on edge.\n\nCombat is precise, tactical, and endlessly satisfying. Each weapon, from pistols to shotguns, changes how you approach every enemy encounter. Timing, positioning, and resource management turn every firefight into a thrilling test of skill. Boss fights are memorable and intense, demanding strategy, quick reflexes, and adaptability to survive.\n\nExploration and progression are equally rewarding. Hidden items, secret paths, and puzzle-filled areas encourage curiosity and careful observation. Unlocking new weapons, upgrades, and abilities provides a tangible sense of growth and mastery as the story unfolds.\n\nThe narrative is gripping and immersive. Resident Evil 4 blends horror, action, and dark humor, delivering memorable characters and tense moments that elevate the experience beyond a typical shooter.\n\nVisually, the game impresses. Detailed environments, eerie lighting, and realistic character models make every encounter, chase, and discovery feel cinematic. Coupled with a tense, atmospheric soundtrack, the game’s world is as haunting as it is engaging.\n\n[h3]Final Verdict:[/h3]\nResident Evil 4 is a landmark survival horror experience that combines precise combat, tense exploration, and unforgettable storytelling. Challenging, immersive, and endlessly replayable, it’s a must-play for fans of action and horror alike.\n\n“A perfect blend of horror, action, and cinematic tension that stands the test of time.”\n\nOverall Rating: ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐ 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing several Resident Evil games, I can honestly say this one truly deserves its reputation as the best in the series. What makes Resident Evil 4 stand out for me is how different it feels compared to something like Resident Evil 2. The story here is more straightforward — you don’t need to constantly backtrack through old areas, which keeps the pacing exciting and smooth.\n\nThe bosses are absolutely amazing to fight, each appearing naturally as you progress, and every encounter feels satisfying. There’s a ton of action, and the combat system is easily the most enjoyable in the series — fluid, intense, and rewarding.\n\nI also loved that the puzzles are fewer, simpler, and can be solved right where you find them — no need to run around the map just to complete one. The characters are great, and the DLC featuring Ada adds a really nice touch to her character and the overall story.\n\nThe upgrade system and the shop are fantastic additions too — they make you feel stronger and really help you enjoy the gameplay even more.\n\nAll in all, Resident Evil 4 is a 10/10 action-horror experience with epic boss fights and an amazing flow from start to finish. I highly recommend it to any fan of the series or anyone who loves a great mix of tension, action, and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is perfection. From the story and characters to the world design and gameplay, it’s hard to find anything to dislike.\n\nFrom a narrative perspective, the story is engaging and well-paced, supported by characters who feel well developed. Leon Kennedy is an iconic character, and playing as him is just really cool. Ashley is peak.\n\nThe environments and levels feel incredibly atmospheric, and the game uses modern graphics well to create highly immersive environments. Each area is detailed, visually amazing, and thematically consistent, while still offering enough variety to keep progression interesting.\n\nGameplay is where I feel the remake truly excels. Movement and gunplay feel smooth and just a lot of fun to pilot. Puzzles also actually feel like puzzles without being frustrating. The game’s design accommodates varying playstyles, whether you’re doing a casual run, completing every in-game challenge, or playing on harder difficulties where every mistake matters. For those who’ve played the RE2 Remake previously, it doesn’t follow that game’s blueprint, as you’re not constantly backtracking, which keeps the experience refreshing since you’re mostly encountering new areas. The game also offers a wide range of bosses (rather than 3 variants of the same boss), each unique from one another, which helps keep major encounters exciting.\n\nCompared to the original RE4, this remake improves on nearly everything that made the first game iconic. That said, it’s a remake, not a remaster, and therefore isn’t a 1:1 recreation of the original. The game makes slight tweaks to certain story beats and expands on chapters and levels from the original, all of which are well done, resulting in a narrative that feels fuller and gives you better mileage for your playtime. The remake also features darker atmospheres and stronger horror themes, making it feel more aligned with the rest of the Resident Evil series, though it does lose a bit of the original’s lighter, campier charm. Leon is more serious here, which works on its own, but I do miss some of his personality from the original.\n\nOverall, this is an amazing remake of an iconic original, and Capcom has delivered what I would consider the best example of how to modernize a game while still respecting what made it special.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started the game thinking Leon is on a serious mission to save the president’s daughter…\nShe turned out to be a lost kid in a shopping mall, running behind me and screaming “LEON HELP!!” every two minutes. Meanwhile, I’m the one who needs help.\nThe graphics are amazing, enemies are smarter than me, and half the time I feel like I’m the zombie.\nShort version: The game scares you, stresses you, and still makes you love it.\nEasy 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Great Remake of an Amazing game. It lost a bit of the cheese that made the original so fun, but it's really an impressive game. It truly broke ground back in 04 and revitalized the franchise. A solid game worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best resident evil games ever. The remake is so beautiful and pleasing. Even with Ashley getting in the way of literally everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having played the original as a kid on my GameCube I'm disapointed they removed all the cheesy lines from Leon's character, But I understand the direction they took with game and why. Besides that they did everything right, great music/ambiance, great voice acting, great visuals, great combat, and the list goes on. I can't say I have any complaints with this game besides my first statement. The game is pretty much a perfect remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is visually satisfying but jack krauser is a bitch",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great remake for a great game, nicely done Capcom, I wanted the DLC of Assignment Ada but I know thats not gonna happen...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I might get crucified for this review but here I go:\r\nThis is the best remake of all time (for me) and it surpassed the original in every way.\r\nNow, I don't hate the original or anything, it looks great but I can't play a game where the controls are made like that (having to stop and turn like you are cranking a wheel so I can shoot at someone), though I still played it 2 hours to try and make myself like that gameplay (I couldn't bear more).\r\nWhy I say this is the best remake and also the best Resident Evil I played:\r\n- Performance: The game runs great on 4k 120fps on high - highest settings, something that is pretty rare for any game.\r\n- Graphics: I could stay all day in that damn village, run in fear trough the castle because of the bugs and try not to get insta-killed by the turrets on the island, everywhere I go, it feels so real.\r\n- Characters: My beloved Leon with his one-liners, backflips and being the badass hero he is\r\nAshley was an improvement over the original, Ada, despite the people that said the voice actress didn't match, was great, Luis and Wesker were wonderful and made me return to play the game over and over.\r\n- Voice acting: Nick Apostolides did a fantastic job in both RE2 and RE4, so good that I thought RE4 was another guy making his voice, Ada's VA was perfect for this Ada, seemed more manipulative and straight-forward and it seems that was the intention since you now what kind of person she is compared to when you met her in RE2 (which was more sweet towards the end of the game).\r\nLuis and Ashley were great but I can't forget the one and only Albert \"7 minutes\" Wesker VA's performance, which made me wish there would be a RE5 Remake on the way, made as great as RE4 Remake.\r\n- Gameplay: After playing this, parrying became one of my favorite feature in a game, it's so satisfying to parry an attack then proceed to kick, suplex or obliterate the enemy because of the stun it gives.\r\nGun play is great, one of my favorites, shooting an enemy in the legs actually does something (drops the enemy to its knees) and also the gameplay additions (abilities) for Wesker, Hunk and Krauser in the Mercenaries mode are tying this up almost perfectly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well I gonna tell ya this game is worth for your expereince. The gameplay is simple until their adding parry and that was awesome for me. The story I think it's pretty good but some minor change from the OG title but still good. So over all this is satisfied and worth time to play. And you better buy it on sale cause right now in my region is kinda expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most best remakes I have had the pleasure of playing. Even though a few things have been cut, its still an amazing game nonetheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This masterpiece is the best Resident Evil game for ever. It's not the most scary like 7 or 2 but this is without a doubt the most fun and badass to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic game just better graphics and with more to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My first Resident Evil game, not huge into Horror but I got through it so you can to!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite RE, good re-play value, Ada's DLC is great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plays amazing on the steam deck love the puzzles and combat as well as the story now I’m gonna go play some bingo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Contender for the best (Action) Resident Evil of all time, for sure.\r\n\r\nGameplay was remixed, refined and redefined to a degree I never would've thought possible for the original RE4. The amount of depth, replayability and skill expression is off the charts for a singleplayer horror game.\r\n\r\nThe unique art style of the original is lost, but in its place is something much more familiar to fans of the newer RE games. The story attempts to recontextualize the characters and events as being ultra-serious, and mostly does a mediocre job at it. Pretty much any changes relating to the characters and story were disappointments, but they didn't ruin the experience.\r\n\r\nThe general combat leans more into the Survival-Horror aspects of the series. Staple elements of the original game's design such as staggering enemies with a single headshot are now based on RNG and your weapon of choice, enemies will often drop crafting resources, forcing you to craft the ammo you want instead of being forced to use what the game gives you. Ashley is no longer stuck standing still or glued to your back, instead behaving mostly independent of you, which creates a lot of frustration as she is relegated to being incapacitated in one hit, and killed in a second hit instead of having her own manageable health bar as in the original.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game, was so fun for me I played the Main History around 4 times plus Separate Ways. It has a great re-playability value. It let me remember the original many times and it was really entertaining to see the changes they made from the original, and there was more cohesion in some part of the original plot. The style and feeling was really good, some aspects were different from the original of course, but others remembered me to that version. I do recommend this version to players that have played the original and people who hasn't.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly if you're looking for a great story thats replayable and friendly for 100%'ers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just completed the game with all the models and achievements unlocked 100%. One of the most enjoyable video games I've played in a long while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Outstanding game. Amazing graphics and design.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my all time favourites. The time spent on my professional S+ run on my playstation led me through some of my most intense moments in gaming. A point of pride to unlock those cat ears. Gloria Las Plagas!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best remake of any game I have ever played. This is now one of my top 3 resident evil games to date. \r\n\r\nThe Gameplay is smooth and improves in every way from the 2004 resident evil 4 game. The Voice actor for the Leon did a great and the Animations and cutscene where great, I all ways watch them when ever I start a new game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! Played the original 2005 version and this exceeded my expectations. Would 100% recommend this game, and I plan on replaying once I'm done with the main story line to get all achievements.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cinema, lifechanging, honestly just really fun. Imma name my firstborn Ramon Salazar",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing remake of an all time great video game. If you've played the RE4 on PS2 or Gamecube, buy this game. If you like Resident Evil games, buy this game. If you like games in general, buy and play this game.\r\nOne of the easiest games to recommend to anyone ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay at its finest; every move, every strike, and every encounter feels fluid, intense, and incredibly satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a masterful remake of one of my favorite Resident Evil games.  Loving every second of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "เป็นภาคที่เกมเพลย์ดีที่สุดแล้ว ณ เวลานี้ เล่นซ้ำได้มันส์ๆแน่นอน\n\nการเล่นโหมด Standard จบแล้วกลับมาเล่นใหม่ในโหมดยากขึ้นเช่น Hardcore จะได้ปืน,ทรัพยากรทั้งหมดกลับมาด้วย อย่าลืมประหยัดเผื่อเอาไว้ใช้เล่นอีกรอบ",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They did this remake justice! true to the original with more added, better graphics, and better frame rate! the best game ive played in a while!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☑ You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☑ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☐ Easy to learn / Hard to master\n☑ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☑ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this on PC, now playing on psvr2 and starting NG+. I don't buy a game twice for no reason - Capcom is one of the most in tune AAA developers left. Since 7 it's been nothing but straight bangers. Buybuybuy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, its a good game to kill time, especially if discounted price. But I wish more attention had been given as with previous RE titles. Basically, it feels like devs got lazy and just made a re-hash of Tomb Raider 2013 with improved textures and better graphics. Every time I play, this game it feels so eerily similar to Tomb Raider 2013 in many respects:  gameplay, super annoying re-spawning enemies who throw weapons/explosives, super-cluttered environment. For some reason, in this chapter of RE, the design/personality of both main characters is insufferable. Ugh. (I wish they looked at Claire's design and resulting popularity before release)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Coming to this game for the first time in 2025 is a bit weird. Technically it is a bit outdated (and I do not mean graphics, just the overall gameplay, movement, combat etc.). It also isn't very horror-y, more like a whack-em 3rd person action shooter. Enemies are more or less the same throughout the game even though their skins develop. The puzzles are relatively easy and not very elaborate.\r\nI didn't hate it at all but I will probably not be coming back. \r\n\r\nA big plus, compared to RE2, is that playing for Leon vs Ada is really completely different experience and you're not feeling like you're replaying the same thing all over.\r\n\r\n6.9/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first played Resident Evil 4 when I was 11 or 12, and because of the dark atmosphere, I never got past the second level.\nNow, almost 15 years later, I wanted to give it another go, and damn, this game is good. The characters and atmosphere are really captivating, and you never notice that this game is actually over 20 years old. This also shows what a good remake this is.\n\nOverall, it's a timeless classic must-play for every horror fan, which also shows that gameplay mechanics for games have stagnated over the last 20 years.\n\nThe only point I might criticise is the fact that the craziness of the boss designs and the sense of supernatural abilities or movements in some of the cutscenes for the individual main characters make it clear that this is a Japanese game, and this sense of flawlessness means that some of the enemies can no longer be taken seriously.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just can said really is good game also. no need compare the old Re4, both is good.\r\nand all Re remake series is nice, i like all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic remake. Like the OGRE4 - this is far ahead of its time.  Beautiful as it is hideous.  Gunplay, especially in Mercenaries, is so John Wick (if you want it to be).   If you played the original RE4, you'll feel right at home with this, and then some.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game! I am playing all the resident evil games for the first time and four is definitely my favorite one. It looks amazing, the creatures are terrifying and the music in every area leaves you filled with suspense.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love leon's pecs and the plot line (leon's pecs). incredible game play and i've played it three times on my xbox so i can see leon's pecs in a full tv screen size",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glad i could play this classic, wonderful game with wonderful graphics! \r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 4 was my first in the series, I wasn't really sure what to expect as I don't usually play horror games so it was definitely an experience, I was a bit hesitant to try but I had a friend slightly convince me to get it. They ended up watching me play the entire game. \nWhile the game wasn't as scary as I thought it'd be It was definitely a lot more enjoyable with someone watching me play it lol.\n\nThe game was really enjoyable, the gameplay which was a bit frustrating and annoying at times but most of the time it felt fun and engaging. you never felt like you could thrive and you had just enough to barely get by. \n\nThe story itself was really good too, I loved how its basically one huge map with everything kinda connected to each other.  Leon is really such a lovable character, I love how he is corny and kinda silly sometimes but he also tries to do the right thing even if its not easy and he really cares for [spoiler] Ashley :) [/spoiler] they were really cute together. \n\nI did really enjoy the game and I am kinda interested in playing other Resident evil games, I at least want to play the other games that Leon is in.\n\n\nOne thing that I did find kinda rough was all those bear traps lol, i dont know who was laying them but I managed to step on every single one of them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak Resident Evil, gameplay and replayability 10/10 .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game. World and areas feel much bigger than Resident Evil 2/3 Remasters, but I still think the Ethan Winters saga takes the cake. A couple enemies are imo god awful and just annoying, but everything is balanced pretty well. Baby Eagle best partner",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's great! modernized while staying true to the classic release, just a fun time all around",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Frankly speaking, Resident Evil 4 Remake's an absolute masterpiece that flawlessly blends heart-pounding horror, breathtaking visuals, tight & satisfying combat and a brilliantly reimagined storyline into an unforgettable experience that honors the original while elevating it to a whole new level of modern excellence!!! Moreover, The remake delivers some of the smoothest and most exhilarating gameplay I’ve ever experienced in a survival-horror title, with every weapon upgrade, every enemy encounter, and every intense boss fight feeling polished, responsive & incredibly rewarding. Last but not least, Resident Evil 4 Remake kept me on the edge of my seat from beginning to end with its cinematic pacing, gripping tension, adrenaline-filled encounters, and immaculate production quality that never once dips throughout the entire journey, fr!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent Remake. RE4OG was amazing and this is equally great! best RE game in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Essential action game. Strong replay value. Get your moneys worth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🎨 Visual Vibes\r\n☐ What planet is this?!\r\n⬛ Jaw-Dropping\r\n☐ Slick & Sharp\r\n☐ Gets the Job Done\r\n☐ Meh Pixels\r\n☐ Eyes, Why Have You Betrayed Me\r\n☐ Retro Relic\r\n\r\nRE4 Remake turns every village corner into a horror postcard — stunning lighting, filthy detail, and movie-level atmosphere.\r\n\r\n🎮 Trigger Thrill (Gameplay)\r\n☐ Masterpiece Mechanics\r\n⬛ Solid Combat\r\n☐ Functional, I Guess\r\n☐ Kinda Boring\r\n☐ Feels Like Homework\r\n☐ Controller Screams in Pain\r\n\r\nGunplay is crisp, melee follow-ups are addictive, parries feel godlike, and every encounter is handcrafted chaos.\r\n\r\n🎧 Sound Check\r\n⬛ Audio Nirvana\r\n☐ Smooth Operator\r\n☐ Decent Vibes\r\n☐ It's... Fine\r\n☐ Cover Your Ears\r\n☐ Bleeding From Both Ears\r\n\r\nChainsaws, whispers, screams, rain, guns — everything sounds dangerously alive. Absolute peak sound design.\r\n\r\n🖥️ Can Your Rig Take the Hit?\r\n☐ Runs on a Calculator\r\n☐ Grandpa’s Laptop Approved\r\n⬛ Mid-Tier Friendly\r\n☐ Better Have a Gaming PC\r\n☐ High-End Hustler\r\n☐ NASA’s Backup Needed\r\n\r\nWell optimized. Mid-range rigs handle 60 FPS easily with the right settings.\r\n\r\n💾 Hard Drive Heist\r\n☐ Fits on a Floppy\r\n☐ Classic Compact\r\n⬛ Getting Chunky\r\n☐ Say Goodbye to Storage\r\n☐ Buy a New SSD\r\n☐ Send It to a Data Black Hole\r\n\r\nA chunky install, but the visuals justify it.\r\n\r\n🧠 Tactical Brain Power\r\n☐ Baby Mode\r\n⬛ Learn It, Master It\r\n☐ Casual Cruise\r\n☐ Tactical Brain Power\r\n☐ Big Brain Only\r\n☐ Prepare to Suffer\r\n\r\nEnemy patterns, resource management, parry timing — simple to start, deep when mastered.\r\n\r\n🌀 Grind Level\r\n⬛ Grind-Free Paradise\r\n☐ Optional Hustle\r\n☐ Tryhard Territory\r\n☐ Mild Effort Needed\r\n☐ Grindfest\r\n☐ Say Goodbye to Real Life\r\n\r\nNo grind. Play, survive, repeat for fun — not for farming.\r\n\r\n📜 Plot Punch\r\n☐ Story? What Story?\r\n⬛ Intriguing & Tight\r\n☐ Some Hints of Lore\r\n☐ Feels\r\n☐ Existential Crisis Incoming\r\n\r\nA tighter, more emotional version of the classic — with better character moments and sharper writing.\r\n\r\n⏳ Time Commitment\r\n☐ Blink and It’s Over (<1 hour)\r\n☐ One-Sitting Special (1–3 hours)\r\n⬛ 2–3 Day Campaign (8–15 hours)\r\n☐ A Weekend Affair\r\n☐ Call in Sick for a Week\r\n☐ Cancel Your Social Life\r\n☐ The Eternal Journey\r\n\r\nLong enough to be satisfying, short enough to replay.\r\n\r\n💸 Price Pain\r\n☐ Freebie Frenzy\r\n⬛ Worth Every Penny\r\n☐ Buy It on Sale\r\n☐ Only If You're Curious\r\n☐ Not Worth the Coin\r\n☐ Just Light Your Money on Fire\r\n\r\nA remake done right — more than worth the cost.\r\n\r\n🪲 Bug Watch\r\n⬛ Clean as a Whistle\r\n☐ Minor Nuisances\r\n☐ Noticeable Glitches\r\n☐ Bug Battle\r\n☐ The Game Is a Bug Farm\r\n\r\nZero major bugs, smooth launch, and consistent polish.\r\n\r\n🪓 Ganado Threat Level\r\n\r\n☐ 🪓\r\n☐ 🪓🪓\r\n☐ 🪓🪓🪓\r\n☐ 🪓🪓🪓🪓\r\n☐ 🪓🪓🪓🪓🪓\r\n☐ 🪓🪓🪓🪓🪓🪓\r\n☐ 🪓🪓🪓🪓🪓🪓🪓\r\n☐ 🪓🪓🪓🪓🪓🪓🪓🪓\r\n⬛ 🪓🪓🪓🪓🪓🪓🪓🪓🪓\r\n☐ 🪓🪓🪓🪓🪓🪓🪓🪓🪓🪓\r\n\r\n💬 9/10 — Terrifying, stylish, brutally polished. A gold-standard remake.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Final Verdict: [b]85/100[/b][/h1]\n\n[b]Impressive: 85-94 (85-94%)[/b]\nPerformance or gameplay surpasses the passing mark and stands out from the average.\nProvides a high level of quality and enjoyable gameplay.\nStrongly Recommended - ✔✔\n\n[h2]Player Opinion Steam Review[/h2]\n\n[b]Gameplay Experience (22/25)[/b]\n\n[i]Intuitive Controls - Easy to use.[/i]\n☐ Very Difficult (+1)\n☐ Difficult (+2)\n☐ Moderate (+3)\n☐ Easy (+4)\n☑ Very Easy (+5)\n\n\n[i]Balanced Gameplay - Fair and equal.[/i]\n☐ Poorly Balanced (+1)\n☐ Somewhat Balanced (+2)\n☐ Moderately Balanced (+3)\n☐ Well Balanced (+4)\n☑ Perfectly Balanced (+5)\n\n\n[i]Player Engagement - Involving and captivating.[/i]\n☐ Not at all (+1)\n☐ Slightly (+2)\n☐ Moderately (+3)\n☑ Very (+4)\n☐ Extremely (+5)\n\n\n[i]Decision Relevance - Meaningful choices.[/i]\n☐ Meaningless (+1)\n☐ Not Meaningful (+2)\n☐ Somewhat Meaningful (+3)\n☑ Quite Meaningful (+4)\n☐ Highly Meaningful (+5)\n\n\n[i]Rewarding Progression - Satisfying advancement.[/i]\n☐ Very Unsatisfying (+1)\n☐ Unsatisfying (+2)\n☐ Neutral (+3)\n☑ Satisfying (+4)\n☐ Very Satisfying (+5)\n\n\n[b]Presentation & Immersion (22/25)[/b]\n\n[i]Compelling Storyline - Engaging narrative.[/i]\n☐ Not Interesting (+1)\n☐ Slightly Interesting (+2)\n☐ Moderately Interesting (+3)\n☑ Very Interesting (+4)\n☐ Extremely Interesting (+5)\n\n\n[i]Immersive Atmosphere - Captivating environment.[/i]\n☐ Not Immersive (+1)\n☐ Slightly Immersive(+2)\n☐ Moderately Immersive (+3)\n☑ Very Immersive (+4)\n☐ Completely Immersive (+5)\n\n\n[i]Visual Aesthetics - Stunning graphics.[/i]\n☐ Not Appealing (+1)\n☐ Slightly Appealing (+2)\n☐ Moderately Appealing (+3)\n☐ Very Appealing (+4)\n☑ Extremely Appealing (+5)\n\n\n[i]Audio Quality - High-quality sound.[/i]\n☐ Not Engaging (+1)\n☐ Slightly Engaging (+2)\n☐ Moderately Engaging (+3)\n☑ Very Engaging (+4)\n☐ Extremely Engaging (+5)\n\n\n[i]Polished HUD - Clean and functional interface.[/i]\n☐ Very Unfriendly (+1)\n☐ Unfriendly (+2)\n☐ Neutral (+3)\n☐ Friendly (+4)\n☑ Very Friendly (+5)\n\n\n[b]Design & Technical Aspects (18/25)[/b]\n\n[i]Game Design - Well-crafted mechanics.[/i]\n☐ Poorly Designed (+1)\n☐ Somewhat Designed (+2)\n☐ Moderately Designed (+3)\n☐ Well Designed (+4)\n☑ Excellently Designed (+5)\n\n\n[i]Content Quality - Rich and diverse.[/i]\n☐ Poor Content (+1)\n☐ Limited Content (+2)\n☐ Moderate Content (+3)\n☑ Extensive Content (+4)\n☐ Abundant Content (+5)\n\n\n[i]AI Behavior - Intelligent and realistic.[/i]\n☐ Very Poor (+1)\n☐ Poor (+2)\n☐ Average (+3)\n☑ Good (+4)\n☐ Excellent (+5)\n\n\n[i]Settings - Flexible and customizable.[/i]\n☐ Very Limited (+1)\n☐ Limited (+2)\n☐ Moderate (+3)\n☑ Flexible (+4)\n☐ Highly Flexible (+5)\n\n\n[i]Technical Issues - Minimal or no problems.[/i]\n☑ Numerous (+1)\n☐ Moderate (+2)\n☐ Limited (+3)\n☐ Minor (+4)\n☐ None (+5)\n\n\n[b]Final Considerations (23/25)[/b]\n\n[i]Overall Satisfaction - General enjoyment level.[/i]\n☐ Very Dissatisfied (+1)\n☐ Dissatisfied (+2)\n☐ Neutral (+3)\n☐ Satisfied (+4)\n☑ Very Satisfied (+5)\n\n\n[i]Microtransactions - In-game purchases.[/i]\n☐ Extensive (+1)\n☐ Substantial (+2)\n☐ Moderate (+3)\n☑ Minimal (+4)\n☐ None (+5)\n\n\n[i]Replay Value - Longevity and replayability.[/i]\n☐ Very Low (+1)\n☐ Low (+2)\n☐ Moderate (+3)\n☑ High (+4)\n☐ Very High (+5)\n\n\n[i]Cost-to-Play Ratio - Money spent vs hours played.[/i]\n☐ Overpriced (+1)\n☐ Poor Value (+2)\n☐ Fair Value (+3)\n☐ Good Value (+4)\n☑ Excellent Value (+5)\n\n\n[i]Recommendation.[/i]\n☐ No (+0)\n☑ Yes (+5)",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "In order to understand what went fundamentally wrong with RE4make we should first briefly revisit what defined the original and what it’s remembered and still played for.\n\nThe original back in 2005 was revolutionary - it established the third person shooter genre and redefined the survival horror one. It placed a particular emphasis on combat, with an integral part of that being tactical and responsive gunplay. Every weapon had an identity and shooting any part of an enemy came with distinct advantages - whether slowing them down, disarming them or blowing up lit dynamite, taking out their allies in the process. Loot and ammo dropping from every enemy and even crows and chicken encouraged you - for the very first time in Resident Evil franchise - to engage with combat mechanics instead of avoiding combat to conserve ammunition, as it was customary for the classic games.\n\nMeanwhile RE4make reuses the combat system from the remake of Resident Evil 2. The slow and methodical gunplay that makes you wait for the reticle to close after every shot; the punishing spread and recoil that discourages firing a submachine gun other than in short bursts; the bullet-spongy enemies that barely even flinch and make it feel like your guns are shooting blanks; the comically overpowered yet ever-breaking knives leaving you defenceless - all that worked well in RE2, portraying the character as vulnerable and presenting even a single zombie as a real threat, encouraging the player to avoid combat rather than engage in it.\n\nNeedless to say, it doesn’t work here. As a result, the remake plays like RE2 with decorations from RE4. This weird mixture of different concepts creates a game that doesn’t know what it wants from you - to engage in inconsistent, unfair and unfun combat with little room for tactical gunplay, the enemies that will stunlock you while attacking relentlessly and a knife that’s better than a rocket launcher; or to remove your gear and force you to make use of its new feature, the stealth mechanics. The latter is an afterthought that achieves nothing other than to break the pacing of the game and take away from its combat focus. The 2005 revolution has not been improved upon, but instead was treated as if never happened. The laser sight - arguably one of the original’s most notable additions to combat - while technically still present as a side quest reward you need to grind for, can now only be attached to a couple of weaker pistols.\n\nAs far as the story and atmosphere are concerned, the original is best characterized as an unpretentious B-movie. It was full of cheesy one-liners, silly dialogues and goofy fan service “features”, like looking up Ashley’s skirt. The game was very self-aware and did everything to prevent you from treating itself too seriously. It did not really try to be a horror either - acknowledging the fact that when a game gives you a machine gun, the only thing you can be scared of is running out of ammo. As a whole, it all worked well to give the original its unique vibe and identity.\n\nThe remake, however, goes out of its way to present itself as dead serious. The surroundings and ambience try their best to create a dark, ominous atmosphere. Unnecessary and excessive even by RE standards graphical violence in your face including mutilated corpses and elaborate death animations as well as an annoying mandatory horror segment make it feel like a love letter to Village instead of the original. There’s no longer much room for based light-hearted comedy in this new game, and drastic changes to characters and dialogues are emblematic of that. The feminine “damsel in distress” Ashley is gone - replaced by a cringe “strong and independent” Ashley instead. The president did not equip his daughter with ballistics this time round, while a modern take on Ashley’s lingerie with 4k textures, ray tracing, DLSS and HDR is obviously out of discussion. She now calls herself “master of unlocking”, no longer offers Leon “overtime” and (following in RE3make’s footsteps) wears an ugly skort. Ada’s red dress was likewise taken away from her in favour of a sweater. Hunnigan is now overly professional rather than casual and flirty. And Leon is now suffering from PTSD one minute and spitting one-liners the next one - unsure of his role in this brave new world. Of course, they did not stop at the tone and character design: the game no longer features many dialogues, a number of areas, weapons and bosses, nor any of the additional content RE4 used to have.\n\nAs a result, in RE4make the overly serious vibe strangely coexists with the few remaining one-liners and ridiculous enemies like a giant fish. It comes across as a game “gone woke” and somehow manages to be even less faithful to the original than the remake of RE3 - which, to be fair, at least preserved the tone and spirit of its namesake. The things that made the original so fun are just not here anymore, being “reimagined”, censored or sterilized. In fact, RE4make feels like a completely different game that just so happens to share a bunch of names with the original.\n\nIs this different game at least great as far as modern games are concerned? Unfortunately, this is not the case either. There is nothing here that would bring novelty to the genre or, indeed, even justify the existence of this remake. The only additions to the usual formula are side quests (boring busywork tasks with little variety like “kill 3 rats” and “shoot 6 medallions”) and lootboxes giving you rare and epic charms to boost your stats. The unsatisfying and inconsistent gunplay does not belong here and is not fit for purpose. Continuing the trend set by RE3make level design is full of cramped, claustrophobic corridors as if created to work around PS1-era hardware limitations. The voice acting is sad and uninspired, oftentimes missing its “acting” part. The level of self-plagiarism here is staggering, evident of creative stagnation in the absence of great minds like Shinji Mikami: if you played RE2 Remake or Village (ironically, itself a derivative of RE4) - you pretty much played this one as well.\n\nOf course, a review should not only be concerned with the question of how good the game is, but also how good it is for the asking price. And I see two problems here. First of all, it’s priced $60 - higher than any of Capcom’s previous remakes. And frankly, it’s a big ask considering there’s no additional content. The second, arguably even bigger issue is the nonexistent regional pricing. For example, as a Ukrainian gamer as of time of this review I can get Cyberpunk for $25, and Hogwarts Legacy for mere $20. Meanwhile Capcom expected me to pay some $55 - about full price.\n\nI’d also like to mention what I can only describe as aggressive monetization. You see, the progression once again follows the RE3R formula - the higher levels of difficulty are simply brutal and are envisioned to be tackled not as much with skill but rather overpowered weaponry from previous runs (Professional is clearly balanced around infinite rocket launcher). Preorder bonus trinkets actually give you gameplay advantages like more gold and ammo crafted, effectively making Hardcore difficulty not-so-hardcore. Meanwhile Deluxe Edition adds treasures that simply don’t exist in the game otherwise as well as guns that are all-round better than those you can find in the beginning - and you can now even upgrade them! It all feels very pay-to-win in a singleplayer game. I imagine RE4make was designed as a cash cow and will get All Rewards Unlocked and many other DLC in the future.\n\nTL;DR: RE2make and Village had a baby, allowed it to pick its gender and gave it a famous name just because. It is not another revolution for the genre - it’s merely a corridor shooter with yellow paint of handholding everywhere. Hard skip if you’re a fan of the original, grab on sale if you couldn’t get enough of Capcom’s recent games on RE Engine and wanted more of the same.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "[h2] A game I've been hyped to play on my new PC [/h2] \n\nIt's a shame I've tried and tried, but this remake still doesn't convince me. I've completed the game twice; once on Normal difficulty and once on Expert difficulty, but in the end, I was left with nothing. Maybe it's because I've played the original game for so many years, and it feels familiar. I'd also add that I felt like I was playing a Resident Evil that wasn't Resident Evil (hard to explain).\n\n[b] Parrying chainsaws? [/b] \nIt's hilarious. The original game wasn't like that. At most, you could shoot crossbow bolts, which was pretty cool for the time. But all that you do with Leon's knife and the knives you find lying around. You also parry incoming axes, or even slashes from sickles and machetes when the ganads are very close. There's this damned parrying mechanic, which many games in recent years seem to have become obsessed with. But that's the way video games are these days, and if developers don't include the parrying mechanic, they're not happy.\n\n[b] \"Remake\" [/b] \n4K, 1080p? Ultra Textures? Graphically, it's very nice, yes, but it's not as exceptional as it seems. In fact, there are some textures on doors and walls that are low-resolution, even when playing at high graphics settings. In terms of lighting and effects, it's also not great, and if you look closely, you can spot the flaws. Like my Leon's face and the low-resolution 2D fire sprites. However, in my first playthrough, I played with AMD Fidelity on Quality mode, while in the second I decided to play without any graphics optimizations. In the end, not much changed. At least I found it well-optimized and never experienced any frame drops even without AMD Fidelity.\n\n[b] Changes in characters, personalities, songs & world [/b]\nFor a remake, it's primarily a freedom of reinterpretation. There are some characters who, compared to the original version, are anything but themselves. I'm not just referring to their changed appearance, but also, specifically, their personalities. Ashley comes to mind, who was criticized by some for being completely revamped. This new Ashley isn't really Ashley. Ashley was known for being a pain in the ass, and rightfully so. But Capcom listened and took the opportunity to choose a beautiful girl with a confident, non-annoying personality (too perfect). Or different event choices; where Luis Sera [spoiler] dies from a completely random stab from Krauser, whereas in the original game he dies from Saddler's sting [/spoiler]. Let's talk about the game's songs. Serenity was really beautiful in the original version, but she's been completely changed. She's no longer Serenity, but something else now. It always bothered me to save the game and listen to this new version. [u] The only positive things are [/u] that they've at least expanded some areas that weren't there before and added new puzzles. The merchant with this new quest system is nice and gives you rewards. I probably enjoyed Separate Ways more than the base game [spoiler] (although Capcom even went to the trouble of including Ada's random infection in the story).[/spoiler]\n\n[b] Cut Contents in Dialogue [/b]\nCapcom has managed to remove and replace \n[strike] \"No Thanks, Bro!\" [/strike] in the first encounter with Salazar and [strike] \"Women\" [/strike] after he's accompanied by Ada to the island. It's probably part of those famous changes. But I think it wasn't necessary. At least they left the Bingo joke in.\n\n[b] Too many useless mini-DLCs [/b]\nIt disgusted me to see how much useless stuff there is in the Steam Store. Costumes, weapons, weapon mod vouchers, maps, expandable cases, suitcase charms and WTF. And the worst part is that people buy them. In my day, these things were unlocked by finishing the game. It's also absurd to immediately buy charms to make dead enemies drop health, money, and ammo. Otherwise, you can always go to the shooting range and hope for the right charm with tokens (but you're not guaranteed to be lucky).\n\n[u] In conclusion [/u]\nThis remake is truly soulless. I'll continue to prefer the 2005 original on PS2 (which I proudly own in physical form) and the HD collection on PC, which I have 100% of all the achievements.\n\n[b] PS:  [/b] In the end, tastes are tastes. I didn't say it was crap. I just said I didn't like it as a remake. The only remakes I liked were Resident Evil 2 Remake and Resident Evil 3 Remake (even though everyone hated the latter).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I guess it's not a bad game but I just found it tedious. Halfway through the game I was hoping it would end already. It throws you in the middle of a bunch of enemies constantly and you will have to fight your way through them wasting all your ammo and resources all the time. Then it does it again and again. And again. And again. There's almost zero intelligence in the gameplay, just blast away everything you come across. There are some good moments as well but mostly it's this annoying and repetitive action blasting. I have recently started playing through these remakes 1-4 in sequence and this is the worst one out of them which is a shame because I was really looking forward to this because of the good reviews.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Clunky controls, no dodge button (the bull with the hammer swings downwards and all you can do is stare at it) it's 2025 lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The part where you have to fight off hundreds of people at once while stuck in the cabin is absolutely unbearable and I will never replay this game solely because of this specific level. It's also about 20 minutes long with no save point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1st playthough i enjoyed, but upon returning to this game i actually realised its worse than the original, its very cheap all the way through with bullets going through enemies, cheap bosses and a boring CP mechanic to try give the feel of replayability. People say its a long remake (even with loads of cut content) but once you realise its just filled with cheap mechanics to long it out youll just wanna play the far better original.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the only positive thing that can be said about this slop is it made me re play the orignal agian.\n\nif you like this game over the o.g I genunily think you should be reported as a domestic terrosist with asbergers as you have no right owning a brain let alone a body.\n\nas far as slop remakes go sorry not sorry this is the second lowest on the totem pole just above the abonation of the silent hill 2 remake. yes this includes the re 3 remake that atlest had the decency to only jerk me off for 3 hours before disapontinly not making me finish compared to this fucking slog.\n\nall the character, sole and charm of the original is gone.\n\nvisual style is traded for visual fedility with no thought or care put into it.\n\nshits cut out.\n\nvo's sound like either mentally handicapped adults or shit you would here in a fan film.\n\nthe core of the gun play has been sucked out to the point where this is just generic 3rd person shooter number 300067.\n\nis you like re4 dont play this.\n\ni only suffered to the end to see if anything would improve but alas like a pedo at a pre school it did exactly what i expected. raped me in the ass and tainted my childhood,\n\nthanks capcom.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a negative review simply to lower it from it's current 97% positive score, as I do not in any scenario believe this is a 97% game. \nI completed the game on Hardcore mode for my first playthrough, and went into the launch of this game with a lot of excitement being such a huge fan of the original. However, by the end, while it was certainly an experience, it is overall a hollow interpretation of the original masterpiece in survival horror. \n\n- Ada is horrible, and while this is mainly due to her voice actress being horrible, it also has to do with the fact that they are not subtle with her at all. That's a bad thing. The original handled her better in that regard in making her classy AND sexy, but not making her seem like a complete hoe either. We already know Ada is hot. We don't need Chapter 10 to open up with a straight @$$ shot to prove it. And... just hire a new actress please, that was SO bad man. (btw, go get the mod on Nexus that overrides it with a new one that sounds a LOT better)\n- Leon is worse in this game than in the original overall. He is NOT bad in this game, don't get me wrong, but they totally changed how he acts in a variety of situations. All of the dude's dorky coolness got replaced with edgy coolness, which I would not say is necessarily a good thing. The OG Leon is always going to be best, but this still isn't terrible. \n- The one liners of Leon's get their own section, as a LOT of them are gone and replaced with new ones. This also is bad, as the old ones were literal gold. The new ones, once again, are fine, but Leon is a worse character for it. \n- The game feels uninspired at times. A lot of Ashley's dialogue feels like it was written by AI, it's just VERY generic. The gameplay, while engaging and fun, is also very generic. You find a lot of other games that do exactly what this game does on a gameplay level, and that definitely takes a bit of points away compared to the very unique gameplay of the original. All of Ada's dialogue definitely falls here in this category as well. \n- Mercenaries mode, what HAPPENED to you?! Why would they put a limit on the enemies you kill? Why? Why would they do that? That is so stupid. It's a fun mode overall, but dang. \n\nNow, while I did say all of those bad things about the game, there were good things about the game that I thoroughly enjoyed. \n- Krauser. They did him SO well. I was genuinely speechless by the time the fight with him was finished. \n- Luis. While I did find him more annoying here than I did in the original at first, he grew on me a lot, and didn't feel like he overstayed his welcome. \n- The atmosphere of this game is VERY well done. It was haunting going through this game, seeing all of the environments for the first time, and of course fighting through the WAVES of enemies infected with Las Plagas. This is probably the strongest point of this entire game. \n\nIt is a solid game, and I had a lot of fun with it. However, this is certainly no masterpiece. I mean, it can't be, it's just a recycled product from the past with a fresh coat of paint and 75% of the charm gone. Just play the OG, it's better in every way, and WAY cheaper. Also, the OG has a WAY better Mercenaries mode too, so have fun with that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At least now I know that games can contain bloatware too. \r\n\r\nPS: \r\nI am Leon S. Kennedy and they made me look like the backside of a baboon and weigh 400 KG.\r\nI am Ada Wong and sound like the condensed version of desperate housewives. Pimped with frustration and depression. \r\nI am Ashley and exorcise demons with my face every monday.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't progress past chapter 15 (ruins fight) due to an infinite loading screen.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Denovu staying on way too long and scummy mtx dampen an otherwise good remake experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky controls, no dodge button (the bull with the hammer swings downwards and all you can do is stare at it) it's 2025 lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent, dying from stupidest things, ammo nowhere to find same as heal, 50% fightning with knife, cant buy ammo, but you can buy rpg..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many of my hours in game are simply leaving it open. This game represents everything wrong with modern day shooters being slow-brained garbage. Everything wrong with it:\n\n- Graphics are atrocious. Absolutely everything is grey and lifeless. Why is this a thing? It's getting tired\n- Obligatory low FOV because that's standard nowadays. \"Hurr durr that thing that restricts your field of view below natural eye levels and makes players nauseous - we're going to keep doing it\"\n- Takes five seconds to reload - the entire challenge of the game is not really ability but willingness to tolerate all the artificial challenges (low accuracy weapons, long reloads, low ammo, awkward player movement)\n- Every vase you break involves a 1-2 second long animation (lol)\n- Other unskippable cut-scenes/animations (should NEVER be a thing)\n- Enemies sometimes have five (or more) second long dying animations wherein you can't tell if they're still alive or where you simply have to wait all that time to pick up the drops\n- Can't strafe\n- Can't jump\n- Reload doesn't work unless you wait until Leon finishes doing everything completely (like switching the weapon, etc) - every single thing in the game is designed to make you wait and prevent you from playing fast\n- Doesn't respect Steam binds - you hit Shift+Tab to bring up the Overlay, and the game brings up the inventory or Photo Mode every single time - then the game doesn't respect Windows keys - you press Esc to exit Photo Mode or what-have-you and it doesn't work. Nope; the one key that's been used to exit menus and things for decades on Windows machines won't work here!\n- Can't unload weapons - if a gun is loaded with ammo, the ammo can't be used in another gun which uses the same type\n- Can't mute the NPC's constant nonsensical chatter despite the dialogue being muted - chatter can be extremely annoying and loud though adjacent walls and things\n- Can't craft while attempting to pick up an item - you have to, of course, given the game, exit your inventory, re-enter, craft, exit, re-pickup the item. lol. Once again, EVERYTHING in this game is designed to make you click and navigate as much as possible and artificially engage you\n\nThis game is a joke. A joke raking in the money for a AAA company because people are getting dumber and dumber.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't get through on normal mode, if you want to change the difficulty you have to create an entire new save file. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dont see the hype.  Game runs good, looks good, but nothing special.  I enjoyed the movies and the original game, maybe I am getting too old to appreciate things",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "controls are clunky, main character is  ret*****, story makes zero sense because it all in Leon's mind , I somehow still play for unlocks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "had to go out at 4am to deposit money like a d*** dealer and buy this game and still gameplay was dog**** ngl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "VR is PS5 exclusive. If you want to play it on the steam version you have to install a mod. Why is VR in the tags?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am disappointed, i expected that the remake will have \"normal\" controls",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "didnt work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ASD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ASS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: remake is worse than the original, particularly lacking enemy flanking sound queues and some basic sound design. Seems to go out of its way to make combat more unpleasant & less fun with spongy enemies that don't react to bullets.\n\nI grew up playing RE4 on the gamecube. Spent easily 1000+ hours on it doing lots of challenge runs and speedruns because i just loved the shit out of that game. Approaching this game with some of those tactics still in my head 20 years later may have tainted my experience. I played this with a controller, which was probably a big mistake.\n\n1. Limited enemy reaction to damage - staggering enemies is either RNG based or hp based. Old game, you shoot a guy in the head or knees, he staggers and you can melee. this was critical for early crowd control when your primary tool was the pistol. Now in the remake, I regularly shoot enemies in the head 3 times without getting a stagger, sometimes twice without even a hitstun. Effect here is likely by design since it forces more usage of shotgun and grenades in order to handle crowds, but making generic enemies eat bullets to the face with no reaction feels awful, especially since this was a huge selling point for the original game. Maybe the short-term solution is to bench the pistol?\n\n2. Crosshair depth - old game rooted you in place when shooting, and you aimed with a laser pointer. Now you have classic shooter crosshairs with variable spread etc, but you don't have a laser projection from your weapon, if enemies get too close your ability to hit them greatly decreases since your aiming function sources the camera, not your character model.\n \n3. Lack of sound cues. This is probably the worst one for me, and I doubt I can mod it away. Maybe I leaned on these too much back in the day, but having an enemy grab/chop/stab you from behind with zero sound cue that you're being flanked was very unpleasant, especially with how the game forces you to tunnel-vision on the targets in front of you with the aim camera and fov zoom. Having to shoot the guy in front of you 3+ times in the head while being unable to hear the ladder being placed behind you or getting a sound cue from a flanking foe really highlights how they made the game worse.\n\nAnd I'm only two hours in. I have no idea how this game is being reviewed so well when its objectively worse than the original. I hope I can aggressively mod to mitigate these issues, or faster aiming with m&kb could make issue #2 more tolerable.\n\nIn the original game, combat was a relatively slow and calculated process that spawned an entire genre - juggling enemies with the ammo and tools provided with reliable enemy hitstun and stagger, and that proverbial boat was rocked when a parasite head or a thicker enemy type appeared - this changed your priorities, forced a brief retreat, reposition, or weapon swap. This design spawned an entire goddamn genre.  Now your boat gets rocked as soon as more than two enemies are in your line of sight, not to mention the silent/invisible enemies behind you due to lack of basic sound design. Maybe this is more survival-horror-y? I find bullet sponge enemies in this game tedious, especially when there's a wall of them in front of you.\n\nI can only fathom the overwhelmingly positive reviews are due to lack of experience with the original game, or if m&kb really fixes everything. The original was a vastly superior experience - and Salazar had a nice hat that I now have to mod in. This remake, so far, feels very small time. Huge disappointment.\n\np.s. i would give away instant grab-breaks and the upgradable combat knife for the old game's unbreakable basic knife without a moments hesitation.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "[h2] A game I've been hyped to play on my new PC [/h2] \n\nIt's a shame I've tried and tried, but this remake still doesn't convince me. I've completed the game twice; once on Normal difficulty and once on Expert difficulty, but in the end, I was left with nothing. Maybe it's because I've played the original game for so many years, and it feels familiar. I'd also add that I felt like I was playing a Resident Evil that wasn't Resident Evil (hard to explain).\n\n[b] Parrying chainsaws? [/b] \nIt's hilarious. The original game wasn't like that. At most, you could shoot crossbow bolts, which was pretty cool for the time. But all that you do with Leon's knife and the knives you find lying around. You also parry incoming axes, or even slashes from sickles and machetes when the ganads are very close. There's this damned parrying mechanic, which many games in recent years seem to have become obsessed with. But that's the way video games are these days, and if developers don't include the parrying mechanic, they're not happy.\n\n[b] \"Remake\" [/b] \n4K, 1080p? Ultra Textures? Graphically, it's very nice, yes, but it's not as exceptional as it seems. In fact, there are some textures on doors and walls that are low-resolution, even when playing at high graphics settings. In terms of lighting and effects, it's also not great, and if you look closely, you can spot the flaws. Like my Leon's face and the low-resolution 2D fire sprites. However, in my first playthrough, I played with AMD Fidelity on Quality mode, while in the second I decided to play without any graphics optimizations. In the end, not much changed. At least I found it well-optimized and never experienced any frame drops even without AMD Fidelity.\n\n[b] Changes in characters, personalities, songs & world [/b]\nFor a remake, it's primarily a freedom of reinterpretation. There are some characters who, compared to the original version, are anything but themselves. I'm not just referring to their changed appearance, but also, specifically, their personalities. Ashley comes to mind, who was criticized by some for being completely revamped. This new Ashley isn't really Ashley. Ashley was known for being a pain in the ass, and rightfully so. But Capcom listened and took the opportunity to choose a beautiful girl with a confident, non-annoying personality (too perfect). Or different event choices; where Luis Sera [spoiler] dies from a completely random stab from Krauser, whereas in the original game he dies from Saddler's sting [/spoiler]. Let's talk about the game's songs. Serenity was really beautiful in the original version, but she's been completely changed. She's no longer Serenity, but something else now. It always bothered me to save the game and listen to this new version. [u] The only positive things are [/u] that they've at least expanded some areas that weren't there before and added new puzzles. The merchant with this new quest system is nice and gives you rewards. I probably enjoyed Separate Ways more than the base game [spoiler] (although Capcom even went to the trouble of including Ada's random infection in the story).[/spoiler]\n\n[b] Cut Contents in Dialogue [/b]\nCapcom has managed to remove and replace \n[strike] \"No Thanks, Bro!\" [/strike] in the first encounter with Salazar and [strike] \"Women\" [/strike] after he's accompanied by Ada to the island. It's probably part of those famous changes. But I think it wasn't necessary. At least they left the Bingo joke in.\n\n[b] Too many useless mini-DLCs [/b]\nIt disgusted me to see how much useless stuff there is in the Steam Store. Costumes, weapons, weapon mod vouchers, maps, expandable cases, suitcase charms and WTF. And the worst part is that people buy them. In my day, these things were unlocked by finishing the game. It's also absurd to immediately buy charms to make dead enemies drop health, money, and ammo. Otherwise, you can always go to the shooting range and hope for the right charm with tokens (but you're not guaranteed to be lucky).\n\n[u] In conclusion [/u]\nThis remake is truly soulless. I'll continue to prefer the 2005 original on PS2 (which I proudly own in physical form) and the HD collection on PC, which I have 100% of all the achievements.\n\n[b] PS:  [/b] In the end, tastes are tastes. I didn't say it was crap. I just said I didn't like it as a remake. The only remakes I liked were Resident Evil 2 Remake and Resident Evil 3 Remake (even though everyone hated the latter).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In order to understand what went fundamentally wrong with RE4make we should first briefly revisit what defined the original and what it’s remembered and still played for.\n\nThe original back in 2005 was revolutionary - it established the third person shooter genre and redefined the survival horror one. It placed a particular emphasis on combat, with an integral part of that being tactical and responsive gunplay. Every weapon had an identity and shooting any part of an enemy came with distinct advantages - whether slowing them down, disarming them or blowing up lit dynamite, taking out their allies in the process. Loot and ammo dropping from every enemy and even crows and chicken encouraged you - for the very first time in Resident Evil franchise - to engage with combat mechanics instead of avoiding combat to conserve ammunition, as it was customary for the classic games.\n\nMeanwhile RE4make reuses the combat system from the remake of Resident Evil 2. The slow and methodical gunplay that makes you wait for the reticle to close after every shot; the punishing spread and recoil that discourages firing a submachine gun other than in short bursts; the bullet-spongy enemies that barely even flinch and make it feel like your guns are shooting blanks; the comically overpowered yet ever-breaking knives leaving you defenceless - all that worked well in RE2, portraying the character as vulnerable and presenting even a single zombie as a real threat, encouraging the player to avoid combat rather than engage in it.\n\nNeedless to say, it doesn’t work here. As a result, the remake plays like RE2 with decorations from RE4. This weird mixture of different concepts creates a game that doesn’t know what it wants from you - to engage in inconsistent, unfair and unfun combat with little room for tactical gunplay, the enemies that will stunlock you while attacking relentlessly and a knife that’s better than a rocket launcher; or to remove your gear and force you to make use of its new feature, the stealth mechanics. The latter is an afterthought that achieves nothing other than to break the pacing of the game and take away from its combat focus. The 2005 revolution has not been improved upon, but instead was treated as if never happened. The laser sight - arguably one of the original’s most notable additions to combat - while technically still present as a side quest reward you need to grind for, can now only be attached to a couple of weaker pistols.\n\nAs far as the story and atmosphere are concerned, the original is best characterized as an unpretentious B-movie. It was full of cheesy one-liners, silly dialogues and goofy fan service “features”, like looking up Ashley’s skirt. The game was very self-aware and did everything to prevent you from treating itself too seriously. It did not really try to be a horror either - acknowledging the fact that when a game gives you a machine gun, the only thing you can be scared of is running out of ammo. As a whole, it all worked well to give the original its unique vibe and identity.\n\nThe remake, however, goes out of its way to present itself as dead serious. The surroundings and ambience try their best to create a dark, ominous atmosphere. Unnecessary and excessive even by RE standards graphical violence in your face including mutilated corpses and elaborate death animations as well as an annoying mandatory horror segment make it feel like a love letter to Village instead of the original. There’s no longer much room for based light-hearted comedy in this new game, and drastic changes to characters and dialogues are emblematic of that. The feminine “damsel in distress” Ashley is gone - replaced by a cringe “strong and independent” Ashley instead. The president did not equip his daughter with ballistics this time round, while a modern take on Ashley’s lingerie with 4k textures, ray tracing, DLSS and HDR is obviously out of discussion. She now calls herself “master of unlocking”, no longer offers Leon “overtime” and (following in RE3make’s footsteps) wears an ugly skort. Ada’s red dress was likewise taken away from her in favour of a sweater. Hunnigan is now overly professional rather than casual and flirty. And Leon is now suffering from PTSD one minute and spitting one-liners the next one - unsure of his role in this brave new world. Of course, they did not stop at the tone and character design: the game no longer features many dialogues, a number of areas, weapons and bosses, nor any of the additional content RE4 used to have.\n\nAs a result, in RE4make the overly serious vibe strangely coexists with the few remaining one-liners and ridiculous enemies like a giant fish. It comes across as a game “gone woke” and somehow manages to be even less faithful to the original than the remake of RE3 - which, to be fair, at least preserved the tone and spirit of its namesake. The things that made the original so fun are just not here anymore, being “reimagined”, censored or sterilized. In fact, RE4make feels like a completely different game that just so happens to share a bunch of names with the original.\n\nIs this different game at least great as far as modern games are concerned? Unfortunately, this is not the case either. There is nothing here that would bring novelty to the genre or, indeed, even justify the existence of this remake. The only additions to the usual formula are side quests (boring busywork tasks with little variety like “kill 3 rats” and “shoot 6 medallions”) and lootboxes giving you rare and epic charms to boost your stats. The unsatisfying and inconsistent gunplay does not belong here and is not fit for purpose. Continuing the trend set by RE3make level design is full of cramped, claustrophobic corridors as if created to work around PS1-era hardware limitations. The voice acting is sad and uninspired, oftentimes missing its “acting” part. The level of self-plagiarism here is staggering, evident of creative stagnation in the absence of great minds like Shinji Mikami: if you played RE2 Remake or Village (ironically, itself a derivative of RE4) - you pretty much played this one as well.\n\nOf course, a review should not only be concerned with the question of how good the game is, but also how good it is for the asking price. And I see two problems here. First of all, it’s priced $60 - higher than any of Capcom’s previous remakes. And frankly, it’s a big ask considering there’s no additional content. The second, arguably even bigger issue is the nonexistent regional pricing. For example, as a Ukrainian gamer as of time of this review I can get Cyberpunk for $25, and Hogwarts Legacy for mere $20. Meanwhile Capcom expected me to pay some $55 - about full price.\n\nI’d also like to mention what I can only describe as aggressive monetization. You see, the progression once again follows the RE3R formula - the higher levels of difficulty are simply brutal and are envisioned to be tackled not as much with skill but rather overpowered weaponry from previous runs (Professional is clearly balanced around infinite rocket launcher). Preorder bonus trinkets actually give you gameplay advantages like more gold and ammo crafted, effectively making Hardcore difficulty not-so-hardcore. Meanwhile Deluxe Edition adds treasures that simply don’t exist in the game otherwise as well as guns that are all-round better than those you can find in the beginning - and you can now even upgrade them! It all feels very pay-to-win in a singleplayer game. I imagine RE4make was designed as a cash cow and will get All Rewards Unlocked and many other DLC in the future.\n\nTL;DR: RE2make and Village had a baby, allowed it to pick its gender and gave it a famous name just because. It is not another revolution for the genre - it’s merely a corridor shooter with yellow paint of handholding everywhere. Hard skip if you’re a fan of the original, grab on sale if you couldn’t get enough of Capcom’s recent games on RE Engine and wanted more of the same.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "[h1] NO THANKS BRO! [/h1]\r\nIs what I would say to capcom even after I got the remake at 50% off because this remake is lacking and boring in the story and action and camp department. Apparently, this remake is trying to take the plot so seriously, that it lost the unbeatable charm of the original resident evil 4. I noticed that they don’t do jokes and that the characters aren’t having fun [u] (I mean it is a life-threatening situation but come on, its Leon Kennedy, the superhero of the resident evil franchise aside from Chris the boulder-puncher) [/u]   I noticed that they were taking this remake to be more of a horror thriller when they got chased by the Big cheese and then the bridge exploded, u know, the cutscene before the Big cheese boss fight. The original was more of an action comedy and I really missed that but don’t get me wrong, I will still keep playing this until I finished it for the nth time because of the level design and the overall gameplay and gunplay but I do wish it stuck more to the spirit of the original\r\n\r\n[b] PROS: [/b]\r\n\r\n[list] \r\n[*]  Ashley – jesus Christ shes immaculate here, almost rivals the beauty of Lara Croft from the survivor trilogy\r\n[*] Improved level designs – the starting areas in the levels were improved, the area after the lake bossfight also seemed to be an open world of sorts\r\n[*] Opening village fight – the opening scene where the Ganados burn the Spanish policeman and the ensuing fight was still exhilarating like the original\r\n[*] Good graphics on a 4 gb vram laptop\r\n[*] Parry system – the added parry mechanic made the game faster and is probably best played on harder difficulties [u] (I played on hardcore for my first run) [/u]\r\n[*] Gunplay – much more smooth and fluid than the original (you can also move while aiming! [u] (The original makes u stand still whenever you aim and is really really clunky by today’s standards) [/u]\r\n[*] Overall character models – ada, leon, Ashley, luis, the main bosses all looked really cool\r\n[*] Side missions – made the game longer and that’s ok because its fun\r\n[/list]\r\n\r\n[b] CONS:  [/b]\r\n[list]\r\n[*] Voice-acting: they do a really good job in the acting but it seems that, since the plot is more serious now, they seem muted or dead or lacks charisma and doesn’t really seem alive \r\n[*] Mood - It’s a bit more scary but the original had that campyness to it, like the evil dead film series so I kinda missed that\r\n[*] No door physics – in the original, you can shoot holes on doors, and with those holes, you can also shoot the ganados\r\n[*] Miscellaneous cut content –  wheres the giant Ramon mech scene? wheres the popstar Ashley costume? wheres the P.R.L 412? wheres the ada's assignment mini game?\r\n[*] the ada dlc shouldve been free since it only takes 5 hrs to finish\r\n[*] Resources – why add this? We do not need this but I guess it does leave the player so many choices on what ammo or grenades to craft\r\n[/list]",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Whelp, much like the RE2 remake, the changes made to this one took a lot of the fun out of it for me.\n\nI don't know why they chose to make Leon move this way, he feels like he's tripping over his own feet.\nHow does a gamecube game from 2005 feel snappier and more dynamic then a modern action game by the same company?\nA game where you stand still to shoot? They had a lot of room to expand and broaden Leon's move set and they chose to...make him harder to control. That and strange choices where I'm watching Leon do things when before it was the player doing it....I dunno man, this ain't it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I guess it's not a bad game but I just found it tedious. Halfway through the game I was hoping it would end already. It throws you in the middle of a bunch of enemies constantly and you will have to fight your way through them wasting all your ammo and resources all the time. Then it does it again and again. And again. And again. There's almost zero intelligence in the gameplay, just blast away everything you come across. There are some good moments as well but mostly it's this annoying and repetitive action blasting. I have recently started playing through these remakes 1-4 in sequence and this is the worst one out of them which is a shame because I was really looking forward to this because of the good reviews.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Many of my hours in game are simply leaving it open. This game represents everything wrong with modern day shooters being slow-brained garbage. Everything wrong with it:\n\n- Graphics are atrocious. Absolutely everything is grey and lifeless. Why is this a thing? It's getting tired\n- Obligatory low FOV because that's standard nowadays. \"Hurr durr that thing that restricts your field of view below natural eye levels and makes players nauseous - we're going to keep doing it\"\n- Takes five seconds to reload - the entire challenge of the game is not really ability but willingness to tolerate all the artificial challenges (low accuracy weapons, long reloads, low ammo, awkward player movement)\n- Every vase you break involves a 1-2 second long animation (lol)\n- Other unskippable cut-scenes/animations (should NEVER be a thing)\n- Enemies sometimes have five (or more) second long dying animations wherein you can't tell if they're still alive or where you simply have to wait all that time to pick up the drops\n- Can't strafe\n- Can't jump\n- Reload doesn't work unless you wait until Leon finishes doing everything completely (like switching the weapon, etc) - every single thing in the game is designed to make you wait and prevent you from playing fast\n- Doesn't respect Steam binds - you hit Shift+Tab to bring up the Overlay, and the game brings up the inventory or Photo Mode every single time - then the game doesn't respect Windows keys - you press Esc to exit Photo Mode or what-have-you and it doesn't work. Nope; the one key that's been used to exit menus and things for decades on Windows machines won't work here!\n- Can't unload weapons - if a gun is loaded with ammo, the ammo can't be used in another gun which uses the same type\n- Can't mute the NPC's constant nonsensical chatter despite the dialogue being muted - chatter can be extremely annoying and loud though adjacent walls and things\n- Can't craft while attempting to pick up an item - you have to, of course, given the game, exit your inventory, re-enter, craft, exit, re-pickup the item. lol. Once again, EVERYTHING in this game is designed to make you click and navigate as much as possible and artificially engage you\n\nThis game is a joke. A joke raking in the money for a AAA company because people are getting dumber and dumber.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The part where you have to fight off hundreds of people at once while stuck in the cabin is absolutely unbearable and I will never replay this game solely because of this specific level. It's also about 20 minutes long with no save point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1st playthough i enjoyed, but upon returning to this game i actually realised its worse than the original, its very cheap all the way through with bullets going through enemies, cheap bosses and a boring CP mechanic to try give the feel of replayability. People say its a long remake (even with loads of cut content) but once you realise its just filled with cheap mechanics to long it out youll just wanna play the far better original.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the only positive thing that can be said about this slop is it made me re play the orignal agian.\n\nif you like this game over the o.g I genunily think you should be reported as a domestic terrosist with asbergers as you have no right owning a brain let alone a body.\n\nas far as slop remakes go sorry not sorry this is the second lowest on the totem pole just above the abonation of the silent hill 2 remake. yes this includes the re 3 remake that atlest had the decency to only jerk me off for 3 hours before disapontinly not making me finish compared to this fucking slog.\n\nall the character, sole and charm of the original is gone.\n\nvisual style is traded for visual fedility with no thought or care put into it.\n\nshits cut out.\n\nvo's sound like either mentally handicapped adults or shit you would here in a fan film.\n\nthe core of the gun play has been sucked out to the point where this is just generic 3rd person shooter number 300067.\n\nis you like re4 dont play this.\n\ni only suffered to the end to see if anything would improve but alas like a pedo at a pre school it did exactly what i expected. raped me in the ass and tainted my childhood,\n\nthanks capcom.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a negative review simply to lower it from it's current 97% positive score, as I do not in any scenario believe this is a 97% game. \nI completed the game on Hardcore mode for my first playthrough, and went into the launch of this game with a lot of excitement being such a huge fan of the original. However, by the end, while it was certainly an experience, it is overall a hollow interpretation of the original masterpiece in survival horror. \n\n- Ada is horrible, and while this is mainly due to her voice actress being horrible, it also has to do with the fact that they are not subtle with her at all. That's a bad thing. The original handled her better in that regard in making her classy AND sexy, but not making her seem like a complete hoe either. We already know Ada is hot. We don't need Chapter 10 to open up with a straight @$$ shot to prove it. And... just hire a new actress please, that was SO bad man. (btw, go get the mod on Nexus that overrides it with a new one that sounds a LOT better)\n- Leon is worse in this game than in the original overall. He is NOT bad in this game, don't get me wrong, but they totally changed how he acts in a variety of situations. All of the dude's dorky coolness got replaced with edgy coolness, which I would not say is necessarily a good thing. The OG Leon is always going to be best, but this still isn't terrible. \n- The one liners of Leon's get their own section, as a LOT of them are gone and replaced with new ones. This also is bad, as the old ones were literal gold. The new ones, once again, are fine, but Leon is a worse character for it. \n- The game feels uninspired at times. A lot of Ashley's dialogue feels like it was written by AI, it's just VERY generic. The gameplay, while engaging and fun, is also very generic. You find a lot of other games that do exactly what this game does on a gameplay level, and that definitely takes a bit of points away compared to the very unique gameplay of the original. All of Ada's dialogue definitely falls here in this category as well. \n- Mercenaries mode, what HAPPENED to you?! Why would they put a limit on the enemies you kill? Why? Why would they do that? That is so stupid. It's a fun mode overall, but dang. \n\nNow, while I did say all of those bad things about the game, there were good things about the game that I thoroughly enjoyed. \n- Krauser. They did him SO well. I was genuinely speechless by the time the fight with him was finished. \n- Luis. While I did find him more annoying here than I did in the original at first, he grew on me a lot, and didn't feel like he overstayed his welcome. \n- The atmosphere of this game is VERY well done. It was haunting going through this game, seeing all of the environments for the first time, and of course fighting through the WAVES of enemies infected with Las Plagas. This is probably the strongest point of this entire game. \n\nIt is a solid game, and I had a lot of fun with it. However, this is certainly no masterpiece. I mean, it can't be, it's just a recycled product from the past with a fresh coat of paint and 75% of the charm gone. Just play the OG, it's better in every way, and WAY cheaper. Also, the OG has a WAY better Mercenaries mode too, so have fun with that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "At least now I know that games can contain bloatware too. \r\n\r\nPS: \r\nI am Leon S. Kennedy and they made me look like the backside of a baboon and weigh 400 KG.\r\nI am Ada Wong and sound like the condensed version of desperate housewives. Pimped with frustration and depression. \r\nI am Ashley and exorcise demons with my face every monday.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't progress past chapter 15 (ruins fight) due to an infinite loading screen.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Denovu staying on way too long and scummy mtx dampen an otherwise good remake experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Clunky controls, no dodge button (the bull with the hammer swings downwards and all you can do is stare at it) it's 2025 lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent, dying from stupidest things, ammo nowhere to find same as heal, 50% fightning with knife, cant buy ammo, but you can buy rpg..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Many of my hours in game are simply leaving it open. This game represents everything wrong with modern day shooters being slow-brained garbage. Everything wrong with it:\n\n- Graphics are atrocious. Absolutely everything is grey and lifeless. Why is this a thing? It's getting tired\n- Obligatory low FOV because that's standard nowadays. \"Hurr durr that thing that restricts your field of view below natural eye levels and makes players nauseous - we're going to keep doing it\"\n- Takes five seconds to reload - the entire challenge of the game is not really ability but willingness to tolerate all the artificial challenges (low accuracy weapons, long reloads, low ammo, awkward player movement)\n- Every vase you break involves a 1-2 second long animation (lol)\n- Other unskippable cut-scenes/animations (should NEVER be a thing)\n- Enemies sometimes have five (or more) second long dying animations wherein you can't tell if they're still alive or where you simply have to wait all that time to pick up the drops\n- Can't strafe\n- Can't jump\n- Reload doesn't work unless you wait until Leon finishes doing everything completely (like switching the weapon, etc) - every single thing in the game is designed to make you wait and prevent you from playing fast\n- Doesn't respect Steam binds - you hit Shift+Tab to bring up the Overlay, and the game brings up the inventory or Photo Mode every single time - then the game doesn't respect Windows keys - you press Esc to exit Photo Mode or what-have-you and it doesn't work. Nope; the one key that's been used to exit menus and things for decades on Windows machines won't work here!\n- Can't unload weapons - if a gun is loaded with ammo, the ammo can't be used in another gun which uses the same type\n- Can't mute the NPC's constant nonsensical chatter despite the dialogue being muted - chatter can be extremely annoying and loud though adjacent walls and things\n- Can't craft while attempting to pick up an item - you have to, of course, given the game, exit your inventory, re-enter, craft, exit, re-pickup the item. lol. Once again, EVERYTHING in this game is designed to make you click and navigate as much as possible and artificially engage you\n\nThis game is a joke. A joke raking in the money for a AAA company because people are getting dumber and dumber.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't get through on normal mode, if you want to change the difficulty you have to create an entire new save file. :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I dont see the hype.  Game runs good, looks good, but nothing special.  I enjoyed the movies and the original game, maybe I am getting too old to appreciate things",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "controls are clunky, main character is  ret*****, story makes zero sense because it all in Leon's mind , I somehow still play for unlocks.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "had to go out at 4am to deposit money like a d*** dealer and buy this game and still gameplay was dog**** ngl",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "VR is PS5 exclusive. If you want to play it on the steam version you have to install a mod. Why is VR in the tags?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I am disappointed, i expected that the remake will have \"normal\" controls",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "didnt work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ASD",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ASS",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}