{
  "positive": [
    {
      "review": "Its gonna make you mad and mad and mad and mad and your gonna hate it... 10/10 Would recomend",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "fun but pretty grindy/pay to win, you can still absolutely slaughter an entire lobby with the unlockable stuff it just takes more time and patience",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great game. The flow is good. Its not a super fast run and gun like Battlefield and COD which for me is a huge plus.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Enlisted is a fun arcade shooter-game. The squad-based gameplay is fun and a nice, rather unique thing in a WWII shooter. As far as I know the weapons are realistic and the overall gameplay is really fun, the maps are also nicely made. \n\nBut GOD do I hate playing it sometimes. I spend like 40% of my time actually playing fun and challenging matches that actually feel like what the game was meant for. And the other 60% getting steamrolled because of the bad matchmaking and the absolute worst of teammates. The AI of the bots is awful (running in front off a guy firing a bazooka seems like a good idea to them) and historical accuracy concerning uniforms and weapons is non-existent. The grinding is honestly doable compared to War Thunder. The community is filled with cheaters, sweats and the most unskilled spray-and-prayers known to man. It's not pay to win but rather pay to collect (which upsets me as someone who likes to collect every squad and see what works best), the events often require money to be fully completed AND still have a life. Also a lot of players hate on snipers and mortarmen who take their job seriously, they think everyone should just charge the objective even when their literal role on the battlefield is to keep their distance.\n\nAbout the matchmaking: I think the BR-system is just an awful system. It works with War Thunder but is so bad for the realism and gameplay of Enlisted.\n\nBut beneath all of this nonsense is still a really fun game that I will just keep playing no matter what. I somehow always circle back to this game and I will always love it and hate it at the same time.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "This is an fps.\nBut it is also a squad skirmish game where you command borky drone soldiers, who are mostly useless, but will occasionally surprise you by headshotting an unaware player, or bayoneting a guy who was sneaking up on you, and you can body-swap between them like some sort of self-willed collective death-wish made manifest.\nUnlock an engineer squad asap along the top rifle row of your chosen nation's research tree, so you can place spawnpoints; this will help you win.\nAnd level up your basic rifleman squad initially so you can max it out to nine men; you will cap points way faster with the numbers.\nAlso, sandbags and barbed wire are great; use them.\nAnd be conservative with your silver; if you spend it all on misclicks and dumb shit you don't really want, you will have to wait for the battlepass level refresh, or else shell out some money, or worse, try to WIN, as you get a little silver for winning.\nNo silver for losers.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun, good visuals, great choice for a free to play game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "TL:DR fun and unique with a LONG grind don't spend your money\r\n\r\nThis is a very unique title, the squad aspect of gameplay makes it a mess of fun and allows for some stuff that really never happens in more typical shooters. Enlisted is also a fast paced experience, the players who do well are very aggresivley pushing and this makes traditional moarters and snipers struggle to have much of an impact.\r\n\r\nthe progression\r\n\r\nGiven this is a Gaijin title there is ALOT of grind, I'm a PS4 player with 900~ hours and have yet to unlock everything, speaking of which there are 100s of rifles, (both bolt and assault) SMGs, LMGs and heavy weapons giving more then enough for whomever may want it and basically being warthunder's little brother there are a mess of air and ground vehicles to play with too.\r\n\r\nthe scene!\r\n\r\nA large variety of gamemodes make for many ways to enjoy the ebb and flow of a fairly diverse map varaiety, alot of which are pretty good! The inclusion of all major theaters of WW2 is fun though some hardcore historians may find King Tigers in tunisia upsetting.\r\n\r\nthe players\r\n\r\nThe community is fairly nice, some more, *enthusiastic* players but you can often see players doing goofy stuff (BR5 T 60s rejoice) but do your squadmates a favor and don't leave your mic on, Gaijin is doing an alright job maintaining things, very frequent events that shake up the way you approach the game and \"supply drops\" lets players have a fairly reliable side quest (things like turn conscripts into mist) with a final thing in monthly battle passes with unique weapons +camos for those who invest some gold (premium currency and on that note)\r\n\r\nMoney!\r\n\r\nThis game has bad monetization, like Really bad... you can purchase some \"premium\" stuff, firstly squads, these are some unique dudes with rare or unique gun/vehicle! these whilst being fun are not worth it, they are comicaly overpriced and add minimal content, they do speed up progression but its only while using that squad so its very limited, another way is by just buying premium tokens ~gold~, these let you buy the full battlepass which upon completion gives a full refund +50 allowing a way to actualy earn some gold! the last and most likely best way is via purchasing premium account time, 2x progression, simple as that!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "it doesn't have controller support at all but it is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot like Call of Duty, but better. Feels like I'm playing WaW again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game love the one man squad you can just controle an entire squad with the push of the Y button you swap to a different member in your squad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game has it's own share of problems, in my opinion, but i am very positive towards it. \n\nNegatives:\n\nMy biggest problem with it, is heavy monetization, which excludes quite a lot of interesting weapons, planes, tanks or stuff like that. There was once also a problem with cheaters, but i THINK, it might be better now. Grind also can be....long. The cost of upgrades or buying stuff with silver (currency you earn by playing) feels really unbalanced. As in, what you earn and how much some things cost feels completly shit. I also wish there were more weapons (less known or more obscure ones) in the tree as well as tanks.\n\nPositives:\n\nDespite that, i must very commend the events, in which you can earn, by simply playing, the uniqe weapons, tanks, planes or squads, many of which are simply amazing. Even the battle pass is half free (as in, some of the positions in it you can get for free by playing, without the need of buying the pass). At the end of each pass, you get a free uniqe weapon too, which is nice. The events are too, very often and common.\n\nSquad mechanic is fun and shooting guns is really satisfying. Tanks feel heavy and powerfull, yet vulnerable to infantry if you are not carefull. Planes are extremly usefull, yet quite easy to shoot down. To sum it up - it is fun.\n\nAnother huge positive is.....simplicity. It is so refreshing to play a WW2 game, where you don't see abysmall or weird skins of weapons or soldiers. I really fucking missed it, especially after the shitshow with H&G (heroes&generals. I still miss that game.).\n\nOverall, my opinion is positive, with few problems or gripes i am willing to overlook. Not once i paid for anything here and i still enjoy it a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enlisted is a tactical World War II shooter that delivers intense battles, customizable squads, and a strong sense of realism — all without falling into a pay-to-win model, since progress relies far more on skill and strategy than on purchases. The game is also updated frequently by the developers, who add new content, balance weapons, and improve overall quality, keeping the community active and the gameplay constantly evolving.\nDespite its strengths, Enlisted still struggles with a matchmaking system that often creates uneven teams, placing new players against highly upgraded squads or mixing experienced users with under-equipped teammates, which can lead to lopsided battles. This issue is compounded by the weak AI that controls your squad members, who frequently expose themselves unnecessarily, fail to take cover, and react slowly to threats. In some matches, entire teams may be filled with bots, and these AI-controlled players tend to perform poorly, contributing little to objectives and reducing the overall competitiveness and immersion of the match.\nEven though these issues exist, I still enjoy Enlisted a great deal — it’s genuinely fun to play, with chaotic battles that keep the adrenaline high. Sometimes I wish the game had a slightly slower pace to better appreciate the tactical side of combat, but in the end, I remind myself that it’s portraying the intensity of war, and that fast, unpredictable action is part of what makes the experience so engaging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is awesome and i love it. it is very immersive and realistic and helped me better understand war for school definently worth the 50 gigs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game\n\ngot to be japanese and kill americans\n\n10/10\n\nwould kill americans again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game the graphics are great and uhmmm it`s good ig",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a solid ww2 experience with a awesome tier system to break up the lethality of the fight.\r\nthe way they give you a hole quad to play as is also intriguing. a bit annoying when your the only one who makes the charge but it gives a sense of realism in how it not so easy to make the distance. the endless thrill i get from each match vying for control. its a solid game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "enlisted is a good game. and if the win labor of love hopefully they will add linking your acc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game, sometimes buggy and sometimes the its not very well balanced",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most unique games around.\nStill satisfying to play 5 years on.\nGreat fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fun becuse you get to replay the wars and its first person shooter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "alright game great for ww2 enjoyers, but the game a a bit grindy and at some points there's a bit of bs involved",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game via the actual launcher but absalutly love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun, love the skill tree aspect and the satisfaction of sniping people across the map.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top 5 favorite shooters I've ever played if I'm being completely honest. Incredibly satisfying shooting and scratches my WWII nerd brain so right. Really great mix of PVP and PVE that makes it perfect for casual play. The progression is fun and fair and the devs are very consistent with adding new stuff to keep the experience fresh. Best $0 I've ever spent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very very enjoyable and is really good for having a fun couple of hours as it almost never gets boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has a neat and new, as far as I know, squad mechanism so you aren't necessarily dead if one of your guys dies. They continue to add new stuff and not entirely pay to win. There are many things to do and many positive things, and I could go on for a long time. It's a fun game that can be addicting. It's also free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great visuals for a free game, stood the test of time, great gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is everything I thought it would be its like if War Thunder and battlefield mixed. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game and good grapics and its realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a really good game it lags when in battle sometimes but if you have a desent laptop like me or pc then you should be fine also its an amazing game for its price controls are a little anoying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On of the best war games I’ve ever played, really fun and enjoyable. I’ve spent over 1.5k hours on it, and I’m still enjoying it every time I play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐️⭐️⭐️⭐️☆ | Enlisted — A Beautiful, Immersive Experience (With Some BR Frustrations)\nEnlisted quickly became one of my favourite games thanks to its excellent graphics, deep immersion, and the attention to detail in every aspect of the gameplay. Whether it’s the sound design, animations, environments, or weapon handling, everything feels crafted to pull you straight into the battlefield.\n\nHowever, the Battle Rating (BR) system can sometimes be frustrating. There are moments where you get matched as BR II against BR IV or even BR V, and those fights feel unfair. When the matchmaking lines up properly, the game is amazing — but when it doesn’t, it can get a bit discouraging.\n\nStill, despite that issue, Enlisted remains one of the best WWII shooters out there, and definitely a game you need to try if you enjoy immersive large-scale battles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, always new events and updates releasing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty great game with friends, graphically good and combat is fluid, what more to ask for.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "surprisingly one of the best optimised FPS games on steam.\r\nsimple WW2 FPS that balances well with weapon tier matches that prevents poorly equiped players from being steam rolled by high level ones.\r\nthe main advantage Enlisted has over any FPS game on the market it how well it is optimised compared to other triple A title games in the market and surprisingly how well the game plays on any PC.\r\nyou don't need a high end GPU, i started playing this game on my intel iris laptop.\r\n\r\nand its fun to play with friends too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, challenging with many variables of squad options. It's a grinding game, worth a while to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have 10 days of playtime in the game. Unfortunately, I used to play with the launcher. It's a great game that has interesting and varied events and, most importantly, it's free. Of course, it has very expensive bundles and you should expect a player to fall next to you with an umbrella and blow your head off with an expensive gun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fair play for a free to play game and 9 hours deep, I didn't think I would enjoy it as much as I did, the whole AI squad mates that you can take control over after dying is an interesting mechanic in which it played out well for me but also my enemies. one shot, one kill is always welcomed but the dropped system and reiving makes sense.\n\n+edit+ \nWanted to add that match making is the quickest I seen for a online game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A lot of people don't actually understand this game, how weapon tiers works, how to utilize building in attack or defense modes and many more things, they just default spawn run forward and die all the time therefore thinking every match is full of hackers witch is not true. If you use at least 0.01% brain and actually try to understand things its a fun and decent game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS FREE, ITS FUN AND COLABORATIVE. of course if you paid, you win....some times. the handyucap its good, the events relative easy. the coop mode its good, but the sensation in combat , for me, its exite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Gameplay and Mechanism, you play in squad of yours. The grind so far is good but need a little bit time to get for top Tiers. War Thunder in Infatry modes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, I am coming from H&G and was looking for the replacement...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "war thunder, but actually fun cause you get to be a soldier. I am a femboy. At lowest graphics still playable on cheapo computers!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enlisted is perfect for you if you're not into the \"run and gun\" style of popular shooters like CoD or Battlefield. It's a chill and fun game, especially with friends! This game offers a different experience with it's squad system which works well, allowing you to play different armies of WWII. The best part is: Enlisted is completely free, you can unlock new weapons, squads and tanks just by playing. If you're looking for a fun WWII multiplayer shooter game, just hop on in!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is gotta be one of the best games i've EVER played the combat is crisp and the researching system is awesome and diffrent i highly recomend playing this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great free game. Reccoment it to people who want to play bf6 but are poor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you get the ball rolling and have a thousand hours in this godforsaken game and have all 4 armies fully researched, every squad full of 3 star lvl5 soldiers and get so bored you waste silver to make a squad with only soldiers named John(3 stars required), then the game is good.\nGet yearly premium only during Christmas discounts\nThe monthly battlepass costs 900 gold, and it pays back 950 if fully completed, allowing it to buy itself back the next month.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "constantly being updated and improved. it's a fun game but a bit tough at first until you learn different strategies and play styles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best part of the game is when you mark the enemy and the pilot misses the target. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one I would indeed reccomend. It is indeed the only ww2 game that goes into the truly gory details of the war, and has given me several striking moment, such as when I walked out of building into a porch covered with burned and charred dead bodies. However, I must criticize the monetization and the lack of historical authenticity at times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fps game with a great moding community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best war simulators I've played yet. My only issue is the large amount of expensive micro transactions for little reward.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good shooter, as a fan of the old battlefield (up to the 4th part + 6th) I liked it. Once I read guides like \"the balance is broken, if this happens, you need to immediately leave the game, if this and that, then your family is sick with AIDS, etc.; Play only for such classes, others are useless and if you play for them, you will lose 100%) and fell into despondency, but it's all nonsense! If you are good, you will drag any class.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game turns people into either communists, nazis, and also starts an adiction to world war two things (it gives autism)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, good graphics, option to turn gore off if you'd like. Great difference in scenarios and maps. Very fun and would reccomend as its free!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very cool game nice graphics and overall fun to play and all I would say is just try and learn the game take it slow and practice and you'll get good at the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty fun, I wish there was a quicker way to upgrade perks, it has auto allocation but it's finnicky...\r\nThe four different regions you can play as are also cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably one of the best battlefield shooters I've played. Can be a bit clunky at times but it's very fun with a deep progression system and squad mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best war games on steam! I play longer and longer each day. I do wish they added rain and snow, other than that, I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and historical, love getting into battle and performing to the best I can. overall a great game, would highly recommend to people who enjoy progressing through historical battles and sometimes quite cinematic\r\n\r\n10/10 on my scale of all factors in the game, especially now they added some of the first ever jets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, Great idea, play for free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a really fun game, reminds me of heros & generals.  Could use a body slider option, and gore could be turned up a bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7.8/10\r\nEco Okay\r\nGameplay Good: Funfact if you dont have 24h to play dont play BR V Stay BR I to IV What suits you\r\nPoint Eco Bad: for example you get nothing for holding a point without killing an enemy so if you singelhandly hold a point so your team can kill 600 of the 1000 Enemys you get nothing Teamplay is almost not Rewarded yes you only get Points For Helping Revive and kill Assits But thats it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the grind is worse than war thunder, and im not even past tech level 4",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unfair and unbalanced, mg spam op. sooooooooo funny tho, 10/10 would reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good but also not two complicated warfare game. Great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an online war game that allows you to mod, you can play battlefield 6 here for free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Uh I shot a guy and he died. And that I shot another guy and he also died. Then I got shot. I died.\r\n\r\nFun game, 10/10 would get shot again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I know it wasn't my review, but the Dev is making strides towards fixing the cheating issue.  Swapping out my negative for a positive due to these efforts.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really realistic and extremely fun. I would recomend this game to almost anyone, as long if you have a good pc, as it can lag your game at times. But overall, a great game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best free games, super great gun combat, you can play with your friends and much more, I suggest you check it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Really love the graphics of this game, evn tho when it's free. I recommend this game for any War nerds. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun but runs on high graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun until...\nThey spawn camp u with japanese sniper 10/10\nThey spawn camp with Derp Gun Tank 10/10\nTheres Panther in the middle of the road and no one cant killed it 10/10\nA very good player that do bombing only 10/10\nThey build a fortnite base in a capture point 10/10\nTripwire everywhere 10/10\n\nTry this game its fu................\n.....................................................\n.....................................................\n....................................................d.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enlisted is probably one the best FPS WW2 shooters that has that OG Arcade style while also that arma realistic feel. As a veteran I greatly enjoy this game for its semi accurate combat system to real pew pew stuff. \n\nIt is a perfect game to play w a community or clan as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its actually a pretty fun sniper game but I question whether the game is actual players or bots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "War Thunder with infantry, good blend between armoured combat and infantry combat, could do with better animations for bayonet charging etc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Accurate WW2 FPS, enjoyable experience. Unfortunately, Gajin made it to the point where you'll spend a few hours grinding on tech trees and only get more and more bolt actions. I have barely gotten to the M1 carbine. However, this game is a ton of fun and I would recommend it to anyone wanting an enjoyable WW2 experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun and easy to play game. Though it can get rather repetitive. I really enjoyed unlocking new weapons and reacting battle scenes. I would definitely recommend playing this game with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This brings back the nostalgia feels from playing Heroes and Generals.\r\nIt is very in depth and yet still retains the fun arcade and janky feel of H&G \r\nThis is a win for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but the timer when you run out of reinforcments sucks you should just have no more respawns not a stupid timer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, and it's free! I've had much more fun playing this that, for example, Battlefield V.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "though some graphic issues its very enjoyable and good for a grind type game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Queue for first game,\nSpawn as based axis,\nOn Normandy,\nAs any cultured man would,\nHop on mg42 in bunker,\nProceed to slaughter 186 allied plebs and win the game,\nBig W.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good and realistic, fun mostly, but the only problem is the AI in your squad. The AI in this game is horrible, they don't fight, they just or get stuck at a wall or stare at the enemies and don't shoot them, they run into bullets and look in the wrong way its a waste of reinforcements. Otherwise the game is really fun and exciting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game but I wold love to you gays ad that buildings can get dammed or destryed from bombs  I highly recommended this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, glad I finally tired this game.  Didn't think it would make it but after games like WoW and WoT this is a nice change.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish there was a neutral option for recommending games here. I'm enjoying my time, and if you like history and milsim games it's fun. However, the monetization is extremely predatory and they shove your nose in it even if you buy the premium! I KNOW IT'S RUNNING OUT LEAVE ME ALONE EAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHHHH",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game in theory, but in practice it is not playable enough because of weird policies of matchmaking, deckmaking etc. There is an option to play as any army but somehow you can't play with units of different BR depending on matchmaking, so, for example, if I want to play Battle of Moscow and take BR2 I will be sent to Berlin too! WTF? It is ridiculous. Even more so when playing as Allies when squads of the UK and USA of different times can play together both in Africa, Europe or Japan! Like cmon, why doing this? What is the problem to let you join a game of certain BR and let your units change gear automatically?? change their presets automatically, change squads too, so African M3 Grant will not fight in Japan or Europe. It is sad to see how such a nice project gets left unfinished for the sake of keeping income and making other projects...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, especially when you're constantly in action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enlisted is a game that offers a unique take on the World War II shooter genre by emphasizing tactical gameplay, squad-based mechanics, and historically accurate settings. It does a great job in terms of recreating the chaos of war, with plenty of customization options and a wide variety of soldiers, weapons, and vehicles.\r\n\r\nHowever, the game is not without its flaws. The progression system can feel slow, and there are issues with matchmaking and player balance that detract from the experience. The monetization system, while not overly intrusive, can also be frustrating for players who want to level up at a faster pace.\r\n\r\nOverall, Enlisted is a fun and challenging experience for fans of realistic shooters, but it’s not perfect. If you're a fan of tactical shooters and World War II history, Enlisted is definitely worth checking out, but be prepared for a grind and occasional frustration with matchmaking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i only recommend because i still play it but its both a yes and no. at its core its a great game. you customize a squads and play them and there are a lot of options. sadly the maps are extremely unbalanced and allows for a lot of exploiting such as tanks hanging of the map where no one can go and pelting the point. the american team always plays like trash with no team work and gets steam rolled. the german team are really good and steam role and the japan team is filled to the brim with cheaters and the devs dont address it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game, but i would recommend another map, or new somthing to keep it exciting!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First don’t play this game if you are unable to work in a team. If you just play for the kill count/ ego inflate, there are plenty of run around the map games out there, go play them. \nThings to know before playing or playing and then complaining during the game of how your team sucks because you have the highest kill count and are still losing. \n1.\tBattles are not perfectly balanced or should they be. = Challenging. See point 2\n2.\tTeamwork is only way to win = How the world works get use to it.\n3.\tYou will need to learn how each aspect of the game functions to play better. = Your, brain use it.\nIf you can deal with these 3 easy requirements then Enlisted will be fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely amazing game, I could not play cod ww2 but when i heard about this, i dowloaded and played enlisted. When did killing became so satisfying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enlisted is a pretty good game, sure sure Gajian MAY also put gooner tanks in here, but for now it's a very good early and late WW2 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing, the mechanics. the sound quality even the mannerisms the soldiers have when rushing onto the battle field, you can be a rifleman, sniper, tanker. It can run smoothly on laptops with 16 GBs of ram. Definitely worth the 50 GBs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent wwi game, good for 0$. shit ton of micro transactions",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Lots of fun, very grindy and can sometimes be frustrating like any FPS shooter. You have to work as a team most of the time to get through objectives. Overall, it's great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a free game its not bad. Don't sink time into the German tech tree though, Japan is superior",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I used to  love this game but its absolutely filled with hackers now and Gijin is not doing a thing about it.\nI really miss the old days of this game.",
      "voted_up": false,
      "votes_helpful": 40
    },
    {
      "review": "This game is great but hackers make most matches unplayable",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "If you want to keep your sanity dont play this game if you have already lost your sanity like me feel free to play this game. Also every time i play this game i want to crash out!",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "As much as I'd like to recommend this game... here are the reasons why I don't:\n\n1. The most serious reason - the praised \"squads\" you control are nothing less than cannon fodder and some sort of backup if you fail to break through enemy positions by yourself. Your AI squad members do absolutely nothing... they just stand around gazing at the enemy while some player mows them down with a submachine gun.\n\nWhich brings us to the next point ....\n\n2. Submachine guns in this game are shamelessly overpowered. The Russian and American ones, which are far superior to the German and Japanese in terms of rate of fire, almost never miss and sometimes you get shot over a distance where even a bolt-action rifle can have a problem. Combined with the sheer stupidity of the AI teammates, it's often enough for one player to run into a room with a submachine gun soldier and wipe out your entire squad without you even having a chance to react.\n\n3. The tank battles... or something like that. If you think the tank battles in this game are atmospheric - think again. Often your own bullet gets stuck in an invisible wall while the enemy tank uses that to shoot you down. The most distressing part of the story is watching as you are repeatedly thrown back into the \"soldier selection view\" hit after hit, because one of your tank crews dies every 2 seconds. \nFurthermore, you can usually hardly drive further than the spawn point, because either the first gas-crazed soldiers with their bazookas/anti-tank rifles are already waiting for you, or explosive assassins simply run towards your tank, because we cannot assume that the 12 AI soldiers around your tank have even the slightest incentive to protect your tank. Also every hole in the ground may be the end of your tank adventure.. may it holes in the street or artillery bombing craters... once you fall into one of these you're done. In addition, on some maps, the \"allowed\" zone for you to navigate in is so small and inhospitable that you should forego to use a vehicle in the first place.\n\n4. The lobbies are usually full and matches load fast, but missing \"real\" players are simply replaced by bots. The team with more \"real\" players wins. Period. Because more \"real\" players mean more markers. More markers would give you, as a tank commander or bomber pilot, the advantage of actually being able to see the enemy, or at least get an idea of where the enemy tanks are going. Therefore - no markers means no tactical awareness - means you have to be on a lookout for so many threats that you easily get overwhelmed by one or two enemy soldiers blasting you off the map with TNT or whatever they carry.\n\n5. The render range for effectively seeing anything as a pilot while flying towards the combat zone is ridiculous. I fly an HS129 with a 75mm cannon... no bombs... so I have to hit the target directly. This is quite difficult in two ways: \n\na. Almost nobody marks enemy tanks or guns.\nb. Independently identifying targets becomes very difficult with a 1000m view range. It's not fun. \nAnd even if you manage to get the hang of that.. after killing of 10 tanks in one match didn't make any difference thanks to 90% bots in my team.\n\n6. Pay to Win - You can easily buy equipment, or even entire \"squads\" that then show up with unnaturally bizarre weapons or vehicles. Why research new equipment when you can simply buy submachine guns and sniper rifles?\n\n7. The entire squad system is utter g**bage. It's great that you can eventually have a radio operator, machine gunner, and maybe even an anti-tank gunner in an infantry unit, but it's completely pointless if they get shot at the first enemy contact without having done their job – there we are again with the incredibly s**pid AI. I've started shrinking my squads to a minimum to reduce the \"gifted\" kills for the enemy. Unfortunately, that defeats the purpose of the squad system and feels restricting.\n\n8. The game mode \"Annihilation\" in which one team has to plant explosives and the other has to protect these explosive locations... defusing the bomb, once it's armed, takes so long that it usually doesn't make sense to fight for it at all... So you have to retreat and hope that your teammates manage to hold the position properly this time, while you desperately try to set up sandbags and ammunition crates as the engineer. Building up a MG Squad also just does not work well as no one cares for guarding the flanks. \n\n\nI loved the game at first... I played it for 8 hours a day, without a break. I reached Battle Rating 2 and realized that my team's skill level hadn't changed at all. I assumed that at least there, the players would have a bit more sense than what I saw at the beginning. \n\nAlthough there are moments when I really enjoy it, I'm finding myself increasingly frustrated playing this game. Not because I think the weapons are unbalanced or the tank battles are buggy, but rather because the advertised team and squad system simply doesn't exist. For example: tanks aren't protected. Enemy tanks aren't marked. Enemy planes fly around the entire battle, destroying one tank after another—nobody seems to care. No interception attempts are made, no anti-aircraft guns are built, and there's simply no reaction to the current situation - ever(!).\n\nWhen you realize enemy tanks are breaking through the middle, your own tanks are wasted instead of setting up an ambush. Positions aren't adequately protected, and communication in this game only happens in 1 out of 20 cases. In War Thunder, you can maybe help your team coordinate or warn them of dangers with targeted messages—but in Enlisted, it's pointless because 80% of your teammates are AI bots throwing themselves into enemy fire anyway.\n\nNo, I can't recommend this game in its current state, even though it has good graphics and a great atmosphere. Unfortunately, the gameplay doesn't offer anything that would keep me playing long-term. As long as there aren't any decent ways to better coordinate the entire team and as long as missing players are replaced by bots, I'm sorry.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Not enjoying this one at the moment, I'm finding the matchmaking to be somewhat unfair (my opponents always have better weapons than I do), and my AI squadmates have the aim of a naked mole rat, whereas my enemies seemingly have aimhacks.\n\nHit a tank from point blank in the rear with a anti-tank grenade, did nothing. Enemy tanks can also sit out-of-bounds and fuck your team up without fair counter-play, as when you try to flank it you are auto-killed.\n\nHaving a shit game with shit teammates? Too bad, according to Enlisted you're the problem and get labelled a \"deserter\" for leaving any game and are penalised in future games.\n\nThis game was fun before they imported the \"Battle Rating\" system from War Thunder. Now it's blatantly unfair. The BR system needs a massive rework for matches to be fair for all players.\n\nThe whole game now has an air of \"no fun allowed\" attitude.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They sucked every last ounce of fun out of the game after they fuzed all the campaigns together into one. This completely screwed over the balancing and made it incredibly difficult to have any fun due to the Americans having access to far better weapons earlier than the German side, meaning you are bound to have far more worse equipped enemies if you are playing as an American.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "What a terrible game. Cheaters and just AWFUL gameplay.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played Enlisted for 28 hours with a friend.\nMe and that friend got to know each other from the *good old days* of Heroes & Generals, which was also a F2P WWII FPS+Strategy online multiplayer game.\n\nPeople like to complain about how grindy Gaijin games are, but I feel like H&G might as well have been grindier than this.\nThe graphics definitely beat H&G and at first glance it is amazing to see dozens of soldiers rushing in at the start of battle.\n\nBut that is only at first glance. The “Squad” system the devs are so proud of is really awful. You spawn in with a group of soldiers and directly control one of them; the others follow you or move towards a position you designate.\nHowever, the maximum range you can move away from your squad before the “orders” are cancelled and they follow you again is somewhere between 30–60 meters. Which is kind of crap.\nThough I could see they wouldn’t want someone playing sniper to just send in the cannon fodder [bots] to see where the enemies are shooting from.\n\nEither way, the AI is very dumb. They mostly just stand around and do not fight nor seek cover adequately, so it is just a bunch of easy kills for both sides. Though they do have some unfair mechanics— I tried to bayonet a bot that was facing away from me, and it turned around 180° and knifed me before my bayonet animation could even halfway complete. You can call it a skill issue, but I find it to be bs.\nIt also sucks that although you can add soldiers for different roles into a squad, as they will be AI‐controlled, chances are they will die on the spot the moment there are enemies nearby. Wasting your precious Engineer, AT‐gunman, radio operator or what have you.\n\nThe community also isn’t that great imo. I am in the lower battle ratings (matchmaking tiers), but I see from other people’s reviews that things don’t really change much in the higher tiers. It’s the typical situation of where an objectives‐based FPS has a bunch of players who just treat it as an ego shooter and don’t bother with the objectives.\nThis is not specific to Enlisted, but it is worth pointing out that this problem also exists in Enlisted.\n\nA lot of the controls are also really awkward and feel clunky. I was happy to finally get some binoculars to more easily spot and mark enemies, especially tanks, but the default keybinding is the numrow 8 key. And the binoculars do not have a scope/use mode with RMB, you need to unequip the binoculars with its or another weapon/tool’s key to move unencumbered, as the binoculars slow you down.\nThankfully, the keybindings can be remapped, but it still baffles me. Likewise, using the MG in a tank uses the Spacebar. It’s mind‐boggling.\n\nA lot of reviewers also complain about cheaters. Honestly, I have seen some unfair play where people were cheesing some stuff like glitching through some weird places making themselves some really nasty camping spots, scoring top of the leaderboard and no one does anything about them— but that isn’t hacking, it’s just abusing known weaknesses in the game.\nI have played with some people who just have excellent game sense and can spot you with just two or three pixels on the screen. I was screensharing as I was playing, and a friend who was not yet playing the game pointed out where an enemy was and slowly told me where to aim and when to shoot, and I got a kill. On a player I would not have seen at all. So I figure the game probably has a lot less hackers than people say it does and it is just salty players who suffer from “skill issue”. I got shot through a wall one time and assumed it was someone using a wallhack, but maybe there was that one tiny crack between the planks that they could see me through— I’ll never know.\n\nAll in all, it’s nice to have something try and fill the gap left by RETO-MOTO shutting down and pulling the plug on H&G. For casual use and play, it looks really nice compared to some other free alternatives… but the gameplay focused around squads just sucks. Some people make custom matches where squads are disabled, and others simply bear with it and designate a point behind some obstacles in hopes that the bots will stay out of view and will serve as a quick respawn point for when the character you are controlling gets shot down (you switch to control one of the bot‐controlled characters when you do).\n\nIf what I and others brought up don’t sound like a dealbreaker to you, go ahead and have fun.\nOtherwise, I suggest you play something else. There aren’t that many active WWII shooters, but there’s plenty of tactical shooters to play.\nAnd, your time is precious. Maybe shilling out some money for a game is better than grinding and doing unpaid work in a “free to play” game for hundreds of hours, when a day’s worth of work gets you a full game or two.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "every other factions anti tank weapons = 1 shot enemy tank.\r\nGerman anti tank weapons = literally does nothing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not balanced,  just got a br1 rank equipment and fought a enemies with br2 max, bunch of mfs camping with sniper and tanks , the only good with this game is just a custom matches",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you thought Warthunder was a grindfest you haven't seen nothing yet. This game while unique, allowing for full squad customization and the ability to switch classes when needed, has some critical flaws that just about ruin this game for me.\n\nThe elephant in the room is of course the progression, it's not horrible by any means but there is so much 'feature bloat' filled with useless weapons that stand in the way of the fun or appealing equipment. Like imagine you're going through a skilltree, at the start is a piece of junk and towards the end is a literal ak-47. You have to go through gun after gun, like 3 mp-40 variants, or 3 BAR variants, that are just slightly different to a near pointless degree(I.E: No bipod, bipod, lower firerate semi auto mode?) Or worse yet, you try to get that one Br IV smg for your faction only to end up researching 5 br III equivalents that are all mostly the same ugly pieces of boring shit, or are literally just BR 1 weapons with a slight upgrade. I shit you not you get the Beretta m8a in the first tier, and then you get the 40rd variant in the third tier, at the same point you'd be unlocking heavy 100rd machine guns. And while that seems fine on paper, this 'BR' system is what measures your matchmaking level, so you could literally end up with a BR 1 gun and have the equivalent of a slightly weaker BR 3 loadout, or vice versa, only to end up against much weaker or stronger enemies.\n\nPair this with the fact that you usually get matched with people in a much higher or much lower tier than you, and you're likely going to have a horrific or boring time. Imagine unlocking a new gun or squad to try out, only to find out equipping it means you have to go against people with much better weapons than that new weapon you just unlocked? It's not gamebreaking(most of the time) but it is annoying to go up against, especially after trudging through the lower tiers, only to find out you need to trudge through that cesspool more, or end up on a team that has weaker weapons than you, and against a team with much better weapons than you. Actually that's not even the worst part, steamrolling a team that got on the unlucky side of poor matchmaking is a match that can feel particularly lifeless, especially when they don't have any form of good anti-tank/anti-plane, literally preventing you from getting a turn on some vehicles, if someone is not able to be killed.\n\nThe amount of times I have been put on a team made up fully of aa-tanks, and bolt action rifles, is actually astounding especially since i'm currently firmly in BR III-IV, this is the same tier as the mg-42, and some stg variants, how the fuck is there still fully unequipped rifleman squads in my lobbies?\n\nAlso the events, they're complete dogshit, the only reason I think people play is for the rewards, same goes for me. Afterall you can get strong weapons and squads allowing you to use paratroopers without buying dlc, or equip a smg as a pistol and not be forced into a higher BR cause all pistols are considered BR 1(despite there being a clear tier of bad and good pistols.) But recently with the last three events the rewards have been absolutely atrocious especially regarding the event you have to play. Italy vs Britan was just BR 1-2 (aka the shit guns and vehicles.) Paratroopers was enjoyable, but annoying whenever anyone camped AA as it just made your paratrooper squad unable to be, y'know... paratroopers. \n\nThe current event, is especially atrocious, I have to watch as my team prones on top of stairs and spam melee just because this is the only enjoyable way to progress besides being extremely sweaty or running out of ammo or health way too early, especially when enemies get added that have way too much health to be enjoyable to kill, for minimal progression. \n\nOverall I don't recomend starting this game unless it's a good event to give you some good weapons or squads, or a 'shortcut' through the progression. The only reason I even still play is because I got lucky and played an hour of the game right as it came out, unlocking a good chunk of the grind for me early, as well as giving me tonnes of silver, soldiers and weapons allowing me to effectively skip BR 1 completely. I cannot even imagine what players who just started have to go through to get here, especially with how BR II, and III can feel.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Used to be a great game. The sniping felt really good and the whole planes vs tanks vs infantry used to be really fun. Getting a Stuka dive bomber and bombing tanks and infantry while getting shot down by a Mustang was peak gameplay. Unfortunately, it is completely full of cheaters at this point. Also with the new Battlefield 6 release, its about dead on top of the cheating issues. A year ago I would have recommended, but i highly do NOT recommend it at this time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cheaters, exploiters and the terrible matchmaking makes this game almost unplayable...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Less content and worse performance every update",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i used to play this on xbox a few years ago and it was no where near as bad as it is now. yes there were basic issues, people spam killing, try hards, pay to win, but now... this game is fucking cancer most the time i cant play a game without someone fucking spam killing me or fucking straight cheating. this game NEEDS A PROPER RANKING SYSTEM ! and the pay to win aspect need to be evened out or some shit cause its beyond unfair to people who grind get points, get new gear, level it up, save coins, all to just not even be able to use the shit you have worked hard to get. And most of the player base are assholes that never talk or help each other out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "8/10 - good game. good performance, decent graphics, and my pc didnt hate me. 8/10.\r\n\r\nhowever that score is reduced to 2/10. due to its community/playerbase. predictable, boring, repetitive, abusive and about as toxic as a politicians toilet bowl, some matches are just not worth playing.\r\n\r\nsame issue as with all pvp games - The community/playerbase. same community as all other pvp games. you will encounter one or all of the following four player archetypes:\r\n\r\nthe tryhards who will consistently one-shot you no matter what, and will guarantee a match loss if they are not in your team.\r\n\r\nthe newbie who has no damn idea what he/she is doing and will abandon the game after a few matches to go back to call of duty or something thats actually fun\r\n\r\nthe hacker/cheater/exploiter, a mix of someone who doesnt cheat, but also has no life and consequently knows exactly where you are standing at that precise moment you get behind *that* one building.\r\n\r\nthat one useless idiot who has exactly zero hours in game, but 500 hours on the forums who will, when you ask for help, spit out some variation of 'lol just dont suck lol' despite their own lack of gameplay.\r\n\r\ni remember why i hate this game so much. as with all pvp games - beautiful execution, but a community that makes it effectively unplayable. a wonder of graphics, physics and incredible gameplay, laid completely worthless due to the fact its community has the equivalent personality, value and humanity that exists within a truckload of dead rats in a  tampon factory.\r\n\r\nA fantastic game - but as per usual, it wasnt worth the money. and i never spent any. if you like these games and can tolerate the other idiots who play it, its a solid 8/10. if you dont like what i mentioned, its a 1/10, dont waste the disk space.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is horrible. I mean horrible.\r\nThe AI is clumsy. They don't defend well. They can't attack well, the AI literally just lets people kill them.\r\nEverything is locked behind a pay wall. You have to work. You have to grind really hard with crappy guns just to even get somewhere. But the game throws you in with people that just use shotguns and use overpower weapons that you have no chance in hell with.\r\nThis game is not worth playing. It is not. Worth it? Don't spend your money on this game. Is distressful and not worth playing\r\nYou'll get a lot of teammates that don't know what the hell they're doing. They won't get objectives, they'll just fight. And literally the AI is really dumb. Don't play this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't really know if i really like it or hate it. It is a decent choice if you want battlefield 1 for free basically, but the unfair matchmaking that matches br1 bolt actions against walking machineguns and the inability of doing anything to a real tank with a beginner's american \"tank\" as well as inability to have planes at the start + all the extremely tedious grind is certainly a mud on this game I really wouldn't recommend unless you're extra desperate for something at least remotely similar to battlefield 1",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Interesting game mechanics, but honestly, just too much time spent on micro managing squads. I wish there was a 'hop in and play' mode that revolved around one guy, one load out to worry about, instead of....having to micro manage 5 or different 6 squads each with their own members who you have to separately out fit and skill.....Its supposed to be an FPS, not a micromanagement sim.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "TLDR:\r\nThis game is bad. Never mind the pay2win. Never mind the tier systems or the grind. This game is badly designed. It is somehow both too complex for a casual FPS audience and lacks enough rewarding depth for enthusiasts looking for something more tactical. Yet it seems to try to please both and fails completely.\r\n\r\nLDR: This game has many problems. There are obvious ones, but some less obvious ones that I don't think are often mentioned properly, but I feel are important to mention.\r\nThey can roughly be broken down into a list: Monetization, Matchmaking, Game Mechanics, Progression, and Performance\r\n\r\nMonetization:\r\nThis game DOES have microtransactions, I would argue the pay to win is negligible, but there are many forms of it in this game.\r\nThere is a premium currency used to buy various things in the game.\r\nThere is a premium subscription that gives several benefits that are exclusive to the subscription. It expires and you lose all access to that content until you renew it. And there is ALOT. There are premium weapons, premium vehicles, premium squads, premium inventory slots... Pretty much every mechanic to this game has a premium variant to it. There's too much to judge the balance of it all to the free content, but you can find info for that if you look. Stats-wise a good chunk IS better, but impact to a match seems insignificant in my opinion.\r\nThere is also a battle pass that refreshes roughly every 30 days or so. It has free rewards you unlock by competing challenges and exclusive content only available by purchasing the pass. If you purchase the pass and play enough to progress through the rewards you can get enough premium currency to afford the pass next rotation, so it pays for itself as long as you play regularly, and the rewards are decent enough.\r\n\r\nProgression and Matchmaking: \r\nIf you've played a Gaijin Entertainment game before or heard of World of Tanks or World of Warships or War Thunder, you're familiar with the tier progression system they have for unlocking content. All weapons and vehicles you unlock in Enlisted have a tier: 1 through 5. Higher tiers equal better and generally more powerful stuff.\r\nHaving ANY tier equipment equipped puts you in that tier. So if you equip a tier 3 weapon, even if it's one weapon for one guy, you will be matched with other tier 3s. This leads to 1 of 2 options, either you equip the higher tier gear and get matched in that tier - playing with other players who are anywhere from also having 1 higher tier weapon equipped, or kitted out with full higher tier weapons on all their guys - or you have to bide your time, unlocking but not using all the new stuff you unlock until you have enough to equip your squads and not feel underpowered. This is not a new concept, but where this becomes more problematic for Enlisted than say, WoTs for example, is that Enlisted has a more complex, in-depth level of equipping your squads than WoTs. WoTs tier system relies around the Tanks themselves. You unlock one option that determines the tier and chose that one option to bring into a match. With Enlisted, you have so much more to manage that affects your matchmaking tier.\r\nAnd this is only a problem because the different tiers have such different levels of skill. Unless they are paying their way through, even reaching tier 5 means spending hundreds of hours in game. Feels like subpar game balance to have something as little as 1 rifle with slightly better stats be the difference between how sweaty your next match will be.\r\nEven matchmaking on player skill alone seems unbalanced, often my matches will snowball - one team sweeping the other with little resistance - and it's pretty random which side you'll be on, though I find neither to be any fun. The game also reportedly has a significant problem with hackers, though I haven't 100% confirmed to have encountered any myself. But given the way the game works, it seems rather hard to verify a hacker without watching hours of replays. Which is actually a nice feature to have, both for identifying cheaters and learning the game better.\r\n\r\nGame Mechanics and Performance:\r\nThis game strikes me as a typical example of a neat idea on paper being poorly executed. Full squads of soldiers individually controlled by a single player who can switch control between them and command them sounds intriguing. The appeal of a RTS and a FPS combined together, almost. Yet where Enlisted feels like it falls short is how awkward and clunky commanding a squad in game is. The game is often too fast paced for any meaningfully complex commands, though the game lacks them anyway, and instead gives you very simple commands instead: wait and attack/defend objective. You can command the whole squad, or each individual soldier, but ultimately there is little point in doing anything other than telling your squad to sit behind something solid while you go actually do something. Your squad AI is effectively worthless. Not wanting to have a squad of aimbotting snipers picking off any player who sticks their head out of cover in the wrong place is one thing (though that happens a lot with real players anyway) but your AI squad can't even be trusted to move behind cover when being shot at, or to reliably fire upon a full squad running out in the open. The AI rarely gets kills and almost never manages to kill a player unless they do something extremely foolish. Which meaning ordering your squad is less about gaining a tactical advantage and more about safeguarding your spare bodies to swap between when you die or need different gear to do something. It feels like the AI was balanced for players who've never played an FPS in their life. Balancing for console players doesn't even justify how useless the AI is to do anything on it's own.\r\nSeveral of the mechanics of the gameplay also feel clunky and awkward. Personally I have had the most trouble with the \"mount weapon\" mechanic where you brace your weapon against a surface to significantly reduce recoil at the cost of being a big sitting duck with a fixed firing angle. Half the time you can't even do it when it feels like you should, and it almost never seems to line up to allow you to actually shoot in the direction you want. Overall it feels poorly programmed. Melee also feels weirdly inconsistent. Whether it's a bayonet stab or swinging your combat knife, it feels inconsistent how far or where your melee swings to hit an enemy. If you aren't running into your opponent you probably won't hit them.\r\nCollision boxes also seem very inconsistent, sometimes you can make a shot and hit a the tip of a guy's foot peeking out under a truck and other times your bullets are getting blocked trying to shoot over a fence or through an open window.\r\nDraw distance will also screw you over because depending on settings, other players will load in from further away than things like bushes and other foliage. This means players can often see other players who think they're hidden, but are actually visible because the environment they're hiding behind isn't actually there",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "pay to win but on a whole other level. You literally have to pay for everything unless you want to grind for hours on end. even with premium its a grind fest. characters, skin, guns, maps, tanks, equipment all locked with of course the convenience of real cash to have them. this is why the US is better than your shitty 3rd world country.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It just feels.. cheap?\nLike yea it's free to play, but still. Everything looks low budget, from the menu buttons, to the running animations, to the SPELLING MISTAKES? Like you really couldn't at least get that right?\n\nI know most of the game is AI, what I didn't know/expect, is that the AI is really boring and dumb. I played 2 games, and it felt like I was playing against only AI on easy mode. Easily got over 100 kills with like 5 deaths, you could literally walk up to the enemies and they kept missing you. \nGot boring really quickly, I should've stopped playing after the second spelling mistake.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Every part of the game that used to be fun was nerfed or doesn't work at all anymore. Glad I got the time that I did.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Killcams make the game unplayable. Don't bother using genius IQ stealth plays, the killcam will give it away. I stealthed the B point and my position was exposed when I headshotted someone from afar using a submachine gun. Next, this game is literally Delta force mobile but with WW1 and WW2. Lastly, I get uptiered to people using fucking airplanes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The devs on this game is pretty much useless, they allow hackers and cheaters to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is kinda dead. It's also p2w af, squad gameplay is easy and you pretty much just shoot at bots, and solo play is hard cause you are matched against guys with full rank.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Something is wrong with player base. Scoreboard show more players that it actually is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Could be a good game, even a good f2p mil-sim alternative, but the devs are greedy as everything involved with Gaijin",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AI bots are very stupid, even after 5 years of development.\r\nFew rewards from free or premium passes. Other games, even F2P, give better rewards.\r\nThe worst part is that it's almost impossible to play with so many hackers now. Not worth supporting this game by spending money or your time.\r\n\r\nSuch a shame, as I really liked the game atmosphere, graphics and unit customization...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is p2w, only allowed to use a tank or aircraft not both, and finding matches takes a ridiculous amount of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Open the game - Prompted to buy shit.\nClick to customize - prompted to buy shit.\nClick to join a game - Prompted to buy shit\nFinish the game you finally joined - Prompted to buy shit\n-- You get the picture here.\n\nWhile the gameplay is fun, what I don't see anyone mentioning is that 90% of every server you play on is bots with maybe 5 other players, it seems like. It's NOT fun imho. If it weren't bad enough that this game is almost exactly like War Thunder as far as \"Pay to progress\" (P2W) goes, they can't even attract enough players to fill the game with PEOPLE. The reviews are positive and I have no idea how. The only redeemable quality of this game is the gameplay itself. It's good, not great, but good. My main gripe is that you start with a set amount of ammo and basically if you outlive your ammo, you're either forced to beg your AI squadmates (whom you have to be NEAR and they have to LIVE to get ammo from) AND the fact that they only give you basically one magazine worth of ammo and that's it unless you pick up another gun that's also basically spent. On a game that relies on giving you dozens of kills per life because the AI is brainless, you'd think they'd have a better way to get ammo. Maybe there is a better way to get ammo, but I didn't bother playing long enough to figure it out. I gave the ole' college try and honestly it just isn't for me. If you like games like Battlefield, this isn't really for you. If you like games like Arma, maybe, but don't expect to get nearly the quality of content from this game. I don't really know who this game is for but it's definitely not for me.\n\nAnd yes, sure, it's \"free to play\" but the progression is JUST LIKE War Thunder. It takes forever to unlock even basic attachments or upgrade things, so much so that I only put an hour into the game before I realized how shitty the grind would be. I want a game that's fun, not a second job. and if I wanted to spend money on a game from my first job, it wouldn't be a game I have to KEEP spending money on in order to progress.\n\nF2P garbage, Avoid if you like saving money, play if you're broke with tons of time and don't mind getting slapped in the face to buy freemium items constantly. Avoid if you like actually playing against other players, play if you like mindlessly slaughtering bots, because 99% of your kills will be against the brainless AI.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game relies a lot on you grinding or buying different guns and tanks and what not , yet when it comes to the gun play of said guns it performs very disappointingly, every gun sounds the same and plays without any weight or power being conveyed to the player.\nthe vehicle combat is good though but the thing is you cant really enjoy that much if the maps don't try to incorporate them, your tank can get stuck in trenches and become stuck on every little bush or craves you can think of, other than that apparently tanks come to a screeching halt whenever you try to sway off the round onto a patch of grass or whatever.\nThe devs are obviously still trying to figure this thing out given that they don't have experience with balancing ground units with tanks and planes like other studious like DICE do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't even know where to start, but have I played enough time to know that anything that I hoped this game to be was a pipe dream. This game is so riddled with bugs, that I am astonished it has such a big community. Wobbling tanks which get stuck everywhere, constant lags, infuriating lighting, dumb ai, interface softlocks and so on. Developers constantly ignore all these issues, and it shows.\r\n\r\nAnd the best of all, bots are filling up empty spots in the matchmaking, and it constantly leads to situations, like wasting team lives, because ai is so competent that it can die up to even 20 times while barely scoring any kills, or objectives for that matter.\r\n\r\nThe grindfest that awaits people to get any decent weapon, tank or plane is insane. If you wanna get STG or any other iconic weapon, better buckle up, because you will go through hundreds of battles to unlock anything decent.\r\n\r\nEvents are just bad, really bad. And if you do not purchase an elite pass for every one of them, you will miss more than half of what is in there.\r\n\r\nConstant popup adds for new squads.\r\n\r\nSmall selection of maps. you will get tired quickly.\r\n\r\nBR III is a complete joke. You will be fighting against players with high end equipment.\r\n\r\nIf you really want to, go ahead and try it, but any other game would be a much better pick than this dumpsterfire.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This honestly has the worst matchmaking you could imagine, geared towards letting the higher level players beat down on newbies.\r\nAs a BR 1 I have literally been thrown into matches against BR2/3 players, where I had only one other actual player on my team, the rest were bots who just ran to a single objective as a swarm.\r\nThe game would be fun otherwise, it has good gameplay, but this is just toxic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its very difficult to win a match and the team balancing is terrible. The snipers are way too overpowered in maps. I can shoot a gun that doesnt even have a scope and still land a hit from very far away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i really cant recommend this game because the performance is incredibly hit or miss for some reason, ill go from 200+ fps one day to 100-120 with major stutters the next. its incredibly annoying and makes the game unplayable for no apparent reason",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the match making is retarded every match i win i have to suffer through 3 matches where i get my cock and balls slammed into a car door before i have a match where it is a fun match where its close i don't care if i lose it just pisses me off when it's a blow out bc the enemy has tier 5 weapons in a br 1 and 2 game or my team beats the enemy with a metal folding chair (idgaf that i didn't use punctuation cry about it)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Almost every match is ruined by either hackers or sweats that spawn camp you.  This game used to be so much fun and still could be if the developers cared at all about it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too many statpadders and ego masturbtrs in low tiers. Just go for a properly purchased game. This is just a bs if you are newbie.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crazy how simple this game is and how easy it should be to run yet on high end hardware it still stutters and runs poorly, not to mention that it doesn't have a ton of players and yet still a ton of cheaters.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So, this is a great game, but... oh my god, the glitches are unreal. \n\nSo, to name a few that I have had: \n1.) The infinite login screen on startup (Happens a lot when logging in via Steam) \n2.) TNT does not always explode after placing it (Really annoying after rushing a tank only for nothing to happen) \n3.) Getting stuck in walls and gun emplacements after spawning in and exiting emplacements. (Quick way to die) \n4.) Tanks jittering on uneven terrain (Tanks can drive like a bull in a china shop) 5.) The perpetual \"your premium account has expired\" (I have never bought it) \n6.) Getting stuck on windows while trying to climb through them (Another quick way to die) \n7.) Trying to join a game only to be hit with the infinite loading screen of death (Particularly annoying after the login issue) \n8.) Hit boxes on dead vehicles (You need an extra 2m at least when next to a tank husk, and heaven forbid you shoot a rifle grenade) \n\nThese glitches are everywhere, and it really feels like if something doesn’t directly generate revenue, it doesn’t get touched. At this point all we can do is pray that the lord snail takes a short break from counting his dollar bills and throws a few patches our way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would like this game much and its good for a free title but boy, 45+ min for 1 match is quite a time ...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i loved my first couple games. then i unlocked the airplane and now im matched with GoDs of the game i guess cause now i cant get a kill.. cheaters? i get 100 kills one match next 2 i cant even show my head without being sniped from I DONT KNOW WHERE WTF IS THIS GAME.. i do not recommend this game to anyone. play something different",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "while this game COULD be fun... it's impossible with mouse and keyboard, controller works in the MENU... but not in game, very helpful... along with the normal pay to win crap, i'd rather BUY a functioning game, or even half functioning. but then, nothing works anymore. great job people, you supported ALL of this and now this is our world. not just games, which are so bad they're not even worth playing, life in general, which is also not worth living anymore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "слишком сложная и объемная система прокачки, пока только 4 фракции, в каждой по 3-5 бойцов, у каждого есть 4 какие-то секции прокачки + способности(слава Украине их можно прокачивать автоматически) и того 64 секции которые надо прокачивать нахуй + 16 секций способностей, не дохуя ли ебать нахуй?? а ещё надо танчики и оружки исследовать",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nice job assholes. After 70 h played. They just reseted all my progress of the game. Thaught this was pretty good game. But yeah, gaijin fucked u up again. Uninstalling this bullshit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm fed up with cheaters, it's always the same, you'd think the developers were deliberately leaving it open to gain notoriety. The game is good, but there are cheaters every single game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool in theory, but falls short in a lot of places. \r\n\r\n'MMO' isn't the right word I'd use to describe it. Otherwise Titanfall 2 PvP would be an MMO.\r\n\r\nIt's a 12v12 shooter with bots sprinked in that allow you to play multiple characters.\r\n\r\nThe shooting is a little clunky but that's to be expected. Researching and weapon choice is okay, but a lot of the systems involved are a bit bland and get old pretty quick. \r\n\r\nMatches feel painfully slow and uneventful due to their primarily bot population.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun for first hour or two getting 100+ kills, instantly becomes unfun once put in real lobbies. Skill issue? maybe. every match has someone with 1000+ hrs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth it at all, Somehow not able to pen a PUMA with a AT rifle at all. the vehicle combat sucks worse then even some roblox clones, If you want anything decent worth vehicle gameplay go to WT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Matches end either way too quickly or last for too long. Feels SUPER arcade-like while also trying to add so much simulation. The idea was great, but the execution was awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "probably the worst hit reg ive seen\nmelee is inconsistent\ntheyll take action against people using the xp multiplier the jump levels, but wont take action against people who are regularly spawn camping matches\ndo better, this game has been out for so long and somehow ladders are still glitchy as hell. the ai team mates are actually retarded and barely listen to your orders",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you from Asia.. Sad to there is no server for your region. You are not the player this game want. It hurt seeing that we Asia player spread in all server while other got their own region server. All we can dream is a SERVER FOR ASIA but still its a dream that will be left out to the end of this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "They totally ruined the gameplay after this recent update, tons of glitches and it runs at like 2 fps. was great for a free game but now its damn near unplayable. most of the maps are unbalanced and its turned into a pay to win game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unlike War Thunder, this game feels so clunky on every aspect BUT the tanks. Even then... they can be pretty hit or miss. My main issue has been that this game will run for about 15 minutes, then be at a MAXIMUM of 10-15fps for the rest of the match. This is a consistent issue on a 4060ti at least. Just cannot say this game is worth the FREE pricetag.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "First it's fun and all. Cinematic battles and enemies that are the same skill as you. You play a bit, level up a few times and the tryhard's start to apear. Enemies with OP weapons that 1 shot you, shoot you from across the map, give you 3 tanks and 1 bomber plane. Somehow get airstrikes. I cant even unlock an automatic, and when I do it's medic only, while I get to fight enemies with giant automatic mashine guns. It's good at the start, but gets really competitive. \r\n3/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Same Gaijin problems rattling and rocking vehicles on flat ground now add in poor movement and bad controls for troops plane spamming over and over non stop, aa is a joke, perfect game if you want to rage about trying to walk 15 ft before being bombed to hell fresh from spawn and ruin your free time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Events are super repetitive  and grindy the multiplayer is pay to win and the optimisation is very poor, it's FREE so it's good for a few games per day but that's not enough to get anything in the events and makes for hyper slow progression",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enlisted is a foundationally broken game. Why do I play it? Because it is incredibly fun. Both can be true at the same time. For any developers reading this, please, please fix your game. I have over 200+ hours in Enlisted and certain things are not being fixed, and have never been fixed since I first downloaded. Developers PLEASE pay attention to your fan base and look at what I have written below, these are common complaints from all the players I have spoken to. \n\n.Squads do not keep up with you EVER!!!!! they stay miles behind you, then if they catch up they stand around like morons and get sniped or bombed. They do not obey your command to stay close and this has ruined many, MANY sessions with my friends.\n\n.Many maps are completely bias to the defenders, with terrible starting spawns for the attackers. The outskirts of Moscow map being a great example of this. You start, as the attackers, opposite a no mans land that you have to cross with a fortified area as the defensive point to capture. The amount of losses I have had on this map alone as the attacker is beyond ridiculous. It's not that it isn't possible to win as an attacker, it is that it always feels unbalanced.\n\n.Many buildings have no windows on the sides where enemies attack from. This is unforgivable. The amount of times I have tried to find a window facing attackers in buildings, only to be confronted by a solid wall is infuriating. You designed these maps, yet the windows are always in useless positions. \n\n.Early tanks have paper thin armour, to the point they are useless to play as. I am a very experienced tanker on the game, and I have successfully utilised the early tanks in the game from all factions, but they are a complete pain to use and a lot of the fun is taken away from using them early on because they are so weak. Additionally the tank rifles are practically useless. \n\n.The grind on late stage popular weapons is WAYYYYYYYY to grindy. I'm sorry, I know you are a free to play game, but I have been playing 200+ hours and have only just started to enjoy my loadouts. We all know you need to make money, but the amount of research points needed on some of these weapons is unreasonable. \n\n.Why is the German halftrack (one of the most iconic vehicles of WW2) locked behind a £20 paywall? like wtf, who thought that was a fair price? Even in a free game!!! It is one vehicle and not even a particularly powerful one. \n\n.Some late game tanks have ridiculous HP. I once went up against a panther tank (No slouch of a tank to be sure) and I shot 7 bazooka shots at it, blew 2 TNT packs on its back, and threw multiple explosive packs at it, only to be wiped out in one shot by it. This isn't realism, this isn't balanced, this isn't fun! \n\n.It is incredibly easy to get stuck on the environment whether it be in tanks, or while playing as infantry. I have died so many times, beyond count, from being caught on invisible tiny barriers that should not even register (particularly to a tank). The mantling is also really broken, with it getting you stuck in windows, or allowing you to crawl through tiny spaces, giving an unfair advantage. \n\n.The game has server issues, my friend is constantly booted out of games and I often experience Lag, despite having excellent internet coverage. \n\n.When in a tank you should be able to shoot down trees and walls in order to get a better view of the map. WAY to many times I have been firing rounds from a giant tank at a tree or wall, for it to stay there like nothing happened, ruining my view and leading to my death when i try to reposition. This is basic. We aren't expecting full destructibility, but the walls and trees need to be able to be shot down. Really simple stuff. \n\n.Having a squad be mixed nationalities is also really really annoying. If you are like me, you want to RP with the correct gear and troops of the time period. When you put a different squad member in lets say a British squad, you can often get an American in there randomly, breaking immersion. I am aware this can be changed via the appearance screen, but this requires in game currency to unlock, which makes it a really sleazy way to milk more money out of people. Make it free!\n\n.The hit markers on anti infantry shells and bombs are completed broken. I have had a bomb kill my whole squad (Many many times) from literally miles away, where there was absolutely no way I could have been hit, and the same applies to tank shells. Paradoxically the anti-infantry shells are completely unreliable. Sometimes you will shoot one right next to someone, nothing, another time you will get a random kill from ages away, that you weren't even aiming at. It is pretty basic stuff again. \n\n.The weapon upgrade system is completely stupid, literally no other way I can accurately describe it. Why should I have to play hours and hours with a squad I don't like so I can upgrade a gun I use, that is for some (no) reason tied to that squad? Honestly more scummy milking of your fanbase. \n\nI will end it here but there are more issues I haven't mentioned. I really want to recommend this game. It has genuinely fun moments and I wouldn't have this much time in it otherwise, but ultimately the game is extremely imperfect at the moment. On a side note, it would be great to see a Russia V Japan map, in Korea, but that is the least of my concerns at the moment.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "hacker central. dont play this game unless you have hacks. then you will fit right in with the rest of the lobbies",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is very much pay to win, the AI squad members are so bad it would be a better game without that system at all. lots of the maps have terrible design and give one side massive advantages, but it is a free game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Anti-Tank simulator. I'm sure my opinion won't be agreed upon by many who play this game since everyone loves complaining about the tanks in the game... But lets think about this for a minute. What do tanks have? A cannon and a couple MGs and if you're lucky you can use a personal weapon while riding your tank (which seems to be luck of the draw as some tanks will have the ability then the next version of the same tank just doesn't allow it for.... reasons I guess?) Now lets see what can deal with tanks... Other tanks, both fighter and bomber planes, AT mines, AT rifles, AT launchers, AT cannon emplacements, TNT (C-4 charges), TNT grenade bundles, Molotovs. With AT mines/TNT charges, and TNT grenade bundles/Molotovs both being able to be held by every infantryman. And AT cannon emplacements being able to be safely build anywhere and from behind cover where a tank will never be able to see until it's finished, this being built by an engineer who can sprint full speed across the map to a place then start building. And then they added squads that can run into the only place a tank could go to be safe from only less than half of those things. As plenty of maps there are open ad visible spots that the enemy team can look into where you spawn (Literally spawned a tank with an enemy tank already staring at me.) But still there are people who complain about tanks staying in the \"gray zone\" where MOST squads cant walk to. Nobody ever asks WHY tank players feel the need to stay there... Well now those braindead folks have a list above as to why tankers either sit in the gray zone or die. Since I've yet to see friendly infantry defend my tank from a dude rushing me. And it's not entirely their fault as the AI is just as braindead.\n\nThere are plenty of other problems with the game, if you want to see them watch one of the few content creators who play it... I'm not trying to be them. I just finally had enough of all the AT in the game and got annoyed enough to rant about it here. Tired of all the sweats who sprint at your tank and lay on top of it like its the middle east and they want their 72 femboys.\n\nLook I'm sure you might be able to have a little fun in the game but they sure did make sure to recreate the feeling of the grind that Warthunder has. Just with the added tryhard feeling you get in cod lobbies. It truly is a unique experience that you won't get anywhere else...\n\nI'm keeping comments off simply because I don't want to argue with the people who think all the AT they have is still not enough to deal with the \"OP tanks\"",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "trash . idiot company and too much idiots player.  its 10v10 but u have at least 5 bots in ur team and 5 players 50% are idiots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FULL OFF CHEATING  KIDS GG GAJIN UNINSTAL NEVER EVER PLAY ...I HOPE TIS GAME GO REALL FAST DOWN",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Jesus Christ, no. \n\nThis might have one of the worst and most convoluted progression mechanics i've ever seen in a game.  Bloated, overly monetized, tedious all being weighed down by the worst aspects milsim bullshit. The core mechanics are fine, but it drowns in needless minutae and bad ai.\n\nI hope my friends know how much I love them that i'm willing to play this shlock.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Used to be good PURELY because there was a modded server with 64 player limit PLUS SQUADS. Airplanes, tanks, basic fortification building.\n\nNot anymore. 20 player limit with squads.... Tiny maps...... Stupid battlefield style conquer the flag. The mod made it and it's GONE. This game is worthless now. WORTHLESS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is really good but the problem with the game is are the players in low BR because they are more dumb then a rock, Im pushing the point and my teammates are camping in the back doing nothing except loosing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they ask for labour of love award? what a joke, matches arnt even playable if somebody has bought paratroopers or you try to shoot somebody at range, the bullets just whiff into nothing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Main Problems with Enlisted (2025)\n\nPerformance & FPS / Optimization Issues\n\nMany players have reported big FPS drops and stuttering after recent updates. \nEnlisted\n+2\nReddit\n+2\n\nAccording to user reports, there are memory‐leaks: performance degrades over time, forcing restarts. \nEnlisted\n\nSome on very high-end hardware (e.g. RTX 4090) report FPS is very low when ray tracing is enabled. \nEnlisted\n\nThere are also reports of visual / DX12 bugs. \nReddit\n\nUnbalanced Matches & Matchmaking\n\nPlayers say a lot of games are “100% unbalanced,” with teams badly mismatched. \nEnlisted\n\nSome complain that the matchmaking system is broken or unfair. \nGamepressure.com\n\nThere are accusations of bots disguised as players, which messes up match balance. \nEnlisted\n\nAI / Squad Behavior\n\nThe AI squads (your teammates) sometimes behave poorly: get stuck, make bad decisions, or don’t follow well. \nReddit\n+2\nReddit\n+2\n\nIn some cases, AI bugs make them very ineffective in combat. \nGamepressure.com\n\nProgression / Grind System\n\nThe progression system is quite grind-heavy: to unlock weapons, squads, or vehicles, you need to grind campaign by campaign. \nplayonlineh5.com\n\nSome premium squads give an advantage, which gives a “pay-to-win” feel, according to certain players. \nGamepressure.com\n+1\n\nAccording to user reviews, research speed is very slow for non-paying players. \nTrustpilot\n\nTechnical / Server Issues\n\nThere are reports of server lag / latency (“delay” / “networking issues”) hurting gameplay. \nEnlisted\n\nSome maintenance issues: for example, in September 2025 there was unplanned maintenance that affected player data. \nenlisted.net\n+1\n\nContent / Update Quality\n\nSome players feel recent updates are “inconsequential” — not much meaningful content. \nReddit\n\nAccording to feedback, some new vehicles / units aren't very useful or well-balanced. \nReddit\n\nMonetization / Value\n\nPremium squads are seen as overpriced for what they offer. \nEnlisted\n+1\n\nSome players feel the game “nudges” them to buy gold / premium content. \nReddit\n\nHit-Detection & Gameplay Feel\n\nComplaints about “inconsistent hit detection”: some hits feel unfair or don’t register properly. \nReddit\n\nThe large-scale battles can feel chaotic, which some say undermines tactical or strategic squad play. \nReddit\n\nAI / Bots Filling Matches\n\nSome worry that too many bots fill matches, reducing the quality of competitive or player-driven matches. \nEnlisted\n\nThis contributes to a feeling of “fake” or imbalanced games. \nEnlisted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT DOWNLOAD, GO AND BUY EASY RED 2 OR ANYTHING ELSE\n\nThis has to be one of the worst games, especially WW2 and FPS, I've ever played and I can summerise the entire thing with: BARELY WORKS. Anything and everything barely works, balance and gunplay is the f'ing gutter, oh and don't get fooled by the idiots, that'll defend this game to their grave like Gaijin is paying them millions, that say \"BUT HISTORICAL ACCURACY\"... Historical Accuracy? You mean like everyone running and gunning with SMGs? Uniforms looking like cheap TEMU knock-offs, that clip through themselves? Squad structure pulled out of ass?\n\nMatchmaking is non-existent and literally will kill the game, everyone is thrown together, people who can't shoot and don't know how to perform objectives and literally no-life tryhards that'll lean walk out to you because they can't shoot straight. No to mention, at times, massive BR gaps, meaning getting uptiered is like a death sentece.\n\nTanks are just glorified scrap heaps, which is funny considering the same company made War Thunder, yet here the tanks can't do jack shit. Going up the hill? Haha, no and snail pace at best. Drove by accident into a bomb hole? Yep, you're stuck, might as well just kill yourself.\n\nPlanes tend to be random af. Oh, see that max speed? Yeah, it's a lie, it'll go about 100 km/h slower, if you're lucky. Bombs are a dice roll, sometimes it's a WMD, sometimes it's a firework.\n\nAnd at last, the infantry, aka. Walking Wood. The perk system (Which has to be the most idiotic thing I've ever seen), like am I playing an FPS or a RPG game? NO (at least sensible) FPS GAME HAS DONE SOMETHING LIKE THIS. The outdated and clunky movement that barely works half of the time. Gunplay feeling like a trash can overfilled with liquid shit, sometimes shots don't even register DESPITE SEEING THE BULLET GO EXACTLY INTO THE ENEMY.\n\nLast point, the Battle Ratings... What. In. The. Actual. Fuck. What monkey decides them? And what monkey puts together the tree? I mean, BR 4 is pointless, since the uptiering is a thing. Tiger is for some reason BR 5 (Together with Tiger 2, mind you, while IS-1 is BR 4???). It's all just next level stupid.\n\nOh, and don't get me started with monetization, which is just greed exceeding Ubisoft, EA and any other company you can think of. Literally locking guns, tanks and planes behind 20-50 bucks paywall... For a single thing... Stuff that is very much NEEDED IN THE NORMAL TREE. They also lock certain customization behind it too. They could've done something so much better than this, yet they rather lock stuff behind paywalls, battle passes and timed events, which means if there was or is an OP thing, have fun shilling your wallet or time on this pointless shitpit.\n\nRemember, don't get fooled by idiots talking about historical accuracy or realism. This game has neither and if you want to play something that has both, there are better games out there.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Brain dead teammates from russia. and the worst maps ive seen in my life.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Straight up boring and slow. The main menu is a head ache to navigate. Cool if you like the greatest atrocity in human history though I guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cant win shit with Germany,very bad matchmaking,always full of bots",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't get the hype. Load in as a rifleman and they give you 15 bullets. After you fire those 15 bullets you are walking paperweight.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Spawn camper eveywhere had one match where you couldnt leave the tank spawn becasue of all the dead tanks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a rpg not a skill based fps game. \r\nIt is pay to win and a horrible franchising weapons to upgrade.\r\nThis grind is horrible and I beleive there is Skill based match making for sure. \r\nThat's why the more I played the more struggle I get. \r\nThere should be a lobby based on your stuff upgraded not by your kd or some shit. \r\nFor me is a big NOOOOOOOOOOOOOOO!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The control in this game are the worse. Its as if you are playing on ice.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too much cheating going on, terrible matchmaking system",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LAST TIME I KNEW WHEN YOU SHOOT PEOPLE IN THE FACE WITH MACHINE GUN THEY IDK FUCKING DIE MAYBE???? UNINSTLLED. RIP WW2 SHOOTERS MOST ARE GARBAGE THESE DAYS",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why am I getting desertion penalties for my game literally crashing??",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "homie wtf is this game?? are these lobbies real?? My first match I got 151 kills and 40 assists with 10 deaths because I ran out of ammo, my second game I got 157 kills and 81 assists with 5 deaths because I ran out of ammo and ran to get melee kills before being put down, I feel like these lobbies aren't even real people, I know that there are a lot of AI squadmates with every person, but for the entire lobby to be this abysmally braindead is wild, everyone on my team played like weird bots, not a single person defended the objective at all so I had to solo that on top of fighting literally everyone on the enemy team alone, the only hint of there being another player on my team at all was someone on mic complaining about not knowing how to get ammo, not to mention the incredibly annoying predatory store, every match you finish fills your screen with ads asking you to pay for premium and buy better guns with real money, there's a rifle that is $30 that you cannot get without paying real money and is just straight up a better gun, you can also buy better bots that are just better than every way to the free bots you have to grind for, this game has been running for 5 years? y'all need some self respect, that's insane.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck Gaijin and your pay to win features. Fun otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My German tech tree was close to BR 2, decided to try out Gates of Destiny mode, unlocked the Beretta M38 40 Roma from progression, and now I'm playing in BR 3 matches and getting absolutely hammered by those overpowered opps! Please DON'T up-tier me because I have ONE SINGLE BR 3 WEAPON",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was a lot of fun while in the early games, and for a free game is clearly very well made. However once you reach a certain point in the matchmaking, the vehicles make it very difficult to do anything without getting capet bombed or machine gunned. While I'm sure that's an accurate representation of the war, it's not a very fun gaming experience. If there was the option to play a gamemode without vehicles, it would be a top game for me. As it stands it's more frustrating than it is fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It would be nice if the game was not filled with cheaters. This is not a skill issue thing. I mean players who spin around and everyone dies. Vehicles exploding. Getting killed by (x). Bullets going through the earth. \r\n\r\nI will change it once the cheating hell stops.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its OK-ish if you dont have other shooter games to play or you dont want to spend money.\n\nthe cheaters thou.... aih",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Hacker filled nightmare, honestly some of the worst dev teams I've ever had the displeasure of knowing, nothing gets done and more and more hackers fill the game to the point they've started ending games right off the start but when you report anyone nothing gets done cause the company is too busy worried about making more pay to win guns than ACTUALLY HELPING the community and game itself",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The could be a solid good game, but the matchmaker ruins everything. Try to google \"enlisted matchmaker\" :)\nIt is so bad, that can be used as a reference point. \"This coffee maker is as bad as Enlitsed matchmaker!\"\nIt doesn't matter how good or bad you are at the game. Either you are on the team that will win 100:1, or will lose 1:100. \nDon't make the time investment. Find something that is worth playing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Battle rating system sucks, every time i play with any tier there are multiple players both enemy and friendly that are a tier higher. I would rather be forced to research enough squads from such tier to be able to play it and not encounter anyone that has a tier higher.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "250 hours in thought oh this is a nice game wich it in general is\r\nBut i dont know what kind of anticheat they use but it aint working if you want to report an isue you get a crummy AI checkig evry word instead of haveing a clear report systen with out an AI translating it \r\nthe AI sugest where it thinks your isue should be and that goes south \r\ni try to report an isue al my stuff is in english yet i get rusian language strange not even japaneese or polish im not even from those parts and not Even near realy odd (smels kind of fishy if you ask me)\r\n\r\nthis game is Teeming with cheaters lagswitchers/peapole who hang around do nothing peapole that report for thing like you not rushing the atack point or you running away from it to get a beter spawn position for the team you using a macinegun type tank providing supresing fire trying to shoot the snipers \r\nout of the tower basicly becouse you dont play as \"They\" want\r\n\r\ni select my sniper rifle and get my binoculars in my face i try to comand the team when sniping and i pop a smoke granade i snipe and my team is INFRONT of me STANDING whn im lying down (In game they tell you that you team wil prone if you do.....???) worse of all the team is dancing on my head infron of my gun (that goes for most clases bugg/cheat?) and wel that atracts atention so they kill you off real fast\r\n\r\nfor some odd reason engeneers/radio/snipers get shot out of the bleu just those clases so i suspect a cheat as it does not happen with plain soldiers and yes i would aim for them to \r\n\r\nbuilding\r\ni want to build sandbags/spawnpoint\r\ni place itand it trys to build another of the same type ten you cant build the object becouse its trying to build a new one you squad dancing infront of the to be build object blocking construction they go up ove left right geting shot and spoiling the \"Good\" new spawn spot and then you are proned so that should not be happening \r\n\r\nthe AI pathfinding is artrocious like i said before the just clib senseles over al kinds of stuff geting shot and those are your good dudes like radio guys or engeneers who you want to keep safe...\r\nso you have just switched to your engeneer.. the sniper wich you just played goes running around clibing on random items blocking and get shot becouse its verry visabale\r\n\r\ntanks getting stuck on a few oil barels/crates what not verry bad mechanics and absolutly not realistic \r\n\r\n\r\ni can go on and on about this im a new player 2 weeks max in tought meh this is cool lets pay some \r\ni dumped 20e\r\n\r\nthe higher up you get in the game the worse the cheating/grieving/reporting gets \r\nok then they today publicly shamed a few guys that used exploits lol\r\nbeter do something about the cheating \r\nand if yo ucan use a flamethrower your pretty far in the game and if you burn team mates barbwiring Your Own teams spawn point becouse you are not happy you have done this way more often \r\nresult peapole can stay as they dont get banned for stuff like this \r\nIn the end i to acedently hurt Tmates with molotovs (sry NOOB! :P)\r\n\r\n1) ban 5 days \r\n2) Ban 10 days\r\n3) Permaban al your stuff gone nonnegotionabale never to be recovered including a steam/email ban ETC ETC...\r\n\r\nSo do i want to pay for this again..?\r\nDo i want to play again?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just another half-dead ww2 semi-realistic shooter.\n+at least it \"free\"\n+vehicles mechanics are from WarThunder,nice handling and damage simulation \n-sh1tty squad system:ton of useless boring management and most re1arded suicidal bots that i ever seen.HL1 in 1998 had better bots\n-Horrible matchmaking system from WarThunder were you:\n1)can play with 1k hours guys even if it your first match\n2)gamble battle rating and hope that you dont get uptiered",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ive played for 150 hours and for me not that good game. Bots are dumb af and bunch of people running with smg, lmg and moving like in cod multiplayer and usually teamates doesnt play for the objective.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible mechanic organization and will sell u squads you cant even use , then not refund you!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a fking buggy mess, with i can't even differentciate with cheater or bug",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Greedy publisher, have fun always being below someone who payed for premium",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IF YOU LIKE GAMES WHERE PEOPLE FREELY RUN CHEATING PROGRAMS AND NO WAY TO REPORT THEN THIS IS THE GAME FOR YOU.  ENJOY GETTING SPAWN KILLED AND THE CHEAT LIKE NO OTHER WHERE YOU CANT GET A PLANE OR VEHICLE CAUSE THE SAME GUY CAN GET THE PLANE RIGHT AFTER HE DIED AND YOU WAITED THE TIMER FOR YOUR TURN AND BOOM HE HAS IT.  THIS GAME IS NO GOOD ITS TRASH AND IF YOUR PLAYING IT THEN ITS CAUSE IT IS FREE......FREE FROM SUPPORT AND HONEST GAME PLAY.........WANT AN HONEST REVIEW THEN ASK ME CAUSE I WILL PUT IT HOW IT IS",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Deleted my account out of nowhere. What the actual fuck?! All my time and progress wasted!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT GET UNLESS YOU WANT TO FIGHT HACKERS EVERY SINGLE MATCH",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Artificial Idiots forced into my squad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yeah no, they banned people for using too many xp boosters.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}