{
  "positive": [
    {
      "review": "Incredible, incredible game. You can tell RGG put so much love, care, and passion into this game. I, as everyone else who has played both Judgment games now hope that RGG can somehow produce a third Judgment game, us all wanting Yagami's story to continue. If not, it was an incredible honor to play as Yagami and experience his story, along with all the other amazing characters in both Judgment games. 9/10 with only some gripes like annoyingly broken enemies and some mini games that outright suck. Easy to forget the bad in this game when literally everything else is amazing and an ending that will make you sit at your PC as the credits roll, thinking about how we humans come to terms with things, if the Law truly helps and is good, as well as what Justice truly entails and if it's right or wrong. Snake style best style. Farewell, Tabo.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Combat:\r\nEvery fighting stance is insanely fun, especially boxing once you upgrade it. Easily the best fighting mechanics in any game of this style.\r\n\r\nHigh School Segments / Mini-Games:\r\nMost mini-games are fantastic. The robot one was confusing at first (the game explains it terribly), but after a YouTube guide, it became insanely fun. The boxing mini-game is my absolute favorite.\r\n\r\nSide Missions:\r\nClassic quality—fun, varied, and well worth doing.\r\n\r\nStory:\r\nGood as always, but pacing can feel off. Once you know everything, it’s a lot of facing the same people repeatedly. Still engaging overall.\r\n\r\nOverall:\r\nA fantastic sequel that improves on nearly every aspect of the first game. Best fighting, fun mini-games, solid story—highly recommended.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Rather good, so far I've had the most fun with the seiryo school quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of things to do, an interesting story and improved combat over the previous title. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The main story is especially engaging, and that alone makes Lost Judgment a must play. It is an improvement on almost all aspects from the first game. My only gripe is that I feel the minigames are kinda a step down from what I would expect from RGG studio. The biker gang, robotics club, and even the boxing minigame overstay their welcome and can get a bit frustrating to get through, but they are a major part of the school stories.\n\nIt took me nearly 70 hours to complete the main story, all school stories, majority of side stories, and get full affection for 2 out of 4 possible girlfriends, although I tend to take my time not to rush through anything. You know a game is good when you don't realize the massive amount of time you already put into it until the end credits roll.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the graphics way better than the first game\nside story or school story had longer progression and more grinding -_-\n\nyeah the combat better thaan the first game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a damn good game, both as a sequel to Judgment and also being its own thing. If you enjoyed Judgment, you will 100% enjoy this one too.\r\n\r\nFirst of all, I really enjoyed the story. Although not really comparable, I think I enjoyed this one's plot more than Judgment's. They're different though, but I feel like the themes in this game were better overall. The story of this game is pretty much a standalone experience, so you don't HAVE to have played Judgment. However, the first game does provide more context to other background characters.\r\n\r\nAnd then there's all the side activities that got a HUGE upgrade from the first Judgment. There are a bunch of school stories (I think 10?) that all have their own minigames. These did kill the pacing of the main story pretty badly, but they still provided an excellent and long side-story. I did a bunch of other side quests too, but left the rest undone. There are some pretty solid quests, but then there are also those that just drag on without anything interesting.\r\n\r\nAs for the gameplay, this is a big upgrade from Judgment. Although I enjoyed the original's combat too, this one just takes it to a new level. The two new fighting styles are a welcome addition (I especially enjoyed Snake), but also the original two ones feel smoother overall. There are a few other new gameplay mechanics too, such as parkour, which I felt like was really well made. The only thing that I felt like was a downgrade are the chase sections. The new elements it introduces didn't really click with me. They weren't that bad though, so it didn't ruin the experience at all.\r\n\r\n9/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Straight up 5/5.\r\n\r\nAmazing sidequests. Also using the skateboard is really useful. One of the best games from the studio so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man I love this game. The fighting mechanics, the chase scene and the mini games all fit together very well the cut scenes and animation is too good and love the plot. Got the sequel before judgement so I don't know the backstory of some characters and I'm excited to learn about them when I buy judgement",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't done jack shit in the main story and I've spent almost 20 hours dicking around town doing school quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lost judgement is soooooo good. I would say its one of the best lad games. every battle style is so unique and good and the best thing is that they even work together to be even stronger. the story i really enjoy (rn) and i don't have any complaints rn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is better than I expected. Gameplay and combat-wise, it’s far superior to the first game. The story is on par with the first one, and the mini-games are much more fun now, except for the robotics club part. That shit is frustrating to complete and actually requires heavy grinding,it actually took me at least a whole week to finish. Anyway, I definitely recommend it if you’ve finished the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is just plain AWESOME! I believe Ryu Ga Gotoku is a GENIUS for making all these amazing games with so muchhhhhh to do in them and at the rate in which he gets them done. I hope for more Judgement installaments but ill settle for anything Ryu makes quite honestly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have mixed feelings about this game (base game only, I haven’t played Kaito’s DLC), but not enough to give it a negative review.\n\nCompared to other reviews I’ve read, here’s my take: it’s true that the main story drags on for too long — I actually struggled to finish the last chapter because it felt unnecessarily stretched out. There’s an interesting twist near the end, but nothing mind-blowing, and overall it doesn’t really justify the length. Plus, a few story events unfold exactly as you’d expect, which makes some parts feel predictable.\n\nAnother thing I saw mentioned was the fan service from RGG Studio throughout the game. Personally, I didn’t mind it. It feels fitting, especially since this series leans less toward “me against the world” and shows the protagonist relying more on others compared to the Yakuza series. I actually see that as a strength — showing the main character struggling makes him feel more human, more realistic, and less of a superhero (even if that’s not what the game’s mainly going for).\n\nI also read reviews saying the story’s resolution doesn’t show much moral gray area — that it’s too black and white. I agreed with that for much of the game, but in my view, within the series’ moral tone and the protagonist’s perspective, the ending actually lands more on the gray side than on pure extremism.\n\nI do agree with people saying the first game is better overall. I liked that this one tried something different story-wise, but by the end it falls back into the usual Yakuza clichés and conspiracies — which I guess are there to justify the Beat ’em Up gameplay. What I really didn’t get, though, was the stealth aspect. It’s pretty bad, and there are almost no chase sequences, so I don’t understand why there are skill upgrades tied to it. It’s a shame there’s no Judgment 3 in sight, because the investigation mechanics could be much better developed — they end up feeling repetitive. Maybe I’m just missing having a proper detective game like L.A. Noire.\n\nThat said, it’s still around 15–20 hours of fun, and it’s hard to pass up if it’s 50% off (or more).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I dont getb it man where the fucvk is kirytu I only play these game for that guy....WTF!~!!!! so mad i got confused ijn the first minute and did nothing but hit the same wall for 44.9 hours",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"To obtain justice, one must perform a juggle combo to the opposing party.\" - John Judgment",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Во многом лучше первой части! Очень хочу третью часть про команда Ягами, но к сожалению я её получу не скоро (",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "excellent story and side quests. It makes you feel like a detective slash beat em up yakuza guy tearing through fights",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A refreshing spin-off that actually stands on its own. Almost no cameos from the main Yakuza cast, which I loved. The detective elements add a fresh pace, and — let’s be honest — beating the crap out of obnoxious school boys is absurdly satisfying. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mind-numbingly boring: The experience feels repetitive and lacks excitement for the first 5hrs.  \nEndless lectures: The game spends far too much time on long talks about bullying, which disrupts pacing and immersion.\nMinimal interaction: If you expected action, choices, or engaging mechanics, this game doesn’t deliver.\n\nIF you can get past the 5-6hr mark:   you're looking at a fun and challenging game with a descent story. \n\nOverall impression: worth the price at $22.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "another one of the classics for a replayable library",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mostly a step-up from the first game. The combat is significantly improved from the first game, adding stuff like proper juggling and the combat is way faster which is really enjoyable. The story is very great as well, not as good as the first game, but still really interesting. However, this game's side-content is significantly worse than the first game's. There's not a singular side case in this game that's memorable to me. The School Stories were pretty interesting at first, but stuff like the Robotics club soured my taste on the game a little, dragging on for far too long while being frustrating and overall not interesting (except Boxing which I found really fun the whole time). Overall, I still prefer this game over the first game and I doubt I can ever go back to the first game without missing the amazing combat that this game has.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is perhaps the best combat in any RGG game, the story isn't as good as the first game but it is still very very good and intriguing enough to keep you hooked until the end! A great addition to a great franchise, can't wait for the next installment of the Judgment series.\r\n\r\n9.2/10!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b]Review by [url=https://store.steampowered.com/curator/33369540-Abrix/]Abrix\n Gaming[/url] – 4K quality gameplay reviews and recommendations.[/b]\n\n[b]Lost Judgment – A Bold, Relentless Thriller That Pushes the Detective Formula to Perfection[/b]\n\n[i]A Special Thanks To My Friend Mute For Gifting This Game[/i]\n\n[i]Lost Judgment[/i] takes everything that made Judgment unforgettable — the legal mystery, the emotional character drama, the exhilarating martial arts combat, and the densely detailed streets of Japan — and elevates it to a whole new level. It is one of RGG Studio’s most ambitious and thematically powerful games, unafraid to dive into dark, uncomfortable topics while still delivering the humor, heart, and chaos fans expect.\n\nTakayuki Yagami returns stronger, wiser, and more determined. What begins as a seemingly simple investigation rapidly expands into a sprawling conspiracy involving bullying, suicide, corruption, revenge, and systemic failure. The narrative is fearless in its approach — it explores how institutions can fail victims, how trauma shapes people, and how the pursuit of justice can become dangerous when morality is blurred. Every chapter raises the stakes, and the emotional weight of the story builds steadily until it becomes gut-wrenching.\n\nThe cast is phenomenal. Yagami continues to be one of gaming’s most human and layered protagonists, and Kaito once again brings warmth, loyalty, and emotional grounding. New characters — from the dangerous but charismatic antagonists to the students Yagami works with — are exceptionally written. The dynamic between characters drives the story, and every major reveal feels impactful, earned, and unforgettable.\n\nCombat has reached its peak here. Yagami now has multiple martial arts styles — Crane, Tiger, and the new Snake style — each designed for different tactical approaches. Crane excels in crowd control with acrobatic spins and sweeping kicks, Tiger delivers raw power to break defenses, and Snake enables counters and takedowns that turn an opponent’s aggression against them. Fights are fast, stylish, heavy-hitting, and visually spectacular. New mobility options and parkour mechanics make confrontations feel more fluid and cinematic than ever.\n\nThe investigation gameplay has evolved dramatically. Stealth segments are improved, tailing is more strategic, and evidence gathering is more engaging. Chase scenes are high-energy, puzzle solving adds thoughtful variety, and the game ensures that being a detective never feels repetitive. Every tool Yagami uses — from gadgets to observation skills — reinforces immersion rather than distraction.\n\nWhere [i]Lost Judgment[/i] truly leaps beyond its predecessor is in its world and side activities. The high-school setting is one of the game’s most brilliant ideas, introducing “School Stories,” a huge interconnected set of subplots that range from deeply emotional to completely insane. Street dancing competitions, boxing leagues, robotics clubs, biker gangs, photography clubs — each built with surprising depth, storytelling, and character development. What begins as a case turns into a true connection between Yagami and the students, giving the game heart and humanity that lingers long after you finish.\n\nAnd, of course, Kamurocho and Ijincho are overflowing with RGG Studio personality: arcades, Virtual Fighter, Drone League, skateboards, gambling, bar interactions, girlfriend routes, challenging mini-stories, and dozens of side cases filled with absurd humor and emotional resonance. It’s impossible to walk ten steps without stumbling into something entertaining.\n\nVisually and cinematically, [i]Lost Judgment[/i] is stunning. The Dragon Engine delivers lifelike animation, incredible facial detail, realistic lighting, and dramatic camera direction. The soundtrack perfectly captures the emotional extremes — brooding detective themes, tense investigation tracks, comedic melodies for lighter moments, and high-octane battle music with heavy bass and electric guitars that make every fight feel legendary.\n\n[i]Lost Judgment[/i] is a masterpiece of investigative storytelling — darker, bigger, and more polished than ever without losing the soul of the franchise. It challenges players emotionally and morally while delivering constant excitement, humor, and heart.\n\nIt isn’t just about solving a case — it’s about fighting for justice in a world that looks away.\n\nAnd Takayuki Yagami refuses to look away.\n\nYou can check my gameplay video [b][url=https://www.youtube.com/playlist?list=PLxvWbrDkSJsAGBMzHetKEIkevpf1BQluV]here[/url][/b]\n\nSubscribe To My Youtube - https://www.youtube.com/channel/UC1ZOvQERjGtRkl7ImTcDzdw?sub_confirmation=1\nJoin My Discord - https://discord.gg/uM94ehT7hv",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Totally worth playing Lost Judgment. highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak yakuza. Play this game if you want to experience peak",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "combat is too good for its own good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "we need judgement 3\n\nif they cant get yagami, make it star kaito",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you get the chance to play this game all the way through you should.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the greatest games out there. Need another sequel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game, worth it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really love the school setting of this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "More styles = better gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fucking lockpicking that i LOVE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yakuza does GTO x Persona",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Jin Kuwana did nothing wrong!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I lost it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Stutters simulator",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "truly masterpiece",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MY BELIEF WAS UNWAVERING WHEN I DIG IN MY HEELS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Judgement Core",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME EVERRRRRRRRRRR",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SAWA NOOOOOOOOOOOOO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems like peak so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game as the first",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best of the best RGG has put out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Video Games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "simply peak.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak asf",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak combat 🤑",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ugh tak, you're back",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⣓⡐⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⠈⠈⠑⠙⠊⠽⠩⠳\n⠑⠂⠁⠀⠀⠐⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣧⡖⣣⠗⣫⡶⢖⣲⣶⣤⣤⣄⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⣀⣀⡄⠀⠀⠈⠉⠩⢵⡾⣷⣾⣿⣿⣿⣿⣿⣿⠀⢠⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠤⠌⠣⠙⠣⠻⠟⠟⣣⠤⡀⢀⠀⠙⡿⢻⠟⠻⠛⠛⠛⠉⠃⠀⠄⠀⠀⠀⠀⠀\n⠀⠀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡤⢣⠝⣀⢀⡄⣀⢂⡀⠀⠄⠀⣈⠱⢣⢒⣘⣵⢇⡀⡀⢤⢠⢒⡶⣷⣤⡀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡞⡵⣫⡽⣡⣏⡾⣽⡯⣷⣥⡾⣴⢶⡏⡡⢊⣿⣿⣦⠧⠉⠀⠀⠀⠀⠀⠈⠱⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣣⠎⠵⣣⢟⡵⣯⣿⣷⣿⣿⣿⣟⣧⢛⡽⢓⢎⣷⣿⣿⣿⣯⣾⣵⣲⠰⣡⠀⡰⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠒⡥⣰⡙⢶⣋⣟⣷⣿⣿⣿⣿⣿⡟⡮⢓⣌⢣⢞⣼⣿⣿⣿⣿⣿⣿⣿⣷⣮⣺⣵⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣢⠹⣰⢡⢛⠦⡱⣎⡿⣻⣿⣿⢻⣧⢭⡞⣟⣾⢳⣮⢿⣿⣿⣿⡸⣟⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀\n⠀⠀⠀⡀⠀⠀⡄⠂⠀⠀⠀⠀⠀⣂⠧⡑⣎⠣⢞⡱⣝⢾⡽⣞⣳⣿⣾⡙⠸⡜⠋⠓⠸⣻⢿⠿⠟⡷⣙⣮⢻⠿⣿⣿⢻⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢸⠁⠉⡆⠀⠀⢰⡈⢶⢱⣈⠹⡆⢷⡎⣿⣸⢏⣹⡿⣿⠿⡶⡀⠆⡀⠀⡈⠉⠈⠀⢰⣿⣏⡏⣿⢱⡏⡇⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠂⠔⠘⠢⠄⠀⠀⢧⡘⢆⢣⢌⡳⢜⣣⢽⣺⣭⣛⢾⡹⣎⢯⣱⠳⣞⡴⣟⣔⣺⡵⣴⣿⢻⣽⡾⣱⠏⣜⠁⠀⠀⠀⠀⠀\n⠀⠀⠀⡐⠁⠀⢀⠀⠀⠀⠀⠘⢦⡑⢎⠲⣌⢲⢩⠖⣯⢖⡧⢏⢮⡱⠎⠒⠁⠉⠀⠐⠈⠉⠉⠉⠒⢽⣛⠾⣷⠩⢞⡰⠀⠀⠀⠀⠀⠀\n⠀⠠⠀⠀⠀⠈⠀⠀⠀⠀⠀⢈⠦⡑⠬⣑⠢⣃⢮⣙⢮⡛⡌⡋⠄⢀⣄⣤⣤⣶⣤⣦⣠⣄⣀⠀⠀⢈⢯⡛⢧⢙⡰⠂⠀⠀⠀⠀⠀⡀\n⠠⠀⠀⠀⠀⠀⠠⠀⠀⠀⠀⠘⢠⠀⡃⢆⠓⡌⢶⢩⠞⡵⢣⠄⠀⠀⠁⠉⠈⠉⠈⠉⠙⠋⠛⠷⠀⠈⠢⣝⢂⠣⠄⠀⠀⠠⠐⠀⠁⠀\n⣶⣾⣦⣤⢄⠀⢀⠠⠂⠀⠀⢠⠃⠔⡈⠆⡱⠘⡬⢒⡝⣣⠏⡔⠀⠀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡱⢌⠢⠁⢀⠀⠀⠀⢀⠀⠀⠀\n⡿⣿⢿⠦⠆⠀⢌⠀⠀⠀⠀⠀⠌⠒⠠⠑⢠⠓⡌⢣⠜⢦⡋⢖⡌⢠⡀⠉⠙⠛⠚⠶⠶⠶⠖⠀⢠⢳⡘⠄⠊⠀⠀⠀⡀⠀⠀⠀⢀⠐\n⢳⣙⢮⡛⣎⡆⢁⡀⠀⠀⠀⡀⠌⢢⠡⠘⡀⢂⠌⡑⢎⡥⣙⢎⡼⡡⢜⡐⠣⠌⠒⠠⠂⠔⢠⢐⢣⡒⠁⠀⠀⠀⠀⠀⡀⠀⠀⡐⠀⡀\n⠳⣎⠶⣙⠶⣹⠏⠀⠀⠀⠠⡇⢌⢂⡑⢢⠐⡀⠂⠌⡐⢜⡱⢎⡶⣝⣮⣼⡱⣞⡴⣢⣄⣂⢦⣙⠦⠅⢸⣷⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⡹⣌⠳⡍⣞⡱⣻⣔⣀⢠⣿⠐⣊⠦⡙⢆⠦⣑⠨⡐⠠⠈⠲⣍⠾⣱⢞⣳⢿⣟⡿⣷⣿⣞⣧⢏⢏⠽⣧⣽⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿\n⡱⢌⠳⡘⢤⠓⡥⢋⠅⣿⡇⠎⡔⢣⡙⣬⠲⣁⠧⡘⠥⡓⠤⣈⠳⠱⢮⡹⢞⡼⡹⢧⠳⡚⠬⢋⣾⣿⣿⣿⣿⣿⣿⣿⣿⣟⣧⣿⣻⣿\n⡱⢊⠵⡘⢢⠍⡴⢉⠒⡏⠰⢩⠜⡥⢓⣆⠳⣌⠲⣉⢖⡩⠖⣥⢚⡴⢢⡱⠌⠤⡉⢄⡃⠶⣘⣼⣿⣿⣿⣿⣿⣿⣿⣿⣷⣿⣻⡾⣽⢻\n⢥⢋⡖⡩⢖⡩⢖⣉⠒⡌⡱⢊⡼⣱⢫⡔⣫⢔⡳⣘⢮⡱⣻⡜⣧⢏⡧⢣⡙⡔⠰⡨⣜⡱⠎⢹⣿⣿⣿⢿⡿⣿⣿⣿⣟⣯⣟⣿⡽⣫",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waaaaaaaaayyy better than the first game, had me hooked from start to finish. The story is gripping and has plenty of twists that I didn't see coming. The combat, while similar to the first game's (as well as the latter mainline Yakuza titles) is really fun thanks mostly to Yagami's new moveset. \r\nThe only complaint I can think of is that some of the additional 'investigation' mechanics are kind of a snore to engage with, and the stealth 'mechanics' are really just a long, scripted sequence with little to no room for failure (or experimentation). \r\nStill, that didn't ruin the experience for me. I think this might be my favorite spinoff in the series now.\r\nOh, and don't worry about having played the first one, it's not really all that important for context - in fact, they kind of give you context when appropriate.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "What's true justice? Amazing story, cast, characters, world building, game play mechanics. Easily a 10/10 and one of the best stories you can play in a game. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "- Story is decent.\r\n- Side-content is a lot better than Judgment 1 overall but a big negative is HOW you get some sidecases, the keyword lookup system is beyond stupid and confusing.\r\n- The combat is quite possibly the best out of any RGG game including pirate and gaiden. It can't be topped imo.\r\n- Dancing minigame.\r\n\r\nOverall 7.5/10",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "This was the first big game I played on the Steam Deck. I was already playing this on my PC, but when I bought the Deck, I immediately migrated to the more portable device. There, it ran without problems at 45fps and I eventually completed the game.\n\nA sequel to Judgment, we play as Detective Yagami. While it takes place in the same setting as the Yakuza games, we are shown the point-of-view of someone from outside the organization. Here, we see how the Yakuza’s decisions impact those of regular civillians. Thankfully, we control someone that is skilled in the martial arts and can go toe-to-toe with even the toughest criminals.\n\nThis time, we are tasked in solving a high profile case linked to childhood bullying. This topic is very realistic and adds nuance to the characters and their motivations. Is everything that is legal, morally correct? Is all of vigilantism bad? What are the limits of the law and those acting against it? It tackles topics that even until now are up for debate.\n\nIn terms of gameplay, it’s the same fare as the other RGG Studios games, and it uses the Dragon Engine as well. Yagami now has four fighting styles, Crane, Tiger, Boxer, and Snake. These are fun to use and each has a variety of unique quirks. My favorite is the Tiger style just because of Flux Fissure that I’ve been spamming since the first game. Combat is smoother this time around, probably the second best in the series next to the newer Gaiden.\n\nMin-games are plentiful and I spent most of my time in the Robotics Club challenges. I loved this simple capture the flag game so much. Unlocking upgrades to the robot is fun and I steamrolled this entire substory at once.\n\nI also enjoyed the boxing, dancing, and motorcycle racing mini-games. There is so much to do here, from dating the school nurse to shredding the streets with your skateboard. I also completed the Kaito Files Expansion, which added even more hours into the game and let us play as the supporting character, Kaito.\n\nJust like other games from RGG Studios, it combines lighthearted humor with sudden flashes of seriousness and maturity. If this is something you’re interested in, or just want more from the RGG world, this game is for you.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Probably the best brawler gameplay in the entire franchise so far, with 4 styles that all feel satisfying to play with and a ton of abilities to grab. The story is pretty great too, very small downgrade from the first Judgment though. Game is easily 10/10 gameplay and 8/10 story. \r\n\r\nJudgment 3 please I beg",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "What a beautiful, beautiful game. I loved it, there's so much to do as well, and the Kaito Files, was easily a B tier DLC. I recommend this game, Lost Judgment is fantastic and easily one of RGG's top tiers.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Incredible, incredible game. You can tell RGG put so much love, care, and passion into this game. I, as everyone else who has played both Judgment games now hope that RGG can somehow produce a third Judgment game, us all wanting Yagami's story to continue. If not, it was an incredible honor to play as Yagami and experience his story, along with all the other amazing characters in both Judgment games. 9/10 with only some gripes like annoyingly broken enemies and some mini games that outright suck. Easy to forget the bad in this game when literally everything else is amazing and an ending that will make you sit at your PC as the credits roll, thinking about how we humans come to terms with things, if the Law truly helps and is good, as well as what Justice truly entails and if it's right or wrong. Snake style best style. Farewell, Tabo.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Amazing gameplay, amazing story, amazing side quests. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "one of the best game i ever played great story. combat styles and beautiful graphics would recommend to play one time if you want a game with good combat and a nice story!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "[b]Peak story driven game with very deep plot, character development, mystery and great complexity[/b]\n\nAs expected from RGG Studio, Lost Judgment delivers an experience as great as it's predecessor and the Yakuza games while improving in a few areas, but still inheriting pretty much everything as it is.\nThis is an excellent sequel and a must play for any Yakuza fan and even more for those who played the first Judgment game. Theses guys never fail to amaze when it's about the story, complexity and character development; not to mention the good sense of humor and stylish cinematography and scenes. Really impressive stuff.\nThe game took me 23 hours to beat while focusing on the main story only. Lost Judgment, like it's predecessor and pretty much every Yakuza game, has pretty much the same core structure and gameplay loop where you just go from point A to point B to watch a cutscene and fight thugs along the way with a janky combat system. I never really liked RGG games combat system and already got tired of the exact same structure and gameplay loop after playing so many Yakuza games and Judgment 1, so I decided to focus on the main story only and had a great time with Lost Judgment. I play these games for the plot, not for the gameplay really. But, I know that there are tons of minigames and sidecontent to do in the city that add up a lot to the value of the package as well.\n\nDespite the repetitive combat system and gameplay loop and some jank in the combat, chasing and platforming parts, the story is so gripping and interesting that it overshadows the game's system flaws. The story also had great pacing, revealing new secrets, new characters and elements that added complexity to the plot and made me want to know more and keep playing it nonstop until the end.\nLost Judgment is absolutely recommended if you're looking for an excellent story driven game with deep and complex development with great characters.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Combat:\r\nEvery fighting stance is insanely fun, especially boxing once you upgrade it. Easily the best fighting mechanics in any game of this style.\r\n\r\nHigh School Segments / Mini-Games:\r\nMost mini-games are fantastic. The robot one was confusing at first (the game explains it terribly), but after a YouTube guide, it became insanely fun. The boxing mini-game is my absolute favorite.\r\n\r\nSide Missions:\r\nClassic quality—fun, varied, and well worth doing.\r\n\r\nStory:\r\nGood as always, but pacing can feel off. Once you know everything, it’s a lot of facing the same people repeatedly. Still engaging overall.\r\n\r\nOverall:\r\nA fantastic sequel that improves on nearly every aspect of the first game. Best fighting, fun mini-games, solid story—highly recommended.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Rather good, so far I've had the most fun with the seiryo school quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Stunning cast\n\n(Takuya Kimura \nKoji Yamamoto (Kuwana)\nHiroshi Tamaki (Soma)\nAdo)\n\n[spoiler] some parts of the story made me frown tho cuz made me wonder \"you gonna go that far for punishing a bully...?\" It didnt make too much sense to me at least. And the connection between RK, Public Health and the bullying cases seems a bit too forced [/spoiler]\n\n\ncombat's undoubtedly one of the most rewarding among the series\nsmooth, clean, elegant\n\nthe OST are some of the best I've listened to (Blue stompin', Unwavering Belief, Viper etc.)\ngraphics are much better than Judge eyes\n\n\n8/10 Definitely Recommend",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A very good sequel that also can stand on its own with great antagonist and amazing gameplay.\n\nKitakata did nothing wrong/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "They will never top this game ever. In Raimi Spider-Man terms this is the masterpiece sequel of from an already great foundation that was the first game. With the recent changes, if they commit to the single heat bar system from PYIH and implement it on the third judgment game Imma crash tf out.\n\nSeriously if there's gonna be a third game, I doubt it's going to surpass this game, at the very least I can only hope it would surpass the 1st judgment game and be good enough to stand with this masterpiece of a game.\n\nKino. Peak. Goated. Tenoi.\n\nThis game will be remembered as the game where RGG studios peaked for ten years at least!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lots of things to do, an interesting story and improved combat over the previous title. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The main story is especially engaging, and that alone makes Lost Judgment a must play. It is an improvement on almost all aspects from the first game. My only gripe is that I feel the minigames are kinda a step down from what I would expect from RGG studio. The biker gang, robotics club, and even the boxing minigame overstay their welcome and can get a bit frustrating to get through, but they are a major part of the school stories.\n\nIt took me nearly 70 hours to complete the main story, all school stories, majority of side stories, and get full affection for 2 out of 4 possible girlfriends, although I tend to take my time not to rush through anything. You know a game is good when you don't realize the massive amount of time you already put into it until the end credits roll.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the graphics way better than the first game\nside story or school story had longer progression and more grinding -_-\n\nyeah the combat better thaan the first game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a damn good game, both as a sequel to Judgment and also being its own thing. If you enjoyed Judgment, you will 100% enjoy this one too.\r\n\r\nFirst of all, I really enjoyed the story. Although not really comparable, I think I enjoyed this one's plot more than Judgment's. They're different though, but I feel like the themes in this game were better overall. The story of this game is pretty much a standalone experience, so you don't HAVE to have played Judgment. However, the first game does provide more context to other background characters.\r\n\r\nAnd then there's all the side activities that got a HUGE upgrade from the first Judgment. There are a bunch of school stories (I think 10?) that all have their own minigames. These did kill the pacing of the main story pretty badly, but they still provided an excellent and long side-story. I did a bunch of other side quests too, but left the rest undone. There are some pretty solid quests, but then there are also those that just drag on without anything interesting.\r\n\r\nAs for the gameplay, this is a big upgrade from Judgment. Although I enjoyed the original's combat too, this one just takes it to a new level. The two new fighting styles are a welcome addition (I especially enjoyed Snake), but also the original two ones feel smoother overall. There are a few other new gameplay mechanics too, such as parkour, which I felt like was really well made. The only thing that I felt like was a downgrade are the chase sections. The new elements it introduces didn't really click with me. They weren't that bad though, so it didn't ruin the experience at all.\r\n\r\n9/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Straight up 5/5.\r\n\r\nAmazing sidequests. Also using the skateboard is really useful. One of the best games from the studio so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man I love this game. The fighting mechanics, the chase scene and the mini games all fit together very well the cut scenes and animation is too good and love the plot. Got the sequel before judgement so I don't know the backstory of some characters and I'm excited to learn about them when I buy judgement",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't done jack shit in the main story and I've spent almost 20 hours dicking around town doing school quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Lost judgement is soooooo good. I would say its one of the best lad games. every battle style is so unique and good and the best thing is that they even work together to be even stronger. the story i really enjoy (rn) and i don't have any complaints rn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is better than I expected. Gameplay and combat-wise, it’s far superior to the first game. The story is on par with the first one, and the mini-games are much more fun now, except for the robotics club part. That shit is frustrating to complete and actually requires heavy grinding,it actually took me at least a whole week to finish. Anyway, I definitely recommend it if you’ve finished the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is just plain AWESOME! I believe Ryu Ga Gotoku is a GENIUS for making all these amazing games with so muchhhhhh to do in them and at the rate in which he gets them done. I hope for more Judgement installaments but ill settle for anything Ryu makes quite honestly!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have mixed feelings about this game (base game only, I haven’t played Kaito’s DLC), but not enough to give it a negative review.\n\nCompared to other reviews I’ve read, here’s my take: it’s true that the main story drags on for too long — I actually struggled to finish the last chapter because it felt unnecessarily stretched out. There’s an interesting twist near the end, but nothing mind-blowing, and overall it doesn’t really justify the length. Plus, a few story events unfold exactly as you’d expect, which makes some parts feel predictable.\n\nAnother thing I saw mentioned was the fan service from RGG Studio throughout the game. Personally, I didn’t mind it. It feels fitting, especially since this series leans less toward “me against the world” and shows the protagonist relying more on others compared to the Yakuza series. I actually see that as a strength — showing the main character struggling makes him feel more human, more realistic, and less of a superhero (even if that’s not what the game’s mainly going for).\n\nI also read reviews saying the story’s resolution doesn’t show much moral gray area — that it’s too black and white. I agreed with that for much of the game, but in my view, within the series’ moral tone and the protagonist’s perspective, the ending actually lands more on the gray side than on pure extremism.\n\nI do agree with people saying the first game is better overall. I liked that this one tried something different story-wise, but by the end it falls back into the usual Yakuza clichés and conspiracies — which I guess are there to justify the Beat ’em Up gameplay. What I really didn’t get, though, was the stealth aspect. It’s pretty bad, and there are almost no chase sequences, so I don’t understand why there are skill upgrades tied to it. It’s a shame there’s no Judgment 3 in sight, because the investigation mechanics could be much better developed — they end up feeling repetitive. Maybe I’m just missing having a proper detective game like L.A. Noire.\n\nThat said, it’s still around 15–20 hours of fun, and it’s hard to pass up if it’s 50% off (or more).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ben Belief vs. John Lost Judgement\n\nA bit worse than the first game (story wise), but still great\n\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best RGG game full stop. I've played pretty much ALL of them and this one takes the cake. \nThe characters are amazing, the game play is engaging the entire time, and the story is so deep and interesting. \nI loved everything about the game play, how it takes the familiar 'beat-em-up' style from the early Yakuza games and builds on it. I liked the fighting in this game much more than Yakuza 0 if you're familiar with that one. I also loved exploring Ijincho again in this game (more so than LAD IW.)\nI also liked how they mixed a bit of Persona into this game with the side stories and helping the students at Seiryo High.\nEverything that Judgment did right, Lost Judgment does better. I really hope that RGG continues to make more games in this series. It's fun to have an actual spin off to a series that I like as much or more.\nI can't recommend this game enough, 20/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lost Judgment tells a crime story about bullying [spoiler]and self-justice[/spoiler]. The whole main story feels like watching an action thriller. If you don't like a lot of cutscenes, then this game is not for you.\r\n\r\nGameplaywise there is the typical fighting (like in the yakuza games), chasing scenes, investigating, side stories and mini-games. The game ran well for me without gamebreaking bugs. Overall it is a great action game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the second installment of the game \"Judgement\" still kicking it, amazing direction they went as the gameplay content in this has SKYROCKETED. There's minigames for everything boxing, motorcycles, dancing, LITERALLY everything except for karaoke which is ironic for a rugagotoku game haha.\n\nMy review of Lost Judgement encapsulates the same exact feeling I felt with Judgement, just the story was a bit shy in comparison, still BANGER story maybe like 4th behind Yakuza 0, Judgement and Yakuza 7. \n\nHidden gem . aged well, give it a go if you have a couple bucks and some free time 👍 \n\nStory 8/10\nGameplay 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An improvement in every way.\r\n\r\n2 towns to explore,\r\n4 combat stances all with their own unlock tree (vs only 1 in the first game since Crane style was useless),\r\nA massive secondary questline in the school, where you act as the adviser of the detective club (more mini-games and content, more fun than it sounds),\r\nCombat that really tries to stay interesting by rewarding you for mixing things up (instead of Tiger Drop spamming in the first game),\r\nSpeaking of Tiger Drop, there's now a built-in basekit parry mechanic on Snake and Boxer styles for more engaging 1v1 fights.\r\n\r\nVery nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The absolute best combat of any RGG game. The story is great but not as good as judgment, and the side content favors quantity over quality, but the game is worth it just to experience the feeling of being an overpowered lawyer turned detective martial arts expert that beats up gangsters and teenagers on every road crossing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Judgment was great, but Lost Judgment was even greater. An absolute experience and a huge improvement over the first game overall. Bought it on sale, and It's safe to say it's easily in my Top 3 now. The combat was impressive, I used Snake style for most of the fighting coz it's really THAT good. Story wise, it's a bit better on some parts but generally on par with the first Judgment. I loved the side quests so much especially School Stories, I would totally recommend finishing it until the very end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. I loved first Judgement and this one didnt disappoint. Before i bought this game i read some reviews here about story become worse after first game but i played it myself and discovered that all this comments are wrong. Plot is amazing and interesting to follow. Me and my friend whom i streamed this game on discord was always deducting about what will happen next. Kaito files is must have, its story is peak and i really loved it. Gameplay is peak like always, fights are really fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most mouthful RGG game I've ever played so far but it's so fun and the fun seems so endless. If you are a completionist, I think this game also does not feel so tedious like Ishin although it might actually have more stuffs. Storywise, Judgment is deeper and grimmer and feel more personal to Yagami but this one keeps entertaining me like no end.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While its combat gets stale after a while, the story in this game is of immense quality. 100% worth a playthrough - just pay attention to its dialogue!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A pretty solid followup to the amazing first Judgment. The combat is better than ever, and the main story is intriguing, if not paced a bit strangely. The opening is quite slow and most of the interesting twists occur halfway through the game, so the ending feels like a bit of a shallow chase.\r\n\r\nThe side content in this game mostly revolves around the high school stuff, which is a cute and funny, but some of it tends to drag on way too long. Still, some of the side cases in this game have some of the funniest quest content since Yakuza 0.\r\n\r\nSolid entry in the series and a must play if you're an RGG fan, but has a lot of room for improvement if they ever make a third  game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What if the combat was even better, the video game. \n\nThe minigames for the school stories can be a bit grindy, but the main game really respects your time. The main story suffers a bit though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already a great game but man, why r the devs so bad and never fixed crashing issue. Made me have to research graphic card drivers lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A brilliantly crafted action game with everything you could want from the Yakuza series and so much more, and with one of the most engaging and enthralling stories of the franchise!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After finishing this game, I relate to this video more (https://www.youtube.com/watch?v=YOvrnJ3116g). Here's to hoping that they don't actually stop at Lost Judgment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a far more better sequel than the first game, where there are many new and better features and mechanics, a wider map, and more exciting gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this game the same as how I loved Judgement. The story was was great but I would still prefer Judgement's story over Lost. However, gameplay wise (side cases, school stories and mini games) they have NAILED it in Lost judgement. I loved playing the aftermath of the game more of the story itself. but still the devs made a great job with the story and the aftermath of the game :3 10/10 would play again \r\n\r\nI also played the dlc and enjoyed it as much as the main game :3, the judgment games were super fun to play and I will be waiting to play the next games they make :3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the peak of gaming theres crazy side content, the combat is goated, the music, the fights, the cutscenes. It improved everything from the first game by a mile. I can't wait for the third one haha",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This one is basically my fault as I didn't read anything about the game and have only seen a very narrow trailer that doesn't show a full picture. I liked first one a lot and basically went in blind.\r\n\r\nAfter the first game that's filled with mystery and cop drama, this one heavily shifts into high school setting. How Do You Do Fellow Kids Yagami is this time riding skateboard and helping high school student clubs to solve their meaningless issues. This is a huge letdown after the epicness of the first Judgement game and it's mystery filled and action packed plot. I get the point of the main story and what idea it tries to spread but whoever chose to do it using high school setting deserves to be fired. People don't get their detective role fix by fighting high school bullies or helping dancing club how to dance. Japanese have also mastered the pacing, adding so much useless filler and prolonging things with pointless dialogue that in 6 hours of main story basically nothing happens.\r\n\r\nFighting is at least fun and feels much better than the first instalment and the Yakuza games that I have played until now. And that's about it.\r\n\r\nI don't think I'll ever play this unless I somehow get too much free time with nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "P.S.: Game is good (good combat, quite a bit of side content) but does not fulfill expectations because the story was not up to standard and felt a bit stretched for no reason (atleast it was not rubber bullets 😂). Also the price of the game could have been better.\r\n\r\nWhile Judgment was absolutely great for me, I had bigger expectations for the sequel. And it did do some great things like better combat system, even better looking graphics and environment and adding more side quests and minigames which the previous game was lacking. Though I still felt off after completing this game. Since the Judgment series is very story focused and in the first one it was a thriller and nail-biter till the end to find out who was a culprit and what was going to happen next.\r\n\r\nThis feeling was not much present in this game, in the first few chapters I was just wondering why my main character Yagami who just solved the most insane cases is now suddenly working on school bullying and spending most of his time in a school asking around and harassing people. In the first few chapters I had great fun with the combat but I was also wondering why we are beating Teenagers so much for information instead of working like a fricking detective and not blowing cover every second. Like, any villain could just see this stupid detective and turn him down or atleast hide all the evidence. Also him harassing everyone for information just felt unprofessional.\r\n\r\nWhatever, so we fast forward a couple chapters later and the story is actually getting interesting and I am absolutely hooked. Guess what happens next? these frickass villains just tell Yagami what he needs to know. I feel like if some of these people just kept their mouths shut Yagami would be stuck in a dead-end for sure. But I guess Japanese stories do not mind so many plot conveniences. I mean if its a detective game I should be looking for clues in their speech instead of being handed the information directly!\r\n\r\nI still had hope that the ending would be great so I played through and the last segment of the game did deliver a good closure to the story, but the problem was that the last segment was so dragged through to make it like a 3 hour stretch of me just doing stupid lazily implemented parkour followed by beating the boss' grunts until you reach the final boss. It just made me tired and wanting to just end it as fast as possible. You know even modern movies are now 2 to 2.5 hours instead of a mandatory 3 hour stretched which a lot of old movies used to have. I felt like this game would also have been great if the school chapters in the start and the blatantly dragged on final sequence which could have been a banger if it just was made shorter.\r\n\r\nStill, I did enjoy the game but I seriously was hoping for RGG to deliver a solid story like in Judgment and Yakuza 0. I do understand that bullying in Japan is taking very seriously and also the work culture is different so a man takes pride in the work not the task but it doesn't make the story engaging does it? I would recommend this game for the price of Judgment but the increased price for a sort of stretched out and dragged on story of a sequel is not worth it in my opinion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "20 mins in you have to do a dumb detective scan and it's a huge waste of time. a huge area and you have to keep zooming in to random crap to find the things they want. the school's map is horrendously designed. skateboarding is trash. this whole game belongs in the trash.\n\nJust got my first side quest and it's go here and stand around listening to bullshit for 3 minutes to pick up \"buzz words\" this game excels at wasting time.  the death race is unwieldy cancerous shit too. now they add a stupid squirrel treasure hunt padding bullshit. honestly fuck this shit game. \nThe QTEs in this shitty game is also atrocious.\n\nYou also don't get the tiger drop equivalent in this game till chapter 12. \n\nAs for the story itself. Yagami is a self righteous prick who's obviously fighting for the wrong side. The game is also sexist, the female antagonists get preferential treatment even though they did the same or worse crimes as their male counterparts. They get off with a lighter punishment than what they deserve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Everything except the main story is actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yakuza games are always JUST SHORT of greatness.\n\nWhatever good thing they have in the game, the writing, the combat, whatever minigame part you enjoy..\n\n... its ultimately always dragged down to the abyss by horrific pacing that, for no reason at all, forces you to interact with some horrifically dull and tedious sidecontent of the game that you were trying really hard to ignore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst RGG studio game or yakuza game ever!!!! Except the combat, all are BS. Especially the story. What's the point of this detective game or story? If criminals just say shit outright without no interrogation or investigation. It's more like a Confession game! XD\n\nAlso I love the RGG studio games especially the yakuza games. I know some might say Yakuza games are goofy and I know that but within that goofiness each had good storyline and plot-twist. This game's story is utterly the worst shit ever!!\n\nP.S.- I bought dlc this weeknd and man....I gotta say the dlc's story is much better than base game except Kaito easily could've done a DNA test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just not as fun as the other games, which had me invigorated. even the worst game before had me trudging along just to finish, but the story here isn't even that captivating... its just boring. gameplay is fine, don't buy the dlc...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A Yakuza game without the humor? Sign me up.\r\n\r\nIn this game you play Takayuki Yagami, a 38 year-old private detective who smokes, wears a biker jacket, and spends his time hanging out at a high school. There are people everywhere and he presses A to talk to them. He is a wanted man by armies of violent pedestrians.\r\n\r\nYou know how a bad movie will show unnecessary transitions, like if someone goes somewhere else the camera shows them leaving, getting in a car, driving, arriving, getting out, etc.? That is 90% of this game. Go to a place, open a door, have... (A) a... (A) conversation... (A), go to elevator, show entering elevator, show leaving elevator, go back to headquarters, go to merchant, select that you want to shop, add stuff to cart, select buy stuff in cart, show cutscene of merchant saying goodbye.\r\n\r\nIt's typically easy to establish in a story that someone smokes because that's something you can show them doing while they're doing something else like interrogating a panty thief or entering an elevator. But here it's a thing you press A to do at trash bins. \r\n\r\nYou buy skills with points you primarily earn by beating up people. Fortunately, the typical side street features 2-3 respawning walking clubs who really don't like specifically you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is basically my fault as I didn't read anything about the game and have only seen a very narrow trailer that doesn't show a full picture. I liked first one a lot and basically went in blind.\r\n\r\nAfter the first game that's filled with mystery and cop drama, this one heavily shifts into high school setting. How Do You Do Fellow Kids Yagami is this time riding skateboard and helping high school student clubs to solve their meaningless issues. This is a huge letdown after the epicness of the first Judgement game and it's mystery filled and action packed plot. I get the point of the main story and what idea it tries to spread but whoever chose to do it using high school setting deserves to be fired. People don't get their detective role fix by fighting high school bullies or helping dancing club how to dance. Japanese have also mastered the pacing, adding so much useless filler and prolonging things with pointless dialogue that in 6 hours of main story basically nothing happens.\r\n\r\nFighting is at least fun and feels much better than the first instalment and the Yakuza games that I have played until now. And that's about it.\r\n\r\nI don't think I'll ever play this unless I somehow get too much free time with nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 mins in you have to do a dumb detective scan and it's a huge waste of time. a huge area and you have to keep zooming in to random crap to find the things they want. the school's map is horrendously designed. skateboarding is trash. this whole game belongs in the trash.\n\nJust got my first side quest and it's go here and stand around listening to bullshit for 3 minutes to pick up \"buzz words\" this game excels at wasting time.  the death race is unwieldy cancerous shit too. now they add a stupid squirrel treasure hunt padding bullshit. honestly fuck this shit game. \nThe QTEs in this shitty game is also atrocious.\n\nYou also don't get the tiger drop equivalent in this game till chapter 12. \n\nAs for the story itself. Yagami is a self righteous prick who's obviously fighting for the wrong side. The game is also sexist, the female antagonists get preferential treatment even though they did the same or worse crimes as their male counterparts. They get off with a lighter punishment than what they deserve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P.S.: Game is good (good combat, quite a bit of side content) but does not fulfill expectations because the story was not up to standard and felt a bit stretched for no reason (atleast it was not rubber bullets 😂). Also the price of the game could have been better.\r\n\r\nWhile Judgment was absolutely great for me, I had bigger expectations for the sequel. And it did do some great things like better combat system, even better looking graphics and environment and adding more side quests and minigames which the previous game was lacking. Though I still felt off after completing this game. Since the Judgment series is very story focused and in the first one it was a thriller and nail-biter till the end to find out who was a culprit and what was going to happen next.\r\n\r\nThis feeling was not much present in this game, in the first few chapters I was just wondering why my main character Yagami who just solved the most insane cases is now suddenly working on school bullying and spending most of his time in a school asking around and harassing people. In the first few chapters I had great fun with the combat but I was also wondering why we are beating Teenagers so much for information instead of working like a fricking detective and not blowing cover every second. Like, any villain could just see this stupid detective and turn him down or atleast hide all the evidence. Also him harassing everyone for information just felt unprofessional.\r\n\r\nWhatever, so we fast forward a couple chapters later and the story is actually getting interesting and I am absolutely hooked. Guess what happens next? these frickass villains just tell Yagami what he needs to know. I feel like if some of these people just kept their mouths shut Yagami would be stuck in a dead-end for sure. But I guess Japanese stories do not mind so many plot conveniences. I mean if its a detective game I should be looking for clues in their speech instead of being handed the information directly!\r\n\r\nI still had hope that the ending would be great so I played through and the last segment of the game did deliver a good closure to the story, but the problem was that the last segment was so dragged through to make it like a 3 hour stretch of me just doing stupid lazily implemented parkour followed by beating the boss' grunts until you reach the final boss. It just made me tired and wanting to just end it as fast as possible. You know even modern movies are now 2 to 2.5 hours instead of a mandatory 3 hour stretched which a lot of old movies used to have. I felt like this game would also have been great if the school chapters in the start and the blatantly dragged on final sequence which could have been a banger if it just was made shorter.\r\n\r\nStill, I did enjoy the game but I seriously was hoping for RGG to deliver a solid story like in Judgment and Yakuza 0. I do understand that bullying in Japan is taking very seriously and also the work culture is different so a man takes pride in the work not the task but it doesn't make the story engaging does it? I would recommend this game for the price of Judgment but the increased price for a sort of stretched out and dragged on story of a sequel is not worth it in my opinion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yakuza games are always JUST SHORT of greatness.\n\nWhatever good thing they have in the game, the writing, the combat, whatever minigame part you enjoy..\n\n... its ultimately always dragged down to the abyss by horrific pacing that, for no reason at all, forces you to interact with some horrifically dull and tedious sidecontent of the game that you were trying really hard to ignore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst RGG studio game or yakuza game ever!!!! Except the combat, all are BS. Especially the story. What's the point of this detective game or story? If criminals just say shit outright without no interrogation or investigation. It's more like a Confession game! XD\n\nAlso I love the RGG studio games especially the yakuza games. I know some might say Yakuza games are goofy and I know that but within that goofiness each had good storyline and plot-twist. This game's story is utterly the worst shit ever!!\n\nP.S.- I bought dlc this weeknd and man....I gotta say the dlc's story is much better than base game except Kaito easily could've done a DNA test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just not as fun as the other games, which had me invigorated. even the worst game before had me trudging along just to finish, but the story here isn't even that captivating... its just boring. gameplay is fine, don't buy the dlc...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A Yakuza game without the humor? Sign me up.\r\n\r\nIn this game you play Takayuki Yagami, a 38 year-old private detective who smokes, wears a biker jacket, and spends his time hanging out at a high school. There are people everywhere and he presses A to talk to them. He is a wanted man by armies of violent pedestrians.\r\n\r\nYou know how a bad movie will show unnecessary transitions, like if someone goes somewhere else the camera shows them leaving, getting in a car, driving, arriving, getting out, etc.? That is 90% of this game. Go to a place, open a door, have... (A) a... (A) conversation... (A), go to elevator, show entering elevator, show leaving elevator, go back to headquarters, go to merchant, select that you want to shop, add stuff to cart, select buy stuff in cart, show cutscene of merchant saying goodbye.\r\n\r\nIt's typically easy to establish in a story that someone smokes because that's something you can show them doing while they're doing something else like interrogating a panty thief or entering an elevator. But here it's a thing you press A to do at trash bins. \r\n\r\nYou buy skills with points you primarily earn by beating up people. Fortunately, the typical side street features 2-3 respawning walking clubs who really don't like specifically you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything except the main story is actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is basically my fault as I didn't read anything about the game and have only seen a very narrow trailer that doesn't show a full picture. I liked first one a lot and basically went in blind.\r\n\r\nAfter the first game that's filled with mystery and cop drama, this one heavily shifts into high school setting. How Do You Do Fellow Kids Yagami is this time riding skateboard and helping high school student clubs to solve their meaningless issues. This is a huge letdown after the epicness of the first Judgement game and it's mystery filled and action packed plot. I get the point of the main story and what idea it tries to spread but whoever chose to do it using high school setting deserves to be fired. People don't get their detective role fix by fighting high school bullies or helping dancing club how to dance. Japanese have also mastered the pacing, adding so much useless filler and prolonging things with pointless dialogue that in 6 hours of main story basically nothing happens.\r\n\r\nFighting is at least fun and feels much better than the first instalment and the Yakuza games that I have played until now. And that's about it.\r\n\r\nI don't think I'll ever play this unless I somehow get too much free time with nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 mins in you have to do a dumb detective scan and it's a huge waste of time. a huge area and you have to keep zooming in to random crap to find the things they want. the school's map is horrendously designed. skateboarding is trash. this whole game belongs in the trash.\n\nJust got my first side quest and it's go here and stand around listening to bullshit for 3 minutes to pick up \"buzz words\" this game excels at wasting time.  the death race is unwieldy cancerous shit too. now they add a stupid squirrel treasure hunt padding bullshit. honestly fuck this shit game. \nThe QTEs in this shitty game is also atrocious.\n\nYou also don't get the tiger drop equivalent in this game till chapter 12. \n\nAs for the story itself. Yagami is a self righteous prick who's obviously fighting for the wrong side. The game is also sexist, the female antagonists get preferential treatment even though they did the same or worse crimes as their male counterparts. They get off with a lighter punishment than what they deserve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P.S.: Game is good (good combat, quite a bit of side content) but does not fulfill expectations because the story was not up to standard and felt a bit stretched for no reason (atleast it was not rubber bullets 😂). Also the price of the game could have been better.\r\n\r\nWhile Judgment was absolutely great for me, I had bigger expectations for the sequel. And it did do some great things like better combat system, even better looking graphics and environment and adding more side quests and minigames which the previous game was lacking. Though I still felt off after completing this game. Since the Judgment series is very story focused and in the first one it was a thriller and nail-biter till the end to find out who was a culprit and what was going to happen next.\r\n\r\nThis feeling was not much present in this game, in the first few chapters I was just wondering why my main character Yagami who just solved the most insane cases is now suddenly working on school bullying and spending most of his time in a school asking around and harassing people. In the first few chapters I had great fun with the combat but I was also wondering why we are beating Teenagers so much for information instead of working like a fricking detective and not blowing cover every second. Like, any villain could just see this stupid detective and turn him down or atleast hide all the evidence. Also him harassing everyone for information just felt unprofessional.\r\n\r\nWhatever, so we fast forward a couple chapters later and the story is actually getting interesting and I am absolutely hooked. Guess what happens next? these frickass villains just tell Yagami what he needs to know. I feel like if some of these people just kept their mouths shut Yagami would be stuck in a dead-end for sure. But I guess Japanese stories do not mind so many plot conveniences. I mean if its a detective game I should be looking for clues in their speech instead of being handed the information directly!\r\n\r\nI still had hope that the ending would be great so I played through and the last segment of the game did deliver a good closure to the story, but the problem was that the last segment was so dragged through to make it like a 3 hour stretch of me just doing stupid lazily implemented parkour followed by beating the boss' grunts until you reach the final boss. It just made me tired and wanting to just end it as fast as possible. You know even modern movies are now 2 to 2.5 hours instead of a mandatory 3 hour stretched which a lot of old movies used to have. I felt like this game would also have been great if the school chapters in the start and the blatantly dragged on final sequence which could have been a banger if it just was made shorter.\r\n\r\nStill, I did enjoy the game but I seriously was hoping for RGG to deliver a solid story like in Judgment and Yakuza 0. I do understand that bullying in Japan is taking very seriously and also the work culture is different so a man takes pride in the work not the task but it doesn't make the story engaging does it? I would recommend this game for the price of Judgment but the increased price for a sort of stretched out and dragged on story of a sequel is not worth it in my opinion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yakuza games are always JUST SHORT of greatness.\n\nWhatever good thing they have in the game, the writing, the combat, whatever minigame part you enjoy..\n\n... its ultimately always dragged down to the abyss by horrific pacing that, for no reason at all, forces you to interact with some horrifically dull and tedious sidecontent of the game that you were trying really hard to ignore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst RGG studio game or yakuza game ever!!!! Except the combat, all are BS. Especially the story. What's the point of this detective game or story? If criminals just say shit outright without no interrogation or investigation. It's more like a Confession game! XD\n\nAlso I love the RGG studio games especially the yakuza games. I know some might say Yakuza games are goofy and I know that but within that goofiness each had good storyline and plot-twist. This game's story is utterly the worst shit ever!!\n\nP.S.- I bought dlc this weeknd and man....I gotta say the dlc's story is much better than base game except Kaito easily could've done a DNA test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just not as fun as the other games, which had me invigorated. even the worst game before had me trudging along just to finish, but the story here isn't even that captivating... its just boring. gameplay is fine, don't buy the dlc...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A Yakuza game without the humor? Sign me up.\r\n\r\nIn this game you play Takayuki Yagami, a 38 year-old private detective who smokes, wears a biker jacket, and spends his time hanging out at a high school. There are people everywhere and he presses A to talk to them. He is a wanted man by armies of violent pedestrians.\r\n\r\nYou know how a bad movie will show unnecessary transitions, like if someone goes somewhere else the camera shows them leaving, getting in a car, driving, arriving, getting out, etc.? That is 90% of this game. Go to a place, open a door, have... (A) a... (A) conversation... (A), go to elevator, show entering elevator, show leaving elevator, go back to headquarters, go to merchant, select that you want to shop, add stuff to cart, select buy stuff in cart, show cutscene of merchant saying goodbye.\r\n\r\nIt's typically easy to establish in a story that someone smokes because that's something you can show them doing while they're doing something else like interrogating a panty thief or entering an elevator. But here it's a thing you press A to do at trash bins. \r\n\r\nYou buy skills with points you primarily earn by beating up people. Fortunately, the typical side street features 2-3 respawning walking clubs who really don't like specifically you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything except the main story is actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is basically my fault as I didn't read anything about the game and have only seen a very narrow trailer that doesn't show a full picture. I liked first one a lot and basically went in blind.\r\n\r\nAfter the first game that's filled with mystery and cop drama, this one heavily shifts into high school setting. How Do You Do Fellow Kids Yagami is this time riding skateboard and helping high school student clubs to solve their meaningless issues. This is a huge letdown after the epicness of the first Judgement game and it's mystery filled and action packed plot. I get the point of the main story and what idea it tries to spread but whoever chose to do it using high school setting deserves to be fired. People don't get their detective role fix by fighting high school bullies or helping dancing club how to dance. Japanese have also mastered the pacing, adding so much useless filler and prolonging things with pointless dialogue that in 6 hours of main story basically nothing happens.\r\n\r\nFighting is at least fun and feels much better than the first instalment and the Yakuza games that I have played until now. And that's about it.\r\n\r\nI don't think I'll ever play this unless I somehow get too much free time with nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 mins in you have to do a dumb detective scan and it's a huge waste of time. a huge area and you have to keep zooming in to random crap to find the things they want. the school's map is horrendously designed. skateboarding is trash. this whole game belongs in the trash.\n\nJust got my first side quest and it's go here and stand around listening to bullshit for 3 minutes to pick up \"buzz words\" this game excels at wasting time.  the death race is unwieldy cancerous shit too. now they add a stupid squirrel treasure hunt padding bullshit. honestly fuck this shit game. \nThe QTEs in this shitty game is also atrocious.\n\nYou also don't get the tiger drop equivalent in this game till chapter 12. \n\nAs for the story itself. Yagami is a self righteous prick who's obviously fighting for the wrong side. The game is also sexist, the female antagonists get preferential treatment even though they did the same or worse crimes as their male counterparts. They get off with a lighter punishment than what they deserve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P.S.: Game is good (good combat, quite a bit of side content) but does not fulfill expectations because the story was not up to standard and felt a bit stretched for no reason (atleast it was not rubber bullets 😂). Also the price of the game could have been better.\r\n\r\nWhile Judgment was absolutely great for me, I had bigger expectations for the sequel. And it did do some great things like better combat system, even better looking graphics and environment and adding more side quests and minigames which the previous game was lacking. Though I still felt off after completing this game. Since the Judgment series is very story focused and in the first one it was a thriller and nail-biter till the end to find out who was a culprit and what was going to happen next.\r\n\r\nThis feeling was not much present in this game, in the first few chapters I was just wondering why my main character Yagami who just solved the most insane cases is now suddenly working on school bullying and spending most of his time in a school asking around and harassing people. In the first few chapters I had great fun with the combat but I was also wondering why we are beating Teenagers so much for information instead of working like a fricking detective and not blowing cover every second. Like, any villain could just see this stupid detective and turn him down or atleast hide all the evidence. Also him harassing everyone for information just felt unprofessional.\r\n\r\nWhatever, so we fast forward a couple chapters later and the story is actually getting interesting and I am absolutely hooked. Guess what happens next? these frickass villains just tell Yagami what he needs to know. I feel like if some of these people just kept their mouths shut Yagami would be stuck in a dead-end for sure. But I guess Japanese stories do not mind so many plot conveniences. I mean if its a detective game I should be looking for clues in their speech instead of being handed the information directly!\r\n\r\nI still had hope that the ending would be great so I played through and the last segment of the game did deliver a good closure to the story, but the problem was that the last segment was so dragged through to make it like a 3 hour stretch of me just doing stupid lazily implemented parkour followed by beating the boss' grunts until you reach the final boss. It just made me tired and wanting to just end it as fast as possible. You know even modern movies are now 2 to 2.5 hours instead of a mandatory 3 hour stretched which a lot of old movies used to have. I felt like this game would also have been great if the school chapters in the start and the blatantly dragged on final sequence which could have been a banger if it just was made shorter.\r\n\r\nStill, I did enjoy the game but I seriously was hoping for RGG to deliver a solid story like in Judgment and Yakuza 0. I do understand that bullying in Japan is taking very seriously and also the work culture is different so a man takes pride in the work not the task but it doesn't make the story engaging does it? I would recommend this game for the price of Judgment but the increased price for a sort of stretched out and dragged on story of a sequel is not worth it in my opinion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yakuza games are always JUST SHORT of greatness.\n\nWhatever good thing they have in the game, the writing, the combat, whatever minigame part you enjoy..\n\n... its ultimately always dragged down to the abyss by horrific pacing that, for no reason at all, forces you to interact with some horrifically dull and tedious sidecontent of the game that you were trying really hard to ignore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst RGG studio game or yakuza game ever!!!! Except the combat, all are BS. Especially the story. What's the point of this detective game or story? If criminals just say shit outright without no interrogation or investigation. It's more like a Confession game! XD\n\nAlso I love the RGG studio games especially the yakuza games. I know some might say Yakuza games are goofy and I know that but within that goofiness each had good storyline and plot-twist. This game's story is utterly the worst shit ever!!\n\nP.S.- I bought dlc this weeknd and man....I gotta say the dlc's story is much better than base game except Kaito easily could've done a DNA test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just not as fun as the other games, which had me invigorated. even the worst game before had me trudging along just to finish, but the story here isn't even that captivating... its just boring. gameplay is fine, don't buy the dlc...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A Yakuza game without the humor? Sign me up.\r\n\r\nIn this game you play Takayuki Yagami, a 38 year-old private detective who smokes, wears a biker jacket, and spends his time hanging out at a high school. There are people everywhere and he presses A to talk to them. He is a wanted man by armies of violent pedestrians.\r\n\r\nYou know how a bad movie will show unnecessary transitions, like if someone goes somewhere else the camera shows them leaving, getting in a car, driving, arriving, getting out, etc.? That is 90% of this game. Go to a place, open a door, have... (A) a... (A) conversation... (A), go to elevator, show entering elevator, show leaving elevator, go back to headquarters, go to merchant, select that you want to shop, add stuff to cart, select buy stuff in cart, show cutscene of merchant saying goodbye.\r\n\r\nIt's typically easy to establish in a story that someone smokes because that's something you can show them doing while they're doing something else like interrogating a panty thief or entering an elevator. But here it's a thing you press A to do at trash bins. \r\n\r\nYou buy skills with points you primarily earn by beating up people. Fortunately, the typical side street features 2-3 respawning walking clubs who really don't like specifically you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything except the main story is actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is basically my fault as I didn't read anything about the game and have only seen a very narrow trailer that doesn't show a full picture. I liked first one a lot and basically went in blind.\r\n\r\nAfter the first game that's filled with mystery and cop drama, this one heavily shifts into high school setting. How Do You Do Fellow Kids Yagami is this time riding skateboard and helping high school student clubs to solve their meaningless issues. This is a huge letdown after the epicness of the first Judgement game and it's mystery filled and action packed plot. I get the point of the main story and what idea it tries to spread but whoever chose to do it using high school setting deserves to be fired. People don't get their detective role fix by fighting high school bullies or helping dancing club how to dance. Japanese have also mastered the pacing, adding so much useless filler and prolonging things with pointless dialogue that in 6 hours of main story basically nothing happens.\r\n\r\nFighting is at least fun and feels much better than the first instalment and the Yakuza games that I have played until now. And that's about it.\r\n\r\nI don't think I'll ever play this unless I somehow get too much free time with nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 mins in you have to do a dumb detective scan and it's a huge waste of time. a huge area and you have to keep zooming in to random crap to find the things they want. the school's map is horrendously designed. skateboarding is trash. this whole game belongs in the trash.\n\nJust got my first side quest and it's go here and stand around listening to bullshit for 3 minutes to pick up \"buzz words\" this game excels at wasting time.  the death race is unwieldy cancerous shit too. now they add a stupid squirrel treasure hunt padding bullshit. honestly fuck this shit game. \nThe QTEs in this shitty game is also atrocious.\n\nYou also don't get the tiger drop equivalent in this game till chapter 12. \n\nAs for the story itself. Yagami is a self righteous prick who's obviously fighting for the wrong side. The game is also sexist, the female antagonists get preferential treatment even though they did the same or worse crimes as their male counterparts. They get off with a lighter punishment than what they deserve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P.S.: Game is good (good combat, quite a bit of side content) but does not fulfill expectations because the story was not up to standard and felt a bit stretched for no reason (atleast it was not rubber bullets 😂). Also the price of the game could have been better.\r\n\r\nWhile Judgment was absolutely great for me, I had bigger expectations for the sequel. And it did do some great things like better combat system, even better looking graphics and environment and adding more side quests and minigames which the previous game was lacking. Though I still felt off after completing this game. Since the Judgment series is very story focused and in the first one it was a thriller and nail-biter till the end to find out who was a culprit and what was going to happen next.\r\n\r\nThis feeling was not much present in this game, in the first few chapters I was just wondering why my main character Yagami who just solved the most insane cases is now suddenly working on school bullying and spending most of his time in a school asking around and harassing people. In the first few chapters I had great fun with the combat but I was also wondering why we are beating Teenagers so much for information instead of working like a fricking detective and not blowing cover every second. Like, any villain could just see this stupid detective and turn him down or atleast hide all the evidence. Also him harassing everyone for information just felt unprofessional.\r\n\r\nWhatever, so we fast forward a couple chapters later and the story is actually getting interesting and I am absolutely hooked. Guess what happens next? these frickass villains just tell Yagami what he needs to know. I feel like if some of these people just kept their mouths shut Yagami would be stuck in a dead-end for sure. But I guess Japanese stories do not mind so many plot conveniences. I mean if its a detective game I should be looking for clues in their speech instead of being handed the information directly!\r\n\r\nI still had hope that the ending would be great so I played through and the last segment of the game did deliver a good closure to the story, but the problem was that the last segment was so dragged through to make it like a 3 hour stretch of me just doing stupid lazily implemented parkour followed by beating the boss' grunts until you reach the final boss. It just made me tired and wanting to just end it as fast as possible. You know even modern movies are now 2 to 2.5 hours instead of a mandatory 3 hour stretched which a lot of old movies used to have. I felt like this game would also have been great if the school chapters in the start and the blatantly dragged on final sequence which could have been a banger if it just was made shorter.\r\n\r\nStill, I did enjoy the game but I seriously was hoping for RGG to deliver a solid story like in Judgment and Yakuza 0. I do understand that bullying in Japan is taking very seriously and also the work culture is different so a man takes pride in the work not the task but it doesn't make the story engaging does it? I would recommend this game for the price of Judgment but the increased price for a sort of stretched out and dragged on story of a sequel is not worth it in my opinion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yakuza games are always JUST SHORT of greatness.\n\nWhatever good thing they have in the game, the writing, the combat, whatever minigame part you enjoy..\n\n... its ultimately always dragged down to the abyss by horrific pacing that, for no reason at all, forces you to interact with some horrifically dull and tedious sidecontent of the game that you were trying really hard to ignore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst RGG studio game or yakuza game ever!!!! Except the combat, all are BS. Especially the story. What's the point of this detective game or story? If criminals just say shit outright without no interrogation or investigation. It's more like a Confession game! XD\n\nAlso I love the RGG studio games especially the yakuza games. I know some might say Yakuza games are goofy and I know that but within that goofiness each had good storyline and plot-twist. This game's story is utterly the worst shit ever!!\n\nP.S.- I bought dlc this weeknd and man....I gotta say the dlc's story is much better than base game except Kaito easily could've done a DNA test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just not as fun as the other games, which had me invigorated. even the worst game before had me trudging along just to finish, but the story here isn't even that captivating... its just boring. gameplay is fine, don't buy the dlc...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A Yakuza game without the humor? Sign me up.\r\n\r\nIn this game you play Takayuki Yagami, a 38 year-old private detective who smokes, wears a biker jacket, and spends his time hanging out at a high school. There are people everywhere and he presses A to talk to them. He is a wanted man by armies of violent pedestrians.\r\n\r\nYou know how a bad movie will show unnecessary transitions, like if someone goes somewhere else the camera shows them leaving, getting in a car, driving, arriving, getting out, etc.? That is 90% of this game. Go to a place, open a door, have... (A) a... (A) conversation... (A), go to elevator, show entering elevator, show leaving elevator, go back to headquarters, go to merchant, select that you want to shop, add stuff to cart, select buy stuff in cart, show cutscene of merchant saying goodbye.\r\n\r\nIt's typically easy to establish in a story that someone smokes because that's something you can show them doing while they're doing something else like interrogating a panty thief or entering an elevator. But here it's a thing you press A to do at trash bins. \r\n\r\nYou buy skills with points you primarily earn by beating up people. Fortunately, the typical side street features 2-3 respawning walking clubs who really don't like specifically you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything except the main story is actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is basically my fault as I didn't read anything about the game and have only seen a very narrow trailer that doesn't show a full picture. I liked first one a lot and basically went in blind.\r\n\r\nAfter the first game that's filled with mystery and cop drama, this one heavily shifts into high school setting. How Do You Do Fellow Kids Yagami is this time riding skateboard and helping high school student clubs to solve their meaningless issues. This is a huge letdown after the epicness of the first Judgement game and it's mystery filled and action packed plot. I get the point of the main story and what idea it tries to spread but whoever chose to do it using high school setting deserves to be fired. People don't get their detective role fix by fighting high school bullies or helping dancing club how to dance. Japanese have also mastered the pacing, adding so much useless filler and prolonging things with pointless dialogue that in 6 hours of main story basically nothing happens.\r\n\r\nFighting is at least fun and feels much better than the first instalment and the Yakuza games that I have played until now. And that's about it.\r\n\r\nI don't think I'll ever play this unless I somehow get too much free time with nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 mins in you have to do a dumb detective scan and it's a huge waste of time. a huge area and you have to keep zooming in to random crap to find the things they want. the school's map is horrendously designed. skateboarding is trash. this whole game belongs in the trash.\n\nJust got my first side quest and it's go here and stand around listening to bullshit for 3 minutes to pick up \"buzz words\" this game excels at wasting time.  the death race is unwieldy cancerous shit too. now they add a stupid squirrel treasure hunt padding bullshit. honestly fuck this shit game. \nThe QTEs in this shitty game is also atrocious.\n\nYou also don't get the tiger drop equivalent in this game till chapter 12. \n\nAs for the story itself. Yagami is a self righteous prick who's obviously fighting for the wrong side. The game is also sexist, the female antagonists get preferential treatment even though they did the same or worse crimes as their male counterparts. They get off with a lighter punishment than what they deserve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P.S.: Game is good (good combat, quite a bit of side content) but does not fulfill expectations because the story was not up to standard and felt a bit stretched for no reason (atleast it was not rubber bullets 😂). Also the price of the game could have been better.\r\n\r\nWhile Judgment was absolutely great for me, I had bigger expectations for the sequel. And it did do some great things like better combat system, even better looking graphics and environment and adding more side quests and minigames which the previous game was lacking. Though I still felt off after completing this game. Since the Judgment series is very story focused and in the first one it was a thriller and nail-biter till the end to find out who was a culprit and what was going to happen next.\r\n\r\nThis feeling was not much present in this game, in the first few chapters I was just wondering why my main character Yagami who just solved the most insane cases is now suddenly working on school bullying and spending most of his time in a school asking around and harassing people. In the first few chapters I had great fun with the combat but I was also wondering why we are beating Teenagers so much for information instead of working like a fricking detective and not blowing cover every second. Like, any villain could just see this stupid detective and turn him down or atleast hide all the evidence. Also him harassing everyone for information just felt unprofessional.\r\n\r\nWhatever, so we fast forward a couple chapters later and the story is actually getting interesting and I am absolutely hooked. Guess what happens next? these frickass villains just tell Yagami what he needs to know. I feel like if some of these people just kept their mouths shut Yagami would be stuck in a dead-end for sure. But I guess Japanese stories do not mind so many plot conveniences. I mean if its a detective game I should be looking for clues in their speech instead of being handed the information directly!\r\n\r\nI still had hope that the ending would be great so I played through and the last segment of the game did deliver a good closure to the story, but the problem was that the last segment was so dragged through to make it like a 3 hour stretch of me just doing stupid lazily implemented parkour followed by beating the boss' grunts until you reach the final boss. It just made me tired and wanting to just end it as fast as possible. You know even modern movies are now 2 to 2.5 hours instead of a mandatory 3 hour stretched which a lot of old movies used to have. I felt like this game would also have been great if the school chapters in the start and the blatantly dragged on final sequence which could have been a banger if it just was made shorter.\r\n\r\nStill, I did enjoy the game but I seriously was hoping for RGG to deliver a solid story like in Judgment and Yakuza 0. I do understand that bullying in Japan is taking very seriously and also the work culture is different so a man takes pride in the work not the task but it doesn't make the story engaging does it? I would recommend this game for the price of Judgment but the increased price for a sort of stretched out and dragged on story of a sequel is not worth it in my opinion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yakuza games are always JUST SHORT of greatness.\n\nWhatever good thing they have in the game, the writing, the combat, whatever minigame part you enjoy..\n\n... its ultimately always dragged down to the abyss by horrific pacing that, for no reason at all, forces you to interact with some horrifically dull and tedious sidecontent of the game that you were trying really hard to ignore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst RGG studio game or yakuza game ever!!!! Except the combat, all are BS. Especially the story. What's the point of this detective game or story? If criminals just say shit outright without no interrogation or investigation. It's more like a Confession game! XD\n\nAlso I love the RGG studio games especially the yakuza games. I know some might say Yakuza games are goofy and I know that but within that goofiness each had good storyline and plot-twist. This game's story is utterly the worst shit ever!!\n\nP.S.- I bought dlc this weeknd and man....I gotta say the dlc's story is much better than base game except Kaito easily could've done a DNA test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just not as fun as the other games, which had me invigorated. even the worst game before had me trudging along just to finish, but the story here isn't even that captivating... its just boring. gameplay is fine, don't buy the dlc...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A Yakuza game without the humor? Sign me up.\r\n\r\nIn this game you play Takayuki Yagami, a 38 year-old private detective who smokes, wears a biker jacket, and spends his time hanging out at a high school. There are people everywhere and he presses A to talk to them. He is a wanted man by armies of violent pedestrians.\r\n\r\nYou know how a bad movie will show unnecessary transitions, like if someone goes somewhere else the camera shows them leaving, getting in a car, driving, arriving, getting out, etc.? That is 90% of this game. Go to a place, open a door, have... (A) a... (A) conversation... (A), go to elevator, show entering elevator, show leaving elevator, go back to headquarters, go to merchant, select that you want to shop, add stuff to cart, select buy stuff in cart, show cutscene of merchant saying goodbye.\r\n\r\nIt's typically easy to establish in a story that someone smokes because that's something you can show them doing while they're doing something else like interrogating a panty thief or entering an elevator. But here it's a thing you press A to do at trash bins. \r\n\r\nYou buy skills with points you primarily earn by beating up people. Fortunately, the typical side street features 2-3 respawning walking clubs who really don't like specifically you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything except the main story is actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is basically my fault as I didn't read anything about the game and have only seen a very narrow trailer that doesn't show a full picture. I liked first one a lot and basically went in blind.\r\n\r\nAfter the first game that's filled with mystery and cop drama, this one heavily shifts into high school setting. How Do You Do Fellow Kids Yagami is this time riding skateboard and helping high school student clubs to solve their meaningless issues. This is a huge letdown after the epicness of the first Judgement game and it's mystery filled and action packed plot. I get the point of the main story and what idea it tries to spread but whoever chose to do it using high school setting deserves to be fired. People don't get their detective role fix by fighting high school bullies or helping dancing club how to dance. Japanese have also mastered the pacing, adding so much useless filler and prolonging things with pointless dialogue that in 6 hours of main story basically nothing happens.\r\n\r\nFighting is at least fun and feels much better than the first instalment and the Yakuza games that I have played until now. And that's about it.\r\n\r\nI don't think I'll ever play this unless I somehow get too much free time with nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 mins in you have to do a dumb detective scan and it's a huge waste of time. a huge area and you have to keep zooming in to random crap to find the things they want. the school's map is horrendously designed. skateboarding is trash. this whole game belongs in the trash.\n\nJust got my first side quest and it's go here and stand around listening to bullshit for 3 minutes to pick up \"buzz words\" this game excels at wasting time.  the death race is unwieldy cancerous shit too. now they add a stupid squirrel treasure hunt padding bullshit. honestly fuck this shit game. \nThe QTEs in this shitty game is also atrocious.\n\nYou also don't get the tiger drop equivalent in this game till chapter 12. \n\nAs for the story itself. Yagami is a self righteous prick who's obviously fighting for the wrong side. The game is also sexist, the female antagonists get preferential treatment even though they did the same or worse crimes as their male counterparts. They get off with a lighter punishment than what they deserve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P.S.: Game is good (good combat, quite a bit of side content) but does not fulfill expectations because the story was not up to standard and felt a bit stretched for no reason (atleast it was not rubber bullets 😂). Also the price of the game could have been better.\r\n\r\nWhile Judgment was absolutely great for me, I had bigger expectations for the sequel. And it did do some great things like better combat system, even better looking graphics and environment and adding more side quests and minigames which the previous game was lacking. Though I still felt off after completing this game. Since the Judgment series is very story focused and in the first one it was a thriller and nail-biter till the end to find out who was a culprit and what was going to happen next.\r\n\r\nThis feeling was not much present in this game, in the first few chapters I was just wondering why my main character Yagami who just solved the most insane cases is now suddenly working on school bullying and spending most of his time in a school asking around and harassing people. In the first few chapters I had great fun with the combat but I was also wondering why we are beating Teenagers so much for information instead of working like a fricking detective and not blowing cover every second. Like, any villain could just see this stupid detective and turn him down or atleast hide all the evidence. Also him harassing everyone for information just felt unprofessional.\r\n\r\nWhatever, so we fast forward a couple chapters later and the story is actually getting interesting and I am absolutely hooked. Guess what happens next? these frickass villains just tell Yagami what he needs to know. I feel like if some of these people just kept their mouths shut Yagami would be stuck in a dead-end for sure. But I guess Japanese stories do not mind so many plot conveniences. I mean if its a detective game I should be looking for clues in their speech instead of being handed the information directly!\r\n\r\nI still had hope that the ending would be great so I played through and the last segment of the game did deliver a good closure to the story, but the problem was that the last segment was so dragged through to make it like a 3 hour stretch of me just doing stupid lazily implemented parkour followed by beating the boss' grunts until you reach the final boss. It just made me tired and wanting to just end it as fast as possible. You know even modern movies are now 2 to 2.5 hours instead of a mandatory 3 hour stretched which a lot of old movies used to have. I felt like this game would also have been great if the school chapters in the start and the blatantly dragged on final sequence which could have been a banger if it just was made shorter.\r\n\r\nStill, I did enjoy the game but I seriously was hoping for RGG to deliver a solid story like in Judgment and Yakuza 0. I do understand that bullying in Japan is taking very seriously and also the work culture is different so a man takes pride in the work not the task but it doesn't make the story engaging does it? I would recommend this game for the price of Judgment but the increased price for a sort of stretched out and dragged on story of a sequel is not worth it in my opinion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yakuza games are always JUST SHORT of greatness.\n\nWhatever good thing they have in the game, the writing, the combat, whatever minigame part you enjoy..\n\n... its ultimately always dragged down to the abyss by horrific pacing that, for no reason at all, forces you to interact with some horrifically dull and tedious sidecontent of the game that you were trying really hard to ignore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst RGG studio game or yakuza game ever!!!! Except the combat, all are BS. Especially the story. What's the point of this detective game or story? If criminals just say shit outright without no interrogation or investigation. It's more like a Confession game! XD\n\nAlso I love the RGG studio games especially the yakuza games. I know some might say Yakuza games are goofy and I know that but within that goofiness each had good storyline and plot-twist. This game's story is utterly the worst shit ever!!\n\nP.S.- I bought dlc this weeknd and man....I gotta say the dlc's story is much better than base game except Kaito easily could've done a DNA test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just not as fun as the other games, which had me invigorated. even the worst game before had me trudging along just to finish, but the story here isn't even that captivating... its just boring. gameplay is fine, don't buy the dlc...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A Yakuza game without the humor? Sign me up.\r\n\r\nIn this game you play Takayuki Yagami, a 38 year-old private detective who smokes, wears a biker jacket, and spends his time hanging out at a high school. There are people everywhere and he presses A to talk to them. He is a wanted man by armies of violent pedestrians.\r\n\r\nYou know how a bad movie will show unnecessary transitions, like if someone goes somewhere else the camera shows them leaving, getting in a car, driving, arriving, getting out, etc.? That is 90% of this game. Go to a place, open a door, have... (A) a... (A) conversation... (A), go to elevator, show entering elevator, show leaving elevator, go back to headquarters, go to merchant, select that you want to shop, add stuff to cart, select buy stuff in cart, show cutscene of merchant saying goodbye.\r\n\r\nIt's typically easy to establish in a story that someone smokes because that's something you can show them doing while they're doing something else like interrogating a panty thief or entering an elevator. But here it's a thing you press A to do at trash bins. \r\n\r\nYou buy skills with points you primarily earn by beating up people. Fortunately, the typical side street features 2-3 respawning walking clubs who really don't like specifically you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything except the main story is actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is basically my fault as I didn't read anything about the game and have only seen a very narrow trailer that doesn't show a full picture. I liked first one a lot and basically went in blind.\r\n\r\nAfter the first game that's filled with mystery and cop drama, this one heavily shifts into high school setting. How Do You Do Fellow Kids Yagami is this time riding skateboard and helping high school student clubs to solve their meaningless issues. This is a huge letdown after the epicness of the first Judgement game and it's mystery filled and action packed plot. I get the point of the main story and what idea it tries to spread but whoever chose to do it using high school setting deserves to be fired. People don't get their detective role fix by fighting high school bullies or helping dancing club how to dance. Japanese have also mastered the pacing, adding so much useless filler and prolonging things with pointless dialogue that in 6 hours of main story basically nothing happens.\r\n\r\nFighting is at least fun and feels much better than the first instalment and the Yakuza games that I have played until now. And that's about it.\r\n\r\nI don't think I'll ever play this unless I somehow get too much free time with nothing else to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I had high hopes for this game because I liked judgment a lot, but my experience was... awful... First of all denuvo locked my game for 2 days and I wasnt been able to play it. Okay, after 2 days I was finally been able to launch the game and play it. Then the game's story began. I was very hyped about it at first but then I understood what the main theme of story is which is bullying... After the first game story this one felt very very very weak. Also I noticed that the character were more bland than in the judgment. Side story wise I only liked the dancing club, others felt boring. That was my first yakuza game where I didnt complete even half of the sidestories while in other titles I tried my best to max them. Even by looking at game play time I had 70 hours in judgment and 20 hours in this one. The story also gone downhill after chapter 9 to the point that it became a chore finishing this game. Also Ijincho doesnt fit well in this game as in yakua like a dragon, its just feels like an Ichiban place where Yagami dont belong. What can I say good about this game? Combat was amazing, Osts were amazing. But for this high price of the game and very strong first game before this one I cant recommend it.\r\n\r\nSawa-sensei x 248 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "20 mins in you have to do a dumb detective scan and it's a huge waste of time. a huge area and you have to keep zooming in to random crap to find the things they want. the school's map is horrendously designed. skateboarding is trash. this whole game belongs in the trash.\n\nJust got my first side quest and it's go here and stand around listening to bullshit for 3 minutes to pick up \"buzz words\" this game excels at wasting time.  the death race is unwieldy cancerous shit too. now they add a stupid squirrel treasure hunt padding bullshit. honestly fuck this shit game. \nThe QTEs in this shitty game is also atrocious.\n\nYou also don't get the tiger drop equivalent in this game till chapter 12. \n\nAs for the story itself. Yagami is a self righteous prick who's obviously fighting for the wrong side. The game is also sexist, the female antagonists get preferential treatment even though they did the same or worse crimes as their male counterparts. They get off with a lighter punishment than what they deserve.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "P.S.: Game is good (good combat, quite a bit of side content) but does not fulfill expectations because the story was not up to standard and felt a bit stretched for no reason (atleast it was not rubber bullets 😂). Also the price of the game could have been better.\r\n\r\nWhile Judgment was absolutely great for me, I had bigger expectations for the sequel. And it did do some great things like better combat system, even better looking graphics and environment and adding more side quests and minigames which the previous game was lacking. Though I still felt off after completing this game. Since the Judgment series is very story focused and in the first one it was a thriller and nail-biter till the end to find out who was a culprit and what was going to happen next.\r\n\r\nThis feeling was not much present in this game, in the first few chapters I was just wondering why my main character Yagami who just solved the most insane cases is now suddenly working on school bullying and spending most of his time in a school asking around and harassing people. In the first few chapters I had great fun with the combat but I was also wondering why we are beating Teenagers so much for information instead of working like a fricking detective and not blowing cover every second. Like, any villain could just see this stupid detective and turn him down or atleast hide all the evidence. Also him harassing everyone for information just felt unprofessional.\r\n\r\nWhatever, so we fast forward a couple chapters later and the story is actually getting interesting and I am absolutely hooked. Guess what happens next? these frickass villains just tell Yagami what he needs to know. I feel like if some of these people just kept their mouths shut Yagami would be stuck in a dead-end for sure. But I guess Japanese stories do not mind so many plot conveniences. I mean if its a detective game I should be looking for clues in their speech instead of being handed the information directly!\r\n\r\nI still had hope that the ending would be great so I played through and the last segment of the game did deliver a good closure to the story, but the problem was that the last segment was so dragged through to make it like a 3 hour stretch of me just doing stupid lazily implemented parkour followed by beating the boss' grunts until you reach the final boss. It just made me tired and wanting to just end it as fast as possible. You know even modern movies are now 2 to 2.5 hours instead of a mandatory 3 hour stretched which a lot of old movies used to have. I felt like this game would also have been great if the school chapters in the start and the blatantly dragged on final sequence which could have been a banger if it just was made shorter.\r\n\r\nStill, I did enjoy the game but I seriously was hoping for RGG to deliver a solid story like in Judgment and Yakuza 0. I do understand that bullying in Japan is taking very seriously and also the work culture is different so a man takes pride in the work not the task but it doesn't make the story engaging does it? I would recommend this game for the price of Judgment but the increased price for a sort of stretched out and dragged on story of a sequel is not worth it in my opinion.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Yakuza games are always JUST SHORT of greatness.\n\nWhatever good thing they have in the game, the writing, the combat, whatever minigame part you enjoy..\n\n... its ultimately always dragged down to the abyss by horrific pacing that, for no reason at all, forces you to interact with some horrifically dull and tedious sidecontent of the game that you were trying really hard to ignore.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the worst RGG studio game or yakuza game ever!!!! Except the combat, all are BS. Especially the story. What's the point of this detective game or story? If criminals just say shit outright without no interrogation or investigation. It's more like a Confession game! XD\n\nAlso I love the RGG studio games especially the yakuza games. I know some might say Yakuza games are goofy and I know that but within that goofiness each had good storyline and plot-twist. This game's story is utterly the worst shit ever!!\n\nP.S.- I bought dlc this weeknd and man....I gotta say the dlc's story is much better than base game except Kaito easily could've done a DNA test.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "awful compared to the first, gameplay and story. what a disappointment :<",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just not as fun as the other games, which had me invigorated. even the worst game before had me trudging along just to finish, but the story here isn't even that captivating... its just boring. gameplay is fine, don't buy the dlc...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A Yakuza game without the humor? Sign me up.\r\n\r\nIn this game you play Takayuki Yagami, a 38 year-old private detective who smokes, wears a biker jacket, and spends his time hanging out at a high school. There are people everywhere and he presses A to talk to them. He is a wanted man by armies of violent pedestrians.\r\n\r\nYou know how a bad movie will show unnecessary transitions, like if someone goes somewhere else the camera shows them leaving, getting in a car, driving, arriving, getting out, etc.? That is 90% of this game. Go to a place, open a door, have... (A) a... (A) conversation... (A), go to elevator, show entering elevator, show leaving elevator, go back to headquarters, go to merchant, select that you want to shop, add stuff to cart, select buy stuff in cart, show cutscene of merchant saying goodbye.\r\n\r\nIt's typically easy to establish in a story that someone smokes because that's something you can show them doing while they're doing something else like interrogating a panty thief or entering an elevator. But here it's a thing you press A to do at trash bins. \r\n\r\nYou buy skills with points you primarily earn by beating up people. Fortunately, the typical side street features 2-3 respawning walking clubs who really don't like specifically you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything except the main story is actually good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "meeeeehh........ average",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A lot of people consider Lost Judgment to be better than its predecessor. I enjoyed Judgment's main story but had some personal gripes that hampered my subjective impression of the game, so I had pretty high hopes for the sequel.\n\nUnfortunately, this game is just not made for me. I think it's objectively well made, like all RGG studio games, but the development of the main story and usage of supporting cast was just not doing it for me. Pretty much all of the supporting characters from Judgment cameo in this game as well, but they've been reduced to cardboard thin paraphrasing NPCs, or \"I need to move the plot forward\" devices. Which is such a shame, since I liked all of them a lot in the first game.\n\nI also didn't like the villain of this game very much. The motivations, Yagami's opposing stance to the antagonist, and the ideologies they represent are just... really strange to me. It's like they're arguing about A vs B when I'm just staring at my PC, wondering why C isn't an option. It just really lost me in certain parts. And maybe I'm just dumb, but I don't even understand the significance of what they're arguing about.  (MILD SPOILERS: the scenario in this game is specifically regarding school bullying cases where the bully is a completely irredeemable sociopath/psycho that can't be socially trained to behave. On top of that, they get tried in a court and fail to get caught. Is this... a common problem in Japan that I don't know about? Lol? Like how many times does this happen?)\n\nThere is a whole entire subgame in Lost Judgment as well, regarding the school counselor sidequests. They're definitely... something. I finished it all just because I'm a completionist, but I still don't know if I enjoyed it or not. It was definitely just kind of there.\n\nOverall, I finished the game with a sour taste in my mouth. I think there will be plenty of people who like it, but I personally can't recommend it to anyone I know.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}