{
  "positive": [
    {
      "review": "This digital crack very VERY addictive.\n\nBasically a rougelite brickbreaker with a touch of farming sim.\nToo bad the end game progression and content is lacking.\n\nWE NEED ENDLESS MODE",
      "voted_up": true,
      "votes_helpful": 214
    },
    {
      "review": "Fun, addictive and satisfying the first 10 hours, but becomes a bit repetitive and cumbersome afterwards. The presentation of it is also very snazzy and overall, I had a good time with it.\r\n\r\nEnjoyable lil adventure, but just don't expect an insane amount of replay value. I got 30 hours out of it though, which is still p chunky.",
      "voted_up": true,
      "votes_helpful": 61
    },
    {
      "review": "Dumb balls game, cant stop playing it. \r\n\r\nLots to do,\r\n\r\nBall unlocks\r\nCharacter unlocks\r\nBuilding unlocks\r\nBase building\r\n\r\n\r\nThere's even two characters that can be unlocked that can use turnbased mode (way more fun that i expected) and a character that plays the game himself while you go make tea or take a dump. \r\nLots of stats to boost with buildings and building placement. \r\n\r\nfor the time you'll likely spend in this little game it's worth every cent. \r\nGo buy it.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "I consider myself somewhat of a ball expert and I can confidently say these are some 10/10 balls",
      "voted_up": true,
      "votes_helpful": 27
    },
    {
      "review": "Favourite indie game of 2025. 100% completion was genuinely fun. Can't recommend enough.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "About 35 hours of gameplay if u wanna 100%\nreally good game infinite replayability\nit's like tetris meet roguelite meet vampire survivor\n15 classes tons of balls like 60 and tons of passives like 40 tons of combos to do\nyou need to manage the village between stages wich is really nice :)\ni wish they add new DLC or expansion \nthis game is a little perfect jewel\nWORTH ITS PRICE ! and WORTH THE TRY ! be AWARE you might get ADDICT !  \n10/10",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "It is pure mindless fun. Never too challenging but always satisfying. It commits fully to the core mantra of \"combining things is cool\" and just pushes it to the extreme. The town building in between rounds is just as addictive and I was pleasantly surprised at how unique and distinguished they made the unlockable characters.\n\nOf course, it's also got the sauce with super satisfying visual and audible feedback which kept the synapses in my monkey brain constantly firing. \n\nOn top of all that, I also appreciate that the game knows when to stop and doesn't outstay it's welcome. There's a hard end here and after 30 ball induced fugue state hours, I felt satisfied I'd seen it all. There is endgame content like leader boards and harder difficulties, but that wasn't required for the 100% Achievements.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I ve got balls of steel!\n\nThis game is really fun, such a good way to modernize old ideas. The indie scenario keeps evolving with people putting they creativity into something cool.\n\nThis is basically arkanoid but modernized and with good mechanics that make the game fun and unique.\n\nEasly reccomended!!",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "I watched Asmon play this game and thought it looked cool. turns out it is and now I'm addicted to it. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "I enjoyed the content available. The Game does get a little repetetive later on, but there's plenty of fun to be had before then.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Honestly after many hours and completing a couple runs I am hooked. It is worth your money, your time, and your dedication. This game rewards you for continuing on and keep playing. It is my personal favorite game on top 5 of my favorites of all time.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun at least for a while, who’ve though combining tetris x pinball x roguelite x base building deserves an award.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game feels like the kind of step up from Half-life to Half-life 2, but for Brick Break. \n\nIts the natural evolution of a classic game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The game is the video game equivalent of the candy, \"Whoppers\", you go out of your way to play it, have your fill. Say \"I'm done\", but come back to it later.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A great entry to the genre. Has plenty of building area, speed settings and increasingly faster game modes and the best of all, a character that fully plays the game for you - which is amazing to complete all the achievements.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Breakout meets Vampire Survivors with a little bit of Tetris inspired city building and a resource gathering mechanic I've never seen before.  Tremendous fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Incredible design for what’s an extremely addictive brick-breaking roguelike.\n\nThe game does so many things right when it comes to the base game loop, featuring powerful and fun items—both in the form of balls and passives that shape your runs. By adding the ability to fuse balls and evolve two items together for new or combined effects, every run becomes exciting. Trying out broken combos is just so much fun.\n\nThe complexity and genius of the gameplay design don’t end there, as there’s a boatload of characters, each with unique gameplay. Adding to this (though this is a spoiler):\n\n[Spoiler] Later on, the game allows you to combine two characters together, adding even more variety to your runs—a truly genius move. [/Spoiler]\n\nBut the game doesn’t just have a great core gameplay loop—it also features an excellent base builder on the side. This not only enhances the fun of the main game but also makes building your base around the brick-breaking mechanics rewarding. As your characters grow stronger, so does your base, unlocking more abilities that tie into the base-building aspect.\n\nThe graphics are charming—nothing particularly standout, but they suit what the game is going for. I would have liked more visually striking or exciting designs, but what’s there works well, so it’s only a minor gripe.\nLastly, the soundtrack is amazing, with a few real bops that perfectly fit the game’s style.\n\nOverall, the game is a solid 9/10 for me.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a mix between Pinball and Galaga with a slight Survivor. I just wish the synergies were more exciting.\r\nGameplay mostly changes based on how you combine each character's abilities, and even with all the interactions, it's not as easy to break the game as you would expect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "What e genuine great game! Like holy hell this game is good! Absolutely a must play!\nBeing so feature rich and fun for this decent price should be a crime.\nWhile the mechanics on their own don't seem unique, the way their implemented and work together feels so refreshing and fun.\nThere might be some minor annoyances I had while playing but nothing I would consider a flaw or a shortcoming.\nTwas an absolute blast to 100%!!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best games for the Steam Deck, but good on the monitor as well. Endless combinations, relatively deep village management mechanics, and unexpected twists the more you play. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fun casual game for in between. I dont even know why but also abit addicting. The city building part is abit annoying at first but gets okay at the endgame.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ball x Pit o kadar iyi bir oyun ki bağımlılık yaptığı için olumsuz yorum yazasım var. :)\nŞaka bir yana gerçekten de bu kadar iyi bir oyun tasarımına az rastladım.  Klasik Space Invaders/Arkonoid tarzı oynanış ile şehir/kaynak yönetimini roguelike çatısı altında birleştirmek dahiyane bir fikir...",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ball X Pit is a fun roguelite that mixes Breakout with Vampire Survivors gameplay.\nThe meta progression includes light base-building and idle mechanics.\nUnlocking all the achievements was fairly straightforward.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have played several games like Vampire Survivors and Mega Bonk, when I checked this game, I thought it would be a copy without much new. I was wrong.\n\n I'll talk about some aspects of the game. \nHaving a base and being able to upgrade buildings as we see fit makes everything more unique.\n The music is very well structured for each level, the variety of monsters is incredible, each boss is unique and has different attacks. I'll add that I tried the game on the Steam Deck and it worked very well, my game was saved and everything worked perfectly. \n\nObviously, I recommend it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Shoot your balls hard and fast towards ever threatening creatures that march relentlessly forward. Game is alright too.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Breakout, Roguelike and Citybuilder?\nCoun't me in!\n\nIt is a really well made game and a lot of fun.\nBasically never had a low time and always were able to do something fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Purchased this when paired with something called CloverPit. I ended up not regretting this!\n\nAnd closing in on 100% achievements too.\n\nAlso personally nominated it for 2 Steam Awards. (well not GOTY, that's too obvious what will likely earn that...)\n\nPositives (+)\n+ It's low in terms of specs needed to run\n+ Pretty decent on a Steam Deck\n+ Gameplay is pretty solid for a rogue-lite and brick breaker combination\n+ Midway through you can play with 2 characters \n+ New Game+ that has limitless gameplay. (doesn't reset your game, but increases the difficulty of the same stages.\n+ Unique boss mechanics at the end of each main stage\n\nNeutral (/)\n/ difficulty starts off very strong at the start, expect to lose frequently at the beginning stage a lot to start\n/ may require excessive grinding of previous stages to survive them\n/ building structures requires multiple matches until you build a specific building to gather resources more often\n\nNegative (-)\n- The Physicist, while having a unique playstyle, is extremely clunky\n- Certain combinations require quick restart (when going for the final achievement) and do not give hints unless you look up a database or guide to figure out\n- RNG when playing automated characters (can be annoying)\n\nOverall: 9.8 / 10 (Strongly Recommended!)\n\nI haven't written a Steam review recently. But, of course, it was required for Steam Awards 2025 :P",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is ridiculously polished. Every bit of presentation, including the soundtrack ([i]especially[/i] the soundtrack) is amazing. It might not have as much content as the monstrously deep old-timers of the genre, but damn it sells itself well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game takes a simple concept and makes a rich and deep gameplay loop that is surprising and engaging. The meta gameplay of this roguelite makes you want to keep playing and the quick rounds keep you engaged.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you're a fan of rougelite mechanics and Arkanoid, then this is the game for you. Also, the music is amazing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun from the first second, super smooth progression, banger music, you will see balls when you close your eyes",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "BALL x PIT is an amazingly fun game. \n\nsome positives and negatives:\n+ great gameplay\n+ huge amount of different characters \n- endgame is kinda lacking \n- game gets trivial",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "bouncing balls and listening to kick ass music - what's not to love ?\nincredible game for such a simple concept , very addictive and chaotic\nit's not super deep when it comes to builds and it's very easy to make overpowered builds with practically any ball evolution as long as you fuse them with one of the spammy balls so everything on screen gets deleted either way and the endgame blueprints make that even easier but it's still just simple chaotic mayhem fun\n\nwould not mind seeing new characters and stages with unique gimmicks (it does feel like there's an intention for more characters at least)\n10/10 enjoyment",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pretty solid game.\r\n\r\nStarts off slow, eventually gets pretty neat once you unlock more characters, items, and learn some combinations that work well.\r\n\r\nLevels vary things up here and there. Difficulty isn't too bad if you're planning to just do all achievements. Gets harder when you play the faster speeds.\r\n\r\nLast patch introduced some weird loading/softlock bug but otherwise it's been solid, no issues.\r\n\r\nI highly recommend picking it up if you want a game where you can spend ~20 minutes or less doing a quick run here and there. Took me around 34 hours to get all achievements but I wasn't really working efficiently towards them until the last 5 hours or so.\r\n\r\nYou can \"beat\" the game in 10 to 20 hours probably, not sure exactly how long it took me to get to the end, but I played until I did all achievements.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "At first glance it looks like a simple, almost pinball-style game, but it ends up being far richer than it appears. The core gameplay is super straightforward, yet the number of characters and unique abilities the developers came up with is honestly impressive. Even the enemies feel interesting and strangely cheerful, despite the game’s very minimalistic design.\n\nPerformance on the Steam Deck is excellent, smooth, responsive, and perfectly suited for quick runs or longer sessions. I’ve already put in over 50+ hours, and I’m still discovering new synergies and reasons to launch “just one more run.”",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "negative reviewers run their mouth about how much they hate ball x pit, maybe they should try getting in the pit and open their fucking third eye to what a real game looks like",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Solid game, worth the price, don't mind the negative reviews. They wouldn't be happy being fed filet mignon.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An outrageously addictive game, and a great modern spin on ol' Breakeout & Arkanoid.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First game I've ever decided to buy straight after playing the demo. Highly recommend this game if you like brick breakers!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "NO SCROTAL LINGERIE VARIANT BALL CAW CAW. \n\nCONSIDER THE CROW DISAPPOINTED CAW CAW.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "A pretty cool concept, but feels very grindy and RNG heavy. After you beat it, it feels like there isn't a ton of reasons to go back, which is a shame because the best rogue-likes only really feel like they're getting started the first time you beat them.\n\nPretty decent fun, but nothing too special or deep.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is balls!\r\nIf balls were golden.\r\nSince this game is that good.\r\nGolden game.\r\nAlexa post that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is wildly addictive. Its core gameplay loop is incredibly fun, and the wide variety of characters makes each run feel fresh. The same level can play completely differently depending on who you choose. The base-building puzzle elements add a clever layer of strategy that keeps you thinking between battles.\nEasily one of the best games of the year!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Genuinely a fun, addicting game that I couldn't stop playing, just one more run.. BALL x PIT along with CloverPit are my all time favourite games this year. Had an absolute blast playing this game and cannot wait for future updates and DLC. 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super addictive, left me wanting more but wouldn't give it to me.\r\n\r\nLet me preface this by saying I had a lot of fun and I'd highly recommend this, but it has some massive issues that hold it back from being truly great.\r\n\r\nFor the first 20 or so hours, the game is a blast! You send a bunch of characters with their own unique abilities against waves of enemies, knocking them down with balls like Breakout/Alleyway, earning temporary and permanent upgrades. You get an expandable home base to construct buildings to unlock more stuff. The majority of upgrades all feel substantial and feel like they have a tangible impact on progression.\r\n\r\nThe issues start when you run out of things to unlock, and it happens very suddenly. For me around the 20-25 hour mark. The only thing you can do at that point is replay the old levels but they run faster and the enemies have significantly more HP. Without the promise of rewards, the gameplay just isn't that compelling to make you want to redo the whole thing with bullet sponge foes. It's mostly just standing around and occasionally adjusting your aim, hoping your stats and the temporary random upgrades you get will be enough to win with.\r\n\r\nBasically, progression pacing just smashes itself into a brick wall rather than gradually taper off. Had it been balanced better it could have easily doubled the longevity of the game. Put some of the building blueprints behind the Fast mode or New Game+ modes, because these modes don't have any rewards and therefore I have no reason to play them!\r\n\r\nAlso had many glitches happen, including enemies that don't leave the board after dying, menu's getting stuck and not letting me leave them and also hard crashing to desktop. The base building part is also frustrating, it does a lot of things where certain buildings need to be in close proximity to others to boost their effect, making it like a jigsaw puzzle and you're constantly moving pieces around temporarily to be used where needed, with no sort of template or undo options to streamline this.\r\n\r\nAs said, still do highly recommend this. It scratched an itch, but was over far earlier than I'd have liked. If you've seen the gameplay footage and have an idea of what to expect, it's all that and a bag of chips! Just don't expect it to be something you can keep plugging away at on and off over a long period.\r\n\r\nI'll go back and do a few more achievements and then that's me done.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun but every build and character and level feels mostly the same, and the meta-progression city-building is a bit tedious",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2] Overview [/h2] \n[hr]  [/hr]\nBALL x PITT is a simple yet entertaining game that serves well as a quick way to pass the time. It’s not trying to be groundbreaking, but it does exactly what it sets out to do: provide casual, easy-to-pick-up gameplay that you can jump into for a few minutes whenever you need a small break. Despite being a minimalistic experience, it manages to keep you engaged with its straightforward mechanics and satisfying feedback loop.\n\n[hr]  [/hr]\n🖥️ [b] Graphics: [/b] \nThe visual style is clean and minimal, matching the game’s simple concept. It doesn’t aim for impressive detail or artistic depth, but what’s here is functional, clear, and consistent. The simplicity of the visuals actually helps maintain the “quick, casual fun” vibe.\n\n🎮 [b] Gameplay: [/b] \nGameplay is the strongest aspect of BALL x PITT. It’s very easy to learn, making it accessible to anyone, and the mechanics are responsive enough to keep you coming back for short sessions. While it doesn’t offer much variety, the core loop is satisfying enough for a casual experience and works well as a stress-free time-killer.\n\n📖 [b] Story: [/b] \nThere’s essentially no story, which is perfectly fine for what the game is trying to be. The focus is purely on gameplay and quick sessions rather than narrative depth.\n\n🔊 [b] Sound Design: [/b] \nSound design is basic but effective. The audio cues provide decent feedback during gameplay, even if the overall soundscape isn’t particularly memorable. Still, it supports the experience without getting in the way.\n\n⚔️ [b] Replayability: [/b] \nThe game’s replayability comes from its simplicity — it’s the kind of title you return to when you want something light. There isn’t much progression or challenge variety, but as a “pick up and play” game, it works.\n\n🚫 [b] Critiques: [/b] \nWhile enjoyable, BALL x PITT lacks depth and long-term engagement. It can become repetitive quickly, and players looking for more content or complexity may grow tired of it. It’s fun for short bursts, but not something you’ll likely sink many hours into.\n\n[b] Conclusion: [/b] \nBALL x PITT is a decent and enjoyable way to pass the time. It doesn’t aim high, but it succeeds in offering quick, casual entertainment whenever you need a simple distraction. For what it is, it works — just don’t expect anything beyond that.\n\n[b] Rating: [/b] ✨✨✨✨✨✨ 6/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. Been playing it on my steam deck mostly. The ball evolutions and combinations you can make are endless. Each character has a unique ability/ball so its fun to have different builds. This game is basically a brick breaker and if you're okay with that you'll also love this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's arkanoid with base-building and RPG elements. Also, the soundtrack is amazing! Totally worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Who knew Space Invaders x random powerups x village building would yield so much fun? This has an amazing gameplay loop where each combat run levels up your heroes and collects resources that then get spent upgrading your village that gathers resources for... another combat run. Basically, it's an endless loop of awesome.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best game I've played in a long time. Simple and addicting, just countless innovation. The dev rolls out new ways to play the game with each new character and building. I haven't gotten bored of it in the slightest and I'm not at the difficulty repeating stage yet.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Would feel nice if every passive had an evolution and it feels like some balls that are connected in theme should have evolutions but hasn't.\r\nGreat fun tho.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game.\r\n\r\nAlot of easy fun and no need to play forever. \r\n\r\nNice with the +1-9 options for shorter games.\r\nso can complete a game in like 5-10 mintues no problem.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rolled credits\n\nThis game takes maybe an hour or two to click so to speak, but once it does, I found that it had an absolute stranglehold on my brain. Something about the way this game plays really just did it for me, and I found myself doing the \"one more game\" loop every night for several nights.\n\nAs good as this game, I really disliked the game's town building minigame. I get what it was putting forward, but I absolutely did not want to interact with it at all. Luckily it isn't really \"required\" to play the game, but the rate at which you earn your permanent upgrades can be severely hampered if you don't thoughtfully build your town.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a nice spin on the genre, calling back to one of the classic first type of games in Brick Breakers. Not something I devote a lot of time to, but a fun game to play a round or two a night.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly addicting and way more fun than I ever thought it would be. Played it exclusively on the Steam Deck and a lot of times when I was playing something else on PC I just turned it off and went on the couch to play this game instead. Definitely my Steam Deck game of the year.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "God this game is fantastic.  Perfectly addictive roguelike/survivorlike formula.  Interesting build variety.  A new game plus that doesn't require a whole other save file.  The only criticism I have is the very early game, where upgrading and building feels really slow and discouraging.  Once it takes off, though, it's hard not to resist the 'one more run' tug.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wish I could tell you what this game was about.\n\nIt was a blur. I played for 40 hours in the first week I got it. I couldn't stop. It was just.... balls and more balls.\n\nIt was so fun.\n\n9/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super Addictive... Not all balls are created equal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice Gameplay\nNice Balls\nRepetetive\nStill lot of fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a drug pretending to be a video game.\nI don't want to spend too much time talking about it because I want to get back to playing it. Instead of a long winded review I'll just post a referential link. If you get it, you get it:\nhttps://i.imgur.com/I5FzDDs.gif",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's impressive how Breakout can indeed be hugely fun and innovative. AND KEEP DOING IT. This is a game that is not afraid to take an idea, run with it, then twist it on its head and improve the game in sequence. It's fun, it's got a great progression, a truly memorable and excellent soundtrack, not to mention a very good visual style. All in all, a game I thought had a good demo, but damn, it's rapidly become one of my favourite and most enjoyable games of 2025, and there's a lot of those this year!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun relaxing game that you can't stop playing. Really cool soundtrack too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly addictive and satisfying, plays perfectly on the Steam Deck.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely fantastic game. Plug in, vibe for 15-30 minutes, relax, and enjoy some crazy ball bouncing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, not had this much fun in ages.\r\nWould 100% Recommend to my friends and family",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One could say this is a variant of roguelite pinball with special ball fusing powers and base building in the downtime. One could even say it's reverse tetris.\n\nWhat I can say on the other hand, it's digital crack with a great soundtrack. The Demo with the BONExYARD level was enough to hook me after a few tries. Was an instant buy Day 1. \nStart may be a bit slow, but progression is pretty consistent, they even let you bring a 2nd character for combos later on. And if that wasn't enough, you can even build a nuke with a certain evolution x combo. \n\nAll in all, an easy recommendation, especially for Deck gaming. Can't wait to see what future updates will bring.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A brick-breaker roguelite is one of the more interesting concepts in the space, and the game definitely delivers on the premise",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good game overall. Can be played in ~20 min increments at the start, with faster speeds and higher difficulty ~10 min increments later on and even later on there is a level of automation that can be left to run in background if there is a need for it. Progression and city building elements felt right. For some characters some bosses/levels were harder than others but everything is beatable.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Part pinball, part brick-breaker, part survivor-like, part city builder. Ball x Pit does so many things you'd think it couldn't possibly work well, but it does, and it does so wonderfully. The ball evolutions were a blast, the city building aspect was clever and well done, and the meta-progression was perfect. I had a blast with it, and hope to see more content down the line. \n\n[url=https://store.steampowered.com/curator/45773453/]My Curator Page[/url]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A fun addicting Game that scales up pretty quickly. Number go up is good!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A simple yet addictive and very creative rogue-like with pretty neat inventory management-esque town building and fun brick-breaker gameplay. Lots of item/weapon synergies and lots of creative weapons. I likes it a lot : )",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A very polished, yet ultimately kinda shallow roguelike experience. You'll only ever lose a run a handful of times in the beginning before you have high enough stats to mindlessly play the rest of the game where any synergy will result in a win. It's a little telling that about halfway through you'll unlock multiple options to have the game play itself. All of that being said, it's still a very fun and satisfying game! Tons of dopamine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A solid game if you like games like mega bonk, hades, vampire surviors or risk of rain 2 you'll def love this",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Frankly, I almost skipped this game because the Ricochet-like gameplay loop seemed similar to P2W mobile games. Thank god I didn't. Do you remember the days you were playing dozens of random games on ArmorGames, Kongregate, and Newgrounds? [b]This is it. [/b] Ball x Pit has the exact feeling of stumbling upon a gem on these websites.\n\nFor me this was a break from plot-heavy, hardcore, and brain-boiling games. You don't have to put hundreds of hours into this one, you don't have to keep a separate Wikipedia in your head to be effective, and you don't min-max every aspect and every decision to reach the juicy content. The developers felt the same way creating this project, and you can TELL when you're playing.\n\nBasically, the game has two sides: the runs and the \"village\".\n\n[h2] THE RUNS [/h2]\n\nYou shoot balls at enemies and try not to die. Sounds lame, but this is exactly where the execution is ahead of the idea. It's not one of the games where you get through the basics with every upgrade being \"+10% armor/damage/speed/HP\". The devs take advantage of what they have created. You can work around the direction of the shots, the \"baby balls\"(yes, it's called that), the bounces, the walls and the back of the field, friendly pieces, debuffs/AoE/DoT, and, of course, [b]BALL SYNERGIES.[/b]\n\nCertain combinations allow several balls to evolve into something new by creating, for example, a radiation beam from a poison ball and a light ball. Possibilities are fun to explore and play around, but the apex of the offered fun are the [b]FUSIONS.[/b] \n\nBasically, every ball (incl. the evolved ones) can be combined to create an even more powerful ball, and you have all freedom in the world to utilize that. Oh, this ball passes through all enemies and freezes them? Oh, the other one applies bleeding to everything it touches? Combine them and you'll have a soaring monster that just freezes and bleeds everything on the screen.\n\nTo be fair, some of the balls feel way weaker than others, but for me it's closer to being a part of the experimenting rather than a balancing issue.\n\n[h2] PLAYABLE CHARACTERS [/h2]\n\nThey are [b]actually[/b] different from each other. Not simply varying starting items and stats. The devs gave unique mechanics(even some truly meta stuff) to each character, making the process of building around their abilities always unique and fun.\n\n[h2] THE LEVELS [/h2]\n\n...are also quite good. Each level contains unique bosses, interesting enemies, and certain mechanics that influence your playstyle. By the way, it's not the usual roguelike \"clear stage 1 to access stage 2, repeat every run\". It's just 8 separate levels that you unlock as you progress, so there's that.\n\n[h2] THE VILLAGE [/h2]\n\nAre you familiar with action roguelikes that have some kind of lobby where you simply spend gold to unlock X or upgrade Y in a skill tree? Here you have a small city builder included, ranging from placing trees and farms to calculating the best building combinations Backpack-Battles-style. \n\nThe only issue I've had is that the progression sometimes makes the game too easy. The powerups you unlock expanding your village bring [b]massive[/b] advantages to you. Because of that, struggling to complete a level feels like \"I need to grind a bit more\" instead of \"I have to learn a bit more\".\n\n[h2] THE GRIND [/h2]\n\nThe grind, despite taking place in this game, is almost automated with the help of what the devs provide you. Have you thought of a character that [spoiler] literally picks the best choices for you [/spoiler] ? Or someone who...  [spoiler] PLAYS THE GAME FOR YOU ENTIRELY? [/spoiler] What about playing [spoiler] two characters at the same time [/spoiler] ? What about sending a character to [spoiler] complete a level on their own [/spoiler] ? Point is, there is a bit of grind but you can manage it however you prefer to.\n\n[h2] NON-FUNCTIONAL STUFF [/h2] \n\nMeaning graphics, art direction, animation, music, bugs, etc. \n\n[b] Done well. [/b] These things are more subjective than objective, but they surely don't feel cheap, lazy or unfitting. As for the bugs, the only thing I've encountered was unaligned text in pop-ups on unlocked buildings(IIRC), so nothing major.\n\n\n[h2] CONCLUSION [/h2]\n\nThis is an almost perfect example of what a casual game should be in 2025. Chill, fun, polished, and providing space for creativity in the core loop. If you need to take a break from stuff that is heavy for your mind or heart, play Ball x Pit and witness a great execution of a simple idea.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly addicting brick breaker gameplay paired with lots of surprising mechanics.  The ending was particularly satisfying, as was the last level. Has a NG+ and it's very replayable, with an economy and base building system. Loved it\n\nThe unlockables and progression are really good. The game isn't afraid of experimenting with whacky game-breaking mechanics and combos, cause in the end it's all about having fun and power tripping your way to Ballbylon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty addictive game.\n\nStarts of really strong. Plenty of heroes and balls to try from.\n\nEnd game could be improved.\nNew game + or ++ are kind of pointless.\nInfinite scaling as well as building upgrade costs scale too high.\nSome buildings should be reworked. What's the purpose of some of them farming stuff when you want to keep them close to another building that gives + exp?\nGive more options to ban / banish unwanted items",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Starting from a roguelite block breaker with a nice ressource management/gathering twist, the game evolve with new caracters you unlock that change the gameplay (I'm writing the just after unlocking a caracter that once again changed the gameplay in an unexpected direction, it's so nice). You can spend several minutes pick a new ball for your build, adjust your settlement to maximize synergies of the buildings, or plan your gathering to progess the fastest you can. \nOnce again Devolver push us a great game, and I feel like playing a game with a familliar ambiance (music, art), being cosy and comforted. Kenny made a wonderfull game, thank to you, keep being good like this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "man, that was a good time.\n\nrogue-like with over a dozen characters that sometimes differ greatly in gameplay, survivor-like item-combining that can sometimes net crazy effects, engaging base-building puzzling between runs; and all with classic gameplay mechanics similar to blockbreaker (or does anyone remember \"Jardinains!\"? :D)\n\nhigly recommended if you like Halls of Torment, Vampire Survivors, Deep Rock:Survivor etc.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What to say? I'm balls deep into it. Playing and upgrading my balls has become an addiction.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "New game +5 at the moment and still finding fun new builds and combos.  It should feel repetitive but every time I find a new combo of either characters or ball combinations it just hits right.  Characters that I disliked or thought were bad in the beginning have turned into some of my best runs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is bouncing balls. The city sim is bouncing balls. Your mind is bouncing balls as you learns and adapts.\n\nPure devotion to a concept and a profound, sustained exploration of a fiendishly addictive game loop. \n\nThey've tapped into something deep here, and they've done it so well. Play it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love it for what it is. Like many newer roguelites, there is more than one gameplay loop. The main loop is an Arkanoid-style block breaking game, with a good variety of enemies and a great \"ball\" upgrade system that has some variance between runs depending on which upgrades you get access to, but enough determinism that if you WANT to do something specific, you have an opportunity to make that happen. None of the upgrades are so rare as to be impossible to target, everything seems to be equally rare, although different characters seem to have a different ball pool? Maybe? \n\nThe outer gameplay loop is a strange kind of base-building placement game where you place buildings and then \"harvest\" by shooting workers ala pinballs into your town where they bounce off of buildings to produce resources or complete construction of said buildings. The activities you do here have a huge impact on your ease of progression through the levels in the inner gameplay loop, and there is a steady feed of things to build and upgrade. Honestly, the steady progression here is one of the best-balanced in the genre, there are constantly new things to unlock and build until you're near the endgame. The placement game itself and the constant reshuffling of building you need to do to maximize harvests and construct buildings is very contrived and silly, but it works. The variety of impacts these upgrades have on the main Arkanoid-style game is very impressive and keeps that main gameplay loop fresh and exciting even though it is repetitive.\n\nAt this price point and scale, huge recommendation for any fan of roguelites or pinball/arkanoid style games. Seems extensible with expansions too :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's alright.\r\n\r\nJoking aside, it's a good game that is well worth it's price. Upon writing this, I just finished NG (new game) 6+. Only critique have is that some of the evolution combos are way underperforming than others, and if you don't have the stat line to clear the NG (lvl) + check, then you are pigeonhole into less than a handful of ball evolutions/combos/playstyles (which can become repetitive after awhile).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's Breakout meets Space Invaders but roguelike and the fact that it took until 2025 for someone to figure out that those things could be combined like this is testament to some brilliance.\n\nThe game doesn't last long - you can trivialize the difficulty after a few days and it essentially becomes an idle/afk game, but for the price it's worth every penny especially given what this team might be able to do with that money in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun Chill game... the Radical char.  makes it nice to send them OFF and eat dinner etc.. while he plays for you later on.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[spoiler] Feels like taking crack and LSD at the same time... game of the year. [/spoiler]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Супер:\n- Новые персонажи и здания с каждым разом всё интереснее и влияют масштабно на геймплей. Разрабы постарались, чтобы чувство прогрессии не проседало.\n- Отлично играется на стим деке. \n- Визуальный стиль очень хорош. Очень нравится. Уровни, противники, здания, шары — всему уделено внимание. Советую посмотреть как кто-то играет со стороны, чтобы оброатить внимание, сколько всего в быстром темпе игры вы не заметили. К сожалению, шрифты на русском не настолько круто подобраны как на английском.\n- Игра заканчивается, когда уже начинает приедаться. Достигает насыщения примерно за 30 часов и это хорошо.\n\nИтог. Это отлично сделанная игра, чтобы провести с ней время :) Можно выделить как недостаток, что в ней нет чего-то, что будет заставлять к ней возвращаться. Тем не менее советую попрбовать — это классный опыт.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great progression. Start with a single ball and a few baby balls. A few hours later the whole screen is filled with balls splitting into balls and you spawning even more baby balls for everything you do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10. Precise ball physics, meaningful build choices, and strong fusion system make runs engaging. 15+ heroes, 70+ base upgrades, and distinct floors add variety. Clean pixel art, solid sound design, and smooth performance on Deck. Late-game balance can be uneven, but updates are regular. Good value—demo progress transfers. \n\nHighly replayable.\nThe community shares effective builds and leaderboards add competition. Devs are active on Discord with quick patches. If you enjoy Vampire Survivors-style gameplay with more control, this stands out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "100% Review: Ball x Pit is a really solid roguelite.\n\nIt genuinely feels nice to play - extremely responsive with what you're doing, the movement feels nice, the damage numbers are appealing and the evolutions that you start progressing through are extremely interesting. You really start to feel the power building as you mess with your builds, as well as your own little \"Settlement\".\n\nIt's incredibly fun, although you'll very likely require a guide for some of the hidden evolutions - which I wish there was a slight pointer for rather than having to scrub the internet to locate guides for. The end-game is quite literally new-game+, so it's the same you've done before just a health sponge for enemies and higher dmg, although the customisation of your runs is good whilst it lasts.\n\nFor the price point, it's incredibly fair in my eyes and well worth the money spent.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is like crack...\r\nits so much fun and very addicting (^_^)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10! Very addicting! Well made. Decent enough content. Sure, you'll complete everything if you play it non-stop. I'm almost done myself. It's still fun testing out different combinations even after reaching \"END GAME\" status. \r\n\r\nHoping for more maps/characters and maybe additional building mechanics?",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "La verdad es que es excelente, la progresión la creatividad al mezclar varias mecánicas como tetris, pong. Se nota que fue hecho con cariño, los personajes el diseño todo es muy bueno y adictivo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A clever and fun breakout clone. Though I don't think boss fights, with one strong enemy, don't fit the nature of this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I own. Time flies while going from level to level and I love the town building aspect as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First time I played I sunk 5 hours into it. Certified banger. Stupid good soundtrack -- esp the enemy chants when you're close to losing. The progression metagame is a bit boring and tedious, as well as resource collecting almost feeling like an idle clicker, but overall I don't regret spending money on this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is so engaging. what will be even more better if it has online PVP and/or 4 player Multiplayer battel with friends on endless mode to see who will last the longest. <---- maybe in the future... Just a thought.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game. Cant stop playing. F U.\n\nAnd btw there isn't any \"bleed + damage\" kinda item. Freeze, Burn, poison, even fricking charm has that kinda os item. Can you please add it? Tks.\n\nAnd+ i will buy any dlc\n\nAnd++ can you do a balatro dlc? would love a joker ball\n\nAnd+++ end of joke",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game with an endgame (speedrun &/or harder challenge) to keep you playing after you have acquired all the achievements.\nIt's a game I will definitely keep installed to play from time to time.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I really wish I could leave a mixed review cause there's a lot to like about this game but there are some real issues I have with it and they kinda ruin the game after you play it for a while. This game starts really strong, the early parts of the game and the mid game as well are exciting but around the time you're at the second to last or so area the very nature of the game changes drastically in a way that I really don't like. \n\nFor the early game and most of the middle part of the first playthrough  the dynamics are about what you would expect from roguelites nowadays. But once you start getting toward the end of the first game the game starts putting a lot more emphasis on metaprogression than gameplay and this just becomes more and more true once you get into new game+ and eventually the game reaches a point where your metaprogression is basically the only thing that really matters and the game kinda plays itself. This is intentional too I'm pretty sure, the last character you unlock literally plays the game for you without any input from you. This is a roguelite that gradually devolves into an autobattler as you get further into it.\n\nIf you're into that kinda thing then this probably sounds great but I enjoy roguelites that I actually beat through playing well and this game is that kinda game early but it just doesn't stay that way and it's disappointing. I think the core, fundamental problem is that really the only thing that matters even a little bit in this game is dps. Either you have the dps to kill enemies quickly enough or you don't and there's really nothing you can do if you don't have the dps. It just doesn't matter how well you play, if the amount of damage your outputting isn't good enough you will lose no matter what. This creates kind of a conundrum where the only way to do harder difficulties is for your to be more powerful thus the all consuming state of the metaprogression in this game.\n\nEdit: I kinda also wanted to say if you want a proper roguelite there are loads and loads of great roguelites out there that you can play instead, and if you want an idler which this effectively is after like 15 or so hours of gameplay there are loads of idlers way better than this too. Go play realm grinder or something that games free and it's way more interesting than this games grind loop is.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I'm glad I held off on reviewing this game.  The game gets easier as you play it.  It quite literally later turns into a farming sim where 80% of the characters can beat the game on the hardest difficulty on autoplay...  Really sad.  You are looking forward to the challenge of the later levels and your literally just sitting there melting all the levels like nothing.  If you like a challenge and replayability... this is NOT THE GAME.  It makes you sad you put in the time just to get to a point where there is ZERO challenge or skill in the end game.  It's an overpriced farming idle sim masquerading as a action-arcade bullet hell.\n\nIt was good for the 1st 2 levels... and then it gets too easy after that.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "This game is fun for maybe 6 or 7 hours and then it is a constantly repeating borefest. no challenge, no new mechanics just keep doing the same boring thing again and again",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "If you don't enjoy pinball, you wouldn't like it anyway. That's it for me. Thought management portion might entertain me, but the core is just pinball\n<번역>\n핀볼류 자체를 즐기지 않는다면, 좋아할수가 없다. 환불 각. 뭔가 경영 부분이 재밌을 수 있다고 생각했는데, 볼 굴리는게 핵심이다.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Don't get the hype. Its very repetitive. The number of items and actual memorable combinations is way too limited. It's not bad but.....not great either. Wish I could give it a neutral recommendation but gotta go for a no on this one.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's the same repetitive, 0 button, meta unlock grind as every other survivors clone out there.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Ball x Pit lacks the item variety that keeps the repetitive design of rogue-likes fresh. The level design isn't that interesting either - the core gameplay is essentially a dps check with a boss fight at the end. It was fun for the first couple hours, but I feel like I've already experienced all the game has to offer. 5/10.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I don't know exactly how to explain my thoughts on Ball X Pit. \n\nThe visuals, style, and sound are all great. That much is obvious. \n\nBut there's something missing. The whole game is too easy, but more critically it's *too simple* and monotonous. You can't really 'lose' at most levels unless you aren't paying any attention. Instead, you may fail to have a high enough DPS to proceed. This mostly only happens early on and can only really re-occur in NG+, so you can't even lose that way.\n\nThat's my main problem. It's kind of braindead. You do the same thing, over and over on every level. No level ever really requires much thinking or strategy. Character abilities initially are interesting, but quickly become mostly irrelevant. Games like this can have complexity (abilities, movement, etc.) on the enemy's side or complexity on the player's side - but neither has any real meat to it. \n\nIt also lacks some of the fun of a game like Enter the Gungeon or FTL. There are never those 'Hell yes!' moments where the stars align and you get an incredible combination that lets you wipe the floor. Nor do you ever feel like you're getting more 'skilled' at executing it even when your luck is bad. Every combination feels almost perfectly equal in power. It's like they tried *too hard* to be balanced, as absurd as that sounds.\n\nAnd then the game flirts with being an idle/incremental game in a few areas, but it doesn't have enough depth there to go anywhere with it. It feels tacked-on.\n\nThe entire second half of the game I kept expecting the game to open up and reveal some big twist on the idea, but it just...never materialized. So I finished the game and left it feeling pretty disappointed.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This one is great fun for about 20 h. Then you realise this game is in fact in a different ballpark altogether.\n\n[b]Why did you play Ball x Pit?[/b]\nBecause, like a lot of other folk, I can't help but get hooked by a bit of RNG. I've played (though I'd say not mastered) quite a few roguelikes, and this one looked a lot like Vampire Survivors. Plus I'd been wanting to play something like Breakout quite badly.\n\n[b]And you were let down.[/b]\nWell, not at first. BxP does a lot of things - pretty much everything in fact - right. The gameplay is chaotic fun, there's a wide range of characters to play, and a few of them bring something really fresh to the gameplay and really change things up. The music is hypnotic and the power-ups a lot of fun to experiment with. The base-building offers another fun layer. Hence I really enjoyed playing BxP for a solid amount of time.\n\n[b]Why the negative review then?[/b]\nWell, that's a tricky one.\nLet me point out a couple of things that sound - and are! - positives initially.\n[list]\n[*]While you can play a wide variety of characters, and each one of them can bring devastating tactical nous with it, in particular depending on the boss, it didn't really seem to matter that much which one, or rather which pair, you chose for a run. Ultimately, choosing the right power-ups seemed far more important from midgame onwards.\n[*]Runs are really short (15 mins ish), so there's none of that sweaty-hands, lose-or-win stacking of difficulty.\n[*]Sure, there are some really powerful combinations of balls and passives, but it seemed as if it only mattered that you evolved things, not that you chose certain game-breaking combinations.\n[*]Base-building is good fun, and there's a lot to unlock, but ultimately, you don't need to waste a lot of thought on it, as metaprogression handles itself pretty automatically.\n[/list]\nWhich is all fine, particularly for a gamer like myself, who likes to enjoy this type of game without referring to an Excel sheet (not that there's anything wrong with Excel). However, I noticed that things were going pretty smoothly, so much so in fact that whenever I unlocked a new level, I'd be able to beat it first go. Now, maybe that's just because I play ball so well, but I highly doubt that.\nUltimately these issues beg the question: Is this really a roguelike?\nSadly, and hence the thumbs-down, I've come to the decision that, to me, come midgame, BxP can more accurately be classified as an idler. And I'm not really into that.\nUpdate: From late midgame onwards BxP devolves into watching a let's play video. Sad.\n\n[b]What about achievements?[/b]\nI haven't completed all of them yet, but I would say that - in the vein of an idler - these are very fair and fun and should unlock pretty naturally during general play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is... fine. I keep looking for more meat on the bone.  Successful runs aren't super exciting and failed runs don't often feel very bad.  For me, this is a game of just going through the motions.\n\nBase building could be completely removed from the game, imo.\nThe different balls and ball combinations are cool.  Passives are there, and can make a difference, but they're less exciting.\n\nIt's hard for me to recommend even though I don't think the game is fundamentally bad.  I'm just not excited by it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I think the game was overhyped. It has a unique game play, however, I didn't find it challenging for most of the time I was playing.\r\n\r\nThe game could benefit from not locking the difficulty slider behind playing more. For instance, If you find the stages too easy, you can't skip to FAST+10, without doing 9,8,7,6,5,4,3,2,1... \r\n\r\nIn addition, trying out the higher stages, requires doing the same map with 8 different characters to progress the game... I don't like this type of system, I find maybe 4 of the characters enjoyable to play as, and the others as a burden. Having switch between playing what I like, to what I don't like, and back, I felt was cumbersome. \r\n\r\nI have a good bit of time spent in the game, but most of that time is attributed to the character that plays the game for me... I am not sure how I feel about this character, on one hand it may the tediousness of the game more manageable, but on the other hand it \"beat the game for me.\" Once I unlocked The Radical, the game was solved.\r\n\r\nAs for the base building gameplay, I think that was enjoyable to some extent. A unique way to get unlocks and power up your characters. However, some of the buildings propose endless stat growth. I don't see how you can balance difficulty in a game, when you hand people a means to give your characters large boost in their stats.\r\n\r\nPrice of the game. I think 13 (15?) dollars or whatever I paid was fair. I feel that I did get my money's worth from the game. At the time, Nov 2025, I do not recommend the game. It felt too easy for most of the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ball X Pit is a roguelite game with an Arkanoid-esque theme. Unfortunately, it succumbs to the same too-much-content trap as many roguelites, leaving a game with both tedium and balance problems.\r\n\r\nBall X Pit's UI is sleek. The graphics are smooth and well-animated, even with many balls moving at very high speeds, and its sounds are crunchy and enjoyable. Its controls are responsive and intuitive. The moment-to-moment play is in many ways its best feature. The only problem is that the player's moment-to-moment actions have limited impact. There are two reasons for this. The first is that, unlike in Arkanoid, having a ball get by you has very little impact -- a slight delay, slightly decreasing your DPS.\r\n\r\nThe second is the Big Roguelite Mistake. Rather than winnow down content to The Good Stuff or get balance to the Right Challenge, Ball X Pit includes everything and the kitchen sink, including enemies that are far too spongey to defeat. Don't worry! By grinding through the metagame you can unlock all these various options, many of which are bad, as well as straight numeric power to make the game beatable.\r\n\r\nBut do you want to? There's probably a good game under here somewhere. But most of the characters are similar or terrible, with just three or four who are both distinct and powerful, and the numeric power gradually swaps the game from \"numerically impossible\" to \"trivially easy.\" In the mean time, most runs are the same, with the same per-run upgrades being (mostly) desirable every time.\r\n\r\nIn the end, Ball X Pit is a slick package with very little inside. Another year or two of development, mostly spent removing things rather than adding them, might have yielded a pretty great game, but what's here is a mess that's easy to pass up.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "BALL X PIT is nothing new, but it merges existing gameplay mechanics into something that is \"in fashion\" now and can provide a lot of fun. \n\nWhat it doesn't do is provide any form of a challenge. Most roguelikes have progression mixed with challenge, so you can't exactly win almost any of them on the first try, no matter how skilled you are. \n\nHowever, BALL X PIT disregards skill part entirely. As long as you do bare minimum of thinking, which is to form a resemblance of synergy between your character and equipment, the rest does not matter. If you don't have the damage, you can't finish a level, but if you do, you can almost idle through a run. \n\nThe base building isn't all that clever either - while it seems somewhat novel at the start, it's just flatout bonuses that make you stronger, so you can do more difficult missions that now cease to be difficult. \n\nTL;DR A nice looking package devoid of any skill requirement, bordering on an idle game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "egh, this game was pretty disappointing. i was really intrigued at first, anticipating some level of complexity, but it really fell flat the further i progressed. there is just no incentive to really put effort into the game. the difficulty is basically nonexistent, and what difficulty there is is almost immediately smoothed away by stat upgrades.\n\nthe town section being its own minigame is such a cool concept, but the meta involves really boring strategies. -- sure, i *could* make some elaborate little town, but there just isnt a reason to. \n-i wound up bouncing all my guys on a narrow corridor along the wall to generate money and build buildings really fast\n-the bonuses that most buildings give are all just things that make the game go by faster. levelling up is honestly quite fast already, and then you add a 25% xp bonus on top of that? and then *another* building that gives *another* xp bonus? getting each character to level 10 takes very little time. \n-there is no reason not to shove as many of the smallest buildings you can around the mansion to generate a high amount of dollars per minute.\n\na lot of the design of this game can be encapsulated by the addition of a character that PLAYS THE GAME FOR YOU. you can just take your hands off the keyboard and look at the pretty lights and then not have to put any further effort into any part of the game after that. whats the point of a game that encourages you to stop playing???\n\nthe ending is pretty trash. cliche vague ending, and not even like, an endless mode or something. i would love to play the version of this game that is hard and requires some kind of effort to play or incentive to stay at the keyboard. \n\nlast thing. what really interested me was the idea of there being a *lot* of different balls to acquire, and specifically the idea of evolving a ball 2 or 3 or 4 times. but thats actually not true at all? maximum amount of times you can evolve a single ball is 2, and i know theres a lot of balls in the game but it really doesnt feel like it. most of that amount is *fusions* and not *evolutions*. and fusions just feel like cheap, uncreative evolutions. simple combinations.\n\n5/10 really didnt live up to expectations",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is fine and fun for a few hours but after the discovery it's incredibly shallow. \n\nFun builds are hidden behind a cheating rng, during some runs, some balls or items just won't be in the level up shop no matter how many rerolls making the fun combo impossible to get that run killing the fun. \nI never managed to unlock some of the most fun combo because rng just said no. \nThe town building mechanic is messy and hard to read while trying to optimize while being of little importance outside of padding the game time. \nThe game is way too easy and lack any real challenge, NG+ is a boring grind with no new content. \n\nSide note, over half of my game time is leaving the commando character play on its own to progress into ng+.\n\nOverall, a strong hook a nice presentation but a huge waste of time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wanted to love this game.  The videos looked cool, the trailer made me legitimately laugh out loud, the premise seemed cool, the vast multitude of combinations are great!  The music is nice, the game looks good and it runs well. It's overwhelmingly positive reviews so it's obviously working for a lot of other players.  And it just... did not click for me.\n\nI\\ve played a ton of roguelikes from Isaac to Hades to Slay the Spire to Monster Train to Vampire Survivors to Spelunky to Balatro to Nightreign...   and in all of those games the power ups you get along the way are random and the key to victory is largely in learning what combos work and figuring out synergies and what risks to take... but with knowledge and a solid grasp of the enemies, it's possible to win most of the time even when you only get junk.\n\nUnfortunately, it feels like the game is really reliant on you grinding out meta upgrades in the background rather than being able to naturally make progress.   The \"build a farm\" aspect of the game in the main hub gives you permanent upgrades for more health, damage, attack speed, etc, and it seems like it is *very* difficult to progress the game without just grinding up the base stats a bunch.  So not until you've just lost a bunch of rounds so that you can gather upgrades.  \n\nEven after you find good weapon upgrades and are destroying things readily and you know how to hit a boss in its weak point... its very very easy to just lose because you're simply not dealing enough damage and things are forever pressing forward.  You need to lose so you can go back to base and plink out a couple more upgrades, then play a round, lose again, go back to base, and plink out a couple more upgrades....\n\nThe stages got easier as I played, not because I got better or figured out better things, but just because my passive starting damage was higher.  I was eventually getting stronger shots, faster shots, more base health... and just needed my raw base stats to be increased from grinding and repeating stages rather than making progress.  and I found I was starting to go into rounds, intentionally dying in five seconds, so I could go back to base to try and get a power up finished before making a real attempt.\n\nIt's clunk and it's just not a lot of fun.  Other players that have gotten further than I am talk about how some of the later characters or power ups change everything, and I'm sure that's true, but I've gotten several characters, up to the fourth stage, and all the blueprints and upgrades up to that point (which I have upgrades several times)  and it's just not doing it for me.  \n\nI'll keep chipping away at it for a while, I like the ideas that are there, and all the overwhelmingly positive reviews can't be wrong, but it's just not gelling for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is gets too repetetive too quick.\nWith losing being seemingly impossible you have to just sit through each level for 15 minutes.\nThis game has a character that chooses upgrades for you randomly (?). There is no reason to even move a mouse playing as him. Bosses seem to be unable to do anything each having a couple of moves that are dodgable with closed eyes if you seen them once. It's a wierd design choice to make the boss an easiest part of any level.\n\nAdd more projectiles: maybe hazards like a random unbreakable wall or a mini maze. Make some enemies more resistant to so stuff. Make me play the game and not just sit waiting for level to end.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "BALL x PIT is a fun little game that starts off strong. Unlocking new characters, levels, and buildings feels rewarding and keeps you hooked early on. The first few hours are pretty tough and entertaining as you experiment and progress at a nice pace.\n\nAfter a while though, the game slows down quite a bit and turns into more of a grind. It eventually picks up again toward the later stages, offering a steady and satisfying rhythm of progression… until it runs out of new things to show you. At that point, it still expects you to push through about half the achievements, but without any additional unlocks (other than a few buildings I guess) or real incentives to keep going, the motivation drops off, for me at least.\n\nOverall, it’s a solid and enjoyable experience for a few sessions, with a fun loop that just runs out of steam before the achievement list does. If Steam had a neutral option I would pick that, but as it stands, I don't really feel like I want to outright recommend the game to anyone.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can't recommend this game, but I understand people who like it.\r\nThere aren't enough ball evolutions.  They are very limited IMO and a few even EVO to the same thing.\r\nUnlocking later balls feels way too late.\r\nThe behavior of the balls gets completely lost at the upper speed levels.\r\nThe power and synergy of different damage types gets lost in the speed too\r\nThe relics you can get are very uninspired, and again, you don't unlock many of them until WAY too late in progression.\r\n\r\nThe levels themselves are very samey and devolve quickly into \"dodge this, or that\".  You either have enough dps to overtake whats coming, or not.\r\n\r\nCertain upgrades/relics completely screw you over and its mostly ones that cause your balls to not collide with enemies.  Be warned.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has a decent amount going for it, but the sheer reliance on DPS for EVERY SINGLE RUN can be frustrating and limiting.  By my 5th hour you were either destroyed by the first mini-boss as a DPS check or completely obliterating the entire field and I was almost praying for the boss of each stage to come down so it could end.\r\n\r\nMusic is good not great and gameplay is unfortunately way too shallow for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ok game when it starts, less and less enjoyable over time.\n\nThe base building is boring at best and is artificially holding player back in power. It doesn’t matter anyways because Hemorrhage dealing percent HP damage does not care about enemy inflation in the slightest; Fusion it with any baby maker ball is outright brokenly op. On the contrary ghost and wind are absolute trash while lightning exists so you can flash. \n\nOne you learn the meta the game is over. Do not look up guides as it will inevitably shorten your game time.\n\nBought at full price ($14.99), worth $5 at best imo.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's an idler game in disguise. It stars off quite good and bit challanging and its fun to figure out which balls you want to create and who you want to level up. However, in just a few hours into the game almost everything becomes super easy. Your characters can level up infinitely and eventually the whole game becomes zero challange and you can pick any upgrade you want, and tank through everything without trying.\nEventually you can also even unlock a character that PLAYS THE GAME FOR YOU. You can choose not to do this, but why not if the game is already so easy that you can literally close your eyes and hit random buttons? The town building also has a lot of idler elements to it. Get it on sale if you want something super casual and are into idlers.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "cool style, but gameplay gets real boring/annoying pretty quick",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just boring to play, fun at first for the first few levels but it's the same thing over and over again with no storyline or cool characters to keep you invested or interested.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm very mixed on this game.  I love the \"breakout roguelike\" formula, and I've put in a good number of hours, but the late game is actively bad.  The game focuses more and more on the meta progression with meta upgrades straight up giving you levels on your in game balls and upgrades.  This wouldn't be an issue except that you get to the point of starting with 3 fully upgraded basic balls, and already jumping into the evolutions with your first pickup.  On top of this, the final character unlock actually plays the game for you, so for some reason ball x pit is more of a poorly constructed idle game than a roguelike.  I'm not going to say that I haven't had fun with this, but I recommend avoiding reading guides and roughing it out through the early and middle games if you do, because the late game won't be satisfying.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I did like the game at the start and was having fun. but the mid to late game it got really boring. they throw too much of the sauce away fast and then just give you big numbers. the characters in the mid game are the best then they get really sour at the end, radical and tactician made me want to uninstall the game. not enough content either, the balls and passives dont make enough interesting stuff.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Although I've had a lot of fun with this game, for some reason over night its stopped being compatiable with linux. I was playing it fine yesterday.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it can be fun but most runs end with a wall of enemies as your are stuck at the bottom of the screen helpless. don't expect to win very often.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a visual mess with cheap unoriginal gameplay.  The devs have deliberately made the enemies attacking elements small so you can't see them easily.  It's laughable.  Your character can't even catch your own attack balls properly to use again, you need to be fairy still otherwise they will just pass through you.  It's a huge mistake for a game mechanic which is so important for speed.  It's a typical grindy rogue type game where you have to die all the time to get upgrades.  Not much skill required.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a mostly fun game, however there are a few characters that make the broke my desire to play the game. There's one toon that changes the fast paced game to a turn-based slow as molasses slog. And another toon that does everything so you just watch it play?! You can pair them together to get completion on them, so ii figured i'd do that to get all the achvs, but after watching youtube for 20 minutes while the game played itself, i thought, wtf am i doing, and uninstalled. Otherwise great game, shame they let an intern pick character abilities.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Personally, I liked the game, but the mechanics and economy only work for the first 2-3 levels, after which the game turns into a tedious grind of levels that will be difficult to fail. Once automation is unlocked, the game will transform from a roguelike into an autobattler.\r\nIf you want a new Vampirelike, give it a try. Personally, I'd wait for DLC, fixes or hard modes.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has a pretty good solid foundation and standing as a roguelike that is pretty unique among the genre.\n\nall balls can be evolved and combined which result in a very various amount of ways to play, combine this with the amount of character that does a good job of changing up of how you play. its a game that is worth playing if you can go through these 2 cons\n\n1. the bosses, straight up some of the worst boss design that is simply ended up as a battle attrition. this is painfully obvious with half of the boss straight up being attrition at best. take an example the first boss being the skeleton that can only be damage if you aim at the weakspot, but its block by huge hand, combine with the bloated hp. it feels annoying to fight against it. if you want to know how long to fight against the boss, i was playing at fast+6 which at that point the stage could be finish around 6-7 minutes, but the boss can extend it to 9 to 10 minutes. its end up a bit repetitive due to how annoying this bosses are, attrition aren't difficult but just a waste of time. you could make the argument i should pick out balls that is most effective, but that practically defeats the purpose of roguelikes which is to play as how you wish. it shouldn't be that wide of difference in clear time. \nthe final boss is even more outrageous due to how bloated and how much it spammed the fireballs, my issues is not that they're difficult, but they are annoying due to them being counted as an obstacle and practically block my shot which led to a fight that more 6 minutes which is overstayed its welcome. \n\n2. the meta progression. this game is heavily dependant on your metaprogression, which is painfully true cause a lot of the building are practically needed to play within higher difficulty. This game ended up a grinding simulator first to make the most efficient method of farming resources, especially since how exploitable the overall resource building and such.\n\nwith these 2 cons, they are practically giant annoyance for me to continue to new game+, because it would end up being way more repetitive rather than engaging. it would just end up being the same from the beginning except you are beefed up but the enemies are also beefed up. \n\nif you dont mind these cons, then you should buy it. if the cons annoys you, then buy it on discount.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Against my better judgement I am gonna write a honest review.\n\nThis game is glorious in terms of art style, gameplay idea, and general execution...\nBut it also has pretty big flaws which disallow me from giving it a positive review. Here are my reasons why:\n\n- Art and opening cinematic suggest a grimdark story of woe and struggle, a battle to venture deep into the Ball Pit and... that's really it. There is no actual story to follow. The grimdark setting is only there for style reasons, but does not support the gameplay. There is no real connection or deeper meaning within each layer. Here we fight skeletons, here yeti, here lizards. And that's really it. The designs have no reason behind them. No connection. They feel a bit... out of place if I may say.\n\n- The Content inside feels... lacking. The gameplay is great, addicting, makes ya wanna go for one more run, but ya go deep enough and kinda that feeling starts to be overwhelmed by feeling of: Why? Why play this? Each new unlock or special Ball combination does not really have that OOMF to it, which is the driving force to make ya wanna go play more. There is no story to unlock. The buildings you unlock until near the end of game each feels... barely helpful. I beat the game without upgrading nearly any of em. I did not even place every single one.\n\n- Each new floor feels... extremely the same. I do not wanna get too much into spoiler territory, but recurring theme is of a small pool of \"something\" may it be frozen water to slip on, or lava that burns, or quicksand that slowls you down. But that is the only environmental hazard you usually have to worry about besides the enemies. Making the Experience... Stale. Repeating. With no real \"new thing to learn\".\n\n-End game content Sucks. Final Floor is just... underwhelming. Spoilers ahead: [spoiler]After going through all the floors and finally reaching final one you kinda expect some real test of skill and knowledge you gained and- oh... the puddle is annoying now. And enemies are super tanky. They use only basic projectile... That's it. And to beat the game ya gotta do this floor 8 or 4 times with different Heroes. The game genuinely gives up at this point I believe cause they even hand you a new hero that literally plays the game for you.[/spoiler]\n\nI pushed through and finished the game and just felt underwhelmed and like this game has potential... but currently it feels like it tries too hard to be taken seriously while it's just a mind switch off kind of game. And it is really upsetting cause I do wanna give it a positive review!... It just lacks a lot to get it right now in my honest feeling. Sorry.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun for the first 5hrs, then it's just repeated grinding of the same levels with more characters. The ball balance is way off, some evolutions are downgrades (e.g. Sun->Blackhole), and the item/ball RNG makes it tedious to fill out the encyclopedia (4 runs in a row with no Charm balls).\r\n\r\nCool idea, lazy execution of levels and ball/item evolutions.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its okay idk.. not that exciting after a couple of run",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Changing my review, this game has no ending. Absolute nonsense.\n\nMeh... I mean it's *okay* but not something that keeps you going. The monotonous way of maintaining your town is tedious. As the gameplay. Expect to get a little bored, or play one round, quit, play one round the next day, continue...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is a solid 7.5/10.\n\nThe early hours are great, but the mid to end game is far too easy. You'd expect to need distinct strategies or builds for different levels, but you end up so overpowered that no choices matter. Playing each level with each character ends up being a slog more than it ends up being fun. It's not a bad game by any measure, but there are so many A+ games to play that it's hard to recommend spending time here.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, that was disappointing. \r\n\r\nI was tired of the basic mechanics within a couple hours, but kept at it because I assumed there was more to the game beyond the surface (no pun intended). But there wasn't. Within your first 15 minute run, you've seen everything there is to see about the game. \r\n\r\nThis is not a difficult game, there's no challenge to it no matter how far in you get. I made it all the way to the end without upgrading most of the buildings (which themselves are largely cosmetic). And though the opening narration -- and aesthetic similarities to Loop Hero -- might lead you to believe there's some grand narrative or mystery to be revealed, nope. There's no \"there\" there. Even the New Game+-es are just the same game on and on into eternity... No variation, no depth (pun not intended), no conclusion, no meaning.\r\n\r\nIf you don't absolutely love the idea of playing this forever after your first 15 minute run, return it. There's nothing more to the game than those 15 minutes have to offer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Beating final normal run boss with new characters does not reward additional gears, thus impossible to proceed to the more difficult modes!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Okay game but the major thing I dislike is the characters you unlock. \r\nAt most 4 of them are fun. The rest are \"meh\" to suck.\r\n\r\nWhoever thought the coagulator, radical, and tactician is fun needs to be fired.\r\n\r\nNot much depth though, by level 4 you've pretty much seen all there is to offer besides a few late game balls that arent that interesting. At the moment just completeing the chievos and calling it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Actually pretty fun for the first 5-10 hours, but then the cracks start to show. The game ends up becoming pretty tedious and only a few characters really mix up the gameplay in any meaningful way.\r\n\r\nThe grind for meta progression feels pretty bad at this point. I was about ready to call it quits until I unlocked the character that plays the game for me, which is the only reason I finished the game at all. Just pair this autoplay character with all of the others and go do other fun things while the game plays itself in the background.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun for a bit, but the depth simply isn't there. Once the core synergies are unlocked, the game stops being interesting. The new biomes do not change the gameplay in a meaningful way and economy carries your way to victory more than actual skill. Some characters are more interesting than others but at its core what you do in the first 20 minutes of the game is exactly what you'll be doing at the end.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "man that is really a shame, it crashes too often.\r\nI have quite many hours in and am quite far, but after some time the game crashes for me quite randomly. I don't get any feedback why it just closes. \r\nWhen I am only in the village, no problem, but mid run is a dealbreaker. Aslong as this doesn't get fixed I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay itself is great and a very fun rogue-like brick breaker. Lots of fun characters and ball combos to explore with. \n\nWhat is not fun is the base building and management. It feels tedious and is always the reason I close the game, even if I was previously excited to try out a new unlock. It doesn't feel fleshed out enough to compare to actual base builder games and is unfortunately content is locked behind it. The game would be better without it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This one ain’t it. I’ve given it 3+ hrs to get good and to be honest, the more I play the worse this game plays and feels. Upgrades are just not reliable for any build, the pseudo stat system which encourages certain weapons also doesn’t really play out when you can barely get anything you want. Then there is the character specific traits that further force on you a play-style you might never get to play. Like piercing damage, but nothing to compliment it comes your way. Fire, but no oil. Ice, but not icicle. A character that picks random upgrades, so all the worst choices. Or that houses for character can’t be demolished for space after they’re built because that removes the character. Just a lot of weird choices that create an unfun experience in the end.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uhh in addition to being a shmup it is also a farming simulator. I do appreciate a little bit of side game but if i wanted to play harvest moon i would just go do that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The main gameplay is alright, but the base building is really boring to me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm changing my review to negative after playing this game a lot more. The reason is simple - this game falls apart - BADLY as you progress in it. The progression slows to a standstill and there are artificially 'impossible' challenges you won't be able to do unless you spend a lot of time backleveling all of your toons and upgrading your city down to the last detail. \n\nHow much? We're talking hours and hours of grinding once you react the artificial soft-cap in the game. Believe me, you WILL reach it and then you'll probably stop playing the game.\n\nSure, BallxPit is a lot of fun early on, but by mid to late game you might start to hate this game. I think most of the reviewers have less than 20 hours of play and as such, can't render judgement on the full game because they simply haven't reached the points where the game becomes a horrendously annoying chore.\n\nTo give you an idea of how piss-poor the grind gets - 12 times over completing level 7 and still 3 gears away from level 8 unlock. That's only part of the grind (and artificial soft caps) that stand in your way. This game turns to trash later. Mark my words.\n\nI like Monsters are Coming and Soulstone Survivor much more than this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fun game when you try it for the first time. Gameplay loop is frustrating, lots of bad characters with bad perks, too much rng and useless power ups/balls. and the \"city building\" system is not fleshed out enough, it sucks :/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A fantastic core game completely ruined by it's progression systems. Never have I seen a game with such an atmospheric, intense, well balanced and engaging first impression, which then proceeds to undermine itself with permanent global stat boosts, a waaaay too large character roster with individually tracked exp and level clears, and upgrades that just trivialises the game entirely.\n\nIt (d)evolves from an incredibly cool and tight roguelite, to a really tedious idle game, and at the end I just felt like I was crossing out items on a spreadsheet, with little to no challenge to be found anywhere. I'd love for an update to fix my issues, but I don't think it would have any hope of meeting it's first impression's expectations without a complete rework from the ground up.\n\nCan't recommend this game, just play the demo and pretend that's all there is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In short: It's fine.\n\nUnfortunately there are so many features to this game that make you go \"Ok, why tho?\", while the gameplay itself is severely lacking. While playing I kept telling myself \"there will be more unlocks, that will keep it fresh\", but I'm afraid the few unlocks there are, are not enough to keep you engaged and not make runs feel stale. I kept telling myself \"Hey, you haven't unlocked all characters yet, and you still haven't seen all the Evolutions\", well now I have and I find myself more disappointed than ever. The amount of possible combinations and evolutions is so limited, you have seen most if not all of it after just a couple of hours. Instead of really leaning into the Evolution mechanic, allowing you to create absurd Ball combinations, they were like \"That sounds like way too much work, let's just add another vampire thing and call it a day\", so maybe think about possible evolutions and what they might do, it's actually more fun than the game itself...\n\nI guess it's my own fault for expecting this game to have any surprises in store for me, but it really didn't. The levels all feel exactly the same and the enemies don't even register as being different from one another.\nIf you are looking to kill some time, there are so much more fun and engaging games, but I guess this one is fine too.\n\nFor me it's BALL X MID and a huge contributing factor to my growing rouguelite-fatique.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i dunno man, i played through and got every achievement expecting that when i finally got to new game+ i'd feel like the game would be hard enough to make my decisions actually matter, but instead even there your run just lives or dies based on the amount of grinding you've done with characters and how much you've upgraded your buildings. it's fun for a little while, but by the time the credits roll, you realize the greatest trick the game has played on you is making you think that it wasn't done showing you neat stuff. in reality you've just been watching balls bounce, and the most fun you can have is to see just how much you can break the system. maybe that's enough for others, but i was left wanting",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game's concept is interesting, but I think it quickly becomes boring. Dodging projectiles in this game is trivial, In addition, the bosses are practically the same. The only difficulty the game has is choosing the right upgrades, and that's it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At 30 hours I had fully completed every building and was investing into the permanent stat upgrade buildings and no longer had anything left to achieve every run is a win without even thinking because I was winning the game without all the extra stats and pre-leveled balls. Basically I think it was fun to get to the point where the game stopped challenging me in any way but I can't imagine ever playing again now because I'm there and I feel like I got there too fast. I let the game run overnight for a couple nights for resource farming is the only reason I put more hours then what it took to reach the end. Maybe like an endless mode where you try to highscore could be a reason to play again or something but idk it seems over-hyped to me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I like brick breaking games and roguelites as much as the next guy, but this is just an inflated meta-progression time sink. \nThe novelty of trying to do thoughtful builds wear off quickly, and the gameplay loop ends up stale and uninteresting. It lacks any form of meaningful decision-making, and every subsequent run ends up feeling less satisfying than the one before.\n\nIf you want something more engaging, try the pachinko roguelite Peglin!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "One of those games I'd like to give a 'meh' review. It's not bad and it's not good either. There are plenty of unnecessary mechanics such as random in level progression and simcity between runs. The last one is dumb, wastes a lot of time on useless animations. Why can't you just have normal progression system? The music choice is rather questionable as well, it's irritating AF",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Extremely easy game even in new game+.\n\nEntertaining for about 10 hours or so. Rest of your hours will be afk or finding a new game.\n\nWait for sale at least, perhaps by then there will be more then 8 levels. If not its not bad for like $5.00.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The concept of fusing and evolving balls is very fun, but there's a very low amount of variety in the beginning of the game, and unlocks come very slow. I found myself doing the same levels with the same characters, with little making each run distinct.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Radical. It was implemented so we could sit there yelling at our computer while this braindead piece of shit jiggles in the corner and face tanks bosses while shooting at nothing. Nope.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good concept, novelty wears off once you cant win without leveling up the town (fourth zone-ish)\n\nunfortunately it caters to the casual player and pads game time with artificial grind\n\nI still like it enough, I'll probably play it, but it feels less about choosing the right things (the game also lacks build variety, a bit simplistic), and more about power scaling (which takes grinding)\n\nroguelikes were already a bit casual in that it had carry-over progression, but adding a grindy sim on top of it (which is cool at first, but you then realize its the main part of the game...) just pads the content to make it feel more worth the value they sold it at\n\nI'm never a fan of games that allow anyone to feel they got a participation trophy if they just play long enough\n\nedit: games a cakewalk after getting upgrades, post map 4 everything has been relatively easy again",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I'm old enough to have experienced few Breakout/Arcanoid clones over the years so I took an interest in this game. \n\nAt first the concept of leveling up and combining balls is cool, but it quickly wears off since the effects lose meaning and the only thing that matters is getting a high DPS build. Skill matters to some extent since bouncing balls rapidly between different targets is more efficient than hitting once and going back to the bottom, but since the game has characters with stats/effects that make aiming almost pointless, you stop thinking about tactics too. \nBetween actual runs, there's a city building mode for unlocking characters and making runs easier by improving stats. At first its kind of fun but eventually you run out of things to build and have nothing but money to infinitely boost your stats. \n\nOverall, the first 1-2 hours are the most entertaining, after that the game turns more and more into  pure grind which is the opposite of practically all roguelike games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring. Didnt get a point, thought love other rogue-like like Megabonk, Balatro and etc.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved everything about this game until it crashed one day and erased my save file. Steam backup all showing the same day with no ability to restore. I'd love to recommend this, but recommending this and having someone lose days of progress isn't something I would wish on anyone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know. I don't get it. Maybe it's because its a casual kind of game? For me, it just wasn't fun. It's most likely a preference thing. I feel like it lacks something, but I can't figure it out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game and idea but then they throw you with such op powers like 2 characters at once with 2 fully level'd up balls it gets to the point where the only hard part is the last map :/",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 weeks of play gone. Log in, and the only option is a new game. No way of contacting steam or the game maker to try and restore it or any reason why this has happened.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a decent game for 5 Euros, for the current price its not worth it. Wait for a 50% sale",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A vampire Survivors + cookie clicker like, but not even as good as either in those respects. The breakout style gameplay adds some skill, and including that aspect in the town growth is novel, but it is all diluted by the in game progression system that makes skill progression mostly ignorable regardless of how you play it. I'd much rather have a pure breakout roguelike.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tl;Dr: Not enough \"rogue\", too much \"lite\".\n\nFirst of all, yes, i completed the game. Haven't touched the NG+\nGame simply does not feel rewarding with how the balance is.\nFirst few lvls are great. You kill stuff, you discover first fusions to kill stuff better. Stuff's awesome.\nThen they introduce stat buildings (the form of meta progression for this game), aaaand that's where it goes downhill. Basically, you can't clear harder lvls unless you specifically focus on upgrading your stats. I hit the wall at ~desert where not even the most broken atm combo (nuke+egg sac) was able to clear a lvl for simply not having enough damage.\nI upgrade main damage stats to +5, and oh wow, now even the most random crap i toss in clears the lvl with ease.\n\nCloser to the end they introduce the stat buildings that can be upgraded indefinetly. So leaderbords now have no purpose because they are going to be filled by (not even cheaters) people who just have the highest stat buildings. NG+ is meaningless in the same way, as i highly doubt that to beat it you need the good knowledge of the game and decision making skills, and not a pumped str stat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the weaker survivors-likes/idle-games I've played, I think. Aesthetically it's pleasing enough, but it does feel very heavily geared to just being a game where all the numbers gradually go up over time, both in individual runs and in the meta-progression, and a player honestly doesn't contribute very much to that via their input - it's mostly just an automatic process. I don't feel like it offered me many interesting decisions to make. It ends up being a pretty empty experience I think, and one that I don't really feel was worth my time. \n\nEven as a numbers-go-up game, I think it has a lot of dead air in it. Ideally in one of those you're always  crunching numbers and trying to optimise everything and finding bottlenecks etc. to make the numbers go higher faster, but this game ends up being a lot more segmented such that there are big gaps between moments where you get to do anything, and also much more on rails to the extent that you don't have a lot of leeway to experiment or customise your experience.\n\nI don't think it's a terrible game, but I do think I've played many much more compelling versions of what this game is trying to offer me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After playing this game for 20 hours an update created a bug that hard locked my save, making me unable to continue playing the game without totally resetting. so yeah kinda lame.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Direct collapse after today (Nov/06/2025)'s update.\nCongratulations to developers of Kenny Sun\nYou've received my first \"Not Recommend\" for my 15 years of Steam playing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So hear me out, I am not saying the game is bad. I am saying it is just not very Steam Deck friendly, and there are a few reasons why. The whole system where you shoot the balls against the wall at enemies, wherever they may be, just does not feel great with a joystick. I cannot really put my finger on why, but it never feels natural, and it leads to situations where you end up frustrated because you are not always sure how to deal with something. I am trying to keep this spoiler free, even though most of this is clear from screenshots, but the overall feel with a controller is just off.\n\nAnother thing that really does not feel good is the lack of information you can get with a controller. There is no hovering over anything to see what certain stats do or how some of the systems work. The game kind of assumes you already know these things, and with a controller you are locked into what you can and cannot access. In bullet hell style games you are usually confined to an area, which is totally understandable, but in this game the wall limitations and the way the rooms open up just do not feel great on the Steam Deck. You can only move so far before you get attacked, and it never really explains why you cannot go further. Again, it just feels uncomfortable with the Deck controls.\n\nThe last gripe I have is the forced prolonging of character unlocks through the harvest and build system. I do not mind progression or having to earn characters and resources, but it annoyed me that I had to jump into another mini game inside the game to get those resources, while also keeping track of buildings that affect things. None of that is easy to manage with a controller. I understand the design choice, but it just is not laid out in a way that feels good on the Steam Deck. Trying to play that Tetris style layout with the buildings, only to realize I needed one more resource and had to go in for a two second run, just made me ask why I was doing all of this in the first place.\n\nI do not think it is a terrible game. I just think it is not something I want to play on a console or the Steam Deck. With a mouse and keyboard it makes a lot more sense because you can actually access the information quickly without needing to memorize an entire encyclopedia every time you want to make progress.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The core gameplay could be really fun, but the resource gathering and town building kill the momentum. This would shine as a pure arcade game with fast, challenging levels. I didn’t enjoy the extra “busywork” mechanics.\n\nOverall: 4/10 “Mostly Disappointing”",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is too easy with a lot of superficial elements that don't actually matter.\n\nBuild diversity is basically non-existent, just take balls mindlessly and merge, passives are almost all benign at best, detrimental on average. \n\nNot sure what the hype is about.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is a fantastic game. I would generally recommend it. It feels quite close to deserving the \"overwhelming positive\" status on Steam. \r\n\r\nThere are so many great elements of this game, the Tetris style base building is so much fun. The level design is great. The music and vibe is great. The main ending [spoiler] was beautiful, mesmerising.[/spoiler].\r\n\r\nSome things to possibly improve:\r\n\r\n- The NG+ experience could easily be improved. Add a new expensive NG+ building that allows higher gamespeeds, 4x, 5x, 6x speed. (Currently 1x, 2x and 3x). Going through the NG+ at a fixed gamespeed feels very sluggish to go through again. There should to be a way to speed through it as the power creep slows down drastically.\r\n\r\n- Putting a time delay on gold mines means you can't just do the \"mine a gold mine, then enter a level, die as fast as possible, then repeat gold mines\" as the fastest way to get gold. It should be a minimum of 5 minutes between gold mines UNLESS you can pay for an additional run, like in the late game, otherwise goldmine spamming, dying, then returning to gold mine completely breaks resource gathering as soon as you can get your first gold mine.\r\n\r\n- The discoverability is okay, some aspects could improve, such as what exactly is classes as \"AOE\" when creating a build for the Makeshift Sisyphus. Perhaps a small indicator within the Encyclopedia that clearly tells you if something is AOE or not. \r\nFor passive power, the thresholds aren't clear, and once you get to a certain level of \"passive power\" it appears to not improve anymore? I don't see the passive items getting more powerful, at least not clearly. So it would be nice if the encyclopedia could clearly show an equation like \" damage = intelligence * level(1.0,1.5.2.0)\" etc.\r\n\r\n- For the whole earlygame, I generally believe it would be more satifying to feel a sense of visual power progression by lowering the early game ball attack speed, fire rate and ball speed, but increasing the damage for a net equal amount of earlygame status. All subsequent attack speed increases after this would feel more visually clear, and ball speed could have higher scaling, so that lategame it's still similar.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played the game for about 20 hours and now the game keeps freezing/crashing mid-run. Literally unplayable. All drivers are up to date and I have a 4090...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont get the hype. its well put together but nothing feels fresh and it got repetitive pretty quickly.\n\nits absolutely not a bad game but i don't really recommend it to anyone,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's Mid. Great concept but poorly executed. Music is extremely repetitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Need to remember that most people are stupid, and the overwhelmingly positive reviews could be entertained by jingling keys. It's a fine game, for like ... 5 bucks? That's about how much replayability it has. The runs blend together to get the same combos, occasionally  swapping one out when you get a new level ( there are 6? 8? Not nearly enough for any variety.) The resource farm is tedious on purpose, and is not really worth the grind, even if some of it is useful. Honestly a neutral review but the overhyping of a painfully mid game that's overpriced made this an easy thumbs down.  The quality levels people are willing to fawn over are pretty concerning to me. 4/10 overpriced and lacking variety with content that can be finished in less then 10 hours.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It’s fun and engaging for the first couple hours, but then idle game elements are getting introduced and the grind becomes really tedious. Unlocked items, characters or the different ball fusions/evolutions don’t really change the gameplay much. 60 unique balls my a$$. In the end it just comes down to stats you slowly grind out by building your base and leveling up the characters. Bosses are basically DPS checks with little skill involved.\n\nI ended up using Cheat Engine after a while to speed up progression, since I wanted to at least see all the stages once, but I still dropped it early. It's just meh.\n\nThis sitting at 6k+ \"Overwhelmingly Positive\" reviews is fucking wild, ngl.\n\nCompared to Megabonk, Vampire Survivors, Balatro or CloverPit this is easily the weakest of the bunch, IMO.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ehhh, I wish I could give a mixed thumbs up for this one. There's certainly a lot of potential, but the \"synergies\" feel so flat and random. I unlocked almost all the content available and I just.. don't want to play anymore.\r\n\r\nIt's VERY repetitive. The choices you make during upgrade selection honestly don't matter, I just randomly click whatever new ball is available and I win 90% of the time no matter the character I choose. The \"harvest\" mechanic is kinda cool but just feels like a gimmick in the overall scheme of the game.\r\n\r\nI would either skip or just play the demo, which is pretty much the entire game anyway.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Trashy difficulty scaling. Wasting player's time on runs that can't succeed no matter what. My time is more valuable than this dev's, so I'm going to actively advertise against this game everywhere I can until this is fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Half the characters struggle past the early game.\nNo, the thinker will not \"show you new combinaisons you havent thought about yet\", the \"X evolutions not discovered\" of the encyclopedia will.\nThe radical (and its atrocious AI) only exist to justify the pointless \"new game\" grinding and completion marks; that are only here to keep up with the hp scaling of enemies.\n\nSome balls could have had cool evolutions, instead they just waste a slot in your rerolls. \nGetting through the 3 mini boss equals a 90% chance of winning against the boss, the last 10% being a build check. \n\nHitboxes are broken when using two characters.\nHad bugs that stopped the forward motion of the map making loots nearly inaccessible.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yet another grindy rng-based roguelite revolving around a single braindead mechanic. Have players had enough of these games yet? Apparently not judging by these review scores. The indie space is just as bereft of creativity as the AAA space. More slop for the slop bucket.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad design, but fundamentally inadequately challenging.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's fun but the the constant rewards screens are super distracting. I wish the rewards page was contained in the same space as the game area, which only takes about 1/3 of the screen. Constant switching where you're looking for UI versus the game play area is fatiguing and broke up the momentum of the game play.\n\nThe art is ok, but would be more interesting if the units weren't boxes. I think knocking down a skeleton army would be more fun than boxes.\n\nWhen you get a new weapon, all the pluses and minuses are information overload. It'd be fine once you get a feel for things, but it's overkill at the start.\n\nIt's hard to tell why you're doing badly as the game progresses.\n\nThe farming part felt like busy-work. Not obvious why you're doing it and seems silly to have the worker bounce around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Woah. A roguelike twist on a freaking classic with farming elements and a steady stream of boring unlocks?! Sign me up!!!\n\nProbably the most bland game I've ever played. A friend of mine who likes roguelikes gave me a passing recommendation, so I read up on the game. I saw the glut of positive reception and I thought that I was being pranked in some way. The idea of a roguelike breakout game is beyond parody, and it feels like it while playing, too. The graphics evoke some kind of \"so retro\" nostalgia bait that fills me with absolutely nothing. The town and farm feel tacked on and the absolutely bottom of the barrel of roguelike gameplay. This building give one stat, and you can upgrade it! Wow! The menus for the town are unintuitive and the entire idea bores me. As far as the music goes, I didn't really care for it and after an hour turned it off.\n\nA lot of reviews of this game describe the game as some sort of equivalent of crack, which is very funny to me because crack is exciting. A more fitting drug to reference would be those gallon sized whippet canisters that turn people catatonic for days at a time. It takes elements from breakout, shmups, and the worst game of all time Vampire Survivors, and cranks down everything. Difficulty, technique, speed overall, you name it. This is less of a game and more of a vehicle for someone like Northernlion to clip farm impressing his chat with big words. I tried to boot up the game for one last session, beat a level and just closed it.\n\nThe game doesn't really force you to make any hard decisions. It doesn't even really require you to be conscious. It's proof that indie is devolving in some sad way. Spritiually a freemium Google Play Store game that shows you 15 ads an hour. I wouldn't care this much if it was free or something, but this game is 15 dollars. Devolver sells many more challenging and mentally stimulating games at the same price or cheaper. Here's a hint: When a game can be described as a \"steam deck game,\" you probably should just turn away.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have this free from a Golden Devolver Key\n\nI would NOT recommend this game. There's a difference between a well-made game and an enjoyable game. Sure I'll have friends tell me this is a well-made game, but I don't enjoy it. The only reason I come back to it is because it's a time filler, almost like doomscrolling. I will be deleting this from my library and not returning to it because of how addictive it is. I seem to play this game and then barely remember what I did in it, it's that sort of Doomscrolling addictive pattern. I have this situation in Roguelikes in general, I get to the end of a run and then barely remember it in the future because those games are designed to just replay and replay but not remember and remember.\n\nYes, this takes inspiration from those ball bouncing mobile games you'd see ads for and Vampire Survivors with the upgrade mechanics and Loop Hero with the outside of battle city mechanic. I never played those ball bouncing games, however I did play Vampire Survivors and Loop Hero and stopped playing them since they were a similar situation with addiction and forgetfullness.\n\nDon't play this, if you want a time filler that makes use of your time, go draw, do something creative, take a walk, go outside.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The core gameplay is a fun spin on the vampire survivor loop, but holy shit the city management and building system is absolute garbage. When you build a building, you don't actually get the building until you bounce your workers off it 4-10 times depending on the building. So that's just bonuses you will not get if you don't finish them, and if you mess up your shot, you don't get to do it again until after you do another run. Really annoying system that kind of ruins the game for me. \n\nI just don't care that much about city building in my rogue like action game, but the game forces you to engage with it, and it's super frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pure RNG sim. Ball / artifact decisions literally don't even matter.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its repetitive after an hour, the music is dull and matches the game play perfectly. \nThe sound effects are terrible and lazy. \nFor the first hour its great then you realise not only can you not refund it but now , you have a game thats not very good sitting in your library. \nIt starts off a £12.99 game but ends up a solid £2.99. \n3/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Please add a x1000 option to the market. Game is unplayable. Not sitting there like a cvck clicking sell x100 wood 200 times",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Yeah, it's great till you get about 20ish hours in like me now it's bugged doing anything in town and I mean anything! So try harder for the price, naw half-baked maybe if it was 10 or under! Praise on the Sim-city meets breakout, but needs work!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of those many games where you are going to have to rely on luck for the game to give you the cards and the dopamine that you want from it.\nIf you enjoy these types of games go ahead, I don't and I'm tired of seeing them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Decent roguelike, but I'm hesitant to recommend it to anyone.\nI didn't find the gameplay or gameloop satisfying. \nThe upgrade system is also more of a slow-burn, I feel you don't really feel it paying off until you near the end game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What puts me off the most in this game is how they want you to be OP but in the most boring ways imaginable, 5000 years of resource grinding to max out the meta progression and instantly 1 shot everything? oh ofc! mixing characters who'd have great synergy? NOPE! BLOCKED!!! seriously you have balls like the black hole that can 1 shot the entire stage with a single merge and yet the Flagellant ABSOLUTELY should UNDER NO CIRCUMSTANCES! play with the repentant or shieldbearer or physicist because why would it be fun? y'know what I mean? why did I expect the fad VS wannabe game to actually be fun???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BAD x PISS\nwalk forward sim, followed by city build sim for metaprogression that disrespects your time. slop game.\ngood music tho.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Another game with interesting graphics, but absolutely thoughtless game design - just pick whatever you want. Dull.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\n☐  You forget what reality is\n☐ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n⚔️ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☐ Good\n☐ It's just gameplay\n☐ Mehh\n⚔️ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐Eargasm\n☐  Very good\n☐ Good\n⚔️ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n⚔️ Kids\n⚔️  Teens\n☐  Adults\n☐ Grandma \n\n---{ PC Requirements }---\n⚔️ Check if you can run paint\n☐ Potato\n☐ Decent\n☐ Fast\n☐  Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n⚔️ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐  Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n⚔️ You'll need a second life for grinding\n\n---{ Story }---\n⚔️ No Story\n☐ Some lore\n☐Average\n☐ Good\n☐  Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n⚔️ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☐  To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☐  If it's on sale\n⚔️ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n⚔️ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n⚔️ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☐ 9\n☐ 10\n\nrefunded the game because it just doesnt keep my attention.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}