{
  "positive": [
    {
      "review": "Co-Op Hades that replaces story for more charachters and diverging gameplay. Well worth the purchase if you like that game style.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Good game. I have about 925 hours at the time of writing this review. Slow paced combat. Three chapters, all 18 minutes long. A boss fight at the end of each chapter. you get stronger with hero talents and magical objects that you collect along the way. 4 man CO-OP is available. \nThere's a lot of thought and polish to the gameplay and combat mechanics. All heroes are well balanced. (not all are equal, of course. some are stronger than others)\n\nThe biggest con for me is how stale the game can feel after you've finished the highest difficulty. The developers are extremely slow to bring changes and new patches to the game. Quite a lot of very basic features are missing like color blindness accessibility. The lobby is very buggy. The netcode is not the best. Random disconnects and straight up game crashes can happen from time to time.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "This is one of the more challenging rouge likes out there. Even at the easiest difficulty, it took me 5-6 tries before I beat the game on the first character. If you're someone who thrives on stagger mechanics and feel the thrill when playing games where every hit feels like life and death then this game will be for you. If you're looking for something more casual and stress-free to play, then there are other games out there.\r\n\r\nThis game is well-polished and has a great aesthetic. Every character feels unique and their abilities play to their lore. There are some characters like Pied Piper who feel terrible to play in the early levels but every character is capable of becoming OP if you build them right and min/max. Every run has a time limit on how long you can spend running around the map and acquiring loot and strength which will make or break the game. As you increase in difficulty, the min/maxing becomes more important and you'll feel more pigeon-held into playing certain builds in order to win the round. \r\n\r\nOverall, I enjoyed the time that I spent playing Ravenswatch and appreciate the love that was put into this game. The devs seem to care about the community and occasionally release free DLC to improve the game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Aside from occasional network issue, the game is polished and fun if you are playing solo or multiplayer!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A lot of really cool ideas in the game, the collection of well known characters from all around put into one setting was the main draw for me. For the most part, they have interesting mechanics and playstyles. The voice acting, soundtrack, artwork are all great. I just find the game to be a bit dull to play. All from the perspective of a solo player, but eh. Recommend for the amount of love that's clearly been put into the game.\n\nWorth a try, it might jive better with other action roguelike enjoyers.\n[spoiler] Wukong is my easily my favorite, really sick to see him in the game [/spoiler]",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Great game. I would love to see it being developed further. Especially adding some variety to the maps - maybe final bosses variations and some shape changes? It gets a bit repetitive in this departments, but quality of character design compensate it for now. \n\nI love how runs don't make your chars stronger. It's unlocking you some build options, but not always stroner ones really. Just nicely balanced for different playstyles and RNG. But you feel, that you are actually getting stronger, cause you gain knowledge about map, enemies and how your character really works. And the difference is HUGE! With skilled party of 3 people we are melting the bosses now, where we struggled to survive on the beggining. \n\nExtremly fun and worth the money! I wish skins would be more than just recolors (in most DLCs), cause I would definitely buy some to leave devs more money.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is amazing and great fun to play with friends. The amount of work and detailing put into the game plus a free DLC is just mindblowing. The game is quick and you love each build every time. It's unique and a must play. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A MOBA style alternative in terms of heros against a PVE environment. You have your standard four abilities that unlock and alter as you gain your talents with each level, then items that change those abilities further. \n\nI highly recommend. The heros are done with such panache and intelligence that it made me feel like I was playing Dawngate again, which is a compliment not to be thrown out lightly. My one critique is that the three worlds begin to feel very samey after a few dozen runs. It really would've benefited the game's endurance to have more of a variety on that end. \n\nFun on your own, but good luck doing the harder difficulties without doing multiplayer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Excellent graphics, character mechanics and challenge progression. This game has a lot of potential.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got 14 hours out of this game and it was fun, but I can't imagine trying to take a second character up to high difficulty. Each character takes literal hours of grinding to unlock their full kit. Builds are entirely centered around hero-specific skills; items also exist but they aren't transformative to your playstyle and don't combo the way skills do. This means that build diversity is super dependent on grinding up each individual character from scratch.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great and very addictive game! Fun to play over and over again while switching between characters. Big W",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, pretty straight forward roguelike; easy to learn, difficult to master, lots of player choice, lots of power-ups.\r\n\r\nI'm not good at writing reviews, but Ravenswatch is a good game, it's a good swatch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, love the graphics and music. The bosses are always the same, but they do vary their attack patterns so the game doesn't get boring. Love all the characters you can select and they did a great job of making each one feel completely different and unique in their gameplay. Super fun with friends and the difficulty settings make for great replays, 10/10!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you enjoy Hades? Does the thought of Hades... with friends... entice you?\nIf so, you'll have a good time with this game.\nBrothers Grimm's Fairy Tale fans will be delighted.\n\nPros:\nGreat difficulty options (XP reduction on top of increasing dmg/hp)\nPlenty of build options for all of the characters. My group has argued which 'build' is the best for each, only for it to be beaten by a random amalgam of talents and items that just work flawlessly together. But \"Peak\" exists.\nYou WILL find the character that you vibe with, and once they are mastered, you'll realize other character's potentials. (Beowolf is my champion of choice, but now I play any character so Random is fine)\nSolid 100+ hours of gameplay for $25 is worth it. I'm not at 100 hours (yet), but its only a matter of time.\n\nCons:\nThe map/regions get a little repetitive, but it just means you know your way around which optimize the runs.\nSome bosses make it nearly impossible to pick up a downed ally. Each boss has 8+ attack options, but picks 3 per encounter.\nCan be REALLY frustrating at time, but it is 100% the player's fault for standing in the big red circle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite a bit of fun, and if you have any sort of completionist tendencies it has great replay value.  I love the music/sound engineering, and this is a TON of fun to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of the few coop rouge-likes that more u play it the more fun it gets...usually w the rouge likes theres less and less new stuff and fun mechanics the farther u progress but not here...still have a few heros to max out and potentially beat the game with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ravenswatch is an amazing, very fun game. Maybe you could call it a hades-like, it's a roguelike game with a very fun loop. \r\n\r\nThe premise is amazing to me, the fact that you can have fairytales and arthurian mythology and others as a something you're able to play and interact with is just perfect. From the characters to the magical items, this game does not disappoint. Apart from the technical difficulties and the lack of a rejoin feature, my 204 hours at review time are very well spent and there will be many more.\r\n\r\nOne of my favorites to play with friends!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, with great replayablilty with friends or without friends (better play with friends:)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very original gameplay, also very challenging and fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What an awesome game to play with friends, you will laugh, you will suffer, but in the end you will enjoy a really well made co-op hack and slash with a lot of replayability.\n\nEnjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, great fun with friends. \nI wouldn't exactly play it on my own but with a couple of friends this is amazing.\n\nThe characters reveal a fun twist on old folk tales, the aesthetics are really nice and the combat feels really good and fairly balanced. \nWhen you die, you'll know that you messed up and it wasn't the game being 'unfair'.\n\nOnly con is that  if your host has any connection issues or disconnects, the entire session ends right there with no way to reconnect.\nIn general, if you disconnect for any reason, you can't get back into the ongoing round.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay muito gostosinha e uma dificuldade alta, mas personalizavel se vc for ruim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic Roguelike game. Loads of fun alone and with friends. The hero design is unlike anything i've seen, every single playable character is fun to play and has multiple fun ways to build them. The visuals really represent the fairy tale vibe wonderfully. The voice acting is solid, although i would like for there to be more lines and interactions between the heroes.\n\nIf you like Roguelikes and enjoy a challenge, give this one a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice enough to play 50+ hours in co-op where this game really shines playing with friends (good with 2 people, better with 3 or 4). Solo gameplay feels more suited for training, discovering and farming levels on the characters (with no time limit, 1x fewer cycle) than a true well balanced solo gameplay experience.\n\nHad a good time for my buck, yet a few things to improve for a more enjoyable replay loop :\n\n1st on the characters\n* Some characters are way easier and robust than others, so you end up having \"must have\" characters in the group for hard runs (ex: Melusine is busted on group healing/shield ; Beowulf gathers super solid crit chance conditions + block&shield skills for tank role). Would be nice if there were more characters with stable builds for tanking/healing that do not fall to rng of talent picks.\n* Some characters really lack valuable group assets : they bring either so little or solo buff/shield/heals or their trigger conditions induce horrible up time. You end up playing alongside each others instead of co-op with good synergies.\n* Balance between the random pick mechanic for talents and each character talents game design can make some character runs really unreliable and frustrating in harder difficulties either because there is a must have talent to make the character build work (that you might never get, even with many stars of fate) or because the overall number of viable talents is too low so you will never get seven or even 6 good/synergy talents and items.\nNote : when you crush down the numbers, some characters have less than 50% chance to get 7 good talents even if you use one star of fate EVERY talent pick (assuming you picked stars of fate during the run instead of buffs to be able to reroll that much...). Its worse than betting the fun of your run on a coin flip!\n\n2nd on the map\n* Boss diversity starts lacking after 50+ hours of playtime, would be nice to add more lvl options. The current loop is still a solid one, other branches to reach final boss would be a nice addition to the game.\n\n3rd random disconnects:\n* no matter the reason, if you get disconnected, game is over... was it after 5min on 1st level, or after 50min of playtime just before last boss ? Only difference will be the level of frustration it brings :p Please add some way to reconnect to the party...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best rougelikes I've played. The art style is unique and aesthetically pleasing. The whole fairy tales turning into nightmares vibe of the game just works. The characters are well thought out, and the little stories you can unlock for them are worth reading/listening to. The difficulty is up there, especially the further you progress, but that's mostly a me issue :D\r\nAll in all, really good game, worth the buy and the play too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Art-style and gameplay are extremely satisfying, great co-op game that allows you do your own thing during a run but requires teamwork to succeed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice hades-like gameplay\r\nLore has quite interesting view of known characters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An addictive blend of MOBA optimization puzzle with rogue-like elements, fun solo or with friends. Easy to pick up and put down. Tons of enjoyment and well worth the price sale or no.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a challenging but rewarding game. One of the more difficult ones I've tried in the past year. But makes it all the sweeter when you get that that first VICTORY.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with lots of depth in decision making and mastery of the game systems. There's an extremely satisfying \"flow of play\" difficulty curve in this game where navigating the map efficiently can turn a good run into an excellent one. \r\n\r\nThe timer based gameplay may not be for everyone, but it keeps the pacing of the game as fast as you can handle, and finding that balance between being careful and staying on the move is where the entire experience lives. The higher difficulty levels stress this balance even further, putting more and more pressure on your ability to stay ahead without making mistakes.\r\n\r\nThere's a great amount of variety in the core cast of heroes, genuinely there's something for everyone here. The stages, bosses, events, enemies, and just about everything else (barring some randomization of positions on the map and some RNG on availability) remain basically static run to run, so you'll really be looking to change up your hero to add some variety to gameplay. \r\n\r\nWhile there is some meta progression, it's minimal. Some characters do unlock what you could argue are their \"better\" abilities by way of completing runs with them, but there isn't anything intrinsic to the meta progression that makes the game \"easier\" like it sometimes does in roguelites. At best you could make the argument that your favorite hero gets their superior ultimate after a couple runs, but you get access to a full kit from the go\r\n\r\nThe co-op is brilliant, and I should caution any potential buyer that I've essentially *never* played this game by myself. I don't know if you would truly get the whole experience alone - even the idle banter between the heroes is reliant on there being another hero present. To me, all of the experiences worth having in this game have been moments between friends.\r\n\r\nIt's a solid game, extremely sharply made, but at the end of the day it's ground that's been tread before and truly I feel the co-op is the standout feature here. Absolutely buy it if you have someone to play with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Way more fun with friends. Still fun by yourself. If you like great roguelikes/roguelites, this is one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nomination for Steam's Labour of Love Award 2025\n\nInitially bought this game in search of a co-op Hades-like to play with friends. This game is more accurately a co-op PvE DoTA-like which isn't a bad thing by any means, might just require a bit of tempering of expectations for fans of the former. The devs generally seem responsive to feedback and have been keeping the game updated with new content and even made their first DLC heroes free and playable individually after community feedback. \n\nThere are a handful of annoyances related to tumours occasionally being bugged in multiplayer and no reconnect feature but this game is a blast to play and I'm a sucker for twisted fairytale settings. It's oh-so-satisfying to land a  sweet AOE on a big swarm and the game's scaling difficulty level is pretty well designed. Going from struggling on difficulty 1 to being able to breeze through it after learning and getting better at the game was a nice journey and learning experience and I'm looking forward to levelling up my personal skill even more for the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and easy to pick up and just runa couple rounds. Good stories. a cool take on classic fairy tale charecters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really one of the best Rouge-likes I ever played.\nPlaying with friends is a super fun experience. The gamplay is super claen and polished and honestly the best part of the game. All the caracters bring the own way of playing the game and super fun builds.\nThat the dash dosen't has i-frames may irritate some at first, but after you play the game for a few hours you realize what a nice gameplay decision it is.\nThe build variety is the only part of the game that isn't perfect, after about a 100 h or so you have seen most of them. Which is already pretty good and in there newest update video they said, they plan on an overhaul of magical objects. Thats really exciting!\nAfter glazing it this hard you may realize i realy like this game and think it's really fun.\nAnd i think everybody sould try it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremely entertaining game, amazing with friends\nThe updates have been very good, can't wait for some new characters !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 500 hours I am still not tired of trying new ways of building characters. Ofcourse more heroes would be great but the game is very decent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game to enjoy alone or with friends, gameplay feels inspired by MMOBA games and roguelikes like Hades.\nThe last few major updates introduced some much needed changes, new content and good balancing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a lot of replay value\r\nevery run and character feels unique\r\na nice game to enjoy solo or with friends\r\nhate the goddamb priest healers though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A bit of Diablo, a bit of Heroes of the Storm. A roguelite with action-RPG/Moba design. It's pretty fun. \n\nThe caveat here is that you pretty much have to play this with friends to have any degree of real fun with it. Sure, you can technically play it solo, but side boss health values make it very obvious very quickly that you're not supposed to be doing this alone. It's brutally difficult even on the base difficulty, nevermind the more advanced ones.\n\nIf you've got some friends into this sort of game, it's bound to be a blast to play. If you're looking for another Hades to play alone, you're in for a rough time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall great game. Worth the money. Cool characters with unique design each. A lot to grind for sweats, and difficulty choice for chill gameplay. \nEven better with friends! Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The coolest game with a very beautiful visual and style. I have high hopes for the game's long-term support by the developers. New content and new characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a unique rouge-like game i enjoy\ni recommend to anyone who do and don't find themselves playing these types\nalso the game still receiving updates; very appreciative of this\n\nsolo/multiplayer friendly, cross-platform friendly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good Roguelike with better difficulty. Very innovative in the system of how you can choose to power up your character. Also this game has some of the most unique characters in it out of any game i've played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I bought this game because a friend insisted. I played with him and had a blast, decide to play it solo, and i was surprised at how much fun it was. It has enough action, mixed with enough tactical decision on what camps to raid, what build to make, etc. The cast of characters, even though small, is varied enough that you don't feel the \"generic char with different skins\". The story is great, and the absolute winners are the atmosphere and the music. All in all is a very satisfying game that you can jump in and out, play casually solo or go full grind mode with a group of friends. The cross platform matchmaking works perfectly.\r\nAll in all, a gem that i feel gets passed over because it is not a weird indie turbografix engine pastiche nor a UE5 shiny generic slop. \r\nIt's a game with its own personality, its own style and a VERY satisfying game loop. And best of all, no pvp, so you won't find many sweaty tryharders.\r\nAll in all, a 9/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great coop game and the free dlc characters were great to play! Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great take on fairytales, love the character designs and the unique playstyle of each character.\r\nThe game actually challenges you but if you want to just have fun with friends its easy to do so as well.\r\n\r\nI love that every character has something different about them where you can even play them in different ways then how they are meant to play. Time and effort has been put into this game and it shows, can't wait for future updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game that has the developers hearts put into. Passtech games has put their everything into making this game truly their best game yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun with friends and the devs really listen to the community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to play with friends. Challenging in the right way, being able to select modifiers make the game a new experience. Love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gotta say its fun. yeah even if it takes little time to learn how to play it most effectively",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ravenswatch is an excellent coop, rogue action RPG. It excels above the rest as it offers an assortment of distinctive characters. Each plays differently from the others with multiple skills to construct varied builds. While they are familiar characters, they each have a unique presentation and creatively fit into the world.\n\nThe game features more of an open map, newly laid out each run, rather that a series of random rooms like in Hades or Sworn. The map has treasure, power ups, side quests and bosses scattered throughout with a time limit on what you can achieve before the world boss appears. This makes for a highly replayable game as you do not have enough time to hit everything.\n\nThe difficulty is quite challenging and can be a bit unpredictable as some runs go smoothly while others are toilsome. There are layers of difficulty to play through as well, which I’ve barely scratched the surface of and epilogue content which is yet foreign to me. \n\nThe graphics, style and performance are all top notch. The content and care added since early access is commendable and the developers continue to update. It is the definition of labor of love and my nominee for the 2025 award.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tired of 100+ hrs of grinding for endgame gear pieces?\r\nDon't have time to farm vast range of crafting materials?\r\nTeam up with 3 friends and have a fast paced ARPG experience with a lot of various traits, combos, builds and lore with twisted heroes of Reverie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "even though its a rouge-like its not always the same, good map and enemy generation. the multiplayer scaling is pretty severe so it makes playing with friends on the upper difficulties really challenging.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You can choose between 'chill' and 'frustrating' modes! Play alone for a chill experience, or with friends for a frustrating one! There is no balance in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can't believe that I haven't reviewed this absolute fucking gem of a game yet!\n\nEver wanted to play a long-form MOBA? How about a short-from RPG with roguelike stakes? Playable both solo and co-op? Do you like easy-to-learn-but-hard-to-master gameplay? Are you the kind of gamer who likes to see modern takes on classic heroes and settings, wherein you can get little lore tidbits during gameplay? Do you like to see Big Number Go Up? UGNA BUNGA?\n\nRavenswatch has you covered on all of this and so much more. I really appreciate the work of the developers, as well; their community engagement is quite stellar and they have made another masterpiece of indie gaming. Getchoo sum!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if you're looking for an action roguelike with Dota-like hero design.\n\nFew complaints:\n\n1. (medium) Many annoying networking issues and occasional freezes.\n2. (minor) Main menu UI is pretty clunky.\n3. (minor) No lifetime stats for heroes like most damage ever, etc.\n4. (medium) Strategic itemization is lacking. There's one obvious combo - Golden Egg + Leprechaun Coin. Many items at all rarities are next to useless or almost always inferior to other options.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, just needs more breadth of content and probably a little faster experience gain. It's really grindy to unlock all of the abilities given how the acts don't vary really between replays.\n\nRisk of Rain 2 stays engaging because you don't know what each stage is going to be until you're in it. You don't know which bosses you're going to fight in a given run. \n\nUnfortunately Ravenswatch is extremely predictable and once you figure out which things are or aren't worth doing, the game becomes pretty monotonous.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good but it has two very important and simple shortcomings: the ability to reconnect to a session if the game crashes or disconnects, and the ability to pause the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A challenging game with buttery smooth gameplay and a really cool art style/aesthetic. Each run takes about an hour, separated into three chapters (in a solo run you have the option of saving and quitting in between chapters), and each chapter puts you on an 18-minute timer during which you have to explore the map, clearing points of interest and getting as strong as you can before fighting the chapter boss to progress. \n\nThe time pressure adds a lot to the difficulty of the game, especially when you're just learning. There is a modifier you can activate to turn the timer off, at the cost of earning achievements and character outfits if you just want to practice. The solo balancing is also really good. Because of the enemy scaling, it can actually be easier than multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great coop game ! However to me, the fact that you need so much xp to level up characters, and that you need to level up the same character several times to unlock parts of different builds, makes the replayability not so great in my opinion.\n\nIn most roguelites, you have some kind of meta-currency, that allows you to unlock upgrades for whatever you want, but that is not the case in Ravenswatch. You only earn xp for the character that you take on a run, earning more the further you go. This means that you are rewarded for playing longer runs, but it also means that you will be forced to play the same basic builds with each character for quite a while. I wish that you could instead just allocate xp points to the desired character, so that you can try out other characters, then go back to the one you like to try out a new build.\n\nBut yeah, regardless, this is an easy thumbs up for me !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once you get the hang of each character, it's a lot of fun to explore what they're capable of! Would wait for 50% off since not all characters may be your style which may change how you feel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved Hades & Hades II, but this is Hades on steroids with much more good variation (rather than just RNG) and much more replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mention to my friend ravenswatch looks cool\nshe gifts me ravenswatch\nwe play together. Make it to darkness with Mel/Snow Queen duo\nGo glass cannon build with Snow Queen. Use every single raven feather\nMake it to final fight \nDie on the first phase\nWatch my poor friend 1v1 the final boss for 40 minutes and win\n10/10 game can't wait to play (and die) again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely a phenomenal game, it became one of my favorite games after I learned how to play it.\r\n10/10 will buy every dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty sick game, good premise, good lore... Unfortunately the player base is pretty small, hard to find full parties quite often.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE THIS GAME!!! it is such a good rougelike and the devs are amazing constantly bringing us new and good content often for free as well. highly suggest all to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first I was so confused on how to play this game. But as I put more hours into it and started getting a hang of it, i have not been able to drop it. The characters are unique and have various play styles and \"builds\" you can create on your runs! It is super fun to play both solo and in coop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "friend mentions a game called ravenwatch\r\nlooks cool- get it for both of us\r\ndarkness difficulty with snow queen/melusine duo\r\nhuge tank and heal build for mel\r\nmake it to the final boss fight\r\nfriend dies on the first phase\r\nout of ravenfeathers\r\npop my ultimate- healthbar barely moves a pixel\r\nit can bleed.  it can die.\r\nproceed to eat shit soloing for 40 minutes\r\nit finally keels over dead\r\ncry with relief\r\nrealize i never even went down once and my friend singlehandedly used every ravenfeather\r\nbest moral support i could ever ask for :)\r\n10/10 i'm addicted",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice table top rogue like game, works well with Controllers/Deck. Solo or Multi is doable and lots of different game runes each game due to the skills",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun roguelike and every run is different. I would love to see more character variety because theres just not enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For what the cost of the game was i'd say it was pretty alright. the gameplay was fun, Hardest Difficulty seems a tad bit meat spongy, and a Endless mode would have been nice. i think the preset modifiers should not disable achievements as they come with negatives on top of the positives.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great co-op game, whether you want some relaxing fun on the easier difficulties or locking in for the harder ones, with some surprising playstyle diversity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome PvE game! Unique characters and different builds to experiment to, definitely give it a try!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My sister and I like to play online co-op games together, and this one has been really fun. We did start out with two characters that were no good together--it's worth searching to make sure you aren't playing characters that don't complement each other. Once we switched it up, we made more progress. The fighting is fun, and we aren't bored with it yet!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great. High quality music and gameplay, and graphics are nice.\n\nIt is hard though, very hard. Also... it is timed. Time is a constant pressure. That part's not my cup of tea (I hate timed things ! >.<) but the game is so good that I keep going back.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun game! I love unlocking new stuff and coop is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, all the characters are really fun, and no two characters really feel the same. I love games that include fable characters even if one of them have been drastically changed for no apparent reason. Excellent multiplayer fun, my primary complaint is that it is only 3 stages long and the bosses are the same every time. There is some randomization in perks and talents and whatnot but I would prefer randomization in biomes, bosses, that sort of thing and more stages and bosses. Hopefully that is coming at some point. EDIT: There are more stages on harder difficulty so I was wrong about that",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good game kinda wish there where more characters and quests on the map but the game is pretty solid especially if you have friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very unique among the roguelites. Each character changes the game and the way you navigate. A really good and addictive experience specially because of the high difficulty that the more you know about the game the lower it seems. And multiplayer is also really good. I believe that with a little more content this game would be a masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very challenging rogue like. Though I wish it has \"Artifact\" modifiers like on risk of rain along with loops before fighting the final boss just so I can have a power fantasy run.\r\n\r\n8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great co-op roguelike. Wouldn't trust playing with the random search but its easy to find people on the discord.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably my #1 coop roguelike, may take some getting used to but when you do it is some of the most fun ive had. Love the artstyle, challenges, replayability, buildcrafting, and its got a good amount of lore, cant wait to see where they go from here",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun, especially with friends. Robot army go brrrrrrrrrrr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "PvE Battlerite without lag de-syncs!!!\r\nBattlerite and Risk of Rain got married, had a PvE baby.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "random indie suggested by my friends while looking for coops that ended up being good enough to beat nightmare on every character solo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ravenswatch has some great characters to play as and i cant wait to see more in the future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent Rogue-like game. The best co-op game in its genre.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its a fun game to play alone and with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved everything ! could not find any game similar to this (co-op). 200h deep in it .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with friends. Slight learning curve if you're new to this genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty enjoyable and a lot of replay ability value",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Unique take on the roguelike genre, where you're fighting against the clock on open-ended maps, like Elden Ring Nightreign (but a year before Nightreign :p). The replayability lies in mastering the well designed characters who are all an absolute treat to play, and in climbing the steep ladder of its 4 difficulty levels.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and unique experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some of the most in depth builds and variety I have found in roguelikes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, fun in multiplayer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice to play solo and with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely amazing game, enjoyed every bit of the journey",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a hidden gem which really shouldn't be hidden!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really great one of my favorite roguelike games!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Smooth gameplay and fun!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Just because there is no way to reconnect. Whenever I play with friends and 1 or more is getting a dc for whatever reason they can't reconnect and the run is basically ruined. Implement it pls..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun and offers interessting characters, however it is painly unpolished, the optimisation is lacking, server connection quality is subpar, and the hitboxes seem clumsy, it can both be great fund as well as being painfully frustrating for reasons that shouldnt be there",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is great, but I made unfortunate decision to try out Geppetto, and well it is insane to me how clunky, unfun and horrible this character is. I don't understand how it is possible to make character with summons that unfun and miserable to play, but congrats. Sadly he is the only one with summons, so this sucks (except for the Flute guy, but he has fake summons).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Super fun, but constant disconnects make it unplayable in 4 people co-op. Devs fail to fix it for more than a year. Otherwise great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "On paper, this should be a game I love: Great theme, level-based co-op game, progression, etc...\r\nIn practice, it just annoys me. Everything is based on how quickly you can kill anything, a lot of bosses have no reward if you don't kill them in time, EVERYTHING is timed.\r\nYes, there is a mode with no timer, but you're locked out of any sort of metaprogression if you enable it.\r\n\r\nThe combat is also pretty lackluster, from my experience, it's mostly waiting for cooldowns and dodging enemies. If you're playing any sort of melee character it's a death-sentence going in without an escape button on.\r\n\r\nSo in essence if you hate being rushed, dislike rewards being denied to you from bosses despite beating them and don't want to feel annoyed by everything, this is not the game for you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs more content, 3 stages and a big boss isnt fun for long. they couldve just made an endless mode that resets you but naw fam. 1 hr run at max",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really wanted to like the game from the moment I saw the Pied Piper leading his rats in the first announcement video. Unfortunately, I just couldn't get into it, mostly because I found the bosses to be no fun at all and the various character abilities never felt very interesting to use. \n\nUltimately, it's just a very subjective \"no\" from me, for whatever that's worth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just needs some work I think. Right now it's not fun. Got it on sale 50% off and still wasn't enjoying it enough to warrant keeping it. Nothing feels good. Killing things doesn't feel good. Getting crits makes no sound and no animation, just a bigger number, thus, not feeling good. That's really my biggest complaint is that it just doesn't feel good to go around and kill things.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I guess I just don't get it? I've tried solo and co-op runs and this game is so boring... Nothing is explained to you at all, took me digging through menus to find the \"tutorial\" and then I still had to play multiple games to figure out other stuff that wasn't explained because it just chucks you into the menu and into the game unceremoniously.\n\nI'm out here watching the randoms run to do things and teleport around just to understand that that's something I can even do. This is also because the game is clearly not meant to be played solo as well which isn't really as clear as it could be in game purely based on balance.\n\nAll but one of the characters I tried had kits that felt like they were stifling themselves instead of synergising with themselves, with the upgrades making them feel how they should rather than feeling like upgrades. Enemies are basically all just \"I will run at you now\" with the occasional \"I will shoot at you now\" thrown in which makes it VERY boring to fight them, as well as there not being much feedback on anything as well? Oh, you also can't mute people in multiplayer which you can imagine works great when joining randoms using a PS5 controller so you can hear their entire room in 220db!\n\nIt all just feels very empty and lifeless and boring. It's like it's doing it's best to tell me not to play it even if I wanted to, which is a shame because the game is nice to look at, the theme brought me in and I love me a good co-op game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought game Played for 3 hours, exited, next time when i logged in i lost all my progress, could not get refund from steam as time wasnt in frame, contact developer told me to go f myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game its pretty bad. at the start of the game the enemy feels like overwhelming and the spells and abilities are underwhelming. Also you are allowed to get buffed at  the start of the game but if you do one get penalized by not being able to get the rewards and achievements, why allowed that then",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Friends... DO NOT BUY THIS!\n\nBalancing for co-op is botched. \n\nSolo play is well balanced, easy to win given you build skills and level up. 2 player co-op becomes an unbeatable nightmare on the easiest difficulty. This is just bad design. There is no excuse for a co-op focused game, that has been out for years and has patches, to be given such poor development. I doubt it'll be fixed. I cannot get a refund at this point, so please don't give them anymore money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros:\r\n-Interesting, playable characters with unique skills and specialties that unlock as you progress.\r\n-Each character has their own lore and story.\r\n-MOBA-style gameplay mechanics combined with action-roguelike elements.\r\n\r\nCons:\r\n-As a solo player, the game is difficult and frustrating, even when grinding to level up your character.\r\n-The difficulty is comparable to Dark Souls, where even small mistakes can lead to instant death, and enemies deal as much damage as you do.\r\n-No difficulty options unless you beat the game, which makes it even harder.\r\n\r\nConclusion:\r\nThis game is unique with interesting characters, but it needs more polish. As you grind, there should be bonus stats added to make progress smoother/easier so you’re not struggling as much the next time you play. Sadly, I haven’t tried multiplayer yet, but I’ve heard it's even more difficult than solo play. Due to the high difficulty, reminiscent of Dark Souls, I’ve lost interest in this game, especially since other similar games offer more options and rewards. If the developers improve the game, I’d gladly give it another chance and offer a positive review.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is trash. The multiplayer rooms cannot consistently connect.  In each gaming session \n\n1 hour of actual game play\n5 hours of just trying to make it past the lobby.\n\nGarbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pls make it aviable to move while left click atack.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't recommend an anti-fun game, all you have to know is that dashes don't got i-frames, mobs take ZERO damage, you die instantly to anything remotely stronger than the average monster, and the game obligates you to play on higher difficulty to fight the real final bosses, which makes zero sense.\n\nAlso the game punishes you for bringing friends?????????????????????",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "one of the worst game ive played in a long time.very cool concept but execution is piss poor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its got the makings of a great game but for me the difficulty is not balanced enough, I am a player who can easily get to and run high Pit levels on Diablo 4 on Nightmare level 3 with easy, but the grind here seems off, damage taken is to high against the power of your abilities ..maybe  its meant to be team played? but then why have solo option? .. it needs an easy mode or adjustment to the game ..Early game  you feel weak and die way to much..not much of an incentive to keep trying it goes all out stick and no carrot, I cant upgrade skills or invest like other games so it adds to feeling of a wall of weakness and the grind..they could start easy and build the difficulty would be a nicer welcome rather than after you die many times it will allow you to finally get your level high enough to continue \n( knowing that your going to have then have do it all again on the next level) which to me feels like just poor game mechanics, stalling from the get go, normally fast enemies do low damage and are weak, tank should be high damage, high life and be slow moving,  bosses can change this up of course. . take a leaf out V rising, the combat there is so intuitive that it feels fast natural and fluid, you get your character is powerful enough to take on the threats..  without making you feel weak or to powerful .. if they took this approach it would work much better than what this offers, the game is solid the idea is cool, the characters work well its just the combat for me that doesn't deliver and needs attention..  going all out death n grind is not doing it for me ..I feel it only highlights how weak your characters are and makes you ask why are they even trying this undertaking if your going to keep dying. I want to enjoy the game, have fun feel like I am making progress and you cant do that if your just expected to keep   attempting the same level in the same way over and over form the very start.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring even in coop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of those ones where you wish it wasn't just a Yes or No option if you recommend.\r\n\r\nThis game clearly has a lot of love in it, but it feels undercooked. There's really not that much variety of any kind in it; enemies, bosses, builds, etc. There's enough to make it worth a purchase on sale, but it feels like there's entire features missing and even a level or two.\r\n\r\nAlso, the most egregious thing and what made my give it a \"no\" review, is that there is no way to re-join a game if you crash or disconnect (happened to me 2x in 8 hours). The hour you just spent just evaporates, whilst the other players continue on. I can see people complaining about this 10 months ago and the fact it hasn't been addressed makes me think it's unlikely the game has particularly attentive devs - take from that what you will.\r\n\r\nIf you can get this for around $10 then you'll get your money's worth, but I wouldn't expect this figure to go up much unless the devs pull their finger out and add more content.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "The game looks great and clearly has potential, but the pacing kills it for me. Progression feels almost nonexistent. I have replayed the first level five or six times and it is just tedious. There is no real sense of growth, power, or clear goals. Instead of feeling like I am getting stronger, every run feels the same which makes it repetitive very quickly.\n\nOther players have pointed out the same issues: limited map variety, not enough enemy types, and a grindy loop that does not reward your time\n\nThe foundation is there, but it needs faster progression, more variety, and a better sense of leveling up before it can become something special. Right now it is too boring and too slow, and I am honestly considering a refund.",
      "voted_up": false,
      "votes_helpful": 85
    },
    {
      "review": "After playing this game from 1.0 onward, every patch has made the game harder and less fun in co-op groups. I play in groups of 2 to 4 people total and we went from beating or almost beating the game on the 3rd/4th difficulty each run (and having a BLAST), to now struggling with RNG drops to get past the 2nd difficulty.  We full clear each map usually as well.\n\nAfter each big update, things have gotten significantly tougher. The addition of new events has been interesting, but each event also dilutes the item/reward pool, making character power progression feel weaker. This, combined with what seems like an overall increase in difficulty, has made it a lot harder for us to enjoy the game the way we used to. Now, we’re struggling a lot more, and honestly, it’s starting to drive all of my friends away.\n\nOne of the most frustrating parts is spending nearly an hour on a run, only to reach a boss we used to do well on and get completely wiped. Losing is part of the game, but when we used to have a good shot at winning and now feel like we're barely scraping by, it just doesn’t feel fun anymore. It’s disheartening to put in all that time and effort, only to hit a wall that didn’t used to be there.\n\nI totally understand that updates are meant to keep the game fresh, and I respect the devs for working hard to improve Ravenswatch. But making an already-challenging base difficulty even harder feels like it might be pushing away more casual players like us. I’m worried that if this continues, we’ll have to stop playing altogether - not because we don’t love the game, but because it just isn’t as fun anymore. \n\nI won't be playing any more and I certainly cannot recommend this game in its current state and trajectory. The game has lost its appeal and is no longer fun to play.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "i like it but the game feels too slow and repetitive. character designs are really great and diverse.. skills and their modifiers work together nicely and combat feels pretty fun.  games are an hour long divided into 3 acts which are 20 minutes each. the map doesnt change but the events are in random locations. you just do the events to power up your build and then fight the boss, rinse and repeat 2 more times. its missing something or a few things, but definitely has a good foundation.  might give it a few more tries on higher difficulties to see if it gets any better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Multiplayer needs some serious work, 40-50min into babayaga at highest difficulty only to be disconnected, happened way too many times",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wanted to like this game, but it is so shallow and its really just a poor representation of what a rouge-like type game should be. There is little to no variety of abilities, its heavily focused on the character you pick more than what you get each run, and the timer basically just forces you along quickly through one of the three levels and then its done. It is boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The multiplayer lobbies consistently fail to launch. Very unfortunate.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good Game but the gameplay loop is too repetitive and gets boring quickly.\nPros:\n1. Co op\n2. Optimization\n3. setting and lore\n4. Hero spread\n\nCons:\n1. same stage structure\n2. not enough enemy variety in biomes\n3. doesn't feel different from the previous run\n\nWith a heavy heart I must say no, it is just not fun enough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately the latest update has removed my favorite quest boss from the game, all the while adding unnecessary, annoying time management incentives, to a game already burdened by having to get things done quickly. \n\nWasting so much time with the stage 2 quest, following sinbad around, and wasting time with a bird fight that is not even difficult, just boring.\n\nLoved this game before this update and would absolutely love to see a previous version available to play somehow. \n\nBarring a return to form my time with this game has officially come to an end. \n\nThank you for the fun times before this update!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It just feels too small and repetitive, runs are too much alike.\nThe combat feels great though.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Although it's got some good things going for it, the variety of the roguelike aspects are pretty lacking. There's only a few maps, and those maps are super frustrating to traverse because there are random walls everywhere. See a treasure chest nearby on the mini-map? Have fun walking around a giant circle to find the small stairway that leads to it.\r\n\r\nThe damage scaling is pretty unbalanced, some guys will 1-shot you if you don't dodge their charge attacks, while others barely scratch you.\r\n\r\nThe upgrades are pretty generic \"this does 5% more damage\" and the UI to navigate everything leaves a lot to be desired. It took me a while to figure out I had to open the mini-map in order to hover over my all my skills/upgrades to see what's going on. Why can't I see the same details when I hit escape? or hold alt? Not sure.\r\n\r\nMaybe pick it up if it's on a really good sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a good idea in concept, but there's just something a little wrong in the execution. Not enough maps, yeah, the mobs are all same-y, sure, but the main issue to me is that the runs just overstay their welcome. Three maps at a minimum of 15 minutes each means you'll be spending at least 55 minutes on a run if you're killing the bosses in five each. That's quite the commitment for a roguelike, and you can only save+quit at the end of each map, meaning every 20~ish minutes.\r\n\r\nIt would be a lot better if it was one map with options on game time and sizes: small, medium, and large maps for 15, 30, and 45 minutes respectively. If they add a more bite-sized gamemode I'll likely change my review to positive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just because there is no way to reconnect. Whenever I play with friends and 1 or more is getting a dc for whatever reason they can't reconnect and the run is basically ruined. Implement it pls..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "highly repetitive; I reckon the lack of up-leveling of heros (not referring to the one during battle, which is reset every time) makes it hard to feel like you're getting stronger. The only \"stronger\" you can get is by being physically better at playing the game, which is somewhat close to a board game in the end. Some people might like this, but I personally didn't fall in love with this dynamic, despite the nice premises of the game setting",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is fun and offers interessting characters, however it is painly unpolished, the optimisation is lacking, server connection quality is subpar, and the hitboxes seem clumsy, it can both be great fund as well as being painfully frustrating for reasons that shouldnt be there",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is great, but I made unfortunate decision to try out Geppetto, and well it is insane to me how clunky, unfun and horrible this character is. I don't understand how it is possible to make character with summons that unfun and miserable to play, but congrats. Sadly he is the only one with summons, so this sucks (except for the Flute guy, but he has fake summons).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Super fun, but constant disconnects make it unplayable in 4 people co-op. Devs fail to fix it for more than a year. Otherwise great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "On paper, this should be a game I love: Great theme, level-based co-op game, progression, etc...\r\nIn practice, it just annoys me. Everything is based on how quickly you can kill anything, a lot of bosses have no reward if you don't kill them in time, EVERYTHING is timed.\r\nYes, there is a mode with no timer, but you're locked out of any sort of metaprogression if you enable it.\r\n\r\nThe combat is also pretty lackluster, from my experience, it's mostly waiting for cooldowns and dodging enemies. If you're playing any sort of melee character it's a death-sentence going in without an escape button on.\r\n\r\nSo in essence if you hate being rushed, dislike rewards being denied to you from bosses despite beating them and don't want to feel annoyed by everything, this is not the game for you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs more content, 3 stages and a big boss isnt fun for long. they couldve just made an endless mode that resets you but naw fam. 1 hr run at max",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really wanted to like the game from the moment I saw the Pied Piper leading his rats in the first announcement video. Unfortunately, I just couldn't get into it, mostly because I found the bosses to be no fun at all and the various character abilities never felt very interesting to use. \n\nUltimately, it's just a very subjective \"no\" from me, for whatever that's worth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought game Played for 3 hours, exited, next time when i logged in i lost all my progress, could not get refund from steam as time wasnt in frame, contact developer told me to go f myself",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I guess I just don't get it? I've tried solo and co-op runs and this game is so boring... Nothing is explained to you at all, took me digging through menus to find the \"tutorial\" and then I still had to play multiple games to figure out other stuff that wasn't explained because it just chucks you into the menu and into the game unceremoniously.\n\nI'm out here watching the randoms run to do things and teleport around just to understand that that's something I can even do. This is also because the game is clearly not meant to be played solo as well which isn't really as clear as it could be in game purely based on balance.\n\nAll but one of the characters I tried had kits that felt like they were stifling themselves instead of synergising with themselves, with the upgrades making them feel how they should rather than feeling like upgrades. Enemies are basically all just \"I will run at you now\" with the occasional \"I will shoot at you now\" thrown in which makes it VERY boring to fight them, as well as there not being much feedback on anything as well? Oh, you also can't mute people in multiplayer which you can imagine works great when joining randoms using a PS5 controller so you can hear their entire room in 220db!\n\nIt all just feels very empty and lifeless and boring. It's like it's doing it's best to tell me not to play it even if I wanted to, which is a shame because the game is nice to look at, the theme brought me in and I love me a good co-op game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game its pretty bad. at the start of the game the enemy feels like overwhelming and the spells and abilities are underwhelming. Also you are allowed to get buffed at  the start of the game but if you do one get penalized by not being able to get the rewards and achievements, why allowed that then",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Friends... DO NOT BUY THIS!\n\nBalancing for co-op is botched. \n\nSolo play is well balanced, easy to win given you build skills and level up. 2 player co-op becomes an unbeatable nightmare on the easiest difficulty. This is just bad design. There is no excuse for a co-op focused game, that has been out for years and has patches, to be given such poor development. I doubt it'll be fixed. I cannot get a refund at this point, so please don't give them anymore money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros:\r\n-Interesting, playable characters with unique skills and specialties that unlock as you progress.\r\n-Each character has their own lore and story.\r\n-MOBA-style gameplay mechanics combined with action-roguelike elements.\r\n\r\nCons:\r\n-As a solo player, the game is difficult and frustrating, even when grinding to level up your character.\r\n-The difficulty is comparable to Dark Souls, where even small mistakes can lead to instant death, and enemies deal as much damage as you do.\r\n-No difficulty options unless you beat the game, which makes it even harder.\r\n\r\nConclusion:\r\nThis game is unique with interesting characters, but it needs more polish. As you grind, there should be bonus stats added to make progress smoother/easier so you’re not struggling as much the next time you play. Sadly, I haven’t tried multiplayer yet, but I’ve heard it's even more difficult than solo play. Due to the high difficulty, reminiscent of Dark Souls, I’ve lost interest in this game, especially since other similar games offer more options and rewards. If the developers improve the game, I’d gladly give it another chance and offer a positive review.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is trash. The multiplayer rooms cannot consistently connect.  In each gaming session \n\n1 hour of actual game play\n5 hours of just trying to make it past the lobby.\n\nGarbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pls make it aviable to move while left click atack.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't recommend an anti-fun game, all you have to know is that dashes don't got i-frames, mobs take ZERO damage, you die instantly to anything remotely stronger than the average monster, and the game obligates you to play on higher difficulty to fight the real final bosses, which makes zero sense.\n\nAlso the game punishes you for bringing friends?????????????????????",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "one of the worst game ive played in a long time.very cool concept but execution is piss poor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its got the makings of a great game but for me the difficulty is not balanced enough, I am a player who can easily get to and run high Pit levels on Diablo 4 on Nightmare level 3 with easy, but the grind here seems off, damage taken is to high against the power of your abilities ..maybe  its meant to be team played? but then why have solo option? .. it needs an easy mode or adjustment to the game ..Early game  you feel weak and die way to much..not much of an incentive to keep trying it goes all out stick and no carrot, I cant upgrade skills or invest like other games so it adds to feeling of a wall of weakness and the grind..they could start easy and build the difficulty would be a nicer welcome rather than after you die many times it will allow you to finally get your level high enough to continue \n( knowing that your going to have then have do it all again on the next level) which to me feels like just poor game mechanics, stalling from the get go, normally fast enemies do low damage and are weak, tank should be high damage, high life and be slow moving,  bosses can change this up of course. . take a leaf out V rising, the combat there is so intuitive that it feels fast natural and fluid, you get your character is powerful enough to take on the threats..  without making you feel weak or to powerful .. if they took this approach it would work much better than what this offers, the game is solid the idea is cool, the characters work well its just the combat for me that doesn't deliver and needs attention..  going all out death n grind is not doing it for me ..I feel it only highlights how weak your characters are and makes you ask why are they even trying this undertaking if your going to keep dying. I want to enjoy the game, have fun feel like I am making progress and you cant do that if your just expected to keep   attempting the same level in the same way over and over form the very start.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring even in coop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of those ones where you wish it wasn't just a Yes or No option if you recommend.\r\n\r\nThis game clearly has a lot of love in it, but it feels undercooked. There's really not that much variety of any kind in it; enemies, bosses, builds, etc. There's enough to make it worth a purchase on sale, but it feels like there's entire features missing and even a level or two.\r\n\r\nAlso, the most egregious thing and what made my give it a \"no\" review, is that there is no way to re-join a game if you crash or disconnect (happened to me 2x in 8 hours). The hour you just spent just evaporates, whilst the other players continue on. I can see people complaining about this 10 months ago and the fact it hasn't been addressed makes me think it's unlikely the game has particularly attentive devs - take from that what you will.\r\n\r\nIf you can get this for around $10 then you'll get your money's worth, but I wouldn't expect this figure to go up much unless the devs pull their finger out and add more content.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "The game looks great and clearly has potential, but the pacing kills it for me. Progression feels almost nonexistent. I have replayed the first level five or six times and it is just tedious. There is no real sense of growth, power, or clear goals. Instead of feeling like I am getting stronger, every run feels the same which makes it repetitive very quickly.\n\nOther players have pointed out the same issues: limited map variety, not enough enemy types, and a grindy loop that does not reward your time\n\nThe foundation is there, but it needs faster progression, more variety, and a better sense of leveling up before it can become something special. Right now it is too boring and too slow, and I am honestly considering a refund.",
      "voted_up": false,
      "votes_helpful": 85
    },
    {
      "review": "After playing this game from 1.0 onward, every patch has made the game harder and less fun in co-op groups. I play in groups of 2 to 4 people total and we went from beating or almost beating the game on the 3rd/4th difficulty each run (and having a BLAST), to now struggling with RNG drops to get past the 2nd difficulty.  We full clear each map usually as well.\n\nAfter each big update, things have gotten significantly tougher. The addition of new events has been interesting, but each event also dilutes the item/reward pool, making character power progression feel weaker. This, combined with what seems like an overall increase in difficulty, has made it a lot harder for us to enjoy the game the way we used to. Now, we’re struggling a lot more, and honestly, it’s starting to drive all of my friends away.\n\nOne of the most frustrating parts is spending nearly an hour on a run, only to reach a boss we used to do well on and get completely wiped. Losing is part of the game, but when we used to have a good shot at winning and now feel like we're barely scraping by, it just doesn’t feel fun anymore. It’s disheartening to put in all that time and effort, only to hit a wall that didn’t used to be there.\n\nI totally understand that updates are meant to keep the game fresh, and I respect the devs for working hard to improve Ravenswatch. But making an already-challenging base difficulty even harder feels like it might be pushing away more casual players like us. I’m worried that if this continues, we’ll have to stop playing altogether - not because we don’t love the game, but because it just isn’t as fun anymore. \n\nI won't be playing any more and I certainly cannot recommend this game in its current state and trajectory. The game has lost its appeal and is no longer fun to play.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "i like it but the game feels too slow and repetitive. character designs are really great and diverse.. skills and their modifiers work together nicely and combat feels pretty fun.  games are an hour long divided into 3 acts which are 20 minutes each. the map doesnt change but the events are in random locations. you just do the events to power up your build and then fight the boss, rinse and repeat 2 more times. its missing something or a few things, but definitely has a good foundation.  might give it a few more tries on higher difficulties to see if it gets any better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Multiplayer needs some serious work, 40-50min into babayaga at highest difficulty only to be disconnected, happened way too many times",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wanted to like this game, but it is so shallow and its really just a poor representation of what a rouge-like type game should be. There is little to no variety of abilities, its heavily focused on the character you pick more than what you get each run, and the timer basically just forces you along quickly through one of the three levels and then its done. It is boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The multiplayer lobbies consistently fail to launch. Very unfortunate.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good Game but the gameplay loop is too repetitive and gets boring quickly.\nPros:\n1. Co op\n2. Optimization\n3. setting and lore\n4. Hero spread\n\nCons:\n1. same stage structure\n2. not enough enemy variety in biomes\n3. doesn't feel different from the previous run\n\nWith a heavy heart I must say no, it is just not fun enough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately the latest update has removed my favorite quest boss from the game, all the while adding unnecessary, annoying time management incentives, to a game already burdened by having to get things done quickly. \n\nWasting so much time with the stage 2 quest, following sinbad around, and wasting time with a bird fight that is not even difficult, just boring.\n\nLoved this game before this update and would absolutely love to see a previous version available to play somehow. \n\nBarring a return to form my time with this game has officially come to an end. \n\nThank you for the fun times before this update!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It just feels too small and repetitive, runs are too much alike.\nThe combat feels great though.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Although it's got some good things going for it, the variety of the roguelike aspects are pretty lacking. There's only a few maps, and those maps are super frustrating to traverse because there are random walls everywhere. See a treasure chest nearby on the mini-map? Have fun walking around a giant circle to find the small stairway that leads to it.\r\n\r\nThe damage scaling is pretty unbalanced, some guys will 1-shot you if you don't dodge their charge attacks, while others barely scratch you.\r\n\r\nThe upgrades are pretty generic \"this does 5% more damage\" and the UI to navigate everything leaves a lot to be desired. It took me a while to figure out I had to open the mini-map in order to hover over my all my skills/upgrades to see what's going on. Why can't I see the same details when I hit escape? or hold alt? Not sure.\r\n\r\nMaybe pick it up if it's on a really good sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a good idea in concept, but there's just something a little wrong in the execution. Not enough maps, yeah, the mobs are all same-y, sure, but the main issue to me is that the runs just overstay their welcome. Three maps at a minimum of 15 minutes each means you'll be spending at least 55 minutes on a run if you're killing the bosses in five each. That's quite the commitment for a roguelike, and you can only save+quit at the end of each map, meaning every 20~ish minutes.\r\n\r\nIt would be a lot better if it was one map with options on game time and sizes: small, medium, and large maps for 15, 30, and 45 minutes respectively. If they add a more bite-sized gamemode I'll likely change my review to positive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just because there is no way to reconnect. Whenever I play with friends and 1 or more is getting a dc for whatever reason they can't reconnect and the run is basically ruined. Implement it pls..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "highly repetitive; I reckon the lack of up-leveling of heros (not referring to the one during battle, which is reset every time) makes it hard to feel like you're getting stronger. The only \"stronger\" you can get is by being physically better at playing the game, which is somewhat close to a board game in the end. Some people might like this, but I personally didn't fall in love with this dynamic, despite the nice premises of the game setting",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is fun and offers interessting characters, however it is painly unpolished, the optimisation is lacking, server connection quality is subpar, and the hitboxes seem clumsy, it can both be great fund as well as being painfully frustrating for reasons that shouldnt be there",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is great, but I made unfortunate decision to try out Geppetto, and well it is insane to me how clunky, unfun and horrible this character is. I don't understand how it is possible to make character with summons that unfun and miserable to play, but congrats. Sadly he is the only one with summons, so this sucks (except for the Flute guy, but he has fake summons).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Super fun, but constant disconnects make it unplayable in 4 people co-op. Devs fail to fix it for more than a year. Otherwise great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "On paper, this should be a game I love: Great theme, level-based co-op game, progression, etc...\r\nIn practice, it just annoys me. Everything is based on how quickly you can kill anything, a lot of bosses have no reward if you don't kill them in time, EVERYTHING is timed.\r\nYes, there is a mode with no timer, but you're locked out of any sort of metaprogression if you enable it.\r\n\r\nThe combat is also pretty lackluster, from my experience, it's mostly waiting for cooldowns and dodging enemies. If you're playing any sort of melee character it's a death-sentence going in without an escape button on.\r\n\r\nSo in essence if you hate being rushed, dislike rewards being denied to you from bosses despite beating them and don't want to feel annoyed by everything, this is not the game for you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs more content, 3 stages and a big boss isnt fun for long. they couldve just made an endless mode that resets you but naw fam. 1 hr run at max",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really wanted to like the game from the moment I saw the Pied Piper leading his rats in the first announcement video. Unfortunately, I just couldn't get into it, mostly because I found the bosses to be no fun at all and the various character abilities never felt very interesting to use. \n\nUltimately, it's just a very subjective \"no\" from me, for whatever that's worth.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bought game Played for 3 hours, exited, next time when i logged in i lost all my progress, could not get refund from steam as time wasnt in frame, contact developer told me to go f myself",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I guess I just don't get it? I've tried solo and co-op runs and this game is so boring... Nothing is explained to you at all, took me digging through menus to find the \"tutorial\" and then I still had to play multiple games to figure out other stuff that wasn't explained because it just chucks you into the menu and into the game unceremoniously.\n\nI'm out here watching the randoms run to do things and teleport around just to understand that that's something I can even do. This is also because the game is clearly not meant to be played solo as well which isn't really as clear as it could be in game purely based on balance.\n\nAll but one of the characters I tried had kits that felt like they were stifling themselves instead of synergising with themselves, with the upgrades making them feel how they should rather than feeling like upgrades. Enemies are basically all just \"I will run at you now\" with the occasional \"I will shoot at you now\" thrown in which makes it VERY boring to fight them, as well as there not being much feedback on anything as well? Oh, you also can't mute people in multiplayer which you can imagine works great when joining randoms using a PS5 controller so you can hear their entire room in 220db!\n\nIt all just feels very empty and lifeless and boring. It's like it's doing it's best to tell me not to play it even if I wanted to, which is a shame because the game is nice to look at, the theme brought me in and I love me a good co-op game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game its pretty bad. at the start of the game the enemy feels like overwhelming and the spells and abilities are underwhelming. Also you are allowed to get buffed at  the start of the game but if you do one get penalized by not being able to get the rewards and achievements, why allowed that then",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Friends... DO NOT BUY THIS!\n\nBalancing for co-op is botched. \n\nSolo play is well balanced, easy to win given you build skills and level up. 2 player co-op becomes an unbeatable nightmare on the easiest difficulty. This is just bad design. There is no excuse for a co-op focused game, that has been out for years and has patches, to be given such poor development. I doubt it'll be fixed. I cannot get a refund at this point, so please don't give them anymore money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros:\r\n-Interesting, playable characters with unique skills and specialties that unlock as you progress.\r\n-Each character has their own lore and story.\r\n-MOBA-style gameplay mechanics combined with action-roguelike elements.\r\n\r\nCons:\r\n-As a solo player, the game is difficult and frustrating, even when grinding to level up your character.\r\n-The difficulty is comparable to Dark Souls, where even small mistakes can lead to instant death, and enemies deal as much damage as you do.\r\n-No difficulty options unless you beat the game, which makes it even harder.\r\n\r\nConclusion:\r\nThis game is unique with interesting characters, but it needs more polish. As you grind, there should be bonus stats added to make progress smoother/easier so you’re not struggling as much the next time you play. Sadly, I haven’t tried multiplayer yet, but I’ve heard it's even more difficult than solo play. Due to the high difficulty, reminiscent of Dark Souls, I’ve lost interest in this game, especially since other similar games offer more options and rewards. If the developers improve the game, I’d gladly give it another chance and offer a positive review.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is trash. The multiplayer rooms cannot consistently connect.  In each gaming session \n\n1 hour of actual game play\n5 hours of just trying to make it past the lobby.\n\nGarbage.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pls make it aviable to move while left click atack.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't recommend an anti-fun game, all you have to know is that dashes don't got i-frames, mobs take ZERO damage, you die instantly to anything remotely stronger than the average monster, and the game obligates you to play on higher difficulty to fight the real final bosses, which makes zero sense.\n\nAlso the game punishes you for bringing friends?????????????????????",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "one of the worst game ive played in a long time.very cool concept but execution is piss poor.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its got the makings of a great game but for me the difficulty is not balanced enough, I am a player who can easily get to and run high Pit levels on Diablo 4 on Nightmare level 3 with easy, but the grind here seems off, damage taken is to high against the power of your abilities ..maybe  its meant to be team played? but then why have solo option? .. it needs an easy mode or adjustment to the game ..Early game  you feel weak and die way to much..not much of an incentive to keep trying it goes all out stick and no carrot, I cant upgrade skills or invest like other games so it adds to feeling of a wall of weakness and the grind..they could start easy and build the difficulty would be a nicer welcome rather than after you die many times it will allow you to finally get your level high enough to continue \n( knowing that your going to have then have do it all again on the next level) which to me feels like just poor game mechanics, stalling from the get go, normally fast enemies do low damage and are weak, tank should be high damage, high life and be slow moving,  bosses can change this up of course. . take a leaf out V rising, the combat there is so intuitive that it feels fast natural and fluid, you get your character is powerful enough to take on the threats..  without making you feel weak or to powerful .. if they took this approach it would work much better than what this offers, the game is solid the idea is cool, the characters work well its just the combat for me that doesn't deliver and needs attention..  going all out death n grind is not doing it for me ..I feel it only highlights how weak your characters are and makes you ask why are they even trying this undertaking if your going to keep dying. I want to enjoy the game, have fun feel like I am making progress and you cant do that if your just expected to keep   attempting the same level in the same way over and over form the very start.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring even in coop",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of those ones where you wish it wasn't just a Yes or No option if you recommend.\r\n\r\nThis game clearly has a lot of love in it, but it feels undercooked. There's really not that much variety of any kind in it; enemies, bosses, builds, etc. There's enough to make it worth a purchase on sale, but it feels like there's entire features missing and even a level or two.\r\n\r\nAlso, the most egregious thing and what made my give it a \"no\" review, is that there is no way to re-join a game if you crash or disconnect (happened to me 2x in 8 hours). The hour you just spent just evaporates, whilst the other players continue on. I can see people complaining about this 10 months ago and the fact it hasn't been addressed makes me think it's unlikely the game has particularly attentive devs - take from that what you will.\r\n\r\nIf you can get this for around $10 then you'll get your money's worth, but I wouldn't expect this figure to go up much unless the devs pull their finger out and add more content.",
      "voted_up": false,
      "votes_helpful": 49
    },
    {
      "review": "The game looks great and clearly has potential, but the pacing kills it for me. Progression feels almost nonexistent. I have replayed the first level five or six times and it is just tedious. There is no real sense of growth, power, or clear goals. Instead of feeling like I am getting stronger, every run feels the same which makes it repetitive very quickly.\n\nOther players have pointed out the same issues: limited map variety, not enough enemy types, and a grindy loop that does not reward your time\n\nThe foundation is there, but it needs faster progression, more variety, and a better sense of leveling up before it can become something special. Right now it is too boring and too slow, and I am honestly considering a refund.",
      "voted_up": false,
      "votes_helpful": 85
    },
    {
      "review": "After playing this game from 1.0 onward, every patch has made the game harder and less fun in co-op groups. I play in groups of 2 to 4 people total and we went from beating or almost beating the game on the 3rd/4th difficulty each run (and having a BLAST), to now struggling with RNG drops to get past the 2nd difficulty.  We full clear each map usually as well.\n\nAfter each big update, things have gotten significantly tougher. The addition of new events has been interesting, but each event also dilutes the item/reward pool, making character power progression feel weaker. This, combined with what seems like an overall increase in difficulty, has made it a lot harder for us to enjoy the game the way we used to. Now, we’re struggling a lot more, and honestly, it’s starting to drive all of my friends away.\n\nOne of the most frustrating parts is spending nearly an hour on a run, only to reach a boss we used to do well on and get completely wiped. Losing is part of the game, but when we used to have a good shot at winning and now feel like we're barely scraping by, it just doesn’t feel fun anymore. It’s disheartening to put in all that time and effort, only to hit a wall that didn’t used to be there.\n\nI totally understand that updates are meant to keep the game fresh, and I respect the devs for working hard to improve Ravenswatch. But making an already-challenging base difficulty even harder feels like it might be pushing away more casual players like us. I’m worried that if this continues, we’ll have to stop playing altogether - not because we don’t love the game, but because it just isn’t as fun anymore. \n\nI won't be playing any more and I certainly cannot recommend this game in its current state and trajectory. The game has lost its appeal and is no longer fun to play.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "i like it but the game feels too slow and repetitive. character designs are really great and diverse.. skills and their modifiers work together nicely and combat feels pretty fun.  games are an hour long divided into 3 acts which are 20 minutes each. the map doesnt change but the events are in random locations. you just do the events to power up your build and then fight the boss, rinse and repeat 2 more times. its missing something or a few things, but definitely has a good foundation.  might give it a few more tries on higher difficulties to see if it gets any better.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Multiplayer needs some serious work, 40-50min into babayaga at highest difficulty only to be disconnected, happened way too many times",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wanted to like this game, but it is so shallow and its really just a poor representation of what a rouge-like type game should be. There is little to no variety of abilities, its heavily focused on the character you pick more than what you get each run, and the timer basically just forces you along quickly through one of the three levels and then its done. It is boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The multiplayer lobbies consistently fail to launch. Very unfortunate.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good Game but the gameplay loop is too repetitive and gets boring quickly.\nPros:\n1. Co op\n2. Optimization\n3. setting and lore\n4. Hero spread\n\nCons:\n1. same stage structure\n2. not enough enemy variety in biomes\n3. doesn't feel different from the previous run\n\nWith a heavy heart I must say no, it is just not fun enough.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately the latest update has removed my favorite quest boss from the game, all the while adding unnecessary, annoying time management incentives, to a game already burdened by having to get things done quickly. \n\nWasting so much time with the stage 2 quest, following sinbad around, and wasting time with a bird fight that is not even difficult, just boring.\n\nLoved this game before this update and would absolutely love to see a previous version available to play somehow. \n\nBarring a return to form my time with this game has officially come to an end. \n\nThank you for the fun times before this update!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "It just feels too small and repetitive, runs are too much alike.\nThe combat feels great though.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Although it's got some good things going for it, the variety of the roguelike aspects are pretty lacking. There's only a few maps, and those maps are super frustrating to traverse because there are random walls everywhere. See a treasure chest nearby on the mini-map? Have fun walking around a giant circle to find the small stairway that leads to it.\r\n\r\nThe damage scaling is pretty unbalanced, some guys will 1-shot you if you don't dodge their charge attacks, while others barely scratch you.\r\n\r\nThe upgrades are pretty generic \"this does 5% more damage\" and the UI to navigate everything leaves a lot to be desired. It took me a while to figure out I had to open the mini-map in order to hover over my all my skills/upgrades to see what's going on. Why can't I see the same details when I hit escape? or hold alt? Not sure.\r\n\r\nMaybe pick it up if it's on a really good sale.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's a good idea in concept, but there's just something a little wrong in the execution. Not enough maps, yeah, the mobs are all same-y, sure, but the main issue to me is that the runs just overstay their welcome. Three maps at a minimum of 15 minutes each means you'll be spending at least 55 minutes on a run if you're killing the bosses in five each. That's quite the commitment for a roguelike, and you can only save+quit at the end of each map, meaning every 20~ish minutes.\r\n\r\nIt would be a lot better if it was one map with options on game time and sizes: small, medium, and large maps for 15, 30, and 45 minutes respectively. If they add a more bite-sized gamemode I'll likely change my review to positive.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Just because there is no way to reconnect. Whenever I play with friends and 1 or more is getting a dc for whatever reason they can't reconnect and the run is basically ruined. Implement it pls..",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "highly repetitive; I reckon the lack of up-leveling of heros (not referring to the one during battle, which is reset every time) makes it hard to feel like you're getting stronger. The only \"stronger\" you can get is by being physically better at playing the game, which is somewhat close to a board game in the end. Some people might like this, but I personally didn't fall in love with this dynamic, despite the nice premises of the game setting",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is fun and offers interessting characters, however it is painly unpolished, the optimisation is lacking, server connection quality is subpar, and the hitboxes seem clumsy, it can both be great fund as well as being painfully frustrating for reasons that shouldnt be there",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is great, but I made unfortunate decision to try out Geppetto, and well it is insane to me how clunky, unfun and horrible this character is. I don't understand how it is possible to make character with summons that unfun and miserable to play, but congrats. Sadly he is the only one with summons, so this sucks (except for the Flute guy, but he has fake summons).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Super fun, but constant disconnects make it unplayable in 4 people co-op. Devs fail to fix it for more than a year. Otherwise great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "On paper, this should be a game I love: Great theme, level-based co-op game, progression, etc...\r\nIn practice, it just annoys me. Everything is based on how quickly you can kill anything, a lot of bosses have no reward if you don't kill them in time, EVERYTHING is timed.\r\nYes, there is a mode with no timer, but you're locked out of any sort of metaprogression if you enable it.\r\n\r\nThe combat is also pretty lackluster, from my experience, it's mostly waiting for cooldowns and dodging enemies. If you're playing any sort of melee character it's a death-sentence going in without an escape button on.\r\n\r\nSo in essence if you hate being rushed, dislike rewards being denied to you from bosses despite beating them and don't want to feel annoyed by everything, this is not the game for you.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Needs more content, 3 stages and a big boss isnt fun for long. they couldve just made an endless mode that resets you but naw fam. 1 hr run at max",
      "voted_up": false,
      "votes_helpful": 8
    }
  ]
}