{
  "positive": [
    {
      "review": "This game is so good when your teammates aren't lobotomites",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I really enjoy this game and in my opinion it is one of my favourite Dragon Ball games ever.\r\nI think it has very unique mechanics. I also played all of the tests of this game and I really enjoyed so I'm really excited to see the development of this game. Keep up the good work!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game is ass: the controls feel like they were designed with Yamcha’s feet. However it's fun to hear vegeta yell the n word whenever the enemy team is stomping us.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "I love this game, Return of the Saiyans is very fun to play, i very enjoy play with my cousin and he is Bigos main, we are the best duo in this game if anyone meets us (Rastafarianin and Mango67Musztarda) must know this game will be win. ps. Goku997 is the worst player",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just wanted to say... I really enjoy Dragon Ball Gekishin Squadra, but the character unlock system is honestly a bit ridiculous. If you're already high level, it feels like there's no real way to get the new characters without spending gems… and you barely get 15 gems a week. That makes future updates feel kind of locked off unless you pay.\n\nOn the other hand, I actually like that there's no chat. It avoids all the flaming, crying, and overreactions that ruin a lot of other games. People sometimes make \"bold decisions\" which can be good,but stuff like rushing into the God of Destruction zone before it’s even open by Zeno? Yeah, that’s trolling. And I don't think most players even realize the report button exists after a match. Use it. Hopefully they vanish from the queue.\n\nTrolls showing up even in A or S rank is rough, but the game is still fun. It’s like a Dragon Ball version of Dota, and I wish they added more cards or systems to customize builds - that’s something Dragon Ball usually shines at.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a cool moba game but you really need friends to play this too bad my friends don't play this\nbecause its frustrating most off the times to play with starngers and there is no way to talk with your team mate's",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun game, there's is no ptw mechanics, if you like mobas give it a try!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun af, matches last 10 minutes at much, and that's awesome for people who only wants to casually play a couple of matches after work to relax, and that's very important \"RELAX\"\n\nThis game isn't very competitive-focused, and that's great and refreshing on this times were all games tend to focus on the competitive aspect of gaming, leaving behind those who play casually. It's still a MOBA and has some skill gap, but most of the time you just sit, relax and enjoy the animations and the FEELING of really playing as a DB character with obliterating powers!\n\nSadly the game has it's bugs and connectivity issues, but they are not really a game breaking problem, since I only experienced it a very few times, I hope they fix them soon tho. My only real issue are those freakin' in-game announcements that take all over the screen, they are distracting and cover almost everything, I would like an option to make them less-intrusive or just turn them off.\n\nI encourage everyone to try it and support the game if you like it, since I can see it was made with love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i cant believe these words are coming out of my mouth but im finally enjoying a MOBA, the game still needs work and fixes along the way but the main structor is so good i can play this almost daily no problem ;)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "cool moba game im enjoying it so far neede more characters though.. DBZ universe is massive",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The game is good, however, it has too many bugs and problems. The constant crashing, Zeni shortage, Hero memory past level 4, Star collection, it all piles up to a point it gets extremely infuriating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I laughed a lot playing Android 17 with Android 18, and we went to beat up Trunks. He transformed into a Super Saiyan, it was so epic! So I stayed to keep him busy so Android 18 could escape and not waste respawn time because she had more impact on the team, and you have to protect your family.\n\nI'm not into MOBAs. I never got into League of Legends, never clicked in me. I played Heroes of the Storm with a friend for a while, mostly for the Overwatch heroes, but I quit after a while because it was super slow and laggy. Aside from those heroes, I wasn't interested in any of the others. Sorry, I was never a Blizzard fan, although I did play quite a bit of WoW in Horde mode for a few years.\n\nWhat I like about Dragon Ball Gekishin Squadra is that it's fast-paced, and as Abridge Vegeta would say, \"power levels are bull***t,\" and everything goes to hell when the characters reach levels 10 to 15. I'm very happy with the character roster, and the possibilities are enormous.\n\nArtistically, it's beautiful. I love how they captured every little detail of Dragon Ball lore, and the gameplay, so similar to an anime, really makes you believe this could have been something like the Tournament of Power, with some kind of game-hour encounter with Zen'o Sama and the anime-style scenes and interactions.\n\nI like the Assist and Helper systems, but I feel the Card system makes a huge difference if you choose the wrong one.\n\nNow, the matchmaking is a real problem because the Steam player base is getting smaller and smaller, and it's very difficult to find matches, especially for unranked games, which have fun game modes that nobody plays. It's gotten to the point where even the achievement for playing 5 Sub-Rule Battles has become one of the hardest to get.\n\nWhile I don't have a problem with unlocking heroes because I like to play with specific characters, I do notice the problem for someone more competitive or interested in playing the latest characters; for them, unlocking heroes becomes impossible without spending money. As a game designer with 19 years of experience in MMORPGs, I've noticed problems with the balance of the soft currency, which is scarce (although there were some changes in Season 2 to increase it). \n\nThe core is that it's a very Asian-Like mmo, heavily focused on the old-school grinding of 20 years ago, and in the era of instant rewards, that kind of balance and dynamics aren't popular nowadays with people who have so little time. \n\nI understand that the idea is for players to grind two types of currency by playing with Heroes, and thus progress to unlock heroes. I saw the rebalances that added some of the newest ones like Toppo to unlock for free, but the progression is still so slow, even for a player who dedicates many hours, that I simply think it's demotivating the community. \n\nWhile it doesn't affect me personally heroes wise, I do notice how it's slowly shrinking the community and that indeed affects me direclty.\n\nI wish the game wouldn't shut down, but unless mobile keeps it going, I don't see much of a future for it on PC. \n\nEven so, I recommend it because the essence of the game goes beyond its micro-economy balance. It's a good tribute, and I like how dynamic and fast-paced it is, the art direction, and the unlockables, but it needs more currency balance re work and actions, boost other game modes too, or it will close.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gekishin Squadra is… certainly a game released this year.\nI played it. I can confirm that playing occurred. Truly, gaming has never been so game.\n\nFrom the moment I booted it up, I thought, “Wow. They really did press ‘release’ on this.” The graphics? They exist. The sound? Audible. The gameplay? Oh, it sure is doing something in there.\n\nThe story had me absolutely speechless mostly because I had no idea what was happening, but silence is still a reaction, and reactions are good, right? The characters are so memorable that I remember that they were, in fact, characters. Somewhere. Probably.\n\nCombat feels like someone whispered “innovation” into a blender and hit purée. It’s not bad it’s just aggressively there, like a coworker who keeps showing you pictures of their cat even though you didn’t ask.\n\nMy favorite part was when the game… happened. You’ll know the part. Trust me. You can’t miss it. I tried.\n\nOverall, Gekishin Squadra is the most Gekishin Squadra-looking Gekishin Squadra to ever Gekishin Squadra. A monument to this year's commitment to releasing video games, sometimes even on purpose.\n\n10/10 — would say \"yup, that’s a game\" again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bad as a moba, no real ranked gamemode. most of the characters either die instantly or are just thanos and have unmovable health bar or some are just hitlerstalin like hit.\n\nThere is not character that can really carry, even if you are really ahead, enemies can just ignore you and destroy your base in 5 seconds.\n\nThe game is build for special ed kids it seems, the dificult part of the games just autoplay for you, no need to stay by your tower because enemy can't atack it anyway if it's not their turn, you cant even see what the abilities do exactly and you dont even need to recall most of the game because even if you survive on 1 hp after a fight you don't even lose that much because you can just heal to full under tower.\n\nAlso ssj 3 goku is made for droolers, you can just tp across the map at lvl 3 and 2v3 enemy team for free as long as your other teamate doesn't start a random 1v2.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game only bad thing is the prices for stuff",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes, the game is fun but there are makor balance issues right now with certain characters. The Gems are also super over priced but you can get by playing 100% free. Just don't buy gems and grind up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good has a few flaws such as matchmaking and disconnect issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly fun. I was never a fan of MOBAs but I still had quite a lot of fun with this game.\nThe one thing I hate about this game is that they lock new characters behind a paywall...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amaging game! we need more characters please! and also more players! Highly recommended for some DB action MOBA! Love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's honestly a really fun game in my opinion. It definitely could use more balancing with some of the characters, along with adjustments to how the star level works (For example, if you're someone who already past 39, you miss out on characters like Toppo & Gotenks) and how Gems and Zeni are acquired cause I personally feel like it's not enough. Especially when someone, like myself, plays this game almost everyday and completes the battle pass long before the season's end, making battle points useless after a while, but I still continue to play for the love of the game (Even tho I feel like the battlepoints should be converted into zeni or something after the battlepass is filled out or that Zeni is rewarded after every match, regardless if you seized victory or not. Obviously, I feel like the victorious should get more Zeni with those who get MVP should get gems and maybe capsules as well as a reward for either carrying or helping out the team the most. I feel like this would definitely add more incentive if the developers happen to read this as well)\n\nWhat I like the most are the diverse characters and their unique abilities. Along with some of their unique animations & skins that you get from capsules.\n\nWhat I don't like is the fact that just like any other gatcha system, the chances of getting repeats is relatively high which gets annoying ngl. Also, like I mentioned before, battle points become useless after the battlepass is full and there's not many ways to get Zeni, Gems, & capsules besides the missions so once those missions are all filled out, you don't really have much of a reason to keep playing unless you genuinely have fun playing the game. \n\nWould I recommend this game to others? Yes, however, just know that the chances of you raging can vary depending on your personality and how your matches go)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun game. It is not era defining or anything, but it's worth the price tag. Worth a play especially if you love the dragon ball IP.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Fun game, as a Dragon Ball fan its a good game to play, keeps you playing and its amazing with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The odds are so good its easy to get gamma 1&2 intro animation.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun MOBA. Not the greatest, but there's enough depth without it being too complex to make it a very fun DB based MOBA!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "heavy potential, a very simple MOBA game anyone can play tbh. You don't need to be a hardcore gamer to understand and play its simple and easy and games don't last that long. Went from c3 to a2 within 2 days before s1 ended. Season one was very p2w but not unfair because the free characters are really good too including the starter ssj goku who is currently the strongest character in season 2. try to play the game and if you don't like it or understand it, either quit or do some research if you want to get into it. Honestly a really fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is alright. Feels like a less good version of that one pokemon game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm just doing this for the badges, I'm gonna be real with ya. You ain't gonna find a review here, keep looking, bud. But to be real, I like this game for what it is. That's all you gonna get out of me. See ya.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good times had in this game, it's so cool to do all these cool attacks use these characters to battle the other team.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Smartphone game ported to PC. It's not good, it's not bad, it just is. Time killer made for Dragon Ball fans - that's all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Would be a awesome game if they balance the characters and balance the microtransactions in the game to be more fare 7 dollars for just a character each is steep so is the zenith and diamond dish out for playing the game needs to be tweak to make it more often to at least give ppl a chance to earn the characters and the battle pass is terrible bc you can finish up to 4 to 5 weeks of missions on the battlepass and be done with it with nothing to do. If I good give it a side thumps up I would",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really fun, all characters feel good to play and master (anyone but Bojack and yes that's more of a personal opinion) The game is quite easy to understand as well. Whoever the team balancing is a bit wacky at times and it truly depends on the team you get. But past that the game has so many little details in battle and animations that is a worth a try if you like Mobas and Dragon Ball",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game mostly cuz its dbz lol but its fast easy and a fun game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The gameplay is fast-paced and fun, the visuals are a stunning recreation of the anime and Toriyamas art work. The main issue this game faces right now is the monetization and the way new characters are unlocked. New releases are limited in the amount you can unlock for free, right now you can only get 3 new characters as only 3 tier 1 hero unlocks exist in the star track.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You punch everything that breaths, fly everywhere and throw chi charges. ALOT of blasting\nfantastic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun with a lot of cool animations, familiarity, and abilities. The only thing I dislike about it is how abruptly the games end. The game doesn't crash (on pc) but the idea of breaking the glass to get the Dragon \nBall and just touching it happens too quickly. You feel so invested once you get around level 12-13 then someone just back doors the DB and the game is instantly over. Yes the game should have an end but the late game team fights are what you should be playing for in terms of fun in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Enjoyable game! Fun to play and fun grinding your way to unlock other characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i absolutely despise this game fix star path i have 70 hours and all of them are on ssj4 vegeta im him he's busted get good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never been into MOBAs until this game released, ISTG it's the most addictive thing oat, I hated other MOBAs with a burning passion because I couldn't understand a thing and everyone had too much skill, but here everyone started from scratch so it was easy to keep up since the first betas, the progression system is unfair at some moments but ig it's \"kinda\" necessary to keep players here from time to time so it's understandable to a point, also, this game being from the db IP makes it 100x better and smoother, I can expect roles or abilities based on characters and since the patches are rolled out from time to time my fav character can get its time to shine at the same time others can, like Boujack recently, it's one of my main heroes since the newest patch, in general game's so goddamn fun I can't even begin to comprehend it😩😩😩. (Looking forward for more heroes, patches, skins and gamemodes!!!)\n\n(also it's so, SO fun that honestly... it's saving me rn from doing smth stupid, so uhhh, yeah, I love this game.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All the characters are broken in their own ways, you will get good rewards at the start as you level up, but it sometimes gets a bit one sided at times but the gameplay, animations and combat are good, should definetly should give it a Try?\r\n\r\n(Sorry for the misspell)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game most fun with friends. biggest problem is most players are sore losers, if you are on the losing team players in your team spin around, spam the map, spam stamps, let the enemy's kill them or votes to surrender and stops playing if it doesn't go though. if you are winning against the enemy team they will die a thousand times, the match would go on for 20+ mins and they would have every opportunity to surrender but if and only if you take the final god they would surrender so you dont take the dragonball. game really only has a toxic player base that makes most people want to stop playing. really well made and fun game but horrible players, thumbs up for the game thumbs down for most players in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Y’know, not a game I thought I’d enjoy at all but it’s actually pretty fun. Especially with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only fun w friends or playing tournaments, other than that its playing the same thing over and over (worse than what ppl say about sparking zero! plus its like LoL and that says a lot)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For all the good of this game, I feel like the Star Pass is dumb, a.f.k.ers are annoying, and Bandai still won't delete my pc account.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a lot of Fun with friends. Although it is not that much fun as HotS i may get to this level. And I like to say RIP Heroes of the storm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the funnest mobas I've played in a bit, just wished they make it where you can 1v1 friends in custom battles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game for newer people who dont like the 2.5D fighting of Fighterz or the 3D fighting of xenoverse, Kakarot (if you would count that), or sparking zero.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm usually not into these types of games, and yet I'm playing this game every day! What I love the most about Gekishin Squadra is the attention the developers give to their fans; I can clearly tell they made updates because of what most people wanted, and I'm glad we are heard. Many characters feel strong, the matches don't take too much time, the visuals are nice, the controls are easy to understand and feel comfortable with; I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "would be much better if was 5vs5 also the new caracters overpower the old ones.. i am a kriling main i just get swipe by any other caracter, and if you kill the mini or bosses you insta lose the game even if you are smarter then other players sadge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good Dragon ball MOBA game i guess, but the rank system in GS is still not fair i can say, players can sometimes meet a pro while they are a beginner. Honestly looking forward for all sorts of event that will come out (other than capsule bonanza and zeni jamboree)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cant remember the last time a multiplayer game got me this excited to play it everyday, and imo the best dragon ball game since fighterz",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really well done gameplay and balancing. Has all my favourite chracteres and more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty damn fun. Perhaps needs some better balancing and/or playtesters, but overall good time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Dope game wish the character prices were lower and i hope they add teen gohan or GT Goku",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The connection issues kinda suck, but for a free game? Runs well enough, crossplatform play, decent roster, balance is alright, good amount of fun to be had",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Most important thing first:\r\n[b] Yes, the game is fun. [/b]\r\n\r\nLike any game, this one has its issues, but maybe they go a bit beyond the usual. The game has shaken players’ trust, especially those worried about how hard it is to unlock every playable character without paying. Season 2 brought changes, it’s far from perfect, but it’s definitely better.\r\n\r\nIf you’re thinking about trying it because you want a fast-paced MOBA and you enjoy Dragon Ball, then I don’t see why you shouldn’t give it a shot. The mechanics and overall gameplay loop are fun.\r\nThe biggest gameplay problem right now is the heavy use of bots. For a multiplayer game, it fails to offer a healthy amount of real matches, which leaves the community frustrated and unsure about trusting any teammate.\r\n\r\nOverall, it’s a good game to chill, not take too seriously, and have some fun MOBA sessions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Some players are brain dead, and it would be nice to have different maps, but the core loop is there and you can use a controller. LoL doesn't let you use a controller....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like the game, but it does suck if you play solo. Just play the game a few times per day and the solo experience won't be that miserable. Other than that the game is great and completely f2p as it's getting weekly update and after season 1 it turns out the characters released from the previous season becomes free. Only thing that's really paid are the cosmetics and even then you can still get them for free along w the season pass if u save up enough gems by playing a few battles a week.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game Is alright, but playing with randoms people will drive you crazy probably.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it for a moba; alot of potential if they keep the characters unique and add some maps!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some broken characters but overall a fun game.\nMatches go quite fast witch i like.\nNo one to play with though :/",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is pretty good, but new characters come out ridiculously overpowered in comparison to other characters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is terrible and hard for beginners. best game ever!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but with time bcm boring , it need some modes and events",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutley love this game!! I've never played a moba and was a little schepacal at first but after playing it I got addicted ps the devs arent so greedy and give out free stuff all the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun, even more fun with friends, slight issues with randoms leaving but it's whatever also a fun learning process",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game Good, Game fun, love game, love dragon ball",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good game for those who have never played League of Legends however love Dragon Ball. The free to play aspect helps everyone jump in and try it. I will say having friends that you can communicate with and talk to during the game can really elevate the experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gekishin Squadra is a really fun game to play either alone or with friends. Though it is way superior to play with friends cause at least you will have communication and strategies you can talk through with your friends. Playing Solo can get you some good players but most of time players who don't know how to fight strategically or chasing the opponents into their G.O.D and give them the advantage. All in all, a great game to play but its best to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but lacks the most basic team play features\r\nThere's no chatbox and the only way you can communicate is through emotes\r\nWith ranks being reset you can be paired alongside bots \r\nThere's ZERO incentive to play any of the sub rule modes\r\nWhile this is 4v4 game and the game is literally named \"Squadra\", I think a single player mode would benefit this game greatly\r\nThe character unlock system is bad. There's no reason for characters to be locked behind star collection when Zeni is scarce and the Battle Pass rewards past rank 40 are bad and could use a character selector\r\nIn its current state, I'd say it's only worth trying IF you're willing to play a MOBA that's also a grindfest",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the fast paced gameplay and not having to be so committed to a match for almost an hour like other moba's, plus all the animations make it so fun to play as my favorite characters from dragon ball.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although I sometimes enjoy the game, it gives me a feeling that this is a relatively quick cash grab for Bandai Namco that is meant to sponsor some of their other games. It does not feel like a work of love but rather as a game the studio had to do for the sake of getting a game out there that has the name Dragon Ball in it. This can be a fun game (when matching is done right) but it certainly doesn't feel like a game you want to spend several hours in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game, only issue that many characters are behind pay wall for around 50 days till next season release and progression system or cosmetics and getting new characters is very grinding to boredom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easy to understand, but grinding for materials takes too long",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game' it dosen't have the best score because these kind of games always get this score, simply because some people like this format and some don't, if you like it you will have a great time with this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the gek. the gek has taken over my life as the only game i have played for the past 2 months tahnk u bandai namco for makign this game f2p and i hope u include more microtransactions in the future",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Demasiado bueno para pasar el rato,es muy entretenido y la variedad de personajes y con mecánicas diferentes lo hace mejor aun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the more fun MOBAs where just about every character is fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "spiel macht dein kopfkaputt gotenks ist zu broken p2w ist auch ein geisteskrankes problem in dem spiel.\nSonst macht es spaß mit freunden.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good things:\n-Cool artsytle\n-Okay-ish gameplay\n-fun with friends\n-Various character picks\n\nBad things:\n-Fun with friends (if you play with randoms its always a 50/50\n-Some characters are very meta than others\n\nOverall, its fun and isn't really that bad. It's better to play the game with friends than randoms. So i would give it a hard 7.4/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has never made me as much as any other game turn myself into a female. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to jump on with 3 buddies and just spend a few hours playing while talking about ZB in general.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love DB MOBA its last thing we needed in DB games genre (we have already DBD DB we have tones of fighting DB games card game and now MOBA even probably we gonna have survival in DB universe if it goes this way xD) still love how simple everything is not much to read or think and logical , easy to learn hard to master of course\nonly problem that game has is poor matchmaking and lack of better communication (if chat would exist there i suppose it would start to be wars on chat due to \"you took my character you fa-..\" etc) and characters sometimes feel weak but still looking forward what characters will be added animations of finishing etc love devs for giving us many things on start itself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Regardless of the mixed reviews it has, this game is extremely fun and out of other games in this genre, best 1!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun MOBA with its own twist. Though some characters like gotenks and ssj4 vegeta do feel a notch above others at the time of this post.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and not too ptw. good for a ftp game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After getting to S in all roles last season i genuinely think this is a super fun game that everyone should give a shot (its free you lose nothing). \nThat does not mean its without issues though. The queue wait times are absurdly long after C rank, THE BOTS IN RANKED QUEUE (need to be removed asap), and the lack of punishment for AFK/ disconnecting players. These are the major issues the devs have to work through as they are proper irritating and ruin the fun.\n\nAll the charcters feel good, the map works well and the general gameplay flow is quick and super fighting focused all things you would want for a Dragon ball MOBA. \n\nDefinitely worth a giving a go with some friends, otherwise the solo-queue experience is as bad as every other moba ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible game! Some bugs here and there, but not enough to hinder the experience and they usually get fixed within a week of discovery. The new content gets released so quickly that it feels like there is always a new character or assist or game mode to try out. The developers have been very receptive of community feedback and have been balancing the characters accordingly to make the game feel fair and keep 90% of the characters viable at any level of play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but there is some problems, getting new characters is too hard and breaks balance in the game due to having to either grind the hell out of the game or pay for them which leads to incredibly unfair matches where the enemy team has the newest characters but the other doesn't and it becomes a free match for the others.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a awful game with corporate greed all over it, most notably the star system. and the lead devs don't care for player input., \r\n\r\nbut it made me smile. \r\n\r\n\r\nWhat made me smile - ( https://medal.tv/games/dragon-ball-gekishin-squadra-em/clips/lxBaUAkqNRes4gUP7?invite=cr-MSw5dGksMjEyMzUzMTYz&v=36 )",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game its fun and looks good, but it crashes a lot!, my brother could not even complete a match, for him, it crashes everytime!, if fixed, I would change my review because it has potential, but right now, I can't recommend.\n\nPLEASE, FIX THE CONSTANT CRASHES DEVS.\n\nUpdate: since last patch, game is not crashing anymore, so now I recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely don't understand how this game only has \"mixed\" reviews. I think it's an all around great game, especially for free. Yes, there's an in-game currency that you can purchase to speed up character unlocks, but I don't really understand everyone's hang up on that. I've played about 50 matches or so thus far and have maybe only run into few disconnects and a couple people AFK. Aside from that it's been smooth sailing and quite enjoyable. \n\nIf you even moderately like MOBAs and you enjoy Dragon Ball, this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It feels fresh and you understand everything your getting out of it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love thıs game even if the only characters you'll face and lose to are gokus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Comes with WASD has great animations. Game just needs more heros. Great game but BALANCE and MATCHMAKING are always an issue, probs drop this when LoL gets WASD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is pretty fun\n\nI don't have anything bad to say about this game because it was made well. the only thing I could say that is bad is the wait queue. if you are trying to play any other gamemode it will take you at least 5 mins to join a game. other than that this game is well made and I have nothing negative too say because, this game was free. So I can't really say anything too negative. pretty good game in my opinion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People love to review bomb a game and then complain that nobody is playing it. The gameplay is fantastic, the matches are quick and fun, and the characters feel lore-accurate and flavorful. All of the complaints revolve around superficial stuff, like character unlocks and matchmaking. If you want to make this game into league of legends, it won't work out for you. But if you want a big dragon ball slapfest? Try it out! Hell, it's free, you might just like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the gameplay is super fun and the gacha system is pretty good compared to dokkan or legends. However, I think the main problem with the game is how you unlock the newest characters (excluding launch characters). Theres two ways to unlock them. Buy them from the shop for 6$ or wait until NEXT SEASON to unlock them for free. By then, the op new character (ss3 goku) will get nerfed and become unusable. In a nutshell, PLEASE TOSHI MAKE IT SO WHERE U CAN GET CHARACTERS FOR FREE at least not until the next season after they launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Business model for unlocking characters is shit but it's a really fun game. I guess F2P games have to make money somehow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really enjoying and hope they continue to fix issues and give a larger test hero pool for people.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and very addictive, but has some issues:\n\n1 - the player base is toxic: dude its a fucking moba with dragon ball fans of course its gonna be toxic\n\n2 - some characters are p2w: while the paid characters (mainly toppo) have solid counters, it still feels somewhat scummy to lock them behind a forced paywall to people who cant afford them. this can be resolved by putting the newer characters in the free trial rotation, or eventually increase the star road levels to enable them being unlocked, while still very grindy as the star system is a lil ass, it makes up for it as the game is somewhat enjoying and fun to play.\nand while this game has cons, it does have its pros\nthe game is very balanced, while most characters (even the paid ones) seem like fun options, the game comes with a diverse cast that can mold into your play style, and even mold around a teams play style (except bojack he sucks ass lmao)\nthe only form of gacha is entirely cosmetic, providing no ample advantage for someone who wasted 300 dollars (me) for an intro they probably didnt get. while still asking for money (albeit in a slight greedy sense) the game prefers you to get one time, permanent game play additions, instead of promoting gambling to get certain characters.\n\nthe game is very fun, and VERY addictive. i didnt realize i hit like 50 hours withing like my first month of this game till i checked recently, worth giving a shot if youre interested, but only if youre interested, since this is a moba, a genre of games that most people are turned off by.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "This game is fire, it controls great, the characters are great, and the map and progression and abilities are great. Everything else is abysmal shite. Constant connection issues, AFK, Leavers, the non stop re queueing, the BOTS, lack of grindable currency, reporting does nothing, ranking is fake, insane wait times, constant crashing on mobile, and an idiotic player base. This game needs a lot of fixes, but it won’t happen because this is a dragonball game. It will die soon and there’s nothing we can do abt it. What a shame and waste of talent and passion.",
      "voted_up": false,
      "votes_helpful": 137
    },
    {
      "review": "Just gonna list out points that annoy me about this game (I was S rank in every role btw so i played the game enough):\n\nConnection issues at launch all the way to halfway through season 1 (which is the second ranked season). This is purely due to poor optimization and bad servers. \n\nGreedy F2P monetization model that barely rewards you with premium currency (10 gems a week when a single new character costs 250, i earned 165 gems total playing since launch including events.)\n\nStar collection progression system actively punishes long term players from playing the game, if you were playing since launch with the current changes you basically overpaid for every single hero you unlocked which at a minimum is at least 250 gems in value (which is only counting the change at level 31 where you can now unlock season 1 characters)\n\nThey changed it very recently due to backlash but it was intended by the devs that you would never be able to unlock a newly released character through the star collection system only the previous season's characters.\n\nHero levelling costs are exponential and you earn a minimal amount of zeni (which is the standard non-premium currency you use in games to upgrade stuff) which means the longer you play the harder it is to earn levels in the star collection, levels 1-109 is the same as level 109-119.\n\nNew characters feel extremely overtuned and SSJ4 vegeta seems like a massive overreaction to SSJ3 goku and shows how the devs will be making new characters going forward. Oh what a coincidence they nerfed season 1 characters right as season 2 came out.\n\nEvery season i've played this game the devs have found innovative new ways to make the game actively worse for F2P players and active players (which makes no sense in a live service game)\n\nDon't play this trash, it's not even as fun as pokemon unite, scoring or backcapping isnt really a viable option in this game it feels more like a diet version of league of legends. Only thing you can do in this game is play defensively and go for objectives because everything else is too risky. Towers dont matter as long as you have one up and deaths/xp dont matter 90% of the time either.\n\nDragon ball fans that want to glaze the game because \"they need to make money\" need not comment because literally every other F2P game figured it out decades ago. The devs here are just extraordinarily greedy.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Game is nothing but bots. Team mates would just go in and tower dive while tower has barrier up. After I did a surrender vote on a close game(We taken down 2 towers and they only gotten 1 and we had 2 bosses and they had none) and it was voted yes, I had an idea to test surrender votes on they next few games. They next 6 games, we(wait just \"I\" since they were all bots) was winning the next 6 games and I did a surrender vote on all 6 games and all 6 games was agreed to surrender. Prob bots just agreeing to your surrender since they are all bots... No REAL player would surrender a winning game... As in they had 1 tower left before their Dragon Ball Shell. All we had to do was destroy 1 more tower then get the Dragon Ball Shell and game over. No REAL player would surrender that and 6 games in a row did that? Yeah all bots.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "Short answer: After playing for over 300 hours at this point as an S rank in all roles and experimented with most characters (exluding android 18 and the gammas because the star road system is nonsense), I dont recommend this game at all in this state.\n\nExplanation: This is my first moba game as a dragon ball fan! However I can safely say that this game is not something I would recommend to anyone at the current state its in with the busted payed characters and lack of *real* f2p currency. Terrible matchmaking mixing both premade teams and solo queues together. The divine draws and cards doing a terrible job at changing up the gameplay due to a \"meta\" card build and golden cell jr matches killing alot of the natural progression to level up and the rng factor of where the golden cell jr's spawn, while most of the starting divine draws do nothing to actually change the gameplay of matches. I do find the game fun to a certain point, however the game will not succeed if the devs continue to have a casual mindset to the game, team games like mobas need to have competitivenes in mind as the standard. Any other genre is fine for the usual dragon ball casual fun but that development process will end up killing this game specifically due to payed players having the best characters in the game without letting free players get them as soon as they come out. No real blame towards the devs as I think its just the usual greed of Bandai Namco to make characters like ssj3 goku, gotenks impossibly good and to some extent toppo too, just so players get this fomo need to get the character so they can win matches more.",
      "voted_up": false,
      "votes_helpful": 34
    },
    {
      "review": "any game developed by Toshi is a horrid mess, and this game is no exception. terrible matchmaking, greedy design philosophy's, and overall not worth your time if you want an enjoyable dragonball experience. game actively does it's best to punish you for being good at it, where as worse players get rewarded for their incapabillities. playing with friends is pointless, because you can only do quickplay with them unless you're all the same or similar ranks, unless you want to get thrashed by matchmaking putting your lower rank buddies against your highest ranked teammates rank. The added characters don't go free until the next season, where they'll likely be nerfed, incintivizing you to buy them while they are still broken and oppressive. and after a certain point you basically have to buy your missing characters outright, because Zeni is essentially unfarmable even though it's the F2P way to unlock stars for your characters.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Pay to win characters that are much stronger than others and can only be bought, bots in ranked matches, no anti-cheat, no punishment for leaving games, teams of 4 can queue up against solo players, no grindable currency, predatory monetization with overpriced skins.\n\nA character/skin is 350 Gems, you can either buy 250 for 8 bucks or 70 for 2.50. So you either spend 16 bucks and overshoot by 150, or you get 2x70+ 250, overshoot by 40 and spend 13 bucks for a skin that doesn't even have unique animations.\n\nWe've already seen where this ship is heading with games like ASURAJANG and Supervive. It's gonna be dead within 6 months to a year, and deservedly so.\n\nUpdate: More sneaky sh*t. There's a type of currency called \"Hero Memories\" which is used to level up your characters, the higher the level, the more you need, exponentially: lvl1 is 30, lvl2 is 100, lvl3 is 900 and so on.\n\nI just noticed that I was getting 40-50 per match in the first few hours of the game, now I need 5000 for the next level and I'm getting random numbers between 3-6, and the character/s i get it for is randomized, not even the one i'm playing. That's hundreds of games for a single level. And it's not tied to performance either, same numbers even winning as MVP.\n\nYeah, I'm done. Stay the hell away from this.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I've played this game a lot now and it definitetly scratches that Dragon Ball itch. I have reached S on all three roles and played every character extensively but I just can't recommend this game. The matchmaking is horrendous and their isn't a good way to communicate with the bots on your team (real or not). The gacha doesn't effect the game so that's not too bad but the P2P new release heroes is pretty unfair and predatory. Gonna still play the game because it for sure has potential to be a great game I just hope they make it into the game that it could be.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't usually type reviews but i gotta say this.\n\nThe game goes smooth and wonderful af, but i hate the matchmaking.\nThere's no way in the world that literally every single time i don't go tank my team does absolutely nothing, 15 loses in a row because no one knows how to defend nor take objectives or basically play as a team,\n\nI love the game but the matchmaking makes it impossible for me to put a good review, sorry",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game ate my dragon gems, and gave me nothing to show for it.  Messaged support and they told me they cant tell me what the gems were spent on. And refuse to refund due to the issue.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "EVERY single revive machine game there's a chance for my entire game to crash as soon as someone dies; It always happens right as a revive machine is supposed to spawn.\r\n\r\nYou have a tournament in 2 weeks, fix your game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b] Not Recommended (Solo Queue Ranked) [/b]\n\n\nGekishin Squadra has solid gameplay mechanics and can be genuinely fun... when matchmaking works. Unfortunately, that’s rare.\n\nRanked solo queue is a mess. One match you’re teamed with competent players, the next you’re stuck with teammates who ignore objectives, don’t understand their roles, or rage after a single misplay. Meanwhile, the enemy team feels like a coordinated squad with perfect target focus and map awareness.\n\nAdd in AFKers, ping spammers, and trolls who throw games over petty drama, and it becomes a frustrating grind. The reward system doesn’t justify the effort, making it hard to stay motivated.\n\nTo make matters worse, pay-to-win mechanics are deeply embedded. Sure, you can grind gems to unlock characters, but the process is painfully slow and time-gated. Events that award gems are limited, and realistically, you can expect to unlock a new Z-tier character maybe once a year as a free-to-play player. Meanwhile, premium characters like SSJ3 Goku are blatantly overpowered, dominating the meta and making competitive progression feel hopeless unless you pay up.\n\nUntil proper matchmaking is implemented, solo queue toxicity is addressed, and the monetization model is rebalanced, I can’t recommend this game in good faith.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is riddled with bots. Ranks are mixed, S rank can play with D ranks. Player base is the most brain-dead across all mobas, that's something. Ranked game mode is called Standard, and normal mode is Quick mode. You have to complete the Tutorial missions in Ranked mode, where you unlock crucial game mechanics (divine combo cards, imagine you have to play ranked in lol to unlock the option to buy items). After you griefed your team in ranked for 5 times you unlock Quick play that is the casual unranked mode. At this point my brain already melted from this genius game design. The game doesn't have text or voice chat, so have fun using the Ping system that is unmutable so trolls can abuse it. I repeat, the pings are unmutable, imagine that. You cannot try out characters in Training mode before spending real life money on it. There is a game mode where extremely important huge xp boost monsters spawn randomly, when these spawn closer to the enemy team they can easily get 2-3 extra levels, your game is practically ended over RNG bs.  There are Random NPC comic panel like effects that cover half of your screen while fighting, and you can't turn those off, enjoy not seeing the game. There are no comeback mechanics, \"Towers\" won't spawn back, the game is a big snowball fest. This game could be extremely good if the developers would care about it. Probably will die under a year.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "PERMANENT CRASHING in almost every second match since season 2. The game is almost fully P2W now and this new update to the rank system basically punishes you for playing the game. New players can get a new character from last season but older players who pasted the rank just miss out entirely. This game is designed around money first, second and third with players just being an afterthought.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's funny, but because of the kids who are obsessed with the power of Dragon Ball characters and the like them, channels like Death Battle still defame the name of normal anime characters, and not just anime.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game was flawed yet fun until P2W characters were added, now its just a dumpster fire of a cash grab.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is not balanced is any way shape or form. There are certain combos of characters that are a garneted win due to over whelming damage or near infinite health its was fun for a bit but now people have sniffed out the problem characters so its all you will see. Unless there are major changes don't play this game. If you want a MOBA play LOL, Dota, or even Pokémon Unite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game crashes sometimes in group battles when I play bojack idk why xd",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its not fun with P2w i playing my matches and i always see super saiyan 3 and 17 melting my health like a blowtorch its not fun to fight this man bandi fix this now this game is at 1000 players it went from one millon to 1000!!!!! players are we dead***  im not excited for season 2 next thing you know they are dropping a damage dealer that can counter attacks entirly and one shot your health dam this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its Trash\n\nMoney grabbing, Bot infested shit show. Had my fun for a couple of hours til realization started to manifest.\n\nIts trash, like every Dragon Ball game before. they just cant get it right. Bandai Nibbas",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "kinda fun at first, goku ss3 is super pay to win, all the casual players are gone now, just the try hards left",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No report function or auto detection for players that go afk or feed. \nPeople can refuse to ready up for a game without penalty.\n\nCharacters are unbalanced, when trying to play for fun you'll constantly run into the same utterly broken character that literally sucks the life out of you when you're trying to diversify and use the characters you enjoy. \n\nGame NEEDS a report function, get these guys who throw fits and afk out.\nGame NEEDS an avoid function, allow us to not get queued with sister Rebecca's dumbass child that can't play the game 5x over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It started out great, it felt good, it played well, BUT then it had so many bad elements that ruin the game and trust me there's a lot.\n\nLast drop for me was bots, many have noticed it already, the game is infested with bots, but for me bots totally ruined my experience when I destroyed 3/4 gods of destruction by myself and then the dragon shell, all that was left was to pick up the dragon ball and my team would have won, but then I died to the last living member of the enemy team. 3 other team members were right there next to that dragon ball free to pick it up, but no one did, because bots are programmed to make the real players feel good, so they do not pick up the dragon ball. So I was just left there screaming at the screen for 30 seconds for anyone to pick up the ball. I now have ZERO interest in playing this game, I'm not even going to finish the battle pass that I bought.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Difficult to play, There is no way to communicate with teammates.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bamco runs another promising title into the ground by ignoring customer feedback and pushing disgusting monetization, The base gameplay has a lot of potential, but this game will be in EOS by the end os 2026, Bacmo will milk ever drop of money out of the quickly dwindling playerbse over the next year and then close the game servers like every other cash grab title of the 2020's",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Incredibly fun game at its core bogged down by the fact that Toshi is on it. Predictable monetization of p2w characters locked behind money for 2-3 months of a season, then nerfed as soon as they're available to everyone else. Then after that they somehow made it worse and added that if you're above Star Level 31 (the progression system for unlocking characters), you won't be able to get the previous season characters until like Level 110 (VERY expensive and the ONLY MOBA that has a system like this!!).\n\nThe treatment of Dragon Ball in recent years has been depressing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's a lot to say about micro-transactions that others have talked about in other reviews. However, I won't bore you with the same speech and explanation.\n\nIf you are a Dragon Ball enthusiast, I think there are other Dragon Ball games that are simply better to play than this one. If you enjoy MOBAs, there are other MOBAs both on PC and phone that I think are far superior to this one. I can't recommend this game unless you really want a Dragon Ball MOBA to play. If that was the case, though, I think you'd already be playing. It is free, after all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is fun and I like it a lot, characters are diverse enough and good choice of characters but the game hard crashes my pc randomly and I cant figure out why. So until its fixed I can no longer play this game nor recommend it to anyone.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is just paid to win no skill is needed ssj3 and toppo are just brain dead the take no effort whats so ever the game needs to nerf them or make it so u can only play with ppl who have them. if they made it so u can even get them if u were f2p then there will be no issue but due to them locking them behide a 250 gems the most i have gotten so far is 85 i have 30+ hours is crazy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't play game, they have serious balancing issues and hit registration issue basically playing a game of fucking luck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I quit this game after only a little over a month and I do not miss it. New releases are paywalled for an eternity, there are very few rewards for winning/ranking up, queues take forever to get a game, and the game will sometimes crash mid-match and then count it as a loss anyway after making me wait 15 minutes for the game to finish. Solo queue is not fun at all because I almost never get paired with competent teammates. In addition, the roster is very unbalanced with several characters being overtuned to the point that a good portion of the roster isn't even playable. Finally, the screen will turn a greenish color and make it hard to tell what's going on. This is by far the worst MOBA I've played.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is horrible, every single thing is locked behind a paywall. its not worth investing to. after putting so much money im still locked behind so many more paywalls because any form of content is pay or walk away.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Flawed but very fun gameplay. \n\nBiggest issue is monetization. The game dev director wants\n1. Battlepass subscriptions\n2. Gacha money \n3. Premium Skin sales\n4. Character sales\n\nUnlocking a good amount of characters for free isnt too hard, but be warned that if we're going by season 1's total in game currency received so far, you will likely only be unlocking one or two characters AT MOST every 2 months (one season) once you reach around account level 50. Playing more will not help as you are not awarded currency per game. \n\nNot to mention, even if you're okay with the monetization, there is a concerning pattern to their character balancing. So far, besides the new characters, the old characters who were buffed coincidentally received new cosmetics to pay for in the same patch. \n\nDoes this mean a character like Bojack who is pretty much widely agreed to be THE WORST character will only be fixed when they have something to sell like a costume or gacha animations? \n\nWouldve been a fun casual MOBA but if you're going into this, I wouldn't get too invested, they are clearly milking this for all they can.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix the matchmaking PLEASE. Why do I have all bot teammates and they have 2-3 real players what the f***. Also this game is so desperate for your credit card, f2p is a joke. Stay away from this game until they fix these issues.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bastards made the game P2W. And if your are new you get the new busted characters. If you been playing and then didnt get the busted characters, shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game can be really fun especially if you're a dragonball fan but this game has WAY to many problems right now that hold it back.\nThe worst part is the matchmaking even at top rank (s rank) the matches are super inconsistent. half your games will have bots in them that do nothing and the other half you'll get teammates who look like they've never played a game in there life even in s rank.\nYou get punished for team fights more than you are rewarded. anytime there is a team fight in almost any game you'll have at least one enemy who will try and back door your towers to win and your teammates will not have the brain power to defend so you will have to defend but then your not so good teammates will do nothing you'll have 20 kills and the rest of your team will collectively have 3 so either you sit in your tower and pray your teammates can do something or rush there towers and try and kill there towers before yours.\nThis game has its moments but you'll only have 1 out of every 20 games be a an close and fun game even if you lose. if you play with friends this game is alot more fun but good luck trying to get them to play for any meaningful amount of time this game has a lot of potential but needs alot of work i didint even touch the surface of all the problems this game has.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a piece of trash , i'm very sorry to say so, it's like they got defense of the ancients and league of legends and some other similar games , and they came up with this one. Not a bad idea, but it's just the same as other games, not fun for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "AFKers, bots and snowbally games. If you are into that kind of stuff then for sure try this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Horrible team play, crashing 3 times a game it's not worth spending any type of time playing this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not the best moba in my opinion but overall fun. I do wish they fix the balancing and currency on these characters because they are pay to win. I think it's best not to recommend this game to others until they stop locking new characters behind a paywall. It's also impossible to reach the currency on these characters because we have to do these mission weekly and they give small amount like 10 gems. It's insane of how they handle this game poorly. It's pay to win but also fun, if they remove that then it will be more fun. Btw i played it on mobile more.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun and it works well.  the characters are great, and the map and progression and abilities are great.  THE NEW CHARACTERS ARE LOCKED BEHING A PAYWALL AND THAT IS NOT COOL.My biggest issue with the game is  the non stop re queueing for matches. It is annoying . Games are also filled with BOTS . There is not a easy way to grind currency and the ranking system is fake since you always win rank even if you loose and s**k like me at the game. This game needs a lot of fixes, but it won’t happen because this is a dragonball game. It will die soon and there’s nothing we can do about it and that is sad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute dog-shit, every match has one or two bots on our team. No shot at winning, period, when one of your teammates just mashes their face into a god of Destro that's up (no zeno) and dies, Repeatedly. The music is nice but the game itself is tilting as fuck. Also not a fan of how new heroes are basically 10 euro's, that's taking the piss.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is great and i like this compared to other mobas but if your a F2P person like me then some things like unlocks and getting characters could be worrisome in the future especially with how the way they done things this current season which is season 2 hopefully things get better they already removed the golden cell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is one of those games that makes me wish steam review has a \"Neutral\" option as I'm extremely mixed about it.\n\n-The goods: \n+The graphic is decent but the character models are very pretty, animations are crispy and very satisfying to watch.\n+As a solo-queue player the gameplay at it's core is fun, as it is a very VERY simplified version of the MOBA genre even without comparing it to the big ones like League or Dota or smaller ones like Arena of Valor or Mobile Legends.\n+To continue with the point above, matches are fast and I really enjoy them being like this instead them being able to last from 15 minutes to hours like alot of MOBAs.\n\n-The horrible horrible parts:\n+To start it off, the game is so grindy for absolutely no reason as if the devs are scared of Bandai executing them for giving us more zeni and gems. The star system even with the recent changes to make paid characters f2p still sucks, the shortage of zeni only adds to the problem, it feels as if the system is there to not only punish f2p players but also people who have been playing this game for a long time. It needs to be changed for the sake of both players and the game itself.\n+Ranked matches are filled with bots that do nothing but feed kills to the enemy team, there're times I would be in a team with 3 bots fighting against 4 humans. I don't get why they thought this was a good idea in the first place, it just makes the game unfair especially when you're playing as a tank or a support character since even if you are at an advantage, it's nigh impossible to win against actual humans when the bots don't even know what to do aside from dying. Simple solution is to just fully remove them, I know people are willing to wait longer if it means they have a chance of getting human teammates.\n+Connection issues as well as crashes started happening alot more after season 2 update and haven't been fixed yet, your game can crash multiple times during a match for no reason and it's very frustrating trying to play the game recently with this connection issue.\n\nThe game has alot to improve and I really hope the devs listen more to the community because if things continue the same way it might not even last as long as Dragon Ball the Breakers or hell even Sparking Zero.\nEdit: Use the official Gekishin discord server and give them your feedbacks there, they DO hear us.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "90% Your teammates will be bots. Go in expecting to lose a LOT of your matches due to having an AI for all 3 teammates",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "may not play it all the time, but its a good game. there are many flaws and nitpicks though. if they can fix those, this game will go from a mixed review to at least mostly positive.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only give it a shot if you have buddies that are into dragon ball.\nControls are awful even for a mobile port, every system is half-assed and there's just not that much to do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game was kind of annoying lots of bots , afk players ruin the gameplay online.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New characters are always broken and the devs never balance them before the characters become ftp. only after they become ftp then they get hard nerfed and are almost unuseable. It sucks to be ftp in this MOBA compared to every other MOBA. don't give the devs a cent and force them to make the game more ftp friendly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Maybe in a game where a new character comes out every 2 weeks, you could monetize the cosmetics instead of making the characters unattainable after a certain point and bloating all the already horrible star character pools that you can't even get past the high double digits. \n\nI'll become a whale and all will be forgiven if you make Launch or Mercenary Tao a full character though lmao",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it needs a lot more to be a real game, this game feels like unfinished project more then full game LOL, it keep crashing, there is no chat, you can't see your friend in the lobby, it is way too simple,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "During revive matches your game will crash, this is almost garanteed.\nYour game has a chance to crash in a lobby.\nClicking \"P\" during preparation of the match will shut down the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I think this is a really solid game personally, its fun and addictive and a bit challenging to get the hang of once you get to the right tier. However with that being said, the amount of afkers/leavers/griefers in this game is unreal. That and the level gap can get pretty wide really fast, additionally speaking there are sometimes that you literally just cannot defend your tower no matter what you do which can be a little rough at times. Sometimes attacks stop the burst sometimes they don't, its really confusing at times on how you're supposed to protect your tower from being absolutely slaughtered. \r\n\r\nAdditionally I think my biggest complaint is that you can fight however hard you want in the end game but if they get through your dragon shell (Which has literally no health btw), good luck stopping them. There's almost no way in hell to come back from that point and genuinely it feels pointless to try. That's why I gotta give it a non recommendation, despite all this I think they have a good thing going; just a few fixes and I think it'd be absolutely worth trying. Even now I believe it is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "personally i only have fun playing competitive games when i am in close matches that feel fair. and good luck ever getting one of those in this game without no-lifeing it, because your rank gets reset every 60 days and you have an individual rank for each of the 3 character types so you're basically stuck in scrubtown for hours upon hours upon hours and can't even count on win streaks to boost you up because of how frequent AFKers and feeders are in this. maybe if you only ever play with a group of 3 friends, because would you believe that this moba community is also pretty toxic and obnoxious?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun, but has an extremely predatory gacha system. I bought the gems package, and got the same legendary 4 times in a row. Why would you give the same items with paid currency? That's messed up.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Really fun but ranked is filled with bots, and these bots are TERRIBLE. The bots prioritise the wrong objectives at the wrong times, only use their skills to get into fights and never to run away, and push into fights until they're at a quarter of their health, feeding constantly. It's to the point where if you aren't high in the ranks you'll be playing with 2 or more bots on your team. Climbing rank in anything other then the higher ranks isn't about skill but choosing the characters and builds to take the most advantage of the feeding bots before your bots feed them in turn. The only modes where you can be guaranteed to play with a full team of real players against a full team of real players are the party game modes that cycle every 4 days because they couldn't be bothered to code the AI for them.\n\nAs for the other flaws, the game is a free to play mobile game so the monetization and progression are pretty much what you'd expect. You can get a good amount of the roster for free early on (for perspective, I have 40 hours as of writing this and have 16 characters unlocked) but after the honey moon period it slows drastically. If you're waiting for any particular character that isn't already in the f2p roster you might as well wait until they're added to play, since progressing too early means you'll have a way harder time actually unlocking them. Cosmetics are gacha and shop exclusive and the free pulls are very limited so if you care about cosmetics you'll need to gamble for them or spend money on the handful in the shop.\n\nThe game is also super casual focused which I don't mind much but it means that even ranked involves party game style match events called \"Divine Draws\" which can vary from minor gameplay changes to ridiculous gameplay defining mechanic additions. There's also a lot of players who are new to moba's and don't know what they're doing, not big issues for me but I know more diehard competitive minded players will find these frustrating.\n\nIt's fun but it's clear what angle they're going for so if you don't like what you see you're probably not going to enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun for like the 4 days it lasted until releasing paid only characters",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is good per se, but the system around it suffers from one too many problems... because of this, the game becomes frustrating and borderline anti-fun.\n\n1) Playing in comp and solo players:\nThere is no in-game way to show you're in a comp with a friend (like a little sticker next to your name for example), meaning that sometimes, a third player will want to go in the same lane as you and your friend, and will absolutely not want to move, thinking \"I was there first\" when you just want to play with your friend on the same lane as a DPS and a Tank for example. You're bound to mass spam the same emote with your friend to try and make him understand you're with your friend so that he can leave. It becomes an ego battle for this third player and because of that, he will most likely not go away.\n\n2) Innactivity and forfeiting: \nThe game doesn't compensate you for losing due to innactive teammates, which gets increasingly frustrating because some players will just call a vote to forfeit the game as soon as they think the game is lost, when in general, it is very much salvageable. If you decide not to forfeit because you still WANNA PLAY THE GAME, those petty players will just stop being useful, purposefully losing the game so that you can vote to forfeit next time. It is very annoying because it happens more the higher ranks you get, and the game never compensate for those. I'm sure it is possible to make it detectable by the game when someone sells on purpose. Those types of players are what massively kills the game because there is no way to account for their behavior and they quite literally control the flow of the game. People, if you act this way, please, just stop playing the game, as you are seemingly too easy to trigger. You are an active liability for us players who want to play till the end.\n\n3) lack of feedback when reporting:\nThis ties in to this next problem. When you report people for their behavior, you don't have any feedback from the game whether they get punished or not. You also don't know if it prevents or lowers the chance you will get paired with them in future matches. All this makes the player feels like they're screaming into the void. It feels useless. Game to player feedback is one if not the most important aspect that can make or break the fun of the game.\n\n4) The dreaded golden Cell Jr divine card:\nEach match, two \"rules\" will be randomly selected to spice up the game. They generally are interesting as it makes you play differently and strategize in quite unique ways. But amongst those rules there is one that everyone hates. The golden Cell Jrs. When this rule is selected, golden cell jrs will randomly spawn during the match. Their location and number are quite random. They can appear near your team's territory or your enemies' or both at the same time. Upon killing them, you instantly get enough XP to level up, giving you the occasion to level up your skills at the same time. And this is where it goes wrong. They tend to appear after the first fight happened in the middle of the arena, which means that the winning side, which already got exp from winning their battle, also gets to kill the Cell Jr and level up once more. Because of the travel time from spawn to middle, the winning team has enough time to farm cpus in mid.\n\nThis situation happens EVERYTIME this rule is applied. And because of that, right at the start of the match a team can be 2 or even 3 levels ahead of you, virtually making it impossible to come back. Since you also upgrade skills by levelling up, you end up having way more firepower than your enemies, while also having more HP and attack stats. It becomes one sided very fast, right at the beginning. It kills the fun for everyone, this rule needs to be removed...\n\n5) Unfortunately pay to win:\nSome Characters cannot be unlocked without paying real money, effectively locking them away from players who do not want to spend money in an online game. The problem is that those characters are way too strong to incentivize you to pay to unlock and play them. the biggest problem is Goku SSJ3. He has the ability to teleport to a teammate OR an enemy if he's visible on the map, and can instantly fire a charged kamehameha. If you didn't guess it by now, the kamehameha is extremely powerful, able to kill you at full HP if leveled up enough times. And if it wasn't enough, he can adjust the angle of the beam while firing, which means if you get hit by it, you can most likely not even avoid taking further damage as the opponent just has to follow your character. Because of that, you can't properly pick fights that you can win because at any moment, goku could just instantly teleport to you to kill you, effectively transforming a 1v1 into a 2v1 or a 2v2 into a 3v2. The skill is so powerful that in a 4v4 this skill can kill an entire team if they're stacked together. His ultimate attack, dragon fist, is also extremely powerful, has a wide range, and fires too fast to react to in most cases.\n\nAnyway, they know he is way too strong, but they don't care, because they want you to spend money to buy him. he will be nerfed next season when he gets available to free to play players I'm sure, but he will get replaced by a new pay to win character for the new season that you can't unlock without money.\n\n6) The lack of progression:\nAt first, you'll unlock characters like crazy, even upgrade their little figures which makes you progress on the general star level of the game. But when you finish doing all the season missions the game gives you, there is actually no way to keep getting enough Zeni to further upgrade character figures. And this prevents you from levelling up your star level, which in turn, prevents you from unlocking new characters. Your progression is quite literally finite and you can't progress any further until the game says otherwise.\n\nAll this makes for a terribly unfun context when you want to have fun with friends.\nIt's very sad because otherwise, the game is fun, the characters are enjoyable to play, and quite diverse...\n\nI can only recommand Bendai Namco to make those changes, and rethink the monetization of their game to not disgust free to play players from playing their game. Make the skins pay to earn, it's way better than locking good characters away from players...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is straight p2w buns get those mickey mouse gamemodes out of the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible pay to win game that actively discourages you from playing it\n\nalso half the time you're playing pretend by getting matched up with bots\n\nalso you cannot find a match for the side gamemodes, so the game is also dead when there's no bots",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has incredible potential, but the server performance is a major letdown. When I say the servers are bad, I mean unplayably bad. Lag and instability ruin the experience, especially when using a controller—character targeting becomes erratic, often prioritizing minions over actual players.\nBalance issues are also glaring. For example, equipping the speed-boost card makes you virtually untouchable. No attacks land, turning the match into a one-sided sprint. This mechanic breaks competitive integrity and needs urgent rebalancing.\nIf the developers can fix the servers and address these gameplay exploits, this could truly be a standout title.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After the update if you are past star level 30 you can't get the old units until star level 100+ MAKE IT SO THAT PEOPLE OVER STAR LEVEL 30+ CAN GET THEM AND IT Is ALSO ANNOYING TO FACE PAY2WIN  PEOPLE!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I'm not good writing reviews, so I recommend you take a look at the negative reviews from other users, as they say everything I think about this game and my experience with it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Honestly was a fun game but developers choose the wrong direction for this game, making unlocking new characters pretty much impossible without spending money doesn't fit MOBA game at all",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "An incredibly terrible way to unlock new heroes in this game and every new character release has been broken patches take forever and barely touch the problem characters most of the time. Heavy p2w and bots in all but the 2 highest ranks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "-Toshi was involved in this game which explains why the grind for gems & zenni is as slow & minimal as an IV drip...\n\n-Report system doesn't work, it's just there to give people a false sense of security.. There's also no feedback message letting you know the person you reported was dealt with or didn't cause any offenses.\n\n-Game went from 13k players to like 1k in a couple months which is telling...\n\n-No vs AI mode...\n\n-Auto Pick cards and skills should have been a feature where you can pre-pick the skills and cards you want leveled up and what order\n\n-No penalty \"timeout\" for players who repeatedly let the join match timer run out. same for the afkers/leavers, a lot of folk claim the majority of leavers have connection issues but the people I come across I think are just force closing the game as the \"disconnect\" always seems to happen when someone is in a lane they wanna be in, we're losing or someone picked their favorite character)\n\n-No option to leave the Win/Lose screen early so you don't have to sit through the Victory animaton &\"MVP\"screens cuz I'm sure new players do NOT want to be forced to sit there and watch the game glaze the enemy team that stomped them... I don't rule out things like this cause many players to quit especially how quick the player base dropped.\n-Hot take: I think \"Sweats\" contributed to ruining this very casual competitive game by causing new players to quit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "afkers throwers  every  frigging match  and the funny thing is some of these bozos spent money on ssj4 just to do that lmfaooo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Player keep afk when dead and there is no consequence to do that. And unbalance champion, the attack is auto lock and frieza can summon minion so he just stand near minion and being immortal",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Paying for each new character is going to be very expensive. It's a joke. It's a shame, the game could have been fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game Devs, i formally ask you to please add GameChat so that I may congratulate my teammates for the wonderful victories we conquer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1. Pay to win\r\n2. Bunch of bots\r\n3. So many players trolls every matches\r\n4. Worst ranking system\r\n5. Trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1 person can 4v1 hostage a moba game bc the only way to dmg towers is to walk into tower range during a dmg phase, except you need to channel for a minimum of 2 sec to dmg it and its interruptible by dmg, in a game where everyone has 4 aoes. why did you switch it to this the beta was good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is not free to play . Match making sucks and you will just get bots on your team .There is no reward to push rank and the playerbase is small rn because theres nothing to do and to earn . \n\nVery scummy tactic where they added s1 characters but if you claimed another reward you cant get them .\n\nToo many crashes ruining the experience\n\nIn season 2 the balance of the game is terrible . Theres only 1 tank in the game thats the clear best and thats ss4 vegeta . In terms of dps everything got nerfed and is outright bad . ss3 go nerfed but nothing to make him abit better like the first balance patch .Dps options are limited with only 3 being good .\n\nMatchmaking as a solo player is horendous . A solo que should not be against a full team and it is impossible to enjoy the game as a solo player . Free characters are massively under performing \n\nAs a casual game a few matchs a day is fun but not worth playing if you want to invest in a game and really get good and push",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hot garbage. Not p2w but in game resources are super limited, some characters are paywalled, every match there is either a bot or someone who is not playing because probably last match they lost to a bot. I can get good games in with teammates who don't just run in and die, but they are few and far in-between all the dc's. The balance of the game is also horrendous, either we get steam rolled 5 mins in, or you lose two towers right away and spend 10 mins playing defense the whole times to eventually get snuffed out. Don't spend money on this, don't think it'll be fun, you're better off playing some other gacha game that has some actual play to it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, subhuman, negative IQ player base\r\n\r\nShameful!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You STILL haven't fixed the end game from the open beta test. Once a team gets through the gods of destruction (the towers) the game is basically over. The dragon ball pedestal (your Ancient/Nexus/Base/Whatever) has basically no HP and there is 0 interaction time to pick up the dragon ball and win.\n\nHow the actual hell are you supposed to defend that once the towers are down, Bandai? If you want the game to be over when the towers are down, just make the game end when the last tower is taken.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "New hero are imbalanced, they did this on purpose, when another hero comes out, they will nerf the old one.\nObtaining zeni is SOOOO hard without topping up.\nGreedy company, do not ever support this kind of crap.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "since season 2 ready the game so often crash/force close why",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Completely unbalanced. Supports and tanks should not be able to build red items. The fact that the actual damage characters in the game are actually the weakest is absurd. Gotenks and Hit are better dps than all the attack characters in the game. The only balanced thing about them is that there can't  be both on the enemy team. Then you get hit with double Gokus, Gotenks, and Cooler, the best, highest damage dealing, and un-killable team in the game and there is literally nothing you can do about it. The new characters are broken beyond belief, making this game the most pay to win ever made. Not to mention above all else your teammates fucking suck. It should be illegal for a solo que player to encounter people who are teaming up because that is a huge disadvantage right out of the gate because they can actually communicate with their team which is the most important thing in this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont even try playing solo at low ranks they are flooded with high rank players who got rank reset or bot. Unwinnable 7/10 which doesnt mean you win 3/10 just that you have a maybe even chance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Has potential but don't see it taking off. Reporting does nothing. Constant AFK members. Farming minions feels like a waste. Even their advance targeting is buggy. Will still target minions even when I have a fighter marked.\n\nSo disappointing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "BIGGEST PIECE OF ABYSMAL GRADE A APPALLING DOGSHIT enjoy and have a nice day.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game keeps crashing and i can’t play at all it kicks me out every single time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Insanely fun and engaging MOBA on launch that quickly became absurdly frustrating once the new season arrived and introduced shamelessly P2W characters, especially Super Saiyan 3 Goku. Plus, there's almost zero reason to keep playing for long since zeni is a pitifully low currency to attempt to grind up. Character progression is also incredibly slow due to the depressingly small amount of character XP you receive after a match, sometimes not even for the character you even played as which makes levelling up stars and character statues a slog. Game-breaking bugs, AFK teammates and a useless reporting system make the multiplayer experience incredibly frustrating. Overall, a beautiful game with big potential that is ruined by poor development, greedy practices and terrible game design.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "shit game, p2w as fuck. Matchmaking sucks you carry the team on your back.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you are a klutz you will lose meta progression accidentally clicking to spend hard earned meta gems instead of cheap zeni to upgrade characters. This is a bummer.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the greed in monetization has been getting more apparent, dont do this",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No ranked rewards, too many bots, and character progression is awful. Gets boring fast and the community is toxic.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is alright but needs more features to punish/limit AFK players. Stomps are fairly common, putting you into games against coordinated teams vs your team of randoms. Account creation is also initially confusing. For example, if you first download on mobile you must first create an ingame account then you can go back and link it to a Bandai ID. Then if you go to Steam and try the same method to link to the same ID, it instead locks you into the account you just created and you cannot link to the first account created, preventing any form of cross-playing/saving. On mobile you can delete your account and start over, while there is 0 form of recourse on Steam besides from creating a second steam account to correctly link IDs to. It may be user error but there is zero reason steam accounts must be permanently linked while other platforms can freely delete their data.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they need to add a chat cause these randoms are so bad! whats hard bout understanding what to do?! lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so ass AFK Teammates be ruining dis shi with zero punishment",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots of players AFK/Griefing, lots of over buffed kits as people play the same heroes (SSJ3 Goku, Toppo, Etc), and there is no balance in matchmaking. You have to duo abuse just to climb ranks and then you'll have more competent teammates. Please add a hero ban feature and or another lane because if one lane loses; the game is pretty much over. PLEASE ADD TEAM/ALL CHAT; some of these teammates are worse than League of Legends teammates.... and that game is dead af xD\n\nGame was great, though this game tilts me more than League and that's disgusting...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't tell if the people on my team are bots or just really stupid",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's a pay-to-win game, I don't recommend you guys install it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Low skill p2w Mobile MOBA that only \"Gets away\" with it because Goku is on the cover.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good game, shit server + no player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Idiots and cell jrs idiots and cell jrs idiots and cell jrs idiots and cell jrs idiots and cell jrs idiots and cell jrs",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I wish this game supported more countries for playing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "With Gohan coming out game is unplayable, unbelievably ptw and its not even close or fun to play against and have to wait 2 weeks for them to maybe not even nerf the character",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is fine but there is a huge issue where if teammates spam pings my inputs end up being delayed by maybe 3 seconds as if I'm lagging. The only fix was for me to reopen the game each time someone decides to spam pings. Not reinstalling until that's fixed",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is actually really bad. It has pay to win characters in a highly competitive Moba game, and the company behind it clearly has profit incentives, as they broke their own rules for the tournament they are running, only so that you can make a party with exclusively paid characters.\n\nAfter the season was over, as we predicted day one, the overpowered, p2w characters were nerfed, and a reasonable way to obtain them in game was added, only to spit in the face of players even more.\n\nDon't spend a cent in this game. Honestly, we shouldn't even play it, but at this point I'm too invested in the tournament to just quit. But after that? I don't think I'll be touching this game again.\n\nAs of season 2, a way to acquire the paid characters was added, and a total disregard was given to players that had already achieved the level required to achieve that. \n\nAs if all of that was not enough, some of the mechanics in the game are actively bad. You cannot choose when to use your abilities to deal damage to the tower, or when to cast it at enemies, causing the under tower to be a terrible position to fight from even when you are at an advantage in level and positioning to your enemy. Requiring you to skirt around the objective to fight, which is disadvantageous to melee characters, as well as just being a *terrible* mechanic all around, it barely works, and is ping dependant.\n\nLess of a mechanic, more of a pet peeve, why is the random option dependant on party order???? I want to click random on my party and be placed on a random role lmao. If you queue random with 4 friends, all of you will always land the exact same roles until the party is disassembled and reassembled. \n\nVisibility is also a problem in big teamfights. It is very hard to tell what's going on. \n\nThis is a shame of a game.\n\nWhat do I like about this game? Uh... I like that matches are short, Fighting other players is pretty fun, but I give more credit to being here early than to the game being awesome. It is also cross compatible with cellphones, which means there's lots of children playing. \n\nOur most fun matches, as a party of four, is to absolutely ruin the day of someone who paid upwards of 50R$ to buy a pay to win character because they have zero game sense and die in any teamfight, only able to have a chance because they have a broken ass hero.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}