{
  "positive": [
    {
      "review": "Original Like A Dragon (Y7) was FAR better in story and characters. I feel like this one butchered quite a few things, especially with the ending. Hard to really get into without spoilers.\n\nThe RPG combat itself is the best I've played in a while though, I really hope they continue to improve on the system, and  hopefully deliver a better storyline in the next mainline game.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game was good, but the story is kinda mess and its not better than its predecessor(LAD 2019) but gameplay is peak.\n\nAnyway,\nI will sell my left nut to go back in time to play yakuza 0 all over again.Its fucking Peak.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "This is another fantastic entry in the series, maybe even the best entry. All the fantastic party members from Yakuza: Like a Dragon are back, and now you have more hyjinx to get into in Yokohama and now Honolulu! \r\n\r\nA ton of fun and heartwarming sidequests, absolutely excellent characters and character interactions. I didn't play much of the Animal Crossing-esque mode in the game, but, engaged with most of the other stuff. The Sujimon stuff was much deeper this time and I actually really enjoyed that. I missed Dragon Kart, but, it was sorta janky in the first place and Kasuga being in Sonic Racing really makes Dragon Kart look that much more janky.\r\n\r\nThe new characters are great as well, Tomi, Yamai, Chitose - all great and well developed with their own unique sources of intrigue. Kasuga is just such a lovable idiot, and a bad ass of course, but he's just got so much heart, and it's another excellent example of that.\r\n\r\n[spoiler] The way they deal with Kiryu's send-off is really great. Having all those memories to revisit and have him reflect on, or in some cases, get closure on, those things and characters from the series was very rewarding having gone through the series this year, and among my favourite parts of this game. [/spoiler] \r\n\r\nI love the bartenders in Survive and Revolve and the strange history they share. Obviously we had one of them in the first game but, having the other be who it is is really quite funny.\r\n\r\nDefinitely don't miss this one - it's amazing.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is so good that I unlocked every single achievement. The gameplay is miles ahead of Y:LAD. Honestly, it is hard to go back to THAT game after playing this. The only thing that sucks is the ridiculous amount of unnecessary DLC. It feels like you have to empty your wallet just to get the full experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly while the story overall wasn't as good as 7, the gameplay itself is extremely fun, the ending was cool as hell and I still enjoyed this game a lot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, so much too do in this game. However, late stage it does become a bit repetitive if you already have the best weapons or have done all the substories. My advice, keep some activities for late game chapters as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best JRPGs I've played in recent memory. Turn-based gameplay is significantly improved from the previous title, with the ability to move around and positioning now playing a big role. Attacks chaining into downs/combos along with proximity bonuses for damage makes combat so much more fluid and satisfying. The Hawaii setting was also a really big breath of fresh air, with lots of stuff to do and explore. Personally playing all of the mainline titles from Yakuza 0 to this over the past 6 years has been a great journey, and Infinite Wealth is the perfect send-off for Kiryu Kazuma as main protagonist of the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do you miss rpgs when they were huge, had lots of things to do and without all the modern politics of western gaming? Then this is just a perfect game for you. A throwback in so many ways to rpgs of the past",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely outstanding, the game has a LOT of content, it took me around 80 hours to do the main story (gridnding included), and I've only done about 10 hours worth of side content, and even then I haven't even touched on most of it in my first playthrough. The game has a lot of great characters, especially the two protagonists, and the story is pretty well written, but Kiryu's part is better than Ichiban's in my opinion. The turn based RPG mechanics are really good in this one, way better than Like A Dragon's. Overall I'd say this is one of RGG's best titles and I like that it has a lot of callbacks to Kiryu's past.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Half the story sucks ass but all of the gameplay is great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ichiban Kasuga is back. First game in the series that I played was Like a Dragon. It was a very interesting experience and with Infinite Wealth it continues. I personally found it amusing and more polished.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I prefer play yakuza 7 (like a dragon) before you play this game and the entire yakuza series (i played yakuza 0, kiwami, and kiwami 2 lol) for better story....\r\ncoz, if you played this game, you cannot come back to at least yakuza 7.\r\nBut it doesnt matter whatever you played before or after.\r\nBy the way,\r\n\r\nRGG never failed to write a great story (as far as i know)\r\nthe plot twist, the character, i loved so much\r\nIts a perfect gameplay for yakuza 7, all the aspect polished (i miss 1 or 2 minigames, but it is what it is)\r\n\r\nits perfect (or nearly perfect) Turn Based JRPG...\r\nBon Voyage",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great sequel to Yakuza 7, although it wasn't as emotional as I expected. Hopefully Itchy Balls Kasuga gets more time in the limelight.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best RPGs I've played in a long time. A perfect balance of an intense story full of interesting characters and wacky side quests that you would never expect. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing Story, gameplay, mini games. It keeps me engage to the game all the time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just like every Yakuza games, perfect. Had so much fun with side activities, damn.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "About 10 years ago I jumped into the Yakuza/Like a Dragon series. I was a lot later on it than some people, but I have really loved the mainline series of these games. The first 7 games (counting from Yakuza 0) were all action/beat 'em ups. They were great, they were fun, but the style was maybe starting to wear a tad thin. Once we got to Yakuza Like a Dragon, not only did they change the protagonist, but they changed the style. It became a JRPG in the vein of a Dragon Quest. I loved it even more. \n\nI was extremely excited to continue on the story from the last game, and while I enjoyed Infinite Wealth... It wasn't without some serious faults. The battle system does just enough that it isn't a static turned based system (which I have no problem with turn based games. I love them). The characters are endearing, the story is solid (although that is where the majority of my issues come from). I didn't walk away 100% satisfied once the credits rolled. Which was not how I felt after any of the previous games in the series. There was a little bit of a hollow feeling. \n\nIt's not my favorite of the series, and it's not the worst game in the series. It's closer to middle of the pack, which is a shame because it had a chance to be really special. The story pacing and how it developed was not up to par. Things felt a little rushed as you reached the end game, but at times it dragged on for too long in places earlier on. It was very uneven. Additionally, there were some performance issues and freezes. Sometimes the game would just crash. Make sure you save often. It was playable on the Steam Deck, though my definition of playable may differ from others. Don't expect amazing visuals or high FPS. But in an RPG, it was acceptable. And it's nice to be able to pick up and play longer games like this without being tethered to your desk.\n\nI still think it's worth playing and experiencing if you enjoyed the main protagonists from either the Yakuza games or Like a Dragon. It's best if you have played the other mainline games (And Like a Dragon Gaiden) but that is quite a time commitment. It's an interesting one, I just wish it had done a better job story-wise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hi. \r\nFirst i have to say, got the game in a special offer very cheap. That made it for me ok at the end. \r\nOriginal Like A Dragon (Y7) was over all way  better in story and characters. In Infinite Wealth there are many logical issues in the story, also the character developement like it was in Y7 is not as much present anymore. In Y7, you saw the progression in Kasuga but here, it feels like he never learned anything or during Infinity wealth will learn anything. And i started to realized the lack of storywriting here at the very start of the game, with the new female character. The only character who gave me the quality i expected of Y7 was Yutaka Yamai, even when it came very quiet.\r\nSomehow i constant was reminded at the bad storywriting from so many tv stuff the last years, and the saying \" Because the authors want it so\"\r\nI played Pirate Yakuza first and then bought the other parts, and start playing now one by one.  Its okey, i get the storys, i can also understand why a big focus here is on memorys from the past for Kiryu. It was fun, even when i can imagine, its not as impactfull for me as for ppl who grow up with Yakuza series.\r\nThe round combat system is okey, but i prever the combat in Pirate Yakuza, because its far more faster and not so boring after a while. \r\nOver all, buy it on sale and not for the full price. if i had payed the full price.. i swear i had try to get a refund.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a master piece with the story dividing up to focus more on both Kiryu and Ichiban let the story of the game expand with the final times of Kazuma Kiryu trying to regain his name while Ichiban trying to finish what Kiryu started to save people. The story rounds up by the end of it and the final chapter was one of the best. This Yakuza/Like a dragon game is in my top 3 favorite games of all time I would give this a 10/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best dondoko island. Not the best story, but it doesn't matter with all the extra.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's amazing ngl pretty fun to play all hours of the day and/or night :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "TLDR: great game, terrible terrible writing\n\nI'm 5hrs in by the time writing this review, not even once interested in the film-length cutscenes. I fell asleep once, by the time I'm awake, the scene is still going on. Next day I managed to video call my boyfriend, iron the clothes, had dinner on a single cutscene. Today I left them to make coffee, wondering why Ichi has a neat pulled back hair now, which I'm not complaining about and actually suits him, maybe for his new decent job. As I came back from the kitchen Ichi has turned into his permed hair, red suit self.\n\nMind you, I really love the graphic, menu, combat, map, etc etc, pretty much everything else besides the conversation and the story itself. I enjoyed first Ichi game so much, his character, his background, his choices of action. Now they make Ichi dumb, a complete loser which I strongly believe he is something much much better. Sorry to say but The Man Who Erased His Name, this game's predecessor was waaaay a lot better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "watching ichiban propose to saeko was harder to watch than the yakuza 4 saejima haruka scene",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like seeing my friends from Like a Dragon. I get health recovery from Nanba's hideout. It feels like home.\n\nThe ability to move your character within a certain diameter before attacking is a game changer. In the previous game, if you triggered a random fight that had a guardrail from the road in the center of where the action took place, that single fight could take ages because either the AI did not understand how to get around the rail or the attacks would not land because it would take too long to land a crit on a downed enemy. \n\nI wish the older beat 'em up style, like the original double-trilogy let's call it (0, Kiwami 1 and 2—Yakuza 3-6) I wish those games had an English dub. I know it's not popular for this genre across the board, really. But I don't wanna read all the time. I have a kindle. It doesn't run those games very well. Hehe.\n\nAt the time of playing, I have only played Like a Dragon, 0, and a bit of Kiwami 1 otherwise. Like A Dragon was one of the last games I tried to review like a pseudo-journalist. That review is around someplace.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Literally a improvement in every way over Yakuza Like a Dragon",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "love the game and the characters",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "okay, the game is perfect. but why does it randomly crash so much?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "rate it 10/10 cuz of yee yee ass Ichi confession to Sae-chan </3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.\r\nThe New Game+ being paid DLC is scummy at best tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic sequel, just an absolute blast of a JRPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing gameplay, meh story. Only get it when it's on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, really its everything the previous yakuza like a dragon was but more polished and just overall a better gaming experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Una continuación de la saga estupenda, ampliando el sistema de combate de la anterior entrega y profundizando en este. En cuento a historia ha sido una maravilla durante todo su recorrido con múltiples conexiones a anteriores títulos de la saga, si has jugado a toda la saga te va a encantar todos recuerdos que trae el juego durante parte de la aventura. Lo único negativo que comentaría sobre el juego es que debido a la cantidad de contenido a veces se siente demasiado farmeo en especial a partir de cierto punto de la aventura, [spoiler] cuando empezamos a manejar dos equipos con dos protagonistas en Japón y Hawai a mi en particular se me hacia pesado gestionar los inventarios y volver a subir de nivel y profesiones [/spoiler] , no arruina el resto de la aventura, pero si que se puede hacer algo pesado en ocasiones y enlentece el ritmo en los últimos capítulos, pero tampoco es nada grave en un juego que ofrece muchísimo que hacer. Recomendadísimo.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finally beat this game today and i must say that this game was amazing, i love everything about it! it has great story, music, gameplay and a ton of fun side content to spend hours on!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay with tons of side content, the story was mediocre however.\r\n\r\nI'm strongly against charging extra for new game+ and higher difficulties. Especially when it's poorly done like here. I played on legend difficulty and found the game to still be too easy. Feels like they didn't give it much thought but charged for it anyway.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best turn based game to ever exist. its such a  good game. take the story aside this is literal perfection of a game. story is kinda meh. beside that highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a beautiful work for a yakuza fan, I truly enjoyed every moment and it brought tears to my eyes more than once.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Yakuza game with perhaps the most sinister villain to date. I'm talking bottom of the rung devilish, enough to make even the most hardened Yakuza shudder. An evil so commonly overlooked by the masses, yet sends trepidation down your spine upon the utterance of such horror.\n\nA Vtuber.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Truly one of if not the best in the series. So much to do, and all of it enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yakuza main stories aren't always amazing, but the game is pure fun. Minigames upon minigames upon side events to do. Pure fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was a good journey. anyone loving the series should play it. story is not the best but if you like rpg/jrpg it is one of the best. many classes and many combinations to do, recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best game in the series, I feel like everytime i see like a dragon games i always feel like it's gonna be mid game or something but after reach the end of gaiden i felt touched and love this game even more. It's still one of my favorite game of all time still. This game wasn't just about yakuza alone. It's about people you love, People you cared about, You must treasure them. It just like mother love you love them unconditionally, When you're friends or family is in trouble, You don't care which side is wrong or which is right. You choose the one you cared most no matter what they did or what they did to you. You still choose to support them, Ichiban is very amazing well written character i used to hate how naive he is. But i slowly love him the way he cared for everyone. This game pull me out the lowest point of my life. I feel depressed with my life lately so i stopped play game for one year but when i made up my mind i open this game up and start continue to where i left off. And turn out it made me become a better man i never feel more than alive after ending this game. If you played this game since yakuza 1 or 0 and played all the series of yakuza games. This infinite wealth is a real fan letter to our players it's not just fan services but they want to tell us something beautifully. Sheena Rinko song at the final ending is real masterpiece. I used to listen to her song alot when i was a child and after i hear this old song again it made me tear up. So i cried, it doesn't make me the less man i am. This game is beautiful one of the best yakuza game in the series  10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An overall fun and lengthy experience, altho if your main reason for the purchase is a convoluted yet reasonable story, then you might end up being disappointed. In this regard it's not a satisfying followup to LAD / Yak7 - there's a good couple of eye rolling moments, where RGG clearly could not figure out how to push the plot in a coherent way.\r\n\r\nHowever pretty much everything else new is a major step up - there's even more side activities (some being recycled from LAD), the combat overall doesn't get as tedious and the jobs/classes are much more distinctive this time. I would not mind if this (third) send off to Kiryu was the last one - Kasuga as a character feels developed enough to take the limelight.\r\n\r\n(if anything, get the base version only - do not reward SEGA for locking NG+ behind a paid DLC)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game. However... I need to vent.\r\n\r\nI played Like A Dragon recently and it just so happened that when I finished that game this one was on sale. Because I had read some reviews about it and I REALLY like the previous one so I bought the game. \r\n\r\nThere were some things that I liked more in the previous title, like the story. I think the main story of Infinite Wealth was good, it had high highs and low lows in my opinion. Its a bit too convoluted for its own good but the biggest sin of all (to me) is that it reuses plot points and even copies the previous game's story in some aspects. The game even acknowledges this in the final chapter and confrontation. \r\n\r\nNevertheless, I liked hearing DIO's Voice actor (Takehito Koyasu) and I liked the overall cast of characters. The music was also good, whoever wrote the track \"Sad 1\" needs a raise. Also bring back the Ichiban Confections mini-game and f*** that stupid — \"We have The Sims at home.\" — f***ing Island mini-game. \r\n\r\nThis game is pretty fun, I spent quite some time trying to do most of the activities it offered, mini-games, sub-stories, etc. I had the goal of eventually 100% completing this game so I was even grinding the jobs, the dungeons and crafting all the weapons. However, after taking a peak at the achievement list I saw that the game had achievements relating to New Game+. \r\n\r\nFrom that point on I stopped going out of my way to get every single thing and stopped grinding the different jobs. My plan was to finish the side content that I had already started, complete the Memoirs, Drink Links and Life Links on my first play through and leave the rest for later. I told myself I could just do it when going through the game again in NG+. Right ?\r\n\r\nIn an unprecedented move from SEGA and Ryu Ga Gotoku, the New Game+ feature was locked behind a paywall. A masterful gambit, a move so unexpected you'd have to be a fool or an evil genius to think about it. In that moment, the game went from Like a Dragon: Infinite Wealth to Infinite Greed. \r\n\r\nThis move is so bad I genuinely cannot comprehend it. Not only have they locked achievement progression behind a 20€ paid DLC but they did so despite the previous game having New Game plus as a base feature. In other words they removed content just to sell it back to you at a 20€ price point so that they could raise their profit margins ever so slightly. Rat behaviour.\r\n\r\n\r\nTL;DR: Paid DLC for NG+ should be illegal. Good game tho.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still in the midst of the game, but i'm enjoying building Island, Sujimon battles, Labryinth challenges and lots of side quests. This game would probably make me clock at least 100hrs.\n\nTo be honest, its just getting better! Keep it up RGG Studio!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best turn-based RPGs I've ever played. \r\nAnd I've played Mother 3 and Chrono Trigger.\r\n\r\nThe story is its weakest point, though - seriously, what were they thinking?\r\nBut the gameplay mechanics, the music, the style... it's all spot-on.\r\nThe placement of allies and enemies mattering reminds me a lot of Chrono Trigger, which imo is a wonderful mechanic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "currently i'm trying to 100% it but god damn, i love this game\nliterally it helped me rediscoverd love to jrpg genre\nstory is sometimes wacky, especially in 2nd part but i liked it (even if i'd rather have a game where ichiban is only playable character but oh well, im not whining that much)\nEdit: just got last achievement, now I hate this game /hj",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game just feels like a bigger Yakuza 7. Which is a good and a bad thing imo, the side content is pretty amazing but towards the end of the game it starts to drag a lot especially with the dungeons and how brutal the game is whenever you try to unlock an end game weapon for a job. But all that grinding is completely optional so I won't really redact any points from the game for it. \r\n\r\nI do feel like they could've used the sheer amount minigames this game has to funnel into the main gameplay, like unlocking weapon materials (afaik I know only fishing and recycle shop does this, both of which are boring) and earning decent money, especially towards the endgame. At the end I had to just repeat the same fucking dungeon for like 2-3 times if I wanted to try out a new job in the combat which was getting pretty boring. I know this is supposed to more of a NG+ thing but its locked behind a paywall so I will complain about it. Either give me NG+ or make it easier for me to max out the jobs sega.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty good game, and definitely a well done love letter for Kiryu. I have mixed feelings about the ending plus the story though. The story as a whole felt like a side story rather than a main Yakuza story, and the final bosses didn't leave a good impression like the old Yakuza 1,2,3 or 7 bosses either. For me this would go to the ranking of Yakuza 5 (8/10) but since Kiryu is here and his ending was done very well I'd give it a 9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Another work of art.\nAlmost a perfect game. A huge improvement over the previous entry. While the story was a bit of a letdown for me — I expected more from RGG — I still enjoyed it overall. It’s a great next chapter for Ichiban, who shows a lot of growth since the last game, and the final story for the Dragon of Dojima. The cast of new and returning characters is excellent, the bosses and music are epic as always, and the combat has seen massive improvements. On top of that, the game is filled with a ton of side content, offering plenty to do beyond the main story.\n\n9,5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "expect a lot of playing hours if you get this game, good fun playing hours. I enjoyed the mini games, side quests more than the main story",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The First like a Dragons Story really hooked me and i fell in love with the characters. this feels like an excellent extension of the experience. The story takes some wacky turns but its amazing and the combat is janky very rarely but feels even better with the movement in battle added. All around Good Game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Vastly improved combat from the 1st game. Story and everything on point. Great game overall and loads of side content to go and enjoy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great Game, maybe a little hard to process at first but its like all (Yakuza games).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played the Miss Match dating game. and got catfished by a chicken!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A deeply emotional Yakuza story that perfectly blends the new (Ichiban, a gloriously positive character) with the old (Kiryu, who in his old day is reflective and remorseful). Hawaii and Kamurocho / Yokohama are the setting for this moving story. How do you move in after a life of crime? How does society treat you? This narrative explores these questions and more. If you liked Like a dragon, you'll love this. If you liked the older yakuzas but couldn't get into like a dragon because of the combat system, this one is still required material... Kitty's story is about half of this games runtime and explores all of the history and twists and turns. A beautiful homage to a legendary character in a legendary series. Recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Leave it to Like a Dragon: Infinite Wealth to make a grown man like me laughes like crazy and cries like a baby throughout the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great sequel to one of the greatest RPGs ever made with a PROPER \"end\" to Kiryus journey while gearing up ichaban for what ever comes next",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A man-child embarks on another adventure... and Ichiban too I guess. I guess I am a man-child.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's like Dragon Quest if you smoked meth and beat up other middle aged men on the streets.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I linked up with Ichiballs and he stole my $4000 gaming pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ryo ga gotuku doent make bad games but i still want them to go back to a serious story with ridiculous moments sometimes witch all caracters take fully seriously, i feel like the new gang is a lot more lighthearted and aware of the ridiculousness of the events and i prfered when kiriu took himself so seriously even in the most ridiculous of events",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game hay, nhiều mini game. Cốt truyện yếu hơn phần 7 một chút",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "67 hrs and im in the finale. beast back attack :steamhappy:",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Cinema (With a side of really good turn based gameplay)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak video game. kiryu will tiger drop the cancer cells.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just when I thought I was out of Japan, they pulled me back yen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Maybe the real Infinite Wealth was the friends we made along the way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very long but very worth it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "you need infinite wealth to buy this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Truly Like a Dragon: Infinite Wealth",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Like A Dragon 8: Infinite Wealth - 8.5/10[/h1]\r\nPlayitme: 120H (94H in game + 2H Postgame, 24H Increment of loading time)\r\n\r\nSynopsis:\r\ntakes place in 2023, and follows former Tojo Clan yakuza members Ichiban Kasuga and Kazuma Kiryu as they embark on an adventure in Isezaki Ijincho, Yokohama and Honolulu, Hawaii. Following a tip from a former ally, Kasuga travels to Honolulu in search of his biological mother, Akane Kishida, who he thought had died many years ago. Also looking for Akane for different reasons, Kiryu teams up with Kasuga to find and protect her from various local criminal organizations as a larger, international conspiracy unearths.\r\n\r\nPlus:\r\n+Gameplay is now more refined\r\n+Story is engage and very connect with current climate( as 2020's by this review)\r\n+New Job introduce in this game is fun to used\r\n+Honolulu Hawaii as new place to explore\r\n+Dragon Engine now is more stable \r\n+Music your collect in-game (include the DLC) now can be hear when explore or go to dungeon \r\n+Kiryu Bucket List event\r\n\r\nMinus:\r\n-Money Grinding is a must to kept up with difficulty scaling\r\n-Some previous job got cut\r\n-AGAIN, DLC LOCK FOR NG+ AND JOBS\r\n\r\nMixed:\r\n=RGG need learn more how to make story flow in RPG-style game\r\n=Too much side content\r\n=LaD 8 is more feel a sequel game by the story, very different with RGG handled kiryu saga game that more stand alone story with some connecting thread\r\n\r\nIchiban Kasuga second game feat Kazuma kiryu...\r\noverall this game is improvement from previous game...\r\nbetter gameplay, better story, and better stability by dragon engine..\r\n\r\nalso thank God that Amon fight is not relegate to postgame lv 99 dungeon...\r\n\r\nthe next RGG game will be either Majima pirate or Ishin..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is good, but i dont get infinite wealth",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game I guess.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is very huge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Yakuza game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Need another games as big as this one",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very good, it is the best game of all time.^^",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Que juegazo por amor a Jesus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kiryu-chan finally found another Judgement Kyoudai ❤︎ ♬ ♪ ٩(ˊᗜˋ*)و",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's Yakuza, bro.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "goated jrpg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an experience",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "gut gaem",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just too awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yakuza your own way!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ichiban found dead on Dondoko Island",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "all my homies hate cancer",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "too many things to do in this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like Yakuza its more Yakuza.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its like a dragon ichiban",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“Bon voyage, Dragon of Dojima.”",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely incredible",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it's good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "yakuza 3 would be good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Infinite Wealth starts out with great gameplay that by the end becomes exhausting and absurdly boring, the story has an interesting premise that completely drops in writing quality halfway through the game and just keeps getting worse the more you play. The antagonists in Infinite Wealth are by far the worst in the entire franchise.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Like a Dragon: Infinite Wealth is a turn-based RPG with a dozen other games included, and it's a good and decent experience that I found deeply derivative and unsatisfying. It is a high-quality game with a lot to enjoy, so my thumbs down is just a couple of degrees below the horizon line.\n\nI think you should only play this after playing Like a Dragon, which was a good starting point for the series. Gameplay-wise it's similar, but better overall. I enjoyed a lot of mini-games, and a lot of effort was spent on making many of the substories unique in some way, having a special mini-game or interesting boss battle. The main dish - tactical combat, JRPG style - is also fine, but that's where I start to complain, and I don't think I'll stop complaining until the end. The game has no difficulty selection (at least for the first playthrough) and if you engage with any side content you become overpowered fast, which means that the main gameplay mode - tactical combat - becomes just a chore. And side content was what I actually liked in this game, so the critical path quickly became boring. All of the tools available to you are mostly pointles there's a fun job-switching system, but there isn't much point in engaging with it unless you want to do the post-game extra-difficult dungeon. There's crafting and optional randomized dungeon clearing - and I enjoyed those, there you see glimpses of how this combat system can be used, but it again makes you overpowered. So pacing and balancing are way off.\n\nWhat remains is a story. I can't call it bad, but the thing is usually in this series the story is exceptional. It is simultaneously the most serious dramatic thing you've ever seen and also the silliest thing you've ever seen. And this one is more conventional, it's tongue-in-cheek, it knows that it's too dramatic and too silly from time to time. It doesn't feel sincere. On top of it, a lot of it is tone-deaf. The plight of little people is one of the big themes of the game, but the two biggest side activities in the game are a Pokémon-style fighting game where you force homeless and crazy people to fight for food, and a resort management game where the same homeless and crazy people are used as unpaid labor. It's played for laughs and I don't condemn the game for having those activities, but I personally couldn't enjoy them. Gameplay-wise they felt out of place too: the Pokémon game is a separate turn-based tactical combat mini-game and we already had one; the resort management game interrupts the normal game and is almost completely separate from it. You can play it for hours and forget how to play the main game, ha. The story is also very derivative. It feels like half of the side stories concern characters you've met in the previous game, and for the second protagonist most of what they do is reviewing references to previous games. I played these games and found this boring, I imagine if you haven't played Yakuza 0-6 you'll be confused on top of being bored. I can't say it's an \"objectively\" wrong way to write a story, or even that it's poorly written, but it feels the least unique and engaging entry in the franchise.\n\nSo here we are. I spent a lot of time on this game, and it wasn't that bad, but I mostly continued playing because I am committed to the series. If you want to skip one game in the franchise - skip this one.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Ichiban in Yakuza 7 is stupid but for some reasons he has become even stupider in this game. You would think after all the events of Yakuza 7 he would be a bit more clever and less naive but no, Yokoyama decided to make Ichiban a literal manchild.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Currently in CHapter 7 , man the story and sub stories + side activities are soo boring and dull. The only thing here thats somewhat good is the combat and different jobs each character have, other than that its a slop. just can't stand how bloated this game is with boring substories, terrible main story writing, and too big of a world",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To say my playthrough attempt of this game has been a disaster, is an understatement. What started out REALLY hopeful when I went in with no expectations (even after an extremely negative experience with Yakuza: Like a Dragon) has ended up with me putting this easily in my top 5 worst games of all-time. If not pushing out Sonic 06 as my #1. This game, is beyond trash.\r\n\r\nFirst off, the technical issues. I've had this game crash more than anything else I've played, and I've played every game in RGG's library. Pirate Yakuza does not crash like this, Lost Judgment does not crash like this. So something is definitely wrong with this game in particular. I just had a crash, [spoiler] on Nele Island, at the end of the Bryce fight, after 2 hours of grinding out that dungeon. [/spoiler] I genuinely have never been so mad at a game in my life. This is not the first time I've crashed either, I've had at least 8 crashes throughout this playthrough. It happens during long sessions so I assume something isn't unloading over-time and keeps stacking up.\r\n\r\nThe gameplay issues: The lategame balance is terrible. I tried to get into it. I really enjoyed the earlygame, actually! Then every move falls off mid/lategame unless your name is Tomizawa and you are just able to element your way through it. But that's nothing compared to the level grinding! While intentionally taking extra fights than necessary because I anticipated a repeat of Majima/Saejima in Like A Dragon, I still spent 8 hours grinding extra levels in the finale before taking on the final Ichiban dungeon. As well as an extra 2 hours grinding before Majima/Saejima/Dojima. I am not looking forward to more level grinding for Kiryu's side and his party. The game is also balanced around exclusively using every single stat buff imaginable. If you aren't landing almost exclusively Proximity/Back attacks you are not doing damage with your basic attacks. Even if enemies are considerably lower level, even if they're (supposed to be, dungeons are weird) in Smackdown level. The RPG system is a cool concept but the balance is terrible and has fallen apart twice in a row with lategame. Fundamentals are a step up and feel more Yakuza but the enjoyment of the gameplay does not sustain throughout the game.\r\n\r\nAll in all? This is a mess. A complete, and utter mess. I went in extremely hopeful, even setting aside my low expectations and bad experience from my LaD playthrough. And it still ended up worse than LaD did. RGG, do better.\r\n\r\nAnd #RemoveKagawa for god's sake y'all are ridiculous even TRYING to cast him in Kiwami 3. You cast the sort of creep who's behavior would get them knocked out by Kiryu.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Yakuza Franchise used to limit wacky and over the top comedy to the side quests while entertaining you with a gritty crime-noir main story. This is all non-sense Comedy and inconsistent World building.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After just 8 hours of gameplay, I couldn't stomach this game any longer. This has to be one of the worst games I've played in this genre. I don't get the appeal (given all the great reviews on sites and on Steam). I'm definitely missing something. But here is why I quit:\n\n- The protagonist is the biggest, pathetic loser I've ever had to play in a video game. I'm sure it has something to do with the Japanese->English translation, so in English, everything that came out of Ichiban Kasuga's mouth was cringe and embarrassing. This game has some very long cutscenes with a lot of filler dialogue that's so unnecessary. It was like listening to the most boring conversation you could imagine.\n\n- Terrible save game system. A couple times after a long battle, the quick save is disabled and it wouldn't give you time to do a manual save because it would pull you right into another long and boring cutscene. During this time, the game would sometimes crash, and I'd have to load an old save game and redo the whole battle again. Such a ridiculous game design. I keep my gaming rig cool and stable, and I play a lot of games. This game has crashed on me more times than any game I can remember. \n\nI'm just happy that I got this on a good sale and didn't pay full price.\n\n1 out of 5 stars",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is meh and the characters are badly written compared to who they were in the first Like a Dragon, Ichiban especially. If you're here for just the combat and wacky random things that happen similar in previous games, then you'll find what you want here.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is really really bad the fighting system is really bad it is like for 5 year olds even have auto fight system ???? not good not normal it is a joke , game is for kids not interesting fighting in old games were really good ... Story is not bad but not interesting and it is really really long like talking is so slow it is crazy and amount of cutscenes are crazy and really long not good and not interesting to make you continue playing the game that is why i stop playing game is bland it is a Joke do not understand amount of praising and people loving it even old Yakuza games are really Boring games nothing is interesting it is a shame of a game .... to add dating and other stuff are not needed they could add skip those things i do not want to play dating game or driving working as a delivery guy like what is this real life simulator everything is long and boring it is insanity ????",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a dragon infinite dogshit, i hate this gay , its turn based yakuza so doesnt fit yakuza series entirely, and the story is soo dogshit too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what drugs dev using while writing LAD:IW story?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Is it fun or just dumb... unfortunately the latter.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I sincerely wish I could give a Mixed review on this game. Coming into LAD8, my expectations were through the roof. A game where the prior Kiryu and Ichiban pave way for the Yakuza to be liberated from the past and allow the lost souls, bounded by a life of crime to have a future? Incredible, FANTASTIC premise...only for them to barely follow through with any of it after the prologue. \n\nThe gameplay is a gigantic step up from Yakuza 7 in every possible way, with Kiryu's Dragon Of Dojima style being near perfectly transitioned from beat em up combat to turn based combat, even if I think the skills tied to that class suck.\n\nHawaii's a fun map with a lot of interesting things going on there, but that's about the most I have to say that's positive about it. The amount of god damned minigame padding (FUCK Dondoko island) was absolutely aggravating. \n\nThe story and writing is where I begin to take issue with this game. I can't decide whether I love or hate this game, where I initially came into this game adoring it and later on starting to dislike it more and more as I let the game sit in my mind. Ichiban is a complete and utter caricature of the man he was in Yakuza 7, I think his relationship dynamic with his love interest is god awful, and he does little aside from talk no jutsu a few characters out of their slumps/evil ways (don't even get me started on them. Anyone who's played the game knows who I'm talking about).\n\nKiryu I take less issue with. In fact, his role in the story was the only reason I was really kept engaged in the story to begin with. However, it seems kind of ironic that our new protagonist has taken the support role for the man who's had 3 finale games now.\n\nIt hurts me to say this, but I could feel my honeymoon period for this franchise slowly start to erode over time since their botched combat remake of Like A Dragon: Ishin. This franchise took me out of a dark place in my life, and it hurts to see such a stark drop in quality in story telling and character writing.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Infinite Wealth starts out with great gameplay that by the end becomes exhausting and absurdly boring, the story has an interesting premise that completely drops in writing quality halfway through the game and just keeps getting worse the more you play. The antagonists in Infinite Wealth are by far the worst in the entire franchise.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "You can really tell the story in this game got heavily influenced by executives that never wrote a story in their life, there's a lot of out of character moments, loop holes for the sake of advancing the story, characters that were brought back even so it was made incredibly clear that they were dead, and scenes that's clearly trying to copy popular scenes from previous works without understanding why they were popular. This story feels like it was written by a statistic major looking at data of what people liked and just slapped them together into an incoherent piece of work, like a dish made out of the most popular ingredients, except none of them synergize with each other.\r\n\r\nThe gameplay is alright, my biggest complaint about the combat system is that successful blocks barely does anything, so you'll still get stat checked by a lot of enemies especially in substories. Main quest tells you the upcoming enemies' levels, but substories don't even so they differ a lot, one moment you're fighting 4 lvl 40s, but then you do the next substory and you're fighting 10 lvl 53s.\r\n\r\nThe sidestory minigames that every game in this franchise has feels incredibly weak in this game too. Dodonko island is just grinding, it's basically bootleg stardew valley with barely anything to do. Sujimon also gets boring very quickly, imagine pokemon, but all your pokemons only has 1 move, that's what sujimon is. Sujimons do have ults, but most fights end so quickly that you won't need them, and honestly, why is there even a turn based combat minigame in a turn based combat game? If I want to play turn based combat I'd just...keep playing the main game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Great game no doubt, the graphics is good, side stories are hilarious, combat feels engaging. The main story line is... not its strong point, especially the final few chapters, but overall I enjoyed the game. \nThe why did I give it a thumbs down? There is a very annoying issue with the game - game crashes. \nThis game will crash randomly every 1-3 hours. \"Just save the gave frequently\" you might say, the issue is in dungeons or certain part of the main story, you have to fight through a series of enemies before you reach a save point. One crash during it can waste you maybe 20-30 minutes of game time. During my playthrough, often when I finally beat down multiple waves of enemies, finished the chapter, and was watching the cutscenes of the next chapter - game crashed. I have to reopen the game, fight those enemies of the last chapter again, then rewatch the cutscenes. Those crashes were INSUFFERABLE. Crashes like that made me not want to open the game when I get home. (Somebody on Reddit said capping frames to 60 and turning off DLSS helped, I'll just say mine was capped at 120 and it still crashed frequently, also I didn't buy a better pc and monitor just to play games at 60 fps, this kind of issue should've been fixed long ago, but it's not.) These crashes made killed my motivation to open the game and finish Dondoko Island and Sujimon Battle.\nWhat's more? Oh yeah, NG+ and it's achievements, cannot believe any sane dev would lock NG+ behind DLC and made NG+ achivements impossible if you only have base game. \n\nThumbs down.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A masterpiece and gem of a RGG game, only to have the entire experience soured by the paid NG+ fiasco. As petty as it seems, can't bring myself to spend even a few dollars (on discount) on what has always existed for free on every previous mainline RGG game. \n\nIf there was a point system, I would have given the score a 1/10 instead of outright not recommending it (like what is being done now, just a Yes or No on recommendation), just to exhibit my displeasure towards the paid NG+ thing.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I quit cause it was really boring to me. The combat is vastly improved but the story seemed to have been sacrificed for it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The appeal to me about the Like a Dragon Yakuza games was that it felt like a traditional Dragon Quest RPG in the turn based battle and equipment department.  But outside of that, this game is so bloated with nonsense and filler it feels like a chore to play.  I've played approx 14 hours and I think only 5 of it has been exploration, battles/boss battles and treasure hunting.  There is sooooooo many voice dialogue cut scenes and soooooooo much filler mini games that its not fun.  By the time i got to anaconda mall, the anaconda escape and the sujimon battles put me over the edge when it comes to patience.  I do not want to sit and watch dramatic BS dialogue cut scenes for a pokemon rip off mini game nor do i want to play a mini game every thirty minutes in this game.  It already had \"pound pals\" and adding sujimon seems like overkill and it is.  \n\nThe graphics in the game are nice, and i like the FPS and overall presentation of the menus and the variety of equipment and items etc.... but the non stop forced dialogue cut scenes, non stop mini games and cell phone interactions with aloha app and dating app it's all just too much BS for someone like me's who's trying to play and experience a story and build up a character party to go on rewarding side quests and missions to be the strongest and best person in a game.  If they cut out 100% of the dialogue scenes and mini games it would be a much better game.  but alas it's not, it's just a time wasting boring chore of a game and i do not recommend it at all.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "this game was great except everything is tied to level and i have to grind to get up to the right level and money and items to keep playing the game\r\n\r\nive sunk 120 hours into this shit\r\nand i still consider it mid tier for a yakuza game but i wanted to finish the game\r\nexcept im not high enough level and im losing to the end bosses of the game\r\n\r\nthats fine i guess ill just load an earlier save and regrind up to the right level\r\n\r\n\r\nexcept no i already have a goddamn full time job\r\ni just got the point where i was like yeah\r\nya know what i dont give a shit anymore\r\n120 hours, a 100 and fucking 20.\r\nill just watch the ending\r\n\r\nno i probably won't i dont care enough\r\n\r\n\r\nLook \r\nthis is a good game\r\nall the yakuza games are great\r\n\r\nbut fuck me\r\nshorten it\r\nor dont make the main story tied to doing all the side content and encounters\r\nwhat the fuck happened to just being able to play through the game without having to grind\r\n\r\ni spend so long grinding levels that combat becomes stale as fuck\r\nthat i forget whats even going on in the story and lose interest\r\n\r\nthat i hit a minor roadblock and literally no motivation to keep playing the game\r\n\r\nGo play Judgement",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Like a Dragon: Infinite Wealth is a turn-based RPG with a dozen other games included, and it's a good and decent experience that I found deeply derivative and unsatisfying. It is a high-quality game with a lot to enjoy, so my thumbs down is just a couple of degrees below the horizon line.\n\nI think you should only play this after playing Like a Dragon, which was a good starting point for the series. Gameplay-wise it's similar, but better overall. I enjoyed a lot of mini-games, and a lot of effort was spent on making many of the substories unique in some way, having a special mini-game or interesting boss battle. The main dish - tactical combat, JRPG style - is also fine, but that's where I start to complain, and I don't think I'll stop complaining until the end. The game has no difficulty selection (at least for the first playthrough) and if you engage with any side content you become overpowered fast, which means that the main gameplay mode - tactical combat - becomes just a chore. And side content was what I actually liked in this game, so the critical path quickly became boring. All of the tools available to you are mostly pointles there's a fun job-switching system, but there isn't much point in engaging with it unless you want to do the post-game extra-difficult dungeon. There's crafting and optional randomized dungeon clearing - and I enjoyed those, there you see glimpses of how this combat system can be used, but it again makes you overpowered. So pacing and balancing are way off.\n\nWhat remains is a story. I can't call it bad, but the thing is usually in this series the story is exceptional. It is simultaneously the most serious dramatic thing you've ever seen and also the silliest thing you've ever seen. And this one is more conventional, it's tongue-in-cheek, it knows that it's too dramatic and too silly from time to time. It doesn't feel sincere. On top of it, a lot of it is tone-deaf. The plight of little people is one of the big themes of the game, but the two biggest side activities in the game are a Pokémon-style fighting game where you force homeless and crazy people to fight for food, and a resort management game where the same homeless and crazy people are used as unpaid labor. It's played for laughs and I don't condemn the game for having those activities, but I personally couldn't enjoy them. Gameplay-wise they felt out of place too: the Pokémon game is a separate turn-based tactical combat mini-game and we already had one; the resort management game interrupts the normal game and is almost completely separate from it. You can play it for hours and forget how to play the main game, ha. The story is also very derivative. It feels like half of the side stories concern characters you've met in the previous game, and for the second protagonist most of what they do is reviewing references to previous games. I played these games and found this boring, I imagine if you haven't played Yakuza 0-6 you'll be confused on top of being bored. I can't say it's an \"objectively\" wrong way to write a story, or even that it's poorly written, but it feels the least unique and engaging entry in the franchise.\n\nSo here we are. I spent a lot of time on this game, and it wasn't that bad, but I mostly continued playing because I am committed to the series. If you want to skip one game in the franchise - skip this one.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Honestly I'm completely set up to love this game .. but it keeps on crashing .. like every 20 min. Frustrating AF!!!!\n\n***UPDATE***\n36 hrs in\n\nAfter updating my drivers the crashing frequency decreased .. but never went away. It was good enough to play more hours but when I got to Dokono Island the problem escalated again. I couldn't get through a single day without the game crashing. \n\nI don't have this issue with any other game and I feel like my system is way more than equipped to run this game. Really sad bc I do love the game itself, but this issue has made it unplayable for me.\n\n***final update***\nI really really want this game to work but it keeps on crashing. I'm going to stop trying now. :(\n\n***final final (?) update***\nin advanced settings you can turn off a graphics increasing function that did help a lot ... until it didn't anymore. Still getting crashes and now I'm done (after a couple more trys probably) trying anymore :( so frustrating",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ichiban in Yakuza 7 is stupid but for some reasons he has become even stupider in this game. You would think after all the events of Yakuza 7 he would be a bit more clever and less naive but no, Yokoyama decided to make Ichiban a literal manchild.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I was pretty excited for this one after Yakuza: Like A Dragon because they added the ability to move your characters in combat - my only gripe with the last game.\r\n\r\nBut unfortunately, everything else fell short. Right away, the main character suddenly decides he's in love with another character despite never having expressed any romantic interest in the first game. This will-they-won't-they isn't important to the rest of the story but it gets shoehorned it repeatedly anyway.\r\n\r\nThe main story was all right but the side quests weren't that good. Most of them were pretty sappy and I don't think I laughed once (the side quests in the last game had me sending screenshots to friends)\r\n\r\nI admittedly didn't do any of the romance stuff in the last game but I was surprised to find that most of those quests involve my character getting forced to do things against his will (I think there's a word for that?)\r\n\r\nWeapon crafting is fine but the food \"crafting\" (trading materials to an NPC) really sucks. It takes forever to gather enough materials to make anything good. Like there's no reason to make crappy food when I can just go next door and buy some.\r\n\r\nIf you watched videogamedunkey's video (like I did - whole reason I bought the 2 games), be warned that he shows you pretty much all the funny stuff. It all fits in one video.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It is quite literally insane how hard they washed down the initial YLAD7 cast in this game. The story is an unfixable mess and the continuation issues regarding Gaiden have been talked to death online without me even needing to play anything chronologically and pretend it matters.\nThis will probably be the last RGG game I purchased since following the stories for over a decade, first through playthroughs and then myself.\n\nThe recent summit was just the cherry on top of this hot pile of garbage since our lord and savior Nagoshi left and we are left with all creative decisions being obviously recycled or worse.\n\nShall the pirate game never touch my inventory– the true indicator of how over it is.\n\nYou can enjoy the gameplay I guess, but I have enough hours of mahjong, already get annoyed by the Umamusume crane game nowadays and better turn-based dungeons to play.\nThe island mechanics are too chopped to even make jokes about them being like Animal Crossing, tbh.\nA better money game than LAD7, but again I just made most of my money with mahjong and didn't need a spare dime since buying out shops.\n\nBest case would be for them to embrace the lack of seriousness in the lore by undoing Kiryu's cancer and turn him green or some shit, drop his stoicism, retcon all character deaths and have them be happy running an orphanage so everyone can have their favorite characters back and worst case mod their unchanged faces back on. With the option to continue dressing ALL of them up like barbie dolls.\n\nAdd Tomizawa karaoke and use the sega lottery + merchandise money to add the King Gnu albums to the game.\nCan't be bothered to write this anymore.\n\nLet's just make Ichiban proud and daydream ourselves into a world where Judgment has a chance to be continued.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Like a Dragon: Infinite Wealth delivers almost everything fans hoped for: a gripping story, emotional depth, chaotic humour, and the signature charm that has made the Yakuza/Like a Dragon series so loved worldwide. The gameplay is polished, the world is vibrant, and the characters—especially Ichiban—shine once again. Under normal circumstances, this would easily have been a 9/10 experience for me.\n\nUnfortunately, there is one element that genuinely pulled me out of the story and affected my enjoyment far more than I expected: YongYea’s voice acting.\n\nHis performance felt stiff, unnatural, and painfully out of place in a world filled with seasoned, emotionally convincing voice actors. His delivery lacked emotional weight, nuance, and authenticity—especially in scenes that were meant to be intense or heartfelt. Instead of pulling me deeper into the story, his lines often snapped me right out of it.\n\nWhen one performance is noticeably weaker than the rest of the cast, it stands out—and not in a good way. For me, it genuinely spoiled portions of the experience.\n\nA major character deserves a professional voice actor—not someone whose delivery feels like a YouTube reading rather than a performance.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Currently in CHapter 7 , man the story and sub stories + side activities are soo boring and dull. The only thing here thats somewhat good is the combat and different jobs each character have, other than that its a slop. just can't stand how bloated this game is with boring substories, terrible main story writing, and too big of a world",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The DLC for this game is unjustifiably expensive, and a vast majority of it is content that was very clearly plucked out of the main game to be sold back to us at inflated prices. For that reason alone I simply can't recommend buying this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This series fucking SUCKS now. Been playing this series for decades, and I've been slowing down as the stories just got sappier and cringier. You feel that rollercoaster of emotions at first but it just constantly bombards you until you're just numb to it and start skipping cutscenes. Bring back Yakuza.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Boring story, too much appeal to western fans, weak jrpg combat system and on top of it all I was forced onto Dodonko Island for more than an hour without an option to skip it :|",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Yakuza Franchise used to limit wacky and over the top comedy to the side quests while entertaining you with a gritty crime-noir main story. This is all non-sense Comedy and inconsistent World building.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "To say my playthrough attempt of this game has been a disaster, is an understatement. What started out REALLY hopeful when I went in with no expectations (even after an extremely negative experience with Yakuza: Like a Dragon) has ended up with me putting this easily in my top 5 worst games of all-time. If not pushing out Sonic 06 as my #1. This game, is beyond trash.\r\n\r\nFirst off, the technical issues. I've had this game crash more than anything else I've played, and I've played every game in RGG's library. Pirate Yakuza does not crash like this, Lost Judgment does not crash like this. So something is definitely wrong with this game in particular. I just had a crash, [spoiler] on Nele Island, at the end of the Bryce fight, after 2 hours of grinding out that dungeon. [/spoiler] I genuinely have never been so mad at a game in my life. This is not the first time I've crashed either, I've had at least 8 crashes throughout this playthrough. It happens during long sessions so I assume something isn't unloading over-time and keeps stacking up.\r\n\r\nThe gameplay issues: The lategame balance is terrible. I tried to get into it. I really enjoyed the earlygame, actually! Then every move falls off mid/lategame unless your name is Tomizawa and you are just able to element your way through it. But that's nothing compared to the level grinding! While intentionally taking extra fights than necessary because I anticipated a repeat of Majima/Saejima in Like A Dragon, I still spent 8 hours grinding extra levels in the finale before taking on the final Ichiban dungeon. As well as an extra 2 hours grinding before Majima/Saejima/Dojima. I am not looking forward to more level grinding for Kiryu's side and his party. The game is also balanced around exclusively using every single stat buff imaginable. If you aren't landing almost exclusively Proximity/Back attacks you are not doing damage with your basic attacks. Even if enemies are considerably lower level, even if they're (supposed to be, dungeons are weird) in Smackdown level. The RPG system is a cool concept but the balance is terrible and has fallen apart twice in a row with lategame. Fundamentals are a step up and feel more Yakuza but the enjoyment of the gameplay does not sustain throughout the game.\r\n\r\nAll in all? This is a mess. A complete, and utter mess. I went in extremely hopeful, even setting aside my low expectations and bad experience from my LaD playthrough. And it still ended up worse than LaD did. RGG, do better.\r\n\r\nAnd #RemoveKagawa for god's sake y'all are ridiculous even TRYING to cast him in Kiwami 3. You cast the sort of creep who's behavior would get them knocked out by Kiryu.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "SOooooooo Much Dialogue and cut scenes its more like a movie or a tv show then a video game. I have 9 hrs into this game and 95% of it is just watching the cut scenes and dialogue between characters. The combat system is pretty fun but everything feels super easy. As you level I feel like your stats don't even matter.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The gameplay is a phenomenal IMPROVEMENT over Yakuza 7 but the story is just one big atrocious dumpster fire of wasted potential with their themes and concepts mixed with character assassination for some if not most of the cast.\n\nEiji Mitamura, Dwight Mendez, Bryce Fairchild and Masataka Ebina are literally zero-substance mustache-twirling villains, and the circumstances for Ebina and Eiji being villains is just absolutely ridiculous I refuse to accept them as \"antagonists\".\n\nThere's other questionable aspects of the game like the Amons among others but I won't go too far into those. Also, fuck the DLC practices here. SEGA's greed at its finest.\n\nSoundtrack is also meh at best with a few exceptions.\n\nYamai and Tomizawa were goated though, love those guys.\n\nI'm personally giving this game a 3 or 4 out of 10, 5 or 6 at best. Only saving graces are the gameplay improvements, some of the music tracks, and Yamai and Tomizawa.\n\nYou're better off playing 7 for a better quality story with Ichiban.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I love the Like a Dragon franchise, but the games with Kasuga as a protagonist simply don't cut it.\n\nNow the Prologue of the game was fucking amazing. So well executed. With criticism against Japans harsh Anti-Yakuza-Laws. Then the very moment they go this stupid \"Kasuga is a hero like in a game!\"-route again it all crumbles down in an instant.\n\nFirst: The whole Reboot thing doesn't work. This game here is literally a continuation of Kiryus Story which started with Yakuza 1 back in the days. Heck. Even the final achievement makes this very clear. You really need to have played every game to understand what is going on.\n\nThey crammed Kasuga in here with his whole \"Looking for my mother!\"-story. But this part is so irrelevant. Because everything would've happened without him anyways. He feels like a side character.\n\nNot that the story is worth much anyways. The game just goes in circles for around 8 chapters, making you slog through a ton of lengthy minigame explanations. Then one or teo interesting things happen. Thennit's more time wasting until the ending cutscene which was rather nice again.\n\nSpeaking of cutscenes. I loved the franchise for them. But in this game they are mostly just \"Everybody standing around while somebody has a 20 minute exposition dialogue\"\n\nNow if only the gameplay would hold up. But it does not. Hawaii with its palm trees is a nice setting. There are some cool new characters. And the battles can be fun to watch for a bit. But that's it.\n\nThe downsides are that this is a turn based battle system where positioning of characters is important ... but you can barely influence their position. Everybody is just randomly walking around. Enemies tend to move out of your AoE. And its also important to push enemies into other enemies or your allies for extra damage ... but often you miss that despite specifically aligning everything with the arrows the game displays.\n\nAnd then enemies actually have death protection. Sometimes you would do enough damage ... the game just says: Nope! Wait until next round. Another hit please!\n\nIt's not that this makes it hard. Just annoying. It's stretching game time. And it's especially annoying as you often encounter enemy groups with 8 people and you always have to wait for all of them to make their attack befoee it's your turn. In the worst scenarios this leads to situations where you win one battle, get sent to the next and then get a game over as you can't do anything but watching how your team gets pummeled.\n\nThis franchise was never made with turn based battles in mind and it shows. This game often seems to cry \"Let me be real time!\" with Kiryus attack which actually lets you fight a few seconds real time again.\n\nAnd on top of this where is still the problem of tone: These over the top silly enemies simply don't fit a story about revenge and social criticism. One second you fight oversized people using a pizza as a shield and eating it to heal, then you are supposed to take a scene serious where a guy gets cut open.\n\nThen the new map is barely used. It felt like there were exactly 2 points on the map. Because for every new main mission you had to run from one end to the other and then back again. Sometimes not even for a real reason but \"We should rest a bit!\" Despite easily available quick travel that felt really lazy.\n\nIf they hadn't included the old characters I would've skipped it. Now's just hoping that this is really the end of the old cast, so I can skip any new games they make about Kasuga. At least some of the good parts like Hawaii are reused in Gaiden 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Начинается всё вполне неплохо, кроме того факта, что Ичибана опускают и попускают в первые же 2-3 часа ниже плинтуса сначала женщина, которая зафрендзонила, потом какая-то ебучая витуберша? Какой ВЫБЛЯДОК СЫНША придумал это? Ну ладно, допустим, это просто затравка чтобы затравить для сюжета.\r\n\r\nЗавязка сюжета оправдана, в начале, так как классическое «хз что там с ней произошло после того как %вставьте событие%». И внезапно ЖОРА и его кринжовое агенство там тоже оказывается ВНЕЗАПНО. Очень удобно, скрестили двух главных персонажей, окей. И после этого мы наблюдаем прекрасный дуэт, всё идёт вроде круто, в стиле якудзы и т.д. Встреча с обоими барменами (когда они видят Кирюху) произошла крайне ХОЛОДНО и максимально тупо, хотя можно было очень сильно развить этот сюжет далее. Потом тебе дают играть за КИРЮХУ и начинается эдакое «прощание» с персонажем, через его довольно хорошие сабстори и эксклюзивное для него занятие, открывающееся постепенно с прохождением сюжета. И ты такой: «А нахуя нам это надо, у нас же вроде был Гайден и он должен был как раз содержать всё то, что мы сейчас впитываем». И с этим откровением для себя ты сидишь до конца игры БУКВАЛЬНО. Когда тебе передают контроль за Кирюху – про Ичибана можно забыть, ибо с этого момента на него как персонажа ссут, срут, блюют, кончают, одевают, раздевают, отпевают. Абсолютное ничего с Ичибаном, и потом обратное переключение на Кирюху, который двигает сюжет и как бы намекает, что эта игра изначально и задумывалась + сделана, чтобы опять вернуть его как главного персонажа в основной сюжет. Но, вопрос, а зачем + нахуя тогда было заряжать его РАКОМ путем падения БОЧКИ с радиоактивными отходами на голову? И вопрос – нахуя было его вообще помещать в этот комплекс по переработке отходов? Самое худшее и галимое объяснение. Пока ты довольствуешься фан-сервисом и сюжетной разрядкой за Кирюху, на Гавайях у Ичи происходит тотальный пиздeц (ничего не происходит, ходим болтаем и плачем).  На самом деле тут очень много текста и мыслей выходит про сюжет, можно просто подытожить, что он в целом eбаное говнище, и для объяснения долгожительства главного плохого челика (где-то 100 лет и как огурчик) нужно потратить еще 70$ и пройти пиратов якудза на гавайях, которые вышли спустя год этой игры. Во всем остальном – на привычных и лучших персонажей (Дайго, Саеджима и Маджима и прочие) буквально нассали, опозорили всеми возможными способами, в отместку на появление каких-то единичных дегенератов, вышедшими MVP почти во всех ситуациях. Исключением является только Ямай (он же Замай). Кажется, это единственный персонаж, который не ошибся и не показался идиотом в этой игре вообще. А концовка так вообще лютый собачий кайф чуть придушивая до звёздочек в глазах – бедного Кирюху будут использовать буквально до посинения (наверняка придумают какое-то невероятное лекарство от рака в следующих частях, и дракон будет жить вечно, подумала SmEGmA), а Ичибана отмудохали до полусмерти пока он дефал и нёс на себе eблана, который его чуть не убил несколько раз, особенно, когда он пайп-бомбу ему в ноги кинул. Это просто плохие поступки! Человек-то хороший!\r\n\r\nВ плане геймплея тут ничего не поменялось. Стало чуть лучше и в целом всё супер. Не жалуюсь. Появились новые классные РАБОТЫ, остались старые, не измененные, но дополненные. Всякие комбо, добивающие удары и эссенции тоже надобавляли и сделали ещё лучше, с классическим жмыхом из космоса лучом дружбы, ваншотающим всех. Опять же – хочется выделить класс с револьвером, наверное, самый лучший. После него – самурай. Для женщин хороши теннис, домработница и их стандартные классы. Кроме главной кореянки, у неё только 1-2 полезных скилла, остальное мусор, даже эссенс. То есть, полная копипаста 7 части с улучшением и добавлением играбельных и весомых классов, тут постарались, базару Джексон.\r\n\r\nПройдёмся по мини-играм. Вполне фановый, но заeбный СУПА КРЕЗИ ДЕБИБАБАРИ, достаточно пофармить его ради шмоток, ачивки и еще пары штук. Легко, задорно, красиво. Фоткать фриков тоже неплохо. Ловить рыбу вручную, плавая, ну, сойдет. Опять ебучий марио карт, ладно. Опять гонки за мусором… в общем, добавили абсолютно все, что было до этого, в 7 части. Очень много караоке, мне нравится. \r\n\r\nТранспорт в виде самокатов норм, жалко, что в процессе поездки всё же нарваться на ДРАТЬСЯ можно, а объехать это говно бывает трудно. \r\n\r\nПодойдем к самому главному. Кого eбут вообще покемоны или что это блять вообще в игре? Это такая параша, что, буду честен, я просто уже включил доскональные гайды и трейнер, чтобы пройти это дерьмище ради гостей на Дундоко остров, шмоток и прочего, и прочего. И самые топовые эти животные закрыты за ДЛЦ в дохуя деревянных. Это такая дерьмина невыносимая, что не хочется даже обсуждать это далее. \r\n\r\nА, да. ДУНДОКО АЙЛЭНД. Фух, ну, тут все познается в сравнении. Это, наверное, самый худший бизнес из всех существующих. Тут японцы, видимо, подсмотрели у Тодда Дегроварда. Eбать, говорит японец на идеальном русском, смотрите сколько игроков в Фолыче 4 и как им нравится эта поделка дерьма и мочи! Все 100% хотят потратить дохуя времени половить рыбок, побить камни, деревья и мешки с мусором (Саня Овер, привет) битой, поймать пару бабочек с ЛЕГУСЬКАМИ и потом с невероятно коротким (как мой XУЙ) промежутком времени, отведенным для дневных деяний, успеть построить всякое говнище для обожаемых, уважаемых гостей, фарм денег с оных не достигает тех равносильных значений и сумм по отношению ко времени и действии, которые хотелось бы иметь! Потому что, бляTь! Денег с данжей последнего уровня (этажей) у тебя будет за 10 минут больше, чем за 1 (один (one (uno (eins)))) eбаный час этого шизоидного высера под названием ДУНДОКО ОСТРОВ! Фух, ну тут еще можно потренировать свой покемон-мусор, сойдёт, am I right, fellas? Единственное самое смешное и фантастичное, что они смогли сделать – это делиться своим островом в ОНЛАЙНЕ. Когда открываешь глобальный список и самые популярные - это разновидности острова Эпштейна, австрийский художников, ну и всякое, что БАН. Сообщество тут не подвело, снял шляпу, хорош, мужики. В целом, это, конечно, хорошая фича с постройкой из ассетов всей игры, по типу Гаррис мода, особенно заполнение своего домика внутри. Но чтобы это полноценно открыть и использовать… Да и нахера это тут надо? Японцы пробуют себя в каком-то новом русле или что? С одной стороны – мне он понравился. Опять же, лёгкий аутизм такого вида это определенного рода вайб, не спорю. Но с другой, все эти не пропускаемые диалоги, все эти недосабстори с этим связанные и сюжет в целом вокруг этого острова это ЗАЛУПA. \r\n\r\nЧто мы имеем? Геймплейно всё сохранилось + улучшилось, многие тут могут со мной не согласиться, мне похуй. Играть в это? Можно. Расценивать это как продолжение серии и номерной частью сюжетно? Твою мать, комментарии излишне. Начали хорошо (относительно), закончили за такой упокой, что даже и не ждётся как-то новая. Бизнес? Худшее дерьмо. Мини-игры? Тотальная копипаста, это не ново для якудз, но добавили несколько неплохих, которые делаются буквально ещё по пути куда-нибудь сюжетно. Добавить что-то своё, в отсутствие при этом Нагоши? Просто бросайте эту хуйню, убивайте Кирюху и Ичибана и закрывайте сарай. Фан-сервис? Мразотнейший, начинающийся и ничем не заканчивающийся, а также закрытый за ДЛЦ с сабстори и общей пати из всех персонажей за 15+ грязных зеленых бумажек. \r\nТочно! Ещё почему не советую – потому что дегенераты в СЕГЕ прощупывают плацдарм в виде платных вырезанных фич, доступных в базовых версиях ВСЕХ предыдущих частей. Типа, как якудзаслоп можно ещё подороже продать идиотам, готовым схавать всё подряд, связанное с этой франшизой, ну типа как фантастическим тварям, которым парень жены разрешает играть в Марио, Зельду и т.д. \r\n\r\nНГ+ в виде ДЛЦ за 15-20 баксов? Вы че ебнутые? Спасибо, кремпай, за бесплатное предоставление этих «ДЛЦ». И спи спокойно, серия Якудза. Ты была очень хороша. Поставил свечку за неё (СЕГЕ в жепу).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After just 8 hours of gameplay, I couldn't stomach this game any longer. This has to be one of the worst games I've played in this genre. I don't get the appeal (given all the great reviews on sites and on Steam). I'm definitely missing something. But here is why I quit:\n\n- The protagonist is the biggest, pathetic loser I've ever had to play in a video game. I'm sure it has something to do with the Japanese->English translation, so in English, everything that came out of Ichiban Kasuga's mouth was cringe and embarrassing. This game has some very long cutscenes with a lot of filler dialogue that's so unnecessary. It was like listening to the most boring conversation you could imagine.\n\n- Terrible save game system. A couple times after a long battle, the quick save is disabled and it wouldn't give you time to do a manual save because it would pull you right into another long and boring cutscene. During this time, the game would sometimes crash, and I'd have to load an old save game and redo the whole battle again. Such a ridiculous game design. I keep my gaming rig cool and stable, and I play a lot of games. This game has crashed on me more times than any game I can remember. \n\nI'm just happy that I got this on a good sale and didn't pay full price.\n\n1 out of 5 stars",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There are no orphanages in America.  The legal structure for it just doesn't exist.  There might be edge cases of foster parents grossly abusing the program but the concept of a structured orphanage just has not existed in America for decades.  The type of foster situation depicted would put the people at the top all over the media!  Never even minding the bizarre cult that comes off as crass parody, which does all this and also miraculously protects the identity of the McGuffin, the plot doesn't make ANY sense.  Why set your plot outside of Japan if you are just going to make pretend it's Japan??  It's not just the orphanage, it's cultural stuff all over the place.  The writing is filtered through a prism that distorts way too much for anything coherent to emerge.\n\ne - the more I think about it, the dumber it gets.  so many natural born and raised English speakers are just primed and ready to speak fluent Japanese and bow/respect with perfect mannerisms at any Asian looking person.  except when these people speak in English, which they always contextually know when to do, and depending on the budget for the character can range from distracting and thick accented English to native competency but Fiverr delivery.  I played with Japanese audio and out of empathy for my fellow man I refuse to imagine the nightmare the English voice director probably went through trying to interpret the intention.\n\nThere's a whole lot one could say about the treatment of Ichiban as a foreign national \"without an identity\" but I suppose if you just wanted to get over it you could chalk all of that up to commentary on the universal treatment of police on the vulnerable, and yes, American prejudice.  However, you just can't terminate the thought there like the writing wants you to.  The way the story draws out its painful legal arguments to Ichiban's predicaments makes you realize the writers don't actually have a clue what would happen.\n\nRereading this makes me realize all of this applies to Chitose just as fairly, though at least in her case the emotional confusion itself is much more fundamental to her story.  There are other gross obvious problems with her story that actually have nothing to do with the immigrant tale but let's hold on to an emotional hook where we can get it.  I guess after my 35 hrs I find Kiyru's story the most credible overall but there's almost nothing to it at the point I gave up so maybe I didn't give them time to cook and make something awful.\n\nLanguage and cultural barriers are intimate and significant to Ichiban's fish out of water with the exception of when translating across boundaries is just too hard.  Lame, and ill advised.  This becomes especially obnoxious when there is so much tedious dialog that adds nothing where that kind of tedium would have semantically made sense in other places.\n\ne - gameplay is fine.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The story is meh and the characters are badly written compared to who they were in the first Like a Dragon, Ichiban especially. If you're here for just the combat and wacky random things that happen similar in previous games, then you'll find what you want here.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Story sucks so bad. while the first had the best story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is really really bad the fighting system is really bad it is like for 5 year olds even have auto fight system ???? not good not normal it is a joke , game is for kids not interesting fighting in old games were really good ... Story is not bad but not interesting and it is really really long like talking is so slow it is crazy and amount of cutscenes are crazy and really long not good and not interesting to make you continue playing the game that is why i stop playing game is bland it is a Joke do not understand amount of praising and people loving it even old Yakuza games are really Boring games nothing is interesting it is a shame of a game .... to add dating and other stuff are not needed they could add skip those things i do not want to play dating game or driving working as a delivery guy like what is this real life simulator everything is long and boring it is insanity ????",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a dragon infinite dogshit, i hate this gay , its turn based yakuza so doesnt fit yakuza series entirely, and the story is soo dogshit too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what drugs dev using while writing LAD:IW story?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I sincerely wish I could give a Mixed review on this game. Coming into LAD8, my expectations were through the roof. A game where the prior Kiryu and Ichiban pave way for the Yakuza to be liberated from the past and allow the lost souls, bounded by a life of crime to have a future? Incredible, FANTASTIC premise...only for them to barely follow through with any of it after the prologue. \n\nThe gameplay is a gigantic step up from Yakuza 7 in every possible way, with Kiryu's Dragon Of Dojima style being near perfectly transitioned from beat em up combat to turn based combat, even if I think the skills tied to that class suck.\n\nHawaii's a fun map with a lot of interesting things going on there, but that's about the most I have to say that's positive about it. The amount of god damned minigame padding (FUCK Dondoko island) was absolutely aggravating. \n\nThe story and writing is where I begin to take issue with this game. I can't decide whether I love or hate this game, where I initially came into this game adoring it and later on starting to dislike it more and more as I let the game sit in my mind. Ichiban is a complete and utter caricature of the man he was in Yakuza 7, I think his relationship dynamic with his love interest is god awful, and he does little aside from talk no jutsu a few characters out of their slumps/evil ways (don't even get me started on them. Anyone who's played the game knows who I'm talking about).\n\nKiryu I take less issue with. In fact, his role in the story was the only reason I was really kept engaged in the story to begin with. However, it seems kind of ironic that our new protagonist has taken the support role for the man who's had 3 finale games now.\n\nIt hurts me to say this, but I could feel my honeymoon period for this franchise slowly start to erode over time since their botched combat remake of Like A Dragon: Ishin. This franchise took me out of a dark place in my life, and it hurts to see such a stark drop in quality in story telling and character writing.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Infinite Wealth starts out with great gameplay that by the end becomes exhausting and absurdly boring, the story has an interesting premise that completely drops in writing quality halfway through the game and just keeps getting worse the more you play. The antagonists in Infinite Wealth are by far the worst in the entire franchise.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "You can really tell the story in this game got heavily influenced by executives that never wrote a story in their life, there's a lot of out of character moments, loop holes for the sake of advancing the story, characters that were brought back even so it was made incredibly clear that they were dead, and scenes that's clearly trying to copy popular scenes from previous works without understanding why they were popular. This story feels like it was written by a statistic major looking at data of what people liked and just slapped them together into an incoherent piece of work, like a dish made out of the most popular ingredients, except none of them synergize with each other.\r\n\r\nThe gameplay is alright, my biggest complaint about the combat system is that successful blocks barely does anything, so you'll still get stat checked by a lot of enemies especially in substories. Main quest tells you the upcoming enemies' levels, but substories don't even so they differ a lot, one moment you're fighting 4 lvl 40s, but then you do the next substory and you're fighting 10 lvl 53s.\r\n\r\nThe sidestory minigames that every game in this franchise has feels incredibly weak in this game too. Dodonko island is just grinding, it's basically bootleg stardew valley with barely anything to do. Sujimon also gets boring very quickly, imagine pokemon, but all your pokemons only has 1 move, that's what sujimon is. Sujimons do have ults, but most fights end so quickly that you won't need them, and honestly, why is there even a turn based combat minigame in a turn based combat game? If I want to play turn based combat I'd just...keep playing the main game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Great game no doubt, the graphics is good, side stories are hilarious, combat feels engaging. The main story line is... not its strong point, especially the final few chapters, but overall I enjoyed the game. \nThe why did I give it a thumbs down? There is a very annoying issue with the game - game crashes. \nThis game will crash randomly every 1-3 hours. \"Just save the gave frequently\" you might say, the issue is in dungeons or certain part of the main story, you have to fight through a series of enemies before you reach a save point. One crash during it can waste you maybe 20-30 minutes of game time. During my playthrough, often when I finally beat down multiple waves of enemies, finished the chapter, and was watching the cutscenes of the next chapter - game crashed. I have to reopen the game, fight those enemies of the last chapter again, then rewatch the cutscenes. Those crashes were INSUFFERABLE. Crashes like that made me not want to open the game when I get home. (Somebody on Reddit said capping frames to 60 and turning off DLSS helped, I'll just say mine was capped at 120 and it still crashed frequently, also I didn't buy a better pc and monitor just to play games at 60 fps, this kind of issue should've been fixed long ago, but it's not.) These crashes made killed my motivation to open the game and finish Dondoko Island and Sujimon Battle.\nWhat's more? Oh yeah, NG+ and it's achievements, cannot believe any sane dev would lock NG+ behind DLC and made NG+ achivements impossible if you only have base game. \n\nThumbs down.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A masterpiece and gem of a RGG game, only to have the entire experience soured by the paid NG+ fiasco. As petty as it seems, can't bring myself to spend even a few dollars (on discount) on what has always existed for free on every previous mainline RGG game. \n\nIf there was a point system, I would have given the score a 1/10 instead of outright not recommending it (like what is being done now, just a Yes or No on recommendation), just to exhibit my displeasure towards the paid NG+ thing.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I quit cause it was really boring to me. The combat is vastly improved but the story seemed to have been sacrificed for it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The appeal to me about the Like a Dragon Yakuza games was that it felt like a traditional Dragon Quest RPG in the turn based battle and equipment department.  But outside of that, this game is so bloated with nonsense and filler it feels like a chore to play.  I've played approx 14 hours and I think only 5 of it has been exploration, battles/boss battles and treasure hunting.  There is sooooooo many voice dialogue cut scenes and soooooooo much filler mini games that its not fun.  By the time i got to anaconda mall, the anaconda escape and the sujimon battles put me over the edge when it comes to patience.  I do not want to sit and watch dramatic BS dialogue cut scenes for a pokemon rip off mini game nor do i want to play a mini game every thirty minutes in this game.  It already had \"pound pals\" and adding sujimon seems like overkill and it is.  \n\nThe graphics in the game are nice, and i like the FPS and overall presentation of the menus and the variety of equipment and items etc.... but the non stop forced dialogue cut scenes, non stop mini games and cell phone interactions with aloha app and dating app it's all just too much BS for someone like me's who's trying to play and experience a story and build up a character party to go on rewarding side quests and missions to be the strongest and best person in a game.  If they cut out 100% of the dialogue scenes and mini games it would be a much better game.  but alas it's not, it's just a time wasting boring chore of a game and i do not recommend it at all.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "this game was great except everything is tied to level and i have to grind to get up to the right level and money and items to keep playing the game\r\n\r\nive sunk 120 hours into this shit\r\nand i still consider it mid tier for a yakuza game but i wanted to finish the game\r\nexcept im not high enough level and im losing to the end bosses of the game\r\n\r\nthats fine i guess ill just load an earlier save and regrind up to the right level\r\n\r\n\r\nexcept no i already have a goddamn full time job\r\ni just got the point where i was like yeah\r\nya know what i dont give a shit anymore\r\n120 hours, a 100 and fucking 20.\r\nill just watch the ending\r\n\r\nno i probably won't i dont care enough\r\n\r\n\r\nLook \r\nthis is a good game\r\nall the yakuza games are great\r\n\r\nbut fuck me\r\nshorten it\r\nor dont make the main story tied to doing all the side content and encounters\r\nwhat the fuck happened to just being able to play through the game without having to grind\r\n\r\ni spend so long grinding levels that combat becomes stale as fuck\r\nthat i forget whats even going on in the story and lose interest\r\n\r\nthat i hit a minor roadblock and literally no motivation to keep playing the game\r\n\r\nGo play Judgement",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Like a Dragon: Infinite Wealth is a turn-based RPG with a dozen other games included, and it's a good and decent experience that I found deeply derivative and unsatisfying. It is a high-quality game with a lot to enjoy, so my thumbs down is just a couple of degrees below the horizon line.\n\nI think you should only play this after playing Like a Dragon, which was a good starting point for the series. Gameplay-wise it's similar, but better overall. I enjoyed a lot of mini-games, and a lot of effort was spent on making many of the substories unique in some way, having a special mini-game or interesting boss battle. The main dish - tactical combat, JRPG style - is also fine, but that's where I start to complain, and I don't think I'll stop complaining until the end. The game has no difficulty selection (at least for the first playthrough) and if you engage with any side content you become overpowered fast, which means that the main gameplay mode - tactical combat - becomes just a chore. And side content was what I actually liked in this game, so the critical path quickly became boring. All of the tools available to you are mostly pointles there's a fun job-switching system, but there isn't much point in engaging with it unless you want to do the post-game extra-difficult dungeon. There's crafting and optional randomized dungeon clearing - and I enjoyed those, there you see glimpses of how this combat system can be used, but it again makes you overpowered. So pacing and balancing are way off.\n\nWhat remains is a story. I can't call it bad, but the thing is usually in this series the story is exceptional. It is simultaneously the most serious dramatic thing you've ever seen and also the silliest thing you've ever seen. And this one is more conventional, it's tongue-in-cheek, it knows that it's too dramatic and too silly from time to time. It doesn't feel sincere. On top of it, a lot of it is tone-deaf. The plight of little people is one of the big themes of the game, but the two biggest side activities in the game are a Pokémon-style fighting game where you force homeless and crazy people to fight for food, and a resort management game where the same homeless and crazy people are used as unpaid labor. It's played for laughs and I don't condemn the game for having those activities, but I personally couldn't enjoy them. Gameplay-wise they felt out of place too: the Pokémon game is a separate turn-based tactical combat mini-game and we already had one; the resort management game interrupts the normal game and is almost completely separate from it. You can play it for hours and forget how to play the main game, ha. The story is also very derivative. It feels like half of the side stories concern characters you've met in the previous game, and for the second protagonist most of what they do is reviewing references to previous games. I played these games and found this boring, I imagine if you haven't played Yakuza 0-6 you'll be confused on top of being bored. I can't say it's an \"objectively\" wrong way to write a story, or even that it's poorly written, but it feels the least unique and engaging entry in the franchise.\n\nSo here we are. I spent a lot of time on this game, and it wasn't that bad, but I mostly continued playing because I am committed to the series. If you want to skip one game in the franchise - skip this one.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Honestly I'm completely set up to love this game .. but it keeps on crashing .. like every 20 min. Frustrating AF!!!!\n\n***UPDATE***\n36 hrs in\n\nAfter updating my drivers the crashing frequency decreased .. but never went away. It was good enough to play more hours but when I got to Dokono Island the problem escalated again. I couldn't get through a single day without the game crashing. \n\nI don't have this issue with any other game and I feel like my system is way more than equipped to run this game. Really sad bc I do love the game itself, but this issue has made it unplayable for me.\n\n***final update***\nI really really want this game to work but it keeps on crashing. I'm going to stop trying now. :(\n\n***final final (?) update***\nin advanced settings you can turn off a graphics increasing function that did help a lot ... until it didn't anymore. Still getting crashes and now I'm done (after a couple more trys probably) trying anymore :( so frustrating",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ichiban in Yakuza 7 is stupid but for some reasons he has become even stupider in this game. You would think after all the events of Yakuza 7 he would be a bit more clever and less naive but no, Yokoyama decided to make Ichiban a literal manchild.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I was pretty excited for this one after Yakuza: Like A Dragon because they added the ability to move your characters in combat - my only gripe with the last game.\r\n\r\nBut unfortunately, everything else fell short. Right away, the main character suddenly decides he's in love with another character despite never having expressed any romantic interest in the first game. This will-they-won't-they isn't important to the rest of the story but it gets shoehorned it repeatedly anyway.\r\n\r\nThe main story was all right but the side quests weren't that good. Most of them were pretty sappy and I don't think I laughed once (the side quests in the last game had me sending screenshots to friends)\r\n\r\nI admittedly didn't do any of the romance stuff in the last game but I was surprised to find that most of those quests involve my character getting forced to do things against his will (I think there's a word for that?)\r\n\r\nWeapon crafting is fine but the food \"crafting\" (trading materials to an NPC) really sucks. It takes forever to gather enough materials to make anything good. Like there's no reason to make crappy food when I can just go next door and buy some.\r\n\r\nIf you watched videogamedunkey's video (like I did - whole reason I bought the 2 games), be warned that he shows you pretty much all the funny stuff. It all fits in one video.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It is quite literally insane how hard they washed down the initial YLAD7 cast in this game. The story is an unfixable mess and the continuation issues regarding Gaiden have been talked to death online without me even needing to play anything chronologically and pretend it matters.\nThis will probably be the last RGG game I purchased since following the stories for over a decade, first through playthroughs and then myself.\n\nThe recent summit was just the cherry on top of this hot pile of garbage since our lord and savior Nagoshi left and we are left with all creative decisions being obviously recycled or worse.\n\nShall the pirate game never touch my inventory– the true indicator of how over it is.\n\nYou can enjoy the gameplay I guess, but I have enough hours of mahjong, already get annoyed by the Umamusume crane game nowadays and better turn-based dungeons to play.\nThe island mechanics are too chopped to even make jokes about them being like Animal Crossing, tbh.\nA better money game than LAD7, but again I just made most of my money with mahjong and didn't need a spare dime since buying out shops.\n\nBest case would be for them to embrace the lack of seriousness in the lore by undoing Kiryu's cancer and turn him green or some shit, drop his stoicism, retcon all character deaths and have them be happy running an orphanage so everyone can have their favorite characters back and worst case mod their unchanged faces back on. With the option to continue dressing ALL of them up like barbie dolls.\n\nAdd Tomizawa karaoke and use the sega lottery + merchandise money to add the King Gnu albums to the game.\nCan't be bothered to write this anymore.\n\nLet's just make Ichiban proud and daydream ourselves into a world where Judgment has a chance to be continued.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Like a Dragon: Infinite Wealth delivers almost everything fans hoped for: a gripping story, emotional depth, chaotic humour, and the signature charm that has made the Yakuza/Like a Dragon series so loved worldwide. The gameplay is polished, the world is vibrant, and the characters—especially Ichiban—shine once again. Under normal circumstances, this would easily have been a 9/10 experience for me.\n\nUnfortunately, there is one element that genuinely pulled me out of the story and affected my enjoyment far more than I expected: YongYea’s voice acting.\n\nHis performance felt stiff, unnatural, and painfully out of place in a world filled with seasoned, emotionally convincing voice actors. His delivery lacked emotional weight, nuance, and authenticity—especially in scenes that were meant to be intense or heartfelt. Instead of pulling me deeper into the story, his lines often snapped me right out of it.\n\nWhen one performance is noticeably weaker than the rest of the cast, it stands out—and not in a good way. For me, it genuinely spoiled portions of the experience.\n\nA major character deserves a professional voice actor—not someone whose delivery feels like a YouTube reading rather than a performance.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Currently in CHapter 7 , man the story and sub stories + side activities are soo boring and dull. The only thing here thats somewhat good is the combat and different jobs each character have, other than that its a slop. just can't stand how bloated this game is with boring substories, terrible main story writing, and too big of a world",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The DLC for this game is unjustifiably expensive, and a vast majority of it is content that was very clearly plucked out of the main game to be sold back to us at inflated prices. For that reason alone I simply can't recommend buying this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This series fucking SUCKS now. Been playing this series for decades, and I've been slowing down as the stories just got sappier and cringier. You feel that rollercoaster of emotions at first but it just constantly bombards you until you're just numb to it and start skipping cutscenes. Bring back Yakuza.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Boring story, too much appeal to western fans, weak jrpg combat system and on top of it all I was forced onto Dodonko Island for more than an hour without an option to skip it :|",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Yakuza Franchise used to limit wacky and over the top comedy to the side quests while entertaining you with a gritty crime-noir main story. This is all non-sense Comedy and inconsistent World building.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "To say my playthrough attempt of this game has been a disaster, is an understatement. What started out REALLY hopeful when I went in with no expectations (even after an extremely negative experience with Yakuza: Like a Dragon) has ended up with me putting this easily in my top 5 worst games of all-time. If not pushing out Sonic 06 as my #1. This game, is beyond trash.\r\n\r\nFirst off, the technical issues. I've had this game crash more than anything else I've played, and I've played every game in RGG's library. Pirate Yakuza does not crash like this, Lost Judgment does not crash like this. So something is definitely wrong with this game in particular. I just had a crash, [spoiler] on Nele Island, at the end of the Bryce fight, after 2 hours of grinding out that dungeon. [/spoiler] I genuinely have never been so mad at a game in my life. This is not the first time I've crashed either, I've had at least 8 crashes throughout this playthrough. It happens during long sessions so I assume something isn't unloading over-time and keeps stacking up.\r\n\r\nThe gameplay issues: The lategame balance is terrible. I tried to get into it. I really enjoyed the earlygame, actually! Then every move falls off mid/lategame unless your name is Tomizawa and you are just able to element your way through it. But that's nothing compared to the level grinding! While intentionally taking extra fights than necessary because I anticipated a repeat of Majima/Saejima in Like A Dragon, I still spent 8 hours grinding extra levels in the finale before taking on the final Ichiban dungeon. As well as an extra 2 hours grinding before Majima/Saejima/Dojima. I am not looking forward to more level grinding for Kiryu's side and his party. The game is also balanced around exclusively using every single stat buff imaginable. If you aren't landing almost exclusively Proximity/Back attacks you are not doing damage with your basic attacks. Even if enemies are considerably lower level, even if they're (supposed to be, dungeons are weird) in Smackdown level. The RPG system is a cool concept but the balance is terrible and has fallen apart twice in a row with lategame. Fundamentals are a step up and feel more Yakuza but the enjoyment of the gameplay does not sustain throughout the game.\r\n\r\nAll in all? This is a mess. A complete, and utter mess. I went in extremely hopeful, even setting aside my low expectations and bad experience from my LaD playthrough. And it still ended up worse than LaD did. RGG, do better.\r\n\r\nAnd #RemoveKagawa for god's sake y'all are ridiculous even TRYING to cast him in Kiwami 3. You cast the sort of creep who's behavior would get them knocked out by Kiryu.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "SOooooooo Much Dialogue and cut scenes its more like a movie or a tv show then a video game. I have 9 hrs into this game and 95% of it is just watching the cut scenes and dialogue between characters. The combat system is pretty fun but everything feels super easy. As you level I feel like your stats don't even matter.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The gameplay is a phenomenal IMPROVEMENT over Yakuza 7 but the story is just one big atrocious dumpster fire of wasted potential with their themes and concepts mixed with character assassination for some if not most of the cast.\n\nEiji Mitamura, Dwight Mendez, Bryce Fairchild and Masataka Ebina are literally zero-substance mustache-twirling villains, and the circumstances for Ebina and Eiji being villains is just absolutely ridiculous I refuse to accept them as \"antagonists\".\n\nThere's other questionable aspects of the game like the Amons among others but I won't go too far into those. Also, fuck the DLC practices here. SEGA's greed at its finest.\n\nSoundtrack is also meh at best with a few exceptions.\n\nYamai and Tomizawa were goated though, love those guys.\n\nI'm personally giving this game a 3 or 4 out of 10, 5 or 6 at best. Only saving graces are the gameplay improvements, some of the music tracks, and Yamai and Tomizawa.\n\nYou're better off playing 7 for a better quality story with Ichiban.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I love the Like a Dragon franchise, but the games with Kasuga as a protagonist simply don't cut it.\n\nNow the Prologue of the game was fucking amazing. So well executed. With criticism against Japans harsh Anti-Yakuza-Laws. Then the very moment they go this stupid \"Kasuga is a hero like in a game!\"-route again it all crumbles down in an instant.\n\nFirst: The whole Reboot thing doesn't work. This game here is literally a continuation of Kiryus Story which started with Yakuza 1 back in the days. Heck. Even the final achievement makes this very clear. You really need to have played every game to understand what is going on.\n\nThey crammed Kasuga in here with his whole \"Looking for my mother!\"-story. But this part is so irrelevant. Because everything would've happened without him anyways. He feels like a side character.\n\nNot that the story is worth much anyways. The game just goes in circles for around 8 chapters, making you slog through a ton of lengthy minigame explanations. Then one or teo interesting things happen. Thennit's more time wasting until the ending cutscene which was rather nice again.\n\nSpeaking of cutscenes. I loved the franchise for them. But in this game they are mostly just \"Everybody standing around while somebody has a 20 minute exposition dialogue\"\n\nNow if only the gameplay would hold up. But it does not. Hawaii with its palm trees is a nice setting. There are some cool new characters. And the battles can be fun to watch for a bit. But that's it.\n\nThe downsides are that this is a turn based battle system where positioning of characters is important ... but you can barely influence their position. Everybody is just randomly walking around. Enemies tend to move out of your AoE. And its also important to push enemies into other enemies or your allies for extra damage ... but often you miss that despite specifically aligning everything with the arrows the game displays.\n\nAnd then enemies actually have death protection. Sometimes you would do enough damage ... the game just says: Nope! Wait until next round. Another hit please!\n\nIt's not that this makes it hard. Just annoying. It's stretching game time. And it's especially annoying as you often encounter enemy groups with 8 people and you always have to wait for all of them to make their attack befoee it's your turn. In the worst scenarios this leads to situations where you win one battle, get sent to the next and then get a game over as you can't do anything but watching how your team gets pummeled.\n\nThis franchise was never made with turn based battles in mind and it shows. This game often seems to cry \"Let me be real time!\" with Kiryus attack which actually lets you fight a few seconds real time again.\n\nAnd on top of this where is still the problem of tone: These over the top silly enemies simply don't fit a story about revenge and social criticism. One second you fight oversized people using a pizza as a shield and eating it to heal, then you are supposed to take a scene serious where a guy gets cut open.\n\nThen the new map is barely used. It felt like there were exactly 2 points on the map. Because for every new main mission you had to run from one end to the other and then back again. Sometimes not even for a real reason but \"We should rest a bit!\" Despite easily available quick travel that felt really lazy.\n\nIf they hadn't included the old characters I would've skipped it. Now's just hoping that this is really the end of the old cast, so I can skip any new games they make about Kasuga. At least some of the good parts like Hawaii are reused in Gaiden 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Начинается всё вполне неплохо, кроме того факта, что Ичибана опускают и попускают в первые же 2-3 часа ниже плинтуса сначала женщина, которая зафрендзонила, потом какая-то ебучая витуберша? Какой ВЫБЛЯДОК СЫНША придумал это? Ну ладно, допустим, это просто затравка чтобы затравить для сюжета.\r\n\r\nЗавязка сюжета оправдана, в начале, так как классическое «хз что там с ней произошло после того как %вставьте событие%». И внезапно ЖОРА и его кринжовое агенство там тоже оказывается ВНЕЗАПНО. Очень удобно, скрестили двух главных персонажей, окей. И после этого мы наблюдаем прекрасный дуэт, всё идёт вроде круто, в стиле якудзы и т.д. Встреча с обоими барменами (когда они видят Кирюху) произошла крайне ХОЛОДНО и максимально тупо, хотя можно было очень сильно развить этот сюжет далее. Потом тебе дают играть за КИРЮХУ и начинается эдакое «прощание» с персонажем, через его довольно хорошие сабстори и эксклюзивное для него занятие, открывающееся постепенно с прохождением сюжета. И ты такой: «А нахуя нам это надо, у нас же вроде был Гайден и он должен был как раз содержать всё то, что мы сейчас впитываем». И с этим откровением для себя ты сидишь до конца игры БУКВАЛЬНО. Когда тебе передают контроль за Кирюху – про Ичибана можно забыть, ибо с этого момента на него как персонажа ссут, срут, блюют, кончают, одевают, раздевают, отпевают. Абсолютное ничего с Ичибаном, и потом обратное переключение на Кирюху, который двигает сюжет и как бы намекает, что эта игра изначально и задумывалась + сделана, чтобы опять вернуть его как главного персонажа в основной сюжет. Но, вопрос, а зачем + нахуя тогда было заряжать его РАКОМ путем падения БОЧКИ с радиоактивными отходами на голову? И вопрос – нахуя было его вообще помещать в этот комплекс по переработке отходов? Самое худшее и галимое объяснение. Пока ты довольствуешься фан-сервисом и сюжетной разрядкой за Кирюху, на Гавайях у Ичи происходит тотальный пиздeц (ничего не происходит, ходим болтаем и плачем).  На самом деле тут очень много текста и мыслей выходит про сюжет, можно просто подытожить, что он в целом eбаное говнище, и для объяснения долгожительства главного плохого челика (где-то 100 лет и как огурчик) нужно потратить еще 70$ и пройти пиратов якудза на гавайях, которые вышли спустя год этой игры. Во всем остальном – на привычных и лучших персонажей (Дайго, Саеджима и Маджима и прочие) буквально нассали, опозорили всеми возможными способами, в отместку на появление каких-то единичных дегенератов, вышедшими MVP почти во всех ситуациях. Исключением является только Ямай (он же Замай). Кажется, это единственный персонаж, который не ошибся и не показался идиотом в этой игре вообще. А концовка так вообще лютый собачий кайф чуть придушивая до звёздочек в глазах – бедного Кирюху будут использовать буквально до посинения (наверняка придумают какое-то невероятное лекарство от рака в следующих частях, и дракон будет жить вечно, подумала SmEGmA), а Ичибана отмудохали до полусмерти пока он дефал и нёс на себе eблана, который его чуть не убил несколько раз, особенно, когда он пайп-бомбу ему в ноги кинул. Это просто плохие поступки! Человек-то хороший!\r\n\r\nВ плане геймплея тут ничего не поменялось. Стало чуть лучше и в целом всё супер. Не жалуюсь. Появились новые классные РАБОТЫ, остались старые, не измененные, но дополненные. Всякие комбо, добивающие удары и эссенции тоже надобавляли и сделали ещё лучше, с классическим жмыхом из космоса лучом дружбы, ваншотающим всех. Опять же – хочется выделить класс с револьвером, наверное, самый лучший. После него – самурай. Для женщин хороши теннис, домработница и их стандартные классы. Кроме главной кореянки, у неё только 1-2 полезных скилла, остальное мусор, даже эссенс. То есть, полная копипаста 7 части с улучшением и добавлением играбельных и весомых классов, тут постарались, базару Джексон.\r\n\r\nПройдёмся по мини-играм. Вполне фановый, но заeбный СУПА КРЕЗИ ДЕБИБАБАРИ, достаточно пофармить его ради шмоток, ачивки и еще пары штук. Легко, задорно, красиво. Фоткать фриков тоже неплохо. Ловить рыбу вручную, плавая, ну, сойдет. Опять ебучий марио карт, ладно. Опять гонки за мусором… в общем, добавили абсолютно все, что было до этого, в 7 части. Очень много караоке, мне нравится. \r\n\r\nТранспорт в виде самокатов норм, жалко, что в процессе поездки всё же нарваться на ДРАТЬСЯ можно, а объехать это говно бывает трудно. \r\n\r\nПодойдем к самому главному. Кого eбут вообще покемоны или что это блять вообще в игре? Это такая параша, что, буду честен, я просто уже включил доскональные гайды и трейнер, чтобы пройти это дерьмище ради гостей на Дундоко остров, шмоток и прочего, и прочего. И самые топовые эти животные закрыты за ДЛЦ в дохуя деревянных. Это такая дерьмина невыносимая, что не хочется даже обсуждать это далее. \r\n\r\nА, да. ДУНДОКО АЙЛЭНД. Фух, ну, тут все познается в сравнении. Это, наверное, самый худший бизнес из всех существующих. Тут японцы, видимо, подсмотрели у Тодда Дегроварда. Eбать, говорит японец на идеальном русском, смотрите сколько игроков в Фолыче 4 и как им нравится эта поделка дерьма и мочи! Все 100% хотят потратить дохуя времени половить рыбок, побить камни, деревья и мешки с мусором (Саня Овер, привет) битой, поймать пару бабочек с ЛЕГУСЬКАМИ и потом с невероятно коротким (как мой XУЙ) промежутком времени, отведенным для дневных деяний, успеть построить всякое говнище для обожаемых, уважаемых гостей, фарм денег с оных не достигает тех равносильных значений и сумм по отношению ко времени и действии, которые хотелось бы иметь! Потому что, бляTь! Денег с данжей последнего уровня (этажей) у тебя будет за 10 минут больше, чем за 1 (один (one (uno (eins)))) eбаный час этого шизоидного высера под названием ДУНДОКО ОСТРОВ! Фух, ну тут еще можно потренировать свой покемон-мусор, сойдёт, am I right, fellas? Единственное самое смешное и фантастичное, что они смогли сделать – это делиться своим островом в ОНЛАЙНЕ. Когда открываешь глобальный список и самые популярные - это разновидности острова Эпштейна, австрийский художников, ну и всякое, что БАН. Сообщество тут не подвело, снял шляпу, хорош, мужики. В целом, это, конечно, хорошая фича с постройкой из ассетов всей игры, по типу Гаррис мода, особенно заполнение своего домика внутри. Но чтобы это полноценно открыть и использовать… Да и нахера это тут надо? Японцы пробуют себя в каком-то новом русле или что? С одной стороны – мне он понравился. Опять же, лёгкий аутизм такого вида это определенного рода вайб, не спорю. Но с другой, все эти не пропускаемые диалоги, все эти недосабстори с этим связанные и сюжет в целом вокруг этого острова это ЗАЛУПA. \r\n\r\nЧто мы имеем? Геймплейно всё сохранилось + улучшилось, многие тут могут со мной не согласиться, мне похуй. Играть в это? Можно. Расценивать это как продолжение серии и номерной частью сюжетно? Твою мать, комментарии излишне. Начали хорошо (относительно), закончили за такой упокой, что даже и не ждётся как-то новая. Бизнес? Худшее дерьмо. Мини-игры? Тотальная копипаста, это не ново для якудз, но добавили несколько неплохих, которые делаются буквально ещё по пути куда-нибудь сюжетно. Добавить что-то своё, в отсутствие при этом Нагоши? Просто бросайте эту хуйню, убивайте Кирюху и Ичибана и закрывайте сарай. Фан-сервис? Мразотнейший, начинающийся и ничем не заканчивающийся, а также закрытый за ДЛЦ с сабстори и общей пати из всех персонажей за 15+ грязных зеленых бумажек. \r\nТочно! Ещё почему не советую – потому что дегенераты в СЕГЕ прощупывают плацдарм в виде платных вырезанных фич, доступных в базовых версиях ВСЕХ предыдущих частей. Типа, как якудзаслоп можно ещё подороже продать идиотам, готовым схавать всё подряд, связанное с этой франшизой, ну типа как фантастическим тварям, которым парень жены разрешает играть в Марио, Зельду и т.д. \r\n\r\nНГ+ в виде ДЛЦ за 15-20 баксов? Вы че ебнутые? Спасибо, кремпай, за бесплатное предоставление этих «ДЛЦ». И спи спокойно, серия Якудза. Ты была очень хороша. Поставил свечку за неё (СЕГЕ в жепу).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After just 8 hours of gameplay, I couldn't stomach this game any longer. This has to be one of the worst games I've played in this genre. I don't get the appeal (given all the great reviews on sites and on Steam). I'm definitely missing something. But here is why I quit:\n\n- The protagonist is the biggest, pathetic loser I've ever had to play in a video game. I'm sure it has something to do with the Japanese->English translation, so in English, everything that came out of Ichiban Kasuga's mouth was cringe and embarrassing. This game has some very long cutscenes with a lot of filler dialogue that's so unnecessary. It was like listening to the most boring conversation you could imagine.\n\n- Terrible save game system. A couple times after a long battle, the quick save is disabled and it wouldn't give you time to do a manual save because it would pull you right into another long and boring cutscene. During this time, the game would sometimes crash, and I'd have to load an old save game and redo the whole battle again. Such a ridiculous game design. I keep my gaming rig cool and stable, and I play a lot of games. This game has crashed on me more times than any game I can remember. \n\nI'm just happy that I got this on a good sale and didn't pay full price.\n\n1 out of 5 stars",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There are no orphanages in America.  The legal structure for it just doesn't exist.  There might be edge cases of foster parents grossly abusing the program but the concept of a structured orphanage just has not existed in America for decades.  The type of foster situation depicted would put the people at the top all over the media!  Never even minding the bizarre cult that comes off as crass parody, which does all this and also miraculously protects the identity of the McGuffin, the plot doesn't make ANY sense.  Why set your plot outside of Japan if you are just going to make pretend it's Japan??  It's not just the orphanage, it's cultural stuff all over the place.  The writing is filtered through a prism that distorts way too much for anything coherent to emerge.\n\ne - the more I think about it, the dumber it gets.  so many natural born and raised English speakers are just primed and ready to speak fluent Japanese and bow/respect with perfect mannerisms at any Asian looking person.  except when these people speak in English, which they always contextually know when to do, and depending on the budget for the character can range from distracting and thick accented English to native competency but Fiverr delivery.  I played with Japanese audio and out of empathy for my fellow man I refuse to imagine the nightmare the English voice director probably went through trying to interpret the intention.\n\nThere's a whole lot one could say about the treatment of Ichiban as a foreign national \"without an identity\" but I suppose if you just wanted to get over it you could chalk all of that up to commentary on the universal treatment of police on the vulnerable, and yes, American prejudice.  However, you just can't terminate the thought there like the writing wants you to.  The way the story draws out its painful legal arguments to Ichiban's predicaments makes you realize the writers don't actually have a clue what would happen.\n\nRereading this makes me realize all of this applies to Chitose just as fairly, though at least in her case the emotional confusion itself is much more fundamental to her story.  There are other gross obvious problems with her story that actually have nothing to do with the immigrant tale but let's hold on to an emotional hook where we can get it.  I guess after my 35 hrs I find Kiyru's story the most credible overall but there's almost nothing to it at the point I gave up so maybe I didn't give them time to cook and make something awful.\n\nLanguage and cultural barriers are intimate and significant to Ichiban's fish out of water with the exception of when translating across boundaries is just too hard.  Lame, and ill advised.  This becomes especially obnoxious when there is so much tedious dialog that adds nothing where that kind of tedium would have semantically made sense in other places.\n\ne - gameplay is fine.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The story is meh and the characters are badly written compared to who they were in the first Like a Dragon, Ichiban especially. If you're here for just the combat and wacky random things that happen similar in previous games, then you'll find what you want here.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Story sucks so bad. while the first had the best story.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is really really bad the fighting system is really bad it is like for 5 year olds even have auto fight system ???? not good not normal it is a joke , game is for kids not interesting fighting in old games were really good ... Story is not bad but not interesting and it is really really long like talking is so slow it is crazy and amount of cutscenes are crazy and really long not good and not interesting to make you continue playing the game that is why i stop playing game is bland it is a Joke do not understand amount of praising and people loving it even old Yakuza games are really Boring games nothing is interesting it is a shame of a game .... to add dating and other stuff are not needed they could add skip those things i do not want to play dating game or driving working as a delivery guy like what is this real life simulator everything is long and boring it is insanity ????",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like a dragon infinite dogshit, i hate this gay , its turn based yakuza so doesnt fit yakuza series entirely, and the story is soo dogshit too",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what drugs dev using while writing LAD:IW story?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I sincerely wish I could give a Mixed review on this game. Coming into LAD8, my expectations were through the roof. A game where the prior Kiryu and Ichiban pave way for the Yakuza to be liberated from the past and allow the lost souls, bounded by a life of crime to have a future? Incredible, FANTASTIC premise...only for them to barely follow through with any of it after the prologue. \n\nThe gameplay is a gigantic step up from Yakuza 7 in every possible way, with Kiryu's Dragon Of Dojima style being near perfectly transitioned from beat em up combat to turn based combat, even if I think the skills tied to that class suck.\n\nHawaii's a fun map with a lot of interesting things going on there, but that's about the most I have to say that's positive about it. The amount of god damned minigame padding (FUCK Dondoko island) was absolutely aggravating. \n\nThe story and writing is where I begin to take issue with this game. I can't decide whether I love or hate this game, where I initially came into this game adoring it and later on starting to dislike it more and more as I let the game sit in my mind. Ichiban is a complete and utter caricature of the man he was in Yakuza 7, I think his relationship dynamic with his love interest is god awful, and he does little aside from talk no jutsu a few characters out of their slumps/evil ways (don't even get me started on them. Anyone who's played the game knows who I'm talking about).\n\nKiryu I take less issue with. In fact, his role in the story was the only reason I was really kept engaged in the story to begin with. However, it seems kind of ironic that our new protagonist has taken the support role for the man who's had 3 finale games now.\n\nIt hurts me to say this, but I could feel my honeymoon period for this franchise slowly start to erode over time since their botched combat remake of Like A Dragon: Ishin. This franchise took me out of a dark place in my life, and it hurts to see such a stark drop in quality in story telling and character writing.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "Infinite Wealth starts out with great gameplay that by the end becomes exhausting and absurdly boring, the story has an interesting premise that completely drops in writing quality halfway through the game and just keeps getting worse the more you play. The antagonists in Infinite Wealth are by far the worst in the entire franchise.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "You can really tell the story in this game got heavily influenced by executives that never wrote a story in their life, there's a lot of out of character moments, loop holes for the sake of advancing the story, characters that were brought back even so it was made incredibly clear that they were dead, and scenes that's clearly trying to copy popular scenes from previous works without understanding why they were popular. This story feels like it was written by a statistic major looking at data of what people liked and just slapped them together into an incoherent piece of work, like a dish made out of the most popular ingredients, except none of them synergize with each other.\r\n\r\nThe gameplay is alright, my biggest complaint about the combat system is that successful blocks barely does anything, so you'll still get stat checked by a lot of enemies especially in substories. Main quest tells you the upcoming enemies' levels, but substories don't even so they differ a lot, one moment you're fighting 4 lvl 40s, but then you do the next substory and you're fighting 10 lvl 53s.\r\n\r\nThe sidestory minigames that every game in this franchise has feels incredibly weak in this game too. Dodonko island is just grinding, it's basically bootleg stardew valley with barely anything to do. Sujimon also gets boring very quickly, imagine pokemon, but all your pokemons only has 1 move, that's what sujimon is. Sujimons do have ults, but most fights end so quickly that you won't need them, and honestly, why is there even a turn based combat minigame in a turn based combat game? If I want to play turn based combat I'd just...keep playing the main game.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Great game no doubt, the graphics is good, side stories are hilarious, combat feels engaging. The main story line is... not its strong point, especially the final few chapters, but overall I enjoyed the game. \nThe why did I give it a thumbs down? There is a very annoying issue with the game - game crashes. \nThis game will crash randomly every 1-3 hours. \"Just save the gave frequently\" you might say, the issue is in dungeons or certain part of the main story, you have to fight through a series of enemies before you reach a save point. One crash during it can waste you maybe 20-30 minutes of game time. During my playthrough, often when I finally beat down multiple waves of enemies, finished the chapter, and was watching the cutscenes of the next chapter - game crashed. I have to reopen the game, fight those enemies of the last chapter again, then rewatch the cutscenes. Those crashes were INSUFFERABLE. Crashes like that made me not want to open the game when I get home. (Somebody on Reddit said capping frames to 60 and turning off DLSS helped, I'll just say mine was capped at 120 and it still crashed frequently, also I didn't buy a better pc and monitor just to play games at 60 fps, this kind of issue should've been fixed long ago, but it's not.) These crashes made killed my motivation to open the game and finish Dondoko Island and Sujimon Battle.\nWhat's more? Oh yeah, NG+ and it's achievements, cannot believe any sane dev would lock NG+ behind DLC and made NG+ achivements impossible if you only have base game. \n\nThumbs down.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A masterpiece and gem of a RGG game, only to have the entire experience soured by the paid NG+ fiasco. As petty as it seems, can't bring myself to spend even a few dollars (on discount) on what has always existed for free on every previous mainline RGG game. \n\nIf there was a point system, I would have given the score a 1/10 instead of outright not recommending it (like what is being done now, just a Yes or No on recommendation), just to exhibit my displeasure towards the paid NG+ thing.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "I quit cause it was really boring to me. The combat is vastly improved but the story seemed to have been sacrificed for it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The appeal to me about the Like a Dragon Yakuza games was that it felt like a traditional Dragon Quest RPG in the turn based battle and equipment department.  But outside of that, this game is so bloated with nonsense and filler it feels like a chore to play.  I've played approx 14 hours and I think only 5 of it has been exploration, battles/boss battles and treasure hunting.  There is sooooooo many voice dialogue cut scenes and soooooooo much filler mini games that its not fun.  By the time i got to anaconda mall, the anaconda escape and the sujimon battles put me over the edge when it comes to patience.  I do not want to sit and watch dramatic BS dialogue cut scenes for a pokemon rip off mini game nor do i want to play a mini game every thirty minutes in this game.  It already had \"pound pals\" and adding sujimon seems like overkill and it is.  \n\nThe graphics in the game are nice, and i like the FPS and overall presentation of the menus and the variety of equipment and items etc.... but the non stop forced dialogue cut scenes, non stop mini games and cell phone interactions with aloha app and dating app it's all just too much BS for someone like me's who's trying to play and experience a story and build up a character party to go on rewarding side quests and missions to be the strongest and best person in a game.  If they cut out 100% of the dialogue scenes and mini games it would be a much better game.  but alas it's not, it's just a time wasting boring chore of a game and i do not recommend it at all.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "this game was great except everything is tied to level and i have to grind to get up to the right level and money and items to keep playing the game\r\n\r\nive sunk 120 hours into this shit\r\nand i still consider it mid tier for a yakuza game but i wanted to finish the game\r\nexcept im not high enough level and im losing to the end bosses of the game\r\n\r\nthats fine i guess ill just load an earlier save and regrind up to the right level\r\n\r\n\r\nexcept no i already have a goddamn full time job\r\ni just got the point where i was like yeah\r\nya know what i dont give a shit anymore\r\n120 hours, a 100 and fucking 20.\r\nill just watch the ending\r\n\r\nno i probably won't i dont care enough\r\n\r\n\r\nLook \r\nthis is a good game\r\nall the yakuza games are great\r\n\r\nbut fuck me\r\nshorten it\r\nor dont make the main story tied to doing all the side content and encounters\r\nwhat the fuck happened to just being able to play through the game without having to grind\r\n\r\ni spend so long grinding levels that combat becomes stale as fuck\r\nthat i forget whats even going on in the story and lose interest\r\n\r\nthat i hit a minor roadblock and literally no motivation to keep playing the game\r\n\r\nGo play Judgement",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Like a Dragon: Infinite Wealth is a turn-based RPG with a dozen other games included, and it's a good and decent experience that I found deeply derivative and unsatisfying. It is a high-quality game with a lot to enjoy, so my thumbs down is just a couple of degrees below the horizon line.\n\nI think you should only play this after playing Like a Dragon, which was a good starting point for the series. Gameplay-wise it's similar, but better overall. I enjoyed a lot of mini-games, and a lot of effort was spent on making many of the substories unique in some way, having a special mini-game or interesting boss battle. The main dish - tactical combat, JRPG style - is also fine, but that's where I start to complain, and I don't think I'll stop complaining until the end. The game has no difficulty selection (at least for the first playthrough) and if you engage with any side content you become overpowered fast, which means that the main gameplay mode - tactical combat - becomes just a chore. And side content was what I actually liked in this game, so the critical path quickly became boring. All of the tools available to you are mostly pointles there's a fun job-switching system, but there isn't much point in engaging with it unless you want to do the post-game extra-difficult dungeon. There's crafting and optional randomized dungeon clearing - and I enjoyed those, there you see glimpses of how this combat system can be used, but it again makes you overpowered. So pacing and balancing are way off.\n\nWhat remains is a story. I can't call it bad, but the thing is usually in this series the story is exceptional. It is simultaneously the most serious dramatic thing you've ever seen and also the silliest thing you've ever seen. And this one is more conventional, it's tongue-in-cheek, it knows that it's too dramatic and too silly from time to time. It doesn't feel sincere. On top of it, a lot of it is tone-deaf. The plight of little people is one of the big themes of the game, but the two biggest side activities in the game are a Pokémon-style fighting game where you force homeless and crazy people to fight for food, and a resort management game where the same homeless and crazy people are used as unpaid labor. It's played for laughs and I don't condemn the game for having those activities, but I personally couldn't enjoy them. Gameplay-wise they felt out of place too: the Pokémon game is a separate turn-based tactical combat mini-game and we already had one; the resort management game interrupts the normal game and is almost completely separate from it. You can play it for hours and forget how to play the main game, ha. The story is also very derivative. It feels like half of the side stories concern characters you've met in the previous game, and for the second protagonist most of what they do is reviewing references to previous games. I played these games and found this boring, I imagine if you haven't played Yakuza 0-6 you'll be confused on top of being bored. I can't say it's an \"objectively\" wrong way to write a story, or even that it's poorly written, but it feels the least unique and engaging entry in the franchise.\n\nSo here we are. I spent a lot of time on this game, and it wasn't that bad, but I mostly continued playing because I am committed to the series. If you want to skip one game in the franchise - skip this one.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Honestly I'm completely set up to love this game .. but it keeps on crashing .. like every 20 min. Frustrating AF!!!!\n\n***UPDATE***\n36 hrs in\n\nAfter updating my drivers the crashing frequency decreased .. but never went away. It was good enough to play more hours but when I got to Dokono Island the problem escalated again. I couldn't get through a single day without the game crashing. \n\nI don't have this issue with any other game and I feel like my system is way more than equipped to run this game. Really sad bc I do love the game itself, but this issue has made it unplayable for me.\n\n***final update***\nI really really want this game to work but it keeps on crashing. I'm going to stop trying now. :(\n\n***final final (?) update***\nin advanced settings you can turn off a graphics increasing function that did help a lot ... until it didn't anymore. Still getting crashes and now I'm done (after a couple more trys probably) trying anymore :( so frustrating",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ichiban in Yakuza 7 is stupid but for some reasons he has become even stupider in this game. You would think after all the events of Yakuza 7 he would be a bit more clever and less naive but no, Yokoyama decided to make Ichiban a literal manchild.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I was pretty excited for this one after Yakuza: Like A Dragon because they added the ability to move your characters in combat - my only gripe with the last game.\r\n\r\nBut unfortunately, everything else fell short. Right away, the main character suddenly decides he's in love with another character despite never having expressed any romantic interest in the first game. This will-they-won't-they isn't important to the rest of the story but it gets shoehorned it repeatedly anyway.\r\n\r\nThe main story was all right but the side quests weren't that good. Most of them were pretty sappy and I don't think I laughed once (the side quests in the last game had me sending screenshots to friends)\r\n\r\nI admittedly didn't do any of the romance stuff in the last game but I was surprised to find that most of those quests involve my character getting forced to do things against his will (I think there's a word for that?)\r\n\r\nWeapon crafting is fine but the food \"crafting\" (trading materials to an NPC) really sucks. It takes forever to gather enough materials to make anything good. Like there's no reason to make crappy food when I can just go next door and buy some.\r\n\r\nIf you watched videogamedunkey's video (like I did - whole reason I bought the 2 games), be warned that he shows you pretty much all the funny stuff. It all fits in one video.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It is quite literally insane how hard they washed down the initial YLAD7 cast in this game. The story is an unfixable mess and the continuation issues regarding Gaiden have been talked to death online without me even needing to play anything chronologically and pretend it matters.\nThis will probably be the last RGG game I purchased since following the stories for over a decade, first through playthroughs and then myself.\n\nThe recent summit was just the cherry on top of this hot pile of garbage since our lord and savior Nagoshi left and we are left with all creative decisions being obviously recycled or worse.\n\nShall the pirate game never touch my inventory– the true indicator of how over it is.\n\nYou can enjoy the gameplay I guess, but I have enough hours of mahjong, already get annoyed by the Umamusume crane game nowadays and better turn-based dungeons to play.\nThe island mechanics are too chopped to even make jokes about them being like Animal Crossing, tbh.\nA better money game than LAD7, but again I just made most of my money with mahjong and didn't need a spare dime since buying out shops.\n\nBest case would be for them to embrace the lack of seriousness in the lore by undoing Kiryu's cancer and turn him green or some shit, drop his stoicism, retcon all character deaths and have them be happy running an orphanage so everyone can have their favorite characters back and worst case mod their unchanged faces back on. With the option to continue dressing ALL of them up like barbie dolls.\n\nAdd Tomizawa karaoke and use the sega lottery + merchandise money to add the King Gnu albums to the game.\nCan't be bothered to write this anymore.\n\nLet's just make Ichiban proud and daydream ourselves into a world where Judgment has a chance to be continued.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Like a Dragon: Infinite Wealth delivers almost everything fans hoped for: a gripping story, emotional depth, chaotic humour, and the signature charm that has made the Yakuza/Like a Dragon series so loved worldwide. The gameplay is polished, the world is vibrant, and the characters—especially Ichiban—shine once again. Under normal circumstances, this would easily have been a 9/10 experience for me.\n\nUnfortunately, there is one element that genuinely pulled me out of the story and affected my enjoyment far more than I expected: YongYea’s voice acting.\n\nHis performance felt stiff, unnatural, and painfully out of place in a world filled with seasoned, emotionally convincing voice actors. His delivery lacked emotional weight, nuance, and authenticity—especially in scenes that were meant to be intense or heartfelt. Instead of pulling me deeper into the story, his lines often snapped me right out of it.\n\nWhen one performance is noticeably weaker than the rest of the cast, it stands out—and not in a good way. For me, it genuinely spoiled portions of the experience.\n\nA major character deserves a professional voice actor—not someone whose delivery feels like a YouTube reading rather than a performance.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Currently in CHapter 7 , man the story and sub stories + side activities are soo boring and dull. The only thing here thats somewhat good is the combat and different jobs each character have, other than that its a slop. just can't stand how bloated this game is with boring substories, terrible main story writing, and too big of a world",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The DLC for this game is unjustifiably expensive, and a vast majority of it is content that was very clearly plucked out of the main game to be sold back to us at inflated prices. For that reason alone I simply can't recommend buying this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This series fucking SUCKS now. Been playing this series for decades, and I've been slowing down as the stories just got sappier and cringier. You feel that rollercoaster of emotions at first but it just constantly bombards you until you're just numb to it and start skipping cutscenes. Bring back Yakuza.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Boring story, too much appeal to western fans, weak jrpg combat system and on top of it all I was forced onto Dodonko Island for more than an hour without an option to skip it :|",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Yakuza Franchise used to limit wacky and over the top comedy to the side quests while entertaining you with a gritty crime-noir main story. This is all non-sense Comedy and inconsistent World building.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "To say my playthrough attempt of this game has been a disaster, is an understatement. What started out REALLY hopeful when I went in with no expectations (even after an extremely negative experience with Yakuza: Like a Dragon) has ended up with me putting this easily in my top 5 worst games of all-time. If not pushing out Sonic 06 as my #1. This game, is beyond trash.\r\n\r\nFirst off, the technical issues. I've had this game crash more than anything else I've played, and I've played every game in RGG's library. Pirate Yakuza does not crash like this, Lost Judgment does not crash like this. So something is definitely wrong with this game in particular. I just had a crash, [spoiler] on Nele Island, at the end of the Bryce fight, after 2 hours of grinding out that dungeon. [/spoiler] I genuinely have never been so mad at a game in my life. This is not the first time I've crashed either, I've had at least 8 crashes throughout this playthrough. It happens during long sessions so I assume something isn't unloading over-time and keeps stacking up.\r\n\r\nThe gameplay issues: The lategame balance is terrible. I tried to get into it. I really enjoyed the earlygame, actually! Then every move falls off mid/lategame unless your name is Tomizawa and you are just able to element your way through it. But that's nothing compared to the level grinding! While intentionally taking extra fights than necessary because I anticipated a repeat of Majima/Saejima in Like A Dragon, I still spent 8 hours grinding extra levels in the finale before taking on the final Ichiban dungeon. As well as an extra 2 hours grinding before Majima/Saejima/Dojima. I am not looking forward to more level grinding for Kiryu's side and his party. The game is also balanced around exclusively using every single stat buff imaginable. If you aren't landing almost exclusively Proximity/Back attacks you are not doing damage with your basic attacks. Even if enemies are considerably lower level, even if they're (supposed to be, dungeons are weird) in Smackdown level. The RPG system is a cool concept but the balance is terrible and has fallen apart twice in a row with lategame. Fundamentals are a step up and feel more Yakuza but the enjoyment of the gameplay does not sustain throughout the game.\r\n\r\nAll in all? This is a mess. A complete, and utter mess. I went in extremely hopeful, even setting aside my low expectations and bad experience from my LaD playthrough. And it still ended up worse than LaD did. RGG, do better.\r\n\r\nAnd #RemoveKagawa for god's sake y'all are ridiculous even TRYING to cast him in Kiwami 3. You cast the sort of creep who's behavior would get them knocked out by Kiryu.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "SOooooooo Much Dialogue and cut scenes its more like a movie or a tv show then a video game. I have 9 hrs into this game and 95% of it is just watching the cut scenes and dialogue between characters. The combat system is pretty fun but everything feels super easy. As you level I feel like your stats don't even matter.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The gameplay is a phenomenal IMPROVEMENT over Yakuza 7 but the story is just one big atrocious dumpster fire of wasted potential with their themes and concepts mixed with character assassination for some if not most of the cast.\n\nEiji Mitamura, Dwight Mendez, Bryce Fairchild and Masataka Ebina are literally zero-substance mustache-twirling villains, and the circumstances for Ebina and Eiji being villains is just absolutely ridiculous I refuse to accept them as \"antagonists\".\n\nThere's other questionable aspects of the game like the Amons among others but I won't go too far into those. Also, fuck the DLC practices here. SEGA's greed at its finest.\n\nSoundtrack is also meh at best with a few exceptions.\n\nYamai and Tomizawa were goated though, love those guys.\n\nI'm personally giving this game a 3 or 4 out of 10, 5 or 6 at best. Only saving graces are the gameplay improvements, some of the music tracks, and Yamai and Tomizawa.\n\nYou're better off playing 7 for a better quality story with Ichiban.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I love the Like a Dragon franchise, but the games with Kasuga as a protagonist simply don't cut it.\n\nNow the Prologue of the game was fucking amazing. So well executed. With criticism against Japans harsh Anti-Yakuza-Laws. Then the very moment they go this stupid \"Kasuga is a hero like in a game!\"-route again it all crumbles down in an instant.\n\nFirst: The whole Reboot thing doesn't work. This game here is literally a continuation of Kiryus Story which started with Yakuza 1 back in the days. Heck. Even the final achievement makes this very clear. You really need to have played every game to understand what is going on.\n\nThey crammed Kasuga in here with his whole \"Looking for my mother!\"-story. But this part is so irrelevant. Because everything would've happened without him anyways. He feels like a side character.\n\nNot that the story is worth much anyways. The game just goes in circles for around 8 chapters, making you slog through a ton of lengthy minigame explanations. Then one or teo interesting things happen. Thennit's more time wasting until the ending cutscene which was rather nice again.\n\nSpeaking of cutscenes. I loved the franchise for them. But in this game they are mostly just \"Everybody standing around while somebody has a 20 minute exposition dialogue\"\n\nNow if only the gameplay would hold up. But it does not. Hawaii with its palm trees is a nice setting. There are some cool new characters. And the battles can be fun to watch for a bit. But that's it.\n\nThe downsides are that this is a turn based battle system where positioning of characters is important ... but you can barely influence their position. Everybody is just randomly walking around. Enemies tend to move out of your AoE. And its also important to push enemies into other enemies or your allies for extra damage ... but often you miss that despite specifically aligning everything with the arrows the game displays.\n\nAnd then enemies actually have death protection. Sometimes you would do enough damage ... the game just says: Nope! Wait until next round. Another hit please!\n\nIt's not that this makes it hard. Just annoying. It's stretching game time. And it's especially annoying as you often encounter enemy groups with 8 people and you always have to wait for all of them to make their attack befoee it's your turn. In the worst scenarios this leads to situations where you win one battle, get sent to the next and then get a game over as you can't do anything but watching how your team gets pummeled.\n\nThis franchise was never made with turn based battles in mind and it shows. This game often seems to cry \"Let me be real time!\" with Kiryus attack which actually lets you fight a few seconds real time again.\n\nAnd on top of this where is still the problem of tone: These over the top silly enemies simply don't fit a story about revenge and social criticism. One second you fight oversized people using a pizza as a shield and eating it to heal, then you are supposed to take a scene serious where a guy gets cut open.\n\nThen the new map is barely used. It felt like there were exactly 2 points on the map. Because for every new main mission you had to run from one end to the other and then back again. Sometimes not even for a real reason but \"We should rest a bit!\" Despite easily available quick travel that felt really lazy.\n\nIf they hadn't included the old characters I would've skipped it. Now's just hoping that this is really the end of the old cast, so I can skip any new games they make about Kasuga. At least some of the good parts like Hawaii are reused in Gaiden 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Начинается всё вполне неплохо, кроме того факта, что Ичибана опускают и попускают в первые же 2-3 часа ниже плинтуса сначала женщина, которая зафрендзонила, потом какая-то ебучая витуберша? Какой ВЫБЛЯДОК СЫНША придумал это? Ну ладно, допустим, это просто затравка чтобы затравить для сюжета.\r\n\r\nЗавязка сюжета оправдана, в начале, так как классическое «хз что там с ней произошло после того как %вставьте событие%». И внезапно ЖОРА и его кринжовое агенство там тоже оказывается ВНЕЗАПНО. Очень удобно, скрестили двух главных персонажей, окей. И после этого мы наблюдаем прекрасный дуэт, всё идёт вроде круто, в стиле якудзы и т.д. Встреча с обоими барменами (когда они видят Кирюху) произошла крайне ХОЛОДНО и максимально тупо, хотя можно было очень сильно развить этот сюжет далее. Потом тебе дают играть за КИРЮХУ и начинается эдакое «прощание» с персонажем, через его довольно хорошие сабстори и эксклюзивное для него занятие, открывающееся постепенно с прохождением сюжета. И ты такой: «А нахуя нам это надо, у нас же вроде был Гайден и он должен был как раз содержать всё то, что мы сейчас впитываем». И с этим откровением для себя ты сидишь до конца игры БУКВАЛЬНО. Когда тебе передают контроль за Кирюху – про Ичибана можно забыть, ибо с этого момента на него как персонажа ссут, срут, блюют, кончают, одевают, раздевают, отпевают. Абсолютное ничего с Ичибаном, и потом обратное переключение на Кирюху, который двигает сюжет и как бы намекает, что эта игра изначально и задумывалась + сделана, чтобы опять вернуть его как главного персонажа в основной сюжет. Но, вопрос, а зачем + нахуя тогда было заряжать его РАКОМ путем падения БОЧКИ с радиоактивными отходами на голову? И вопрос – нахуя было его вообще помещать в этот комплекс по переработке отходов? Самое худшее и галимое объяснение. Пока ты довольствуешься фан-сервисом и сюжетной разрядкой за Кирюху, на Гавайях у Ичи происходит тотальный пиздeц (ничего не происходит, ходим болтаем и плачем).  На самом деле тут очень много текста и мыслей выходит про сюжет, можно просто подытожить, что он в целом eбаное говнище, и для объяснения долгожительства главного плохого челика (где-то 100 лет и как огурчик) нужно потратить еще 70$ и пройти пиратов якудза на гавайях, которые вышли спустя год этой игры. Во всем остальном – на привычных и лучших персонажей (Дайго, Саеджима и Маджима и прочие) буквально нассали, опозорили всеми возможными способами, в отместку на появление каких-то единичных дегенератов, вышедшими MVP почти во всех ситуациях. Исключением является только Ямай (он же Замай). Кажется, это единственный персонаж, который не ошибся и не показался идиотом в этой игре вообще. А концовка так вообще лютый собачий кайф чуть придушивая до звёздочек в глазах – бедного Кирюху будут использовать буквально до посинения (наверняка придумают какое-то невероятное лекарство от рака в следующих частях, и дракон будет жить вечно, подумала SmEGmA), а Ичибана отмудохали до полусмерти пока он дефал и нёс на себе eблана, который его чуть не убил несколько раз, особенно, когда он пайп-бомбу ему в ноги кинул. Это просто плохие поступки! Человек-то хороший!\r\n\r\nВ плане геймплея тут ничего не поменялось. Стало чуть лучше и в целом всё супер. Не жалуюсь. Появились новые классные РАБОТЫ, остались старые, не измененные, но дополненные. Всякие комбо, добивающие удары и эссенции тоже надобавляли и сделали ещё лучше, с классическим жмыхом из космоса лучом дружбы, ваншотающим всех. Опять же – хочется выделить класс с револьвером, наверное, самый лучший. После него – самурай. Для женщин хороши теннис, домработница и их стандартные классы. Кроме главной кореянки, у неё только 1-2 полезных скилла, остальное мусор, даже эссенс. То есть, полная копипаста 7 части с улучшением и добавлением играбельных и весомых классов, тут постарались, базару Джексон.\r\n\r\nПройдёмся по мини-играм. Вполне фановый, но заeбный СУПА КРЕЗИ ДЕБИБАБАРИ, достаточно пофармить его ради шмоток, ачивки и еще пары штук. Легко, задорно, красиво. Фоткать фриков тоже неплохо. Ловить рыбу вручную, плавая, ну, сойдет. Опять ебучий марио карт, ладно. Опять гонки за мусором… в общем, добавили абсолютно все, что было до этого, в 7 части. Очень много караоке, мне нравится. \r\n\r\nТранспорт в виде самокатов норм, жалко, что в процессе поездки всё же нарваться на ДРАТЬСЯ можно, а объехать это говно бывает трудно. \r\n\r\nПодойдем к самому главному. Кого eбут вообще покемоны или что это блять вообще в игре? Это такая параша, что, буду честен, я просто уже включил доскональные гайды и трейнер, чтобы пройти это дерьмище ради гостей на Дундоко остров, шмоток и прочего, и прочего. И самые топовые эти животные закрыты за ДЛЦ в дохуя деревянных. Это такая дерьмина невыносимая, что не хочется даже обсуждать это далее. \r\n\r\nА, да. ДУНДОКО АЙЛЭНД. Фух, ну, тут все познается в сравнении. Это, наверное, самый худший бизнес из всех существующих. Тут японцы, видимо, подсмотрели у Тодда Дегроварда. Eбать, говорит японец на идеальном русском, смотрите сколько игроков в Фолыче 4 и как им нравится эта поделка дерьма и мочи! Все 100% хотят потратить дохуя времени половить рыбок, побить камни, деревья и мешки с мусором (Саня Овер, привет) битой, поймать пару бабочек с ЛЕГУСЬКАМИ и потом с невероятно коротким (как мой XУЙ) промежутком времени, отведенным для дневных деяний, успеть построить всякое говнище для обожаемых, уважаемых гостей, фарм денег с оных не достигает тех равносильных значений и сумм по отношению ко времени и действии, которые хотелось бы иметь! Потому что, бляTь! Денег с данжей последнего уровня (этажей) у тебя будет за 10 минут больше, чем за 1 (один (one (uno (eins)))) eбаный час этого шизоидного высера под названием ДУНДОКО ОСТРОВ! Фух, ну тут еще можно потренировать свой покемон-мусор, сойдёт, am I right, fellas? Единственное самое смешное и фантастичное, что они смогли сделать – это делиться своим островом в ОНЛАЙНЕ. Когда открываешь глобальный список и самые популярные - это разновидности острова Эпштейна, австрийский художников, ну и всякое, что БАН. Сообщество тут не подвело, снял шляпу, хорош, мужики. В целом, это, конечно, хорошая фича с постройкой из ассетов всей игры, по типу Гаррис мода, особенно заполнение своего домика внутри. Но чтобы это полноценно открыть и использовать… Да и нахера это тут надо? Японцы пробуют себя в каком-то новом русле или что? С одной стороны – мне он понравился. Опять же, лёгкий аутизм такого вида это определенного рода вайб, не спорю. Но с другой, все эти не пропускаемые диалоги, все эти недосабстори с этим связанные и сюжет в целом вокруг этого острова это ЗАЛУПA. \r\n\r\nЧто мы имеем? Геймплейно всё сохранилось + улучшилось, многие тут могут со мной не согласиться, мне похуй. Играть в это? Можно. Расценивать это как продолжение серии и номерной частью сюжетно? Твою мать, комментарии излишне. Начали хорошо (относительно), закончили за такой упокой, что даже и не ждётся как-то новая. Бизнес? Худшее дерьмо. Мини-игры? Тотальная копипаста, это не ново для якудз, но добавили несколько неплохих, которые делаются буквально ещё по пути куда-нибудь сюжетно. Добавить что-то своё, в отсутствие при этом Нагоши? Просто бросайте эту хуйню, убивайте Кирюху и Ичибана и закрывайте сарай. Фан-сервис? Мразотнейший, начинающийся и ничем не заканчивающийся, а также закрытый за ДЛЦ с сабстори и общей пати из всех персонажей за 15+ грязных зеленых бумажек. \r\nТочно! Ещё почему не советую – потому что дегенераты в СЕГЕ прощупывают плацдарм в виде платных вырезанных фич, доступных в базовых версиях ВСЕХ предыдущих частей. Типа, как якудзаслоп можно ещё подороже продать идиотам, готовым схавать всё подряд, связанное с этой франшизой, ну типа как фантастическим тварям, которым парень жены разрешает играть в Марио, Зельду и т.д. \r\n\r\nНГ+ в виде ДЛЦ за 15-20 баксов? Вы че ебнутые? Спасибо, кремпай, за бесплатное предоставление этих «ДЛЦ». И спи спокойно, серия Якудза. Ты была очень хороша. Поставил свечку за неё (СЕГЕ в жепу).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After just 8 hours of gameplay, I couldn't stomach this game any longer. This has to be one of the worst games I've played in this genre. I don't get the appeal (given all the great reviews on sites and on Steam). I'm definitely missing something. But here is why I quit:\n\n- The protagonist is the biggest, pathetic loser I've ever had to play in a video game. I'm sure it has something to do with the Japanese->English translation, so in English, everything that came out of Ichiban Kasuga's mouth was cringe and embarrassing. This game has some very long cutscenes with a lot of filler dialogue that's so unnecessary. It was like listening to the most boring conversation you could imagine.\n\n- Terrible save game system. A couple times after a long battle, the quick save is disabled and it wouldn't give you time to do a manual save because it would pull you right into another long and boring cutscene. During this time, the game would sometimes crash, and I'd have to load an old save game and redo the whole battle again. Such a ridiculous game design. I keep my gaming rig cool and stable, and I play a lot of games. This game has crashed on me more times than any game I can remember. \n\nI'm just happy that I got this on a good sale and didn't pay full price.\n\n1 out of 5 stars",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "There are no orphanages in America.  The legal structure for it just doesn't exist.  There might be edge cases of foster parents grossly abusing the program but the concept of a structured orphanage just has not existed in America for decades.  The type of foster situation depicted would put the people at the top all over the media!  Never even minding the bizarre cult that comes off as crass parody, which does all this and also miraculously protects the identity of the McGuffin, the plot doesn't make ANY sense.  Why set your plot outside of Japan if you are just going to make pretend it's Japan??  It's not just the orphanage, it's cultural stuff all over the place.  The writing is filtered through a prism that distorts way too much for anything coherent to emerge.\n\ne - the more I think about it, the dumber it gets.  so many natural born and raised English speakers are just primed and ready to speak fluent Japanese and bow/respect with perfect mannerisms at any Asian looking person.  except when these people speak in English, which they always contextually know when to do, and depending on the budget for the character can range from distracting and thick accented English to native competency but Fiverr delivery.  I played with Japanese audio and out of empathy for my fellow man I refuse to imagine the nightmare the English voice director probably went through trying to interpret the intention.\n\nThere's a whole lot one could say about the treatment of Ichiban as a foreign national \"without an identity\" but I suppose if you just wanted to get over it you could chalk all of that up to commentary on the universal treatment of police on the vulnerable, and yes, American prejudice.  However, you just can't terminate the thought there like the writing wants you to.  The way the story draws out its painful legal arguments to Ichiban's predicaments makes you realize the writers don't actually have a clue what would happen.\n\nRereading this makes me realize all of this applies to Chitose just as fairly, though at least in her case the emotional confusion itself is much more fundamental to her story.  There are other gross obvious problems with her story that actually have nothing to do with the immigrant tale but let's hold on to an emotional hook where we can get it.  I guess after my 35 hrs I find Kiyru's story the most credible overall but there's almost nothing to it at the point I gave up so maybe I didn't give them time to cook and make something awful.\n\nLanguage and cultural barriers are intimate and significant to Ichiban's fish out of water with the exception of when translating across boundaries is just too hard.  Lame, and ill advised.  This becomes especially obnoxious when there is so much tedious dialog that adds nothing where that kind of tedium would have semantically made sense in other places.\n\ne - gameplay is fine.",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}