{
  "positive": [
    {
      "review": "This game said it was free to play… they lied. It costs friendships. You think you’re just dropping in with your boys? Nah. You’re dropping into emotional bankruptcy. One second you’re all laughing, the next second Chad ‘accidentally’ forgets to cover your flank and your million-dollar kit is gone. Now you’re broke AND you hate Chad.\n\nThis isn’t a shooter, it’s a social experiment. Arena Breakout Infinite doesn’t just test your aim, it tests your ability to forgive betrayal, cope with poverty, and resist the urge to uninstall Discord. GG devs, you made the first truly pay-to-friendship game.",
      "voted_up": true,
      "votes_helpful": 418
    },
    {
      "review": "The game is great, but it has many flaws, which other players have pointed out in angry comments. I've been playing for 23 hours and haven't encountered any cheaters, only those who scan crates for valuable loot, but otherwise, I haven't encountered any. Playing solo is pointless; it quickly becomes boring and leaves only a bad impression. But if you grab a couple of friends or meet some people in matchmaking and play in a group, it won't even matter whether you lose the raid or not; it'll be fun (that's what we came for). Dying alone with 700,000 loot, or playing in a group, replaying positions, exchanging fire with other players, and dying—it's not that annoying.\n\nHonestly, the game is for an amateur, for those tired of Tarkov and want to try something different. Because most of the people I've met here are grown men from the factory who either play CS:GO like gods, or young guys who buy sniper rifles and sit in the bushes for 30 minutes waiting for someone to show up.\n\nThe developers are working hard and constantly delight us with new bonuses, like gear and updates. The game is still being refined, and the developers are listening to player feedback.",
      "voted_up": true,
      "votes_helpful": 66
    },
    {
      "review": "I wasn't a fan of extraction shooters tbh. I tried Tarkov but got a headache from graphics, difficulty and cheaters. Then I found this game and decided to give it a try. And ever since closed beta I play it non stop with my friends!\r\n\r\nPros:\r\n- Graphics\r\n- Guide on basic mechanics \r\n- MAP. Thank God, developers understand that in 21st century everyone can use map freely\r\n- No pay to win\r\n- Completely free\r\n\r\nCons: \r\n- Outbalanced sometimes\r\n- Sometimes you just get shot from across all the map that's annoying",
      "voted_up": true,
      "votes_helpful": 58
    },
    {
      "review": "its a good game\n\nPros : \n- its f2p tarkov\n- more catered towards casual players\n- not so punishing as tarkov\n- Better QOL features\n- doesnt wipe, so good for casual players to play for long run, but makes end game boring\n\ncons : \n- ALOT of the guns are downright terrible, the dev forcefully nerfed most guns for budget run, terrible recoils even with full mods, some guns have their ROF manually toned down, like aks74u with only 500rpm (about 700rpm irl)\n- the meta of the game is in a pretty boring spot, its either HK416 or P90 because they are the only guns that handles well with almost no recoil and melts every armors, and people brings snipers with t6 (7 with SNB) rounds to quickly headshot people, requires skill but eh not my style, its a pretty okay playstyle imo\n- the most profitable loot in this game are player gears, that or red and gold tier items (ones that are 200-400k each not 50k), as ammo are incredibly expensive to get, while most loots are purple items that are like 10-40k each and some 50k-80k gold items. either pray for reds or bring alot of t3+ ammo out\n- last one is that since the game never wipes, there is not much thing to do after season mission is done, the game turns into casual arcade shooter, buy gear, get in, pvp, get out. the rich stays rich, the poor gets stomped and resorts to  ratting like.\n\nmy advice:\n- BUFFS ALL OTHER GUNS SO THEY CAN BE VIABLE TO COMPETE WITH META, WE CANT JUST HAVE ONLY HK416 AND  P90, it gets boring after a while. like make the recoil on m4 , the cost to build it is so bad that you can get a cheaper hk416 build that performs better. or just buff other guns, there are so many guns that are just so bad they arent being used at all.\n- add scope glints but do it right, this could fix the crazy amount of snipers on map with outdoors except for tv station. and add attachment to reduce the glint but not remove it completely.\n\nall in all, a great game to have and play with friends, being solo is a pain tho",
      "voted_up": true,
      "votes_helpful": 46
    },
    {
      "review": "A PVP focused Extraction Shooter where the PVP aspect is by far the weakest part. \r\n\r\nFirst the positives: \r\n-easy to pick up\r\n-easy gun customization \r\n-easy Call of Duty-esque get back into action quick playstyle\r\n-nice graphics\r\n-nice sound design: overall sound design not talking about footsteps in particular\r\n-good variety of maps and loot\r\n\r\nthe in-between:\r\n-player driven economy\r\n-relatively decent exploration even outside of the main POIs\r\n-ability to play what you like \r\n-\"tiered\" progression\r\n-satisfying loot experience (more prior to recent update now not so much anymore further detail in the lower section)\r\n\r\nthe bad:\r\n-directional audio: it's buggy sometimes, esp when it comes to elevation changes\r\n-gunfights: this gets picked up in the next section further down so look there for an explanation\r\n-current looting experience: since the latest update you now immediately know if an item is high in value or not bc high value items now take longer to be identified compared to regular items\r\n\r\nthe ugly:\r\n-cheating: yes they ban cheaters, yes they have an anti-cheat, does it stop ppl from cheating? well ofc iit does not, every MP game will have that problem and i am fully aware of that, the problem here is that your loadout is on the line so if you have a high value loadout you're much more likely to store it then to use it or you play iin secure-ops where you can't lose your loot\r\n-economy: some players have millions upon millions if not billions extracted, you get to keep you money past \"wipes\" so those players have an immediate advantage over new players and can diictate market prices, yes the game does combat that somewhat by giving out tier 4 gear like candy but that doesn't help against artificial inflation of ammo and gear prices esp above tier 4\r\n-gunfights: Part 1 PVE: like i said above, the point returns, why? Bc it fits both categories, gunfights against bots are by enlarge mundane and more nuisance than challenge, i get it just like in Arc Raiders the bots are supposed to be a nuisance that you have to take into calculation for gunfights and can use as an asset, the only exception to this are bosses and the additional spawns alongside them as they usually carry higher tier gear, react faster etc. i'm not saying bots should be as overpowered as they are/were in Gray Zone Warfare but i wish there would be different tiers of AI and esp the AI in TV-Station, inside Armory and inside the Hotel on Northridge could def pose more of a threat than they do now. Part 2 PVP: gunfights in PVP are insanely hit or miss, either you get matched with people with full Tier 6 armor, H416 or Mosin with Tier 7 ammo, usually in a duo, trio or squad stack or you get matched against people doing corpse runs i.e. standard kit, no helmet <200k loot value, no in between, the former you will not win against nor will they lose any money while \"risking\" their gear bc their friends will just pick up what they had on and exfil right away, the latter you prob spend more money than you gain, this is by no means exclusive to ABI but it somehow feels unfair nonetheless\r\n-matchmaking: if you're a new player who just started out and you get matched against seasonalnolife557 with 20bn extracted tell me where the balancing is, one risks his loadout with the potential of going broke while the other sits on stacks of cash throwing one Mosin with full red ammo and 50 slot backpack filled with nades and stims into the raid one after another without a care in the world part of the experience? absolutely, the norm? it shouldn't be.\r\n-PVP: by far the worst part of the game, the game has to my knowledge 24-tickrate servers, that is quite abysmal, heavy desyncs are a feature, trust me, i do not know why they even feature a killcam when 90% of the kills look like they're cheated but are simply a problem of desync, overall the PVP aspect is heavily unbalanced and in many cases actually unfun, why can people bring full tier 5 gear and an M4 with a semi decent kit 60 round mags full of tier 4 ammo into a raid with a value cap of 450k, well simple, they cheat the system, bc mags can be stored in backpacks and do not contribute to equipment value that way, worn armor is valued less than new armor, which makes sense but then you should add a gear cap instead restrict the items ppl can bring into a raid by making it so the lowest mode (450k equip value) can only be tier 3 or lower and do not allow crafted items, then for the next difficulty make it tier 4 + 5 only (unable to queue with tier 6 stuff but able to queue with <tier 4) and then lastly a open difficulty where absolutely everything goes but a minimal amount of loot value has to be equipped (basically like it is now)\r\n-high value loot (red items): prob the most dividing point of criticism i have but i think high value loot (red items) should not be allowed in safe storage, yes they are rare and insanely valuable but exactly due to that reason it should be high risk, high reward, not, get lucky, store in safe container and don't care anymore, PVP is the center of the game, therefore it would only make sense if red items could not be stored in a safe box and instead drives up the risk and adds more tension in an otherwise, \"oh red, nice *put in safe*, *runs to exfil*, *dies*, eeeh whatever at least i got 1.6 mill loot value :)\" scenario.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "One of the best extraction shooters out there In my opinion. I just wish there was more maps.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Having a tier cap instead of a Koen requirement/cap would make more sense, since with the current system you encounter full T4 players in normals, T5/T6 in lockdown, and “naked” players with T6/T7 bullets in Forbidden. By the way, there is no cap for the ammo. This is not good for new players, for the casuals that run a few lockdown matches every day, or for the more serious/hardcore players. Even if it is easy to make money and get gear, those new players probably won’t stay long enough to find that out.\n\nIn my opinion, we should have a T3 cap on normals, T4 in lockdown, and, in Forbidden, a minimum requirement of T4. Bullets should be capped at those tiers too.\n\nA prestige system would be great as well. Since there are no wipes, you could “create your own wipe” and earn some rewards.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Wow, this is Tarkov's vision, fully realised.\r\n\r\nNo shitty performance\r\nNo ugly graphics\r\nNo waiting dozens of minutes of matchmaking\r\n\r\nAlso, no asking price. Tarkov wants 50 bucks for the pleasure of disapointing you.\r\n\r\nThe gameplay here is on point. Shooting and movement feels good. Sound is amazing, and so are the rare pieces of music.\r\n\r\nIf you wonder what the extraction shooter craze is about, this is a great place to start.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "I know I only have 5 hours so far on this game and hopefully by the time you read this there are a lor more. As a person who has played EFT for a few years with about 300+ hours which isnt a lot but enough to get my feet wet I would like to say this is a nice change of pace. I don't mind the Quality Of Life improvements they have like an interactive map to set waypoints, letting you know what you need for in game extractions that may be available, or by having the loot value in game so you know if something is worth grabbing or not. Just off those few things make this game a little more fun in my opinion. It has a nice mix of PvP and PvE for me and the bots aren't overly hard except if you come across a boss. I hope this game gets better and better with each update, I'm looking forward to what's to come from this development team.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "If you have ever dreamed of spending 20 minutes looting and sneaking through a map just to be instantly deleted by a guy who has been photosynthesizing in a bush or been camping in an angle since the beginning of the match, then congratulations.\nArena Breakout: Infinite is your paradise.\n\nEdit: I've played the game before the release on Steam",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "After around 60 hours in Arena Breakout: Infinite, I can say it’s a fun, fast paced extraction shooter with great gunplay and solid map design. The weapon customization feels deep, and the risk and-reward of each raid keeps the gameplay exciting. When everything works, the firefights and extractions are genuinely satisfying.\n\nThat said, the game isn’t perfect. Hit reg can be inconsistent, the AI is sometimes weird, and the matchmaking can feel unfair when you get thrown against full squads. The monetization also leans a bit too hard into paywalls for convenience.\n\nOverall, it’s a great experience if you like tactical shooters and you’re okay with the occasional frustration. At 60 hours in, I’m still enjoying it the highs are worth the lows",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I don't like shooters all that much, but I like the ebb and flow of this game. It's fun to just run around having some random American scream \"I'll bury your ass right here!\" at you while your friend is injecting some, definitely not legal, drugs into their arm.\nThis game has a lot of variety and complexity for every type of player, and it's not held back by being free to play, since you can buy every item in the game with in-game currency and skins with real money if you want to support the game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Arena breakout infinite takes all of the shitty things i hated about tarkov and just deleted them from the game.\n\nyou don't have to play this one as a full time job or spend time training stats or even have great gear 100% of the time because the bullets will hurt you and (outside of extreme cases such as shooting a level 5 armored man with level 2 pen bullets) kill you pretty fast.\n\nI especially like how the game works when I boot it up and it doesn't take 7 1/2 minutes to load the main menu and then another 15 minutes to find a match and then another 5 minutes to actually load into the match, all of these things happen in a matter of seconds like a video game in the current day and age should do.\n\nMy only real complaints with the game are that this game is in-fact a free to play game, which means there is a cash shop, not only just a cash shop but a membership that you have to pay for so you can get benefits such as more slots to sell items on the marketplace or a bigger secure container so you can safely bring out more valuable loot. The biggest problem i have is that this game has a fucking gacha system sometimes????? Like they will create a cosmetic set and then you have to purchase rolls for it?? Its so absurd that I have never even thought of buying any of it, not to mention that the shop prices are INSANELY overpriced like we are talking 50$ for a single virtual skin in a videogame.\n\nPlaying this game made me truly realize that you really don't need a russian man with a ego the size of a blimp and a love for 300 dollar white t-shirts to have a shitty time shooting at dickheads in fields, you can do that with the chinese government and a few friends just as well.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "As a free-to-play game, it’s definitely worth spending time on, but after a while the gameplay loop starts to feel repetitive. My suggestion to the developer is to remove the armor-piercing bullets because they take player skill out of the equation, and also to add more mods to the game. The NPC AI could also be much better and more challenging.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "As a Tarkov player for years, the Tarkov launch has confirmed that ABI is destined to pick up the genre and run with it.\nABI is much more enjoyable. It does need more content, and with years of support I see it surpassing other games in the genre.\n\nI have complaints, many.\nMostly just personal prefs.\nABI is free, if you like extraction shooters give it a shot.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "So far, I think this game deserves more than it gets props for. It is a light feeling extraction shooter, but the graphics are pretty good and it is nearly identical to tarkov in terms of what it delivers, and the fact that its free through that is absurd. I want to convince all my friends to hop on this for now as it seems pretty good experience overall (graphics, performance, gameplay).",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "+ Great detailed graphics. \r\n+ Realistic gameplay. \r\n+ Outstanding sound. \r\n+ Good game optimization, very smooth gameplay.\r\n+ Funny NPC chatter. \r\n+ Much less cheaters than in Delta Force.\r\n\r\n- Outdated menus and GUI.\r\n- Too much unusable invaluable loot.\r\n- Useless \"Contact\" trades\r\n- Not good for teamplay (revive possibility very limited)\r\n\r\nSits in a middle between Tarkov and Delta Force.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I've had a ton of fun with this game, from earning skins and quick kits its a very fun and validating experience. What I will say is that a PvE mode would be lovely since the current state of certain raid types is if you dont have the top grade ammo, then youre going to die fast since Ammo does not count towards gears score in any way. People bringing tier 5 ammo and tear 5 armor into the lower area sucks, spawns may need a bit of a shuffle since folks are sprinting spawns. All in all a very enjoyable game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tarkov was the best of the estraction shooter saga and then it died with multiple ways to scam you and make u suffer. Arena Breakout Infinite instead takes another approach with multiples ways for you to get walthy and happy without opening ur wallet even if it's a free to play. The F2P with a true concept with a true identity who wants to make u become stronger and wealthier,",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Love this game, I think because Tarkov has left such a bad taste in soo many peoples mouth, they do not wanna try this game because even though the game is doing good right now it should be doing allot better, Devs have done an awesome job so far! hopefully they continue to add more to the game! If a dev ever so happens to read this: please add proximity chat! i think that is one big thing that could make this game even more fun than it already is!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Positive, but needs balance. ASAP\n\nGames are separated in 3 \"value\" tiers (normal, lockdown and forbidden), each of them with a equipment value requirement (0-450k, 100k-1M, 300k-infinite).\nThe problem is that the range is too wide, in the mid-tier \"lockdown\" 100k people has almost no change against people with 1M. In top tier \"forbidden\", the problem is different: 300k barebones snipers are killing 2M players with just a bullet.\n\nBalance makes no sense.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "They claim this game is free, but that’s only true if you don’t count the hidden fee: your entire friend group. You launch it thinking, ‘Oh cool, some casual extraction fun.’ Five minutes later you’re emotionally foreclosed on and considering blocking half your contacts.\r\n\r\nEverything starts wholesome, everyone joking around, morale high. Then Brad (it’s always a Brad) decides to ‘try a new route,’ which is code for ‘leave you to perish instantly.’ Your gear? Gone. Your trust? Deleted. Your friendship with Brad? Currently in the ICU.\r\n\r\nThis game isn’t entertainment, it’s relationship Jenga with guns. Arena Breakout: Infinite isn’t checking your aim; it’s evaluating how fast you crumble under stress, betrayal, and unexpected poverty. Shoutout to the devs for inventing the first-ever F2P: Free to Play, Fee to Participate in Friendships title.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As others pointed out, it's similar to EFT but imo slightly easier and more enjoyable. As someone who didn't enjoy Tarkov this one is somewhat better and f2p, so nothing to be mad about. Haven't tried out solo yet but with a group of friends its a mixed feeling of playing both Tarkov and CoD Warzone. Overall very solid, but not something I could play constantly every single day, most likely because this is not my prefered type of genre anyways (not a fan of PUBG, Tarkov etc).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I saw my friend play this game but it's mobile version. So I played in mobile and PC. It's really good I guess.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Feels like a less buggy Tarkov with a ton of quality of life features and great graphics, you also don't need a wiki or map on your other monitor to do quests.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "realistic game pretty fun for weekends having a lot time to spend for \r\nits actually pretty good but needs to fix bugs and making it more optimize for all kind a hardware",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "free version EFT for sure BUT it got some issues with soundings and some visual specs. bright future a head if they done mess it up.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game since it's free, unlike Escape from Tarkov and it uses \"ACE\" which is a fantastic anticheat every Delta Force player is very fond of",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Arena Breakout: Infinite isn’t just a game—it’s an experience. Every raid feels like a story waiting to happen. One minute you’re geared to the teeth and feeling unstoppable… the next you’re yelling at the screen because some rat was hiding in a dark corner with a pistol and ruined your whole day.\n\nAnd honestly? That’s the magic of it.\n\nThis game makes you laugh, rage, panic, and celebrate all in the same match. It will test your patience. It will test your friendships. You and your buddies will accuse each other of throwing the raid, scream when someone steps on a mine, and then immediately queue up again because “we’re not ending on that.”\n\nThat said, the game does have rough spots—new players may feel overwhelmed at first, the learning curve is steep, and some early progression can feel a bit grindy. But once things click, the game becomes genuinely addictive.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my first extraction shooter and I'm glad this was my introduction to the genre. It's very beginner friendly and the learning curve isn't too bad. I hope the devs keep taking this game in a good direction and I look forward to where time takes it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Some deaths are questionable, but overall gameplay feels smooth.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game, has a few things to workout like hackers, imbalances etc but great to play a bit with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I hope it stays this way. Not every shooter games needs over-the-top cosmetics or clownish skins that break immersion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Here my 5 cents....\nPerformance is much better than Tarkov...but overall is much more advanced and thought out than ABi...maybe time will bring them to par.\nArmor and Ammunition is really barebone and far away from realistic. The loot is not plenty and only the safes are POI where e´verybody rushes to in beginning of the round. \nThe maps are small compared to Tarkov...but maybe they will be expanded in the future like farm.\nLet it cook....its an  more than okayish Extraction Shooter.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "died to a cheater? just report and got your money back nice. Game still good after 3 season. Nothing to complaint game is free, game is good, game is fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I HIGHLY recommend this game. It's got great control and amazing direction, and feels a little bit looser compared to Arc Raiders if you need a break from it. I myself needed a break from Arc Raiders and this is just great for me. \r\n\r\nPros: There's plenty of pros about this game. Just the fact that its graphics aren't like Hunt: Showdown shows something for free and paid games. Unlike many other extraction shooters, this is a VERY safe approach to a vast genre. (Also the fact that this is free just proves its greatness)\r\n\r\nCons: Little to none, the tutorial explains everything relatively well, but some parts of the game are intuitive. The only other con is navigation when in the home menus... its just a little slow for my liking BUT THIS IS PERSONAL PREFERENCE! By any means, this game is free and you should try it out! :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "loot die, loot die, loot die, loot big ass win get go raid with 450 000k off equipment DIE . would totally recommend this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game itself is very enjoyable. However, developers have a way of banning players who randomly get matched in a squad with hackers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun extraction shooter that seems to be quite fair and is not pay 2 win. A bit much at the beginning as you see so much inventory and stuff thats free and that you can unlock and get for free and unlock but after a while you know what to do and can manage your inventory with little breaks of shooting other people.\nI can recommend checking this out if you are curious about this genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i am playing this game frome beta an honestly it wasent that good in that time but now its difrent\r\nits just better than some ex shoter in the f2p area so give it a try",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not bad game good optimisation and mehanics in game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Simplest way to describe it is Tarkov but just better and actual dev support",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Install. Watch login screen for 15 minutes. Get 700 orbs. Uninstall. Profit! Best temporary use of 90GB of drive space ever.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have been playing since just before the steam launch and while I will say that the learning curve is steep, there are genuine metas, and \"ratting\" is an ongoing thing... \n\n1) I haven't had this much fun in a game whether I play solo (I don't recommend if you want to fight big fights) or in a group (Do your best to find people who match your vibe. The devs have a discord with an LFG.)\n\n2) I have only been killed by top tier gear in the more \"end game\" modes. The ammo tiers are fun to deal with and you WILL get got by end game tiered ammo in the \"normal / noobie friendly\" modes... remember that that person spent up to double your amount in gear... they're more likely to lose more than what they gain lol.\n\n3) Never ran into a rat that killed me... and I play halfhazardly with no regard for my own gear...\n\nAll in all, the game is great! You're less likely to run into sweats than if you were to play Tarkov, and the other extraction shooter that had just come out (posted 11/13/25) is just as good an alternative, just be aware of the content creator curse is all.\n\noverall rating would be a 8/10. There are still bugs that I personally haven't dealt with but my team has at some points, and I cannot emphasize enough that you need to find a group that matches your vibe and playstyle in order to genuinely have fun with the game. \n\nMoney and gear can be regained relatively easily, just gotta be patient and remember to have fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A first person extraction shooter that you can be a dad and still play!!! In other words it doesn't have to take all your time in a day just to keep up and pvp.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I had my time with Tarkov as I have thousands of hours in it. ABI Is extremely similar but with better Gunplay, better progression system, and more frequent pvp. \n\nA lot of people call it the \"Casual Tarkov\" because yes you can play ABI very casually if you please, but if you are a hardcore gamer don't let that title scare you away because it has a lot of depth and grind to it. Trust me you'll die a lot.\n\nOverall ABI reaches a wider demographic of people who like extraction shooters. From casual to hardcore there is a spot for you in this game. Also good on the devs for removing \"Pay to win\" and at least trying to weed out the cheaters frequently (yes you will still run into some like every other shooter) Give it a shot its free.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "After a couple of hours into the game, I feel like I can pitch in and say a thing or two about it.\nTl;dr, Tarkov and COD had a baby, this is it. Arcadey with a smidge of difficulty, some quests and maps that are either very \"boring\" in terms of design or labyrinths until you get the gist of them. I'd highly recommend giving it a shot for at least about 10-15 hours.\n\nNow, if you're bored and wanna read more bullsh-t, let's talk about it in detail.\n\nDifficulty levels:\n\n1; Normal. This is aimed at new players looking to get acquainted with the game, controls, how the guns feel and what there is to do in this game. You have access to two maps, Farm and Valley, and regardless of which one you pick, you will be matched against what feels like 2 real players and a couple of AI \"players\".\n\n2; Lockdown. This is the sweet spot for me, more loot, better gear, higher risk & reward, seen only 4-5 cheaters here, even those are a big ol' MAYBE as I want to give them benefit of \"Maybe he had a better headset or something idk\". Costs money to enter, you need gear to be above 100k value to enter, you can run budget builds or go full out and run a good T5 kit.\n\n3; Forbidden. Can't say I like this one, if you're a casual gamer, I'd suggest sticking to lockdown, this is intended for people who are REALLY good at the game and know the maps in&out, and get prepared to be nuked. Want to play solo? Enjoy the artillery strike by a four man squad tossing dozens of nades towards you. There also seems to be a large amount of cheaters in this gamemode, per other people I've spoken to, I've played 5 games of forbidden in total, died to an extract camper once, cheaters twice (zooming through the map, bhopping) and the other two games were fair play, I didn't know the maps well enough at the time, but I'd go as far as to call them sweaty because who knows pixel perfect lineups.....?\n\n4; Solo. This is beautiful and I think that more games need this, not just extraction shooters. Your friends are taking a break, or at work? Hop in a solo match, no need to worry about being out numbered by friends with perfect communication over discord, sure, enemies may collude against you, but that's raaaaaare.\n\n//Weapons and gunplay\nWeapons? Oh, we've got plenty of guns to choose from, no matter the gun, it feels good to shoot, but you literally can't run anything below T3 ammo or else it's going to hit you with a \"Did not penetrate\" when you inevitably die. Guns aren't that costly, there're certain attachments that cost an arm and a leg, and two days ago we saw an insane price mark up in scopes, but I'm glad they're going down again. Good scopes cost a LOT of money, I kinda understand why but at the same time, what the f-.\n\n//Gear.\nHelmets come in two variations, those that allow you to wear headphones and those that don't. The ones that allow you to wear headphones, choice is yours, you can either wear a pair or hope to get one from an enemy (some people don't run any, ever. Psychos.). Helmets that don't allow you to wear headphones are further split into two different categories, those that block sound and kick your master volume down, and those that come with built in headphones. I personally LOVE the helicopter helmet when running on a budget as it offers full face protection, comes with decent headphones AND it has good durability.\nBody wear is split into two categories, armor and armored rigs, difference is that with armor, you can wear a rig separately, whereas with an armored rig the rig is built in. Armored rigs are budget friendly and rather handy in certain situations, but I'd suggest against them overall, two reasons. You get into combat, your armor gets torn, you can't quick swap with enemy armor cuz then you have to transfer your mags to their rig, and it's very limiting. Why not just run armor and grab a rig from an enemy? Or, why not run a rig only and grab armor from an enemy?\nBackpacks are, eh, I don't wanna delve into them, weight plays a huge factor in movement and stamina in this game so a lot of players don't really run backpacks as they hope to grab one from an enemy they kill or from AI. They're split into multiple categories too but the most common backpack(s) I see are the RushTac and the 926, though in my humble opinion I think the Chapman is the best backpack in the game, it's cheap, large enough to fit in plenty of loot and it weighs less than the AMP7 which offers 2 slots extra, which just isn't worth it imo.\n\n//Repetitiveness and replayability.\nThis is a tough one. I guess it depends on the person playing, but here's the main question. Do you like battle royales? If yes, then this is probably a decent contender. But hold on, this is not a BR, this is an extraction shooter, what do you mean? It's arcadey enough to not bore you or require too much grinding to get decent gear and it's got maps that are neither too big nor too small, instead of \"dropping\" somewhere the game gives you a sh*t spawn and then you make your way to where action's gonna be and duke it out.\n\n//Final say.\nI've no idea what else to say, game's fun, it's *kinda* pay to \"win\" but not nearly as much as other games, let me explain. You can pay for a bigger safe (you also get free trials, I think you can rack it up to 30~ish days if you start now), you can buy 2x2 or 2x3 ($5 and $15 respectively), you also get other benefits such as increased weekly limits for market listing, increased market listings at the same time, extra storage with the $15, but here's the kicker. IF you buy the battle pass (which is worth every penny if you ask me) you get the $15 \"elite privilege\" as well for 30 days..... which is basically battle pass+elite priv, two for the price of one. Other than this, I can't really say there's anything else that's pay to win. You can still make money even without it, the best case you can get is locked behind quests, so you can't buy it even if you wanted to, I want to say that \"balances things out\" considering there're free trials but I can see why people would be against it.\n\nGive it a shot if you're bored and have nothing better to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best thing I can say about this game is: it feels like youre playing Tarkov without having to actually play Tarkov... It's free, and if youre looking for an extract shooter to play with friends, it's pretty fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it is without a doubt Temu Tarkov, but thats okay.  It's a little more casual in the ways that benefit it, but retains just enough of the realistic aspects of Tarkov to make it still feel Tarkovy.\n\nTarkov probably does maps better, and I wish there was friendly fire. There are lots of little things that aren't awesome (like hitmark audio queues that basically take away the need to confirm a kill). But the gameplay loop is addictive, the cosmetics are a little funny but good, and the ability to quickly kit up and get out is actually way better than Tarkov.\n\nDefinitely worth a try if you're not hopelessly devoted to Tarkov. After 1500+ hours, I was ready for something different and this scratched the itch.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been a Tarkov player for a number of years with just under 2000 hours game time. I have played through several wipes, dealt with crappy game performance, numerous bugs but have always returned to Tarkov. My mates recommended ABI to me a number of weeks ago and THIS is a breath of fresh air!\n\nThe Good:\n- smooth game performance. My FPS is always >165fps\n- gun play is as good if not better than Tarkov - The adrenaline rush of taking down a 3-man solo is just as exhilarating\n- Extraction points are marked on the map (oh yes, it has a map with marked areas. No steep learning curve for learning map locations.\n- gearing for a raid is much faster. You can click on an empty gear slot and it brings up several options (items you own are highlighted and you have an option to purchase items directly making it fast an easy.\n\nThe bad:\n- Economy is skewed to the higher end. T5/T6 bullets can cost you >20k per bullet.\n- There doesn't seem to be a wipe. Veteran players will have hundreds of millions of koen and will be able to afford top end gear thus dominating lobbies\n- The high end players are somewhat 'controlled' by lobby limits where different game types limit the value of gear you can bring in so lower end players actually have a chance at a fight. However, there are ways to get around this. Hope to see some changes here...\n\nDespite the not so good aspects of the game, I still think for the most part, it is a great game. I've fully switched over from Tarkov until BSG decides to up their game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "ABI – a better take on Tarkov, but with slightly grey visuals\r\n\r\nABI manages to take the core of Escape from Tarkov – realistic gunplay, high tension in every raid, and the constant risk of losing everything – and turn it into something smoother, more accessible, and simply more enjoyable. The game feels better than Tarkov in terms of optimization, pacing, and pure gameplay satisfaction.\r\n\r\nThe shooting feels tight, movement is fluid, and the weapon customization system is deep enough without drowning you in unnecessary complexity. Most importantly, progression feels fair and rewarding, not punishing like in Tarkov.\r\n\r\nThe only real drawback is the visual tone. The world tends to look a bit grey and washed out, as if it’s missing color and contrast. Sometimes it adds to the atmosphere and realism, but other times it makes the maps feel dull and lifeless – especially during longer play sessions.\r\n\r\nConclusion:\r\nABI feels like a more balanced, player-friendly, and modern version of Escape from Tarkov. If you want the same adrenaline rush but with less frustration – this is your game. You just have to accept the slightly grey",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "after playing for about 50 hours and reaching level 30, i had alot of fun but i think some of the flaws have become really evident. it comes down to the economy imo, the money feels meaningless after a certain point, so the grind becomes meaningless as well. my solution would be to add cosmetics to the loot pool/market so players have more reason to play. i suppose any cosmetics that were purchased through steam should be non tradeable to avoid any pay to win or gambling nonsense. i also think pistols should be dual wieldable to increase their viability, value, and overall enjoyment. also being able to buy more storage space as a free to player would be another good grind incentive. i think these changes would bring so many more players to the game and get everybody hype to grind and spam games. thnx for reading c: some other gripes i have are listing weapons on market gets annoying because the parts eat up all ur listing space and it gets tedious, solo raids shouldnt cost 350k to run, and the missions arent that fun to do after a while and should really just focus on u doing damage/ extracting value.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "No wipes puts this game far ahead of competing video-game titles.\n\nIt is a really good video-game with lots of features. Just needs more content, bigger map sizes, and optimization polish to really make it shine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Solid extraction shooter and for a free game it is very anti p2w",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Tarkov we have at home, yet somehow it feels more like a finished, feature-complete product than the troubled Behemoth from Sankt Petersburg. It may not be as \"hardcore\" and \"realistic\", but on the other hand it doesn't require two mortgages worth of RAM, has clear, understandable UI that contains basic information that should be in game (like... a map), nor does it require you to leave your day job.\n\nIt ain't perfect, net-code seems still optimized for mobile devices (so sometimes you get laggy feel of hit registration, despite there being no \"true\" lag to server), but it's easy to jump into quick (or long if you prefer) raid and have your blood pressure and adrenaline level rise, without needless complications. Also, despite it being free to play, I haven't personally felt that every raid is full of chea... I mean, owners of exquisite gaming chairs - yep, I had a few suspicious deaths in last two months, but nothing compared to (for example) Delta Farce. And without the need to pay shitload of money for that dubious privilege as with Tarkov.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I would say the game is an excellent introduction to extraction shooters. It was—and still is—my first experience in the genre. However, players who are not interested in squad-based gameplay should be aware of an important limitation: you must reach the max level of 30 before you can reliably face solo players only.\r\n\r\nIf, like me, you prefer not to queue with random squads or simply want to avoid dealing with toxic teammates or other people’s mistakes, you’ll often find yourself outnumbered in any given match. That means your survival rate depends entirely on your own decisions and awareness.\r\n\r\nYou can “rat” your way through matches and survive, but that playstyle quickly becomes dull. My preferred approach is a hybrid rat/chad style, since it feels more grounded and realistic than sprinting around like a hyperactive, twitch-focused CoD player. With that hybrid approach, your loot varies—and you always run the risk of running into a fully geared squad. Even if you manage to eliminate one of them, you’ll likely lose all your gear.\r\n\r\nOccasionally you’ll run into other solo players with a similar mindset, but every match is a gamble: is the fight between solos, or is there a full squad lurking nearby? Is this raid worth potentially losing 400k+ in gear? These are the kinds of decisions you’ll be making until level 30.\r\n\r\nMy concern is that I’m playing simply to reach that coveted rank, only to end up disappointed once I get there. Hopefully that won’t be the case. If the game did not have this “rage-bait” element, I wouldn’t be debating whether to just buy Tarkov and walk away from this one entirely.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Arena Breakout: Infinite – A 5★ Suffering Simulator\n\nArena Breakout Infinite is a game where everything looks gorgeous, the world were fun to explore, and every places whispers, “Come here, I promise this isn’t a trap,” right before you get ratted by a dude with gear worth more than your entire account.\n\nAnd somehow, you still load another raid because the maps are just too beautiful to explore more. Every container is worth the search. Toolboxes? Red item. Jackets? Red item. A random GYM bag in an abandoned toilet stall? (Farm motel 2nd floor) Obviously red item. There are no bad containers in this world only players too lazy and think the fastest money maker is by kill other operator or just looting a safe (L sweaty player).\n\nYou will die. A LOT. You will question your talent, your eyesight, your headset, and maybe your life choices, but quitting? Remember why you boot the game at the 1st time.\n\nThis game is a casino disguised as a tactical shooter, and the loot is your emotional and your sanity. Every raid feels like opening a mystery box where the reward is either red or trauma.\n\nDon’t fool yourself, there is zero fun here. Only pain, grinding, more pain, and that occasional moment where you and a friend laugh like idiots because some fully geared Chad vaporized both of you before you even finished saying “did you hear footsteps?” But somehow that makes the suffering worth it.\n\n5★. Highly recommended. Bring a friend so you have someone to blame.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think its a game.\nThe object is just don't die to keep loot.\nIf you do die then you have to use the loot from when you didn't die,\n or buy new loot with the money you got from selling the loot you got when you didn't die.\n\nso I don't know if theres a game in that somewhere.\n...it is fun though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Arena Breakout: Infinite genuinely surprised me. I didn't have high expectations, but that's exactly what allowed the game to really grab me. The performance in particular is a blessing... even in intense moments, the game runs smoothly and stably, without the typical technical clunkiness found in other games sometimes. This creates a pleasant competitive feeling right from the start, because you can concentrate on the actual gameplay instead of FPS drops or tedious loading times. \nWhat many criticize, I personally see as an advantage... it's much easier to get money and equipment than in the class leader EFT. For me, this is not “casualization,” but simply a different design decision. I enjoy equipping myself, experimenting, and not constantly worrying that a mistake will cost me several evenings of game progress. \n\nABI gives you the freedom to jump into good gear more often without having to farm for hours beforehand. That's why the game feels like a kind of Escape from Tarkov for people with less time. The entry point is flatter, the progression less merciless, and the reward loop more direct... without losing the fundamental appeal of tactical, nerve-wracking extraction gameplay. \nIt strikes a balance that EFT simply can't offer many players unless they invest several hours a week. \n\nIn short, ABI may not be the hardcore benchmark that EFT is, but it's an incredibly well-rounded, high-performance, and player-friendly alternative experience that appeals to me precisely because of that. For me, it's just the right balance of challenge, pace and reward.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its a good game of its type, battle pass, a lot of achievements, bonuses, adrenaline etc. all good stuff.\r\nProbably needs some adjustments around the balance, bullets, armor, requirements for maps, they should use some stats from the game and balance it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game but it looks like shit on 1080 monitor, I have to render it at 1440p just to see further than 50 meters",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "when first play.. got hunted like lion. now i become a hunter for the prey. focus is me the lion so i kill everyone. and then loot and make money. i play this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this is a good game, i started playing due to a friend who plays tarkov who recommended me this game if i wanted to try out the tarkov expierence without having to deal with all the shit from tarkov honestly its a good expierence i thought i would play this and move straight away to tarkov but its a good game on its own ill still probs move over to tarkov beacuse i want a deeper dive into the expierence",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very good game overall, 1-1 EFT clone but less of a learning curve. More pvp focused typically but every single raid theres someone proned in a bush with red ammo which saps the fun out sometimes. 6.7/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun extraction shooter free to play and a lot of microtransactions but not for me i only did it for the Discord Orbs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Uważajcie na osobnika pod nazwą 401dmg to streamer z Polski H2P_Gucio, z jego ust płyną klasyczne słowa „nie strzelać, sojusz, jestem przyjazny!” wypowiedziane z maksymalną pewnością siebie, maksymalnym urokiem i maksymalną energią „trust me bro”. Niestety jest to fałszywa przyjaźń i po paru minutach wbija ci nóż w plecy...",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Installed the game.\r\nLeft it on the menu screen for 15 minutes.\r\nClaimed my 700 Discord orbs.\r\nUninstalled the game.\r\n\r\n10/10 recommend.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "If you like Stalker, Guns and bullets, this game might be worth a try",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quite addictive, especially for a free game! Much better than Tarkov",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "what this game need is your aiming skills and patience, thats all. have so much fun with the boys but tiny little mistake then lost your million price kits, now you hate the boys for making step noise, from nothing to millionaire then back to broken bankruptcy again. this GAME disturbing my mental health. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i have over 200 hours in this game including the non steam release i have found over 500 reds including 5 utopias and i will not stop until i find secret doc",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Let me start off by saying, that this is a hardcore game. You may think, i'm in the middle of nowhere, there's no loot or anything, there shouldn't be anyone here, so i will jus... i'm dead. You need to be laser focused, no background TV or music, no hands free phone calls during the game, you have to see and hear everything! Obviously, it's an extraction shooter, so you have to invest a lot of Koen (in-game currency) in gear and ammo, to increase your chances of winning a gunfight. But the more you invest, the sweatier your hands will be and the more you'll be mad that a sniper tapped you, out of nowhere.\n\nKeep in mind, this is just my experience, not the ultimate facts, you may give the game a try and relate with none of this.\n\nNegatives:\n-Matchmaking. The beginner game mode (Normal's) is not beginner friendly. Long time players are playing among actual newcommers and on top of that, they're using gear exploits - putting parts of their gun in the backpack, to fly below the maximum gear value limitation for example. And they use ammo, that a new player couldn't even afford. So.. maybe after around the first 5-10 matches, expect no mercy and a lot of grey screens.\n-You'll often be thrown in matches 1v3/1v4, even if you chose that you wish to have teammates. And even if you'll have teammates, they'll often go their own way and will just use your death location, simply as information on where not to go.\n-It's too hard to see opponents, yet they have no problem locating me. Also, too much vegetation and the bushes have eyes. It's so annoying to not experience fair gun fights as much as i'd like.\n-The permanent confusion of: should i rush to get where i want to go as fast as i can, but make a lot of noise and possibly attract attention in the process or walk slow, but risk giving time for a potential sniper to glance in my direction.\n-Thankfully rarely, but it can happen, that, you're clearly out of your opponents line of sight, behind a wall, but you still continue to take damage and die.\n-Once you finish the quests and achieve the ultimate 3x3 secure case, the game kinda starts to lack meaning. You have to come up with some personal goals, like 100 million Koen balance for example or just continue playing for the sake of playing.\n-This game will test your patience/personality. There are no loser protections in place. The opponents will not get worse to match your performance, because you're doing bad, all you can do is suck it up. You can get eliminated 20 times in a row and there's no system in place, stopping you from going into your 21st loss. You can go broke and not be able to afford to enter the higher game modes, for all they care. I guess it refers back to the word - Hardcore, that i mentioned before. (although the game sometimes throws thousands of Koen and gear for free your way, it can go dry, just as quickly)\n-Looting boxes is mediocre in comparison to picking up opponents gear. Besides red items, which are rare and most often only in/near the few safes, looting is secondary and there's a huuge gap between them, in terms of potential expected value.\n-There's only a handful of guns viable, if you want to stay competitive. Others are just there as filler. And most guns recoil-shake like crazy, even with expensive upgrades.\n\nPositives:\n+Great tutorial in which you can take your time and set your prefered controls on the go.\n+There are some game modes, that can give a more forgiving experience, like Secure Ops. Although it only unlocks at level 18 and you still lose ammo/medication upon death and there's only one map at a time AND you will only get 30% of your loot value. Then there's Covert Ops, where you enter a Normal's lobby looking like a scav/bot, masquerading in front of regular players. You're given a random (trash) gun and gear, so you don't risk anything and you can play mindgames with the Normal players.\n+There's a possibility to enter Normal's lobby completely for free (knife runs). It's a stress free (until you get some good loot) way to experience the game. Allows for zero-to-hero type of experience.\n+There's no p2w aspects, the skins that people can buy don't have custom iron sights or anything. You also get some skins by simply playing the game, doing quests.\n+The events are really cool and add to the gameplay experience. Like, find a computer and choose from a list of items, which ones you want sent to your storage or the pumpkin event, where you either purchased or got a couple pumpkins for free by playing the game and each time you extracted (up to 4 times), they doubled in value. As of writing this, there's a plane event - flying over Farm and dropping a huge box with valuable items, that the whole map is trying to contest.\n+The maps are beautiful. The wind audio, the mountains in the background, the random rain, it's a vibe for sure.\n+The depth of the game. Coming from mindless battle royales, i really liked, that i can be playing this game for 2 months and still figure out new things, experiment with settings, techniques etc.\n\n\n\nThat being said, would i recommend? As i usually say, in my reviews, give it a try, if you're interested. It's a free game after all and i can't say for certain, you'll love it or don't even bother. If you're a better-than-average FPS player with decent decision making, you can have a good time. But you have to like the 'big-highs, big-lows' aproach to gaming, to enjoy extraction shooters. As frustrating as it can be, i'll give it a thumbs up overall.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "𝐈'𝐦 𝐭𝐫𝐲𝐢𝐧𝐠 𝐧𝐨𝐭 𝐭𝐨 𝐛𝐞𝐥𝐢𝐞𝐯𝐞 𝐭𝐡𝐢𝐬 𝐠𝐚𝐦𝐞 𝐢𝐬 𝐟𝐫𝐞𝐞. 𝐈𝐭 𝐫𝐞𝐚𝐥𝐥𝐲 𝐥𝐨𝐨𝐤𝐬 𝐠𝐫𝐞𝐚𝐭 𝐨𝐧 𝐬𝐜𝐫𝐞𝐞𝐧. 𝐚𝐧𝐝 𝐭𝐡𝐞 𝐭𝐞𝐚𝐦 𝐢𝐬 𝐭𝐡𝐞𝐫𝐞 𝐟𝐨𝐫 𝐲𝐨𝐮. \n\n𝐓𝐡𝐚𝐧𝐤 𝐲𝐨𝐮 𝐟𝐨𝐫 𝐭𝐡𝐞 𝐠𝐚𝐦𝐞. 𝐊𝐞𝐞𝐩 𝐮𝐩 𝐭𝐡𝐞 𝐠𝐨𝐨𝐝 𝐰𝐨𝐫𝐤 𝐰𝐢𝐭𝐡 𝐭𝐡𝐞 𝐧𝐞𝐰 𝐮𝐩𝐝𝐚𝐭𝐞𝐬..",
      "voted_up": true,
      "votes_helpful": 29
    },
    {
      "review": "best extraction shooter out there...at least for those that actually want to enjoy gaming",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Initially started playing because i wanted to play Tarkov\n\nGrahpics are really good\n\nGameplay is good there are good things and bad things about the game\n\nPros:\n-Maps are a good size and fairly easy to read\n-Gear isnt overally complicated although initially maybe a little confronting with ammo types vs armour types\n-People are generally friendly if you play random matches and get queued\n-Anti-cheat is good the game aims to try stamp out as many cheaters as possible\n-Game is just generally fun to play\n\nCons:\n-When playing solo and getting put up against 4 man squads that are juiced out of their brains\n-The gear limits in normals can be fudged and can make it pretty unfair for newer players\n-Being australian ping can sometimes be an issue but most of the time is OK\n-The ingame shop while not a mandatory part of the game the step up when trying to unlock a knife or outfit can become expensive if you arent lucky in the first 2-3 pulls\n-Some guns require rebalancing \n\nOverall i am having a great time playing Arena Breakout Infinite and am looking forward to the next season. If you want to play a Tarkov LIKE game with better QoL id recommend this game 100%",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "100% worth it less cheaters then Tarkov but just as fun and 100% ezer",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "70+ Hours in and I'm still baffled that this game is free. Coming from 100+ hours on Escape From Tarkov, I'm genuinely impressed by how this game matches up with, and sometimes even surpasses Tarkov in different ways.\n\nCombat: Top-Tier ballistic realism and gunplay. Armor works as it should. Limbs can blackout if not protected. Injuries are a bit simpler than Tarkov but still a relevant threat to livelihood.\n\nWeapons: A lot. Hop in the gunsmith and go crazy. I make all my weapons from scratch. No shortage of modifications.\n\nSurvival: You need to eat and drink but it never becomes that dire unless you expel a lot of energy in combat or get injured.\n\nReward System: This game is just as punishing but 3x more rewarding than Tarkov. The more you play the more rewards you get through events, missions, daily challenges, squad benefits, etc.\n\nMaps: All the maps are very well designed and there's options for every type of playstyle. Interiors look great and there's always many points of interest to go loot.\n\nLooting: Find household items and food in villages. Weapons and gear in government buildings and camps. Random items here and there. Everything has value and a use. While not quite as in depth as Tarkov (You find items on almost every surface) it's still impressively detailed.\n\nEconomy: The in game economy is great, yet I'm still unsure if it's fully influenced by real player transactions. Regardless, It ads an extremely addicting layer to the game as it gives every item you find value. A random junk quest item could be worth 5x the regular price depending on how many people are buying it for that quest at the time.\n\nCheaters: In my 76 hours playing the game I haven't encountered a single cheater. I unfortunately can't say the same for Escape From Tarkov. I don't know how they have managed to keep cheaters at bay but they're doing a great job.\n\nIf you're new to hardcore extraction looter shooters definitely give this game a try. It's free, very well done, and the replay value is nearly infinite.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Arena Breakout is functionally my introduction to extraction shooters, and overall I'd say that it's done a pretty good job. I enjoy the gameplay loop of gearing up, looting, silencing the opps, and extracting with that sweet sweet Koen. However, this dignified cycle of systemic violence isn't exclusive to AB:I. So what sets this game apart for me?\n\nWell, let's start with the goods. I truly adore the gun customization system. Nothing brings me more joy than purchasing a weapon bolt and building it into the firearm of my dreams, piece by piece. I also like the generally realistic visual style of all the weapons, armor, and other gear that one can acquire. I think that while the map selection is a bit limited at the moment, the ones that currently exist are solid and fun to play on. I don't know if there are direct analogs for it in other extraction shooters, but the Covert Ops game mode that spawns you in as an NPC militant with the worst gear in the world not only makes for profit margins that would inspire Mark Zuckerberg to buy another Hawaiian island but endows me with a deep appreciation for the brave men who nobly sacrifice their lives in going above and beyond the call of duty by shouting \"give me your gun, I'll show you how to shoot!\" before receiving the world's fastest open brain surgery at 750 rounds per minute. The healing system is actually great, and surprisingly satisfying to use. I was a bit turned off by it at first, but having 4 different functions for healing and the various levels of item that do each of the aforementioned functions make you feel like you're actually packing real medical supplies, and there truly is no feeling quite like realizing that no amount of bandages will perform surgery on my broken leg. The gunplay feels smooth, the inventory management is clean and intuitive, and- best of all- the game runs pretty well even on my laptop that already had sub-par VRAM when I bought it 3 years ago.\n\nNow we unfortunately have to talk about the bads. Something that immediately comes to mind is that the game could do with a bit more mobility options. Not being able to mantle things that even me after hitting arms could overcome with ease, not being able to climb through windows, and the occasional finnicky-ness of going prone tend to take away from the overall experience. Another thing- I wish that the game would actually put good use to the rank points system and put you in games with people of similar rank, or at the very least similar net worth. To my dismay, I have found no evidence of any system resembling what I've just said. However, the one that really stands out to me is how the game handles armor, and the penetration thereof. Now, I know that the armor penetration system in this game is not new or innovative and that it's featured prominently in other games like Tarkov. However, the effectiveness of different ammo types and their importance therein feels so blown out of proportion to the point where it starts to break immersion. Yes, a 9mm HP should not blow the lung out of the body through any plate carriers. However, a 5.56 FMJ round should be at the very least a significant concern and at the most a death sentence to virtually anyone, no matter how expensive your face shield is. Despite this fairly non-inflammatory statement, people will tank 15 rounds of 5.56 FMJ to the chest like prime Houdini tanking punches, only to then proceed to slime me out with a single round of gold ammunition that costs as much as a 2011 Kia Sedona. Do players enjoy being able to have an innate advantage by spending what would normally be a good raid's profit for me on a dozen bullets? Obviously yes, otherwise no one would play this game. But to me, it's neither fun nor realistic to be able to exponentially increase your lethality by simply paying more, and for several reasons. For one- I don't like having to hit the TF2 Heavy monologue about how much money just went down the drain when I fired 6 rounds from an automatic rifle in CQC. Additionally, this system of making extremely expensive bullets further incentivizes camping and the use of sniper rifles, two tactics that are infamously un-fun to play against. Last of all, it makes an entire level of the ammo caste system- and mind you that being 75% of what you can actually loot from the world- borderline useless. If there's one good thing that comes from this, it would be the immense satisfaction I receive when I blick down a sweat with the entire contents of my 40 round magazine consisting entirely of grey ammo, then find that he had enough value in his glistening gold bullets alone to put a down payment on a house in the big 2025.\n\nIn conclusion, I enjoy this game quite a bit, enough to the point where I've been trying to convert my friends to playing it like I'm a missionary 2 days before the second coming of Christ. If you are one of those friends reading this- take this as a sign. Hop on. If you're not one of those friends, I nevertheless hope you enjoyed my review and the modestly funny jokes scattered throughout, and comment \"skill issue\" below to remind me that human interaction is temporary, but Koen is eternal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One person I showed this to called this \"Tarkov lite\" which may be accurate; I enjoy this game so far; one of the things that could be improved is the balancing of some of the weapons that are practically unusable at the time of writing this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very solid game. Only have 32 hours on it but very fun so far. Sometimes a slow game depending on the map so you can play how you like",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Better than Tarkov. Easy to learn if you have played other extraction shooters. Good continuity and actively combats cheaters/hackers.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Probably the best extraction shooter atm. easiest to get into without giving up your job.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think this game is really good in the sense of an extraction shooter. It definitely makes streamers happy by giving them work to do and all that, but I'm finding it harder to play the longer I play. It's free, so you can't really complain about the experience, but it's a Tencent studio game, so you can imagine what's in store for you if you play PUBG. Dopamine mechanics out the wazoo. CLICK, REWARD. CLICK, REWARD. PARTICIPATE? REWARD. HERE'S SOME GAMBLING CURRENCY, GO GAMBLE FOR OUR NEW KNIFE RIGHT QUICK! If you're going to play, play responsibly. I feel like we shouldn't have to say that as gamers, but this is the slop we've come to expect from Tencent at this point.\n\nFor beginner players getting into extraction shooters, this is much less of a ball crushing factory than Tarkov. So casual gamers are going to have a good time here for the most part. Cheaters are abundant as always in these style of games, but I feel like you feel less bad about the experience as a whole since you can report them and likely get your stuff back. \n\nTeaming feels pretty good if you don't get kicked out immediately. I have found auto-match a lot more useful, in particular if you leave ranked play ON when you're trying to join a game. Try to load up a kit before joining another team in the TEAMS menu so they can see the vibes, if they're running rat kits and have loot priority unchecked, chances are they're going to rob you blind the second you get a kill or unlock a room. :D\n\nDespite the dopamine drip feel it drops off to after about 150-200 hours, you're not super reliant on spending money to play the game. It actually feels kinda of discouraged in a way, and you can get a bunch of money through secure ops if you have just one more kit kicking around and maybe 90k for some purple rounds. Remember to stay profitable playing Secure Ops. Really poor because of Forbidden Gamba? Covert ops might bring you some coin.\n\nTLDR: Weenie Hut Jr.'s of Tarkov. Bubble blowing babies permitted",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easier to pickup and play than EFT. More realistic than COD. This game scratches that sweet spot! Devs actually care and listen to their communities feedback. Almost 300 hours in I'm still hooked!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy the gameplay loop, only scratching the surface of the game but I am into the way the game feels and how I can play solo/duo/trio when I queue up. Extraction based game that does not feel overly sweaty or punishing to first time players. Big win in my book!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun %100 love Extraction shooters just wish it had a controller option for people new to PC like myself not used to mouse and key bored so i may get killed a lot just started this game and it is definitely filling my Extraction shooter needs  i rely like this type of game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ah, \"Arena Breakout: Infinite.\" Or as I like to call it, \"Escape from Tarkov: The Mobile Experience,\" now with 500% more \"suspicious background processes.\" Let's dive into this masterpiece of tactical extraction, which promises to \"strip away frustration\" while simultaneously giving your graphics card a mysterious new purpose in life.\n\n1. The Maps: A Tour of Desperation\n\nThe game boasts five whole maps, each \"demanding a radical shift in raid strategy.\" This is marketing for: \"On Farm, you get shot in a field. On Valley, you get shot in a bush. On Armory, you get shot in a dark corner.\" My favorite is the ever-changing weather in the Dark Zone, which \"alters every extraction into a new desperate gamble.\" So it's not just the sweaty guy with a sniper rifle you have to worry about, but also God himself, who apparently decided your loot run needed more atmospheric depression. Outthink, outgun, and extract before the zone and a sudden, scripted thunderstorm—swallows you whole.\n\n2. \"Effortless Mastery\" and the 5% GPU Miner\n\nThe section \"HYPER-REALISTIC, EFFORTLESS MASTERY\" is a work of art. It's a love letter to military authenticity that also holds your hand and says, \"There, there, just press this one button.\" It features the \"Ultimate Gunsmith System\" with over 900 mods. Because nothing says \"effortless\" like spending 45 minutes building a virtual rifle that will be lost to a 12 year old with a shotgun in the first 30 seconds of a raid.\n\nBut the real \"effortless mastery\" is the game's alleged side hustle of using 5% of your GPU. This isn't a bug; it's a feature! It's a subtle, immersive mini-game called \"Cryptographic Extraction,\" where your PC quietly mines for a digital currency called \"Koens\" while you're busy looting them. Talk about a passive income stream!\n\n3. My Tactical, Geometrically Distinct Squad\n\nMy personal raids are a testament to the game's diversity. I run with my two trusted operators:\n\nBOX: My man whose nickname is a perfect, literal descriptor. With a head shaped like a Minecraft block and a beautifully bald, dark scalp, he provides an unparalleled tactical advantage. His cranium has 90-degree angles, creating natural ricochet opportunities. Enemies shoot at him and their bullets just fly off into the sunset, confused by the laws of physics. He's not just a soldier; he's a walking defensive structure.\n\nSukhoi: Our Turkish military consultant. This man doesn't just play the game; he lives it. When he gets shot in-game, he doesn't just flinch. He lets out a blood-curdling scream from his room, followed by frantic tactical jargon and the sound of him hitting the deck. We don't need surround sound; we just listen for Sukhoi's PTSD-induced battle cries to pinpoint enemy locations. It's the most immersive audio cue a squad could ask for.\n\n4. The \"We Promise We're Not Cheating\" Anti-Cheat\n\nThe game's commitment to \"Fair Play\" is... aggressive. They proudly state they've issued 10-year bans to 123,000 players and reimbursed over 400 Billion Koens. Let that sink in. They had to create an entire in-game economy just to compensate for the sheer volume of cheaters. It's like a bank that's so good, it brags about how many times it's had to refund people after being robbed. \"Automatic in-game compensation will hit your inventory.\" How comforting, to know that after being robbed by a teleporting aimbot, the system will automatically gift you a slightly used vest and a can of beans.\n\n5. The Cyberpunk 2077 Crossover: Because Why Not?\n\nJust when you thought the gritty, realistic military sim had an identity, it announces a crossover with Cyberpunk 2077. Because nothing screams \"authentic tactical extraction\" like a soldier in ghillie suit fighting a dude with neon pink cyber-arms and a talking shotgun. \"Satisfy die-hard fans,\" it says. The \"die-hard fans\" of military realism must be thrilled to see Keanu Reeves offering them side-quests while they're trying to extract a broken LCD screen.\n\nIn conclusion, \"Arena Breakout: Infinite\" is a beautiful, chaotic paradox. It's a game that wants to be taken seriously while potentially turning your PC into a low-yield crypto farm. It's where my square-headed friend and my trauma-reenacting Turkish comrade can have the time of their lives, getting head-eyes'd by a hacker, only to be reimbursed with 400 billion units of a currency that probably has an inflation rate worse than Venezuela's.\n\nSee you in the Dark Zone. I'll be the one following the screams.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I somehow play better with a kit of a soviet reservist then I do with a modern kit... \r\nAlso it's free and fun so why not play it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a very good game play before by tarkove to see if you like extration shooters",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "YOU ARE THE EXTRACTION SHOOTER KING \n\nthis game is free and runs good meanwhile \"escape from tarkov is a paid game  cannot even login\ntheir practices is bad you paid large money cannot refund all because they n/a their dlc evil practices",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Why I chose to play this instead of Escape from Tarkov:\r\n\r\n+ QoL improvements: less obnoxious healing system, in-game map, compass etc...\r\n+ Faster rounds than Tarkov\r\n+ Cheaper than Tarkov (Free)\r\n+ Much, much more optimized for PC than Tarkov\r\n\r\nHowever, it has some cons:\r\n\r\n- 3rd party launcher like tarkov\r\n- Microtransactions in-game (f2p monetization)\r\n- Cheaters.\r\n\r\nOverall: 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, but ruined by hax, at least the dev's are doing something \"unlike VALVE\" but is it enough? and going to the future will the Dev's be consistent with the Ban's, if not, then the game will die thanks to the cheaters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wild. Something finally good enough to get me to [spoiler] quit playing Tarkov [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice pvp pve extraction shooter, its hard in begining to understand mechanics, but after it gets ez",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, im too broke to buy tarkov so got this. I am glad i downloaded this for free instead of wasting 45$",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You hear a small noise and suddenly your friend falls! He got sniped! you start looking for the guy but you can't spot anyone. Suddenly you fall the same way! You're furious.\r\nThat's your average first impression of the Lockdown Zone.\r\n100 games later and you are the guy who is making people by sniping them from far away.\r\n10/10 one shots, Would extract again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and addicting gameplay. Less intense version of Tarkov making it great for people that enjoy the intensity of extraction shooters, but don't have endless hours to invest in character progression.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, gameplay seems to be realistic yet easy to play. Highly recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game for all levels of gameplay, beginner to advance",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have a lot more hours from the official ABI launcher off steam. I love this game, its Tarkov but much less frustating all aorund.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "The game would be more enjoyable if there weren't so many players running Normal - Farm raids with Tier 5 armor, and stashed Tier 6 ammo... \n\nLiterally unplayable when you have low budget set-ups. Can't go anywhere without getting 1 shot thru your Level 4 Helmet by those people. GTFO of Farm - Normal if you have high tier equipment and plenty of Koen. Makes no sense why players hunt low-tier operators. Not like they're getting anything out of it.\n\nAnother gripe I have about this game is the fact that the Spatial sound system is often confusing. Enemies may sound as if they're on the same floor/level as you when walking/running nearby, causing you to enter a state of caution, slow walking and leaning toward the direction of the sound, then you quickly find out they're above or below you, resulting in an insta-death because you were looking in the direction of where the sound came from, rather than where they actually were... \n\nI also believe the TTK with higher tier armor on is vastly inconsistent. I've encountered players with similar armor sets equipped, using the exact same level penetration ammunition that I'm using, who can tank 4-6 rounds to the chest/helmet without dying, who then will somehow be able to turn around and confirm a kill on me with less than 3 rounds, despite wearing level 5 helmet + Level 4 face shield, Level 5 Body armor, and using the same ammunition as they were. MIMS... \n\nMy final gripe with this game; WHY CAN'T WE SHOOT THROUGH A WOODEN PICKET FENCE, BUT CAN SHOOT THROUGH A METAL OR WOODEN DOOR?! \nI can't tell you how many times I've been killed because I had an angle on someone in a firefight where trying to shoot over the fence between us in the line of fire resulted in just hitting the wood, or some invisible hit-box surrounding the object, without ever being able to hit the other player, while they're easily able to hit me in return. Admittedly, these situations have forced me to rage quit the game with an immediate Alt+F4. It's absolutely ridiculous that an M4A1 running 5.56 ammunition can't penetrate the picket fence made of drift wood that was poorly installed by Grandpa and his grandson Timmy on the farm, and that they were some how able to figure out how to create a forcefield around their fencing that extends beyond the height of the fence itself. \n\nBut, I have to admit, I do enjoy the gun-play of this game. If they did anything right, it was the weapon characteristics, ballistics, and the level of realism that is achievable within the limitations of it's context as an FPS game. The pacing of the game is exactly what I would expect from this style of shooter game. I really want to thoroughly enjoy this game, as the Development clearly has had a lot of time/effort and thought placed upon it. \n\nThere is unfortunately just a severe balancing issue with weapon damage, at higher damage/defense tiers. This creates an inconsistently fun / infuriating gameplay experience that is both enjoyable, and downright despicable, with many situations ending with a feeling of \"that was really unfair, and I don't know what I could've done to even think about winning that one\", and others ending with \"Dang, that guy was good. GG.\"",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "Been playing since S0 EA. Loved the game at first, but from S3 it really started going downhill.\n\nA typical day now:\n1. Gear up\n2. Join raid\n3. 5 seconds of running\n4. Instantly 1-tapped by HK + red ammo\n5. Repeat…\n\nThe time-to-kill and ammo balance feels completely off, and raids don’t feel fair anymore. \nHope the devs fix the meta because the game has huge potential, but right now it’s frustrating more than fun.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "please seperate gear tier like 1-2-3 from 4-5-6-etc because in raid like normal raid people bring tier 5 bullet to easy kill new player make them get bored of the game because of this \r\n\r\nnot many gun to play with\r\n\r\nplease make a good update",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Need to register an account just to play. I'm already logged in on my steam account, that should be enough.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game is great, but as soon as you reach the upper ranks its riddled with cheaters. every other game i'm dying to blatant wall hacks !!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I want to say play this game but ARC raiders exists and so does tarkov. is it a good free to play game HELL YEA!\nbut ever since i played with my friends who are at level cap of 30 yes its 30. i realized something the game has zero chill once you hit that cap. you stop enjoying games and just start going ok what will i lose this time. because its a 90% death rate when your in games with people with gold ammo or god forbid red. just shredding money away. this game is really REALLY unfriendly to those who don't like spending 200k on a kit. and if you don't want to spend that much well tough luck you have 2 maps. the rest are locked under having to pay 20k and having 100k worth in equipment that will get eviscerated by some one who sniffs their belly button with red or gold ammo. no middle ground strait into the meat grinder for you. and even if you want to go back to casual mode. as soon as you hit lvl 30 it stops giving you bots entirely and just gives you other lvl 30s. so even when you want to chill you cant.\n\nto those saying its a skill issue your not wrong im not the best but the fact i know im not the best is the reason i go in with low loot value. but doing that i have almost a zero percent chance of killing anyone with tier 5 armor shooting them in the legs only gets me so far. just get rid of grey ammo entirely its completely useless. you might as well shoot them with a bb gun. i know my limits and i would not give this a negative review if it was just my skill. its all of it. knowing that people have the abillity to push a i win button (red ammo) in engagements sucks. its that you cant have a permanent pouch increase sucks its a 1x2 on default. did you know that the 1x2 pouch used to expire as well. they got rid of it from the backlash but in tarkov you start with a 2x2 which you have to pay monthly to get in this game. just all of it gives me the ick.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I started playing this game for the first time in Season 3. As someone who struggled to get into Tarkov, I was hooked to this game. Eventually it just became not fun and infuriating. As a newer player it's too much of a grind to stack money, started to become out geared in every way. Players running T5 Ammo in Lockdown and even Normals. People even use it in Secure Ops. I have no chance playing their Solo mode because I don't have a lot of money to match up against these players and if I were to solo queue Lockdown or Forbidden; i'm matched against squads of 4. Why there isn't a Solo Lockdown or Solo Normal mode is beyond me. I only have 1 buddy that plays with me and it's almost every game we have to 2v4, sometimes twice. It's extremely hard to win consistently like this. We have auto-match on but the game never gives us players on our Team. Repeating the cycle of gaining money and then losing it all is just boring. When you're broke and have to run quick kits or cheaper loadouts....guess what...you lose more fights. This game just became way too toxic for me to play.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Great game, but account security and support are disappointing\n\nReview:\nI’ve been a big fan of Arena Breakout: Infinite since I started playing. The gameplay is incredible and scratches an itch that few shooters do. Unfortunately, my experience was ruined when my account was hacked and all my in-game currency (around 22 million Koen) and gear were stolen while I was offline.\n\nEven after providing screenshots and clear proof that someone else was playing on my account, the support team only offered a small fraction of the loss (about 4.2 million Koen) and closed the case. They acknowledged the issue but refused to fully restore what was taken.\n\nI’ve spent real money and time on this game, and it’s disheartening to see how little protection or accountability there is once your assets are “in circulation.” If you play this game, be extremely careful with your account and set every possible security option before investing time or money.\n\nI still love the core gameplay, but until account security and customer support improve, I can’t recommend it.\n\nUpdate 11/28/2025 Customer Support has purposefully been created into an obstacle to avoid any player friendly or positive solution because they can much easier just ignore any and all problems.  \n\nDO NOT SPEND YOUR TIME OR MONEY ON THIS GAME.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "BALANCE THE F****** GAME!\r\n\r\n-the game is in a horrible state, played long before the game was on steam\r\n-either get rid of thermals or make a mode for them\r\n-I can't be asked to look for a squad and go lvl 5-6. gear only to have a fair fight\r\n-If you queue forbiden your bound to die to a full stach of lvl6. with thermals that throw smokes at you and spam you trough it. The worst part is by their movement and aim you know they're shit bad at FPS games but it makes no difference\r\n-Why do I have to queue with other people to make money?\r\n\r\nmake more modes (solos, duos), and remove FUCKING THERMALS\r\nIf I want to play with cheats I would install them already\r\nIt's just never fun because you never get a fair fight in this game, if I want a fair fight I have to bring thermals and its just no fun playing with that shit\r\n\r\nI'll fuck off this game because I'm getting shat on by noobs who are shit but just throw smoke s at you and shoot you trough them",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is overall competently made and looks good. Gun customization is fun and interesting. But the actual PvP varies heavily. Unfortunately, especially as you rank up, it gets less enjoyable as you progress. In-game currency is practically worthless because its too easy to get; this both increases and decreases the tedium of missions depending on how you look at it.\n\nThe game is a lot of fun early on. It's basically Tarkov if it wasn't full of toxic sweats. As you progress, however, it becomes more reliant on arbitrary gear quality; ammo that does more damage because you paid more for it rather than any actual quality improvement, RNG on armor penetration, and so on. These arcade-style mechanics are why i'm giving up on ABI. I want to win or lose a shootout because of raw skill. Anything else is a waste of time with little learning opportunity.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "shit game bullet penetration percentage is an absolute lie a bullet with 57 penetration power wont even penetrate a lvl 4 armor but a bullet with 41 penetration power will absolutely penetrate your lvl 6 helmet for sure hit registration is absolute garbage and loot distirbution is trash specially locked doors, at the end of day yall must remember that this game is a chineese built game and dont expect any good thing in this game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm fine losing pvp fight but meta in this game is to just to camp with mosin or any other sniper and jerk off on extract untill someone comes. It was fun to play but 5 runs in a row dying to camping mosin isnt. Just do something about it like adding more buildings, it's pointless to play now cuz you're looting for mosin goblins that have looted over 500m but still play like this cuz it's the most profitable playstyle with the least effort.\n\nExtraction shooters should never have 1hko or it should be non-tradeable ammo/weapon that does this and have limited uses.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I have thousands of hours in Escape from Tarkov and this is an answer if you should bother playing Arena Breakout or go straight into Tarkov: \n\nNO if you have friends to guide you in Tarkov,\nYES if you play solo and want to learn the basics of extraction shooters with a proper map and other quality of life features\n\nNO if you want the original experience and your PC is powerful enough (top AMD CPU, good GPU),\nYES if you want a better optimized game which also has much lower waiting and loading times\n\nNO if you want some laid back gameplay and don't want to deal with cyber athletes and cheaters, you should rather go for Tarkov PvE or even Escape from Duckov\n\nDon't get me wrong, it's not a bad game and it's good to have some healthy competition with Tarkov. But as of now Arena Breakout is only at 10% of Tarkov's content and progression but at 1000% of Tarkov's skins and fluff.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Storage system is a shambles, the market is way overblown, the game is full of rats, there is no incentive to using expensive armor because you die just as quick, the game was fun for about a month but now I'm just sick of it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is good, but hackers are ruining the experiance, you cannot bring high end gear into the game because everytime you do that, theres a guy with 1.5k operator kills playing without ban for moths. Im quiting the game just for this reason, its unplayable. 10 games in a row, 2 games decent, the rest are just hackers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Add real skillbased matchmaking and make solo players play against other solo players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "⭐ 0/10 — “Arena Breakdown: Infinite Disappointment”\n\nI don’t even know where to start with Arena Breakout: Infinite. This isn’t a game — it’s a frustrating, soulless grind dressed up as a tactical shooter. Every second I spent in this mess felt like time being stolen from my life.\n\nThe gameplay? Clunky, inconsistent, and riddled with bugs that make every encounter feel like a gamble against broken mechanics instead of skill. Hit detection seems to operate on pure luck, and movement feels like wading through glue. Nothing about the gunplay feels satisfying — it’s all recoil, no reward.\n\nThe graphics try way too hard to look gritty and realistic, but the result is a washed-out smear of brown and gray. It’s as if the developers were allergic to color or joy. Sound design? Gunshots sound like someone snapping bubble wrap in another room.\n\nAnd don’t even get me started on the monetization. Arena Breakout: Infinite is less a shooter and more a cash extraction machine disguised as a game. You can practically feel the developers reaching into your wallet every time you load into a match.\n\nMatchmaking is a disaster, balance doesn’t exist, and the user interface looks like it was cobbled together at 3 a.m. by someone who’s never actually played a shooter. Performance issues, crashes, desyncs — it’s all there. This isn’t a “beta” problem. It’s a design philosophy problem.\n\nIn short: Arena Breakout: Infinite isn’t just bad — it’s aggressively unpleasant. It takes everything fun about tactical shooters, smothers it in paywalls and technical problems, and dares you to keep playing out of sheer masochism.\n\nAvoid it like the plague. There are broken indie prototypes on Steam that offer more fun, balance, and respect for your time than this polished disaster.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I didn’t play this game much, but it feels like the game doesn’t even want you to play it. I\r\n    This is my first time touching the Extraction Shooter genre, so it’s hard to compare it with other games of the same type. I’ll just write the negatives and positives:\r\n\r\nNegatives:\r\n1)    UI/UX: In one word, “non-Newtonian fluid.” Let me explain:\r\n1.1) UI: The game relies on an internet connection as if it’s a web browser game. Yes, it’s strange to say this about an online game, but let me explain. Literally any (except the game settings) ANY action in the game requests information from the server EVEN if you’re not in a match. Want to enter your inventory before the run — request to the server: “What does this loser have in their inventory?” Oh, changed your mind and decided to check the missions first — request: “What missions?” And because of that, if you press the inventory button several times in the main menu, the game will say “Don’t DDoS me, a**hole!”.\r\n    Also, when you want to look at an item in-game, there’s a chance that its icon won’t load in time and you’ll have to wait a bit… And yes, I don’t have fast internet and I play with 60–80 ping, but is it really that hard to load compressed item icons during installation?\r\n1.2) UX: In the game it’s unclear which objects you can jump onto and which you can’t, some rocks just have invisible walls or a few pixels you can stand on. \r\n     The door-opening animation is very slow… I’m not asking for slides or dives, but at least if you sprint into a door and it opened instantly, it would be much better…\r\n1.3) Sprinting and jumping is a whole separate topic… And if you climb to the first step of a staircase, then the second, and then decide to drop from the second step to the ground — the noise will be as if you fell from one meter high. (Ladder is cursed too)\r\n    Most likely it’s intentional, but sprint only works when moving forward (thanks for at least allowing diagonal sprinting).\r\n\r\n2)   When launching almost any mode (I’ll write about modes below) solo, there’s a decent chance to get matched against a squad of 3 players, and a non-zero chance against a squad of 4.\r\n\r\n3)   Purpose: The game itself doesn’t know what it wants to be. \r\n3.1) Rating gives almost nothing (ranked matchmaking can be turned off). \r\n3.2) Levels are just a wall between the player and the content, and the max level is 30. \r\n3.3) There are collection elements — but why? \r\n3.4) A bit of progression, but the important upgrades are only: crafting bullets that cannot be bought (level 3), and the speed of Hunger and Thirst change (level 3). \r\n3.5) There are supposedly 6 maps, but everyone plays on 2: the starting Farm or the last Arsenal (there are weirdos who love the TV Station because “you can be killed from any corner there,” I don’t see how that’s a plus). \r\n3.6) There are different modes, but “different” is a loud word: 3 of them differ from the classic only in the entry threshold of “gear cost” and loot prices on the map; one is 2 maps that rotate for some reason where you can extract without losing gear (but not consumables: bullets, meds, etc.); another is Solo mode (which is slightly broken by people who intentionally queue at the same time on one map to get into one match); another is playing as a bot (when there’s little time left in a match, a player is thrown into a bot’s body); and last is Gun Game from CS:GO. \r\n3.7) Missions: bring or kill. \r\n        Most likely this point exists simply because I don’t fully understand the genre, but there’s a strong feeling that if the devs focused at least on one aspect, the game would be more interesting.\r\n\r\n4) Replays: You can only see a replay if you were killed, and hit info only if it was your kill or your death… No general match replays (sad, but not critical).\r\n\r\n5) Spectating: Broken… If a squad has 3 players and you died, you can watch 2 operatives, but if one was killed while you were watching him and he was aiming, then when the second teammate aims, the spectator will see the dead player's POV aiming. (The same bug happens when switching between teammates while one of them is aiming). I won’t even talk about spectate delay — it’s not that big of a problem.\r\n\r\nNeutral:\r\n1) Sound:  In general the sound isn’t ideal, but I’ve heard worse. There is a bug where you run, stop, and the footstep sound flies forward. (Most likely thanks to the internet again, but there is no rubber-banding in those moments!).\r\n\r\n2) Economy and Monetization: There’s no direct pay-to-win, but there is pay-to-lose-less… The safe storage you get either through a subscription or by completing all seasonal missions. A limit on how many items are waiting to be bought, a limit on how many items you can list per week. These limits can be overcome with donations (or increased a bit through progression)… If Monetization was only on skins (which are Pay-to-lose and I like it) and safe storage than this point would be a Positive, but the selling limit is ruining it...\r\n\r\nPositives:\r\n1) “Free at our home”: it’s a good chance to try the genre without spending money — though now I’m wondering whether all games in this genre are like this or not.\r\n\r\n2) No rats: While playing, I almost never saw players ratting important places like “Extraction.” Yes, there are those who hide in rooms or bushes, but these players look more like cornered animals — the last survivors — rather than a coordinated ambush squad.\r\n\r\n3) Good maps (those 2 that there are): They have both open areas for sniper gameplay and hidden paths where you can move unnoticed, which means good routes not only protect you from snipers in ambush but also help to flank snipers from behind. In turn, sniper groups can’t just lie and look in one direction — they have to move or control several angles (and don’t forget grenades).\r\n\r\n4) Despite the fact that I criticized the game for internet dependency, there’s almost no rubber-banding (only when ping jumps to 600+). I was surprised that even with 300 ping I can still run wherever I want; the only problem is that the weapon doesn’t switch (but I understand that from the server’s perspective I’m in a different spot and can be killed even if I’m “already behind the wall”).\r\n    I don’t know how the devs did it, but when playing with high ping, you can empty the whole mag, your game will correctly and instantly show where you hit, but the information about whether the enemy died arrives later. (And non-ironically, this is the best solution for high-ping players). At some point I even started moving my crosshair away earlier if I saw that I hit the needed spot several times, because I know enemy will be dead.\r\n\r\n\r\n\r\nIf they fix the overall flow of the game or make it less sluggish in player control or smoother on the server side, then I’ll gladly come back to it and burn my time in it. (I mean that I want the Interface and Player Control to feel sharper, while the Environment should be smoother, so it’s clearer where you can climb, how to get down quietly, and so you don’t have to “jump off staircase”…).",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "take AI players out of the game, if your population isnt enough to get servers going then kill your game. tired of giving away my position on a T4 geared AI fake player then getting slammed by 150m away from a real player\n\npeople with 400-700 hours that are absolutely fucking clueless retards. TONS OF RAGE BAITERS. teammates that dont cover dont support dont comm until they wanna rage bait you and when you rage they just laugh, they literally provide 0 awareness 0 team support 0 firepower 0 tactics they are just there to get you to act a fool.\n\nworthless game and community",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was fun for the first couple of hours; however, the game quickly became horrible. The game has no player skill matchmaking and you have to be a level 30 to play solo matches. So in other words, as a brand new player, you will be put up against veteran players from the literal start. Also 99% of the time, you will be going against teams, even if you are a solo player. Yes there is matchmaking if you don't want to solo it, but as someone who prefers solo, there is no gameplay. Every game will be you getting jumped by 2-3 players who are fully kitted out and losing all your stuff and money. I would not recommend this game to anyone who wants the solo experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "good game when it works..... game will just randomly keep crashing and tell me that there are bad files and i need to redownload the game... like starting to get old. but other then that good game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I wish to formally announce my decision to withdraw from Arena Breakout: Infinite. After considerable deliberation, I have concluded that it is in my best interest to discontinue my involvement with the game and redirect my time and focus elsewhere.\n\nMy experience within the game has been, at times, both exhilarating and demanding. The tense atmosphere, intricate progression systems, and unforgiving combat mechanics provided a level of engagement that few titles achieve. Yet it is precisely this intensity that has led me to recognise that continuing would no longer serve my personal priorities or well-being.\n\nThis departure is not driven by frustration alone, but by a broader acknowledgment that the game’s increasingly competitive environment and substantial time commitment no longer align with what I seek from my recreational activities. While I hold deep respect for the developers’ ambition and the community’s dedication, I find myself at a point where stepping away is the most reasonable course of action.\n\nI leave with appreciation for the memorable encounters, the moments of unexpected triumph, and even the countless setbacks that tested my patience and strategy in equal measure. Despite my exit, the game remains a testament to meticulous design and uncompromising challenge.\n\nThank you for the experience. I wish the community continued success, both on and off the battlefield.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shooting, gun modding and survival elements really nice, but sadly there are things like terrible matchmaking, bad spawn points, and mostly hit registration that makes game really frustrating and unplayable after few hours of gameplay",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game is kinda dog s**t spend half the time providing yourself medical attention just to get ambushed three more times and not be able to heal again, and also the loot is crap in the low risk areas so once you actually lose your stuff its not easy to restock your equipment unless you buy it for way too much. the game is horribly unbalanced as well if you play solo you can still be jumped by full squads, full squads of rich players farming low level players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Honestly I am okay with getting killed normally or by a pro guy. BUT WHAT I CAN'T TAKE IS THE GOD FORSAKEN CHEATERS IN THIS GAME 80% of my deaths are from cheaters. I swear to GOD the AOE shots in all guns! and X ray visions(ISTG I made no noise and got wall shot). I'm tired of this game, if they can't fix the cheaters I'm gone",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this game is garbage nobody in their right mind should be playing this game all ppl do is sit with their cocks in their ass and hold a peak with a sniper while their mom hits them from the back with a strap on",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has potential on paper but unfortunately due to the type of game this is it really struggles to do anything special. It is essentially just an arcade version of Tarkov. Most of the mechanics are just ripped straight 1:1 from Tarkov. This game comes with a lot of drawbacks mainly because of the type of developers Tencent are and the clear unoriginality of the game. \r\n\r\nIt also has various raging issues like:\r\n\r\nLow tick rate servers. Obviously being a \"high risk high reward\" game this should not be a thing. Various reports state the tick rate of the servers are as low as 8hz-15hz which is horrible.\r\n\r\nThe monetization of the game is horrendous. Its a pure \"Gacha\" game with mobile gaming elements which is a big no no and any sane person would avoid it. Even something as simple as an outfit or melee weapon skin potentially costs upwards of $100.\r\n\r\nThe balancing of the game is ABSOLUTELY TERRIBLE. It has different bullet tiers (much like Tarkov) but the difference is in this game the armor level DOES NOT MATTER when people are using the best bullets. You could sit in a bush with a sniper with the best ammo and kill someone with 4m gear in one shot. \r\n\r\nThe gameplay loop is stale and boring. You run to exactly the same location every single match and loot exactly the same thing. Its so uninspired and stale I would rather watch Game of Thrones season 8 on repeat than endure any more of this. \r\n\r\nThe matchmaking DOES NOT WORK. If you queue as a solo (or duo) there is a high chance you will not even be matched with any teammates. \r\n\r\nThe maps are just pure Tarkov clones and lack any form of identity.\r\n\r\n\r\nI think my gripes describe the game more than enough. If you enjoy Chinese knock-offs of an already niche genre with gacha and mobile gaming elements + a boring gameplay loop then go ahead, I guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was fun until Steam release.... Than ppl started leaving the game cuz devs nerfs the wrong weapons and dont fix the cap for different modes. The events that ppl enjoy moast are time limited like Farm Storm.. If the devs dont figure out the priority asap the game will be left with the same old ppl that uses exploits and \"cheats\" to bring T6 gear into lockdown. And to all new players: M110 , AK12 and H416 is the only weapons you should care about. The rest is a waste of money and time. Sad but true. \n\nEdit: By nerfing the wrong guns I mean keeping the H416 OP and nerfing all others. Makes the h416 even more OP. \n\nThe game it self is super fun and looks very good. There is some desync issues, sound is wierd, etc etc but it is do able.\n\nAnother problem is that when matchmaking for other players you often get in solo and meet up with other teams with 3-4 players. This sucks all the energy out of everybody I talk to. If you go solo, you should meet solo, than duo, trio than full squad. Anything els is just very stupid IMO.\n\nThe game also need a full wipe every season. The group I play with have like 100 mil koen, and nothing to spend it on. Loosing all gear in a Lockdown or Forbidden is not an issue or a penalty other than you die... Compared to other streamers we are poor players...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "im not going to lie this game was horrible and the tutorial is like 1 hour long and it makes no sense, delete this game AS SOON AS possible, all reviews are paid for. this game is not even a game its just hell",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash game red bullet shot nearly outer new t6 helmet one shot dead, spend millions to play t6 but died by a rat with red ammo with only passable to enter with 300k :). Good luck mate",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wouldn't recommend the game in its current state, shot registration is bad which makes it even more frustrating if you get a drop on someone by headshotting them only for it to not register then they full auto you in the face.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To start the game is filled with cheaters. The \"ban waves\" they post about mean nothing, it's a F2P game so they just come back and continue to do the same thing the day after, it's the reason the numbers are always nearly the same each time. There are also many players who exploit bugs in the gear system in order to bring out more gear than is allowed in certain raids. Now add on top of all of that you are constantly being pushed to spend a bunch of money on skins that look like they are straight out of a fortnite & call of duty collab.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game could be amazing, the issues I have are the following.\n\nPlayers going into lockdown with minimal kit to get rich by camping. \n\nAutofilling squad the game should have full squads on match making and not putting people in on their own. \n\nThe big one is the inconsistency with armour and ammo. This needs addressing.\n\nI like the game but unless there's improvements in the next update I won't be playing again.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Downloaded only for the Orbs on discord ngl.\nGame is eh, when you first start they put you right in to tutorial no menu, its very easy.\ngraphics aren't the best (2k used), seems like an ok game.\nnot my style of game in general, sorry if this is a halfass review lol.\nAlso 81gb of space is crazy for this, 70gb my ass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "to much skechy deaths. newer now whos legit or whos hacking. even they make you to report them in the end  it doesnot matter, they are not taking any actions against hackers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Treating this as a paid game - No, it's not worth it. As a free game, yes. \n\nMatchmaking is horrific, consistently matched against teams way better geared than me when playing as a solo. Auto-match is useless, you often get no or maybe 1 teammate. Often when you do get teammates they are braindead and don't use their mic. \n\nThe tier system should work great to ensure balanced matches, but since ammo doesn't count towards your gear value, it's completely broken. Also, you can stash gear, attachments etc in your backpack to bypass the gear value. For some reason, they don't want to fix this - just limit normal to T3, Lockdown to T5, and have no limit on Forbidden. \n\nI am good at shooters, I've played plenty of extraction/battle royale shooters, and mil sims. If I find it difficult to enjoy due to the lack of balance despite plenty of experience with hardcore PvP, I can only imagine how much it sucks for more casual players or newcomers. \n\nGame will not grow, player count will stagnate and eventually die if the devs don't start using some common sense. There's nothing to do in this game except PvP, the loot only serves to let you PvP with better gear. There's no levelling, no significant upgrades or crafting to be done, no story. \n\nI've had great fun with the game, but after about 40 hours of raid time, Its flaws are weighing down what could be a great experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Decent game for what it is. But the game is OUT-CHEATED. Suddenly, my entire team gets instagibbed, and on EVERY killcam it's a 100% obvious wallhacker with aimbot....\r\n\r\nTragic. This game could be so good. FIX YOUR CHEATER PROBLEM!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fix the hide the high level gear in a rig bs that everyone uses to bypass the equipment cap before this game dies please. Good game if this gets fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Honestly, I only find it worthwhile to play this game because of my friends. There's absolutely no reason to play it.\nThe idea behind this game is good, but it's poorly executed.\n\n- The ammo types are absurd. If you use level 3 or lower bullets, you have a high chance of losing since everyone uses level 4 or higher.\n\n- Matches are won by whoever has the best ping 99% of the time, and since you can't change servers, you're stuck with it. It wouldn't cost anything to implement matchmaking regions.\n\n- The bullet spread is completely absurd. If you hip-fire, the vast majority of bullets will go straight and make no sense, even if you're moving or being shot at, which is unrealistic. Normally, if you're shot at, your character experiences greater recoil and loss of weapon control, but here that ONLY happens if you're aiming. So, you'll mostly find Call of Duty kids hip-firing and getting killed. Either you do the same, or you're basically dead.\n\n- The lack of synchronization is too high; you can be killed even if you take cover after being shot a few times. For example, you're being shot at, you react in time and take cover, YOU see that you're in cover, but due to the lack of synchronization with the other players, the person shooting at you sees you as exposed and kills you anyway. It can also happen that YOU see you're shooting at them, but they aren't getting hit. (You might think it's because of the ping, but to date, ping hasn't been a factor in those kinds of deaths).\n\n- The game's killcam is broken. Sometimes it runs at 3 fps, other times it takes forever to load, and other times it doesn't show what happened at all...\n\nIf instead of releasing events they simply said, \"Let's look at the bugs in our game and fix them,\" I'm convinced more people would want to play it. The game is good, but these bugs I've mentioned happen far too often and prevent you from enjoying the game properly. I want to make it clear that these bugs have happened to both me and my friends over the course of two months.\nI will update this review when I see real changes in the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "After putting in so many hours, I’ve been forced to delete the game due to so many cheaters in Forbidden. Hopped on to try to max out Legend Rank and 4 out of 4 matches, I died to a Cheater. Specifically wallers/x-ray. Super easy to pick them out with the killcams which is an amazing feature. Lockdown and Normal are a lot less riddled with them but if you’re looking to rank up, at a certain point you have to play Forbidden but I’m done with it. It was an amazing game, I even spent money but I kinda reached my breaking point. After so many hours in several extraction shooters, this has been the worst run of cheaters I’ve ever encountered. Especially in every match I’ve played, that’s not good at all. I hope the anti-cheat gets a serious upgrade, I love this game. The PVP is amazing, the fact that you don’t have to grind near as much like you do in Tarkov, but their cheater problem isn’t this bad.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Okay, for a free game it's pretty well done and it's actually no pay-to-win. But eventho they claim to hand out bans and sanctions, the amount of actual cheaters, exploiters, griefers and rats is getting worse by the week. Played for quite a while with a good squad of friends, but we're about done with the game for good. One can't run a PvP game where you loose your stuff if you can't keep bored kiddies and lonely rats out of the servers.\r\n\r\nBut yeah, was fun for a whiile.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "good game good gun good pvp until the 9-5 minimum wage discord mod that has 10 underage e girlfriends sits on a hill with his one inch cock in his hand spends 2 mil on red ammo and snipes nakeds all day long letting him make 1 billion",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "had 10 raids, 2 of them killed by a cheater with auto aim head shot, and surely someone will guess their names -_- region lock them\n\njust noticed its the same as the dev lol just uninstall this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ah man, game is a BLAST but the amount of kill cams I've watched and instant headshots in full foliage I've experienced that are blatant cheating. Watching people literally cycle through other players to aim at me and my teammate, in full cover. Approach me without properly knowing my location. Really kills the vibe of the game. These players have over 100 kills and haven't been banned somehow.\n\nPlease make reporting easier as well. I don't know why I can't cycle through enemies I've fought post match and report them when they're spasming between auto-aim targets. Or players my partner interacted with and I didn't have an interaction with.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game is fcking bad and cheaters all the fcking raid. u can't fun with this game. I have a friend who cheated. he told me the program has a option \"ANTI REPORT\"  and he never got BAN!!. bye bye stupid game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "doesnt help new players play this game. People are running end game gear in normal starting maps. You just get farmed and wont be able to play and enjoy the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "average looter shooter extraction. but not as stressful, which is part of the thrill. play tarkov instead",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's free, so that's not too bad. The problem of rock, paper, ammo is frustrating. The lack of MMR forcing those of us who have played close to 30 hours fighting the folks who've played 1,000 gets old. Kinda tired of getting face melted in what should be an \"easy\" mode and map.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just get killed by a rat with 1BN storage... Yep, that's enough for me. Uninstalling and have fun with the other rats!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The amount of hackers when you reach the final level is extraordinary, X-ray vision, aimbots, AOE damage, you can see them when you switch to killcam and they trod like they own the place, I tried reporting, capturing videos and sending E-mails but no response.\r\nSuch a shame, the game had potential.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At current level game is toxic. Meaning that people with great skill and experience can and will play with new players, making game extremely difficult to learn. Even more toxic is a system where limits for entry purchase can be exceeded, resulting in even greater gap between new and old players.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "There is a lot to be said about balancing, ammo tiers, armor tiers etc., but my main issue is the matchmaking. Half the time it puts me as solo vs squads. If I wanted to play solo, I'd play solo mode. If I knew I would be put in the game as solo, I wouldn't even queue up. Absolutely bizarre implementation of matchmacking.\n\nStill sucks even as a full squad, since you can be put in the lobby with solo squads, so you won't be getting any pvp either.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unplayable, loved the game at mobile and pc but playing as a beginner against seasoned players is a no go, cannot prove if the player im fighting wether is a cheater or not because i kept being either one tapped or just die without any reason, i still hate the fact that i have to fight seasoned players throughout my first few games. Worth for time consuming? sure, playable and good for immersions? no.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ESP players every 2 game the servers are from the 1900 this game SHIT...... same as BSG",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Toxic gameplay, griefing. More cheaters than in season 1 , most cheaters get 1 day ban. Sniper guys only with headphones camping whole playthrough with 5 best bullets in chamber. Not recommending.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Full of rats and gear fear cowards, don't waste your time, it's free and not even worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not beginner friendly, tutorial doesn't explain basic game mechanics at all. Starting the game I get 20-30 different healables with little to no explanation. After around 30 hours of playing, trying every map and gamemode, I have extracted probably less than 10 times. Horrible economy balancing. \n\nShort summary, players with 30-50 times my hours get in the same lobby, even starter maps, almost everyone uses (the same) sniper, you get one tapped across the map by some dude holding the same angle for 5-10 minutes. \n\nThe gear you need for one run is so expensive, even if you manage to extract once every five runs, your money will run out.\n\nPeople with literally 200 times your money buy ammo, guns and gear that outclasses you so much that the game is not playable. You can hit the enemy 60 times with any weapon of choosing, it won't do much. They will one tap you with a body shot regardless.\n\nNo skill based matchmaking, unless you play ranked, in which named aspects above are even worse.\n\nCombat wise, horrible design again. Headphones can be bought that makes you hear enemies from miles away, in order to hide your location you will have to crouch walk for at least 3-10 minutes every fight. This is not enjoyable gameplay at all.\n\nInventory space in the menu extremely limited, maximum listings at the market extremely limited, you can't sell too much items per week unless you pay enough money ofcourse. How does this make any sense, it's an iniative that makes people stop playing the game after playing a little to normal amount of hours per week, unless ofcourse you pay enough money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tier 6 in Lockdown? HAHAHAHAHAHHAHAHA, playing solo in Lockdown and you are fighting tier 6 SQUAD nice joke. Don't ever touch this broken game they don't even trying to fix their game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "At this point, the game’s meta feels completely broken. Players are shoving entire high-end weapon builds into their pockets to dodge the equipment value limit, and they’re running the strongest ammo in the game because ammunition isn’t counted toward that cap at all. As a new player with a basic, low-tier kit, you end up facing squads loaded with top-tier gear and premium ammo, creating a lopsided experience from the moment you spawn.\n\nWhat makes it worse is that the whole loop stops feeling like an extraction shooter where you earn your equipment and feel rewarded for surviving. Instead, it turns into a competition of who spent more money on the market—who bought the better kits, the better ammo, the better everything. It’s essentially Warzone but with advanced healing items slapped on, and none of the satisfaction that comes from building your loadout through actual gameplay.\n\nI can look past the skins, the aggressive monetization, and even the awful matchmaking. But when the core gameplay is reduced to getting stomped by players with deeper wallets farming newcomers, there’s nothing enjoyable left. At that point, the game simply isn’t worth playing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a good game.  Graphics are good, animations are good, sound is excellent.   But its pay to win.  They do try to limit it buy keeping gear $$$ in a range.  But if you buy the season pass you get way more $$$.  You might be have $100,000 worth of gear, vest, gun, bullets and you go up against someone with $1,000,000 worth of gear, better armor, better gun, better bullets, who do you think wins?  And there is so many different screens of claim this, claim that, it feels like a maze, a mess.   So its a good game, being free its worth a try, but I wouldn't recommend.  For me feels to pay to win so already getting tired of it, and I am not going to spend money skins for something I dont see myself continuing to play, and to messy for me to be bothered working out what I get if I part with money anyway.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love that they have a weekly ban list yet when you submit concrete evidence of cheaters against you not only am i not compensated like they say they do im actually straight up ignored as is my friends. Not saying the devs are against us but they're clearly not with us like they claim. Get shot 20ft to the right and instantly lose 1m+ koen worth of gear and loot not there problem. Fuck these devs and fuck the little dick bastards who find is needed to cheat in a FREE game. FUCKING PATHETIC FIX YOUR SHIT! arena breakout more like arena fucking ragebait. might as well spemd the money on tarkov where i know i can atleast counter cheat since its so fucking rampant. And if your one of those little dicked cheaters reading this, do the world a favor and alt f4 you fucking dweebs!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Um jogo muito bom, porém se não tiver wipe não ter longevidade pôs tem player com mais de 2bi farmado e entrando full em partida de 100k, no 300k só tem player de termal full t6, isso afasta player novos e casuais, uma boa maneira de equilibrar isso mudando o modo de 300 para 800k... enquanto isso irei me afastar um pouco até resolverem isso.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game full of cheaters and Desync. Loot prioity gives players that do 30% or more and the player who got the kill acess to the body, though you get penalised for taking loot off the body if its not your kill and you get reported which seems redundant and pointless.\r\nHopefully season 4 will bring better tick rate less desync and more balance to the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible game, full of hackers that never actually get banned. Would not reccomend playing this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "shitty maps, shitty player base, good storage, shitty everything else",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played for maybe 30 minutes? Not sure, but it felt like a really crappy knockoff of Tarkov. Just very arcadey feeling by comparison.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck this game nigga, ts shitty ass game have bloody sweats that just ruin the fun its not wort it bro id rather play tarkov than ts shit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Lots lots lots wrong with this game. Wouldnt waste the time. Too many cheater. too many bugs and the devs are just adding skins....also $75 for a skin is wild",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT INSTALL THIS GAME!! IT CONTAINS MALWARE\n\nI just noticed that a virus name tbs_browser was installed along side installing this game. DO NOT INSTALL unless you want a virus",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TL;DR - game is plagued by cheaters using ESP (injected into Steam's Overlay) and the game's in-game Koen economy is out of balance. Top 5% of players own most of the currency. Red ammo is overpowered and will shred your armor as if it's not even there. One fight with the enemy ruins your gear and lowers your chances of surviving another encounter.\n\nFirst and foremost - The game's concept is good, it rivals Tarkov, although I haven't played it myself, I have watched plenty of streams and streamers of Tarkov.\nPerformance? It's good. You can expect higher frames even on mid-to-low computers.\nWhat's the good? Well, hard to think of any to be honest, but the good is when you get to eliminate another player and you get their loot.\nWhat's the bad? A lot. Economy in the game is broken. People who don't have a job and play this game day in, day out, learn all the spawn points on the map and rush players. OR if they don't do that, they know safe locations, they have collected or bought keys from the Market and get all the safes, with red items, which cost and sell for a lot of money.\nMost of the game's economy is in the hands on the top 5% of the players. Others struggle to make ends meet, have to rely on quick kits to make some Koen from raids and hope items sell on the market, while the cavedwellers enjoy their red items, along with most of the gold items. Simply because they have more time than the average player does.\nI want to like the game, I do. It's not pay to win, not at all.\nThe game is still plagued by cheaters, who use ESP (X-Ray vision), even through solid objects and auto-aim. It doesn't stop there. The servers for the game have awful tick rate, which means the replay system is busted, and your perception does not equal the same perception of the enemy. Servers also suffer from stuttering and latency issues, even though the in-game ping says it's low, do not trust it. There will be some packet loss and latency jumping up and down as if it was on a trampoline. The developers are trying to crack down on cheaters as much as they can, but the sheer volume of cheaters outweighs the effectiveness and capacity of the development team.\nIf you value your sanity, mental health and your time, play something else.\n\nEDIT: After playing another 100 hours of this.... somewhat garbage, it is more than clear - economy is tanked, tier 5 and 6 gear is expensive, but doesn't save you. I had 20 mil in Storage, I lost 10 mil just buying tier 5 and 6 gear, playing in Forbidden. Only to lose the gear to some rat in a corner, or even worse... the really sweaty people, who have memorized the safes, optimized the routes of movement. These are the people who have not seen daylight, and don't have a job. As someone who is competent in shooters, with CS:GO, CS2, Valorant, Battlefield and Call of Duty, PLUS Medal of Honor background, I can confidently say, it doesn't matter what you use or do, the people who play this game like a full-time job, will always win. They will get all the red items from safes, they will take your gear, they will somehow win 1v1 fights with you even if you have the advantage. Not a skill issue, people exploit the Ergonomic weapons, and high rate of fire weapons, such as the P90, HK416. Then there's the red ammo snipers, who camp and tap you in the head across the map.\n\n[b] No, I still DO NOT recommend this game to play for fun, or with friends. [/b]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nice game with tons of customization and gun pr0n, as far as i understand it's basically Escape from Tarkov with QoL features added.\r\n\r\nHOWEVER\r\n\r\nGame works fine the 1st day, 2nd day has micro-stutters, 3rd day has 10+s freezes. You must delete the nvidia cache to reset this cycle.\r\nBest anti cheat today, can't get matched with cheaters if the game is unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its was a fun game until you are piled up with cheaters!! \r\n\r\nThe game company needs to find a fix for ppl not to cheat this much.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "infested with cheaters lol cant get a single match anymore without being esp'd and aimbotted not worth any time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a brilliant extraction shooter with amazing Gunplay and map design, But there are TOO MANY ESP/Soft hackers that have a \"superior gaming chair and headset\" that knows exactly where you are. The best cheaters will pretend they check another angle and so - their presence in the game is left to chance or for them to make a mistake.\n\n\nAnyhow, I wont play a game where there is no certainty in the field of fair play. \n\nThanks, Bye",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fantastic game WHEN I STARTED IT. Playing normal mode, playing farm, then eventualy valley, doing missions, just a good, fun, enjoyable time, looting, shooting, selling, accruing stuff, a good time, mostly. Then unfortunately the game forces you into Lockdown mode, why? Because theres only 2 maps in normal mode... like, why?! And then youre at the mercy of insane sweaty tryhard esport pros, carrying golden ammo, knowing where you are despite terrible sound design in the game, and killing you instantly, i the faces, or few shots to the body, even when youre forced to spend 1 million each time you die on tier 5 stuff JUST to have SOME chance of living, quickly and rapidly bankrupting you, the game gets worse this way, \n\nits story is a jumbled mess of nonsense, its obviously south korea vs north korea but they are using these stupid fake names to avoid hurting fee fees. And someone brought up a good point, whats the point of lockdown if forbidden is basicaly the same? Same armor but +1 tier up, same ammo, same guns, its just... why? You dont let tier 6 armor into lockdown, so realizing this, whats the point of it? Stupid fucking golden ammo ruined this game, just like it ruined world of tanks and other games with pay to win ammo, completely ruins the game, oh you think youre tough shit, think youre gonna have good firefights? No, youre gonna get dropped instantly because of bad faceplates and pointless armor, armor is so POINTLESS because of these stupid ammos. Gun customization is so terribly limited too, why doesnt the deagle have muzzle attachments? They exist. Why is the ump so limited? We know it has so much more to it. \n\nYour missions are also horrible, bring out 10 purple tools/military items, from THIS specific region and not just in general!? Wtf?! Mission impossible, its so frustratingly, gruelingly, sufferingly slow...... the devs realy want you bankrupt you and get you to playing Imposters on TWO maps only, quickly and baddly... the game is insanely demanding too, even though, ITS A MOBILE GAME... and also just to note, i discovered this game, MANY years ago, when people were making foreign accounts or whatever, to play this game as it was exclusively only in korea many, many years ago, i was so hyped and excited to try it, waiting eagerly for it to come to the rest of the world. And once it did, the dissapointment was gigantic... you showered me with emails, gifts and filled up my inventory instantly... what the fuck was i supposed to do? I didnt have any actual room to loot, to store anything, you wanted to force me to sell off all that free gear, or buy inventory space? So i quit the game forever, barely playing it. And then i waited for it to come to pc, steam, and here it is. Lovely time in the first few weeks playing, the enjoyment lowering overtime. \n\nAnd now, unfortunately, i have to quit the game. I dont know if my pc got worse, or your game got worse, or both, but i am unable to play the game now, your game has become too demanding, too unoptimized, with memory leaks or whatever, your ram demands are ENORMOUS... i had NO issues playing the game in the first many weeks, but now, as im writting this, for a few days now, the game is crashing NON STOP, i had to lower graphics some time before, but now even that doesnt help anymore... im forced to not keep open any browsers like mozzila and edge like i ussualy do, but that barely helped at all... the maps beyond normal mode are so demanding... im being told i dont have enough ram, if i try to spectate teammates, thats a crash. Why is a mobile game destroying my pc like this?! Its become unplayable.... i have to quit, i cant play like this...\n\nOh, and one more thing, i hope you can understand my anguish, when i pain stainkingly and meticolously, collected all the crafting parts to upgrade the trophy rooms, ONLY to be greeted with mandatory requirements to meet before i can upgrade them, like HUNDREDS of weapon kills, PER WEAPON, NOT WEAPON TYPE..... and collect random garbage like cups.......... thus all the garbage staying in my inventory, not allowed to be used to upgrade room.... at the very least you could of let me consume them and then id just have to get the requirements, instead of taking my damn limited inventory space...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Another bullshit Tarkov clone... Feels great to go in a match with like 2 mil worth of armor and face mask bullshit only to get one hit by some dude. What was the point in the fucking face mask if it does literally nothing? Why have 15 different tiers of gear to mix and match low tier players with higher tier gear players as if that makes any fucking sense at all? Copy pasta. They can release on Steam and it certainly runs better than Tarkov but has the same completely unbalanced gameplay. Fuck you all for perpetuating this type of bullshit. You guys advertise lots of bans and while you may ban lots of accounts I doubt very seriously you're banning lots of players.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really love this game but this matchmaking bullshit is fucking horrendous can i get some teammates i shouldn't have to solo vs quads against a entire fucking lobby.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game says free to play… nah. You think you’re just dropping in with your boys? Lies. You’re dropping into a digital sweat shop were the only work getting done is on you. I have stayed away from this addiction for a year, I ran 6 clans with 12 different people, three full squads making stacks, did some shit Geneva would never forgive us for. Made about a billion between all of us, it was that movie ending shit, treasure room stacked, customizing weapons for the fun of it, losing multi thousands to millions each failure, it hit gambling highs, when you're streaking this will ride you across cloud 9. Life was good, took a year break and heard from my second in command this was on steam now so for old times sake I gave it an install. The closest of the crew grouped up and did our thing. It was fun again, before level 30....\n\n    Are you getting job applications rejected? This could be your next 9-5, daily quest, the amount of events you would expect from a Chinese game. Market manipulation, cheaters, scammers, rats, pathological maniacs, liars, emotionally disturbed team mates, if its mentally unwell probably lives in Kamona T bagging an impoverished kid. The worse toxic traits of both enemy and ally will be regularly experienced here. You will want to kill yourself and the clever girl who suggested it in the first place. After I got to that point we started to lose, like bad 85% extract down to 50%, snipers, campers, penetration ranges, bro I que my first solo just to get sniped from Hotel 600 meters away with 1.8 million. Trapped inside a house with two guys clearing my house with grenades, spent an easy 200k on grenades alone just to blow out my ear drums. I began to wonder if gear was even important so I did thirty back to back secured raids at T.V. and armory and died all but 5 times, level 6 armor will never work for you unless you drop mad cash in the game. The winning play is don't que with armor, drop bag before conflicts, take pain killers before any contact, I'll provide the standard clan rig that cost 15k so if you die a lot, you can manage the losses. Until you grind rank then you will race to the bottom losing any care free enjoyment you might have had. You are never good enough, which is true of any game but in this you can feel the difference. I stated losing members, those kick backs were becoming arguments, whose fault or general complaints about the game. You wonder was it me? The game? My connection? I'm borderline schitzo cause of it. You start questioning everything and it isn't funny anymore, I started smoking again cause of how miserable it became. Winning was just regaining the losses and everything was a chore, inventory management, optimal gun builds, kits, ammo, medical, keys, prices for individual crap, boss locations, optimal travel paths, drop points, your encroaching testicular cancer. To add insult to injury the one guy who played the least but spent the most found reds every drop. A secret document only a week into laying like bro this game is scamming people.\n\n\n\n      I sat reflecting was this really what I wanted to be doing with my free time? If I ask that over a game I got the answer from asking in the first place, I took my wealth and burned it role playing a Leprechaun joining matches with stacks of money and bullets for people to earn if they were lucky enough to get it. Those last few hours were the only real joy I got out of this, the funny part is I loved this game. Bet you couldn't tell from reading this, I put days of my life on this that by the end this the only thing I feel after that kind of thousand hour commitment. Then it wasn't happiness, obligation. I downloaded this on Steam just to let it be known, out of the thousand I put it only took 13 to lose it all. Welp\n\n\n(Below is the basic infantry kit)\n\nLoadout:\n\nInfantry rig - Medium Bag\n\n1 anti Inflamation \n\n2x Med kit\n\n2x Surgical kits\n\n2x quick apply bandages\n\n2x mags with a stack of ammo",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "you can enjoy yourself for the first 25-50 hours and get used to the game. then you realize there's no anti-cheat and little Timmy decided to inject files into a video game. what's the point of this B.S anymore if all you clowns are gonna do is hack on people? killing games before they even have a chance. but let me guess, they'll just blame the servers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is really fun, but then hit registration comes in to play. the hit reg in this game is really bad. sometimes you will watch the clip and see all your hits, but the game does not reg it. hope they fix it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoy Arena Breakout: Infinite — the gameplay, graphics, and atmosphere are amazing.\nHowever, I recently received a 3-day ban just for playing with a friend who turned out to be cheating. I had no idea he was using cheats, and I only played a few matches with him before getting banned.\n\nIt feels unfair to punish honest players for something completely outside their control. How can a normal player know if someone else is cheating, especially when the game gives no clear signs? Detecting cheaters should be the game’s responsibility, not the player.\n\nI hope the developers review this system, because bans like this make fair players lose trust. I still love the game and want to keep supporting it — but I also hope they handle these situations more carefully in the future.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Most of the times when i play the game always lost connection and i always relog to be normal again,my internet connection is good and i play other games like cs2,pubg without problem. Fix the damn server!! Cmon bruhh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Matchmaking system is trash. In my 2nd day playing I was level 6 and constantly started to queue against level 30 teams of 2 or 3 players with a lot more experience than me. Also, the kill cam is basic, most of the times you don't know if they heard you or if they spotted you before, it only shows how they killed you. Out of like 20 solo-raids I queued up to, like 7 times I got killed by a team, that's not only unfair but stupid if you think about it, why are there solo players against duos or trios in the same lobby? (aside from the difference in skill level)\n\nGear has pretty low impact in the game to not say it is decorative only, and I had 100ms ping in most cases. You cannot choose in which server you want to play so you'll have a random ping every match.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's currently 3 in the morning and I failed to extract 20 times in a row cuz of the fucking players that act like this game is tied to their life support. ye, the game itself is good, the graphics and optimization are neat and there are a lot of weapons to choose from. but after reaching hero rank this game ain't worth it, you get 40+ stars legendary players in your lobby throwing grenades like they are in the olympics, meta weapons are expensive and if you get lucky getting your hands on one of them good luck affording proper ammo for it because no way I am using t3 ammo on a TO3 and I am NOT paying almost a mil just so I could have a decent amount. Yeah, I heard people complaining about bot players, i barely encounter them (2 once 6 matches) besides that the game just feels like gambling with your gear every match. you either make jackshit profit or die because a dude threw a grenade from his spawn to yours (fix farm spawns) \nIn the end I wrote this review out of hatred for sweaty players and unbalanced prices. A game that was supposed to be more relaxed turned into Tarkov's biggest problem. this \"review\" will probably make no sense but i will check it againg when sleep deprivation wears off \ni should go to sleep..........",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "games ruined it's basically COD at this point, just turn up your DPI and run an SMG you'll win any fight that isn't a sniper zzzzzzzzzz",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "just got banned for apparently attempting to play with cheaters. friend also got a 10 year ban for no reason and they wont give him a difinitive reason as to why they banned him. this game is a joke and a waste of time. they ban innocents and leave the actual hackers alone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There is no real players in this game, 9/10 operators all mysteriously moved the same and had identical loadouts (same rig/body armor, same gun). Its a looting game with no action. If the game was alive it would be fun.\n\nEDIT: Played some more and confirmed it, game is pointless to play unless you get to lvl 30 because its dead in normal/lockdown zone (all the players are in the forbidden zone which is lvl locked at 30) so most \"operators\" are actually just bots. For every 15-20 \"operators\" you'll actually fight 1 or 2 REAL operators. The rest of the time you'll spend just running around finding valuable items that you'll immediately turn around and sell so you can continue your brain off loot goblin grind against bots. Dead game.\n\n2ND EDIT: Its not stated anywhere in the game but it seems after around lvl 20 or so you finally start to get real players. Not nearly as much as you would like considering the only selling point of this game IS the pvp. But im afraid to say that this games pvp does not hit the mark. Like a more arcadey tarkov but without any of the grit or stress that tarkov had. Its like the call of duty of extraction shooters, losers that wanna camp and stare down a scope doing nothing else included. But yeah a good several days to come to the realization that its a bad game because the devs would rather coddle you in dead bot lobbies than actually send you out to the \"real game\" and the sad part is the bots actually played in a more engaging way compared to the average player, actually make the AI more threatening and give them some real loot doesn't sound like a bad idea.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its like in every Game High level players are afraid of their Kind and farmin low level players and beginners to get a Boner",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Update: After getting banned again for 3 days for playing with \"a cheater\" - instead of banning the cheater they punish me? The whole game is based on inviting unknown players into your team !!! - today I got a cryptic message, that i obtained 880 000 Koen \"abnormally\" and have to pay them back!!!!!\nWhat does that even mean? Get you s2134t togeather, Tencent. \nyour game is full of ppl who use wallhacks and more and you punish the players who get shot by them or which get teamed up with them - by you? You take my money for reasons you call \"abnormal\" without elaborating? \nAre you fn kidding me? I paid real money for a premium pass and you treat an honest player like that. Keep it up and I will deleate the game \n\n\nThis is the 2nd time I get banned for no reason. The first time was actually when I got shot in the head by a cheater (imposter with sniper and gold ammo). Now I did nothing wrong than die, I get banned again for 3 days. All the while ppl who shoot me through walls have no problems and I don't even get recognized for flagging them!!! You can only access a page where u can see for what u are punished, if it doesn't make any sense at all there is no way appealing to it.\nNot recommended until your communication issues are fixes, I pay real money for a season pass and you ban me without an option for appealing ... your out",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No different that any other of the extraction shooters out today. They force everyone into pvp maps to save on costs of developing a game with more content. If there was a choice to pve only because of the cheaters being so rampant Id play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very good in the beginning, but it's filled with hackers/cheaters now. Makes the game absolutely unplayable, spawn in, you're up against wallhacks they prefire you with no recoil around the corners in the head all the time. die within first 5 minutes. so sad, because it was good in the beginning, but now 8 out of 10 games, i die to hackers. some make it obvious some not, but clearly spotable on killcam. PLS FIX",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "700 discord orbs lol. (This game has a kernel-level anti-cheat [one that doesn't even really work considering every other review I'm seeing] which I just don't tend to trust in general, didn't even really bother playing it)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I checked this game out after the colossal let-down that was Escape From Tarkov. At first glance it looks like a decent package, especially for something that doesn’t cost a dime. Then you actually play it. The mechanics are bare-bones, the combat has no weight, hit impacts might as well be imaginary, and the AI feels like it was stitched together in a hurry. You lose nothing by giving it a spin because it’s free… but once you’re in, you immediately understand why it’s free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really enjoy this game. But this exploit still hasn't been fixed DESPITE the Mechanic placed for the Specific Gamemode of \"Secure Ops.\"\n - The exploit being; Value Koen Limits. Let's say you're tired of losing gunfights cause you just suck or something. Want to bring a Meta Gun with no recoil? Simply stick it in your backpack before playing a Raid. Doesn't matter on what difficulty. The game will allow you to. Another would be to throw in your expensive desired attachment in your backpack and when you're in the raid just simply slap it on. This exploit has been around for a good amount of time even before the Steam Release. This is one of the reasons why despite people on steam say this game is good, player counts are dropping because of the useless Gear Limit/ Koen Limit. \n\nI will keep playing this game because I still find it fun sometimes. But until then I urge you people to at least be aware of this exploit so you don't wonder \"How did a guy stick a whole LMG with OP ammo in a Normal raid? And how did they bring a OP Helmet in Lockdown?\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "feels like youre in vietnam, terrible loot, campers, kids with more money than jeff bezos, dont install bad game. You think youll get somet hing good but you wont:)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "To much cheaters, red ammo and people having to much money... People with t3-t4 gear, sniper and thermal scope!\nas of right now i wouldn't recommend this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "CONS:\n- Inventory management is too slow. If you have capped your storage you might end up just opening your game to organize that instead of jumping to shooting\n- Trading is too slow\n- Way too many options to modify several guns, again a process too slow\n- Way too high lvl players are able to play with low lvl players. Making them instantly die. Put a restriction so they can only join certain games or you will lose new players.\n\nPROS:\n- It is fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I enjoyed the game and have invested some time to get the full experience. One thing that would keep me from playing this game is the lack of support from the \"support team\".  I have witnessed a few cheaters during my time playing, and perhaps they try to address this to the point where they penalize non cheaters by removing them from the game due to \"Abnormal game environments\".  When reaching out to support, the replies are canned and unhelpful.  In a game riddled with cheaters, you would think they would try to correct an error made on their part as they ineptly try to weed them out. It appears that unless you stream for them, they really don't care about your experience.  Very disappointing to say the least. Fun for a while, but the bad outweighs the good on this one.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played the game for 5 hours didnt see a single real player and shit on all the npcs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games allows all sorts of free cheats. rust, osrs, and COD allows less cheats. Devs dont remotley comp for the amount of cheaters. dog ass game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}