{
  "positive": [
    {
      "review": "Never been a fan of fps but this game is extremely fun. I really like the customizations it has for your characters there are quite a bit. Can destroy walls and floors to get to the enemy quicker.",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "Finals is the ultimate insurance fraud simulator. \nYou blow up $50 million worth of property, grab the $10,000 cash box, and call it a win. a brilliant FPS that makes you question why every other game bothers leaving buildings standing.\n\nGameplay is really smooth, it has perfect balance of movement and gunplay, It has alot of playstyles that other Fps games lack,\nmatchmaking for ranked or world tour could have been better...\n\nBest part- They Give Free Multibucks for purchasing Skins or Battle paas. Unlike other f2p games",
      "voted_up": true,
      "votes_helpful": 16
    },
    {
      "review": "Playing this game is only enjoyable with friends, as you might be paired with competent players or utterly incompetent ones, whether you're on console or PC.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "I can't believe how many people claim this to be one of the best shooters to ever release.....\r\n\r\nAND THEN DON'T PLAY IT. \r\n\r\nThis is one of the best shooters I have ever played, it is so much fun and such a unique experience.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "THE FINALS stands out with its crazy destruction, fast movement, and creative class abilities. Every match feels dynamic and unpredictable, which keeps the game exciting. Some balance problems and uneven matchmaking stop it from being perfect, but overall it’s a fun and stylish shooter that’s easy to enjoy.\n\nGood game with a lot of flair.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Unique gameplay, the best skins, awesome soundtracks, satisfying shooting. The best game among F2P FPS.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "This game is goated. Way to go Embark !! A better matchmaking will be a good addition to the game cuz you get matched with all sorts of sweats, smurfs or even beginners which makes the team unbalanced in certain matches. Also few improvements with servers will be good. Otherwise, its a banger of a game. I have crazy fun playing this game and this game is getting the attention it deserves. \r\n\r\nSee you in the finals !! :)",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "THIS IS LITERALLY A NEXT GENERATION SHOOTER 🔥\n\nA truly unique, high quality game. You can't really compare it to anything else - it stands on its own, you just have to try it yourself. \n\nThe developers are unconventional thinkers with a genuinely cultured taste for aesthetics, and they make smart, intentional choices in how they design the game systems. \n\nIf you are into high adrenaline competitive shooters - trust me, this is the one to make your main. \nThe Finals is evolving fast and reaching new heights every month. I have full confidence that the future's bright for this game 😎",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i yearn to have friends to play the finals with bc playing solo in this game is frustrating but with friends it makes me feel like a kid again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "10/10 – this game destroys buildings faster than I destroy my life plans\n\nI installed THE FINALS thinking it was just another FPS…\nI was wrong. As wrong as my ex saying “we’ll make it work.”\n\nThis game has no rules, only:\nswinging around like Spider-Man on steroids\nbuildings turning into dust faster than my gym motivation\ngrenades exploding so loud my dog has permanent PTSD\nthat “I got this under control” moment that lasts 0.2 seconds\n\nThe game taught me one thing:\nDon’t get attached to anything.\nNot the buildings. Not the walls. Not even your own life.\n\nBiggest downside?\nI can’t blow up my workplace when it’s Monday.\n\nBiggest upside?\nWhen I say “let’s destroy their base,” the game goes okay and lets me erase the entire map from existence.\n\nServers? More stable than my Wi-Fi.\nGunplay? Better than my social life.\nBalance? No idea, I have ADHD and everything is exploding, so it’s perfect.\n\nIf you like:\nchaos,\nadrenaline,\nand destruction bigger than after Christmas dinner at grandma’s\n…buy it. No questions asked.\n\nSummary:\n10/10 game, I’m off to demolish another skyscraper just because I can.\n\nEmbark Studios cooks better than Gordon Ramsay...",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Team Fortress 2 meets Counter-Strike in an epic brawling over the top hype game-show.\n\nLike playing scout in TF2? Great! You can be pretty much that in The Finals as well. Medic? Heavy? Demo? Pyro? Engineer? Any playstyle you like, you can be that here as well. Added to that is the competitiveness and a bit of realism from CS.\n\nThis game is really something man, the second I saw the new season trailer I was hooked and it didn't disappoint. The shoutcasters reacting to events in the game and people exploding into coins is just the type of thing that makes me tingle. It can be played really competitively but as someone who's relatively bad at fps games, this is still very much enjoyable.\n\nOn top of that, a lot of cosmetics and passes can be purchased with currency obtainable in game as well (just takes a while to grind it if you don't wish to spend your precious dollars). Personally, even after getting various cosmetics from event, I still seem to like the items I obtained quite early on, so I don't even worry about getting enough to buy new stuff.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Easily one of the freshest, most captivating, fun and intriguing shooters to exist period.\n\nGameplay revolves around hero shooter mechanics of 3 core classes, but allow the user to completely combine and build their own expierence. With each class having core identities that are still met across all 3 classes in their own ways. All 3 classes can heal, but medium is best at it. Medium has better team utility, great lock down, and average kill potential. Heavy has good kill potential in narrow situations, amazing area denial/lock down.. while light has high kill potential in most situations, and decent utility but poor ability to lock down locations.\n\nThe inclusion of mechanics of nearly full terrain destruction, different hazardous canisters, good to create terrain, many unique weapons... assures every single match will never play the same.\n\nThe events happening around in the game as well cause every round even with the same map and enemies shakes things up as well!\n\nOne of my favorite mechanics is the sort of rock paper scissors effect revolving around fire. Fire can burn goo and I believe gas, smoke puts our all fires.. it all feels very interesting and yet simultaneously very intuitive! I wish more was added to this like electricity being able to potentially spark gas into fire? And fire burning out gas?\n\nThe idea round this game not being perfectly balanced focused around building different compositions is SO fun! \nHeavy getting access to the flame thrower and medium getting a flame shotgun add to this trifecta well!\n\nPlay a heavy who can hold and defend areas well well the goo gun, bubble shield, and deplorable walls, as well or the shield ability!\nOr taking a sledge hammer, and tearing out the entire area for clearance and taking wenchclaw to force enemies to group or kite that tank... it's all so much to take in!\n\nCosmetics in this game are absolutely LOVELY!\n\nMy only fret with this game is how overbearing some weapons can be in narrow matchups like how flame thrower is essentially a permanent full counter to all melee weapons.\n\nHaving a heavy with thrower forces any melee based player essentially have to switch off. I think it's power needs to be toned down or lights sword needs to be able to charge it's dash a tad faster or deal just a teensy bit more damage.\n\nInvisibility is a very hit or miss mechanics where if you can track them it's very easy to take them out.. but if you miss the few frames they are visible it's an instant death sentence. And maybe needs to be more effective at longer ranges but far less effective at close range.\n\nBut I'm no balance pro.\n\nThe game's maps, free cosmetics, and constantly fresh gameplay without needing to critically shake up the entire season like some games makes this easily one of the best shooters to ever exist.. put together as an obvious labor of love.\n\nAll wrapped into a unique game mode that blends a lot of the fun of modes like CS:GO's high steaks plants, king of the hills need for defending areas while roaming, and battle royales play styles of fighting many small teams while constantly roaming.. they have other modes you may love or are familiar with.. but this default mode is so much fun to me! It's hard to be bored of something that is though the same premise constantly changes how you engage with the situation and enemies builds/setups!\n\nFor all these reasons AND MORE, my heart will forever belong to the finals. 💜",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Season 9 is upon us and I love the game as much as I did in beta. It's the most refreshing FPS released in years. Mechanically deep, with an outstanding artstyle and a well optimized UE5 title. Lightning in a bottle, given the lack of innovation that looms over the FPS space.\n\nI hope that people will keep playing this, because there's nothing else like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the most fresh online shooters we have seen in a long time. everything feels wonderful, amazing gunplay, sound design, customization, and maps. Best part, it is also FREE. Player count has been low as of lately (11/20/2025) but it is still very easy to find matches. Be warned the skill ceiling is pretty high so it will take some time getting into a groove. If you are interested in content creators for general advice, Ronin! is amazing and so is Appoh. Highly suggest you guys give the game a try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "funy game i shot the guy and then he dead owuld recosntruct 10(/010",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "my friends were literally holding me at gunpoint, forcing me to try out this game. \r\nit's fun....... i think.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun, updated often, supported, honestly what COD could be if the devs actually cared about their game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love it! One of the best shooters out there for sure! Gameplay is peak and its the UE5 game that runs on almost anything. The balancing needs some work but thats how it goes for all shooters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's easy to be suspicious about the quality of a free shooter, but this is pretty damn solid. TTK is pretty good, all the weapons feel pretty good and are pretty balanced except for some outliers like the cerberus. I don't have a deep dive into what makes this game good, it's simply energetic, fun to play and I keep coming back. Instead of a long list of what makes it work I will leave you with one notes and get back to playing THE FINALS.\n\nYou can always run meta picks and complain on Reddit but some of the most fun is had in getting two friends and taking meme loadouts into World Tour, all minigun got us our first WT win and all sledge got us way closer than it had any right.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You will see the comments on why people dislike the game, and some are valid, but it is refreshing to have such a different  FPS that isn't another Battlefield or Call of Duty. Play alone, or better yet, play with friends. Learn the tools of the trade, and you too can become a master of both the cashout and the platform. I 100% recommend this game to anybody, but don't take my word or anyone else's... ITS FREE!! Download it now and experience it for yourself.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played it back when it launched, but something threw me off and i quit. One of my greatest mistakes. The Finals is a game with a great gameplay loop that keeps you engaged, varied maps and, most importantly, tons of destruction! With the right tools, you can make sure no building in the arena will remain unscathed. Above all else, the highest praise should go to the game's optimization. In current day and age, the name Unreal Engine 5 is synonymous with lack of polish on the technical side, and yet Embark achieved the impossible. They've created a UE5 game where almost any element of the environment can be destroyed while maintaining stable frames with no stutters. Truly remarkable, I can't recommend it enough.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Finals is unique and best arcade shooter at this moment. Good graphics and optimization, enjoyable shooting and incredible destruction. Its really sad that truly good games are left without attention they deserve.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My go to Shooter to play. It's so unique and fun. Devs have been supporting and doing a great job. Every new season brings some exciting things to the game. Here is to another year of The Finals!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "THE FINALS is a breath of fresh air: bold, chaotic, and fun in a way many modern shooters aren’t. Its mix of destruction, mobility, teamwork, and unpredictability makes every match memorable. If you enjoy competitive shooters that reward creativity and quick thinking, this one’s a must-play.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Finals is a great game. In a time of aggressive monetisation in the F2P genre, The Finals stands alone with a system that provides a very good user experience. The destruction in this game is amazing and makes every round feel like you are in an action movie. The movement is superb, with a large range of gadgets spanning from dashes and grappling hooks to jump pads and ziplines. The guns feel great too, but I personally prefer the melee weapons.\n\nSome might argue that the matchmaking is currently a bit unfair, but I feel that this has not affected my time with the game much, and Embark is working on this issue for the next season. Embark Studios is great at recognising player feedback and enhancing the gaming experience. I would highly recommend playing The Finals if you haven't already. This is the shooter of the future. \n\n9.5/10\n\nSee you in The Finals contestant!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice game reminds me of Ghost Recon & Battlefield \r\n8/10 recommended",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don’t even know where to begin. This game is amazing. Everything it does, it does extremely well. I truly believe it’s underrated, and even if it isn’t, it still deserves a much larger player base.\n\nThis is the best multiplayer FPS experience I’ve ever had. It has one of the most innovative gameplay systems you can find, while also being incredibly satisfying. There’s a huge variety of weapons, and each one delivers its own unique and distinctive feedback. On top of that, all of them are fun and useful if you take the time to master them. Combined with the classes and gadgets you can equip, the game offers an enormous variety of builds and team combinations.\n\nIt’s simply the GOAT of multiplayer FPS games!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has a different approach compared to any other trendy game. It offers you the freedom to express your own personality (Character customization, loadouts, playstyle). Once you tap the potential of the game, you will not find it in any other.\n\nThe Finals is continuously growing and it does so with its community. They listen to feedback, admit and correct their mistakes and pushing their game into a better place. This is one of the games where the developers are passionate about playing their own game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Unique gameplay, the best skins, awesome soundtracks, satisfying shooting. The best game among F2P FPS.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "team extraction shooter with fast paced gameplay and destructible elements.\r\nso much costumization on your build and character appearance.\r\n9/10tacles",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I may have a major skill issue while playing the game, but it does not hinder me from continuing to play the game. For me at least, this is a more special FPS game with interesting and special mechanics. While the system requirements are a bit more demanding, I would still suggest people to try it out, as they also keep adding more game modes. Also, people who like to spend money will find a good amount of cool skins to buy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you’ve played Apex or any other movement-focused shooter, this one clicks fast. Recoil isn’t really about dragging your mouse — it’s more about timing your strafes and counter-movement. Add mobility tools like jump pads and fights get chaotic in a fun way. The game is insanely fast and there’s basically zero safe cover anywhere, so you’re always exposed. It’s not perfect, but at least you’re not constantly dying to random timing like in some tactical shooters.\n\nProgression is solid. The battle pass can be finished with normal play in about a month. You can even unlock older passes, which is cool, but it also makes everything feel a bit less exclusive. Free skins drop often enough that you don’t feel forced to spend money. Just keep in mind the old passes take way longer — around 500 games to finish compared to ~150 games for the current season.\n\nMatchmaking is where things get rough. The playerbase isn’t huge, so the system starts mixing players of completely different skill levels pretty fast. Even with only 20–30 hours of playtime, you can suddenly get thrown into lobbies full of people playing like top-rank shooters. Learning the game while getting rolled by those players is… an experience.\n\nThe real headache is balance. The devs react to community feedback a little too fast. Patches don’t just adjust weapons — they reshape them. If you like mastering one gun type, it’s painful seeing it turn into something totally different every couple months.\n\nOverall: super fun movement, tense fights, progression is fair, but matchmaking difficulty and constant balance swings can get annoying. Still, absolutely worth trying — especially if you’re in SEA. I need more English-speaking teammates out here. Solo-queueing with nothing but CN players who can't speak English is harder than a 5-hour gym session without water.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Scotty: \"Hellooo Contestants Scotty here, giving feedback on this game! Along with, you guessed it, June!\"\nJune: \"Thanks right Scotty, we've been asked to say what we think and that is quite simple, the game is amazing!\"\nScotty: \"Quick, crazy, chaotic fun fuelled by our sponsors and driven by our contestants!\"\nJune: \"No matter who you choose, Light, Medium or Heavy. Whether you are always on beat in The Highnotes, the incredible fashionista as part of The Vogues, driving through your competition in The Steamrollers or any of the other teams. There are always unique challenges waiting in each match.\"\nScotty: \"You said it June, never a dull moment here in the arena. So what are you waiting for? Come and test your might. In THE FINALS\"",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game. It is criminally underrated and deserves so much more love.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Got into the game 2 years late, but I can safely say the praise was well deserved.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "~ DIFFICULTY ~\r\n🔲 My 90 year old grandma could play it\r\n🔲 Easy\r\n🔲 Normal\r\n✅ Hard\r\n🔲 Dark Souls\r\n\r\n~ GRAPHICS ~\r\n🔲 MS Paint\r\n🔲 Bad\r\n🔲 Meh\r\n🔲 Graphics dont matter in this game\r\n🔲 Good\r\n✅ Beautiful\r\n\r\n~ MUSIC ~\r\n🔲 Bad\r\n🔲 Not special\r\n🔲 Good\r\n✅ Eargasm\r\n\r\n~ STORY ~\r\n✅ This game has no story\r\n🔲 Like playing Temple Runners for the story\r\n🔲 It's there for the people who want it\r\n🔲 Well written\r\n🔲 Epic story\r\n\r\n~ PRICE ~\r\n✅ Free\r\n🔲 Underpriced\r\n🔲 Perfect Price\r\n🔲 Could be cheaper\r\n🔲 Overpriced\r\n🔲 Complete waste of money\r\n\r\n~ REQUIREMENTS ~\r\n🔲 You can run it on a microwave\r\n✅ Average\r\n🔲 High end\r\n🔲 NASA computer\r\n\r\n~ LENGTH ~\r\n🔲 Very Short (0 - 3 hours)\r\n🔲 Short (3 - 15 hours)\r\n🔲 Average (15-50 hours)\r\n🔲 Long (50-90 hours)\r\n🔲 Extremely long (90-110 hours)\r\n✅ No ending\r\n\r\n~ FUN ~\r\n🔲 I'd rather watch paint dry\r\n🔲 Hard to enjoy\r\n✅ Repetitive\r\n🔲 Actually pretty amusing\r\n🔲 Ride of your life\r\n\r\n~ REPLAYABILITY~\r\n🔲 It's a one-time experience\r\n🔲 Only for achievements\r\n🔲 If you wait a few months/years\r\n✅ Definitely\r\n🔲 Infinitely replayable\r\n\r\n~ WORTH BUYING ~\r\n🔲 No\r\n🔲 Wait for sale\r\n✅ Yes\r\n\r\n----------------\r\n\r\nTHE FINALS delivers an energetic and fast-paced competitive experience that immediately sets out its intent to provide high-octane action. The game wastes no time in establishing an atmosphere built on spectacle, teamwork, and environmental chaos. From the very first moments, it becomes clear that its focus lies in delivering thrilling matches rather than building deep narrative foundations. Despite this, the overall tone remains captivating thanks to its dynamic presentation.\r\nGameplay stands as the strongest pillar, offering quick movement, varied loadouts, and class-based abilities that encourage strategic teamwork. The destructible environments play a crucial role, allowing teams to shape the battlefield in meaningful ways. Matches unfold with a blend of tactical coordination and chaotic improvisation, making each encounter feel unique. The pacing remains brisk, ensuring rounds never overstay their welcome.\r\nVisually, THE FINALS excels with its glossy, broadcast-style presentation and colourful arenas. The environments are richly detailed, especially when destruction dynamically reshapes them mid-match. Character designs and effects contribute to the game’s high-energy personality. Combined with strong performance, the overall aesthetic remains both modern and memorable.\r\nOverall, THE FINALS offers a polished and entertaining competitive shooter experience that stands out through its destructible environments and stylish presentation. While the narrative setup is minimal, the high production values and fast-paced gameplay more than compensate. Its engaging mechanics and visual flair create an experience that consistently feels lively and rewarding. With its blend of tactical depth and explosive action, it stands as a strong entry in the modern multiplayer landscape.\r\nTHE FINALS gets a 6/10.\r\n\r\nFor more reviews check my Steam profile\r\nHope you enjoyed my review, god bless you",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Haven't been this intensely addicted to a video game in ages. \nIt's got actual destruction physics that break buildings into pieces and have you climb around in the debris.\nIt's a \"Hero Shooter\" where you create your own hero, looks, skills and all. \nIt's got a vibrant, somewhat humorful setting. \nI am not even that good at shooters. Yet it's incredibly fun, especially with Friends. \n\nIt's free. Give it a try.\n\nMüsst ihr wissen.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Finals is the most innovative and fun first person shooter I've played since the release of Overwatch. It's fast-paced with satisfying movement & gunplay, offers an interesting twist on traditional team-shooter objectives, and has insane emergent gameplay potential with its fully destructible environments and instruments of chaos.\n\nNo live service game is ever going to please its entire player base with its priorities, balancing, and monetisation, but I think it's fair to say that Embark is one of the 'better ones'. They experiment regularly with limited time modes to keep the game fresh and different, with the most popular modes potentially becoming permanent. Their monetisation is arguably pro-consumer: no pay-to-win, no 'required' gambling (you can buy the items you want from the wheel if you get unlucky), a self-sustaining battle pass (you get enough multibucks to buy the next one if you complete most of it), free grinding for the premium currency, and no limited time availability for paid cosmetics. I am of the opinion that if Fortnite is the king of in-game emotes, The Finals is the king of skins. There's an insane range of fun, serious, and whacky ideas that you can mix & match to your hearts content, all without cringe crossovers.\n\nAs a casual player, I wish that Embark was more fast & loose with balancing, and made more of an effort to keep a wider amount of the available weapons/specialisations/gadgets viable, but I understand that's tough when you're trying to have a solid enough competitive scene to host your first major (which I am hyped to be there in-person for!).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Crazy freakin game with tons of destructions and very fluid. I'm impressed with the amount of destruction you can have while maintaining solid fps.\nJust try it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The best FPS experience on the market. This game never loses its charm for me. Once you understand its flow and the unique mechanics, it becomes one of the most fun, chaotic, and rewarding shooters you can play.\nThose moments when you’re behind and pull off a last second steal hit in a way that’s hard to describe.\nThe destructible environments are still unmatched, even compared to newer titles.\nIf you enjoy fast paced, creative, team focused gameplay, give this one a shot. It’s absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun for a multiplayer game. I unfortunately suck at multiplayer games. So it wasn't fun for me. But recommend this game to any one who enjoys multiplayer games.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I am still pretty new to gaming and I honestly was not expecting to get pulled into anything the way I did with THE FINALS. This was supposed to be a quick download to try and somehow it turned into one of those games where you blink and hours go by. It is fast, chaotic, funny, and it somehow makes total sense the moment you jump in.\n\nOne of the first things that grabbed me was how creative you can get with customization. The game does not take itself too seriously and I love that. You can build whatever version of yourself or the wild alter ego you have in your head. A huge femboy in thigh highs, done. A tiny guy in a unicorn tank top and a skirt, also done. The freedom to play with your look makes it feel like you walked into a neon carnival where anything can happen.\n\nIt also does not force you into those traditional hero style characters where everything is locked. You just pick a class, light, medium or heavy, and play the way you want. Light is quick with low health, medium is balanced, heavy is slow but so strong. Each one has its own weapons and gadgets and the specialties make them feel completely different. Switching classes actually changes the whole flow of the match.\n\nThe fairness surprised me the most. There is no pay to win mess. Everything costs the same and everything can be earned by playing. If you lose it is because someone outplayed you, not because they paid for some super item. The weapons all feel balanced too. Nothing works everywhere. You have to experiment and switch things up depending on the map and who you are fighting.\n\nThe destruction in this game is insane. You can tear down almost anything. Doors, walls, furniture, full buildings. And when something collapses it is real debris. Rubble falls, metal twists, and you can climb through it or use it as cover. It feels like the map is alive and reacting to every decision.\n\nThe creativity goes even further because the game rarely limits you outside of the map edges. Every match is like an open invitation to be ridiculous with your ideas. Blow a hole through a building just to drop a vault through the floor. Zipline through the air while throwing gadgets behind you like you are in an action movie. If you can imagine it you can probably do it.\n\nAnd then there is the lore that shows up in the middle of all the chaos. Every match is set up like a giant televised game show with commentators who react to everything happening. They hype you up, call you out, and make everything feel bigger. Even the sponsors have stories. OZPUZE is an off the wall energy drink brand. HOLTOW is an insurance company for heaven because apparently that is a thing now. The whole world of the game has this fun personality behind it.\n\nI did not expect to fall in love with a game this quickly but here we are. If you are new to gaming like me (hense the name ;) ) or you just want something fun and creative that keeps you locked in, THE FINALS is absolutely worth playing.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the funniest and technically advanced shooter I've ever played",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Super fun game da. The destruction, movement, gunplay… everything feels smooth and chaotic in a good way. Every match feels different because you can literally break the whole map. Been playing it casually and honestly it’s way too addictive. If you like fast FPS games, this one is a banger.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The only flaw this game has is that i wish more people played it.\n\nAs cs2 fills out my casual shooter game role this is the second game i come back to.\nThe gameplay is amazing, every gamemode is fun, the battlepass is well done, the skins are creative and the community is better than counter-strike's. there is such a high skill gap with all the *thousand* ways you can play it... as im sure you've heard - no two games are play out the same and that goes a long way. it also runs pretty great on some garbage specs. Embark, the creators, are very consumer-friendly. One of the rare occasions when it doesn't feel bad to spend money on cosmetic bs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Came to try this after the release of the second title from Embark Studios, ARC Raiders.\n\nI saw the hype around THE FINALS but ignored it for the sole fact that is was free-to-play.\n\nBoy was I wrong. This is hands-down one of the very best FPS I have ever played.\nFrom a technical standpoint, it is a gem. Well optimised Unreal Engine and unbelievable server-based physics. \n\nThe amount of freedom THE FINALS allows is simply outstanding. You play as contestants in a VR shooter, which eludes the need for \"realism\". The level customisation of your avatars is the very best I have seen in any game so far. Again, freedom (and well, monetisation, because the game is free).\nNo FOMO as you can get legacy battle passes. Again, a nice touch that is customer-friendly.\n\nNow regarding actual gameplay, it revolves around three classes: Light, Medium, Heavy, which all have different speed, toughness and strength. Weapons are class-locked, as well as some gadgets, and of course, class abilities. You only get one weapon, no \"switching to your handgun when your rifle is out of ammo\" which makes balancing around reload time interesting.\n\nHonestly I could write a more lengthy review but my point is, you should just try it out for yourself, you have got nothing to lose.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "one of the best games i ever played in my life, would be so cool if u guys added your badge for the trading cards :3",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Awesome game! i have almost 1000hrs, everyone should try it! seriously! Its free!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game that delivers tons of fun because of it's dynamic gameplay. The only annoying part is that 90% of the playerbase is comprised of braindead meta slaves that never cracked a smile in their life, sweating like they're sitting in a 105°C Finnish Sauna thinking there is a pot of gold waiting at the finals win end screen, while playing the casual gamemode World Tour.\r\nThe real fun in this game starts where the meta ends. MGL, Spear x Smoke, Sledge x Goo, Dual Swords x Turret, etc.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "My favourite FPS shooter, great gameplay loop, 10/10 customisation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i have GTX1650 , I3 7100 and , 16gb ddr4 not able to play on this specs plz lower the system requirments game is amazing only factor is high specs",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is an abusive relationship\r\n\r\nSometimes it feels like I'm sweating at grand finals with half a milly on the line in a \"casual\" gamemode \r\nOther times the gunplay, setting and sound design/soundtrack just immerse me in this virtual game show.\r\n\r\n0/10 game sucks balls",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[h2] This has to be the best FPS out right now, yet everyone is sleeping on it. [/h2]\n\nI don't understand why people aren't playing this right now. It's innovative, the gameplay is fun, the gunplay is great, the graphics are good, and it's plenty competitive. This is a shooter that's actually really good, but doesn't trend-chase by adding in battle royale or any other crap like that like almost every other recent major FPS. The only thing you can pay real money for is cosmetics, meaning that there isn't any pay-to-win aspect, and skill actually really matters. I haven't ran into any cheaters either. The weapons have a pretty nice variety, and the classes are a very nice addition, with each of them being pretty well balanced and specialized for what they're meant to do. The fact that you don't have a secondary gun to switch to is unique, and while it can be frustrating to die because of a reload, it makes the game more eventful, because whoever shoots first doesn't automatically win the duel. It also makes you more aware of the little things, because you always have to keep an eye on how much ammo you have left in your mag. The cashout game mode (it's not the only game mode of course, the rest are also extremely fun, cashout is the \"main\" game mode of the game) is extremely fun and unique, and it's super fun and easy to try/find new strats. Once you get past the \"entry/I kinda suck at this\" stage (levels 1-10 ish?), the game gets super fun, and every match is unique and entertaining, making it hard to get bored of the game. There's also the fact that almost everything in the map can be destroyed in a super detailed and satisfying way, so you could change up the look of the entire arena in a very short amount of time, which makes the game even more fun, unique, and even more eventful. The destruction can also be implemented into your strategy! The arenas are also very detailed, well-made, and fun to play on. All in all, this game is absolute peak. I can't find any problems with it. 10/10, play it NOW!!!! IT'S FREE!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've decided to drop THE FINALS after so long, constant grinding of the battle pass as a Free To Play gave me the same dread i had with Fortnite, this game is awesome for those who want a unique multiplayer shooter, ARC Raiders would not exist without THE FINALS, so i am thankful for this.\r\n\r\nNow that ARC Raiders had been released, i have no reason to play this game, because ARC Raiders is more addictive and fun, there are lots of things to do and many blueprint weapons to find, embark studios definitely is the best game studio around in regards to making fun games.\r\n\r\nThank you Embark Studios for THE FINALS.\r\nI will continue my journey of fun in ARC Raiders.\r\n\r\nSee you all Topside, raiders.\r\n\r\nI am also streaming ARC Raiders daily on Twitch if you are interested to see what the game has to offer, from a casual player perspective, thanks for the awesome games to all the players in this community, never would ask for a better opponent than you all.\r\n\r\nKeep Moving Forward.\r\n\r\nTwitch.tv/PandaHeroCommunity\r\n\r\n- AUTTENBURGH",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy a lot of the game play aside from a few minor bugs and frustrations the game is really fun.\r\ncomplaints/critiques about the finals:\r\nI wish the quick play system would not put me in a match with level 100 players when I am only level 16.\r\nThe menus and player interface are a little tedious to navigate and constantly having to swap equipment around in multiple menus all the time is a little annoying.\r\nWhen you die and are revived by a teammate if you swapped your load out it will not save the changes for next time you respawn which is quite frustrating.\r\nI wish there was a way to vote on which map to play on.\r\nAt the end of a match there are too many pop ups about the match to get through I wish these were condensed.\r\nKey bind customization is great but I wish I could change the type of activation such as holding, Pressing, tapping, double pressing etc.\r\nI would love to see more quality of life in the practice range I think being able to reset or change terrain (the building) or spawning in bots to move in certain patterns or act in certain ways would be real helpful for learning to play or practicing movement.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's okay, but after the first season it is hard to just play for fun anymore. Now everyone is too good for me and they dont want to have fun anymore. They're just try hards :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its an amazing game but the lag you can get from this game that only appears in this game is awful. Only reason I don't enjoy it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Only shooter to have me hooked like this, especially after a long hiatus of competitive gaming. This game makes competitive/ranked actually fun (unless you solo).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is the GOAT , i started playing it 3 months and i don't think i will stop until a better fps game drops , which most probably will never gonna happen.\nthis is my first steam review btw",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "im blowen away. in a time where gaming is dry and dead, copy paste corpo slop and the such, i was getting board as many ppl where. this game is everything great from Black Ops 2, TF2, and titanfall all buttfucked and slammed into one amazing 100/100 game FOR FREE. really, this shit is heat and i feel horrible for not playing it sooner lmaooooo. also THANK YOU FOR LINUX SUPPORT thank you for not being lazy and calling us linux users all cheaters as a excuse to not make your game work on linux. as a long time linux user and fps fan, this means the fucking world to me :> 100/100 please play the finals",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best fps out there, fantastical, great physics, team work, customization, destruction, the list goes on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played the game for 200 hours and my only suggestion is undo season 3, it brought nothing but sadness to my gameplay. Almost every addition has hindered my enjoyment in some way, whether its the countless annoying weapons or the worst map in the game Kyoto, I honestly wish it was just removed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game makes me wanna pull my hair out. playing this game made me lose braincells and gain an extra chromosome I now ride the short bus. playing this game made my parents turn into siblings",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finally got the achievement for 150 wins as light and immediately thereafter got an insane migraine, presumably as some form of divine punishment. Would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its pretty much very awesome and cool unless you like fun and joy then maybe not 4 u\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best FPS of the decade\r\nPolished, high quality and every game session is different due to the environment possibilities.\r\nEMBARK fanboi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i hate multiplayer games. the finals is dynamic enough and has enough depth to make that a negligible concern to me. balanced well and generally doesn't have a \"meta\" to play towards due to how the primary modes (those containing cashboxes) are structured, rewards smart and creative play and its just fun to experiment with different gear interactions as well if you're not feeling like playing seriously",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Finals is a great game to play if you have lots of friends. The creators have lots of ingenuity and I can't wait to see what they come up with next!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, fun mechanics, cool game objective, pretty cosmetics, great gunplay, decent community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE FINALS delivers an exhilarating 5v5 FPS experience with dynamic maps, fast-paced action, and endless replayability. Every match feels fresh, competitive, and incredibly fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It took awhile for this game to grow on me, but it official has.  After watching a few videos and trying a few different playstyles, I am having a blast.\n\nThe FPS I've played the most of in my life is Halo, and when I play this game as heavy with flamethrowing, frag grenade, lockbolt, charge/slam, and rocket launcher, I'm right at home.  I want to play as light, but I die too fast when I play that class.\n\nSince I mostly only play with sound off so I can hear what's happening in my house, I only play Team Deathmatch, and it's a blast.  One day I'll start playing the main modes, like world tour, etc, but I don't want to be a bad teammate, because when something crazy happens I go AFK or leave games immediately.\n\nThe destructible levels are so fun.  When I'm chasing someone and they try some peekaboo non-sense, I'll charge through the wall and spray them down.  If they are above me, I'll rocket the ceiling and make them fall down next to me.  If they're below me, I'll slam the ground to break the floor and interrupt their little party.  I'm not the best, but I have some high k/d games sometimes.  \n\nFor all FPS games, I like to do movement with a controller and aiming with a mouse, so I have a controller in my left hand, mouse in my right.  This game allows me to do that flawlessly.  I just had to turn on steam controller input  so the onscreen input instructions on the HUD don't constantly change between controller binds and keyboard binds.\n\nMore people need to play this game.  It's a shame that people will play all these other free to play games but won't try this.  This game needs to advertise more.  Needs way more marketing.  And they need to emphasize the fact that there is a simple deathmatch modes, because a lot of people don't want to play an objective, they just want to fight.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "besides use of ai (which i can forgive because they are forthright and up front and this game is technically a startup for embark) this game is absolutely fire and i love to blow up buildings in video games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE FINALS is what happens when a heist movie, a reality TV show, and a demolition derby all have a baby. Everything is destructible, everyone is flying through windows, and half the match is spent yelling “WHO BLEW UP THE FLOOR?!” while falling into the void.\n\nGunfights are fast, movement is wild, and every contestant has the attention span of a sugar-high raccoon. But that’s the charm — no match ever feels the same. One moment you’re securing a cashout, the next you’re being launched into orbit by someone’s trampoline cube invention.\n\nFinal verdict: 9/10 — Pure chaos, pure fun. It’s Fortnite for adults who enjoy property damage.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has new gameplay elements, mechanics. This is not a regular FPS game it has more to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Couldn't recommend it more. It provides such creative ways for players to approach every match. Best FPS I have ever tried bar none",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I HATE THIS GAME\nI love this game\n\nskill based match making makes my soul hurt\nI do not have fun playing this, I went a winning streak with friends and now i'm getting paired with people who are competitively unemployed, this review will most likely change, and then change again and again and again and again.\ngreat gameplay, horrid experience.\n\nI keep crawling back, I have uninstalled and reinstalled this game six times\nat time of writing its reinstalling once again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man this game is awsome. Sailor & I, made such a good soundtrack! (Yes the artist is called \"Sailor & I\") I think the main selling point people always bring up is the destruction. But I think what truly makes this game several cuts above the rest is the DYNAMISM and second to second decision making that is the true power of this game. It's free, I know you're probably tired of hearing about the game. But just play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When my brother told me to get this game I dragged my heels for two weeks until I finally caved, thinking it was gonna be another generic shooter. Now The Finals is probably my favorite shooter. The gameplay is tight and balanced, the gameplay loop is fun and keeps you on your heels, and every game is a close one. This is a great shooter and I'd recommend it to any skeptics who feel fatigued from all the other shooters on the market.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Smooth gameplay, fun strategy, relatively balances loadouts. Competitive. Good polished product.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even with shotty servers, questionable hit reg, and some (at times) truly awful competitive matchmaking, this is without exaggeration THE GREATEST FPS YOU WILL EVER PLAY",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lemme visualize for u if you’ve never played the Finals why I and almost anyone that played ts game for more than 10 hours screams it’s the best shooter OAT: It’s a double pendulum game. so much is possible to do/happen that it's quite literally never the same. it's like if overwatch and rainbow six had a kid except you could create your own hero. the entire map is designed to be destroyed and is constantly changing. no cover? make some. no way down? make one. on top of a banging ass customization system. it's adrenaline as a game and truly next-gen. even the default game mode is a fresh take on search and destroy. Take a look urself and download it already - see u in the Finals :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wasn't a fan of the game when I tried it out in BETA but after some fixes over the years and adding a BUNCH of content in the Store it seems to have gotten better over time.  I've played the game in total of 25 hours and still go back to it for more, it's just there when I'm tired of wallers/ghosters in CS2 and my dailies are done in PUBG.  Check it out if you wanna add something new to the mix, worst case you uninstall it cuz it's just not your kind of game.  My current loadout is Famas, Primary turret, and Secondary Turret with Proximity Sensor and a Frag Grenade.  All items have cool downs and is fun when you have a decent set up and getting knowledge of the maps down fast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, chaotic, each match feels diffenrent",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "istg light players just dont stay with the team die and then ask for rez, play if you have a squad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. Sometimes I have latency issues but I can never tell if it's me or the servers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a meta but honestly just use the gun and gadgets that you find fun. the reason why I love this game is the player expression and creativity in the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game, and love the developers, deserve every bit of fame and recognition they can get!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The competitive mode is very good, and teamplay is excellent, including some temporary modes. The game features a destructible environment and runs extremely smoothly. There are lots of regular updates with new maps, weapons, and accessories. accessories. The only problem in the game is the invisibility of the lightweight character.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game even better with friends. Constant patches, consistent content releases, buttery smooth movement. Really couldn't ask for anything more from an FPS. One of if not the best feeling first person shooter I have ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In my opinion, THE FINALS is a seriously underrated game. It’s fast, intense, and every match feels exciting from start to finish. The movement is smooth, the gunfights are chaotic in a good way, and the destruction adds a level of hype that most shooters don’t have. It’s one of those games where even losing can be fun because the action never slows down. If you’re into competitive, high-energy shooters, this one deserves way more attention than it gets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "“The Finals” is an amazing game with intense action and stunning graphics. It’s engaging, fun, and highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its the kinda game what we gamers are looking for. In my pov games are supposed to delver the fun and joy and for me this game did it. Idk why but this got it. Good game indeed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a sensory delight to play. The graphics, audio, fidelity, visual flair, map themes, UI, and customizations are all stunning. And that's not even counting the insanely frenetic & epic game trailers they keep releasing. It's highly polished, stable, and optimized at this point - the game runs surprisingly well (only from an SSD) on my laptop's RTX 2070 Super Max-Q.\n\nWith regular updates (I find it not too fast and not too slow), where new maps, modes, weapons, and features get added, this game is still going strong.  Admittedly the skillcap is high and every match is sweaty, but I still find myself enjoying even when I'm not playing that well. The skins on sale are standard pricing, though they do have great value bundle deals available. Most of the skins are fantastic and hard to resist.\n\nThe game suffers from most of the same issues that plague pretty much every other F2P FPS game, though they did come up with some innovative approaches & solutions to some of the other challenges. Thankfully there's no weapon customization beyond skins, so you won't be losing all your time to min-maxing (I'm looking at you Call of Duty), but sadly all the weapons are locked behind progression points, meaning your arsenal of equipment stays limited for far too long. 40 hours in and I've only unlocked a fraction of them. That's too slow a pace for unlocking equipment that affect your play styles and match performance. Additionally, there are weapon balance problems, but I've seen far worse balancing in other games.\n\nThis game is an underrated gem on the current F2P FPS scene. Its playful & quirky personality, fun modes & gameplay mechanics, extensive environmental destruction capabilities, and varied playstyles make it totally worth casually burning your time in a few matches once in a while, at the very least.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the finals has the best animeations and the most satisfying building destruction absolutely crazy crazy gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Game play, music, and cosmetics are all fantastic and for me no other game has hit a three of those points, especially for a free to play game. This is just one of those games that's great to play with friends. The one downside of this game is that you can run across some pretty sweety people, but eh whatever I'll just use all the explosives and fire at my disposal to eradicate all of those light players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is everything you would expect from ex-battlefield veterans. It feels fresh and fun for an FPS.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game's movement and shooting feels extremely fluid and enjoyable. The addition of the class specific abilities is integrated well in a way where it adds an arcade element to the game without being too cartoony. Though the SBMM is poor or doesn't exist, and balance between weapons is very noticeable (what game isn't it though), playing with friends can be tons of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Embark not only designed a truly novel game (exceedingly rare nowadays) that is a blast to play, but also provides constant content and updates while listening to their community and having some of the most consumer-friendly practices in the gaming industry.\n\nThis game is always exciting and allows for an unbelievable level of customization, playstyles, and skill expression.  I have enjoyed every minute spent in this masterpiece.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best fps game I've played. The learning curve is abysmal but once it clicks you can't stop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After spending over 800 hours in FINALS, I can confidently say this is one of the most addictive and unique FPS experiences out there. The fast-paced movement, insane destruction mechanics, and team-based strategies keep every match fresh\nIf you enjoy high energy matches and love experimenting with different playstyles this game never gets boring\n\nFINALS is absolutely worth it. And if you give it time, you might end up like me 800 hours deep and still not done",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "It's a nice game but the matchmaking ruins it. If I'm an average tennis player what makes you think I want to play against Andre Agassi? I'm level 4, why the fuck are you matching me with level 24s? I am getting absolutely MERKED here. No thank you.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "Despite the hours I have in this game, I really wish I could recommend it. The destruction is the most interesting part of the game by far but if the environments weren't destructible to the extent they are, I truly believe nobody would be playing it. Everything underneath is just really rough. You don't notice it initially because of how eye catching the destruction is, but the more you play, the more you start to see all of the cracks start to show. So many little things that add up over time and make the game just downright unfun and frustrating. And I wish i could say it was just some games but its every game I play. Even when I'm winning i just feel frustrated by the direction, game mechanics, imprecisions, movement, unfair balancing, etc... of the game. All of my friends have already bounced off this game a long time ago and are never coming back and I honestly don't blame them. And solo queuing is just miserable in most games with it being no different here. I could drone on and on about all the problems I have with the game, but I'm not trying to write an essay about it. Just can't recommend this one. For me it will always feel like unmet potential as it is.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I didn't have much time to play this game, and I liked it - it's a pretty dynamic and diverse shooter. Why is my review negative? Because of an unfair ban. I wasn't incredibly good at this game, I wasn't even just good at it. So I was very surprised when I received an indefinite ban \"for violating the rules of the community.\" After several attempts to communicate with tech support, I still managed to find out that I was accused of cheating, and even conducted a manual review. Probably, at this point the reader will say \"it serves you right.\" If you don't believe me, but believe that the ban is fair, I can understand that, real cheaters often say that too. I just wanted to share my resentment with the community. And also to warn that such cases could happen. I've been trying to find out if there's any way to justify myself, but apparently there isn't one. It's a pity, because I had a high opinion of Embark, the more unpleasant it is to find myself in such a situation.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Ts game buns hope it dies or they add skillbased matchmaking in 5 years so i dont go against people who haven't showered in 4 months",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "You have a better chance of fighting against the top 500 people in the world in casual game modes than you do in ranked.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I have 300 hours on this game, I've reached high ranks in the ranked mode, And i used to love it so much\n\nI now only play world tour casually, \n\nThere's atleast 1 cheater in every match, but most will have 2-4 cheaters, \n\nGetting beamed down by a gun thats short range with alot of recoil from quite far away as the headshot noise that goes off whenever you get headshot spamming in your ears before you die in 1.5 seconds when you walked slightly out of cover,\n\nthis pretty much happens every 2 matches or so.... its infuriating and the game is ruined by cheaters,\n\nAlot of these cheaters play on new accounts, as their other accounts got banned, \n\nEmbark, this game used to have 20-30k live players, it now has 8k live players and im sure about 20% of those are cheating, and the rest are gonna play for about 30 minutes before going \"fuck this, this game is full cheaters\"\n\nthis could have been avoided, but when cheating became a massive problem, all you would do would ban them for a week, and You've never issued any IP bans,\n\nmy only regret was buying so many battle passes, they are now useless as I will never be playing this game again",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really want to like this game. The environments have so much destruction it's borderline insane, and the guns feel satisfying and fun to use. However, the Light class is frequently pampered by the devs and is one of the most tiresome things to fight in this game. The damage is better than the other classes, which makes sense since they're supposed to be the flanker/glass cannon. This quickly falls apart when one of they're abilities, the Dash, allows them to avoid damage on every press of a button; making them much harder to kill. The Light also has a double barrel shotgun, which has the fastest TTK in the game and it doesn't need headshots or backstabs to work. The shotgun has effectively no range past point blank, however, making it extremely high risk. The Dash covers a short distance very quickly, meaning a Light player can just press Q and cover a room's worth of distance instantly; killing an enemy heavy and dashing away with absolutely zero repercussions. None of this means the light is \"too good\" but it does mean that fighting Lights suck out the fun of the game and not worth anymore of my time.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This is awsome except for the faggot ass knife and swords, its a 2-3 hit to kill weapon with the ability to reflect all bullet?????? wtf is that? that shit is ass, thats what it is. nerf that shit and the game is perfect.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game has clear metas that everyone uses, making the game frustrating for many people who are actually trying to have fun in here, if you have a job and a life, you most likely will not be able to enjoy this game, you will get clapped by little people running around with katanas and shurikens, save yourself the time and try other games, but not this one.\r\n\r\nThe idea behind this game is amazing, but is poorly executed, idk what melee weapons do in games like this, a SHOTER game, anyways, this will be seens as ''skill issue'' or something like that, lets hope saying that kind of stuff to new players, can keep them playing, ggs",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Yea good game and all but holy shit it'll piss you off the amount of bullshit in this game is incredible i'm looking at you dual sword users how the fuck can you have something in the game that lets you ignore all bullet damage and reflect it back and have no real obvious counter. add to that everything knife related one or two taps you all the while being able to turn mostly invisible is fucking ridiculous, especially considering the higher resolution you can run the game the clearer and easier you can see these invisible fuckers. Fix hipfire bullets should not go in a cone when im 2 feet from someone.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "do tutorial, get sent to match, seems ok.\n\ntry another match, gets lvl 100s on your ass for a second match, no thanks bro",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it a fun game but i dont recommend it to people from middle east because there are no good server for middle east",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I do not recommend this game to anyone and to be honest that's pretty sad. It's sad because the massive glaring issues aside I think The Finals at one time and could have still been the best faster paced pvp fps game available. It makes great use of the systems available with Unreal Engine 5 and the theme is unique and exciting. It's also very fair with it's microtransactions although it took a bad turn with the newer ultimate tier battlepass. But the real issue as to why I'll never recommend this to anyone in it's current (and at this point very long standing) state is because of balancing. Players have been pleading for way too long now to fix the balancing in both matchmaking as well as weapons, abilities, gadgets, and classes.  Quick Cash is the bread and butter of this game and it's supposed to be the \"casual\" setting for this game. It exposes all of the balancing issues in this game perfectly. Queuing solo? Get ready to pair with two randoms against full stacks. Get ready once you're a high level to have two truly new players on your team against those full stacks. Get ready to play against lights who have been catered too extremely heavily for a long time now. Get ready for those lights to spam dash. If you're a new player get ready to be even more frustrated than someone with 1000+ hours. I don't want to leave a bad review for The Finals, I want it to do well, but Embark has ignored the same daily feedback for too long.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is great but the matchmaking sucks! Yall keep matchmaking players on ranked who don’t know how to play. Yall need to score players on their individual stats not wins.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I enjoy the finals however the game lags crashes and runs horrible even though I have a decent pc 6/10 if it runned better it would be a 9/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I really love this game its a nice mix of battlefields destructible environment and Apex style game play but it has an issue with graphics. I'm not sure if its the updated destructible's or a new update but when playing the game CPU and GPU get maxed out and it is really hard on hardware, please be careful I had most settings MED or lower and it caused my I7 8700k burn out from the heat caused by the game (I have liquid cooling and 3 internal fans!) and now my GPU ( 1080TI ) is experiencing the same issue of 100% usage leading to overheating. This is not okay its actually damaging peoples PC's and costing $ if you care about your game Devs please fix this issue! I want to go back to grinding top 500 on world tour but I don't want to risk burning out my graphics' card when I have all settings as low as humanly possible. :sob:",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game started out good, but the level of cheaters is deplorable. They continue to release weekly micro-transactions for the game, but never seem the address the issue of cheaters directly at all. A news letter listing banned players would be a nice change for a start. Hell make the game $20 just to lessen the chances of cheaters making an alt account and start all over.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game has a good design and the problem is simply having too many cheaters\nObvious aimbot hacks and 30 kills without a death happens every game\nEven in CS2 reporting and blocking hackers can sometimes work. Here the report button basically does nothing.\nThis happened before Season 3 and these days it happens again.\nBut since the game has never reacted to its current situation the game is still EXTREMELY UNRECOMMENDED",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A lot of the AI voicelines for contestants sound SO BAD it physically hurts me. Please, recording a few mp3 files won't bankrupt your company, give us some polish on the voices. As for the gameplay, the players are some of the most brain-dead sweats i've seen since i played Siege. Matchmaking sucks ass and getting a good game is almost impossible. Otherwise it's fun, I might be developing an abusive relationship with this game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "As of late the game has lost it's spark. Having been playing since beta, I think it's time to put it down. It's rife with cheaters and the community has gotten pretty toxic. Even winning feels hollow, cause 9 times out of 10 you're just having to cheese it against triple heavies or a team of all daggers. At this point skill takes a backseat to cheaters and cheesy nonsense.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game. Though I have a grievance that all the guns, skills and gadgets are closed and I need to earn point to open them. Adding insult to injury, after I played for 10 hours grinding points to try new weapons, an update gave every new player more points on start than I have earned. This demotivated me a lot. They had to retroactively add this sum to all the players that earned overall less points than this amount at least.\nI often want to try something just to test if it clicks with me, or for a flavour or change. For example bow, throwing knives, revolver, dagger, sword.. kind of weapons I know I won't win much most surely, but that are FUN to try. Or a different kind of a machine gun or rifle for the same class (instead of strategically picking a totally different weapon for a different use case, because of scarcity of options on start).\nInstead not to waste scarce points I need to look up META loadouts, where I need to open for each class a gun, skill and gadgets, also considering newer ones are more expensive. I need a lot of grinding just to try new gear or play-style, to find my own.\nExperienced already players get an advantage over me having all this stuff open and being able to strategically switch it.\nGame already allows to earn and buy cosmetics. This progression system for opening weapons in a PvP game is idiotic in my opinion and harms the game a lot.\nSo for otherwise a one of the best online PvP FPS games I leave a negative review. Just because of this annoyance. If it's not a problem for you, get this game, it's really innovative and well done and overall super good. Cheers.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A LOT OF CHEATERS . I block several of them and still play against them. Such a shame, it was a fun game. Uninstalled",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "One of the most inconsistent games I've ever seen. Servers are terrible, you can’t even see your ping lmao, and it’s full of cheaters and scripters.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you want something fair DO NOT PLAY THIS. Swords that block AND deflect is just horrible. Gun skill no. Skill of being an absolute horrible person and ruining gaming. If you wanna play something fair... ROBLOX. This game is a 2/10 if no one is using swords 8.5/10",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game but it runs like shit on Linux, please fix that",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So many cheaters. Companies NEED to start perma-banning cheaters. And before people jump down my throat, I have footage of them and have it posted to my social media. Aimbot, no dmg taken at all, same cheats as COD/Fortnite/R6S, etc. ALL companies need to start perma-banning these people and not giving second chances. They are ruining EVERY GAME! Eventually everyone who don't cheat will simply go back to single player games and then we will see how long MP competitive lasts. Non cheaters will have the last laugh because devs won't keep servers up for a small portion of hackers if every decent player decides to call it quits on MP games. \n\nIf devs don't want to perm-ban cheaters when they are caught, they should put them all in their own servers so that cheaters play with cheaters. Hackers/cheats are fucking pathetic, poor excuses for humans.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Untill they learn to turn on a SBMM and get be better teammates with enemies that touch grass this game is trash",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "remove winch\r\n\r\nhardstuns should not exist when every single fucking person on the team can just rock it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I like the game and I play it but when steam reviews ask me, would i recommend this game to other players? No. Circumstantially. Dont play unless youre willing to invest time into sourcing a team and lining up schedules, the matchmaking in ranked will happily place you against players of higher rank and elo, but only give you teammates within your rank range when available. This spells doom for any solo q team, you fight 3 stacked, synced up players, with more time in the game and have to roll the finals solo q lotto to get anything near as synced up.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I spend 1000 hours on the game and i can say this game is waste of time and nerves. If you think you can do anything free you are wrong more you spend better aim you got. Their anticheat is so shit and game is full of cheaters grinding to be in ruby. If you like playing shooter game go to csgo cuz this game is junk.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I want to love this game I really do, it's revolutionary in the industry and genuinely a lot of fun once you get into it.\n\nBut at the moment this game is full of sweats and cheaters, can't even win a casual match anymore.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Most god awful matchmaking I've ever seen! DO NOT SOLO QEUE YOU WILL NOT HAVE FUN! Constant sweaty fat neck nerds that play QUICK PLAY like it's an esports tournament. GET. A. JOB!!\n\nConstant cheaters or smurfs using xim or chronos... I GENUNINLY HOPE THOSE WHO ARE HERE THAT DO ANY OF THIS I HOPE YOU RECEIVE EARLY STAGE BALDING TO GO WITH YOUR 500 POUNDS YOU WHALES!\n\nTerrible balancing between classes nerf lights and heavies give more gadgets to mediums there incredibly limited it's horrible. \n\nAnybody who says this game is fire is lying to themselves this game is horrible... these are the same people that would like to sit on nails while rubbin there nuts on sandpaper.\n\n\n12/10 Game would play again.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It used to be good. Now every other game is just a god team that just completely dominates the game and you don't even have the chance for a fair competition.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Let me clarify: my negative review would be mixed if that was an option. Don't get me wrong, I have gripes, but the gameplay loop is really really good. This is the point of view of a hyper casual in a hyper sweat shooter. And before anyone says \"Well you said it yourself hyper sweat and you're casual you should just stop\" I like shooters, and I don't wanna stop playing a game because it's sweaty.\r\n\r\nPros:\r\n-The gunplay feels really solid, the sounds are properly chunky, the reloads are satisfying, and the explosions are great.\r\n-The customization really went all out and for once it works because it's a VR gameshow, it makes sense to have nonsense cosmetics cause it's a show\r\n-The battlepasses have been really good. Sure, they're battlepasses, but they're still worth your time and easy to farm if you want to get it.\r\n-The option to have free cosmetics via Sponsorships in game and all of that is free is really really cool\r\n-The equipment is super varied and really fun to play around with\r\n-The destruction is reminiscent of old battlefield games, with a *little* less freedom. Very little though.\r\n-The games are chaotic and great fun, and don't last super long.\r\n\r\nCons:\r\n-HYPER SWEAT GAME. Gods above and in the name of all that is holy is this game so goddamn sweaty. It's rare for me to play a game where everyone is solo. There will ALWAYS be a squad, either of 3 or 5.\r\n-MMR doesn't exist here. That thing that makes you play with same skilled players so it's a fun, balanced game? Not a thing. You're gonna have randos while the enemy is a full clan squad who are near top tiered rank players. Not fun.\r\n-Weapon and Class balancing is bad. Like, really bad. Now don't get me wrong, the classes are generally balanced, and you can use whatever gun you want, none are unusable. Problem is, the meta is very, very clear. Heavy's either use the sledge or deagles, lights will always have an smg or the knives and the cloak, and mediums will either camp you with a sentry and sniper or be a giga-pain with a medgun and the revolver or ar. You can say skill issue, and I'd say yeah probably. But man is it not fun.\r\n-Paid items are getting more and more common, and more and more expensive. And I don't mean premium currency I mean bundles costing near 30 real life dollars. I bought one. Do I regret? Not really, but damn is it popping up more and that could turn folks off.\r\n-It's toxic. Simple as. You're gonna get tbagged, insulted, all the fun stuff. Rage quits when the match or KD isn't like they want it. It's a shooter thing, sure, but it's worth mentionning.\r\n\r\nAgain, i'd make this mixxed more than anything. I like the concept here (hell, it's better than Arc Raiders). Comments are enabled, go ahead and let me know how I'm wrong, I don't care lol.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unfortunately I'm not willing to 1. commit the time to \"git gud\" and 2. I'm not willing to risk a ban in order to actually win a match. \n\nThe majority of matches are dominated by extremely sweaty basement dwellers. Unfortunate that I skill-based-matchmaking isn't available in anything resembling fair play. Getting matched against people with LMGs with very large ammo cap when my AK has to reload almost immediately after firing makes the game un-fun. \n\nUnless you land every round on their face it's nearly impossible to kill someone with an AK when they're at full health even if you manage to land a few headshots. Sad because I have literally never run into an enemy that didn't kill me almost immediately. \n\nThanks for trying I guess.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game crashed 4 times, after validating and restarting my computer between loading up the game. Moved it to a different drive, was able to launch into a game for 2 minutes -> crashed again. Validated and rejoined, but was given a suspension after I finished the match. Cherry on top: 3 days ago, the game was playing just fine, buttery smooth. After 1 update, this nonsense started happening. \n\nSome say it's the new anticheat, I think it's beyond me a game could break this much after a single update. Seems like based on the forums that there's no solution so find something else to play until it gets fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "as of writing the review its just full of hackers playing in clubs and such.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Decided to try it, wondering why a free game is so slept on.\n\nHORRIBLE weapon/class balance, HORRIBLE hit reg.\nHORRIBLE Matchmaking (Got matched against people with 100+ wins after 2 good games)\nAI generated texts and voicelines. (Could tell 5 minutes in)\nMonetisation hellscape, pay 20 bucks for one (1) mid character skin.\n(Possibly AI generated too) There are no free/earnable skins.\nOne of the ''free'' currencies requires you to spend premium currency first in order to spend it...\n\nYeah, no wonder no one plays this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Too chaotic, cant do anything without beeing called out by the bloody brits in my team.\n\nDo not recommend cause of personal reasons, play with chill friends that know your humor and you know theirs. Then the game might be enjoyable",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I just hit level 30 after 77 hours, and I can't stand the random matchmaking anymore.\nSure, everyone is playing Arc Raiders, but the first 3 matches were great and balanced, then everyone is at least level 70+ the majority of the time.\nI qued with two friends who are about level 70-80, and we paired up against a 5 stack of 110s-120s.\nIt's not even worth it, it's not even fun with meta weapons. I can play any other game with hitscan weapons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While this game, like every other online multiplayer community that exists, is saturated with AI bots, cheaters, autoaim, etc..., I still play it because you can blow things up and make an entire building collapse on your battle. \nIt would be even better if all the players were actually human, and playing without cheating.  It's not hard to tell with the deathcams if you were legitimately pwnd by a better player, or if they were just another AI generated account with a crosshair that never leaves your head. The cheating is so obvious, I can only assume that the developers made it part of the 'game'. \n\nI still get to blow **** up, though. ;D\n\nEdit:  FIX THE F'ING AIMBOT, WALLHACK, AND GENERAL CHEATER INFESTATION.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fun and has so much potential, but it's ruined by the matchmaking. I don't have many balanced matches, we either ruin the other teams or we get beat really really bad. Or maybe the players are leaving the game I can only get in a match with super old players. Since the devs will now focus on Arc Raiders, I think this game will die. Sad to see a game so good and fun ruined because of the unbalance between teams. \n\nI really hope they start working again on improving the game and not just adding new skins to make money. I understand you need to make money, but if the game is good and well optimized you can make money for a long time after.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there's a reason why player base is consistently dropping\r\n\r\nthe moment you hit 3-4 good rounds in a row, the game guarantees to pair you up with the most braindead teammates alive or people playing from antarctica so they DC in the last 2 minutes of the game (so no loss compensation is given)\r\n\r\nif a teammate griefs or throws the match, you're not allowed to leave so you eat up -700ish RS for nothing\r\n\r\nYou get put in random ranked lobbies where winning 1st place only gives you 300RS\r\nor you get put in lobbies where winning 4th place loses you -200RS\r\n\r\nMMR is non existent in this game\r\n\r\nthe devs know this and don't care",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has absolutely no matchmaking balance at all. In casual or ranked matches, every single game has loads of players with several thousand wins each, while I'm trying to learn the game with less than 100 wins. Most matches are dominated by a single team (or player) who has no business being there.\nThe gameplay and mechanics seem nice, but holy crap it is not worth trying to learn through the suffering.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun Right until the silly SBMM kicks in and then its just a sweat feast.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "yes i play 2 matches and i don't like it this game is for unemployed mother f*ckers",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this game so much, but I cannot recommend this game to new players who aren't cracked at FPS games already. I have been matched only with 100+ level players and I've never met anyone below level 10 in my playtime, I am under level 10. I am good and I can compete with high levels as a newbie but I can't say the same for everyone else who picks this game up as my first matches were with level 50-100s and have stayed that way. You are severely disadvantaged due to lack of game knowledge and gear unlocks in comparison.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love the game but the fps drops and the constant worsening  performance each update has made me despise how the game is treated. They care only to release cosmetics and make some money off the game, not bothering to optimize the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Theres not a single enjoyable solo game i've played.\r\nMost of the players dont even know how to shoot.\r\nMost of the players die alone because just want to fight and not playing cashout.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "optimize ให้พ่อมึงเล่น fuck the unreal engine 5 ikwai\n\nedit: now that i am a fucking pc master race, it's a fine game. and that's it not so special or exciting like i expected when it got released.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generally i think the game is well done and can be fun once you are established.\r\nBut for me the tutorial came automatically after i played like 30 rounds!?\r\nAlso i those rounds i played i had to play against players who were so much better and i got destroyed without much of a learning effect. Not really sure how to get into this game...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "dude this game need to be balanced, theres no possible chance a throwing knife, sword or any melee to be real is doing more damage than a shotgun, in no world ssomeone should be able to take 2 shots FROM A SHOTGUN to the chest or face and live, thats just not happening, then what ius up with the fact theres no secondary gun you can switch to in a fight besides reserve which you can only change after you die, i literally have never played a FPS where theres no secondary weapon. please balance the guns",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I want to preface my review with this: The Finals is one of the most fun and inventive shooters on the market right now. It takes everything I love about other shooters in its genre and runs with it, creating gameplay that is addictive, satisfying, and genuinely feels fresh and exciting.\n\nThat said, I can't recommend this game for a very specific reason. The use of AI and text-to-speech tools to replace artists and voice actors is genuinely incredibly disappointing.\n\nIf you weren't aware, I hate to be the person to break this to you, but both Scotty and June are generated voices using a language model trained on real voice actors. So are the player voices. And from what I understand, some designs such as sprays, stickers, and patterns on clothing are just straight-up AI-generated. \n\nI genuinely think this is unacceptable and we should demand better from developers and publishers. Everyone clowned on Call of Duty when they put AI art in Black Ops, and I don't see any reason this should be different. It's projects like this, and the success of projects like this, that is causing so much fear and uncertainty in artistic fields. What happens when a developer decides that music is too costly to compose, so they have a machine generate it for them? What about weapon designs, map layouts, or game modes?\n\nThis design philosophy is bad for creatives and bad for gamers because we don't get to experience the genuine human connection that comes with hearing a real human being behind the characters we enjoy.\n\nI played this game nearly every day until a few weeks ago, when I learned about all this. I was excited for ARC Raiders, too, but haven't bought that game and won't until these AI-generated assets are removed. I haven't touched an Embark game since I learned about this. And you shouldn't either.\n\nThe Finals is a phenomenal game, that you shouldn't play because it shows devs and publishers that this is the kind of artistic nothingness that gamers will accept.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I used to love this game! but my mate sent me a screenshot... showing a wall hack and aimbot that he purchased... He told me that it was pretty easy to find one and was kinda proud of it. He's been playing with me for a while and just thought he was very good at the game... Well now we're not friend anymore and i stop playing the finals cause of that : (",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "every update the performance gets worse, cant even play the game anymore without play at 50 fps",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "When this game first came out it was a breath of fresh air compared to worn out old FPS games such as RS6 and COD. It had a fully destructible environment players exploded into coins when you shot them. It was fun it was random it was crazy. Now the devs are trying to turn it into an Esports title, and it just doesn't work. When you make a game competitive you alienate a casual playerbase and this game might be the greatest demonstration of that. It upsets me that this game the first real breath of fresh air for the FPS market in years is languishing in obscurity while the same studio soars to popularity with Arc Raiders which is possibly the most boring generic extraction shooter of all the time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So they are asking me to waste 60 gigs on this dogshit game? Its the same thing over and over and seems like an inbred mix of valorant and cs2. Would not recommend this game to anyone.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "WELCOME TO THE FINALS the laggiest frame dropping piece of shit game to ever come out. embark fix your laggy ash servers its been two years and i still frame drop to 1 frame every other second. 2/10 game would not recommend to anyone. HORRIBLE LAGFEST GAMEPLAY EXPERIENCE",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Most ridiculous aim assist of any game ever made. Zero foot step audio. Otherwise, decent movement and lots of potential. Unplayable as is however.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unbalanced Light class (everything), each player can have a sentry (impossible to do anything). Major mouse sensitivity bug (too low at 100%). QOL Hell, don't recommend. Just saw it uses AI for voices, I doubt it stops there.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Utterly unplayable without 3 stack on comms. Matchmaking places sweats against casuals and ruins any fun new players could have. Learning curve is already steep and skill ceiling is infinite. Melee weapons are horribly unbalanced, allowing invisibility and assassination or movement speed and throwing knives that three shot Meds. One of the worst games I have ever played.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They need to fix their game, so many hackers on deathmatch mode, who aimbot, and wallhacks, able to track where players are on the map, as well as sniping them accurately from a distance, fighting low level lights at level 16 who rack up 30 kills in a match, isn't what i call normal, when they're rushing in and popping off multiple kills.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this sh1t is so ass, after they updated it the game wont even f3cking launch dude yall really f3cked ur own sh1t game up go f3ck urself finals F U",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played a LOT of the beta when it came out. The game was very fun. I would enjoy the game way more if the AI narrators were removed and replaced with their original voice actors. To me, it's a very slippery slope to allow genAI content in video games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Says inappropriate hardware is detected but only have a razer keyboard and mouse, as well as logitech speakers. Bummy game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You can't make a good competitive game with 3 teams competing. You need the \"mors tua, vita mea\" mechanic in place. For the rest, at least, compared to other modern \"shooters\", here you at least get to shoot a bit instead of looting for 2 hours.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "after the tutorial it put me in a match with sweats this games matchmaking is dogwater in my opinion same with cod",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So many bugs, terrible player base and unfair matching. Embark doesnt care about their players.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game runs very well and physics are top notch. But this one bug goes back to launch with mouse being to slow no matter the settings. There is no fix and no official statement on the issue. Mouse set 100% and tried many different DPI settings on mouse itself. So this is intended by the devs at this point or they don't care. To people like me the game continues to be unplayable with such slow mouse movement.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Meta is Light guy with sword beats everything and hit reg sucks for guns and bullets don't do damage, grenades are laughable, every skin is 15$ and there's barely any players\nNice thing is the map destruction but that's it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I do not support the studio's use of AI in their development process. It's a shame because they are genuinely talented developers outside of that. I hope they come to see the dangers and drawbacks of their use of AI, but I do not think that is likely.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is an actual pile of dogshit and the proof is in the fact that this game has had the same 12k player count since i first found this game in S2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game fell off. take out hook and melee's and we will talk very soon. bitches",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "these guys made arc radiers and that game is a lie, shot in the back simulator so this is me downvoting it twice",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "not worth it TOO MANY smurfs and the game gun balancing is SUPER ASS",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game took like six hours to download and i can only enter games some times and its really fast game play for how laggy it is. valorent is faster and i find it more fun because I can actuialy play it my pc may be bad but it can run alot of stuff normaly i can load 3 games at a time but this game i cant even load it with my browser open let alone steam its self. I play it for my frinds tho",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As soon as I ran into someone using swords spamming deflect on all attacks I uninstalled. Trash game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible game\nevery player has only one weapon no secondary\nand the worst thing is the matchmaking complete trash\nput the server offline and only make this game available again if you have fair matchmaking\ntrash devs",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Why isn’t there any extraction, default point capture, a bomb mode like in CS, a battle royale, or team deathmatch? I look at this bank mode and I honestly don’t understand what it’s for, what the point of it is. Give us at least something a bit familiar so it’s easier to get into the game, because right now it just completely throws you out of your comfort zone and any chance to compete in PvP. You either spend a ton of time figuring everything out so you can wreck people, or you just get wrecked, and I don’t have the time to no-life this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Do NOT believe the positive reviews. They are all bought and paid for. The fact that Valve isn't enforcing the fake reviews. This game was never good. It's been 8 seasons and the game still has the same problems since released.\n\nThis isn't a first person shooter, it's another FPS MOBA much like Overwatch but worse. The game is designed for children and especially for those type of people that are outright bad at FPS games. The game balance is awful. The weapons that should do the most damage such as shotguns, mines and grenades do the least damage. I can walk over 3 land mines and still survive. This essentially makes it outright useless. The minigun which is the most powerful LMG in the game takes 20-30 seconds to kill a single player. Unreal. This removes any and all consequence of having to take cover, dodge, chokepointing, you don't even have to aim in this game because the melee aims for you.\n\nThe servers and netcode are awful. For a game that only have 9 players at a time, I take phantom damage 5-10 seconds after the enemy is dead. I was able to confirm this after I was still taking damage and even chip damage even though I win my 1v1 fights and there is no one else around. The server is compensating for lag even after the fight had finished. I am shot at by players not visible on my screen, all close quarters combat are essentially useless. Players are not visible and no matter how fast, how great your aim or sneaky you are. The game lags behind by 3-5 seconds of your actions. I never tried so hard for such a broken modern game.\n\nIt is simply Apex Legends all over again. A 15 to 30Hz tickrate in a modern 2025 game. Apex Legends has a 15Hz tickrate in 2019. Battlefield 4 had a standard 60Hz tickrate in 2013. Battlefield 3 had a 30Hz tickrate in 2011. Overwatch is 64Hz in 2016. I can be shot by a literal LMG from behind and the server won't play the audio. The game has great graphics, visuals, art design and sound. It is of course: not fun to play, it takes 10-30 seconds to kill one player. It makes the game into an absolute chore at best. The fact that all weapons take 15 seconds on average to kill a single player. This essentially punishes skilled players and forces to to play at your worst and not your best.\n\nI am using a $5K gaming desktop and it is atrocious how nobody uses dedicated servers anymore. We have regressed, not progressed further. A video game dark age. I want to enjoy this game. I really do. I simply do not have the patience to be playing low quality servers. Don't waste your time. If you are at the age of 30+ and remember fondly of the golden age of FPS games such as: Battlefield, Call of Duty, SOCOM, Gears of War, etc. This game isn't made for you. This is a MOBA disguised as an FPS game.\n\nIt's exactly what I predicted. Every AI search engine came to the exact same conclusion.\n\nGameplay and balance\n- Movement: Critics describe the movement as slow, clunky, and \"not even close to a Cod run speed,\" even after adjusting the Field of View (FOV).\n- Unbalanced classes and weapons: The Light class is frequently mentioned as being either \"cheese\" or frustrating to play against, with some weapons like the AK being overpowered. The Heavy class is also sometimes called too strong.\n- Time-to-kill (TTK): Some players feel the TTK is too long, and they run out of ammo before they can kill an enemy team, while others want shorter TTK to make it more casual.\n- Game modes: The objective-based game modes are seen as potentially problematic and less interesting than a more chaotic, casual mode like team deathmatch.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "No solo play and horrible matchmaking. Other than that, it's cool.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's free, and kinda fun, but it has to much destruction. Siege had a better balance. It's fun for a few rounds, but gives me a headache and doesn't let you build up a strategy that's very deep.\n\nAlso why is this game so blurry? I can't see anything. You should play it, might be fun, but it is lacking.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": ">reinstalls the game after like 2 years\n>keeps getting killed while invisible\n>asks in chat veteran\n>says people with rtx on can see you\nbruh\n\nBRUH",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Goofiest shooter I've ever played. It's like made for millennials or something? Idk, but it just feels too cringe for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DO NOT BOTHER. This is an amazing game and you will have the occasional good game if you play it right now. But progress even a little and you will soon notice that it is flawed for several reasons. The main one being invisic**ts running and dashing around with swords and daggers and you not being able to even fart before you die. Then it just becomes a game of spawn, die, spawn, die etc etc. I would play this game some more but they have ruined it with stupidity. Even going to pick up a vault, then instead it reloads your weapon and you're just left standing there like an absolute ass. Or the gun just decides to reload randomly or you drop an item without even pressing Y. Just really stupid crap. They really need to make it so you are forced to have one of each class in a team. I.E Light, medium and heavy. The fact a team can just all run around as light class absolutely spamming you with invisibility and daggers and dash ability is just gapingly idiotic. Such a shame as like I say I think it's a fantastic game otherwise. It has now become a love/HATE relationship for me on this one. Play at your own peril. Until they tweak the classes and fix some other small bugs like swords having ridiculous area effect damage and all of my HUD objective and player icons disappearing until I kill myself and get revived, this game sucks anus.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dont buy bad game\r\nlag out three quarters of the time\r\nother than that decent\r\nembark sucks",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Solid game. Great gunfeel. Beautiful environmental destruction. Cool themes and cosmetics. I don't usually do competitive shooters, but this had me hooked for a while.\n\nBut at the end of the day, they have shown they fundamentally cannot be trusted. They use generative AI. Yes, they were upfront about this. But so are registered sex offenders moving within range of a preschool, and in both examples, I am ultimately not okay with either one. Being upfront about one's sins does not excuse them. They have admitted they will cheat and cut corners, and so Embark (and their parent company) cannot be trusted to not cheat elsewhere, or worse, leverage the user agreement, broad permissions accepted in good faith, to harvest more than the necessary amount of personal data.\n\nThey allegedly paid the VAs per line anyway - then why not *use* the VAs? It's boggling that Embark would wilfully tar themselves for no particular reason - unless they haven't told us the real reason, concealed by a lesser admission.\n\nIt's a colossal, immovable black mark on an otherwise amazing game, a great shame.  The day Embark removes all generative AI content and forswears it, I will forgive them and change this review for the better. That said, with Nexon at the helm, I have zero trust they'll address any concerns and they'll plough on, continuing a string of Swedish studios shooting themselves in the foot at the eleventh hour for no reason.\n\nObligatory Fuck Nexon, it burns me to see even a single dime go into their shitty pockets.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I HATE THIS GAME SO MUCH IT QUITE LITERALLY MAKES ME WANT TO PUT A CUCUMBER UP KECKLER100'S LARGE MOTHERS BEHIND, IT ALSO MAKES ME WANT TO THUNDERCUNT A CHILD OUT OF A BUILDING. overall 10/10 would not reccomend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Had to go afk during the tutorial, got some errorcode and I get thrown into a match with OPEN MIC (who thought that open mic is a good default setting???).\nNo matter how I adjust my settings I'm stuck at under 60 fps for literally no reason, despite my cpu and gpu only using 50% of their power on the lowest setting. How am I going to play a competitive shooter at under 60 fps????\n\nInstant Uninstall",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nah, I can't with a right mind defend or recommend a game made by cheapskates using generative AI.\nThe industry is gonna go to shit even harder if we don't start complaining.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "They will listen and moderate your voice chat to teammates.\n\nThis is some 1984 Big Brother level BS\n\nAlso TTK is shit",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hits not registering. Could be firing point blank at a still target and will not get a hit.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Need a NASA computer for playing with stable 60 fps lol\nconnection error",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "balance: 0\nskins: worth over 999 for $\nno wonder the game has 6-10k online\nasian publisher + former ea & dice devs = a bad combo",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is so good but big problem imo is the melee weapons. I don't want to play against melee that dominates in an FPS.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is the worst shooter to ever exist, do NOT use your time playing this garbage game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bugs everywhere — feels like the devs coded this during a blackout. Matchmaking? A crime against humanity. You’ll get thrown to pros while still figuring out which button jumps. Crashes more than my GPA. I spent real money on skins — not to play this pile of crap.\r\n10/10 would uninstall again",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Started game.\nCouldn't change any settings.\nShaders become compiling.\nTutorial began downloading.\nTutorial failed with an error.\nSome kind of match began.\nGame stuttered-farted.\nTurns out all my settings were \"Epic\", while my PC isn't \"Epic\" to todays standarts...\nMaking everything low, didn't help at all.\n\nMy CPU was 100% the whole time.\nAnd my whole PC got paralyzed several times during all of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The most booboo ahh corporate safe game ive ever played hated every second of this game its not fun at all NEVER PLAY THIS. FOR AN E SPORTS GAME with no personality at all btw ITS NOT OPTIMISED AT ALL 0/10",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "horrible teammates. survival instincts of a fart. dont know how to play the game and cant aim for shit.  call of duty been out for 20 years and you had to 20 years to practice ur fucking aim you nimwit.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}