{
  "positive": [
    {
      "review": "An ok game... the biggest issue I have is the monetisation, the in game currency is ridiculously expensive for those of us belonging to the African continent. They'd make a killing if they adjusted for certain regions, I can't justify exchanging a week's worth of groceries for bouncing pixels.",
      "voted_up": true,
      "votes_helpful": 275
    },
    {
      "review": "For a casual gamer you can spend a lot of time enjoying the game without spending any money.\nSome cosmetics can be earned through missions from the free sections of the Battlepass etc.\nSome grinds for materials or weapon components can be extremely annoying in later/end level content. We're talking about running the same missions 100s of times to get the neccesary parts or materials.\nBut you can ignore them, fully upgraded wepons are not a neccessity.\nIf you can leave that mindset to the hardcore grinders and you'll have an enjoyable time.\nSame goes for the cosmetics that cost real money.\nDon't expect any kind of organized squad-based combat, unless you bring your friends into the game or missions.\nThere is no real communications between players in a team albeit not really neccesary.\nApart from maybe when new missions or Bosses drop and and haven't been made easier yet which inevitably happens in a patch a few weeks later.\nIf you're the kind of player who wants to while away a few hours in a mostly single-player game with occasional random team-based missions then it's totally fine.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "< MIXED REVIEW >\r\nThe game play is awesome and graphics are stunning. The weapons feel great and mechanics are easy to understand. Although I feel as if the game is lacking more open world. It seems very grindy and repetitive  grinding the same dungeon over and over 10-15 times hoping for good RNG with your loot table. There are a massive amount of upgrade items and when examining the item they do not explain how to use it, so you could be stockpiling items that you could use but have no idea how to. \r\n\r\nIn summary it is a great and beautiful shooter with massive potential. It does have a large learning curve and can be repetitive.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Game is alot of fun to spend time in. If you enjoy a casual looter shooter, with beautiful characters and fun gameplay mixed with great shooting mechanics. If you dont take it too hardline then this is a wonderful game to spend some time in and casually grind out things you want, while playing some sexy characters.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☐ Good\n☑ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☐ Big\n☑ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Great Third Person shooter gameplay with grappling hooks\n\nGood music\n\nStory is fine, but storytelling is a bit dull",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "No pay wall, no pay to win, everything easily obtainable, no FOMO, free premium skins from time to time, free farmable skins. \r\nThe only problem is that it runs out of relevant content too fast (cause ppl complain when things take long..)\r\nBut they will address it soon so the game will be perfect.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I would say the game is great for the first 500-700 hours.\n\nPositive:\n1) Variety ( You've got builds to try out, areas to unlock, descendants, weapons and pets to get etc. )\n2) Good graphics\n3) Decent gameplay and different mechanics\n4) F2P\n5) You can earn the premium currency, caliber, through the new trading system\n\nBut when the honeymoon is over, you're starting to notice some cracks.\nNegative:\n1) The story is terrible\n2) FOMO\n3) The game doesn't respect your time ( Whether we are talking about too many materials to craft something, the long research duration, drop-rates etc. )\n4) Difficulty seems to translate to just giving enemies more HP\n5) Balance issues\n\nI don't enjoy the game anymore now. But I think I would be a hypocrite to downvote it after playing it for over 1000 hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty solid loot shooter, if warframe is yours then may give this one a try \n\n---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☑ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☐ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☑ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Average\n☐ Long\n☑ To infinity and beyond\n\n---{ Price }---\n☑ It's free!\n☐ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☑ 7\n☐ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "On release, I personally believe the developer was still experimenting on design decisions. Obviously, the game has come along way since release and way better with many QoL updates (some of which from the problem they created in the first place).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For those who play games similar as Warframe, Destiny etc. You'll know the basics for this game already but grindier than Warframe. If you're up for it, take it slow and look up some guides for your favourite descendant.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a lot of fun to play. And there's soooo much content and they just keep adding more. The cosmetics are kinda expensive though.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The story is meh.. the \"Plot\" is thiccc. The gameplay is repetitive.. Its basically warframe with tig ole bitties. 10/10 would spend another 24 hrs straight grinding resources to spend them all in about a minute ( '-')b",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Boobie central but the game mechanics are actually very fun. It is like Warframe but less complex and more boob. But still plenty complex in a fun way.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Great game. Really don't have much to say negative other than a suggestion to make drop rates actually match their percentiles. Did the same mission that said 25% drop rate 18 times and got gold at least 13 times",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played this game a lot over the past year and some change. I love the core gameplay and grindy nature of the game, but I feel like there is a huge disconnect between the developers and the players. They keep changing the way items are grinded or increasing the time to grind them. They also keep releasing content that is super challenging to complete in public lobbies as many players don't have good builds. This means all the damage is done by you or you and one other person. \r\n\r\nI'm hoping they'll learn from their mistakes and use it to help influence new content, but I feel like this is the fourth time I've said that in the past 6 months. Overall the game is good, but the developers could easily kill this game if they don't make some important changes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recommended for the gameplay. Monetization is a bit greedy like every other Korean MMO.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My personal likes and dislikes for this game currently are...\n\n+ Fun Third-Person Shooter Gameplay\n+ Weapon and Descendant Collecting / Upgrading\n+ Everything is earnable except most cosmetics\n- Game can get too grindy\n- Cosmetics are overpriced\n- Some cosmetics are only available for a short window\n\nThumbs up for now, but just barely.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "gooner game, 10/10, jiggle physics are amazing. GF approves. Troll review over, this game is one of the best looter shooters ive ever played (i'd even say its better than destiny 2), definitely going to invest more time and let you all know how much of a degenerate i become playing this :3",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "I love the atmosphere that the game provides. I can get lost in the world and enjoy the story it tells!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nexon has delivered some engaging titles in the past, and my initial experience with The First Descendant was great. I have already logged a considerable number of hours on the Xbox version.\n\nHowever, a part of me wishes Nexon's best shooter, Combat Arms, was still around, even though they sold it off.\n\nThis particular \"shooter looter\" feels and looks good. The core issue that may be hindering its potential is its Free-to-Play (F2P) model. As is often the case, free games can become more expensive over time than a single-purchase title.\n\nMy recommendation is to enjoy the game while you can. If you start feeling pressured to buy in-game items or resources, consider the experience complete and simply uninstall, as I did previously.\n\nI am currently revisiting the game after a year-long break, though I've noted that recent community reviews are not very promising. I will continue to adjust this review as I play and progress.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As with any live service MMORPG, The First Descendant is an ever evolving experience with each subsequent season update adding more depth to it's ever changing systems. The characters are fun to play as with each sporting their own unique skill sets and play styles. The looter shooter elements while not as wacky with the random stats as most other contemporaries, does have some depth thanks to new systems introduced during the games life cycle such as the adjustment system and weapon core systems. Heck the shear variety of systems layered upon each other definitely means that though you may find a meta build online for a character or weapon, chances are thanks to RNG, your build will still be slightly more unique to just you and I kind of applaud the developers for that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Had its ups and downs, but it is a pretty good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun gameplay, and is fun to grind for hours on end.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I decided to try it...and is free game and looks stuning compared to 90% of paid games. \nPerformance is I can talk for PC version... very decent/normal (I play on Ryzen 7+RTX4070Super and 16GB RAM) game runs amazing. \nNo matter what other say, all pay content is just cosmetics other is ALL FREE! Story is good, Battle pass is OK, login rewards are on place too, events are here and comunity is friendly. The game is repetitive in one point, monotonous at times, but ...almost every Korean game is like that. At least the characters are VERY beautiful (both males and females) and don't shove Woke/LGBTQ+ in your face now and then like most games today. \nPlayers simply forget the sad and bitter feeling of paying a lot of euros for all the DLCs, only to have it taken away from you a year later, without you having a choice. There is no paid content in this game that they can take away from you.\nIn the end...Very good graphics, nice and dynamic gameplay with unique characters which you get for free....I highly recommend it!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The real world prepared me well for this game, i spent half my time on my knees and waiting for someone else to come over",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Review at 215 hours later\r\nContext:\r\n- Having played at launch and droping it at 2 - 5 hours, picking this up after a year or two went by.\r\n- Having played warframe at launch at 200 hours then droping that.\r\n\r\nAimless review :\r\nHonestly, I really can't help comparing it to warframe. \r\nThis is basically goonerframe, warframe which caters to gooner taste. \r\nThat's not a bad thing though. \r\n\r\nI find that be the main motivation to actually playaround with the actual mechanics.\r\nOn warframe, more often than not i am not quite motivated a new frame with squigily looks came out to even try farm and play it. Early frame looks human, i remember zephyrs/mesa is the last one that look a bit human.\r\n\r\nOn farming note, its korean and its a looter, what do you expect eh. \r\nGood news the the endgame \"island content\" is pretty small compared to warframe, so getting all the ultimate/prime version is not painful at all, at the time of writing that is. \r\n\r\nBasicly daily dungeon rotation, active players will somewhat swarm it, I often get a good match, get loot, or not, repeat until i get everything and min/max as per usual looters, and then go to town with most recent/hard content, and repeat again for each character i like. \r\n\r\nOh yeah, gripes :  \r\n- Open world as per usual kind of meh on the relevancy side.\r\n- Early content have no fucking players on it, pretty basic to breeze though. Its just that, you will be disconnected with the rest of the player base until endgame.\r\n- Shit ass cosmetic monetization, I am talking about the godamn paints, not the skin. \r\n- Whats up with all the ultimate having a godamn bell helmet. \r\n\r\nNote : \r\nAt the time of writing I get a free selection box for ultimate character, get viessa, proceed to beef it to farm the most [strike] broken [/strike] efficient character. Profit. Will continue gooning",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very fun game it is like the game borderlands and i'm still new to it but i am having a lot of fun playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not perfect but I'm enjoying the game alot. I like that you can farm and max out a character in a few day. No gacha bullshit no stamina gating. You can earn everything from just playing the game. My only gripe currently is the ancestors module being rng bullshit with no real way to farm outside of weekly lockout and the cosmetic being too expensive (about $20 per skin).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time i try a looter shooter game and it's really good actually",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, strong story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I honestly liked this game a lot. The gameplay was smooth and fun, the grinding needed to progress in the story wasn't too hard nor too easy. The diversity of the descendents is also quite unique (Ultimate bunny is the best ;) ).\nThe worst thing is monetisation tho. Everything is soo expensive and there is stuff to buy in everywhere. It's honestly too much at this point.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What you are about to read is me mimicking the negative reviews, and how they are actually summed up to show that negative reviews are a bad indicator if you are using them to decide to try this game, or to pass. This game if given fair chances by the majority would be sitting at 80%, or higher. I've written it in meme format for your enjoyment.\r\n-\r\nlaunch day\r\nstandard online-game launch chaos like long shaders, or loading\r\nnegative review forever\r\n\r\ndies to a boss once\r\n“P2W!!!”\r\nshop has zero power items for sale\r\nnegative review anyway\r\n\r\nBunny exists\r\ngame marketed Ultimate Bunny skin before launch\r\ndownloads anyway\r\n“GOONER BAIT, WHY NOT HUSBANDO BLAIR STRONGEST CHARACTER, WHY FEMALE CHARACTERS GOOD”\r\nnegative review + forum spamming until the eventual forum ban occured\r\n\r\neverything 100% free, and farmable\r\ntons of free descendants/weapons via events/logins\r\nplayers max everything after binge farming for a week → “farming too easy, nothing to do now”\r\ndevs add Sword grind\r\nsame players: “grind too hard”\r\npeak irony\r\n\r\nWarframe vet\r\ncompares 2-year game to 12-year game\r\nforgets WF’s year-long droughts, decade-old bugs, recycled events\r\n“TFD no holiday events”\r\nwhile picking up free stuff from login + city full of decorations\r\nnegative review\r\n\r\nplayers compare TFD to Destiny 2\r\nDestiny: $60 base + $40/year expansions for story DLC\r\nTFD: ZERO paid DLC, every story episode/season/update FREE forever\r\nstill whining \"no content like the games I paid $100 for\"\r\npeak hilarity\r\n\r\nplayers scream “we need complex mechanics”\r\ndevs add orb order and sigil puzzles\r\nrandoms break everything, wipes team by activating random sigils\r\norbs mechanics gutted in a week, sigils butchered\r\nsame players “why everything just shoot, game braindead”\r\n\r\nnew skins\r\n“STOP SKINS, MAKE CONTENT”\r\nF2P game\r\nNexon's other games norm: pay money to not explode gear\r\nTFD: zero-risk maxing, cosmetics fund everything\r\nskins made by separate team who aren't involved at all in the content\r\nstill mad\r\nnegative review + spam same skin comment on every update/X post\r\n\r\nplayers hit endgame\r\n“my build clears everything too fast”\r\nit’s a PvE game\r\ncan unequip mods/nodes/energy to make self weaker in 10 seconds\r\ndoesn’t\r\nstill screams for global nerfs that affect everyone else especially new players\r\nnegative review\r\n-\r\n-My personal honest opinion of the game-\r\nThe game is excellent, absurdly generous, and still new but growing at a nice pace. If you spread out the updates when they come out you'll find that you can play it for a bit every day, and obtain everything you desire with no stress, and plenty left to do in the game! Most negative reviews are people who got mad at something as ridiculous as what I typed above, and will never come update that review even if they kept playing the game afterwards. I suggest you try the game yourself with that in mind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "⭐️⭐️⭐️⭐️ 3.5/5 — Fun but grindy\n\nThe First Descendant looks amazing and has great gunplay, but progression is slow and repetitive. Co-op and boss fights are the highlight. Worth trying if you enjoy looter-shooters.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing graphics and gunplay is satisfying BUT:\n1) mission are way too repetitive\n2) enemy variety and intelligent is ridicolous. They just rush in waves to you waiting to be killed. \n\nThis two elements combined make the game boring just after completing the first season quests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you have a lot of time to waste, I recommend playing this game, because the newer the content is, the more the drop rates become bullshit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a good game.\nHopefully the studio releases new and original missions, perhaps based on solving puzzles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good, farming is moderate, luck is essential though, so beware.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall i like the game, does have a lot a of fan service but overall like the expanding storyline, different playstyles and characters.  The game doesn't feel like it'll take yo a lifetime to complete but isn't by far easy. I like that only premium skins are locked behind a paywall, yet everything is grindable and play a actual free to play game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are a fan of grinding (so much grinding) out characters, weapons, mods, etc. This is the game for you. Allows you to grind for all characters and weapons so you don't have to miss out as a F2P player. But they give you the option to swipe and skip research and purchase the ultimate tier descendants without gathering the materials. Lots of different character builds and enough mob density and daily's to keep the game interesting. As long as the keep adding content I think its worth jumping into. \n\nDownside: \n-Drop rate and material success rates are WAY TOO LOW. \n-Kernel level anti cheat installed in order to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After hundreds of hours in TFD I must review this game and yes, despise all the negative things several individuals can say about TFD, this is a VERY solid game that I recomend to anyone.\n\nAs you can see I possess thousands of games (many of these AAA+ in PC and all consoles), so why would I spend my time in this one? is really easy and I will list the reasons:\n\nThe GOOD:\n\nIs F2P, if you like it you stay, if not, you can leave \n\nThe game has some impressive visuals, a lot more than supposed AAA games for $80 USD, every single soul who had been in my house while playing this were absolutely surprised by the quality of the graphics in my 98´´ screen \n\nThe gameplay is VERY fun and UNIQUE, there is no other game in the market that offers this wide variety of gameplay and characters to choose; fire, ice, water, toxins, firearms, this game have ALL.\n\nThe controls, abilities and weapons feels AMAZING and is compatible with console controllers.\n\nThis is basically what we wanted back in 2007-2015... a PvE Gears of War / Halo Sci Fi crossover, where we can fight hordes of Locust / Covenants... I mean \"Vulgus\" in solo or with a squad, face giant Bosses in fierce spectacular battles.\n\nYes is a F2P game with In-Game transactions, but is a very fair one and they sell things, skins and costumes that the consumers actually wants... so I gladly pay them for things I love but if you don´t want to spend a dime in the game is possible to have ALL the characters, partners, weapons and vehicles for absolutely FREE and without a lot of effort unlike basically all F2P games out there. Is a Looter Shooter and you need to do missions several times to craft things or pay to get inmediate access to all... is very simple and fair.\n\nYeah, I will address the elephant in the room... this game has the most BEAUTIFUL female characters in the industry and I am not afraid to say I arrived this game beacuse of that but stayed for everything else. And yes, all the male characters are absolutely handsome as they should be as well, everyone are pleased here. \n\nThe Devs has the guts to sell skins and outfits the consumer ACTUALLY wants, sexy, yet very classy outfits, emotes, spawn animations, etc... and I am glad if they continue to do it. If you are somebody who is offended by female beauty or sexy skins do yourself and everyone a favor and go play other thing.... of course, IF that other thing still has active servers, since most if not all woke propaganda games are doomed from the start.\n\nThe collaborations are great, so far we already have Bayonetta and Nier Automata skins and they are stunning. \n\nI love the Photo Mode and since the graphics are INSANELY GOOD you can create pieces of ART in any place since thei game features all biomas and all of them are beautiful\n\nThe Music... this game features several musical compositions and many of them are AWESOME, my respects for whoever made the Luna´s Song since it got released I couldn´t stop hearing it daily at least once. \n\nBeside that, they managed something rare, they created characters with a SOUL, we CARE about these characters, their story, their motivations, their personality and whatever is happening in this world, they are not just sexy \"Barbies\" or \"Kens\", they are characters we can relate or care for, this is something I couldn´t feel since the world that OverWatch built back in 2016 and previously in TF2 or L4D years ago, and I am grateful to experience this again in TFD. Also the cutscenes have such HIGH quality that are EPIC to watch and relive whenever you desire in real time also.\n\nThe \"End Game\"; I had seen several complains about \"this game only knows to release skins but no playable content\"... let me tell you that is NOT TRUE... I am a player since the Pre-Season and I polay daily and ALWAYS have endless things to do or craft and the Developers are constantly updating the game with new dungeons, bosses, areas, weapons, comrades (Dogs), Vehicles, Modules, etc etc... to keep both, new players and veterans playing.\n\nThe Devs are VERY transparent and are always on touch with the community hearing their feedback and updating the game accordingly \n\nThe community is one of the BEST ONES I had seen in my life; most players support each other and are actually helpful which is absolutely RARE in this time and age \n\nAnd finally, yeah the game is VERY ALIVE and with a healthy player base, don´t hear any \"doom\" review from Kotaku, The Gamer, IGN or few others who says the game \"is dead\" or \"will die in X months\" just because they HATE any game with beautiful female characters in it; the game already developed a loyal fan base of gamers who enjoys this and keep playing it; I play this daily and always find matches in SECONDS, no matter if I play on day or in the middle of the night and this won´t be gone in a good while I have faith in the future of the game.... and you can see it as well, TFD is always in the Top Games that gained more money every time they release new skins or a new season or a collaboration.\n\nThe BAD:\n\nSome characters are getting unexplainable nerfs (like Ines) in a PvE game which is ABSURD and unlike at the start of the game, now all characters are viable but the power creep between some of them is INSULTING specially on PUBLIC matches where the HP of bosses are upgraded to the max... a Serena, Harris, Viessa, Luna or Hailey with a Mediocre build are 1000% times more powerful than Valby for example, specially against Colossus, Bosses or Mini Bosses and needs an URGENT BUFF, and several Descendants are in that bag right now.\n  \nHaving to play over 9000 times the Void Vessel or the Hyper Mega Super Massive Conductor stages to craft a weapon is NOT fun or logic, but YES I clarify these dungeons are right now End Game content and are part of a VERY RECENT tendency which I expect the devs to abandon in further seasons; before that you can still get weapons and characters EASILY.\n\nI have to say it... 90% of the time you WON´T get any damage or performance remotely close to the build you just saw and replicated 1:1 from a YouTuber. Why? I still don´t know why. Is disappointing but we must keep going.   \n\nAs the number of Descendants is growing the Devs said they will make LESS universal skins... but I think is just a cheap reason to sell individual skins for more money, still if they are sexy and good looking ones I will keep supporting them. \n\nThe UGLY:\n\nBack in november of 2024, The Devs tried to sell us UGLY Concord-like skins (ugly and covered the full body of the females) and the whole community rejected them immediately, they asked for forgiveness and since then they had been doing \"good\" skins... so I advice to forgive but NEVER forget and stay alert in case they want to try something funny. \n\nOVERALL:\n\nI give this game a solid 9/10 for what it is and offers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The First Descendant is a pretty generic 3rd person looter shooter with a lot of elements borrowed from Warframe. \n\nYou play as characters called Descendants, each with their own set of abilities, who must be researched by replaying content until you acquire their research blueprints and requisite crafting materials. Weapons must also be researched in a similar manner. Once you have your desired Descendant and weapons, you can outfit them with mods that increase your stats and apply other enhancements to further increase their stats, often to absurd levels.\n\nThe main downside to the game is how easy it is. The devs seem to lack any cohesive direction for the game and are scared of nerfing anything that is too strong after the community revolted when they tried to nerf Ines, who was a new character that could just about kill every enemy in a dungeon on the very first frame after they spawned in. Ultimate Freyna's rework and Serena and Ultimate Luna's releases have done little to inspire confidence that they will turn that ship around.\n\nCoupled with the lack of difficulty is a lack of depth. Unlike Warframe which has like 15 years worth of content to play through, a lot of the new content in TFD feels very shallow. Everything aside from the Colossus bosses, which are a real stand-out feature, is basically just a series of hallways with enemies of varying tankiness depending on the difficulty that rewards you with a box that can be opened for a chance at a research blueprint.\n\nThere is no aspirational endgame at this stage like a Raid or really hard dungeon, so the \"goal\" is basically to just collect characters and weapons until you get bored or new content drops.\n\nThe main upside to the game, aside from the Colossus fights, are the girls and basic, but solid gameplay. If you like this kind of game then you can easily be satisfied for a few dozen hours and even longer if you have friends to play with, which can be done completely for free. If you're willing to spend money then there are bunch of buxom ladies just waiting for you to clad in skimpy outfits and admire in photo mode with varying levels of jiggle physics. You should be warned that the prices are pretty high for this type of game: skins run in the range of $10-20 each and the purchasable upgrade materials are a lot more expensive than in Warframe.\n\nIf you do end up bouncing off of the game then there's plenty of...ehem...[i]art[/i] of the characters that you can look at. If you know what I mean...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a good game by story and graphics  but it's a little bit pay to win . I can give it 8 out of 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s fun for a time. It’s not something I think would hold your attention long & I wouldn’t recommend spending much money until you’re sure it’s for you (mainly cosmetics). Aesthetically, it’s really pretty and the play style is pretty simple in my opinion. Space, boobs, butts and guns w/ special abilities. I feel it’s better to play with friends. Last I played it was super grindy though, so that might be a turn off for some. However, it’s a free shooter so try it out if you’re curious. Won’t cost you anything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On initial release, this game had a serious drought for content but with a tremendous of developer attention and love, this game is really beginning to come into its' own.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For some reason, the game got me engaged for a longer while than I expected.\n\nGameplay is very satisfying, yet it may be repetetive at some point (as with many other games of this type). Characters are somewhat diverse and are new are being added every so often. My favourite is Ultimate Luna (music style dps/buffing - I really love the tunes). Weapons are kinda standard, many types with typical features (some excel at AoE, some at burst, some have other unique effects). \n\nThe game is very similar to Warframe in many mechanics (collecting pieces to create characers/weapons/compantions, power upgrade by installing and levelling mods, research is like foundry, missions on instanced maps, etc.). \n\nAnd obviously if you like Asian style female characters, the game is definately for you :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Warframe grind style with hot waifu. I think the game is decent overall, although the content could be improved. However, the developers are making an effort to diversify it in the future. At least they recognize what is lacking and are attentive to players' feedback.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy this game, my only complaint is ive been grinding for the the husky catalyst for almost 2 months and i can not get it to drop in rewards in axion plains. Its annoying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with HUGE content as f2p , the MSQ is not that great until the season 2 but its better and better , everybody can be happy with tons of different build to make and each Descendant as his/her own gameplay and its more begginer friendly than Warframe to me and by far , there is none restriction about the farm you don't have to spend any €  the shop is more for cosmetic , emote , some effect etc and the optimization of the game is great as well , anyway nothing bad to say about this game only good things !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, i find the mods allow you to make interesting builds with the chars and weapons",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you want an alternative to Warframe or Destiny then The First Descendant can definitely offer you a similar experience that's still different enough to carve out it's own slice of the looter/shooter pie. \n\nAs you no doubt will have seen or heard from others, this game does not shy away from offering plenty of fan service so if that's not something you're fond of seeing in a game then this might not be for you, but for those that do not mind or like it, then you're in for a treat!\n\nThe gameplay loop of leveling up and acquiring new gear is addictive and rewarding, nothing feels impossible to achieve or obtain. They also have added a pity system so that you will eventually get what you want after enough attempts, so your time doesn't feel wasted.\n\nI would advise anyone that chooses to get into this game to play it at their own pace, do not rush to the endgame as it will take you a while to get to the endgame. It's a marathon, not a race, enjoy the journey experience the story and immerse yourself in the universe that has been crafted in this game!\n\nMonetisation in this game may be an issue for a number of people as cosmetics are not the cheapest out there, it is a free to play game so it's expected there would be a paid cash shop. Fortunately nothing sold in the shop is pay to win, It's mainly cosmetics with some boosters for exp/gold or resource gain which are time savers, there's no PvP so it's not harming your progression by not buying them.\n\nOverall i would say that this game is worth a shot to at least see if it's for you. I had a blast playing through it, the journey of gearing up, getting better loot, trying out all the characters and their unique abilities, blowing up the screen of enemies. It's a rush and power fantasy. Add to that, you have character customisation and it's a recipe for a lot of hours of fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I tried this game out cuz i saw the chars and that i seemend like a game to grind. It’s genuinely free to play friendly. You don’t need to pay anything to max out your builds. All characters and weapons can be earned just by playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game to relax to and play with friends graphics are good overtime unlike the earlier versions only problem is the rng on material drops",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I originally tried this game because I liked the characters, but I never expected it to become my main game. It’s genuinely free to play friendly. You don’t need to pay anything to max out your builds. All characters and weapons can be earned just by playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "is this fanservice-heavy?  yes.  is the gameplay loop repetitive and the content a bit sparse?  yes.  but the gunplay and skill-oriented design is pretty fun, and for the low price of free, can't really complain.  and what i admire most is the generosity - constant free event giveaways, the ability to get all of the premium descendants/weapons with a reasonable grind.  haven't spent one penny, but i've gotten everything i'd want except for the premium skins.  \n\nput something to watch/listen to in the background and just lose yourself for a few minutes or hours in a gorgeous (if albeit shallow) world with gameplay well worth the price of entry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is fun to play if you set aside the fact that it is a gooner game and every girl character (purchasable) clothes cover less then 50% of there body still a really fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game, come for the... natural attractions, but stay for the solid gameplay loop!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game, sadly it has some technical problems that limit me to not being able to play it as much as I wish I could yet, the I spend in it; I have to say the game is great and as long as devs keep on improving it, it will become way better as it continues to grow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They need to improve storytelling and gameplay loop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly not bad. It's been on my watch list since launch and if it was going to fail hard, it would have by now. Still wary about Nexon, but so far so good. The in game currency is a little pricey, but so is that of Warframe. The graphics themselves are beautiful, the models a bit on the provocative side, but you don't have to buy the \"worst\" of those skins. \r\n\r\nOverall, I find it fun - not too grindy yet and I really, really appreciate the visible mercy system. I do want to note the almost blatant copying of Warframe and Destiny in some areas. I get that this kind of game can only color within the same lines. Ultimate == Prime, but hey, as other users have stated, Warframe's engine is older and couldn't pull off the graphics The First Descendant does.\r\n\r\nTLDR: Pretty game, fun gameplay, free game that makes money off in-game purchases to make you a jiggle physics empowered badass.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game for killing time don't know why people hate on it so much, is it a little bit of a gooner game, yes. but if you can get over that its fun to kill time, just know i play on a 5 almost 6 year old pc and it stutters in some areas. game has tons of content in the terms of farming kinda but its all free unlike some games (cough cough destiny 2 cough cough)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Update broke Proton compatibility with EAC, fix it with\nLaunch Option: \nL=\"0.0.0.0 modules-cdn.eac-prod.on.epicgames.com\";pkexec tee -a /etc/hosts <<< $L;%command%;pkexec sed -i \"/^$L/d\" /etc/hosts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are a lot of unique characters to unlock all with different abilities and play styles. It plays a lot like destiny and the grind is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ahhh reminds me of scarlet blade and a combination of the division 2 its a fun game if you dont mind the grinding. And if you love skins well this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent looter shooter\n\nHowever, It fails to balance some aspects out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is not bad.\nAt first you can have a lot of different weapons and mods for it.\nLater you can get skins and pets.\nThe game is fast and fun.\nAnd no, it it not a \"must have played\" game.\nBut it is free, so if you are a bit bored, try it, perhaps it is your thing, you'll never know without trying this FREE game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great game and they keep updating it to make it nice.\r\nIts a bit like Warframe but also not. Graphics are great and mechanics fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Junk food grind game with fun gameplay perfect game to turn some music on sit back and min max characters its addicting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is good and a solid looter shooter, that offers strong gunplay and a good way to pass time when bored. However, it's issues makes the game complicated to approach and enjoy for new players and returning players. \r\n\r\n- The Grinding: Despite having many QoL fixes making farming easier, it's still immensely based on your RNG, and you can find yourself farming the same mission for hundreds of times, only for a single thing to drop, which can be draining for many. \r\n\r\n- The Balancing: This is where the game is severely lacking. Every Descendant is unique and enjoyable, but no matter how you build your favorite character, they will always be overshadowed by the same meta characters. Seeing everyone playing the same character is pretty boring and offers no diversity in your gameplay. It will always be the same characters that will just run through everything in every mission, making your entire task to just keep up and follow without doing any actual action.\r\n\r\n- Customization and Fan-service: As you can guess, this game is a huge goon fest, with settings going as far as choosing how jiggly female body parts are. You got more female characters than male characters, and skins are just there to make your hot character nearly naked. Sure, if you like playing dress up, it's pretty cool, but yeah. That's it.\r\n\r\n- Monetization: The premium currency, Caliber, is overly expensive for no reason at all, making it accessible only for huge whales. Too bad. \r\n\r\nGo for it if you're either horny, or looking for a fun game to turn your brain off and farm. 6.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bad optimization and shutters, low settings wont fix it.\nGood story, good animations, and beautiful graphics.\n\nUpdate: Oh wow they fixed it, great performance now, Thank you so much!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I genuinely love grinding this game. Rather alone or not. Doesn't help that I love all the customizations and stuff!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good shooter for mindless game play and looter format.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played during the betas, and have been playing since day one of release. It's been so fun to play, and I love the story. I keep dragging friends in to play with me because this game deserves more love! Still team Freyna, but slowly drifting to others too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, lots of characters to pick from and you can earn your way through upgrades and don't have to spend at all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall, decent mindless quest hunting. EXTREME BAITING with the skins in the game, (you have to spend real money to look the way we both you know want her too) No options to \"grind or unlock\" any skins in that caliber. Over all though, Decent Mindless quest hunting with VR Chat Room vibes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If Destiny 2 and Warframe had a steamy night of passion then left the resulting child to be raised by redditors, The First Descendant would be that child. Good 3rd person shooter with nice graphics, plus Jiggle physics.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "good game, was extremely bad when first released, but very much improved now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have a lot of fun on it, Still a noob. But it is entertaining with good graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm writing this because the game just went into maintenance for the first time since I started playing it. It was the only way I could pull myself away but I've wanted to leave a review which I don't usually do.\r\n\r\nIt's an outright travesty for this game to have mixed reviews. It's an absolutely gorgeous AAA quality game that is completely free and in my experience fun as hell.\r\n\r\nThere is no pay to win in this game. I've been playing less than a week totally free (granted I was no lifing a bit) and I already unlocked ultimate bunny and the dog companion and I am zooming my way into endgame content already with solid gear and build.\r\n\r\nMaybe it was more grindy before I started but in it's current form I've enjoyed all the farming I have done and nothing was overly difficult to obtain so far. If you have ever played warframe or runescape or WoW this will not feel like a heavy grind at all. I actually really enjoy the pace I've been unlocking things and I feel super accomplished already and only excited to keep unlocking more descendants and weapons and refining my builds etc.\r\n\r\nI haven't spent any money yet but the monetization is pretty much entirely cosmetic. I'm not being kneecapped with any game systems as a no spender. However, I like the game so much if the nier content rolled back around or something else I am interested in I will 100% spend just because I want to support the game and I want it to stay online so I can keep playing it.\r\n\r\nAlso worth mentioning I have not run into any noticeable bugs or game technical issues, pure smooth sailing for me so far.\r\n\r\nI know this sounds like a shill review or something but honestly just excited and having a blast with this game and I definitely see myself playing it for a long time.\r\n\r\nI genuinely don't know what the negative reviewers want from the game and don't know what more it can really offer short of the devs coming to your home, cooking you dinner, and offering sexual favors.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game deserves a full AAA rating. It has solid physics, excellent water mechanics (something other studios took years to get right), and a complete story you can play entirely solo - a huge plus. I genuinely don’t understand why it has so little publicity.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relatively easy game play. I appreciate most missions being relatively short, and the ability variety. I have a lot of fun with my spouse and friends because the multiplayer online is easily set up. I also like the fact that all characters are earnable and the grind is not nearly as bad as some other games. Highly recommend, as its a great shooter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is just a fap fest, copy all the worst parts from d2 and wf and all the updates are boring af and boring to do no skins for the males, toxic community, terrible balancing, reskin enemies, weapons are soo meh just used as a stat stick for the over power female charters that for some reason the dev what them dress with less and less clothing for every new female added and give them bigger tits too over all its a mid game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Run, Jump, Grapple, Shoot, and more.\r\nIt's fun, try it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its Nexon. what do you want from them? a fun game, easy mechanics, and cute waifus. They delivered. But... Its Nexon. They hide everything behind large walls, time gates, and high levels unless you pay. besides that it IS a fun game despite its flaws.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite some technical issues and end-game being grindy - still the best looter-shooter on the market.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i mean, go on download it, its only ...60gb. play couple missions, couple not more. enjoy it, savor the taste as much as you can, if you like story (kekw) its not long so ok i allow it. watch some players in capital (goon content.) and delete, save your sanity, save your time, save your wallet. dont look back, no, no, look into my eyes, look at me. press that gear icon, click uninstall. thank me later. baiii",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It have gun. It have fast move. It have booba. It gud, for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's an ok looter shooter to kill time with. Has the idea of quick missions, but that turns into a grind.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's okay but a lot of memory usage for the \"physics\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm addicted to character builds and crafting new descendants. It's fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing looter-shootet with stunning visuals. Warframe for people with taste.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You know for a game that shows a lot of buns and ass, I was suprised there was no photomode. Now I'm really surprised that a photomode had been implemented into the game and I didn't notice. Now to take some very respectable pictures of some characters >:DDDDDDD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, very engaging as well. I just can't stop playing it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i have been playing with one hand for 2100 hours including my Xbox playtime. Great game to turn the brain off and complete something. A grinders paradise id say. The female characters have great assets, hot chicks with magic, guns, katanas and great swords. Sign me up",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have only been playing this game for 2 days straight and I have already fallen in love with the story line it has!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Badly needs more regular new content. Sometimes I feel like it's 3 devs working on this game. Best example is that even new skins (which is their main income) release maybe once monthly. And to make up for the lack of quantity they make it more and more rare to have the same (overpriced) skin for different characters, so you have to buy one for each character. I can see two of the 7 deadly sins at work. Guess which ones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Es un juego con una monetizacion ridicula pero que se le va a hacer me gusta mucho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Indonesia:\nSaya menyukai tipe permainan seperti ini, cerita cukup menarik, desain dan latar belakang masing-masing karakter yang bagus tapi kenapa menjual pakaian karakter untuk perempuan dibuat seperti itu (contoh bikini)? Menurut saya tidak cocok dengan temanya.\n\nEnglish:\nI love this kind of genre, stories quite interesting, design and background every character are good but why sell female characters clothing with designed like that (ex. bikinis)? It doesn't suit with the theme.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's not a WOKE piece of Trash like on Xbox for starters, plus the graphics are super crisp with an anime style storyline...but the Captions and lip sync could use some refinement!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am not normally one to sugarcoat anything, so take my word when I say this may be one of the best F2P looter shooters I've played up to this point. I've reached Mastery Rank 23, unlocked 10 descendants (including 3 Ultimates), 2 of the 3 doggos, and 2 of the vehicles [b]without spending a dime[/b]. The community is also really nice and willing to help if you post in World Chat. [u][b]Obligatory warning: World Chat is full of gooners.[/b][/u]\n\nNew gameplay modes and story content are [b]NOT paywalled[/b]. Many items, particularly gameplay-related items (e.g., items that expand module capacity, Fellows, vehicles, etc.) [i]can[/i] be bought with real money, but they can also be earned or crafted in-game. The only things that can be obtained exclusively with paid currency (Caliber) are cosmetics; nothing that impacts progression. \n\nWith that said, if you're like me and decide to go the frugal route, you'll be doing a lot of crafting and farming. Sadly, you're only limited to 8 concurrent items while crafting, but you can also pay to speed up the crafting process. (Don't do it.) \n\nFor farming, I'd recommend picking up Bunny and a doggo and just speedrunning through invasions. The grind in this game is a chore, but at least it's free and you don't have to worry about content being taken away.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "There are a lot of great things about the game, but unfortunately too many terrible choices drag the game down so hard. \r\n\r\nExtremely greedy monetization such as the colaboration skins. $80 for all the Nier Automata skins, $35 for the Bayonetta skins, Full battle pass price for a tiny little sword pass that was only around for around a month or two with a quarter of the items in a normal pass. \r\n\r\nA poor obsession with making all new content harder and enemies more spongier than the last content make the game continually less fun and makes more of the characters less viable.\r\n\r\nAn extreme amount of farming for materials to absurd degrees. Doing anything in the Axion Plains made me groan as you had to complete a mission to get a small chance at receiving a box that had a small chance at containing the item you needed. The newest update includes a mission that only gives you around 5-10 of a mat that's needed for the new Descendant and gun. However, you will need a grand total of 1050 of this material for the character and for a fully ascended gun, meaning you'd need to run the mission over 100 times to get everything you needed. \r\nThis ISN'T an issue of it being a farming game. \r\nThis IS an issue of not balancing drops. It being a farming game doesn't mean that its quality because we got more than 0 mats per run.\r\nFarming in Warframe feels like a minute jog in comparison to this game. \r\n\r\nIf you're thinking about trying it, DON'T. In it's current state, it's not worth it.",
      "voted_up": false,
      "votes_helpful": 243
    },
    {
      "review": "Was fun at first. Everything, apart from cosmetics, can be obtained for free. But the drop-rates are horrible and power-scaling for each new patch is the worst I've ever experienced. Really is just a game to milk horny teenagers of their time, and whales for their money.",
      "voted_up": false,
      "votes_helpful": 128
    },
    {
      "review": "i have played this game for over a year and have logged over 547 HOURS in the game. I've bought Battle passes and calibur. So I was a \"productive player\" however. I cannot recommend the game anymore.  As of the latest update they have decided to throw you into a solo story mission against an extreme bullet sponge that isn't even the boss of the mission.  For the love of god this is a PVE game and there never should be something that is like that in a SOLO story mission.  If it was a group mission that's fine but for SOLO story mission?  No Way! Especially with maxed out skills and gear. This is an extreme sin when it comes to PVE games\n\nUninstalled and won't be back unless this is addressed ASAP.",
      "voted_up": false,
      "votes_helpful": 48
    },
    {
      "review": "Game is still a stuttery mess and its post story cycle is still bad.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "I'm sick to death of having to play the same two stupid characters to remotely get anywhere on this game. Along with the fact that the aim of the game isn't to 'learn and understand through tutorials and help that dev's have given you.' The aim of the game is to basically go on YouTube and copy the next best build that someone puts on there. I want to be able to learn by myself and make a creative build that someone might not have yet because I understand how to do it. Yes there might be the few people who are fortunate enough to understand how to do things but there's also a lot who need that extra support. I just feel like a bot going round doing the same thing x500. Also maybe focus on creating content and help rather than cosmetics that nobody in the long run will buy because everyone will have left. Thanks.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I've got R7 9800x3d with 5080 yet the game keep dropping my fps and the stutter poking my eyes so much that it feels like im watching a slide show. I've got better performance on PS5!!!",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I would not recommend.  When in Beta and initial launch, First Descendant was a lot of fun and spent hours playing; unfortunately with the latest update, game continues going down in enjoyment because you end up doing the same thing over and over again.  Balance of the descendants is way off.  The game only difficulty is increasing the HP of the enemies and resistance to physical and powers from the your damage.  Squid boss has you jumping up and not jumping around red circles damaging pillars and doing very little damage to the boss.  Horrible experience, I feel bad for new players who haven't fully updating their characters playing the last and current patch, they're relying on people who have done this.  Deleted the game from my PS5 and PC, loved the game but don't see a positive future anymore.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The game didn't have a bad start. The Descendants are unlockable, the graphics are decent, and the gunplay is fun. The farming was manageable; if someone has played Warframe and found the grind too much, this was the wrong game for them from the beginning. I enjoy playing with others, whether random people or friends, and so I had a lot of fun at first.\n\nNow, farming resources is becoming a lifelong frustrating chore. There's also not enough variety of content. As I said, the gameplay is mostly fun, but to become truly powerful, you have to farm an endless amount. Or, like with good-looking skins, you have to open your wallet. And these aren't cheap. If someone wants to pay for a few nice-looking bouncing pixels—you'll definitely find some skimpy outfits here.\n\nDon't get me wrong, you can have fun, especially with friends but you can hardly progress without investing half your life. And with each update, it feels more and more like greed for me. And according to other comments, I'm not alone in feeling this way.\nSo if you're looking for a game to spend a few relaxing hours with, this might not be the best choice.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I'm starting to get so tired of playing a game devved by people that clearly haven't the slightest idea wtf they are doing.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The early game offers plenty of content and rewarding loot.\r\nThe mid-game reflects several experimental systems that didn’t fully succeed, but still add value.\r\nThe endgame is poorly executed, and multiplayer features reveal a clear lack of understanding from the developers.\r\n\r\nSome veteran players call the new update a step forward for the developers, I disagree. \r\nThis feels  more like Stockholm syndrome. They're so used to bad content that anything slightly better gets praised.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "At the beginning, the game is interesting, then it comes down to the grind. There are a lot of cool costumes and they cost a lot of money.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "a company that would rather push collabs for renewed hype rather than doing something to fix their game that had an insane and promising future in beta testing and somehow felt like dog shit on launch with plans to get better and listen to feedback. I have yet to see any feedback of actual problems being fixed. Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game turmed gooner bait\n\nbeta was great, release was not so great",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I have wasted so much time on this game and i wish i could get every minute back. The grind for doing 2% more damage on a character you dont even really enjoy playing that much is not rewarding at all. Stay away. Play anything else. It's way too grind heavy and the skins for the gooners are way too expensive, but the they eat that stuff up i guess. I'm surprised this game inst dead yet.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Store simulating a game, Chinese gooner slop edition.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "terrible game. they put all their effort to make some bitches as characters and that's is. the gameplay is boring as fuck",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Everything in the game requires payment. There are no rewards for completing missions, not even a few; everything must be paid for.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The game started out good. It was fun, engaging, and challenging. I finished the campaign and was eagerly waiting for more while farming up the end game gear. But now it is just microtransaction slop and feels like a waste of time. There goes 200 hours.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[h1]The stingiest girl-collecting game[/h1]\n\nI tried this for 20 hours and eventually uninstalled because it was actually LESS generous than a Chinese gacha game which I already wrote a negative review for. Maybe the UI is just terrible so I missed something but regardless, after 20 hours in this product, I still had no character to play with other than the two that were given in the tutorial missions. \n\nI initially intended to buy one character but then realized that this game uses price obfuscation AND the old trick of selling awkwardly-sized currency bundles that make it impossible to only spend money on the item you want.\n\n[h1]Short version[/h1] \n\nThe grindwall for unlocking new characters is OBSCENE and you can't buy a new character without spending at least $20.\n\nIf the story and gameplay were good, these wouldn't spoil the game but neither of those are either good enough to be worth it or bad enough to enjoy ironically. \n\nMediocre story, mediocre gameplay, and an economy that is LESS generous than a Chinese gacha game. \n\nJust play the story mode on HALO, Mass Effect, etc. and steer clear of this product.\n\n[h1]Can't replay beginning of the game.[/h1]\n\nOne bafflingly bad design choice which can't even be explained by greed is that you can't replay the opening of the story which not only has the best-looking, cinematic boss battle I saw in 20 hours of playing but ALSO contains the tutorials which you would want to do if you took a break and wanted to get back into the game. \n\nBy not allowing you to repeat the beginning of the game, they actually increased the chances of people quitting rather than getting back on the horse. \n\nJust why?\n\n[h1]Art syle (or lack therof)[/h1]\n\nParts of this game actually reminded me of HALO... and that made me sad because then I realized that if this had been made as an honest,, single-player coop game and sold as a complete product, it could have been good.\n\nUnfortunately, they seem to have tried to make a gacha game, then got cold feet about the gambling mechanics, and then decided to make you grind-gamble rather than money gamble (your progress for unlocking things literally is tied to and RNG).\n\nWorse, they apparently felt afraid that if you could unlock things in game for free, too many people would so they made the game incredibly stingy in terms of in-game rewards, even compared to a gacha game.\n\nWhy am I bringing this up? It's because the art style is undermined by the same \"money-first\" approach that ruined the rest of the game. Rather than designing characters and costumes that kind of fit with the setting... and developing the setting, they instead created characters that were obviously intended to appeal to thirsty boys... and they kind of failed at that because they tried too hard.\n\nI happen to think that quite a few real women look good and the fact that lots of men pay them to look that way confirms that I am right. The human-inspired robot dolls in this game however, are just plain weird. \n\nThe faces of most female characters look fine, as I noted myself.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3283902742\n\nHOWEVER, the BODIES of these characters look really off because they are essentially made with anime proportions in a game which generally tries to look photo-realistic. \n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3284145498\n\nThe result isn't attractive so much as grotesque and it gets worse the longer you look at it. I thought \"Bunny\" was a bit too exaggerated at first but now I just see an alien monster... and I like skinny femme-Shep in the tightest suit possible btw.\n\nIf they gave us the option of adjusting how these characters look with regards to proportions, it might not be so bad but of course they don't and since it's a live-service game, you can't fix it with mods either.\n\nSad...",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Guns have weird recoil and camera controls just feel wrong. But if you are a weeb who has never seen a woman... I guess this is the game for you?",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A game where you just keep leveling up and leveling up — I realized that after watching several reviews. It takes a lot of time and eventually becomes boring.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Cash shop is egregious with many stacking & manipulative conversions, atop FOMO mechanics everywhere.\r\nGame itself is coated in post processing effects to a point it looks awful unless you're stood completely still.\r\n\r\nDon't touch this game if you can't control yourself with cash shops please.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "[h2] The First Descendant: An Empty Shell [/h2]\n\nI wanted to love this game so badly that I tried my best to find something worth playing, and as result I learned to hate it. With passion.\n\nZero gameplay value, a laughable plot, character building that is an insult, and overpriced in-game purchases. Let’s break it down.\n\n[h3] Good from a Distance [/h3]\nWhile the game is considered an NSFW Warframe clone, I will judge it independently, as I’ve never tried Warframe. But I have played many third-person shooters, including those with the same “Sexual Content” tag, and I was genuinely surprised. \n\nThis is an expensive project that should easily crush any indie competition, yet it failed miserably. Obviously, character models in revealing outfits is the limit of “Sexual Content” the game allows itself, which was expected. The area where such game must stand out is gameplay and scenario.\n\nBut sure, it looks good. The visuals, sound design, and especially the environmental art is top-tier. And that’s what hooks you as you launch the game. The direction of the intro mission and the first cutscene is promising, but it’s the best one in the game, and it only gets worse from there.\n\n[h3] Here for the Plot [/h3]\nThe campaign suffers from inconsistent storytelling, as if it can’t decide whether it wants to be a funny, joyful adventure or a grim, serious story. In short, you witness how the main cast saves the world through pure luck, as they possess neither the discipline nor the mental health to stay in line and follow orders. Their incompetence will drive you mad more than once if you choose not to skip the repetitive and boring cutscenes. Usually, in such situations, you start rooting for the antagonist, but he is just as stupid and shallow as the main cast.\n\nMost mission require you to listen to ~3 NPCs before starting, and they will repeat each other, adding nothing new. It feels like the writer was either trying to pad the script to justify their pay or believes the player is an idiot who can’t understand the plot the first time.\n\n[h3] So-called Gameplay [/h3]\nIn the process, you will be surprised at how easy everything is, as mobs and bosses only pose a threat if you go AFK. “Well, it’s probably just the overextended tutorial; the main gameplay is the Hard Difficulty unlocked after beating the campaign,” you might think. Nope. This IS the core gameplay. \n\nFirst, no skill or effort is required. Your level and equipment are all you need, and if your character and build are right, you can clear any level or boss by clicking ONE button. If you’re failing, you’re probably under-leveled, as there is no way to compensate for stats with personal skill.\n\nSkill, you see, is painfully irrelevant here. We have an evade roll with no i-frames, so it’s a dash at best. We have no parry, and the block here is miserable: your character stands there, holding their sword awkwardly, and it just mitigates incoming damage a bit. There isn’t even animation of intercepting incoming hits; IT JUST STANDS. Imagine a AA-game losing in terms of animations and gameplay value to 1$ cash-grab porn games where gameplay is added only for show.\n\nSometimes, to prolong your way to endgame content, game prepared a difficulty spikes for ya. You might wonder: what problems could it be if I said the game is easy? The HP multiplier. The only way the devs know to make it harder. The same mobs with the same models just get x10, x100, x1000 HP, and that’s just fine for TFD. It’s not actually difficult; it’s just a test of your DPS.\n\n[h3] The Building is on Fire [/h3]\nCharacter building, then? That’s logical - if this RPG has no skill value, it probably has a deep and complex leveling and enchantment system. Yes, it has, and first, it’s truly complex, maybe over-complicated, and second: HALF OF IT USELESS.\n\nIt will take hours to tens of hours to grind for a set of items with the right stats, as RNG decides how good a dropped item is. But that’s not a problem for some people; I love good ‘ol grind myself. The thing is, the game designers have no idea what they are doing. Some characters have a such a great advantage over others that no amount of grinding will ever equalize them. You will spend hours grinding the perfect setup for a character you like and still be a deadweight in a dungeon, while broken characters with no grind will annihilate everything in seconds.  The most infamous build to one-shot the top boss doesn’t include a Reactor or External Components - literally half of the character build. The devs don’t care – they never fix what’s broken, only adding even more broken characters to the game.\n\n[h3] Forced Multiplayer [/h3]\nYeah, by the way, there is multiplayer. For whatever reason. You might think this IS a multiplayer game, but think again. The point is that everything easier and more comfortable solo because the more participants there are, the more HP enemies have. If a player has problems with a content and goes online, they will only find another poor soul who also has problems. As a result, they will end up suffering together, as content only becomes harder. This is straight illogical - the more help you get the harder it becomes. \n\nThe best way to beat the game is to play privately, but you will still wait for the matchmaking server search. Modern classic: a single-player game requiring an internet connection. \n \nThe maximum number of players in a location is 4 (expt for 1 boss), so it’s hardly MMO, but in the hub, there are 16+ characters at once because the devs understand priorities: skin and animations show-off are more important for them than gameplay.\n\n[h3] The Game from Brave Creators [/h3]\nAfter all this, the devs DARE to charge the price of a AAA-game per skin in First Descendant. Gods, that’s bold. But any cheap NSFW game on UE4+ has models of similar quality without charging you the price of a full game, not to mention they will likely feature actual sexual content like H-scenes.\n\nAt the end of the day, there is literally no reason to even start playing TFD, and there are many things that deserve your money and what’s more important - your time - more than this.\n\nYou want a good solo/co-op third-person shooter? Try Remnant or Helldivers. You want a true NSFW game with both gameplay and good H-scenes? Try Project Werewulf.\n\nDo yourself a favor and skip Firs Descendant. Good looks are all it’s got.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "The latest patches have added a lot of friction to the game, and it’s no longer enjoyable. Farming is expected, but with every update they add another bleak map that you have to run a hundred times just to get one item you probably don’t even need. For the last three seasons, the game has basically forced players to use Serena because everything else feels weak in comparison.\n\nThey introduced some “rebalancing,” but it’s nowhere near enough. The so-called “new” content still has spongy bosses that require heavily optimized builds, and the only real tankiness still comes from Serena.\n\nThey also added swords, and they’re a complete mess. Swords require ammo and even share ammo with rocket launchers, which makes no sense. Ammo-generation skills don’t work while a sword is equipped, and heavy attacks often swing in random directions instead of toward the targeted boss.\n\nPlayers used to complain that new weapons and descendants were overpowered; now the new stuff isn’t even worth farming, and Serena remains OP. It feels like the devs have gotten lazy and are only focused on what new skin they can sell next, forgetting that players need fun, engaging content before they’ll want to spend money on cosmetics.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Everything is too expensive and the gameplay is meddle of the road between Warframe and CS. By witch I mean slow and clunky without letting you feel powerful",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very pay-to-win. The drop rate is so ridiculous that it’s enough to make you give up on the game.\nMaybe if you repeat the post a million times, you might finally get your items…\n\nI wanted to love it. Just make the microtransactions for cosmetics only—\nlike Warframe,\nWhere Winds Meet,\nor the new TOF global server.\n\nCome on, learn from the market.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The First Descendant feels like one of those games that should be great on paper..... big bosses, flashy abilities, sci-fi loot, shiny Unreal Engine visuals.... but the moment you start playing properly, the cracks show faster than you’d expect.\n\nThe gunplay is serviceable, but it rarely feels impactful. Enemies soak bullets like they’re being paid to waste your time, and boss fights often feel more like repeating the same patterns than anything truly exciting. The abilities look impressive, sure, but the actual feel of them is hit-and-miss — some are fun, others might as well be decorative.\n\nWhat drags the whole thing down is the grind. And I mean the grind.\nEvery upgrade, every piece of gear, every unlock feels buried behind layers of materials, timers, and currencies. Instead of wanting to progress, you start questioning why everything requires a shopping list longer than your arm.\n\nPerformance is another headache. Stutters, weird lag spikes, and visual bugs pop up often enough to remind you the game isn’t quite as polished as it pretends to be. Matchmaking can also be inconsistent, leaving you stuck waiting around in what’s supposed to be a fast-paced co-op looter shooter.\n\nThere is potential here ...the world looks good, some Descendants are stylish, and the foundation could evolve into something solid. But in its current state, it feels more like a flashy demo wrapped in excessive grinding and inconsistent gameplay.\n\nIf you enjoy looter shooters and don’t mind a heavy grind wall, you might squeeze some fun out of it.\nBut if you’re after something tight, polished, and rewarding… this probably isn’t the one",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Lately, performance has been through the roof! Freezes are a pain. My computer is running like a steam locomotive...all I can do is smoke it. There are a lot of events, but there's nothing worthwhile in them. Therefore, completing them is uninteresting. Good skins only cost money, and a lot of it. The Battle Pass is easy to level up, but there's nothing worthwhile in it, even for those who buy it. It would be better if they did the opposite: leveling up takes longer, but the rewards are better and more valuable. The developers completely don't understand how to retain and support players. I've been playing for so long, it's a shame to quit, my leveling is almost maxed out. All the events the developers offer are irrelevant for me and those who have leveled up! The game needs more valuable and interesting rewards, even with challenging conditions, especially for players with leveled up accounts.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Nexon, the mother of monetization culture, strikes again, because this game only wants one thing from you: your mother's wallet.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Just Warframe if Warframe wasn't made by Digital Extremes instead made by a company that was apposed to improving the player experience and set out the make the game play loop unnecessarily frustrating and tedious",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "When the game works, its fun. But the last few weeks its been getting very bad. Constant freezing/stuttering, crashes galore. Like tons of crashes. I have a 4090 with graphics set to low, and it still stutters/freezes when doing basic movements in the hub. Find something else to sink your time/money into.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I played The First Descendant since the beta and ended up putting over 100 hours into the full release, even going as far as platinum-ing it on PS5. At launch it really felt like a fresh, exciting looter shooter — but the more I played, the more the game’s biggest issues became impossible to ignore.\n-\nAlmost everything is heavily time-gated. Crafting characters and gear can take entire days, and during the last week I was logging in only to craft the same thing every single day. Unlocking new characters also requires farming the same missions in a loop over and over just to get the materials you need.\n-\nOn top of that, a few trophies were buggy for me, which made the experience even more frustrating. And while I know it’s a free-to-play game, the monetization feels very aggressive: you can skip crafting timers with money, and some bundles or character-related purchases can get quite expensive depending on the currency packs offered.\n-\nIf you enjoy grind-heavy games with long crafting timers, you might still have fun — the core gameplay isn’t bad at all. But personally, between the time gates, repetitive loops, bugs, and the overall push toward spending, I lost interest. There are better options out there in this genre.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i want to enjoy this game but being forced to replay the same mission 10-20 times for a 20% drop rate item is making it impossible for me to enjoy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The only appeal to the game is the vulgar clothing. That alone shouldn't appeal anyone to a game. Gameplay, mechanics, all of it is worse than Warframe. Just play warframe if you want the gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trust ME , I want to like this but at the end of the day i feel i don't , the amount of time you need to set up a specific descendant with how it works is atrocious. The combat is fun to certain point but there are times you just cant do anything alone. The game has lost a lot of players and right now to find a squad for mission is highly unlikely. i hope it improves.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love the game, but after this latest update I can't play it anymore, EAC wont update for me so I can't even launch/Play the game anymore\n\nI've verified my files, reinstalled the game. reinstalled EAC and still cant play the damn game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glad it was Free to Play.. Crashes every 10 minutes or so and eventually it just got to the point where it won't even boot. Tried validating, tried reinstalling, drivers are up to date, etc, etc.\n\nHot garbage.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I picked this game up as I had heard it was like Warframe. I can confirm there does seem to be a level of build crafting like warframe. The problems however are so numerous it isn't worth it. FIRST, this game only looks great on a hypothetical super computer. I have insane stuttering, frame drops, and texture pop-in despite my PC not being weak. Then we get to the fact that the ads you get on first load in are insane. Each login I have to click past about 15 ads to buy stuff on a game I have less than 4 hours in. There is no clear guide on what to do. I spent an hour trying to figure out how to launch a quest before breaking and looking it up. Then I was given a free high-level descendant for some event. I thought nothing of it and was like \"cool, one less thing to grind for.\" SILLY ME. Taking that offer, unbeknownst to me, completely removed every low-level quest, and force-enabled hard mode. Meaning my level 1 descendant and guns could do nothing at all. I then proceeded to spent the next 2 hours trying to get some gear scrapped together to play. When I finally realized the main quests were not coming back, I said screw it and quit. I am deleting my account, and maybe I will try again one that 3 DAY PROCESS completes, and MAYBE I will change my mind. but I doubt it. Go play warframe. Way more ethical and understandable than this cheap knockoff. \n\nTLDR; Play Warframe if you want a good game. Play this if you want to be confused and angry at some knockoff.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "1. ALWAYS buggy on release, crashes and what-not\r\n2. More attention for horny cash-grab cosmetics than actual game content\r\n3. Unfair skin contest\r\n\r\nJust things going downhill, things could've been much better but nah... they don't wanna improve",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "They did a change to the anticheat that breaks on linux now after a year of playing.  It's been over a month now and it's still not resolved.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bayonetta is really wicked, but Nexon still sucks.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "gameplay doesnt matter. if you so much as sneeze on the application it crashes. full screen? windowed? its like my ex, if it isnt getting every single bit of attention from the time you open it, its gone. gotta restart it. 0/10 for that simple fact, why the f*ck do i only need your game open on my computer to keep it running????",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has potential but the core design (or you can call it strategy) is quite flawed. Instead of trying to create a different experience in different missions it's just running same missions with a little bit of decorations change. Enemies are dumb as hell, zerg rush the player.\r\n\r\nAlso, developers are trying to inflate playtime values by making drop rates pretty shitty. So that you run those boring missions lots of times.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I decided to start playing for the Bayonetta event. Loved that game and I thought it would be a cool way to revive a long dead character. Unfortunelty, the Bayonetta \"event\" is just some cosmetic items that I have 0 interest in.\nThe gameplay is better than Helldivers, and is actually pretty fun. However, it gets stale after 5-10 hours of doing the same thing over and over. Do 2-3 world missions, and then run a dungeon, repeat.\nThe graphics are great but I also had the game crash 4-5 times while my character was just standing around and I went to the bathroom or got a drink of water. (I thought maybe I was getting booted for inactivity but it would happen after like 5-10 seconds only) (also, I have a 3080ti and i9- 12900k so this shouldnt be an issue for my PC)\nThis game feels like it could be better than Destiny if it would just focus on making enemies more interesting to fight. Also, the characters all feel really weak or super OP'd and there is no in between. Im one of the few people that doesnt want to play as a female character and it feels like I get punished for that. If you want a waifu collector with tons of cosmetics for your girls, this is it. If you want to enjoy the game as a male character, get used to some very basic skins and a slog, because he probably wont be performing like the META ladies.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Final straw rant incoming\n\nI have been playing this game for quite a while (it was also the first looter shooter I've played), it was pretty fun at first but as of today I have uninstalled due to the forced arbitration they just put out and MANY other issues (see below). \n\nMy problems with the game in no particular order-\n- Extremely unstable on PC. When I first started, the game ran fairly well, only had some stuttering when there were alot of explosions going on (turned those off). However with each \"update\" the stuttering got progressively worse & worse as well as affecting areas where previously there had been none. Loading into instances also started taking longer and longer and lon...Well you get the point.\n\n-Making the game more \"solo only\". The devs have been putting more solo instances in the game and the main story as well as making the solo give better/more rewards. I picked the game up because it looked like dungeon focus type that you would run with other players, working together to defeat the big baddies and all their minions. Take that away (or make it so loot drops in solo makes multi undesirable) and you you drive off folks like me that LOVE to run with other people. To give an example the absolute most fun I had was in a 400% dungeon with myself as Bunny (mob deleter), Luna (buffer), Freyna (mob deleter) and Gley (boss deleter), working together, we cleared in an insanely short time and I've not seen a better time since lol.\n\n-Balence. Most of the descendants are useless unless you're a masochist and if it's timed, you end up actually being a DETRIMENT because you won't be doing enough damage to beat the timer. In my opinion ALL the descendants should be usable (with some being more desirable against elemental bosses of course) but because it's easier to go \"Here's the 2-3 meta, have fun\" that's what the devs go with (oh and the meta is ALWAYS female, more on that later). I would LOVE to play Ajax but I'm unwilling to be essentially dead weight to my team so am \"forced\" into meta.\n\nWeapons- Suffer from the same problem as descendants with only a couple being good, one or two others having niche use & the rest basically useless.\n\nSkins- Hooboy where to start here? Hmm let's going with price first- far, FAR too expensive! Look I completely get the it's a FTP game and they DO need to make money both to keep the game going and to add to the game but good grief as much as $60 for a SINGLE skin?! Miss me with that nonsense. Then there's the whole ish tons of female skins (to put on the devs metas), most of which are just c00mer bait to siphon money from lonely males and only a few skins for male descendants, many of which don't even look good. Where's my itty-bitty postage stamp speedo for men and Halo-esce body armor for women dagnabbit!?\n\nLoot drops- RNG on top of RNG=Not fun. So originally you had to hope you got an amorphous material from your targeted mission/dungeon then you had to spend it and hope you got loot you needed, now you hope you get a loot box (very small chance), open it and hope you get the piece you need. In my opinion, there should be a vendor that you could trade parts you have for those you need for example let's say I have an ult Gley blueprint and I already have Gley. Well then I could trade that blueprint for say an ult Luna blueprint, I personally would set it up so there were some restrictions like only weapon for weapon, regular descendant for reg ect. but tradable non the less.\n\nAlso pertaining to loot is the rerolling of stats, I do NOT find enjoyable burning through massive amounts of materials & gold but ending up with nothing to show for it because the rerolls were all WORSE then what was already on the weapon. If they made it so that rerolls were never worse then what you had it would make it more enjoyable. To give an example suppose I have 5% crit chance on a gun, I get lucky and get another crit chance on reroll it would always be 6% or better never 5 or lower. I would still have to fight with getting rolls I DIDN'T want (say bonus damage to faction) but when getting what I did, I would be guaranteed to get least a small upgrade.\n\nDyes- While I personally don't mind too much that they are one-time use, I DON'T like that many of them don't look good on the models (this is for both hair & gear), you should be able to use more then black & white and have it look good. The colors don't even match the thumbnail most of the time. And some of the dye channels are highly questionable i.e the tiniest lil piece you have to squint to see.\n\nCombat- They have been turning things into absolute bullet sponges, which I don't find fun at all (admittedly that could be my fruit fly on crack attention span lol).\n\nAll in all I feel this game had a lot of potential that the devs have fumbled (and continue to), unfortunate.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "[b] Typical F2P problems:[/b] \n[list]\n    [*] online only\n    [*] horrible monetization system\n    [*] gooner slop\n[/list]\n\nIt's a shame, because the gameplay can be quite fun at times. Visuals and UX are decent as well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They nerf everything good in the game unless its new and then charge you an arm and a leg for anything fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No content to play. But they do have a $1000  of cosmetic you can buy at anytime. (Play on console).",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game ALWAYS CRASH!!! LIKE ALL THE TIME!!!  EVERYTIME!!! the most annoying thing is that I actually enjoy playing the game BUT HOW CAN I ENJOY PLAYING WHEN THE GAME KEEPS CRASHING??? \r\n\r\nYES! I have over 600 hours of playing the game, it keeps crashing and I keep playing it ... thats how much I like the game ...I try to not be bothered by the crashes that much by drinking copiums but after my latest crash I just had enough. seriously FIX YOUR D*** GAME NEXON!!!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game, but the amount of times my game crashes is annoying!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the last update of the game killed the performance, the game keep crashing from shader compiler spike , all other games run fine and before the last update this game run fine.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b] The actual gameplay is actually quite fun. [/b] \r\nBut the double anti-cheat with their own proprietary one is just straight-up pointless and annoying. I do not what this game to be installed on my own PC. Luckily cloud gaming is a thing... \r\nAlso, the monetisation is atrocious and the game suffers from other common issues that [i]usually[/i] only plague mobile games but it's made it's way into a PC game here. Quite sad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They just want money, they dont really care that much about the mechanics in the game, and so is the actual community who plays it regularly (im talking about the generality).... \r\nThis game is just softporn and there is no major innovating content added to keep you engaged... RIP because this game had potential.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every update is more insane amounts of powercreep and just stolen content. despite stealing almost all of the games systems, grinds and ideas they somehow made them worse. The performance keeps gettig worse and the balance aswell",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bricked my ssd. apparently a problem with the anti cheat and not the game but still",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I don't remember putting this much time into this game - but unfortunately I would not recommend it to others.\n\nThe art, characters, animation etc is beautiful. There are some truly breathtaking maps, scenery and cutscenes however the game falls flat gameplay, farming and pay to win things. Everything is really expensive and there's not really a way to grind out in game currency to buy skins and cosmetics. Farming for things is so so so painful and takes so long. Unfortunately it just feels like the game is bullying you into spending money to get ANYTHING you want.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I liked the game but it keep crashing when I would join other players on tough quests.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3D world, bosses, enemies, player characters all look great. Water flows, water reflections, glass reflections, glowing metal. Just looks fabulous. \n\nBut underneath the beauty is a repetitive grind game. Go to there, kill these, defend that, collect this in that. And this repeats. On top of that you need to grind materials to make better weapons, other characters, better skills, side kick materials.\n\nWhy would I pay money to buy things that I will eventually loose? The game requires a server to operate. If the game server goes offline, so does your progress and everything with it. If they game had a offline mode, that allows you to keep the game and the things you archived, that would make my derdict different.\n\nGame could have potentional if it were single player. Makes me thing about World of warcraft, but then light version.\nBut does look good. Steam has no recommend: depends. So I say : no.\n\nKudos to the game dev that poured so much time into it, it does show. Just the adventure part lacks hugely.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game lacks end game content some grind are stupid and performance are still bad even if you have monster pc stutter mess geez, this is why the game keeps bleeding players but the girls design is amazing if you are a teenager that always in heat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Storyline 20 hrs, after that, they (Nexon) are calling it \"you start building\" or something like that, but it's not building - it's grinding, a lot of grinding. Need a better weapon? - Grind 4 same missions 20 times each. Want an advanced character? Grind another 4 missions, if you are lucky, less than 20 times each. Need better equipment? - Same. After you arrive in Axion - everyyhing you have is grinding, there's just too much of it. Fully building the first character is like 30-40 hours, including grinding (in my case). \r\nNot the worst optimization, but I didn't play many games on Unreal Engine 5, so I might be wrong here. Looking decent, I would say.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its not a story game its an online game that you join big lobbies and just do story missions and its boring its just like warframe just has it easier to get new caracters and has women in underwear",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is just broken for me.After the update, some slowdowns(Frame Stutter) appeared that could not be fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just because you have a cute looking redhead with a bikini top and shorts in your game poster doesnt make it a good game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The First slideshow had maxed out my 14900k CPU usage on all cores and lagged my entire PC.\nit took 5 minutes to force the game to close in task manager. \nI haven't played this game in months and don't remember needing a super computer to play it. \nhow did it get this bad?\n\nunfortunatly the bikini girls that only an immature child would be embarased to see isn't worth sitting though a 5fps slide show game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hey guys I have an idea for a game. It's Destiny 1 but only public events but we add boobies so gooners will play it. Also we steal shit from warframe cuz I dunno.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Gooner infested warframe clone thats has so many microtransactions,you might as well just burn your money",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "everything about this game is meh. Not worth getting into, the game play is repetitive and simple to the point its boring, the dialog and voice lines are bad and sometimes even cringe (for me at least) the micro-transactions are way too pricey, and this is just my opinion (like this review), but the story is so boring I don't even pay attention to it anymore. The game is around a 5-6 out of ten if i'm being generous. At least it's free.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Warframe and Destiny 2 put together, but more pay to win. Also don't like the overt sexualization of characters. The game's release trailer is absolutely peak and should be seen even if you don't plan on playing the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It's becoming increasingly clear that the developers are unsure which direction this game should take — is it a looter-shooter, a pure gunplay experience, a skill-based game with guns as mere stat sticks, or a “gooner game” because of the overly sexualized skins they're selling?\n\nEvery time I log into the main city, I’m greeted by half-naked characters showing off their asses in bikini skins. Content updates seem targeted more at new players. For day-one veterans, there's practically no meaningful content and little variety, unless you're into min-maxing or chasing leaderboard ranks.\n\nThe company's greed is also showing through the latest skins and the previous “Sword Pass” they're selling. As a day-one player, I completed the latest content update on November 6, 2025, in just four days, but I don't care about Hive copies. There's still no real balance among descendants — you only ever need one, the overpowered Serena.\n\nMaterial grinding is awful. The new material is locked behind a single dungeon, dropping only 4–9 pieces per run. You need around 300 for the Harris character and 750 for the new Hive Master weapon — a total of 1,050 pieces.\n\nThe developers keep repeating the same cycle: new content, community feedback, apologies, and the same mistakes. No, no, no — that’s enough.\n\nOver a year since launch, the community now reflects the state of the game itself — fractured, fatigued, and cynical. Most of the veteran players who cared about balance and design have long left. What remains is a mix of people staying for the cosmetics, a few defenders trying to justify the direction, and the rest who linger out of habit or irony.\n\nDiscussion spaces are filled with sarcasm, “copium” jokes, and recycled complaints that never lead anywhere. Constructive criticism is gone; anyone trying to stay positive is instantly dismissed. It’s no longer a passionate fanbase — just survivors of disappointment.\n\nThe burnout is real, both in gameplay and community spirit. At this point, the Discord feels less like a place for feedback and more like a post-mortem chatroom for what the game could’ve been.\n\nFor me, at the current state of the game, it's time to take another break.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game literally just throws Boobs at you and says \"gimme money. then you'll see MORE SKIN. oh.... but also its a totally serious game about destroying dimensional threats.\" if you don't wanna spend 30$, customize your new character, then spend the rest of your time online ogling your player character and playing \"one handed\", then you're really wasting your time cause EVERYTHING you need is buy-able. why even play? why grind 30 hours for a fraction of the resources you would get for 5$. pure pay-to-progress garbage that only has sex appeal keeping it alive.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game keep crashing and everybody is complaining and the authors don't solve the problem.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Crashes while looking at inventory, crashes while looking at the sky, crashes while the boss is about to die...\nOh did I mention the stutters ? 9800x3d, 4090, nvme etc etc",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Every new map is worse than the previous, every new boss is more tedious than the previous.It's unplayable. Enough.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "its NEXON,  you know its FULL of overpriced monetization and micro transactions.... avoid",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game became not enjoyable mainly targeting people who like to look at ass and boobs all day ;D and it feels like another warframe game for me already playing warframe so not gona sink time into it also server connection is rly unstable and sometimes unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Cons: Too grindy - really small chance to get materials per missions, use those materials to have another small chance to get the items you are looking for, then use those materials and other resources that you have to spend more time to farm to make a couple parts, then use those parts to finally make something that you want descendants/weapons/ect. ... grindy\n\nPros: all female descendants are gooner materials.\n\nIt's fun when you're bored and got nothing else to play",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "While I like half naked girls, I prefer them in real life and not cluttering up and otherwise decent FPS - it feels more like a dating simulator or teenage boys dream game, but as I get my juice elsewhere, it's sort of faaarking the immersiveness of the game to the extreme.\nI have found my love for WarFrame again though, so the game wasn't entirely wasted.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game is fundamentally ruined by the way it was designed. \nUser combat and active navigating mechanics are not smoothe and seamless. \nBatman Arkham knight is an excellent example of seamless combat. \nAssassins Creed Syndicate the pinnacale of perfectly seamless combat mechanics.\nThe quick movements make the game feel as immersive as a fish on a frozen lake.\nI could not force myself to play this game for more than 2 hours maximum.\nIt is clear the developers did not care to follow through with making a replayable game you can spend all day on.\nIt's a waste of everyone's time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Мнение об игре не будет оригинальным: игра требует просто таки гигантских затрат времени, если вдруг захочется собрать героев(героинь конечно же) не тратя реальные деньги. Притом, что сама история не сильно интересная и относительно быстро заканчивается.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I saw this was free to play and gave it a whirl. It's a strange mix of a teenage boy's wet dream, Destiny 2, Halo and a few other bits thrown in. The gross over-sexualisation of the female characters with their hilariously appalling jelly breasts and lurid costumes distracts from reasonably solid gameplay, great visuals and well animated characters. \r\n\r\nThe dialogue and plot is pretty laboured and in great Destiny 2 fashion, apparently everyone, even the bad guys can talk on the same radio and discuss their plans. There's even the same evil villain diabolical laugh. \r\n\r\nSome bad points - again, from Destiny, bullet sponge bosses that you have to repeat the same sequence of weakening three times to defeat. The monetisation is dreadful, sucking the life and soul out of a game that could be amazing - the same thing that ruined D2 and a lot of other games. I get that the game studio is in business to make money and it costs a lot of money to create and run a game like this, but there's better ways of funding your product. \r\n\r\nBut the worse thing about this game is that teenage wet dream - the unfiltered and unmoderated chat is a toxic mess of misogyny, abuse and sexual comments - it's well worth switching off altogether as the game pulls in the worst of male society. \r\n\r\nSo I can't recommend it and if they ever charge for the game you'd be a fool to buy it or in it's current form, spend any money on it, unless you're a teenage boy or basement dweller.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Played for 34 hours but never got a single legendary character. After spending this much time i can safely say this game is only for spenders and not someone like me who tries to grind to get the good stuff. Don't fall for the girls in the pictures as the are sort of a clickbait or purchase-bait in this case. The drop rates are extremely low so call yourself lucky if you got any of the so called legendary versions just by grinding. There are better options in the market than this one.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pretty fun game at least in the beginning, haven't gotten far. But the cash shop prices are insane. Usually I stop playing games like this where all the customization, or even worse, things to make you progress are either locked or unreasonably hard to get by just playing the game.\n\nWill see if I stick with it but I prefer to pay for the game instead of buying outfits that costs as much as a game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stop showing bikini girl on thumbnail everywhere in every news article, how desperate for teenagers are you...\nGame was good for few hours at launch, now I'm considering removing from account cause it's embarrassing.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "[strike] So, this game isn't even that fun at all, but I'm thumbs upping it because they put [h1] Bayonetta [/h1] in it, and I only care for [h1] Bayonetta [/h1]. Don't play the game other than that. [/strike]\n\n*Edit* 11/27/2025\nSo, after thinking about this review, I decided that just because [h1] Bayonetta [/h1] is in the game as a costume and some emotes, I will probably never play the game after I get her cosmetics. So, I decided that I won't be getting it because the game isn't even that fun to play. Thanks for giving my girl some love, though!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is more like of an \"Unoptimized crap\" i've ever seen...\n\nOk so 6 months before today, i had a pc with 1050ti and 16gb ram and i7 7300hq (Well logically that would run the game at 60 fps with low if i am not wrong?) well yeah i ran the game with 20fps and overheat issues, i said alright\n\n6 months later (today) i got the new pc with 32gb ram, i7 10750h, RTX 3070 8gb vram, i was expecting to run this game in max performance and enjoy the play, BUT NO? how come can i play 40fps with rtx 3070, like my brain marked an error when i saw that, immediate uninstall. fix your trash.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "You farm, wait for the next season and then farm again. Farming just to farm faster. Farming for the sake of farming, for upgrading descendants, weapons, your bike, your companion. Farming for a new descendant, for resources… or did we already do that?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't remember putting this much time into this game - but unfortunately I would not recommend it to others.\n\nThe art, characters, animation etc is beautiful. There are some truly breathtaking maps, scenery and cutscenes however the game falls flat gameplay, farming and pay to win things. Everything is really expensive and there's not really a way to grind out in game currency to buy skins and cosmetics. Farming for things is so so so painful and takes so long. Unfortunately it just feels like the game is bullying you into spending money to get ANYTHING you want.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I got it had fun then just wasnt a fan of the borderline pornographic content so deleted it, if youre a gooner or dont mind that give it a try you likely live in a free country",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "There is no gunplay anymore and they made it too difficult/pay2win to goon.\n\nCosmetics should never be locked behind paywall.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If I can't earn it, why would I play? The best skins MUST be purchased. I'm not okay with that. There's no payoff if I can't earn something.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Too many standardized characters with huge breasts and butts... I just don't have anything to choose from. No variety at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "tons of potential wasted.  They have leaned so hard into the gooner theme that the gameplay has suffered",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game just crashes at splash screen. What a waste.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shit linux support, won't even start. 14 hours of play? more like 14 hours of the splash screen showing up and crashing.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Locked into 3rd person with character blocking significant portion of view is annoying. Movement feels janky. Turning on different aim speeds for different weapons made no notable difference. Can still spin nearly as freely with sniper as I can with shotgun making weapon switching having to rely on changing mouse sensitivity instead. Unoptimized with lots of stutter and lag spikes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nahh just dont. Dont do it. Story is ok, but its not worth it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Boring oversexualised character game not worth it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "only thing they have is gooners and nothing else to by honest",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "5% chance drop 5% chance drop 5% chance drop 5% chance drop 5% chance drop 5% chance drop 5% chance drop 5% chance drop 5% chance drop 5% chance drop",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Literally just Warframe and Destiny combined. Bruh",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}