{
  "positive": [
    {
      "review": "Driving the Batmobile never gets old, and the city looks stunning. Story’s solid, combat’s slick — easily one of the best superhero games ever made.",
      "voted_up": true,
      "votes_helpful": 25
    },
    {
      "review": "Absolute Cinema! The story, the combat, exploring Gotham, everything just feels amazing. If you haven’t played the whole Arkham series yet, you really should. \r\n\r\nTotally worth the money and the time.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "[h1]Best Batman Game Ever Made..[/h1]\n\nThis game was AMAZINGLY AWESOME. The game’s story, plots and gameplay was very very good. I had a GREAT time playing the game. The combat, mechanics and side-missions were greatly handled. The story of the game was shocking as the truth about Jason and the ending. The ending was a bit confusing because after activating the Knightfall Protocol, he dies but he doesn’t? It’s a bit confusing. The characters have so much in depth detail which can't be noticed without much inspection. Can't believe this masterpiece is 10 years old already.. The graphics in this game just amazes me to the point I forget this game came out in 2015. Each of the Villains and Bad Guys have their respective character which makes them super unique. The Gotham City feels more alive and the fact that Bruce Wayne managed to stop each and every crime in the city in a full night is just very suprising. The Bat Mobile's Controls are kind of outdated by now but I still enjoy it. The Cutscenes in this game are really well detailed and really amazing. The stealth is just pure in this game, and as Batman its even more fluid.  I have 90+ hours in this game because it’s AMAZING. I also got every achievement there was to get. It deserves a spot for my favorites of all time. \nOverall Rating – ⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️⭐️ (10/10)",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "The game is amazing without a shadow of a doubt, though there are some flaws but no game is perfect, and these imperfections come as personal differences regarding the gameplay style, not  merely critiquing the amazing/great story of Arkham Knight. And importantly, this was the last time we/players got to experience Kevin Conroy as the Dark Knight for the last time in the Arkham series. Well done Rocksteady, I do think/believe Arkham Knight was the last story of the series, everything ended right here, and rightfully so.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Batman: Arkham Knight is truly the cherry on top of this amazing series. The visuals are absolutely breathtaking and even by today’s standards the game looks fantastic, often even better than many modern AAA titles.\nThe Most Wanted side missions are really great. Each type of mission has its own story that perfectly complements the main plot and adds extra depth to the game.\nA big new addition in this installment is the Batmobile, which is used a lot whether in AR challenges, missions, or puzzles. Some people might not like it because it appears “too often” and that’s completely fair, but personally it worked perfectly for me and adds a fresh aspect to the gameplay.\nThe sound design and overall soundtrack are phenomenal, as is the excellent voice acting from Kevin Conroy and Mark Hamill.\nOverall, I think Batman: Arkham Knight is a game polished to absolute perfection from a development standpoint. It is definitely a title that everyone should play.\n\n[h2] Pros: [/h2]\n- Stunning Visuals\n- Very good combat system\n- Batmobile integration\n- AR challenges are well made\n- Great voice acting\n\n[h2] Cons: [/h2]\n- Nothing\n\n[h1] Overall rating: 10/10 [/h1]",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "i truly enjoyed the storytelling and gameplay the batmobile can get to be overused at times",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Very advanced graphics and gameplay for a 2015 game . Amazing open world, love the dlc's. Very worth it, i 100% recommend",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Batmobile stuff is kinda meh. Overall a great game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "played it on xbox and one of the first games I installed when I moved over to PC think I played the story about 8 times now and on my 9th run do both hard and nightmare mode it's a game you can just chill and play but if you haven't played it I would really recommend you do, great story game great graphics and great mechanics the last good batman game in my opinion.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "9/10 – A Powerful Finale to the Arkham Series\r\n\r\nBatman: Arkham Knight delivers an epic, emotionally charged conclusion to Rocksteady’s trilogy, pushing the series to new heights in storytelling, gameplay scale, and visual fidelity. Gotham City has never looked or felt better—its rain-soaked neon streets create the perfect playground for the Dark Knight.\r\n\r\nThe combat system remains one of the best in the genre: fluid, tactical, and endlessly satisfying. The new fear takedown mechanic amplifies the feeling of being Batman, allowing you to control the battlefield with precision and style. The expanded open world is massive without feeling empty, and the villain lineup—from Scarecrow to the mysterious Arkham Knight—drives a tense and dramatic narrative filled with memorable moments.\r\n\r\nThe Batmobile is the biggest gameplay addition, and while it’s exhilarating to race through Gotham at high speed, the tank-style combat sections become repetitive and occasionally disrupt pacing. Still, when used for traversal and puzzle-solving, it feels fantastic.\r\n\r\nCompared to older Arkham titles:\r\n\r\nArkham Asylum delivered a tighter, more focused Metroidvania-style experience.\r\n\r\nArkham City expanded the world brilliantly with a perfect balance of story, exploration, and side content.\r\n\r\nArkham Knight goes bigger than ever, trading some of that tight focus for sheer scale and spectacle.\r\n\r\nWhile it doesn’t surpass the near-perfect balance of Arkham City, Arkham Knight excels in maturity, ambition, and emotional depth. The ending is bold and unforgettable, making it a worthy finale to one of gaming’s greatest superhero series.\r\n\r\nA stunning, powerful, and cinematic send-off—just shy of perfection. 9/10.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First off, let me say that this game looks incredible considering it released 10 years ago, it genuinely looks like it could release today and still be praised for how good it looks. I'm gonna be so real, I didn't hate the Batmobile integration. I think it worked well for the game and outside of puzzles and the optional tank battles to destroy the bombs, how much it gets used is blown out of proportion. The gameplay is genuinely fantastic, everything they did to evolve on the combat and stealth in this game is really good and I definitely would play this game again (and will do so I can get the 240% batsuit). The story was pretty weak in some areas such as the Arkham Knight himself, his identity was a bit too obvious from the beginning and when they start showing specific flashbacks during the Panessa Studios section of the game, it's even more obvious and the logistics of the Joker disease is a little wonky in this game but overall the story worked. The side missions were great (especially the dlc ones) and it makes sense why you're asked to capture everyone to finish the game properly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "get all the DLC on sale and add the free roam mod or community patch. You will have the closest thing we havem to an arkham style batfamily game (that isnt gotham knights).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolutely phenomenal. It's been thought of down to every single detail and not a thing has been missed, the Batman Lore is all there down to a Tee, the villains, the heroes, the gadgets and various versions of them is all there, the storyline and side quests/missions are absolutely phenomenal.\r\n\r\nThe game gives you everything you expect of Batman and more, the gameplay is awesome, the moves and combos, animations pure fun to play and to watch, the graphic's they are on another level, the detail and depth is amazing, its like you are in a cinema experiencing the thrill on the big screen. The music and bass hitting thumps is all there and its all 100% Batman.\r\n\r\nOf all the Batman games out there, nothing tops or comes close to this, the develepors went all out and came up with a gaming masterpiece that will blow your mind!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It is a great game for its time, that's for sure.\r\n\r\nHowever... Not letting players see the real ending unless they collect all the riddles is a torture to which I am certainly not submitting myself. This challenge is far and far more difficult than any other in the game.\r\n\r\nI spend 20 hours and did all the challenges + the Riddler's until the last stage. That is certainly not a lot of time to spend on ALL challenges but one. So, why does ONE challenge is so time-consuming then? It just does not make sense...\r\n\r\nOverall, I would still recommend playing it, as I, after completing the game for the second time now 10 years after the first completion, certainly have had a good time. But watch the ending on YouTube, because it is just not worth it...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily in the top 5 greatest superhero games. Along with Batman Arkham Asylum, Batman Arkham City, Batman Arkham Origins and Pepsiman",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the best superhero game ever made, though my personal favorite remains Arkham Origins (because Christmas). Also yes - I am aware that Marvel's Spider-Man exists, which is great, but this is peak. Not to mention how Arkham Asylum reinvented the genre. Great controls, visuals that didn't age one bit, good sound design and fantastic voice acting. I had some minor issues in my 2nd playthrough with black texture flickering under certain conditions and a few camera hickups, but nothing major. Compared to my 1st playthrough, where I had abysmal FPS and had to finish the game on the Xbox, this time it was smooth sailing at 4k 60fps. \r\n\r\nAmazing experience, worth the full price to this day, though it goes on sale all the time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Literally the best game of all time. Other games seems boring after playing this game. I'll never forgive Rocksteady for not continuing the series.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "for a 10 year old game, graphics, gameplay and story are all phenomenal and still hold up to this day. If you get this game on any form of sale definitely get it, it's 100% worth it, even with my little progress I already love the game and story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a game. It is easily the best in the franchise when it comes to gameplay and mechanics. The story was great too, although it felt a little short. The side quests were very enjoyable. Some people do not enjoy the Batmobile combat missions/side quests, but I actually enjoyed them.\n\nIf you want to maximize your enjoyment, make sure to complete the AR challenges. They are tutorials that allow you to practice and experiment with different combat techniques as Batman. Most players skip them, but completing them made me appreciate the missions and the side quests much more because I understood the different ways to take down enemies, and executing those moves was a lot of fun.\n\nOne criticism I have is that the boss fights were lackluster. They were not very challenging, so they did not feel rewarding.\n\nAnother issue is the design flaw or bug described in this post: https://www.reddit.com/r/PS4/comments/3bgtjp/psa_batman_arkham_knight_game_breaking_bug_leave/\n\nI completed the main story but could not unlock the final animation because of this issue, so make sure to read about it to avoid the problem.\n\nEven if you are not a Batman fan, you will enjoy this game. I had a great time with the entire franchise. Arkham Knight was my favourite.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gran juego, voy por la mitad y no tengo quejas, los controles al principio fueron un poco confusos pq soy disléxica y no juego con un mando, pero con el tiempo le agarras la técnica y se vuelve relativamente sencillo, simplemente un juego excelente 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is it. The quintessential Batman experience. It feels a little bloated in some ways, and the addition batmobile is leaned on quite heavily, but the game quite simply has everything you want from a game where you play as the BATMAN. This is the end of the ARKHAM story, and it pays homage to the classic Batman notes, while doing enough original to be engaging, and doing all of it well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but don't like the Batmobile aspects of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really good game even tho its pretty much same thing over and over but uhh its fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To me this is the best Arkham game to date. From more side quests to more story driven & probably the best Batman suit to date. Plus it’s the first time you can use the Batmobile. Gameplay is smooth & a lot better than Arkham city in my opinion. The only negative I will say is the challenges are a lot harder to complete but with the benefit of having extra characters to play is more entertaining. In conclusion amazing story,combat & tension. 100% would recommend anyone buying this for the best Batman experience to date.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Another amazing entry into the Batman: Arkham series. I really enjoyed the story of this game along with the combat, my only complaint/dislike is the tanks and overly futuristic stuff throughout the entire game. It wasn't bad just felt very different after playing the rest of the games and majority of the time felt unfun to deal with the tanks and/or drones.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just diving in less than 2 hours, i already loved it. in terms of gameplay. totally worth to get",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good batman game, on per with the insomniac spiderman games in terms of graphics, attention to detail, and story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Im amazed how great these visuals are, and how happy my PC sounds when playing this game, its sad to say some big games are still struggling for visuals this good. The story isnt as good as city but dang if this was a 3 movie series it would probably be the best batman movies ever made. This story is so peak and this is such a great climax to it. A lot of people dislike the crazed use of the batmobile, I think in the story its great, but if your attempting to 100% the game its overused a lot, it gets real boring after a while during the bombs around the city side quest, and just becomes point and shoot, and dodge, and sometimes shoot missiles instead then point and shoot the other cars instead. Despite that, the game is great and the batmobile addition with being able to drive around in it makes the game so much better.\n\nAnd i almost forgot. My least favorite thing about this nearly perfect game, theres NO batcave (excluding the AR one). I thought they would add it especially after playing origins with a great batcave. Although i think im literally the only one who cares about this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So much attention to detail, absolute peak. Great gameplay, great story, and a great world/atmosphere. Joker's VA is hilarious just like the previous games. It's criminal this is the last we got from Rocksteady, an absolute masterpiece of a game. Never forget what Warner Bros took from us, forcing them to work on some gaas slop. Utterly disgraceful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "88/100\n\nVery nice capper to a great trilogy. This game aside from being a visual anomally it runs really well and the gameplay flows so well. There is never a moment in the game where I'm standing still for too long. There is always something to do or wander upon.\n\nI still think Asylum is the best of the three but Knight is right behind it. Shame we won't see any more Batman games of this caliber unless someone takes a risk.\n\nEDIT* DLCs are pretty good for the most part. The most wanted stuff that integrates into the base game is a must. The chapter DLCs were mid in my opinion. Only the batgirl episode is truly worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman: Arkham Knight is easily one of the most polished superhero games ever made. Rocksteady created a Gotham City that feels alive, dangerous, and relentlessly atmospheric. From the rain-soaked streets to the neon reflections across every rooftop, the game pulls you into a world that feels straight out of a graphic novel.\r\n\r\nThe combat is peak Arkham — fluid, weighty, and endlessly satisfying. Every punch, counter, and gadget throw feels like you’re choreographing your own Batman movie. Predator encounters are even better, giving you complete control to stalk, intimidate, and dismantle groups of enemies with style.\r\n\r\nThe Batmobile is the most controversial addition, but honestly, once you get used to it, it becomes a core part of the experience. Roaming Gotham at high speed is thrilling, and tank encounters—while repetitive at times—deliver some of the game’s biggest blockbuster moments.\r\n\r\nWhat truly elevates Arkham Knight is its storytelling. The psychological battle between Batman and the Joker is brilliantly executed, with some of the best performances in the entire genre. The Arkham Knight mystery is predictable for fans, but the emotional payoff is still strong.\r\n\r\nSide missions bring Gotham’s villains to life, from the Riddler to Firefly, making the world feel dense and dangerous. Completing the “Knightfall Protocol” gives the game a truly memorable finale.\r\n\r\nOverall, Batman: Arkham Knight is a near-perfect farewell to the Arkham trilogy. It’s cinematic, immersive, and still unmatched in atmosphere and polish. If you want the definitive Batman experience, this is the one.\r\n\r\nRating: 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just tried this game to see the graphics which is really good considering this came out in 2015. It's just that linear story games are not my cup of tea..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is not made for lame ahh niggas, and thanks to ma hb nouaim 4 blessing me w this game and a fucking REMINDER, this game is not made for LAME ASS NIGGAS, you understand that boi, this ain nyc type shit( like i mean u gotta fk w real nggas in this game) or like mos🐄, anyways have a good day. 🤟🏻🐺🇰🇬🇹🇷🇦🇿🇭🇺🇹🇲🇰🇿🇺🇿",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Waited 10 years to play this game. Whole time I thought “surely the Batmobile can’t be as poorly integrated as people say”. It is exactly as bad as people say. Very fun otherwise though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best combat and atmosphere in the frnachise. Story? It's very good but i have a few critiques of it whihc i will not say because of spoilers. You should play this game after finishing Arkham Asylum, City and Origins. I don't mind the tank battles at all, I just mind the boss battles. Rocksteady was very lazy with the bosses in this game. But every other aspect of this game makes you feel like Batman. 9.3/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game amazing graphics but the batmobile takes the fun away",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played all arkham games and after replaying them in years every singletime im came to realize how much perferct they portrayed every side of batman in all of the games from fear to mercy and anger",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a erie play to it. The game has a lot of missions and other fun things to do really recomend if your in for a adventure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There may never be another \"super\"hero game like this. absolutely astounding writing, the perfect end to an incredible trilogy. Beautiful graphics, wonderful fighting system, tons of content, so many heroes and villains with great side stories. an extraordinary game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. Looks great, plays great and feels great. Story on the other hand is kinda not my thing and the overuse of the batmobile in some sections. Also the achievements, rip my confidence I ain't attempting none of those for at least another year or two.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best batman game and the Epitome of the Arkham series. If you enjoy puzzles and action this game is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are looking for a game that is really good and also has an open world, trust me, this is the game that you're looking for. Just go with it blindly, and it is worth it even if you pay the full price for the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an amazing game. I only just played the Arkham games in 2025, but this one especially still holds up even after 10 years.\nPlaying this right after Origins (I played in release order) was surreal. The visual upgrade this one has compared to the others is amazing. I really enjoyed the story and the gameplay in this one. I never felt like I was doing a chore, even when I was grinding the riddler trophies, which I never did in Asylum and City, and even doing them in Origins was kinda frustrating at times.\nI wish there were missions like in Origins where you used the crime scene reconstruction and maybe a bit less of the Batmobile. I understand that they wanted to showcase it being the biggest new feature in this game, but sometimes it felt a bit too forced, but by the end it kinda grew on me and I enjoyed it.\nWhat I find weird is that the game never even tells you about one of your gadgets, the freeze grenade. I was already at 95% completion, still waiting to finally get my last gadget so I can get to some of the riddler trophies, but you can just straight up get them from pretty early on in the game, they just never tell you to do it.\nOverall I think the Arkham games are amazing, and this is the peak of what those games can be. Buying these in my opinion is a no brainer if you're even remotely interested, considering you can get the trilogy for like 9€ during every sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a guy who played the entirety of Batman: Arkham Asylum, and Batman: Arkham City earlier this year, Arkham Knight is by far my GOTY for 2025. I would like to start with my reasons:\nIn terms of Graphics and Gameplay, this game came out 10 years ago, and yet the game looks as if it came out this year, on top of that, the entire style of Batman: Arkham Knight is like Rocksteady telling you that, \"This is 100% a Batman/DC game, and not something entirely different\". To top it all off, the Combat, in Arkham Knight feels much better than both Asylum and City. The F.E.A.R system is a cool concept, as you can pick a target, and quickly move to the next one without them spotting you. Plus, my personal favourite thing of this game: The Batmobile. While I love the Dark Knight trilogy's Tumbler, and BTAS Batmobile, the Arkham knight Batmobile fits well, as it is also a Tank, plus Car at the same time, however, in my opnion, a loud tank plus car hybrid doesn't sit well with my take on Batman. But, I do love the Tumbler, and the animated series Batmobile.\nIn short, Batman: Arkham Knight is my GOTY 2025 because of the Graphics, Gameplay and Overall story conclusion it brings for the Arkham series Batman. I hope that Rocksteady will not make the same mistake with Suicide Squad: KTJL with their new Batman, or Superman game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I loved playing this game. The story is good (I was a bit less interested toward the end), the combat is engaging, the atmosphere is dark and gave me a bit of a retro/futuristic vibe with the city and its buildings, and graphically it's beautiful to see even today. The only thing I didn't like about this game was that too many boss fights that could have been epic have been turned into a battle of tanks. Which I wouldn't have minded for a couple of times, but it's just too many and I was disappointed by it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An absolute masterpiece. The game was so rich and fun — from the story to the graphics to the gameplay. I couldn’t get bored of it, and even the DLCs felt like cinema.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Perfect batman game. Doesn't capture the Bruce Wayne part but captures the batman part to perfection. The storyline is great. The stealth is perfection.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Saving Riddler for last and beating the crap out of him was the most euphoric satisfaction I've ever gotten from a game. Can't believe it took me this long to pick this game up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "recently replayed on pc after years, it's great!! the story is super engaging and the side content isn't overwhelming but is still interesting and fun to do. i love joker in this game, mark hamill did a great job per usual.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "realistic, funny character voice lines, and overall great game flow.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it originally on the PS4 back when it came out in 2015, right after my birthday. It still slaps, with some minor issues that literally can't be fixed at all anymore. Mods make the game even better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story will touch your soul more then the other Arkham games, amazing gameplay, mechanics, graphics that hold to this day 2025, one of my favorite games ever, especially if you are a DC fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even in 2025 better then most games out there. Don't even think twice and buy the game already.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my favorite Arkham game out of the 3 I played. I will suggest anyone to play these games in the order of release, from Arkham Asylum to City to Knight. They're so special and its really cool how each game improves from the last one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Using the BatMobile all the time seems to be annoying, besides that this is the best Story Mode games of all time, the graphics, the mechanics and the villians as well. All things fit and give the best experience possible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is truly a masterpiece. Easily one of the best singleplayer games I've played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i mean its batman you cant really go wrong with any of the batman games.... except when the put batman in that newer game yk what it is",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story is fire and the combos go so hard. Best of the series imo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has this game irreparably damaged Batman's reputation as a guy who exclusive goes to break peoples' bones? Yes. But hey, it looks cool. And I get to drive a tank that shoots non-lethal hypersonic rounds and has a non-lethal electric bumper so I can non-lethally ram into bad guys at 200 miles an hour.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman: Arkham Knight is a cinematic, action-packed finale to the Arkham trilogy. Gotham looks incredible, the combat is smooth and satisfying, and the story delivers strong character moments, even if the Arkham Knight twist is predictable. The Batmobile adds fun new gameplay but is overused, especially in tank battles. Despite some pacing issues, it’s still one of the best superhero games ever, offering the most authentic “I am Batman” experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "No superhero game will ever come close to Arkham Knight it's just too good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best batman game by far, massively improved in all aspects, combat is way more fluid compare to previous games, batmobile combat is a lot of fun, graphics are truly stunning and put a lot of modern games to shame, Gotham atmosphere is more immersive then ever, Storyline is the best out of the Arkham trilogy with great voice acting and presentation. I've had a lot of fun with this game and i highly recommend it, alongside Spiderman Remastered this is the best superhero game i ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don’t know what kind of sorcery Rocksteady pulled off with this game, but man, it puts a lot of modern AAA titles to shame. The combat is incredibly satisfying. It does rely on the Batmobile for a good chunk of its gameplay, but even then, it’s still one of the best games I’ve ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuine masterpiece.\r\ncombat and stealth are still the best in any game i have played to today",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman Arkham Knight is honestly a masterpiece. Become Batman and roam the streets of Gotham City by gliding through the air or driving the batmobile; Fight crime in hand-to-hand or stealth-action combat.\n\nYou'll face some of Batman's iconic villains as well as the Arkham Knight, Batman's primary enemy of this game. Literally take on the role of Batman and dish out Justice in the ways that only Batman can.\n\nBatman Arkham Knight also has a challenge mode with combat maps, stealth maps, time trials, etc. and those can be fun; The DLCs also add a lot of content ranging from alternative batman outfits to storylines for other characters...\n\nI'd highly recommend Batman Arkham Knight with OR without the DLCs. Definitely one of the best of the Batman Arkham series in general.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game creates the perfect conditions to play in an open city sandbox by evacuating all the residents.\nThe streets are overrun by criminals rioting. You'll be brawling, racing, sneaking, solving a crazy amount of puzzles and investigations with Batman's fantastic gadgets.\nTake on a big cast of villains and your own daemons to safe the city at all costs.\nIt's not all grim. The mundane conversations the henchmen have are fun and Joker is there to lighten the mood.\nI advise to read the on-screen hints when you get stuck, because you sometimes get specific button combo's to finish an enemy. Some puzzles are only solvable when you get a gadget later in the game. Move on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman: Arkham Knight delivers a spectacular finale to the Arkham series, with stunning visuals, smooth combat, and the most atmospheric Gotham yet — dense, rainy, and alive. The graphics and overall gameplay still feel fantastic even many years after the initial release.\r\n\r\nThe story is strong and emotional, with great character moments and a satisfying payoff for long-time fans. The Batmobile is a major part of the experience — sometimes divisive, but undeniably impressive in action. A highly replayable and polished ending to Batman’s saga.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best Batman experience ever if we exclude Arkham asylem and city and some lego games) This version has timeless visuals",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "5 / 5 ⭐⭐⭐⭐⭐\r\n\r\nOmg this is easily one of my FAVORITE games of all time — and my #1 superhero game ever. I first played it in 2016 on Xbox, and now replaying it in 2025 on PC (4K upscale, max settings, mods, HD textures, keyboard + mouse). Yes, the PC port isn’t perfect and you can tell it was designed for console first… but, even with that, this game still SLAPS.\r\n\r\nGotham at night with constant rain is straight ART. The atmosphere is insane — dark, moody, cinematic, almost S.T.A.L.K.E.R-level immersion but in a superhero world. Rocksteady really hit peak Batman here.\r\n\r\nCombat is addictive AF — simple to learn, BUT if you actually master the flow, gadgets, counters, stuns, environmental takedowns, etc., it becomes one of the cleanest combat systems ever made. You feel like a TRUE Batman. Notable: strike → counter → evade → gadgets → Special Takedowns. Pure satisfaction.\r\n\r\nTraversal is GOD-tier: grapplin, flyin, glidin thru stormy Gotham, chain-grapplin into speed-glides… insane. And the Batmobile? Cool addition (tank mode, EMP, hacking, dashes), even if the game forces you to use it a little too much.\r\n\r\nStory & villains? MASTERPIECE.\r\nScarecrow, Arkham Knight, Joker (in your head), Penguin, Two-Face, Ivy, Firefly, Man-Bat, Professor Pyg — ALL top notch.\r\nThe voice acting is legendary: Kevin Conroy, Mark Hamill, John Noble, Troy Baker. Cinematic as hell.\r\n\r\nSide missions are awesome too — Firefly chases, Two-Face bank heists, Penguin arms trafficking, Man-Bat hunt, Azrael trials, and the incredible Professor Pyg opera killer detective case. So much variety.\r\n\r\nBUT… the one thing that sucks?\r\nRiddler.\r\n243 trophies, forced puzzles, Batmobile races, random BS everywhere just to unlock the “true ending.” It completely kills pacing and feels like filler. And the boss fight is beyond lame. Worst part of the game.\r\n\r\nAnd DLCs… yeah, trash. Super short, buggy, pointless. Don’t bother.\r\n\r\nBUT the core game?\r\nMASTERPIECE. One of those rare titles where you deadass wish it never ended.\r\nYou don’t “play” Batman — you BECOME Batman.\r\n\r\nEasily 5/5. Absolute must-play if you love superhero games, dark atmospheres, or cinematic action.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wont say shit, play it you'll understand how backwards we got in gaming post so many years of arkham's release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ll be real: I love the Batmobile. It’s overused, sure, but cruising around Gotham at night feels ridiculously fun. The city looks insane, combat is at its best, and the whole game feels like a polished finale. A little messy in spots, but man… when it works, it really works.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice graphics, gameplay, mechanics and really good story mode. i would recommend this to anyone who wants to play a story rich game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun batman game and a very good story. The combat is very very good. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman beats homeless man to death. What is not to like about this game. Fun experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best story driven detective open world game. As fan of Batman Universe I loved it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The EPIC conclusion to the Arkham Tetralogy (that's right. Arkham Origins exists and it is a good game.). This game had the best announcement trailer and the tag of BE THE BATMAN. And it lets you do just that. You get to play as the caped crusader one last time and go out in style. The combat is yet again improved with better enemy combatants, the stealth is improved but so are the enemies who now know how to counter your stealth tactics. You get to drive the BATMOBILE and terrorize criminals. The stakes are high. As of today, when I am writing this review, there are still very few games that look as good as Arkham Knight does 10 years later. The wizards at Rocksteady managed to somehow pull of some of the best visuals ever in a video game. Gotham looks alive, Gotham breathes, every inch of Gotham reacts to it's surroundings. The story, not as great as the previous games, is still very good and has a very satisfying end, with a secret ending after 100% completion. A must play and a proper swan song to the Arkham Franchise. Play it and BE THE BATMAN !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved Asylum and Arkham City but this one is my favourite, it takes the cake!\r\nExplore Gotham City, traverse the rooftops or travel via Batmobile! \r\n\r\nThe game gives you a great setting, Gotham City!\r\n finally letting you explore Gotham so much to your hearts content, definitely the definitive Batman Game!\r\n\r\nStory is also fire! My personal favourite of the trilogy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mt first Batman game. And it's sooo goooddd. I really like the atmosphere and Joker on this game. Yeah, play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply amazing, still holds up in 2025. Gripping story, batmobile, all the characters from the comics. Everything is top notch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman Arkham Knight is the second-best Arkham game, right behind City for me. It just feels like the series at its peak, big, flashy, and super fun to play.\r\n\r\nThe way they use the Joker in this game is incredible. Even though he’s supposed to be gone, he pops up in Batman’s head constantly, and it’s done so well. He’s funny, creepy, and actually adds a lot to the story instead of feeling forced.\r\n\r\nI also really liked the Arkham Knight as a character. He shows up everywhere, and making the whole game feel more personal. The twist is also great. Even if you kinda see it coming, the way they reveal it is really satisfying and personal to all characters involved.\r\n\r\nBatmobile sections can be a bit much, but overall the combat, stealth, and story are all top-tier Arkham stuff.\r\n\r\nIf you like Batman or the other games, this one is 100% worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played trough the collection, and sunk pretty much the most time into this one alone. Which says a lot.\nExcluding AR challenges, ive done all i  could in the game and had a blast. The story was a rollercoaster on its own, the gameplay of fights, stealth and traversing the streets of gotham all felt really fun, ive not had a section where i felt like the game feels bad. \n\nEven going out of  my way for all of gotham most wanted was fun enough that i DELAYED the main story to do what i can at current points, and then after that still willingly went for riddler completion that suprisingly was just as  fun to do i didnt even feel how long it took.\n\nThis is a definitive \"must play\", and probably one of the best superhero games of its time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun! Lots of side missions that add to the story. Hours and hours of play time. This is a game that I will enjoy completing 100%.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just realized i never wrote a review for this game even when it is PEAK GAMING! This game has it all, the most perfect and superb combat system of ALL the arkham games, a good enough story (some people may like it, some people may not), GRAPHICS ARE SO GOOOOOOD! and a still active community making mods for the game (and they have some very good mods in it), the DLC's are great, the music is amazing, though, some of the batmobile sections are a bit... underwhelming, but, good enough i guess. A MUST BUY FOR ANY PERSON",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game's PC version was a travesty upon first release, but nearly 10 years later, it really  shines.  Runs extremely well on a 3060ti from 2021.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☑ Beautiful\n☐ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☑ Eargasm\n☐ Very good\n☐ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Difficulty }---\n☐ Just press 'W'\n☐ Easy\n☑ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☑ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☐ Average\n☐ Good\n☑ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☐ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☐ 8\n☑ 9\n☐ 10\n\n---{ Author }---\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the real black sheep of the Arkham series. The gameplay is perfected and smooth like buttah. However this game is clearly not finished and was rushed out the door over a year early. Boss fights are non-existent. There is ample evidence in the game files of more fleshed out boss fights, leading me to believe they were cut to meet an unrealistic release window. It's a shame that the game with the best gameplay in the entire series never once asks any more from the player other than basic combat and predator. I hope that in the future if Rocksteady ever re-releases this game in some form or another, they go back and deliver the promise this game has the potential to fulfill by actually finishing it. Great storytelling techniques, great acting, great writing, very little leudo-narrative dissonance. Excellent game - I just wish there was more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Goddammit the amount of Batmobile-related mission in this game is diabolical. I know it's a new feature so Rocksteady wanna implement it into the game as much as they can but seriously? It got to the point of becoming so repetitive on top of already being so stressful I hardly enjoy any of those missions (freaking cobra). And not to mention the use of the Batmobile in some missions were dumb af cuz wdym you brought in a freaking notorious mercenary but instead of a hand-to-hand boss battle it's another damn tank mission? It's the same freaking problem like with AC and honestly a wasted opportunity for an epic showdown, especially when Rocksteady was able to pull that off in AO. But all in all, driving the Batmobile around the city without all the chasing and shooting part is, I must say, fun. \n\nThe graphic and the music are so good it's hard to believe the game was first released in 2015 - even better that some recent Batman games (I'm looking at you GK). LOVE the Arkham Knight design and voice, he's both cool and dramatic i love him lol. Him in AR challenges is my favourite part of the game as well, I lost count of how many times I've come back to AK just to play as him. On the other hand, I feel like the Arkhamverse definitely has some kind of beef w/ Tim because wtf are those designs? It was bad in AC but smh it got worse in AK. Like, Rocksteady gave him a freaking bald head and a much older face then have the audacity to say he's a student in his profile.... bro he looks like he's fucking 30 AT LEAST. His other skins are basically just... young Dick. His... loveline with Barbara is kinda weird to me and uncalled for, too. But other than that, I think the game did an okay job.\n\nOverall, I enjoy the game, more than I anticipated. Would definitely recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite Batman: Arkham game, I grew up with this franchise and the evolution was beautiful the result being this is welcoming. This game has wonderful visuals and great story, and the most modern and expansive combat of the Arkham games. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games ever. realistic and tragic. everyone should play this game or whatever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game will forever exist in my top 5. The story is fantastic, heart-wrenching and explosive.\n\nI love the combat and the driving, both feel so smooth and well designed. And everything just feels so *gritty*. This is the Gotham I love and fear.\n\nEverything has an edge to it that keeps you on your toes from start to finish. Also, the graphics have really stood the test of time. It feels like a new gen game even though it's 10+ years old.\n\nIf you haven't played, you absolutely need to.\n\n11/10 recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10. I will not cover the usual cons of this game, as they've been talked into oblivion...\n\nAdmittedly, being my first PS4 title, and my introduction into The Arkham series, my nostalgia is through the roof. However, 10 and a bit years on, i keep coming back to Knight. \n\nWhile it has far less atmosphere and aura than City and Asylum (Officer Balls), and the menus of this title have zero soul...its a graphical masterpiece of a game. i was SHOCKED how well it runs on Steamdeck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are a fan of batman I highly suggest you get this game. I also recommend  installing some mods to add to the experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Same classic combat and puzzles! Story was really good and had my hooked through out my playthrough. 9/10 \r\n(Arkham City is my fav tho)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman: Arkham Knight is one of the best superhero games ever. The story is gripping and Gotham feels alive. Combat and stealth are smooth and satisfying, and the Batmobile adds variety to the gameplay. The visuals are stunning and side missions keep you engaged. A must-play for any Batman fan or anyone who loves action-packed games with great storytelling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By far the best Batman game out there. The devs kept supporting it for a while and even added the Batman 2022 skin. Combat is smooth, the story is engaging and the voice acting is iconic (RIP Kevin Conroy) If you haven't played this yet then pick it up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "living in gotham simulator\n\n[spoiler] is this a safe space to say i love [strike] jason [/strike] the arkham knight more after this game [/spoiler]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best superhero game I have ever played and the nostalgia this brought can't be beat.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "On par with Arkham City, I can't really tell which one is better. Literally only complaint is some of the tank gameplay feels repetitive and slow compared to the regular/racing gameplay. Aside from that, possibly tied with city for the best game in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman: Arkham Knight is a third-person action game developed by Rocksteady Studios and released in 2015. It serves as the conclusion to the Arkham trilogy, bringing the series to an open-world version of Gotham City. The game refines the franchise’s signature combat, stealth, and detective mechanics while adding the Batmobile as a major new feature.\n\nThe story follows Batman facing the Scarecrow, who threatens Gotham with a new fear toxin while the mysterious Arkham Knight leads a militia to hunt him down. The narrative explores Bruce Wayne’s psychology and his relationships with key allies and villains. It’s darker and more introspective than earlier entries, building toward a definitive ending for the series’ version of the character.\n\nGameplay blends three main pillars: hand-to-hand combat, stealth predator encounters, and open-world exploration. The Freeflow combat system reaches its peak here—fast, responsive, and fluid, with new combo takedowns and environmental interactions. Enemy variety and coordinated attacks add more tactical depth, pushing players to adapt instead of relying on repetition.\n\nThe Batmobile is the central addition. It functions as both a high-speed vehicle and a tank, capable of combat and puzzle-solving. While visually impressive and fun to drive, its frequent use in missions and combat segments received mixed reactions for interrupting pacing. Nonetheless, it integrates smoothly into the world and showcases the game’s technical ambition.\n\nGotham City itself is a standout achievement. The world is fully explorable, filled with rain-soaked streets, neon lighting, and vertical architecture designed for fluid traversal. The seamless gliding and grappling systems make movement effortless and cinematic. The dynamic weather and lighting effects showcase the power of the upgraded engine.\n\nTechnically, the console versions perform well, though the PC launch was plagued with severe optimization issues that required extensive post-release fixes. After patches, performance stabilized, and the visual fidelity remains impressive even years later. The sound design and orchestral score maintain the series’ cinematic tone, and the voice cast—led by Kevin Conroy and Mark Hamill—delivers strong performances.\n\nIn summary, Batman: Arkham Knight is a bold and visually stunning finale to Rocksteady’s trilogy. It refines the combat and stealth systems to near perfection while expanding Gotham into a living, atmospheric city. Despite overreliance on the Batmobile and a troubled PC release, it stands as one of the most ambitious superhero games ever made, delivering both mechanical polish and narrative closure worthy of the Dark Knight’s legacy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Batman: Arkham Knight delivers an epic conclusion to the Arkham trilogy. The open-world Gotham is stunning, the combat fluid, and the story emotionally gripping. The Batmobile adds thrilling gameplay variety, and the voice acting shines. It’s a masterful blend of action, stealth, and storytelling—an unforgettable superhero experience.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "ATTEMPTED 100% ACHIEVEMENT REVIEW:\n\nI literally turned into the joker playing this game.\n\nThis is by far, one of the worst games I have ever tried to 100% in my entire life. The achievements are tedious, unfair and balanced against you.  Don’t get me wrong, a lot of them are easier than others, such as most of the side missions and the main story missions. \n\nYou’d think the problem would be the riddler trophies, but that’s the least of your worries. Infact, they are relatively the easiest achievements you can work towards if you passively play with the story, you’ll pick em up along the way, and have fun with it. \n\nThe AR challenges are some of the worst I’ve ever seen in my entire life. Groups of enemy’s UNHARMED WITHOUT USING GADGETS? A 450 COMBO STREAK NEEDED TO BEAT ONE GUY? It’s not fun, it’s not rewarding, and it’s absolutely not worth the time you put into this game. This is one of the only games I would not reccomend to 100%, it genuinely will make you want to die. Absolutely not worth it.\n\nThe story is meh, the ending is also meh, but it has some cool aspects in the game, the combat is nice, the side quests are interesting, I’m not big on Batman but I now know some characters from the story that I haven’t known from anywhere else. It was nice seeing little additions from the comics and how they were put into this game. \n\nBuy Batman a coffee, he’s been up all night trying to save you, but if your thinking about 100% achievements for this game, you will hate yourself and all the Time you put into it by the end of your over 200+ hour play though. It would be easier to 100% Payday 2",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The team behind this game is apparently so proud of their introduction of the Batmobile, they decided to turn this into a Twisted Metal + Need for Speed game, rather than keeping the core identify of stealth, combat, and puzzle solving. Every bit of fun that can be potentially had with the game, gets instantly taken away by forced vehicle combat, and even more awful racing sections that serves no purpose in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So, I played through Asylum and City, naturally moving onto Origins, which I honestly did not enjoy at all...Moved onto this game, initially thinking it was pretty cool and a big improvement on the series, which in many ways it is. However, I hate the reliance on the batcar, especially in the racing segments they have in certain places. Maneuvering a car onto a roof in this game isn't cool; it's about as hard as it would be in real life and very frustrating, as well as many of the side missions being very misleading, long, drawn out, and just not fun enough to justify the depth they add to the story. You could honestly watch a youtube movie of this game and call it done. 5/10 stars, well made game, but the gameplay department really let me down on this one. Good story though. SPECTACULAR! Ironic, but the story is the only reason i forced myself to keep playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Liked most of the story, flying and hand-fighting, but would not recommend it as it's overloaded with racing and tanks battles missions which quickly become tedious and repetative, as if the developers have ran out of ideas, and exploited it well beyond the reasonable point to fill the play time. And what makes it even worse -- the camera and controls for batmobile are extremely bad. \r\n\r\nIn racing missions the camera does not follow the direction of the car, which makes tunnel stunts huge pain and guessing.\r\n\r\nRiddler puzzles and many other side stories exploit racing and tank battles. As the main story goes towards the end it's just tanks-tanks-tanks and racing without any break, very frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game on Xbox. i bought it in a bundle on sale recently and it is literally unplayable. Constant stuttering/freezing. didn't even make it through the first scene before uninstalling. i tried looking for solutions online and all i can find is \"it's just a bad port.\" with how old this game is it should be criminal to have it on any pc game service in the condition it is in. again, it is unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Insanely bad checkpoints and the end mission is horrible because the car physics and camera placement is completely weird.\r\n\r\nGood graphics but gameplaywise not the best :((((",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its not batman: arkham knight, its batmobile: arkham knight. lol. the batmobile is a terrible forced edition to this game and you need to use it 70% of the game. i paid to play batman not his car rocksteady",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game while it can be fun was not for me i died way too many time the game got harder the more you lose and just made me mad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ni pude jugarlo, constantemente hacia suttering, puedo correr juegos AAA sin problemas y este juego choto se frena como si tuviera mejores graficos que el RDR2, lo ponen en oferta justamente por eso, una verguenza",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst arkham game in the series, and by worst I mean I could barely finish it\nMy biggest complaints are:\n- Why did they fill up a batman game with racing/tank sections? Did anyone ask for this? Did anyone ever say \"Man, I wish batman was more like fking forza horizon\"??? After every tank/car section I was like \"Thank god it's over I hope the rest of the game doesn't have any\", but they kept coming, like over and over again The final boss essentially had 1 tank 1 car and 1 stealth phase (all of them were disappointing), I think during the car section i put on an episode of the joe rogan podcast because the game was that unbearable, Did any of the developers get diagnosed with down syndrome during the development?\n- Unmemorable bossfights/enemies, I just finished the game recently and I cannot recall (besides the arkham knight) any of the bosses that i fought, there are like mini bossfights as side quests but those not worth mentioning, taking the series' past entries as a base for comparison just makes this game even more of an embarrassment. asylum had: joker, scarecrow (cool ass visions), killer croc, harley, bane, ivy, like most of the classic established batman villains, this game has a downgraded scarecrow and an ex robin with daddy issues, like wtf\n- Shit story, the story for this game was so underwhelming, it was probably made by moderately overweight liberal middle aged white woman working in hr, again i just finished the game and there were so we few memorable moments i don't remember anything (or maybe i just have dementia lol)\n The pros:\n- Game looks good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is down right idiotic\nThe Bat tank is like the flu, everywhere and no one asked for that\n557 million riddler trophies\nAAAAAAAAAAAnd played the game for 5 hours yesterdy where I fought and defeated the Arkham knight, decided today to keep playing, and the game decided to not only not save my progress, but also send me back to before I did the protect Ivy mission, so that is about extra 2 hours besides the 5.\nafter all these years, it is still a disappointment,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a Batman game.\nInstead of gliding through the skies, you're some bloke in a tank, driving through a lifeless dump.\nWhich is all extremely boring and belongs to a different genre.\nAnd since it's mandatory for pretty much everything, this game is a total failure when it comes to entertainment.\n\nI haven't partaken in any interesting action in 3 hours, not one fight worthy of the previous games, not even a single stealth section.\nRiddles are out of the picture, since one MUST first complete a tank parkour on a timer. Three times. As if that's ever going to happen with how boring a single loop already is.\nMain quest is out of the picture since, after being forced to do a bunch of boring tank stuff, I now MUST drive said ridiculous tank on rooftops, for ridiculous reasons.\n(The thing that would render that ordeal bearable, a manual saves menu, is of course out of intellectual reach of corporate slop makers.)\nBloody Hell am I bored !\n\nI call the visuals a failure as well, in particular the \"city\" design, with no landmarks, no attractive features, no colours, etc.\nNot to mention the poor visibility (even worse while driving.)\n\nI thought the 3rd Batman was bad because they botched all boss fights.\nHere, they botched the entire gameplay loop to make it all about C-grade vehicular combat and races.\nIf they continue on that nonsensical slope, future entries might take characters like Boomerang or King Shark and equip them with guns, as stupid as it sounds.\nCan't wait for Batman 5: the Batfarming Simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Batmobile sucks. Just the most forgettable of the series.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a reminder to myself not to reinstall this game even though I love Batman, because this game has terrible default controls and no remap option, as well as puzzle heavy boring game play that feels linear and suffocating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not being able to jump in this game is a massive turn off. You cant even get over an object the size of a curb, which forces you to walk around it. Very awkward movement.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck yourom mother fucker i get crash every second.. fuck your sister steam owner fuck your country mother bitch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i tried every method known to men but some how the game keeps crashing after the splash screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't even open. Would love to give this game a chance but I can't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keeps chrashing every 5 minutes with rx 9060",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nie można współżyć z ivy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my brother hates this dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yani begenmedim",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is great — the combat, the story, and Gotham City all look amazing. But the Batmobile completely ruined the experience for me. It’s overused, annoying, and the tank battles dragged on way too long. I wanted to play as Batman, not spend half the game doing awkward driving missions. The Batmobile pissed me off so much that I stopped enjoying the game.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "ATTEMPTED 100% ACHIEVEMENT REVIEW:\n\nI literally turned into the joker playing this game.\n\nThis is by far, one of the worst games I have ever tried to 100% in my entire life. The achievements are tedious, unfair and balanced against you.  Don’t get me wrong, a lot of them are easier than others, such as most of the side missions and the main story missions. \n\nYou’d think the problem would be the riddler trophies, but that’s the least of your worries. Infact, they are relatively the easiest achievements you can work towards if you passively play with the story, you’ll pick em up along the way, and have fun with it. \n\nThe AR challenges are some of the worst I’ve ever seen in my entire life. Groups of enemy’s UNHARMED WITHOUT USING GADGETS? A 450 COMBO STREAK NEEDED TO BEAT ONE GUY? It’s not fun, it’s not rewarding, and it’s absolutely not worth the time you put into this game. This is one of the only games I would not reccomend to 100%, it genuinely will make you want to die. Absolutely not worth it.\n\nThe story is meh, the ending is also meh, but it has some cool aspects in the game, the combat is nice, the side quests are interesting, I’m not big on Batman but I now know some characters from the story that I haven’t known from anywhere else. It was nice seeing little additions from the comics and how they were put into this game. \n\nBuy Batman a coffee, he’s been up all night trying to save you, but if your thinking about 100% achievements for this game, you will hate yourself and all the Time you put into it by the end of your over 200+ hour play though. It would be easier to 100% Payday 2",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "So, I played through Asylum and City, naturally moving onto Origins, which I honestly did not enjoy at all...Moved onto this game, initially thinking it was pretty cool and a big improvement on the series, which in many ways it is. However, I hate the reliance on the batcar, especially in the racing segments they have in certain places. Maneuvering a car onto a roof in this game isn't cool; it's about as hard as it would be in real life and very frustrating, as well as many of the side missions being very misleading, long, drawn out, and just not fun enough to justify the depth they add to the story. You could honestly watch a youtube movie of this game and call it done. 5/10 stars, well made game, but the gameplay department really let me down on this one. Good story though. SPECTACULAR! Ironic, but the story is the only reason i forced myself to keep playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its not batman: arkham knight, its batmobile: arkham knight. lol. the batmobile is a terrible forced edition to this game and you need to use it 70% of the game. i paid to play batman not his car rocksteady",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Liked most of the story, flying and hand-fighting, but would not recommend it as it's overloaded with racing and tanks battles missions which quickly become tedious and repetative, as if the developers have ran out of ideas, and exploited it well beyond the reasonable point to fill the play time. And what makes it even worse -- the camera and controls for batmobile are extremely bad. \r\n\r\nIn racing missions the camera does not follow the direction of the car, which makes tunnel stunts huge pain and guessing.\r\n\r\nRiddler puzzles and many other side stories exploit racing and tank battles. As the main story goes towards the end it's just tanks-tanks-tanks and racing without any break, very frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Since the only options are yes or no, I chose no to push the overall direction of the rating into Mixed.\r\n\r\nIt's not about the port - it was busted at launch but I've had no major issues with it since I purchased it. I'm playing under Linux Mint 22.2 running kernel 6.14 and Proton Hotfix.\r\n\r\nMy problems are with the game itself. The reason it's so frustrating is because it's great but it's so bogged down by bs that I can't give a full-throated recommendation.\r\n\r\nThe combat is the best it has ever been. The predator and stealth sections are incredible. They made some baffling choices - such as the changes to how thermal gel works in combat - but they don't detract from the overall experience.\r\n\r\nThe batmobile controls like a dream. The parts where you're speeding through Gothm or through Riddler's race tracks are fantastic. The tank combat feels really good but it's shallow; it's fine in small doses.\r\n\r\nThe problem is that tank combat segments can take ages unless you have certain upgrades. If you're focusing on the main campaign, you'll want to forego almost all of the really fun and interesting options you have for upgrading yourself for combat and predator sections in order to make the batmobile segments less of a slog. You also aren't doing yourself any favors if you only focus on the main game as you will need to complete all of the main objectives to get a decent ending. As a first time player, your choice is between pursuing a lot of side objectives that you may not care about in order to keep yourself leveled up for the challenges ahead or throw all your upgrade points into the batmobile so you can handle the next bs section where they throw 50 tanks at you without tearing your hair out.\r\n\r\nI started out thinking this was the best they ever handled the Riddler but then I got to tracking down all the objectives on the map. I'm still at it as of the time of writing this review. This is easily the worst set of Riddler trophies in the entire series. They are convoluted and time consuming and it's a cointoss whether the mechanics will even work right. I just completed a trophy where you have to set off an EMP and then perch above the electric field so you can hit the question marks when they turn back on. It should have taken thirty seconds. It took me ten minutes because I had to find just the right spot so the $%£\" line launcher would work. There are other objectives where you have to follow a trail of question marks that appear by sending out a pulse from the batmobile and you can be right on top of where the next one is supposed to appear but for some reason it doesn't until you wiggle the batmobile around a bit and suddenly the question mark decides to show up.\r\n\r\nIf I were Batman this is the point where I would have broken the no kill rule. I still want to complete all the objectives and even do new game+ but I'm reconsidering that with every new glitch or stupidly convoluted Riddler challenge.\r\n\r\nI want to love this game. I want this game to be my favorite in the series. I will probably never touch it again whenever I decide I'm done. The stupid parts of it are so stupid I can't fathom how anyone thought they were good ideas. The game has no respect for your time and too many things that look like interesting scenarios are immediately solved by throwing the batmobile at it. It's not that there's too much batmobile - it's that what was done with the batmobile isn't especially compelling and the batmobile segments in the main story tend to overstay their welcome and the few times I wanted to take a break from the main objective to do side missions were batmobile segments where I was locked in until I completed them.\r\n\r\nI have never loved AND hated a game this much. I got it on a steep sale where the entire trilogy was less than $10. I highly suggest doing the same. I'd give a strong yes to picking it up when you can get it for less than $10. It's a strong \"maybe\" if you're looking at getting it at its normal price.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Xbox controller not working, followed all guides people have put on steam/reddit none working, works fine for any other controller supported game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay mechanics are the best of the series but the heavy focus on the batmobile and the tedious side content ruin some of the enjoyment. Getting to the 120% ending a second time was a mistake.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game on Xbox. i bought it in a bundle on sale recently and it is literally unplayable. Constant stuttering/freezing. didn't even make it through the first scene before uninstalling. i tried looking for solutions online and all i can find is \"it's just a bad port.\" with how old this game is it should be criminal to have it on any pc game service in the condition it is in. again, it is unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I already didn't enjoy Arkham City and Arkham Knight is even worse tho prettier and when you turn your brain off pretty fun. The world still feels meaningless and empty even if big and pretty, the collectibles are still boring and overwhelming, the story is still meh even though the Joker shenanigans and the Arkham Knight backstory were pretty good. I feel like Batman trilogy keeps dropping on quality with every new entry. \nBatman Asylum was by far the best, it was tight, focused and packed a punch. The other ones didn't feel worth my time even if I got the whole trilogy on big sale. Thank God for Joker who seriously improved my experience in each of these games, the VA did a great job and the musical number in this game was probably my favorite moment of the whole experience!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Big Batman enthusiast, huge fan of the character, love the Arkham series but oh my god man. This review isn't about the performance or the port, I know how terribly this game launched on PC. I'm not here to talk about how broken the PC port was a decade ago; it ran fine for me, I just think it's a bad game. \n\nArkham Knight looks amazing graphically, I can't deny that, but that's most of what it has going for it. From a narrative and game design standpoint, this game is an absolute mess, especially when compared to City. I didn't want to harp too much on the batmobile, just because everyone does, but its such a consistent part of the experience that I kind of have no choice. It's really fun for the first 20 minutes you can use it! And then, you've exhausted all three of its functions and it starts to get really stale really fast. And while a lot of its usage earlier on is optional, Rocksteady makes it so unbearable, especially later into the game. Flooding you with vehicular combat encounters that wouldn't feel out of place in World of Tanks, except here its even clunkier. Not to mention it's miserable to control. The best use of it in the whole game is a boss fight where you're literally just running away. Because for once, it's being used for something different. Even outside the batmobile though, a lot of the hand to hand combat and stealth is just mind-numbing to me. \nThe predator encounters here have the same problem they did in Arkham Origins, wherein the first few are pretty neat and not all that bad, but the longer the game progresses, the more repetitive they feel. Every single area they take place in has the same layout, every single endgoal has the same function, the only thing Rocksteady does to keep things fresh is to just throw more enemies in the encounter to take care of. It's not fun, or engaging or interesting, it's just boring. The hand to hand combat is a bit more complicated. I can't deny that its undoubtedly the smoothest it ever was, but that's kind of why I don't like it? It's admittedly a total nitpick on my part, but part of why I liked the combat in Asylum or City or even Origins is that despite the fact that they got smoother over time (the jump between Asylum and City is insane), they still had this rough around the edges feel that made the combat feel just a bit more engaging to me. I always felt a sense of difficulty because of it. It made every combat encounter, especially boss fights, feel so much more tense. Knight doesn't really have this, because its too smooth. The only moments that truly feel dire are when Rocksteady lazily floods your screen with more enemies than you can keep track of (yet another problem carried over from Origins).\n\nI also just am not a very big fan of the story here. I know Paul Dini and Rocksteady parted ways after Arkham City. It shows by how much weaker the writing is in this game. I like the Joker stuff, to be fair. I think of all the ways Rocksteady could've utilized Joker after Arkham City, this was far from the worst way they could've done it. Vastly preferable to just bringing him back as a genuine figment of reality. I also appreciate this game's willingness to explore Bruce as a character with a sense of depth that Asylum and City didn't. But those upsides can only go so far. Not only is the story a victim of awful pacing, but it's comically anticlimactic in more ways than one. Firstly, I love the fact that when Rocksteady was marketing this game, they talked lots about how they were introducing a completely original character to their story, and how the Arkham Knight was going to be completely new. And then it turned out to be Jason Todd. And not just that, but it wasn't even a good or interesting Red Hood adaptation either. Turning him into this domestic terrorist with daddy issues was so uninteresting and boring and a waste of so much potential. The reveal that it's him is so underwhelming, the subsequent boss fight is barely even a boss fight, and his exit from the story is laughable. Even Scarecrow doesn't amount to much here. He looks cool, he sounds cool and should be cool, but he's barely even in the game for one. His presence is barely felt when you're spending most of your time trying to go after the Arkham Knight, and even the nightmare sequences are a step down from what they were in Asylum. That 'final boss' sequence with those 30 Jokers is so uninspired. This game's main story is only about 17-18 hours, but it feels so much longer. It feels like the nice visuals serve to delude people into thinking this game is so much better than it really is, when all it really boils down to is little more than a 'hype moments and aura' Batman montage. It's not even just disappointing as a followup to Arkham City, it's a poorly made video game on its own merits, with that extra context making it feel even more bitter. \n\nI replayed every game in this series, and I really thought going into this that maybe younger me was just being too harsh. I thought that maybe I'd like this game looking back, but I can't lie, it's even worse than I remember. What a bum note to end such an awesome series on.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Insanely bad checkpoints and the end mission is horrible because the car physics and camera placement is completely weird.\r\n\r\nGood graphics but gameplaywise not the best :((((",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game while it can be fun was not for me i died way too many time the game got harder the more you lose and just made me mad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a reminder to myself not to reinstall this game even though I love Batman, because this game has terrible default controls and no remap option, as well as puzzle heavy boring game play that feels linear and suffocating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The team behind this game is apparently so proud of their introduction of the Batmobile, they decided to turn this into a Twisted Metal + Need for Speed game, rather than keeping the core identify of stealth, combat, and puzzle solving. Every bit of fun that can be potentially had with the game, gets instantly taken away by forced vehicle combat, and even more awful racing sections that serves no purpose in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ni pude jugarlo, constantemente hacia suttering, puedo correr juegos AAA sin problemas y este juego choto se frena como si tuviera mejores graficos que el RDR2, lo ponen en oferta justamente por eso, una verguenza",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst arkham game in the series, and by worst I mean I could barely finish it\nMy biggest complaints are:\n- Why did they fill up a batman game with racing/tank sections? Did anyone ask for this? Did anyone ever say \"Man, I wish batman was more like fking forza horizon\"??? After every tank/car section I was like \"Thank god it's over I hope the rest of the game doesn't have any\", but they kept coming, like over and over again The final boss essentially had 1 tank 1 car and 1 stealth phase (all of them were disappointing), I think during the car section i put on an episode of the joe rogan podcast because the game was that unbearable, Did any of the developers get diagnosed with down syndrome during the development?\n- Unmemorable bossfights/enemies, I just finished the game recently and I cannot recall (besides the arkham knight) any of the bosses that i fought, there are like mini bossfights as side quests but those not worth mentioning, taking the series' past entries as a base for comparison just makes this game even more of an embarrassment. asylum had: joker, scarecrow (cool ass visions), killer croc, harley, bane, ivy, like most of the classic established batman villains, this game has a downgraded scarecrow and an ex robin with daddy issues, like wtf\n- Shit story, the story for this game was so underwhelming, it was probably made by moderately overweight liberal middle aged white woman working in hr, again i just finished the game and there were so we few memorable moments i don't remember anything (or maybe i just have dementia lol)\n The pros:\n- Game looks good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is down right idiotic\nThe Bat tank is like the flu, everywhere and no one asked for that\n557 million riddler trophies\nAAAAAAAAAAAnd played the game for 5 hours yesterdy where I fought and defeated the Arkham knight, decided today to keep playing, and the game decided to not only not save my progress, but also send me back to before I did the protect Ivy mission, so that is about extra 2 hours besides the 5.\nafter all these years, it is still a disappointment,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a Batman game.\nInstead of gliding through the skies, you're some bloke in a tank, driving through a lifeless dump.\nWhich is all extremely boring and belongs to a different genre.\nAnd since it's mandatory for pretty much everything, this game is a total failure when it comes to entertainment.\n\nI haven't partaken in any interesting action in 3 hours, not one fight worthy of the previous games, not even a single stealth section.\nRiddles are out of the picture, since one MUST first complete a tank parkour on a timer. Three times. As if that's ever going to happen with how boring a single loop already is.\nMain quest is out of the picture since, after being forced to do a bunch of boring tank stuff, I now MUST drive said ridiculous tank on rooftops, for ridiculous reasons.\n(The thing that would render that ordeal bearable, a manual saves menu, is of course out of intellectual reach of corporate slop makers.)\nBloody Hell am I bored !\n\nI call the visuals a failure as well, in particular the \"city\" design, with no landmarks, no attractive features, no colours, etc.\nNot to mention the poor visibility (even worse while driving.)\n\nI thought the 3rd Batman was bad because they botched all boss fights.\nHere, they botched the entire gameplay loop to make it all about C-grade vehicular combat and races.\nIf they continue on that nonsensical slope, future entries might take characters like Boomerang or King Shark and equip them with guns, as stupid as it sounds.\nCan't wait for Batman 5: the Batfarming Simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck yourom mother fucker i get crash every second.. fuck your sister steam owner fuck your country mother bitch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i tried every method known to men but some how the game keeps crashing after the splash screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't even open. Would love to give this game a chance but I can't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nie można współżyć z ivy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my brother hates this dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "overrated as hell",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yani begenmedim",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game itself is great — the combat, the story, and Gotham City all look amazing. But the Batmobile completely ruined the experience for me. It’s overused, annoying, and the tank battles dragged on way too long. I wanted to play as Batman, not spend half the game doing awkward driving missions. The Batmobile pissed me off so much that I stopped enjoying the game.",
      "voted_up": false,
      "votes_helpful": 44
    },
    {
      "review": "I already didn't enjoy Arkham City and Arkham Knight is even worse tho prettier and when you turn your brain off pretty fun. The world still feels meaningless and empty even if big and pretty, the collectibles are still boring and overwhelming, the story is still meh even though the Joker shenanigans and the Arkham Knight backstory were pretty good. I feel like Batman trilogy keeps dropping on quality with every new entry. \nBatman Asylum was by far the best, it was tight, focused and packed a punch. The other ones didn't feel worth my time even if I got the whole trilogy on big sale. Thank God for Joker who seriously improved my experience in each of these games, the VA did a great job and the musical number in this game was probably my favorite moment of the whole experience!",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "ATTEMPTED 100% ACHIEVEMENT REVIEW:\n\nI literally turned into the joker playing this game.\n\nThis is by far, one of the worst games I have ever tried to 100% in my entire life. The achievements are tedious, unfair and balanced against you.  Don’t get me wrong, a lot of them are easier than others, such as most of the side missions and the main story missions. \n\nYou’d think the problem would be the riddler trophies, but that’s the least of your worries. Infact, they are relatively the easiest achievements you can work towards if you passively play with the story, you’ll pick em up along the way, and have fun with it. \n\nThe AR challenges are some of the worst I’ve ever seen in my entire life. Groups of enemy’s UNHARMED WITHOUT USING GADGETS? A 450 COMBO STREAK NEEDED TO BEAT ONE GUY? It’s not fun, it’s not rewarding, and it’s absolutely not worth the time you put into this game. This is one of the only games I would not reccomend to 100%, it genuinely will make you want to die. Absolutely not worth it.\n\nThe story is meh, the ending is also meh, but it has some cool aspects in the game, the combat is nice, the side quests are interesting, I’m not big on Batman but I now know some characters from the story that I haven’t known from anywhere else. It was nice seeing little additions from the comics and how they were put into this game. \n\nBuy Batman a coffee, he’s been up all night trying to save you, but if your thinking about 100% achievements for this game, you will hate yourself and all the Time you put into it by the end of your over 200+ hour play though. It would be easier to 100% Payday 2",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The team behind this game is apparently so proud of their introduction of the Batmobile, they decided to turn this into a Twisted Metal + Need for Speed game, rather than keeping the core identify of stealth, combat, and puzzle solving. Every bit of fun that can be potentially had with the game, gets instantly taken away by forced vehicle combat, and even more awful racing sections that serves no purpose in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So, I played through Asylum and City, naturally moving onto Origins, which I honestly did not enjoy at all...Moved onto this game, initially thinking it was pretty cool and a big improvement on the series, which in many ways it is. However, I hate the reliance on the batcar, especially in the racing segments they have in certain places. Maneuvering a car onto a roof in this game isn't cool; it's about as hard as it would be in real life and very frustrating, as well as many of the side missions being very misleading, long, drawn out, and just not fun enough to justify the depth they add to the story. You could honestly watch a youtube movie of this game and call it done. 5/10 stars, well made game, but the gameplay department really let me down on this one. Good story though. SPECTACULAR! Ironic, but the story is the only reason i forced myself to keep playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Liked most of the story, flying and hand-fighting, but would not recommend it as it's overloaded with racing and tanks battles missions which quickly become tedious and repetative, as if the developers have ran out of ideas, and exploited it well beyond the reasonable point to fill the play time. And what makes it even worse -- the camera and controls for batmobile are extremely bad. \r\n\r\nIn racing missions the camera does not follow the direction of the car, which makes tunnel stunts huge pain and guessing.\r\n\r\nRiddler puzzles and many other side stories exploit racing and tank battles. As the main story goes towards the end it's just tanks-tanks-tanks and racing without any break, very frustrating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I loved this game on Xbox. i bought it in a bundle on sale recently and it is literally unplayable. Constant stuttering/freezing. didn't even make it through the first scene before uninstalling. i tried looking for solutions online and all i can find is \"it's just a bad port.\" with how old this game is it should be criminal to have it on any pc game service in the condition it is in. again, it is unplayable.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Insanely bad checkpoints and the end mission is horrible because the car physics and camera placement is completely weird.\r\n\r\nGood graphics but gameplaywise not the best :((((",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "its not batman: arkham knight, its batmobile: arkham knight. lol. the batmobile is a terrible forced edition to this game and you need to use it 70% of the game. i paid to play batman not his car rocksteady",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game while it can be fun was not for me i died way too many time the game got harder the more you lose and just made me mad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ni pude jugarlo, constantemente hacia suttering, puedo correr juegos AAA sin problemas y este juego choto se frena como si tuviera mejores graficos que el RDR2, lo ponen en oferta justamente por eso, una verguenza",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst arkham game in the series, and by worst I mean I could barely finish it\nMy biggest complaints are:\n- Why did they fill up a batman game with racing/tank sections? Did anyone ask for this? Did anyone ever say \"Man, I wish batman was more like fking forza horizon\"??? After every tank/car section I was like \"Thank god it's over I hope the rest of the game doesn't have any\", but they kept coming, like over and over again The final boss essentially had 1 tank 1 car and 1 stealth phase (all of them were disappointing), I think during the car section i put on an episode of the joe rogan podcast because the game was that unbearable, Did any of the developers get diagnosed with down syndrome during the development?\n- Unmemorable bossfights/enemies, I just finished the game recently and I cannot recall (besides the arkham knight) any of the bosses that i fought, there are like mini bossfights as side quests but those not worth mentioning, taking the series' past entries as a base for comparison just makes this game even more of an embarrassment. asylum had: joker, scarecrow (cool ass visions), killer croc, harley, bane, ivy, like most of the classic established batman villains, this game has a downgraded scarecrow and an ex robin with daddy issues, like wtf\n- Shit story, the story for this game was so underwhelming, it was probably made by moderately overweight liberal middle aged white woman working in hr, again i just finished the game and there were so we few memorable moments i don't remember anything (or maybe i just have dementia lol)\n The pros:\n- Game looks good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story is down right idiotic\nThe Bat tank is like the flu, everywhere and no one asked for that\n557 million riddler trophies\nAAAAAAAAAAAnd played the game for 5 hours yesterdy where I fought and defeated the Arkham knight, decided today to keep playing, and the game decided to not only not save my progress, but also send me back to before I did the protect Ivy mission, so that is about extra 2 hours besides the 5.\nafter all these years, it is still a disappointment,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a Batman game.\nInstead of gliding through the skies, you're some bloke in a tank, driving through a lifeless dump.\nWhich is all extremely boring and belongs to a different genre.\nAnd since it's mandatory for pretty much everything, this game is a total failure when it comes to entertainment.\n\nI haven't partaken in any interesting action in 3 hours, not one fight worthy of the previous games, not even a single stealth section.\nRiddles are out of the picture, since one MUST first complete a tank parkour on a timer. Three times. As if that's ever going to happen with how boring a single loop already is.\nMain quest is out of the picture since, after being forced to do a bunch of boring tank stuff, I now MUST drive said ridiculous tank on rooftops, for ridiculous reasons.\n(The thing that would render that ordeal bearable, a manual saves menu, is of course out of intellectual reach of corporate slop makers.)\nBloody Hell am I bored !\n\nI call the visuals a failure as well, in particular the \"city\" design, with no landmarks, no attractive features, no colours, etc.\nNot to mention the poor visibility (even worse while driving.)\n\nI thought the 3rd Batman was bad because they botched all boss fights.\nHere, they botched the entire gameplay loop to make it all about C-grade vehicular combat and races.\nIf they continue on that nonsensical slope, future entries might take characters like Boomerang or King Shark and equip them with guns, as stupid as it sounds.\nCan't wait for Batman 5: the Batfarming Simulator.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Batmobile sucks. Just the most forgettable of the series.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a reminder to myself not to reinstall this game even though I love Batman, because this game has terrible default controls and no remap option, as well as puzzle heavy boring game play that feels linear and suffocating.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not being able to jump in this game is a massive turn off. You cant even get over an object the size of a curb, which forces you to walk around it. Very awkward movement.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck yourom mother fucker i get crash every second.. fuck your sister steam owner fuck your country mother bitch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i tried every method known to men but some how the game keeps crashing after the splash screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't even open. Would love to give this game a chance but I can't.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game keeps chrashing every 5 minutes with rx 9060",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nie można współżyć z ivy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "my brother hates this dlc",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "kinda boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yani begenmedim",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}