{
  "positive": [
    {
      "review": "If you like the idle genre, this is top tier - i've played Melvor, Milkyway, NGU and many others for reference. The community/market aspect is what really makes this game shine, especially with group combat and raids.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's neat enough for a free game.\nEverything that is not free can be purchased ingame with gold that you can acquire over time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easy to use UI for this Idle game.  I like the concept, reminds me of Melvor Idle but has some multi player bonuses like the Marketplace.  There is a cash shop like any idle game - I did buy a pass after I played a week or so just to support the game and speed up some progress.  Aiming for 100% complete, just a few to go.. so a few months to go.. lol :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty chill game especially when you are part of a community. Exactly what you expect from \"Idle Clans\"; you idle and you have a clan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only Idle game I actually enjoy playing. Especially fun if you engage in the Clan aspect and interact with other players. My clan does weekly Clan bosses and might help each other with daily Clan events if our schedules align.\n\nEdit: The game does have a cash shop in which you can buy tokens to unlock different aspects of the game and quality of life features (and some purely cosmetic feature). These tokens can all be bought through the in-game player market from other players using the native in-game currency. I unlocked the premium token after about 1 week of playing. Using 3 accounts (yes, you are allowed up to 3 accounts!) it might take you 10-16 days to unlock your first premium token.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun idle game in the style of Melvor Idle, but with MMORPG elements. You can join a clan and fight cooperatively, or you can play in solo mode. Free to play, but $10 USD to unlock all features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxed Idle Game; contains fights, skilling, and clan based content; I've been free to play, but it is possible to earn the premium via in game currency rather than paying for it (quite a grind for that though). Would Recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've started playing this game on phone and as usual i got interested and addicted on a game... So played non stop. But most issue with games i play, i drop the game very easily. \nThere are only few games where it keeps me interested and this game belongs to it.\nI don't know what will happen when i reach max level, but as it is rn, i still got lots to do :) .\n\nCommunity wise, I've seen a lot of reviews about bad community, but in game... I've seen a very helpful community, if u ask questions, u get answers, if u need help with bosses, or other stuff.\nOnly unwritten rule, like in most games is, don't beg for items.\n\nAlthough there's important 'pay to be able to use' things, u can acquire it by doing skilling (most likely farming coal ore), selling it to market and buy premium membership.\n\nGood game and good in game community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Idle Game Ever. That good can't even play anything else even with it being an idle game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already sunk way too much time into this - amazing idler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is no game like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some people say that the community is the problem, but in my expirience i met some of the nicest people here.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "If you like the idle genre, this is top tier - i've played Melvor, Milkyway, NGU and many others for reference. The community/market aspect is what really makes this game shine, especially with group combat and raids.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its like OSRS, but idle.\r\nEquivalent to Melvor Idle, but less bloated.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I put about 2k hours of (unintentional) idling into this game before I earned enough gold to buy a membership token off the community market. If I had intentionally farmed gold from the start I likely could have gotten it at around 500 hours. Regardless, this is a decent game. Well-rounded, plenty of grinding, I'm at 2.2k hours and still haven't reached \"end game grind\". Nothing that stands out as really innovative in the genre, but not bad by any metric as far as I can tell from my experience so far.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's neat enough for a free game.\nEverything that is not free can be purchased ingame with gold that you can acquire over time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easy to use UI for this Idle game.  I like the concept, reminds me of Melvor Idle but has some multi player bonuses like the Marketplace.  There is a cash shop like any idle game - I did buy a pass after I played a week or so just to support the game and speed up some progress.  Aiming for 100% complete, just a few to go.. so a few months to go.. lol :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing this game as a Group Ironman with friends since February (It's Oct at time of post).\n\ntl;dr is the full game is accessible through in game currency, or you can pay for the tokens with $$ which I would say $15 for recommended experience and the game is fun and playable on phone too with the same account. \n\nI've seen a lot of pros and cons in the reviews and they're valid but to each their own. \nPremium Token $10 to unlock the full game. It's playable without it but my friends and I bought it early on for QoL and to unlock all the skills. The game would be a lot longer grind without Agility and Enchanting after a certain point. \nInventory Space Slot Tokens $2 per 30 slots. Inventory gets filled quickly the more you level up due to more items being unlocked such as new gear and different ores and bars and leathers etc, but there is an option to buy spaces with in game currency.\nBoss Hunter Token $4 to hold more than one key which is unfortunately necessary to play late game reasonably as you need keys to fight end game enemies and quests (especially weeklys) offer more than 1 key as a reward that get lost to the void.\nQuesting Token $5 which isnt necessary but offers more quests and rerolls which helps greatly to increase how much xp you can get per day.\nExterminating Token $4 you can definitely get away without buying with minimal loss (just speeds up extermination purchases)\nAuto Loadout Token $4 It's useful mid-late game but not necessary. Convenience based item to auto equip gear. Loadouts cost 1M gold each and the autoload out just changes loadouts automatically when starting different tasks. \nAuto Raid Token. Another convenience buy. It's the only thing I haven't purchased myself as it's new and while I'm tempted and dont mind the prices since I enjoy the game I do feel like this one is a money grab. \nClan Vault Space $2 per 4 clan vault slots.\n\nAll in all I've personally spent $45 on this game which I didn't realize until adding it up now, but even still I don't regret it because as I said I've been playing this game since February and I play it on my phone too. It's very engaging for such a simple game. I would recommend it, and if you're not looking to spend money you don't have to to be able to enjoy it but I think you will want to buy the upgrades because it's enjoyable. F2P in this game is like F2P in OSRS, you can do it but you'd miss out on a lot of the game. I would say that you can fully enjoy the game with the Premium Token and the Boss Hunter Token for $15 total, and the Questing Token for another $5 if you're all in for grinding out levels like I am. It's not a gacha game so I wouldn't call the game itself a money grab. I've played games like Bit Heroes, Umamusume, and Genshin Impact where I've spent... well a lot more. Try it out, have fun or drop it. It's free to play so you can at least try it out and decide if you want to spend the money for the premium content or not. The best part actually is that all the token are trade-able in game for in game currency so you could grind out enough money to buy the tokens for gold so long as you don't run the game as an ironman, but even I bought a questing token for some of my group ironman clan friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty chill game especially when you are part of a community. Exactly what you expect from \"Idle Clans\"; you idle and you have a clan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only Idle game I actually enjoy playing. Especially fun if you engage in the Clan aspect and interact with other players. My clan does weekly Clan bosses and might help each other with daily Clan events if our schedules align.\n\nEdit: The game does have a cash shop in which you can buy tokens to unlock different aspects of the game and quality of life features (and some purely cosmetic feature). These tokens can all be bought through the in-game player market from other players using the native in-game currency. I unlocked the premium token after about 1 week of playing. Using 3 accounts (yes, you are allowed up to 3 accounts!) it might take you 10-16 days to unlock your first premium token.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun idle game in the style of Melvor Idle, but with MMORPG elements. You can join a clan and fight cooperatively, or you can play in solo mode. Free to play, but $10 USD to unlock all features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxed Idle Game; contains fights, skilling, and clan based content; I've been free to play, but it is possible to earn the premium via in game currency rather than paying for it (quite a grind for that though). Would Recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've started playing this game on phone and as usual i got interested and addicted on a game... So played non stop. But most issue with games i play, i drop the game very easily. \nThere are only few games where it keeps me interested and this game belongs to it.\nI don't know what will happen when i reach max level, but as it is rn, i still got lots to do :) .\n\nCommunity wise, I've seen a lot of reviews about bad community, but in game... I've seen a very helpful community, if u ask questions, u get answers, if u need help with bosses, or other stuff.\nOnly unwritten rule, like in most games is, don't beg for items.\n\nAlthough there's important 'pay to be able to use' things, u can acquire it by doing skilling (most likely farming coal ore), selling it to market and buy premium membership.\n\nGood game and good in game community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing, if you love idle games this is for you, if you play with friends you can compete to up those numbers! :D\nno but seriously if you sometimes have a few minutes of your day while doing nothing i highly recommend to pick this one up and play, as any idle getting anywhere is going to take a very long time, but eventually you will be swimming in resources and things to do, my friends and i are currently farming to earn the vaunted \"premium\" status that allows for a few more commodities that would usually run you down about 10 euros but if you are not in a rush you can earn it ingame and that's awesome, it's currently halloween and there is even an event for that, a bit confusing but runs along the idle smoothly.\nanyway no more amount of praise can do it justice, pick it up and farm away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Idle game with heaps of progression.  Free or one time, cheap unlocks, for more content.  So good I'm now playing 4 copies and considering a 5th.  I've gone to running 4 copies of the game, per screen, to keep track on progress.  3 main accounts allowed, and ironman accounts.  New accounts may be done under the same email, by adding a . to the email.  Details in wiki.\r\n\r\nMy only disappointment is that there's no unlock per person, it's per account unlocks, but I guess they need to make their money some way.  Most unlocks for cash, may be sourced from the player market for exorbitant value.  (Millions of in game cash)\r\n\r\nUpgraded account, paid for by me.  Based - Free to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a game that is meant to be idle, this game is great! It's a busy mans Runescape.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i don't think i've ever written a review before but i cannot recommend this game more, simply but well designed also love the most recent QOL update really nice, if you like osrs but don't like wasting your life this is the game for you :) also see a lot of complaints about having to pay for the premium when you don't even have to, just make like 50 mil it ain't that hard and people complaining about to much time managment and shi, bro its an idle game click a couple buttons and you can leave it for 24 hours if you have the upgrades not that hard if you just read through upgrades and buy premium, pretty much all the negative reviews i read can simply be avoided by playing the game actually as an idle game and having a brain to buy premium WITH IN GAME CURRENCY \n\nPROS:\n-don't really need to list any would take to much time\n-first idle game i've played that has actual depth where having a brain kinda matters\n-has a global exchange, well implemented as well\n-iron man mode is really fun if you get bored with regular account good clan implementation with it as well\n-premium is well implemented any review that says otherwise doesn't understand that free to play games need some kind of income to exist (again you don't even need to pay real money)\n\nCONS:\n-idk maybe brewing should be one of the premium skills not agility cause it kinda messes with plundering (this is all i could think of after thinking for about 10 min and then logging in and thinking more)\n-oh and pleaseeeee make it so i can have a tag in my iron man clan i wanna look cool in chat\n-and maybe the art style for monsters but i like it and its kinda grown on me the more i play\n\nall in all great idle game and most bad review are people who are complaining about premium because they don't have a brain to just buy it with in game currency",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple but surprisingly engaging! The incremental progression is satisfying, and watching your little villagers work is weirdly charming. It's a nice game to have on in the background while doing other things, I recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for quite some time now - and I can honestly say the community is top tier. The game itself is exactly what an Idle game should be. No over the top monetization. Clear paths to improvement, and some good old RNG. \n\nDon't take into account the negative reviews of some users. The community is great. However people bring their personal politics into the game and the community shuts it down. \n\nConsidering this is a one person development \"team\" its well made, and updates are meaningful and based on player feedback. \n\nIf youre considering joining, just come in and have fun! Be respectful and keep your politics out of it. You'll be just fine!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My friends begged me to play this game with them so I forced myself to like it. The beginning was rough and I found it pretty boring at first. But after understanding all aspects of the game it became fun and competitive to keep knocking tasks down. Now I can’t stop checking in every few hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not a industry altering idea, but very solid idler. Fairly linear Xp progression without getting too grindy. \n**VERY IMPORTANT!!** This game has a Non-Predatory item shop. Most paid items only offer a minimal xp boost, they operate more as a status symbol than pay to win. As well as most paid items can be traded or sold in the player to player run market.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game has a pretty chill vibe and a simple design, yet it never feels boring. The balance between grind and chill is handled really well. On top of that, the multiplayer aspect, co-op battles, and trading system are nicely implemented. In these areas, it’s quite a success.\n\nWhile I understand why everyone compares it to Melvor Idle, I think Idle Clans doesn’t get the credit it deserves. Melvor costs around $25 with its DLCs and doesn’t offer any multiplayer features. Idle Clans, on the other hand, gives you two options — you can either play completely for free and access all paid content through your in-game effort, or unlock it directly. Since it’s not a competitive game, I don’t see any downside to this system; in fact, offering both options is a really nice touch. Plus, earning access to premium content through your own effort feels like a genuine achievement for players.\n\nAside from that, I find Clans’ balance between grind and chill even better executed than Melvor’s. Definitely an idle game that deserves a chance.\n\nBy the way, with a chill or casual playstyle, you can get premium in about a month. Those who play more actively or join a clan can obtain it even sooner.\n\n---\n\nOyun gayet chill ve sade tasarıma sahip ve yine de sizi sıkmıyor. Grind ve chill arasındaki denge çok iyi sağlanmış. Öte yandan multiplayer, ortak savaşlar ve alım-satım süreçlerinde güzel sağlanmış. Bu açılardan oldukça başarılı.\n\nÖte yandan herkesin Melvor Idle ile kıyaslamasını anlamakla beraber, Idle Clans'a yeterince hak verilmediğini düşünüyorum. Melvor ek paketleriyle beraber 25 dolarlık bir oyun ve herhangi bir multiplayer imkanı sunmuyor. Idle ise size iki opsiyon veriyor, isterseniz ücretsiz olarak girin ve hiçbir kuruş harcamadan oyun içi çabanızla tüm ücretli içeriğie erişin, ya da doğrudan erişin. Rekabetçi bir oyun olmadığı için burada hiçbir olumsuz taraf görmediğim gibi, iki alternatif sunması oldukça hoş. Kaldı ki ücretsiz giriş yapıp oyunda diğer ücretli içeriklere oyun içi emeğinizle ulaşmanız da oyuncu için keyifli bir \"başarım\".\n\nBunun dışında Clans'ın grind ve chill arasındaki dengeli sistemini Melvor'dan daha başarılı bulmaktayım. Kesinlikle şans verilmesi gereken bir idle.\n\nBu arada oyun içerisinde premium'a sahip olmak chill/casual bir oynayışla 1 ay gibi bir süre diyebilirim. Daha aktif oynayan, loncaya girenler çok daha kısa sürede bile edinebilirler.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a simplified version of Melvor Idle, with an online component. You can form parties with other players and there is a trading system. If you didn't grow up with old-skilling games like OSRS you might not enjoy it, because it's a grind and definitely not the dopamine rush of other incremental games that scale exponentially. But if you enjoyed the Melvor Idle type games and wanted more community action, give this game a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, The game is really good as it is, i'm looking forward to future updates, Hopefully the game gets more players, So the game can evolve more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just reviewing to cancel out the hostile whiners review for being \"critiqued too much\"\n\nOh and I quite enjoy RuneScape Idle",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just another Melvor copy.  It seems like it would be fun.  But I don't have that kind of time to invest.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "bearable placeholder while waiting for melvor 2, and it's kinda free\n\nedit: the achievements are trash tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great idle game with a breadth of active and afk mechanics without being overly complicated. It adds a social, cooperative aspect that other similar games don't have while still making those structures worth while even if you're playing in a solo mode. There is no pay to win money grab here. The only functional paid components are tokens which can unlock features or remove limitations, but those can be freely traded between players for in game money on the in game market, and since players actually like this game enough to buy tokens to support the developers or just use for trading, there are always plenty of tokens on the marketplace. With all the new features like quests, market tools, and allowing up to 3 standard accounts, it's easy to get enough in game currency as a free player to buy any of the tokens with in game money within a few days to a week. After that, just play the game how you want because it's all fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game, lay back grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Idle Game Ever. That good can't even play anything else even with it being an idle game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Very addicting, in a good way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only idle game I ever saw someone rage quit. 11/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good idle game with player market and clans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already sunk way too much time into this - amazing idler",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is gas when sitting in disc jorkin with homies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "super gra, polecam Jan Makłowicz",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game I play without concern for the electricity bill",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I play this game with my friends and I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the game a lot and its fun to sink time in :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "How has it already been 30 hours??\n\nEdit: Oh my god",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Numbers go up. I like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "there is no game like this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great idle game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Big fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A nice game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "me like seeing numbers get big",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a very fun, chill game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good Soup.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some people say that the community is the problem, but in my expirience i met some of the nicest people here.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "If you like the idle genre, this is top tier - i've played Melvor, Milkyway, NGU and many others for reference. The community/market aspect is what really makes this game shine, especially with group combat and raids.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Its like OSRS, but idle.\r\nEquivalent to Melvor Idle, but less bloated.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I put about 2k hours of (unintentional) idling into this game before I earned enough gold to buy a membership token off the community market. If I had intentionally farmed gold from the start I likely could have gotten it at around 500 hours. Regardless, this is a decent game. Well-rounded, plenty of grinding, I'm at 2.2k hours and still haven't reached \"end game grind\". Nothing that stands out as really innovative in the genre, but not bad by any metric as far as I can tell from my experience so far.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's neat enough for a free game.\nEverything that is not free can be purchased ingame with gold that you can acquire over time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easy to use UI for this Idle game.  I like the concept, reminds me of Melvor Idle but has some multi player bonuses like the Marketplace.  There is a cash shop like any idle game - I did buy a pass after I played a week or so just to support the game and speed up some progress.  Aiming for 100% complete, just a few to go.. so a few months to go.. lol :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing this game as a Group Ironman with friends since February (It's Oct at time of post).\n\ntl;dr is the full game is accessible through in game currency, or you can pay for the tokens with $$ which I would say $15 for recommended experience and the game is fun and playable on phone too with the same account. \n\nI've seen a lot of pros and cons in the reviews and they're valid but to each their own. \nPremium Token $10 to unlock the full game. It's playable without it but my friends and I bought it early on for QoL and to unlock all the skills. The game would be a lot longer grind without Agility and Enchanting after a certain point. \nInventory Space Slot Tokens $2 per 30 slots. Inventory gets filled quickly the more you level up due to more items being unlocked such as new gear and different ores and bars and leathers etc, but there is an option to buy spaces with in game currency.\nBoss Hunter Token $4 to hold more than one key which is unfortunately necessary to play late game reasonably as you need keys to fight end game enemies and quests (especially weeklys) offer more than 1 key as a reward that get lost to the void.\nQuesting Token $5 which isnt necessary but offers more quests and rerolls which helps greatly to increase how much xp you can get per day.\nExterminating Token $4 you can definitely get away without buying with minimal loss (just speeds up extermination purchases)\nAuto Loadout Token $4 It's useful mid-late game but not necessary. Convenience based item to auto equip gear. Loadouts cost 1M gold each and the autoload out just changes loadouts automatically when starting different tasks. \nAuto Raid Token. Another convenience buy. It's the only thing I haven't purchased myself as it's new and while I'm tempted and dont mind the prices since I enjoy the game I do feel like this one is a money grab. \nClan Vault Space $2 per 4 clan vault slots.\n\nAll in all I've personally spent $45 on this game which I didn't realize until adding it up now, but even still I don't regret it because as I said I've been playing this game since February and I play it on my phone too. It's very engaging for such a simple game. I would recommend it, and if you're not looking to spend money you don't have to to be able to enjoy it but I think you will want to buy the upgrades because it's enjoyable. F2P in this game is like F2P in OSRS, you can do it but you'd miss out on a lot of the game. I would say that you can fully enjoy the game with the Premium Token and the Boss Hunter Token for $15 total, and the Questing Token for another $5 if you're all in for grinding out levels like I am. It's not a gacha game so I wouldn't call the game itself a money grab. I've played games like Bit Heroes, Umamusume, and Genshin Impact where I've spent... well a lot more. Try it out, have fun or drop it. It's free to play so you can at least try it out and decide if you want to spend the money for the premium content or not. The best part actually is that all the token are trade-able in game for in game currency so you could grind out enough money to buy the tokens for gold so long as you don't run the game as an ironman, but even I bought a questing token for some of my group ironman clan friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty chill game especially when you are part of a community. Exactly what you expect from \"Idle Clans\"; you idle and you have a clan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only Idle game I actually enjoy playing. Especially fun if you engage in the Clan aspect and interact with other players. My clan does weekly Clan bosses and might help each other with daily Clan events if our schedules align.\n\nEdit: The game does have a cash shop in which you can buy tokens to unlock different aspects of the game and quality of life features (and some purely cosmetic feature). These tokens can all be bought through the in-game player market from other players using the native in-game currency. I unlocked the premium token after about 1 week of playing. Using 3 accounts (yes, you are allowed up to 3 accounts!) it might take you 10-16 days to unlock your first premium token.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A fun idle game in the style of Melvor Idle, but with MMORPG elements. You can join a clan and fight cooperatively, or you can play in solo mode. Free to play, but $10 USD to unlock all features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Relaxed Idle Game; contains fights, skilling, and clan based content; I've been free to play, but it is possible to earn the premium via in game currency rather than paying for it (quite a grind for that though). Would Recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've started playing this game on phone and as usual i got interested and addicted on a game... So played non stop. But most issue with games i play, i drop the game very easily. \nThere are only few games where it keeps me interested and this game belongs to it.\nI don't know what will happen when i reach max level, but as it is rn, i still got lots to do :) .\n\nCommunity wise, I've seen a lot of reviews about bad community, but in game... I've seen a very helpful community, if u ask questions, u get answers, if u need help with bosses, or other stuff.\nOnly unwritten rule, like in most games is, don't beg for items.\n\nAlthough there's important 'pay to be able to use' things, u can acquire it by doing skilling (most likely farming coal ore), selling it to market and buy premium membership.\n\nGood game and good in game community!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is amazing, if you love idle games this is for you, if you play with friends you can compete to up those numbers! :D\nno but seriously if you sometimes have a few minutes of your day while doing nothing i highly recommend to pick this one up and play, as any idle getting anywhere is going to take a very long time, but eventually you will be swimming in resources and things to do, my friends and i are currently farming to earn the vaunted \"premium\" status that allows for a few more commodities that would usually run you down about 10 euros but if you are not in a rush you can earn it ingame and that's awesome, it's currently halloween and there is even an event for that, a bit confusing but runs along the idle smoothly.\nanyway no more amount of praise can do it justice, pick it up and farm away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Idle game with heaps of progression.  Free or one time, cheap unlocks, for more content.  So good I'm now playing 4 copies and considering a 5th.  I've gone to running 4 copies of the game, per screen, to keep track on progress.  3 main accounts allowed, and ironman accounts.  New accounts may be done under the same email, by adding a . to the email.  Details in wiki.\r\n\r\nMy only disappointment is that there's no unlock per person, it's per account unlocks, but I guess they need to make their money some way.  Most unlocks for cash, may be sourced from the player market for exorbitant value.  (Millions of in game cash)\r\n\r\nUpgraded account, paid for by me.  Based - Free to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a game that is meant to be idle, this game is great! It's a busy mans Runescape.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i don't think i've ever written a review before but i cannot recommend this game more, simply but well designed also love the most recent QOL update really nice, if you like osrs but don't like wasting your life this is the game for you :) also see a lot of complaints about having to pay for the premium when you don't even have to, just make like 50 mil it ain't that hard and people complaining about to much time managment and shi, bro its an idle game click a couple buttons and you can leave it for 24 hours if you have the upgrades not that hard if you just read through upgrades and buy premium, pretty much all the negative reviews i read can simply be avoided by playing the game actually as an idle game and having a brain to buy premium WITH IN GAME CURRENCY \n\nPROS:\n-don't really need to list any would take to much time\n-first idle game i've played that has actual depth where having a brain kinda matters\n-has a global exchange, well implemented as well\n-iron man mode is really fun if you get bored with regular account good clan implementation with it as well\n-premium is well implemented any review that says otherwise doesn't understand that free to play games need some kind of income to exist (again you don't even need to pay real money)\n\nCONS:\n-idk maybe brewing should be one of the premium skills not agility cause it kinda messes with plundering (this is all i could think of after thinking for about 10 min and then logging in and thinking more)\n-oh and pleaseeeee make it so i can have a tag in my iron man clan i wanna look cool in chat\n-and maybe the art style for monsters but i like it and its kinda grown on me the more i play\n\nall in all great idle game and most bad review are people who are complaining about premium because they don't have a brain to just buy it with in game currency",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple but surprisingly engaging! The incremental progression is satisfying, and watching your little villagers work is weirdly charming. It's a nice game to have on in the background while doing other things, I recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing for quite some time now - and I can honestly say the community is top tier. The game itself is exactly what an Idle game should be. No over the top monetization. Clear paths to improvement, and some good old RNG. \n\nDon't take into account the negative reviews of some users. The community is great. However people bring their personal politics into the game and the community shuts it down. \n\nConsidering this is a one person development \"team\" its well made, and updates are meaningful and based on player feedback. \n\nIf youre considering joining, just come in and have fun! Be respectful and keep your politics out of it. You'll be just fine!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My friends begged me to play this game with them so I forced myself to like it. The beginning was rough and I found it pretty boring at first. But after understanding all aspects of the game it became fun and competitive to keep knocking tasks down. Now I can’t stop checking in every few hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not a industry altering idea, but very solid idler. Fairly linear Xp progression without getting too grindy. \n**VERY IMPORTANT!!** This game has a Non-Predatory item shop. Most paid items only offer a minimal xp boost, they operate more as a status symbol than pay to win. As well as most paid items can be traded or sold in the player to player run market.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game has a pretty chill vibe and a simple design, yet it never feels boring. The balance between grind and chill is handled really well. On top of that, the multiplayer aspect, co-op battles, and trading system are nicely implemented. In these areas, it’s quite a success.\n\nWhile I understand why everyone compares it to Melvor Idle, I think Idle Clans doesn’t get the credit it deserves. Melvor costs around $25 with its DLCs and doesn’t offer any multiplayer features. Idle Clans, on the other hand, gives you two options — you can either play completely for free and access all paid content through your in-game effort, or unlock it directly. Since it’s not a competitive game, I don’t see any downside to this system; in fact, offering both options is a really nice touch. Plus, earning access to premium content through your own effort feels like a genuine achievement for players.\n\nAside from that, I find Clans’ balance between grind and chill even better executed than Melvor’s. Definitely an idle game that deserves a chance.\n\nBy the way, with a chill or casual playstyle, you can get premium in about a month. Those who play more actively or join a clan can obtain it even sooner.\n\n---\n\nOyun gayet chill ve sade tasarıma sahip ve yine de sizi sıkmıyor. Grind ve chill arasındaki denge çok iyi sağlanmış. Öte yandan multiplayer, ortak savaşlar ve alım-satım süreçlerinde güzel sağlanmış. Bu açılardan oldukça başarılı.\n\nÖte yandan herkesin Melvor Idle ile kıyaslamasını anlamakla beraber, Idle Clans'a yeterince hak verilmediğini düşünüyorum. Melvor ek paketleriyle beraber 25 dolarlık bir oyun ve herhangi bir multiplayer imkanı sunmuyor. Idle ise size iki opsiyon veriyor, isterseniz ücretsiz olarak girin ve hiçbir kuruş harcamadan oyun içi çabanızla tüm ücretli içeriğie erişin, ya da doğrudan erişin. Rekabetçi bir oyun olmadığı için burada hiçbir olumsuz taraf görmediğim gibi, iki alternatif sunması oldukça hoş. Kaldı ki ücretsiz giriş yapıp oyunda diğer ücretli içeriklere oyun içi emeğinizle ulaşmanız da oyuncu için keyifli bir \"başarım\".\n\nBunun dışında Clans'ın grind ve chill arasındaki dengeli sistemini Melvor'dan daha başarılı bulmaktayım. Kesinlikle şans verilmesi gereken bir idle.\n\nBu arada oyun içerisinde premium'a sahip olmak chill/casual bir oynayışla 1 ay gibi bir süre diyebilirim. Daha aktif oynayan, loncaya girenler çok daha kısa sürede bile edinebilirler.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a simplified version of Melvor Idle, with an online component. You can form parties with other players and there is a trading system. If you didn't grow up with old-skilling games like OSRS you might not enjoy it, because it's a grind and definitely not the dopamine rush of other incremental games that scale exponentially. But if you enjoyed the Melvor Idle type games and wanted more community action, give this game a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game, The game is really good as it is, i'm looking forward to future updates, Hopefully the game gets more players, So the game can evolve more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just reviewing to cancel out the hostile whiners review for being \"critiqued too much\"\n\nOh and I quite enjoy RuneScape Idle",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just another Melvor copy.  It seems like it would be fun.  But I don't have that kind of time to invest.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "bearable placeholder while waiting for melvor 2, and it's kinda free\n\nedit: the achievements are trash tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great idle game with a breadth of active and afk mechanics without being overly complicated. It adds a social, cooperative aspect that other similar games don't have while still making those structures worth while even if you're playing in a solo mode. There is no pay to win money grab here. The only functional paid components are tokens which can unlock features or remove limitations, but those can be freely traded between players for in game money on the in game market, and since players actually like this game enough to buy tokens to support the developers or just use for trading, there are always plenty of tokens on the marketplace. With all the new features like quests, market tools, and allowing up to 3 standard accounts, it's easy to get enough in game currency as a free player to buy any of the tokens with in game money within a few days to a week. After that, just play the game how you want because it's all fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game, lay back grind",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Idle Game Ever. That good can't even play anything else even with it being an idle game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Very addicting, in a good way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only idle game I ever saw someone rage quit. 11/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A good idle game with player market and clans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Already sunk way too much time into this - amazing idler",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "\"Lazy Melvor Idle ripoff\" doesn't just come to mind, it's blaring any time you launch the game. \r\n\r\nThe idea of online multiplayer for an idle game is novel, but Idle Clans feels like another example that it just doesn't really work. A player-run auctionhouse is unique but not particularly interesting. The game is free to play but you're cut off at the legs if you don't buy premium, and you will loot item after item that clutters up your inventory because their only use is part of premium gameplay.\r\n\r\nThe biggest complaint - The user experience feels [b]awful[/b]. It's clearly designed for mobile, but every part of the design feels badly executed, and worse on PC. The list of skills is long which works poorly on a landscape-mode-designed game, resulting in a lot of scrolling up and down the list. Interacting with a thing will open a popup that opens a popup that opens a second menu and cancelling out of that menu won't take you back to the screen you were on to begin with. And [b]everything[/b] wants to open in a popup. The inventory is a mess and lacks the bank tabs of Melvor to at least somewhat organize it, so swapping equipment sets will haphazardly throw your gear back to the top of your inventory every time.\r\n\r\nSkills are barebones, and feel pointless beyond completing daily quests. Chop wood with lumberjacking so you can use the wood to turn it into planks. What do you use the planks for? Nothing.\r\n\r\nCombat doesn't feel interesting - They've tried to mimic Runescape (And by extension, Melvor)'s melee/archery/magic system, but runes and element types have been stripped of the magic system which makes it flavorless, and rather than the rock-paper-scissors attack type circle, enemies just have a weakness to a particular attack type - of which there are like, eight, because melee weapons all have different attack types. So you have crushing, slashing, stabbing, and pounding, but they do nothing other than ensure that you need four extra inventory slots to carry all the weapons you don't need.\r\n\r\nLoot from any source that isn't a direct \"X seconds => 1 item\" system is heavily RNG based, turning time investment into a gamble to see if you get the thing you want. While RNG in a game like this isn't uncommon, the actual drop rates combined with everything else turns it into a slog. I spent so much time grinding the singular creature that drops green leather (tier 3 leather), a mob that I was already vastly overleveled for, to get enough to make myself a set of armor that by the time I had gotten the 6 pieces needed, I had already outleveled the gear as well and needed red leather (tier 4).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Make no mistake. This game is predatory... First indicator is how hard it is to get help... there are a dozen ways to make it easier that they did not use, why? \n\nif you are new they will throw stuff at you to \"help\" but make no mistake its junk they saved up just to buy loyalty, they will toss you away if they think you are useless FDN \n'clan\"\n\nnice game otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is in desperate need of combat animations, without it im just clicking stuff. With it, I might have actually been playing a video game. But since it doesn't have it, I can't recommend this game sadly. If I want to click stuff and watch numbers go up there's a thousands of other games where I can do that and things will actually happen on the screen while I do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont join the discord.\nbunch of self centered hostile clowns with the social intelligence of a microwaved blade of grass.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "\"Lazy Melvor Idle ripoff\" doesn't just come to mind, it's blaring any time you launch the game. \r\n\r\nThe idea of online multiplayer for an idle game is novel, but Idle Clans feels like another example that it just doesn't really work. A player-run auctionhouse is unique but not particularly interesting. The game is free to play but you're cut off at the legs if you don't buy premium, and you will loot item after item that clutters up your inventory because their only use is part of premium gameplay.\r\n\r\nThe biggest complaint - The user experience feels [b]awful[/b]. It's clearly designed for mobile, but every part of the design feels badly executed, and worse on PC. The list of skills is long which works poorly on a landscape-mode-designed game, resulting in a lot of scrolling up and down the list. Interacting with a thing will open a popup that opens a popup that opens a second menu and cancelling out of that menu won't take you back to the screen you were on to begin with. And [b]everything[/b] wants to open in a popup. The inventory is a mess and lacks the bank tabs of Melvor to at least somewhat organize it, so swapping equipment sets will haphazardly throw your gear back to the top of your inventory every time.\r\n\r\nSkills are barebones, and feel pointless beyond completing daily quests. Chop wood with lumberjacking so you can use the wood to turn it into planks. What do you use the planks for? Nothing.\r\n\r\nCombat doesn't feel interesting - They've tried to mimic Runescape (And by extension, Melvor)'s melee/archery/magic system, but runes and element types have been stripped of the magic system which makes it flavorless, and rather than the rock-paper-scissors attack type circle, enemies just have a weakness to a particular attack type - of which there are like, eight, because melee weapons all have different attack types. So you have crushing, slashing, stabbing, and pounding, but they do nothing other than ensure that you need four extra inventory slots to carry all the weapons you don't need.\r\n\r\nLoot from any source that isn't a direct \"X seconds => 1 item\" system is heavily RNG based, turning time investment into a gamble to see if you get the thing you want. While RNG in a game like this isn't uncommon, the actual drop rates combined with everything else turns it into a slog. I spent so much time grinding the singular creature that drops green leather (tier 3 leather), a mob that I was already vastly overleveled for, to get enough to make myself a set of armor that by the time I had gotten the 6 pieces needed, I had already outleveled the gear as well and needed red leather (tier 4).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Was fun for a while, then it updated and i could not log in anymore.\nDiscord said it was fixed but it was not.\n\nAnd while waiting.. i lost all interest. It's a numbers go up game, nothing really holding you there when the numbers stop going up.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Idle Clans\r\n\r\nFirst thing that is noticeable, is that it isn’t as much as an idle game but a constant need to adjust for resource and time management.\r\n\r\nThe added annoyance of the multiple levelled pay wall, that seriously hinders the ability to operate the game effectively.\r\nFor a ‘Free-to-Play’ game, it has massive disappointments on multiple levels.\r\n\r\nPros;\r\nUI is fairly good, though could use some work\r\nGraphics though simple work well with it\r\nHigh Volume for stackable items\r\n\r\nCons; (Too many to go through, so some core ones)\r\nConstant Time Management is painful and annoying\r\nOnly one single item can be done at a time\r\nResources are not listed in correct order, and some stupid things such as ‘Diamond Ore’\r\nCrafting combinations and volumes don’t make sense in some cases\r\nPay wall is far too expensive (at USD$53 or AUD$81)\r\nPay wall for Ironman (solo) is pathetic\r\nTime req for most things is set at too high\r\n\r\nA major concern is that the game fails to deliver suitable or even substantial material to desire to implement a pay wall system, that to me says a lot about the developer.\r\nWhen taken to comparison with other titles in either the F2P or the idle genres, or even both at the same time, their microtransactions are entire or almost completely cosmetic, in the case where MT’s have non-cosmetic application, that is usually attached to QoL things such as inventory space and etc.\r\n\r\nFor some reason I thought there would be more to this game than what was delivered, a grave disappointment.\r\n\r\nRecommended: No\r\nReplayability: No\r\nDrawbacks: Too many to list\r\n\r\n-Universal Gamer",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Entire chat room encouraging people to harass me in my PMs,DMs, whatever. This isn't coming down until changes are made and single click blocking is enabled and  a report function AT LEAST,\n\n Oh, and at least two people were putting words in my mouth. Despicable community.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "We need more content for example group harvesting or different type early game raids, 1vs1 2vs2 or directly clan vs clan combat and [b] please set the Group Ironman mode to 10 players / 6 players is really too less. [/b] If clans cannot fill 10 slots, we can reduce the difficulty using the breakpoint system. Instead of asking players to pay $2 to expand their inventory, I recommend switching to selling content to players to make money. This game has real potential, but more content and changes need to be made. \n\nI don't suggest anyone until I see a change.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible owner just bans people for no reason and tries telling them they broke rules they didnt(example playing gim group friends help me as they arent going to heavy i been tossing them gold and working on more to come get banned and told i was breaking rules  (funneling  apperantly lol  its a group we help each other.....) dont waste your time and cash  ruined months of work...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Make no mistake. This game is predatory... First indicator is how hard it is to get help... there are a dozen ways to make it easier that they did not use, why? \n\nif you are new they will throw stuff at you to \"help\" but make no mistake its junk they saved up just to buy loyalty, they will toss you away if they think you are useless FDN \n'clan\"\n\nnice game otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chat and community is mostly nice and you get offered help in global chat but the discord is massively hostile if you want to provide feedback to uninitiuive and simply wrong or bad Tooltips and game elements.\n\nYou get told to watch tutorials or read everything up on the wiki but the game itself does a bad job explaining a lot of things.\n\nI played with the maximum possible amount of 3 characters everyday and tried to find the most enjoyment.\nUnfortunately,the social aspect is good but the game itself just copied and pasted sone Runescape and melvor idle elements and added nothing of significance to it.\n\nAnd after being critiqued that much on the discord, im not going to further explore the worlds of Idle Clans.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve played a lot of online games, but this one has one of the most toxic and hurtful communities I’ve ever experienced. Many players seem to go out of their way to be cruel, and while moderators sometimes mute offenders, they rarely take real action to stop ongoing harassment.\r\n\r\nWhen I started playing, I was already in a vulnerable place and hoped this game would be a positive distraction. Instead, the way people treated me made my mental health decline even further. No one should ever be made to feel worse just for trying to enjoy a game.\r\n\r\nThe gameplay itself is very bare-bones with little depth or creativity.\r\nOverall, I can’t recommend this game — both the community and the moderation make it an unsafe and unpleasant environment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was doing Combat, killin' some chickens for a few minutes.\r\nAccidentally clicked another skill to start cooking a fish. All the loot from the chickens gets deleted, since you have to manually loot it (seems like there's an auto loot that you likely have to pay for).\r\n\r\n7 minutes of my life killing chickens wasted. This is a tragedy that I'll never financially recover from.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Leave the game for 10 hours and find out it's stopped mining like what",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is in desperate need of combat animations, without it im just clicking stuff. With it, I might have actually been playing a video game. But since it doesn't have it, I can't recommend this game sadly. If I want to click stuff and watch numbers go up there's a thousands of other games where I can do that and things will actually happen on the screen while I do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the type of game that makes you purchase inventory space, and also has skills locked behind a paywall. Hard pass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "base systems paywalled, bye",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Boring management.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just wants your money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i don't like the idea of paying for the skills",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "w 45ushrtxfgb",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont join the discord.\nbunch of self centered hostile clowns with the social intelligence of a microwaved blade of grass.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "\"Lazy Melvor Idle ripoff\" doesn't just come to mind, it's blaring any time you launch the game. \r\n\r\nThe idea of online multiplayer for an idle game is novel, but Idle Clans feels like another example that it just doesn't really work. A player-run auctionhouse is unique but not particularly interesting. The game is free to play but you're cut off at the legs if you don't buy premium, and you will loot item after item that clutters up your inventory because their only use is part of premium gameplay.\r\n\r\nThe biggest complaint - The user experience feels [b]awful[/b]. It's clearly designed for mobile, but every part of the design feels badly executed, and worse on PC. The list of skills is long which works poorly on a landscape-mode-designed game, resulting in a lot of scrolling up and down the list. Interacting with a thing will open a popup that opens a popup that opens a second menu and cancelling out of that menu won't take you back to the screen you were on to begin with. And [b]everything[/b] wants to open in a popup. The inventory is a mess and lacks the bank tabs of Melvor to at least somewhat organize it, so swapping equipment sets will haphazardly throw your gear back to the top of your inventory every time.\r\n\r\nSkills are barebones, and feel pointless beyond completing daily quests. Chop wood with lumberjacking so you can use the wood to turn it into planks. What do you use the planks for? Nothing.\r\n\r\nCombat doesn't feel interesting - They've tried to mimic Runescape (And by extension, Melvor)'s melee/archery/magic system, but runes and element types have been stripped of the magic system which makes it flavorless, and rather than the rock-paper-scissors attack type circle, enemies just have a weakness to a particular attack type - of which there are like, eight, because melee weapons all have different attack types. So you have crushing, slashing, stabbing, and pounding, but they do nothing other than ensure that you need four extra inventory slots to carry all the weapons you don't need.\r\n\r\nLoot from any source that isn't a direct \"X seconds => 1 item\" system is heavily RNG based, turning time investment into a gamble to see if you get the thing you want. While RNG in a game like this isn't uncommon, the actual drop rates combined with everything else turns it into a slog. I spent so much time grinding the singular creature that drops green leather (tier 3 leather), a mob that I was already vastly overleveled for, to get enough to make myself a set of armor that by the time I had gotten the 6 pieces needed, I had already outleveled the gear as well and needed red leather (tier 4).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Was fun for a while, then it updated and i could not log in anymore.\nDiscord said it was fixed but it was not.\n\nAnd while waiting.. i lost all interest. It's a numbers go up game, nothing really holding you there when the numbers stop going up.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Idle Clans\r\n\r\nFirst thing that is noticeable, is that it isn’t as much as an idle game but a constant need to adjust for resource and time management.\r\n\r\nThe added annoyance of the multiple levelled pay wall, that seriously hinders the ability to operate the game effectively.\r\nFor a ‘Free-to-Play’ game, it has massive disappointments on multiple levels.\r\n\r\nPros;\r\nUI is fairly good, though could use some work\r\nGraphics though simple work well with it\r\nHigh Volume for stackable items\r\n\r\nCons; (Too many to go through, so some core ones)\r\nConstant Time Management is painful and annoying\r\nOnly one single item can be done at a time\r\nResources are not listed in correct order, and some stupid things such as ‘Diamond Ore’\r\nCrafting combinations and volumes don’t make sense in some cases\r\nPay wall is far too expensive (at USD$53 or AUD$81)\r\nPay wall for Ironman (solo) is pathetic\r\nTime req for most things is set at too high\r\n\r\nA major concern is that the game fails to deliver suitable or even substantial material to desire to implement a pay wall system, that to me says a lot about the developer.\r\nWhen taken to comparison with other titles in either the F2P or the idle genres, or even both at the same time, their microtransactions are entire or almost completely cosmetic, in the case where MT’s have non-cosmetic application, that is usually attached to QoL things such as inventory space and etc.\r\n\r\nFor some reason I thought there would be more to this game than what was delivered, a grave disappointment.\r\n\r\nRecommended: No\r\nReplayability: No\r\nDrawbacks: Too many to list\r\n\r\n-Universal Gamer",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Entire chat room encouraging people to harass me in my PMs,DMs, whatever. This isn't coming down until changes are made and single click blocking is enabled and  a report function AT LEAST,\n\n Oh, and at least two people were putting words in my mouth. Despicable community.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "We need more content for example group harvesting or different type early game raids, 1vs1 2vs2 or directly clan vs clan combat and [b] please set the Group Ironman mode to 10 players / 6 players is really too less. [/b] If clans cannot fill 10 slots, we can reduce the difficulty using the breakpoint system. Instead of asking players to pay $2 to expand their inventory, I recommend switching to selling content to players to make money. This game has real potential, but more content and changes need to be made. \n\nI don't suggest anyone until I see a change.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible owner just bans people for no reason and tries telling them they broke rules they didnt(example playing gim group friends help me as they arent going to heavy i been tossing them gold and working on more to come get banned and told i was breaking rules  (funneling  apperantly lol  its a group we help each other.....) dont waste your time and cash  ruined months of work...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Make no mistake. This game is predatory... First indicator is how hard it is to get help... there are a dozen ways to make it easier that they did not use, why? \n\nif you are new they will throw stuff at you to \"help\" but make no mistake its junk they saved up just to buy loyalty, they will toss you away if they think you are useless FDN \n'clan\"\n\nnice game otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chat and community is mostly nice and you get offered help in global chat but the discord is massively hostile if you want to provide feedback to uninitiuive and simply wrong or bad Tooltips and game elements.\n\nYou get told to watch tutorials or read everything up on the wiki but the game itself does a bad job explaining a lot of things.\n\nI played with the maximum possible amount of 3 characters everyday and tried to find the most enjoyment.\nUnfortunately,the social aspect is good but the game itself just copied and pasted sone Runescape and melvor idle elements and added nothing of significance to it.\n\nAnd after being critiqued that much on the discord, im not going to further explore the worlds of Idle Clans.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve played a lot of online games, but this one has one of the most toxic and hurtful communities I’ve ever experienced. Many players seem to go out of their way to be cruel, and while moderators sometimes mute offenders, they rarely take real action to stop ongoing harassment.\r\n\r\nWhen I started playing, I was already in a vulnerable place and hoped this game would be a positive distraction. Instead, the way people treated me made my mental health decline even further. No one should ever be made to feel worse just for trying to enjoy a game.\r\n\r\nThe gameplay itself is very bare-bones with little depth or creativity.\r\nOverall, I can’t recommend this game — both the community and the moderation make it an unsafe and unpleasant environment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was doing Combat, killin' some chickens for a few minutes.\r\nAccidentally clicked another skill to start cooking a fish. All the loot from the chickens gets deleted, since you have to manually loot it (seems like there's an auto loot that you likely have to pay for).\r\n\r\n7 minutes of my life killing chickens wasted. This is a tragedy that I'll never financially recover from.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Leave the game for 10 hours and find out it's stopped mining like what",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is in desperate need of combat animations, without it im just clicking stuff. With it, I might have actually been playing a video game. But since it doesn't have it, I can't recommend this game sadly. If I want to click stuff and watch numbers go up there's a thousands of other games where I can do that and things will actually happen on the screen while I do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the type of game that makes you purchase inventory space, and also has skills locked behind a paywall. Hard pass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "base systems paywalled, bye",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Boring management.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just wants your money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i don't like the idea of paying for the skills",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "w 45ushrtxfgb",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont join the discord.\nbunch of self centered hostile clowns with the social intelligence of a microwaved blade of grass.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "\"Lazy Melvor Idle ripoff\" doesn't just come to mind, it's blaring any time you launch the game. \r\n\r\nThe idea of online multiplayer for an idle game is novel, but Idle Clans feels like another example that it just doesn't really work. A player-run auctionhouse is unique but not particularly interesting. The game is free to play but you're cut off at the legs if you don't buy premium, and you will loot item after item that clutters up your inventory because their only use is part of premium gameplay.\r\n\r\nThe biggest complaint - The user experience feels [b]awful[/b]. It's clearly designed for mobile, but every part of the design feels badly executed, and worse on PC. The list of skills is long which works poorly on a landscape-mode-designed game, resulting in a lot of scrolling up and down the list. Interacting with a thing will open a popup that opens a popup that opens a second menu and cancelling out of that menu won't take you back to the screen you were on to begin with. And [b]everything[/b] wants to open in a popup. The inventory is a mess and lacks the bank tabs of Melvor to at least somewhat organize it, so swapping equipment sets will haphazardly throw your gear back to the top of your inventory every time.\r\n\r\nSkills are barebones, and feel pointless beyond completing daily quests. Chop wood with lumberjacking so you can use the wood to turn it into planks. What do you use the planks for? Nothing.\r\n\r\nCombat doesn't feel interesting - They've tried to mimic Runescape (And by extension, Melvor)'s melee/archery/magic system, but runes and element types have been stripped of the magic system which makes it flavorless, and rather than the rock-paper-scissors attack type circle, enemies just have a weakness to a particular attack type - of which there are like, eight, because melee weapons all have different attack types. So you have crushing, slashing, stabbing, and pounding, but they do nothing other than ensure that you need four extra inventory slots to carry all the weapons you don't need.\r\n\r\nLoot from any source that isn't a direct \"X seconds => 1 item\" system is heavily RNG based, turning time investment into a gamble to see if you get the thing you want. While RNG in a game like this isn't uncommon, the actual drop rates combined with everything else turns it into a slog. I spent so much time grinding the singular creature that drops green leather (tier 3 leather), a mob that I was already vastly overleveled for, to get enough to make myself a set of armor that by the time I had gotten the 6 pieces needed, I had already outleveled the gear as well and needed red leather (tier 4).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Was fun for a while, then it updated and i could not log in anymore.\nDiscord said it was fixed but it was not.\n\nAnd while waiting.. i lost all interest. It's a numbers go up game, nothing really holding you there when the numbers stop going up.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Idle Clans\r\n\r\nFirst thing that is noticeable, is that it isn’t as much as an idle game but a constant need to adjust for resource and time management.\r\n\r\nThe added annoyance of the multiple levelled pay wall, that seriously hinders the ability to operate the game effectively.\r\nFor a ‘Free-to-Play’ game, it has massive disappointments on multiple levels.\r\n\r\nPros;\r\nUI is fairly good, though could use some work\r\nGraphics though simple work well with it\r\nHigh Volume for stackable items\r\n\r\nCons; (Too many to go through, so some core ones)\r\nConstant Time Management is painful and annoying\r\nOnly one single item can be done at a time\r\nResources are not listed in correct order, and some stupid things such as ‘Diamond Ore’\r\nCrafting combinations and volumes don’t make sense in some cases\r\nPay wall is far too expensive (at USD$53 or AUD$81)\r\nPay wall for Ironman (solo) is pathetic\r\nTime req for most things is set at too high\r\n\r\nA major concern is that the game fails to deliver suitable or even substantial material to desire to implement a pay wall system, that to me says a lot about the developer.\r\nWhen taken to comparison with other titles in either the F2P or the idle genres, or even both at the same time, their microtransactions are entire or almost completely cosmetic, in the case where MT’s have non-cosmetic application, that is usually attached to QoL things such as inventory space and etc.\r\n\r\nFor some reason I thought there would be more to this game than what was delivered, a grave disappointment.\r\n\r\nRecommended: No\r\nReplayability: No\r\nDrawbacks: Too many to list\r\n\r\n-Universal Gamer",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Entire chat room encouraging people to harass me in my PMs,DMs, whatever. This isn't coming down until changes are made and single click blocking is enabled and  a report function AT LEAST,\n\n Oh, and at least two people were putting words in my mouth. Despicable community.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "We need more content for example group harvesting or different type early game raids, 1vs1 2vs2 or directly clan vs clan combat and [b] please set the Group Ironman mode to 10 players / 6 players is really too less. [/b] If clans cannot fill 10 slots, we can reduce the difficulty using the breakpoint system. Instead of asking players to pay $2 to expand their inventory, I recommend switching to selling content to players to make money. This game has real potential, but more content and changes need to be made. \n\nI don't suggest anyone until I see a change.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible owner just bans people for no reason and tries telling them they broke rules they didnt(example playing gim group friends help me as they arent going to heavy i been tossing them gold and working on more to come get banned and told i was breaking rules  (funneling  apperantly lol  its a group we help each other.....) dont waste your time and cash  ruined months of work...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Make no mistake. This game is predatory... First indicator is how hard it is to get help... there are a dozen ways to make it easier that they did not use, why? \n\nif you are new they will throw stuff at you to \"help\" but make no mistake its junk they saved up just to buy loyalty, they will toss you away if they think you are useless FDN \n'clan\"\n\nnice game otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chat and community is mostly nice and you get offered help in global chat but the discord is massively hostile if you want to provide feedback to uninitiuive and simply wrong or bad Tooltips and game elements.\n\nYou get told to watch tutorials or read everything up on the wiki but the game itself does a bad job explaining a lot of things.\n\nI played with the maximum possible amount of 3 characters everyday and tried to find the most enjoyment.\nUnfortunately,the social aspect is good but the game itself just copied and pasted sone Runescape and melvor idle elements and added nothing of significance to it.\n\nAnd after being critiqued that much on the discord, im not going to further explore the worlds of Idle Clans.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve played a lot of online games, but this one has one of the most toxic and hurtful communities I’ve ever experienced. Many players seem to go out of their way to be cruel, and while moderators sometimes mute offenders, they rarely take real action to stop ongoing harassment.\r\n\r\nWhen I started playing, I was already in a vulnerable place and hoped this game would be a positive distraction. Instead, the way people treated me made my mental health decline even further. No one should ever be made to feel worse just for trying to enjoy a game.\r\n\r\nThe gameplay itself is very bare-bones with little depth or creativity.\r\nOverall, I can’t recommend this game — both the community and the moderation make it an unsafe and unpleasant environment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was doing Combat, killin' some chickens for a few minutes.\r\nAccidentally clicked another skill to start cooking a fish. All the loot from the chickens gets deleted, since you have to manually loot it (seems like there's an auto loot that you likely have to pay for).\r\n\r\n7 minutes of my life killing chickens wasted. This is a tragedy that I'll never financially recover from.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Leave the game for 10 hours and find out it's stopped mining like what",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is in desperate need of combat animations, without it im just clicking stuff. With it, I might have actually been playing a video game. But since it doesn't have it, I can't recommend this game sadly. If I want to click stuff and watch numbers go up there's a thousands of other games where I can do that and things will actually happen on the screen while I do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the type of game that makes you purchase inventory space, and also has skills locked behind a paywall. Hard pass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "base systems paywalled, bye",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Boring management.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just wants your money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i don't like the idea of paying for the skills",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "w 45ushrtxfgb",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont join the discord.\nbunch of self centered hostile clowns with the social intelligence of a microwaved blade of grass.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "\"Lazy Melvor Idle ripoff\" doesn't just come to mind, it's blaring any time you launch the game. \r\n\r\nThe idea of online multiplayer for an idle game is novel, but Idle Clans feels like another example that it just doesn't really work. A player-run auctionhouse is unique but not particularly interesting. The game is free to play but you're cut off at the legs if you don't buy premium, and you will loot item after item that clutters up your inventory because their only use is part of premium gameplay.\r\n\r\nThe biggest complaint - The user experience feels [b]awful[/b]. It's clearly designed for mobile, but every part of the design feels badly executed, and worse on PC. The list of skills is long which works poorly on a landscape-mode-designed game, resulting in a lot of scrolling up and down the list. Interacting with a thing will open a popup that opens a popup that opens a second menu and cancelling out of that menu won't take you back to the screen you were on to begin with. And [b]everything[/b] wants to open in a popup. The inventory is a mess and lacks the bank tabs of Melvor to at least somewhat organize it, so swapping equipment sets will haphazardly throw your gear back to the top of your inventory every time.\r\n\r\nSkills are barebones, and feel pointless beyond completing daily quests. Chop wood with lumberjacking so you can use the wood to turn it into planks. What do you use the planks for? Nothing.\r\n\r\nCombat doesn't feel interesting - They've tried to mimic Runescape (And by extension, Melvor)'s melee/archery/magic system, but runes and element types have been stripped of the magic system which makes it flavorless, and rather than the rock-paper-scissors attack type circle, enemies just have a weakness to a particular attack type - of which there are like, eight, because melee weapons all have different attack types. So you have crushing, slashing, stabbing, and pounding, but they do nothing other than ensure that you need four extra inventory slots to carry all the weapons you don't need.\r\n\r\nLoot from any source that isn't a direct \"X seconds => 1 item\" system is heavily RNG based, turning time investment into a gamble to see if you get the thing you want. While RNG in a game like this isn't uncommon, the actual drop rates combined with everything else turns it into a slog. I spent so much time grinding the singular creature that drops green leather (tier 3 leather), a mob that I was already vastly overleveled for, to get enough to make myself a set of armor that by the time I had gotten the 6 pieces needed, I had already outleveled the gear as well and needed red leather (tier 4).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Was fun for a while, then it updated and i could not log in anymore.\nDiscord said it was fixed but it was not.\n\nAnd while waiting.. i lost all interest. It's a numbers go up game, nothing really holding you there when the numbers stop going up.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Idle Clans\r\n\r\nFirst thing that is noticeable, is that it isn’t as much as an idle game but a constant need to adjust for resource and time management.\r\n\r\nThe added annoyance of the multiple levelled pay wall, that seriously hinders the ability to operate the game effectively.\r\nFor a ‘Free-to-Play’ game, it has massive disappointments on multiple levels.\r\n\r\nPros;\r\nUI is fairly good, though could use some work\r\nGraphics though simple work well with it\r\nHigh Volume for stackable items\r\n\r\nCons; (Too many to go through, so some core ones)\r\nConstant Time Management is painful and annoying\r\nOnly one single item can be done at a time\r\nResources are not listed in correct order, and some stupid things such as ‘Diamond Ore’\r\nCrafting combinations and volumes don’t make sense in some cases\r\nPay wall is far too expensive (at USD$53 or AUD$81)\r\nPay wall for Ironman (solo) is pathetic\r\nTime req for most things is set at too high\r\n\r\nA major concern is that the game fails to deliver suitable or even substantial material to desire to implement a pay wall system, that to me says a lot about the developer.\r\nWhen taken to comparison with other titles in either the F2P or the idle genres, or even both at the same time, their microtransactions are entire or almost completely cosmetic, in the case where MT’s have non-cosmetic application, that is usually attached to QoL things such as inventory space and etc.\r\n\r\nFor some reason I thought there would be more to this game than what was delivered, a grave disappointment.\r\n\r\nRecommended: No\r\nReplayability: No\r\nDrawbacks: Too many to list\r\n\r\n-Universal Gamer",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Entire chat room encouraging people to harass me in my PMs,DMs, whatever. This isn't coming down until changes are made and single click blocking is enabled and  a report function AT LEAST,\n\n Oh, and at least two people were putting words in my mouth. Despicable community.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "We need more content for example group harvesting or different type early game raids, 1vs1 2vs2 or directly clan vs clan combat and [b] please set the Group Ironman mode to 10 players / 6 players is really too less. [/b] If clans cannot fill 10 slots, we can reduce the difficulty using the breakpoint system. Instead of asking players to pay $2 to expand their inventory, I recommend switching to selling content to players to make money. This game has real potential, but more content and changes need to be made. \n\nI don't suggest anyone until I see a change.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible owner just bans people for no reason and tries telling them they broke rules they didnt(example playing gim group friends help me as they arent going to heavy i been tossing them gold and working on more to come get banned and told i was breaking rules  (funneling  apperantly lol  its a group we help each other.....) dont waste your time and cash  ruined months of work...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Make no mistake. This game is predatory... First indicator is how hard it is to get help... there are a dozen ways to make it easier that they did not use, why? \n\nif you are new they will throw stuff at you to \"help\" but make no mistake its junk they saved up just to buy loyalty, they will toss you away if they think you are useless FDN \n'clan\"\n\nnice game otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chat and community is mostly nice and you get offered help in global chat but the discord is massively hostile if you want to provide feedback to uninitiuive and simply wrong or bad Tooltips and game elements.\n\nYou get told to watch tutorials or read everything up on the wiki but the game itself does a bad job explaining a lot of things.\n\nI played with the maximum possible amount of 3 characters everyday and tried to find the most enjoyment.\nUnfortunately,the social aspect is good but the game itself just copied and pasted sone Runescape and melvor idle elements and added nothing of significance to it.\n\nAnd after being critiqued that much on the discord, im not going to further explore the worlds of Idle Clans.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve played a lot of online games, but this one has one of the most toxic and hurtful communities I’ve ever experienced. Many players seem to go out of their way to be cruel, and while moderators sometimes mute offenders, they rarely take real action to stop ongoing harassment.\r\n\r\nWhen I started playing, I was already in a vulnerable place and hoped this game would be a positive distraction. Instead, the way people treated me made my mental health decline even further. No one should ever be made to feel worse just for trying to enjoy a game.\r\n\r\nThe gameplay itself is very bare-bones with little depth or creativity.\r\nOverall, I can’t recommend this game — both the community and the moderation make it an unsafe and unpleasant environment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was doing Combat, killin' some chickens for a few minutes.\r\nAccidentally clicked another skill to start cooking a fish. All the loot from the chickens gets deleted, since you have to manually loot it (seems like there's an auto loot that you likely have to pay for).\r\n\r\n7 minutes of my life killing chickens wasted. This is a tragedy that I'll never financially recover from.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Leave the game for 10 hours and find out it's stopped mining like what",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is in desperate need of combat animations, without it im just clicking stuff. With it, I might have actually been playing a video game. But since it doesn't have it, I can't recommend this game sadly. If I want to click stuff and watch numbers go up there's a thousands of other games where I can do that and things will actually happen on the screen while I do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the type of game that makes you purchase inventory space, and also has skills locked behind a paywall. Hard pass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "base systems paywalled, bye",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Boring management.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just wants your money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i don't like the idea of paying for the skills",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "w 45ushrtxfgb",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont join the discord.\nbunch of self centered hostile clowns with the social intelligence of a microwaved blade of grass.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "\"Lazy Melvor Idle ripoff\" doesn't just come to mind, it's blaring any time you launch the game. \r\n\r\nThe idea of online multiplayer for an idle game is novel, but Idle Clans feels like another example that it just doesn't really work. A player-run auctionhouse is unique but not particularly interesting. The game is free to play but you're cut off at the legs if you don't buy premium, and you will loot item after item that clutters up your inventory because their only use is part of premium gameplay.\r\n\r\nThe biggest complaint - The user experience feels [b]awful[/b]. It's clearly designed for mobile, but every part of the design feels badly executed, and worse on PC. The list of skills is long which works poorly on a landscape-mode-designed game, resulting in a lot of scrolling up and down the list. Interacting with a thing will open a popup that opens a popup that opens a second menu and cancelling out of that menu won't take you back to the screen you were on to begin with. And [b]everything[/b] wants to open in a popup. The inventory is a mess and lacks the bank tabs of Melvor to at least somewhat organize it, so swapping equipment sets will haphazardly throw your gear back to the top of your inventory every time.\r\n\r\nSkills are barebones, and feel pointless beyond completing daily quests. Chop wood with lumberjacking so you can use the wood to turn it into planks. What do you use the planks for? Nothing.\r\n\r\nCombat doesn't feel interesting - They've tried to mimic Runescape (And by extension, Melvor)'s melee/archery/magic system, but runes and element types have been stripped of the magic system which makes it flavorless, and rather than the rock-paper-scissors attack type circle, enemies just have a weakness to a particular attack type - of which there are like, eight, because melee weapons all have different attack types. So you have crushing, slashing, stabbing, and pounding, but they do nothing other than ensure that you need four extra inventory slots to carry all the weapons you don't need.\r\n\r\nLoot from any source that isn't a direct \"X seconds => 1 item\" system is heavily RNG based, turning time investment into a gamble to see if you get the thing you want. While RNG in a game like this isn't uncommon, the actual drop rates combined with everything else turns it into a slog. I spent so much time grinding the singular creature that drops green leather (tier 3 leather), a mob that I was already vastly overleveled for, to get enough to make myself a set of armor that by the time I had gotten the 6 pieces needed, I had already outleveled the gear as well and needed red leather (tier 4).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Was fun for a while, then it updated and i could not log in anymore.\nDiscord said it was fixed but it was not.\n\nAnd while waiting.. i lost all interest. It's a numbers go up game, nothing really holding you there when the numbers stop going up.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Idle Clans\r\n\r\nFirst thing that is noticeable, is that it isn’t as much as an idle game but a constant need to adjust for resource and time management.\r\n\r\nThe added annoyance of the multiple levelled pay wall, that seriously hinders the ability to operate the game effectively.\r\nFor a ‘Free-to-Play’ game, it has massive disappointments on multiple levels.\r\n\r\nPros;\r\nUI is fairly good, though could use some work\r\nGraphics though simple work well with it\r\nHigh Volume for stackable items\r\n\r\nCons; (Too many to go through, so some core ones)\r\nConstant Time Management is painful and annoying\r\nOnly one single item can be done at a time\r\nResources are not listed in correct order, and some stupid things such as ‘Diamond Ore’\r\nCrafting combinations and volumes don’t make sense in some cases\r\nPay wall is far too expensive (at USD$53 or AUD$81)\r\nPay wall for Ironman (solo) is pathetic\r\nTime req for most things is set at too high\r\n\r\nA major concern is that the game fails to deliver suitable or even substantial material to desire to implement a pay wall system, that to me says a lot about the developer.\r\nWhen taken to comparison with other titles in either the F2P or the idle genres, or even both at the same time, their microtransactions are entire or almost completely cosmetic, in the case where MT’s have non-cosmetic application, that is usually attached to QoL things such as inventory space and etc.\r\n\r\nFor some reason I thought there would be more to this game than what was delivered, a grave disappointment.\r\n\r\nRecommended: No\r\nReplayability: No\r\nDrawbacks: Too many to list\r\n\r\n-Universal Gamer",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Entire chat room encouraging people to harass me in my PMs,DMs, whatever. This isn't coming down until changes are made and single click blocking is enabled and  a report function AT LEAST,\n\n Oh, and at least two people were putting words in my mouth. Despicable community.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "We need more content for example group harvesting or different type early game raids, 1vs1 2vs2 or directly clan vs clan combat and [b] please set the Group Ironman mode to 10 players / 6 players is really too less. [/b] If clans cannot fill 10 slots, we can reduce the difficulty using the breakpoint system. Instead of asking players to pay $2 to expand their inventory, I recommend switching to selling content to players to make money. This game has real potential, but more content and changes need to be made. \n\nI don't suggest anyone until I see a change.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "terrible owner just bans people for no reason and tries telling them they broke rules they didnt(example playing gim group friends help me as they arent going to heavy i been tossing them gold and working on more to come get banned and told i was breaking rules  (funneling  apperantly lol  its a group we help each other.....) dont waste your time and cash  ruined months of work...",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Make no mistake. This game is predatory... First indicator is how hard it is to get help... there are a dozen ways to make it easier that they did not use, why? \n\nif you are new they will throw stuff at you to \"help\" but make no mistake its junk they saved up just to buy loyalty, they will toss you away if they think you are useless FDN \n'clan\"\n\nnice game otherwise",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Chat and community is mostly nice and you get offered help in global chat but the discord is massively hostile if you want to provide feedback to uninitiuive and simply wrong or bad Tooltips and game elements.\n\nYou get told to watch tutorials or read everything up on the wiki but the game itself does a bad job explaining a lot of things.\n\nI played with the maximum possible amount of 3 characters everyday and tried to find the most enjoyment.\nUnfortunately,the social aspect is good but the game itself just copied and pasted sone Runescape and melvor idle elements and added nothing of significance to it.\n\nAnd after being critiqued that much on the discord, im not going to further explore the worlds of Idle Clans.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I’ve played a lot of online games, but this one has one of the most toxic and hurtful communities I’ve ever experienced. Many players seem to go out of their way to be cruel, and while moderators sometimes mute offenders, they rarely take real action to stop ongoing harassment.\r\n\r\nWhen I started playing, I was already in a vulnerable place and hoped this game would be a positive distraction. Instead, the way people treated me made my mental health decline even further. No one should ever be made to feel worse just for trying to enjoy a game.\r\n\r\nThe gameplay itself is very bare-bones with little depth or creativity.\r\nOverall, I can’t recommend this game — both the community and the moderation make it an unsafe and unpleasant environment.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Was doing Combat, killin' some chickens for a few minutes.\r\nAccidentally clicked another skill to start cooking a fish. All the loot from the chickens gets deleted, since you have to manually loot it (seems like there's an auto loot that you likely have to pay for).\r\n\r\n7 minutes of my life killing chickens wasted. This is a tragedy that I'll never financially recover from.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Leave the game for 10 hours and find out it's stopped mining like what",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is in desperate need of combat animations, without it im just clicking stuff. With it, I might have actually been playing a video game. But since it doesn't have it, I can't recommend this game sadly. If I want to click stuff and watch numbers go up there's a thousands of other games where I can do that and things will actually happen on the screen while I do.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is the type of game that makes you purchase inventory space, and also has skills locked behind a paywall. Hard pass.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "base systems paywalled, bye",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Boring management.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Just wants your money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i don't like the idea of paying for the skills",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "w 45ushrtxfgb",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dont join the discord.\nbunch of self centered hostile clowns with the social intelligence of a microwaved blade of grass.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "\"Lazy Melvor Idle ripoff\" doesn't just come to mind, it's blaring any time you launch the game. \r\n\r\nThe idea of online multiplayer for an idle game is novel, but Idle Clans feels like another example that it just doesn't really work. A player-run auctionhouse is unique but not particularly interesting. The game is free to play but you're cut off at the legs if you don't buy premium, and you will loot item after item that clutters up your inventory because their only use is part of premium gameplay.\r\n\r\nThe biggest complaint - The user experience feels [b]awful[/b]. It's clearly designed for mobile, but every part of the design feels badly executed, and worse on PC. The list of skills is long which works poorly on a landscape-mode-designed game, resulting in a lot of scrolling up and down the list. Interacting with a thing will open a popup that opens a popup that opens a second menu and cancelling out of that menu won't take you back to the screen you were on to begin with. And [b]everything[/b] wants to open in a popup. The inventory is a mess and lacks the bank tabs of Melvor to at least somewhat organize it, so swapping equipment sets will haphazardly throw your gear back to the top of your inventory every time.\r\n\r\nSkills are barebones, and feel pointless beyond completing daily quests. Chop wood with lumberjacking so you can use the wood to turn it into planks. What do you use the planks for? Nothing.\r\n\r\nCombat doesn't feel interesting - They've tried to mimic Runescape (And by extension, Melvor)'s melee/archery/magic system, but runes and element types have been stripped of the magic system which makes it flavorless, and rather than the rock-paper-scissors attack type circle, enemies just have a weakness to a particular attack type - of which there are like, eight, because melee weapons all have different attack types. So you have crushing, slashing, stabbing, and pounding, but they do nothing other than ensure that you need four extra inventory slots to carry all the weapons you don't need.\r\n\r\nLoot from any source that isn't a direct \"X seconds => 1 item\" system is heavily RNG based, turning time investment into a gamble to see if you get the thing you want. While RNG in a game like this isn't uncommon, the actual drop rates combined with everything else turns it into a slog. I spent so much time grinding the singular creature that drops green leather (tier 3 leather), a mob that I was already vastly overleveled for, to get enough to make myself a set of armor that by the time I had gotten the 6 pieces needed, I had already outleveled the gear as well and needed red leather (tier 4).",
      "voted_up": false,
      "votes_helpful": 7
    }
  ]
}