{
  "positive": [
    {
      "review": "Very nice game. bunch of trolls and idiots and stuff but still...pretty nice lol",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Got the online racing pack and it has been super worth it!\nI've tried pretty much all main sim racers but for online \"serious racing\", besides spending a fortune in iracing i'd say this is the best option.\nThe game has a ton of tracks and car options, graphics and sound are surprisingly good for the age and you can hop on online races ranked or for fun with minimal wait time.\nSolid sim for anyone who wants to race online without joining leagues or racing spa/monza 24/7 like most public servers on other games.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Honestly, as in iRacing player this game is a LOT of fun. Theres a super chill atmosphere and an ability to enjoy the pure racing without getting held up on sweating laptimes. I strongly recommend if you want to re-ignite your racing passion, its not a straight replacement, but its a nice past time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I always put this game on a hold due to its age, and then I tried it. The graphics are definitely good enough to be able to enjoy, the audio is one of the best out there hands down, the physics are definitely good and multiplayer is clean. An absolute must if you want a serious sim racer.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "RaceRoom is quite good even though almost everything is behind a paywall for a free game it surprisingly has quite decent graphics i would rate it a solid 8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great just to hop into online no fuss. Much improved. The cars are grippy and damage model is forgiving making it good for in online when someone bumps you. A bump does not mean your race is over like in other sims.  No sweat good fun. Runs like a dream and solid VR. Graphics are simple but nice and the game has no graphical jaggy edges and maintains a high frame rate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sound of the engine is just pure eargasm. I play with Xbox controller and it's a bit difficult to play.\nGenerally I recommend it!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game, not a fan of all the microtransactions to get content, but good variety of cars and tracks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good sim ,. i slept in on it , but i tryed it not thinkig itd be all that good but its ... 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Everyone will tell you it's expensive and, it is. But, if you can afford it it's very good for a dedicated circuit racing sim, even if the UI is dated and there isn't much unranked online activity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good sim, easy to set up in my case. Steering wheel was detected right away and the game ran smooth. The updates the game has received the last couple of months are awesome. Definitely recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a good game, even better in VR, and whilst most of the cars are DLC, every one of them are worth it. The modelling is perfect and the sounds are amazing. But, there are quite a few cons. In PCVR, the menu screens render at insanely low resolution, and every time I load the game after I've played it the first time after it has installed, it renders in a window that I can't change because it limits where my mouse pointer can go, and the border in PCVR is right below the bar you see in the store where you pick the section (Cars, Tracks, e.t.c.), meaning I can't access the settiongs menu to change it. In short, I have to reinstall the game every time I want to play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Najlepszy symulator wyścigowy za darmo dostępny. Na początek za darmo jest tylko kilka samochodów i torów, ale jest zachowany pełen realizm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Free to play, but therapy for the trauma costs extra.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite simracing game, a lot of unique cars and tracks that you can't find anywhere else at a fair price. A big step up those last couple of years for the graphics, the mechanics and the competition system, it's truly an evolving and growing games !\n\nThis game is very special in a lot of ways, offering great racing sensations and memorable battles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This may be one of the best sims on the market ATM. Racing around in old DTM or Touring cars is addicting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good racing game but kind of complex for beginners",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels great on the wheel and it has cool different racing categories, also multiplayer experience is great so far, one of the better simulators out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First impressions of gameplay/racing are good, for a free game excellent. Going to explore a few more races before I decide whether to pay for additional content, but it has me interested already.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes I, new to sim racing and its a great way to get yourself into it. Or see if you will like it. I LOVE IT, more features would be nice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Free to play. Good physics and quick to get a match. Downloadable content required at extra cost",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seriously enjoy doing laps and going through the weekly challenges. Game feels good, just wish everything wasn't locked behind a paywall. Would rather pay for the actual game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game,so realistic.Wish to have more free cars and tracks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game, gives LMU A run after latest update.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game. Great sounds and physics. USA servers  do not have many players so the races have fewer opponents. Still fun though!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game to learn sim racing! It's free and I just play it with a controller...\n\n\nBUT IT DOESN'T SUPPORT WINDOWS XP NOOO D: 0/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoy this game. it has a p2p system but their prices arent too bad. It has amazing physics that are amazing for every type of racing when it comes to drifting, Formula cars, WEC, and much more. the way to go about this game is save up like 20 dollars and find a couple tracks and cars you love and buy them and you'll have so much fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the HUD is invasive, the models are poor, the steering wheel configuration is poor, the penalty system is annoying, but it's free ig",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its very fun to play if you have wheels and pedals and super exiting. you can also race, solo and race with bots!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great sim, underpopulated servers, it would be great to just be able to buy all the content for one price as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With the new multiplayer system and the graphics update one of the best simracing games ever. Vehicle and tracks variety is one of the best. Especially the super touring cars of the 90s are really fun. But also great GT3 racing and multiclass racing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably best sim personally\r\n\r\nJust waiting for the future night and rain updates + it would be great to have updated or (optimistically for the future) laser scanned most popular tracks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The controls are a bit funky but it def feels more of like you’re driving an actual F1 track which is cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very great game overall, but u kinda have to pay cash for lots of fun. u can actually run this on a microwave this is not laggy on lower end devices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DTM 1995, 2016/20 and Super Touring is where this game shines. Sure it has a lot of other content but the Deutsche Tourenwagen Masters series and Super Touring  is the best racing you'll ever experience bar none. WTCr is a worthy mention as well. I remember when this game first started, LOL. It has gone from 'meh' to 'superb'. There are other worthy mentions, KTM X-Bow Cup, and the Porsche 911 Cup Series (all).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "RaceRoom Experience: A Pleasant Surprise That Deserves More Praise\r\n\r\nI recently jumped into the world of RaceRoom Experience (RRE), grabbing a content pack during the Black Friday sale, and I am genuinely blown away after just a few hours. As someone who primarily spends time in AMS2 (and specifically races in VR), I'd always overlooked RRE—a mistake I now regret. This simulator is truly fantastic and deserves far more attention than it currently receives.\r\n\r\nThe core racing experience is top-notch. The physics feel incredibly grounded and responsive, offering a challenging yet rewarding drive across every class I've tried. Crucially, the sound design is phenomenal; the engine notes, gear shifts, and track ambiance are visceral and deeply immersive.\r\n\r\nMy early favorites include the Mazda MX-5, which delivers perfectly balanced momentum racing, and the Formula 3, which is an absolute blast of precision and speed. The variety in both cars and tracks already feels extensive and high-quality, giving me plenty to explore.\r\n\r\nHowever, the biggest standout feature for me is the Virtual Reality (VR) experience. Running on an RTX 4070, I can confidently say that RaceRoom's graphics in VR are the best of any racing title I own, including AMS2.\r\n\r\nI honestly don't understand why RaceRoom Experience doesn't get more mainstream praise. The combination of brilliant physics, killer sound, and VR graphics makes this a must-have for any serious sim racer. If you've been on the fence, jump in—you won't be disappointed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good physics, lot of different cars, pretty cheap if you buy everything on sale (Y)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best racing simulators if you dont want to spend thousands on iracing. The online racing pack is good, but free content is fun too, especially the f2p weekly combos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "superb ... super touring is epic . im addicted already",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still feels good after all this time and the new ranked is fun.\r\nOnly thing is hud situation could be better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So, I came into this because I had a itch for somewhat realistic racing after following formula 1 for a while. I had no plans buy anything(so no f125 and stuff, I did consider Iracing, but when I realized u need to buy tracks and cars, I thought maybe later). So found this,  free game, already a plus, has more than enough for a complete noob to choose from for racing. I havent really tried the multiplayer, but it seems fine, only thing is that multiplayer races have a time and schedule. I dont really how you can local multiplayer with this. But yeah,  at 11.1 hours played, Ive pretty much only played one track with one car(single event cr1 or something, i dont really know) to have a best time 1.40.06, which is pretty shit so I have a lot to learn. I love the fact that Im just 3 clicks away from a bot race in those Cr1s, those races seem scratch my itch just fine. So yeah, if you dont reallly know alot and just wanna feel what sim racings about, I dont see why this would be a game. It prolly isnt upto standard for a regular sim racer, but gets the job done just fine for someone who doesnt know much about sim racing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great content and now it has even great racing since the update to the LMU-like ranked multiplayer system.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "latest multiplayer lets you jump in and race with minimal fuss. having fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If u like jump in ranked racing without sweating ur balls  off like in iracing, you will enjoy this, more forgiving then other sims while still keeping it a simulator and not an arcade",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great racing sim good car physics solid multiplayer what more can i say? put your hands on the wheel and floor it works great in VR aswell as on a monitor",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Sim works well, good content, and a good bit of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great simracer. Very good \"out of the box\" for G29 FFB. Still receiving updates. Good graphics. Good driving physics. Slightly less demanding than ACC or LMU. Great multiplayer. Free server manager for own dedicated servers (self-hosting). You can test it for free. Many very good tracks and cars included in this XXL package.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is pay to win but it is realistic and has a lot of features.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An already enjoyable sim which got pushed in the right direction with this year's updates.\nThis year alone we've received an overhaul to the graphics and the ranked multiplayer system, which used to be kinda empty beforehand, but now you can get populated races very often, specially since the free weekly rotation combo that gets used. I usually only hotlap, but this pushed me to try out a few races myself. \nThere's a good chunk of content, tracks and discipline wise, which you don't really see in many other sims. If you specially like Touring cars and DTM's, you will have a decent amount of choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great Racing Sim, with an affordable model for those who don't want to pay a fortune for  like I-Racing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE IT RECOMENDED FOR ALL GAMER only downside is a lot of errors",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its good for free i just dont like that you have to spend like 4 euro minimum on every car",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Supertourers is amazing.  Now we need all the other BTCC cars, such as Clelland in his Vauxhall Cavalier!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent free racing game but its very limited unless you pay money",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good free starter sim game you can also buy stuff for",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sounds great, looks great, drives great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i love it whille yes you have to buy some stuff to get racing but its still great",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game for car lovers",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the premier sims with 99.99 all content bargain. Developers always active on improving the game and providing current cars w/ liveries. Almost no other game/community can say their sim game of choice comes close to RRE!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its fun game to practice racing theory.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game with good physics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Because its free I thought it would be bad but its one of the best driving games i've ever played",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I LOVE IT!!  Especially with the super touring and less known tracks like the Macau GP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nothing but hopefully they add more camera features",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love it\nSuper Tourers are especially amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is very realistic and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Finally, a worthy opponent for ACC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so good, and its free!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "brought fun to simracing, love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good game for being free. Really like raceing!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It needs a career mode and cheaper price",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty realistic for a free game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game \nDobra gra , dobrze czuć FFB .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best free racing sim out there, no comparison",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best controller sim by far!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Good starter racing sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommended some good fun racing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very competive racing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love the physics of the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Boring af but still recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I tried it for few hours. Might be fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fantastic game that has only gotten better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "super silly game it touches you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "race carr fast as heck boi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best f2p racing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good for old game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun on a controler",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best experience ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All good really good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super good game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good racing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good free racing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good good very very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good racing free give it a go",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 from meeee",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "looks like best sim for now",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "If you want to race anything else than whatever is free for a week, then you have to pay a lot. Right at the start, game recomends you a pack worth 30 euro, that gives you a good selection of tracks, but only 1 car of most classes. If you want more, you have to buy packs for every series. It just proves that no game is as expensive, as a free one. \n\nFurthermore game hits me with constant freezes, and crashed after I tried to switch V-sync off. I had to input every control binding for my wheel manually, UI is clearly from 2013, additionally they opted for white background in settings menu, so prep your sunglasses. No, there is no darkmode. At least I wasnt able to find it. \n\nGame looks ok, and sounds good. AI is really nice too. Forcefeedback seems lacking, but I was using default setings, propably could be better with some tweeks.\n\nI can recomend to someone who wants to see if the whole simracing is for him, since you can race a couple of cars on 4 free tracks, but if you want some variety for cheap, then better look at Asetto Corsa or Automobilista 2.",
      "voted_up": false,
      "votes_helpful": 43
    },
    {
      "review": "worst ffb ive ever experienced . i have a simucube 2 and no matter what settings ive tried its still dogshit",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "It would seem that I'm not going to get what I'm looking for, which is a racing game which can be used with a controller and largely works out the box with default controller settings, I'm not looking for dynastic career progression and I'm certainly not looking for hours of trial and error to get the car to handle in any sort of fashion that I find usable.  I understand that the problem is mine and not the game's but it is what it is.  Not for me.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Its \"free\", except you have to buy almost every track or car. So basically this is just a demo. Its fun, but not the free alternative I was looking for.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Hanging physics and game engine are good. Graphics are fine. I know you can’t expect too much, since this is a free-to-play game — but you only get, like, five tracks available and a certain number of cars available with the base game. Everything else is micro-transactions and paid DLCs. Not a huge fan of that, to be honest, which is the reason why I stopped playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Requires a persistent online connection.  I'm not sure how, but it bypasses my firewall.  NICKLES AND DIMES.  Everything is sold a la carte; packs seem large, but are extremely limited. Greedy Greedy - strike one. \n\nLots of \"AI\" options.  Nowhere to turn that off, and set it to a simplified model.  Strike two: AI, and constant access to my computer?  Nah. \n\nThe game is good.  Hyper realistic, no flashbacks.  You fail, you restart.  Too many options for car tweaks.  Could use a simplified menu of settings in addition to the extended menu.  Just a suggestion to teach people how to use the options.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible VR performance, even with the \"VR Graphics Preset\" (I guess the game doesn't like AMD GPUs) and the cars feel like driving on rails. I have never driven a Race Car IRL, but I highly doubt it behaves as unresponsive as this.\nThis is the 4th time I have installed this game, because I tell myself it can't be as bad as I remember when it seems so popular on youtube. But it always turns out exactly how I remembered.\nHow is this game so popular? I really don't get it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've tried so many timees... But it's terible. After years my FFB is working now, but the game is undrivable and stutters like crazy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When i first downloaded the game it told me to get a controller. So i did and i booted up the game tried to start a single player practice session. It then turns out, the game automatically assumes im on keyboard and i have to setup all controls myself because it didnt have a out the box controller option. When i finally learn to drive it just is a manual shifting car, you would assume you could costumise this. NO. and i suck at driving with manual and twitchy steering. Another thing is that it gives you some cars that you can drive in your \"Owned\" category so if i pick a gtr car it wants me to pick a model and then to pick a livery but you have to pay for liverys and you cant drive without a livery. All in all i uninstalled the game faster than it took for me to regret spending 70 gigabytes to have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was highly anticipating this after Jimmy Broadbent made a recent post, but...\n\nPoorly \"Optimized\" game is completely unplayable in 32:9 with any resolution scaling above 100% (old timer issues)\nVERY rude and unhelpful Technical Support staff through Discord\nNon Existant support in the \"Support\" page within their website\nAll of the installation manuals are from 2014 with no updates\nCopyright is out of date by almost over 2 years\n\nTheyre still pushing sales for this 10+ year old title despite these issues plus more.  \n0/10 Terrible Experience All Around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was able to start it twice but the load screen is stuck and I get no error or anything so I can't even debug it...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this simulator. it was certainly way better than Rennsport, but really is not great overall. first, the car selection was REALLY poor for ftp. Then when i got a car i can actually drive, the wheelbase( in my case a t598 ) would not run with this no matter how i adjusted the settings. likely a skill issue on my end, but i still didn't really enjoy this. if there was a paid version of the game with all the cars id gladly purchase that. but that simply doesn't exist",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is my most played game. I have spent more money on this game than any other because it is, in a lot of ways, the best of the racing games - certainly, in my opinion, the cars feel better to drive than in other games. The big drawback is the need to be constantly online, even when you are playing single player. After the last big update I (along with others) now can't connect to the game without using a VPN. Despite it being the only game I have issues with, and despite it happening directly after a big update, the developers deny it has anything to do with the game, it is something to do with my computer. I won't bore you with the list of adjustments, reinstalling and so on, but I've spent many hours trying to sort it out and made no progress. I only have problems with this game, ergo it is this game that is the problem. If the developers had accepted that there was a problem that affected some users, and that they were trying to sort it out, I would have been happy. Making me waste many hours trying to sort a problem out that doesn't exist on my computer, left me with a feeling of mistrust. I do not trust them and will spend no more on this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is a mess. Server problems, game crashes, but 100 working ads for the car shop. Frustrating experience for a new player.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "To be honest, really disappointed on this whole free thing. every car worth driving is under a price lock. I didn't get this free game to spend the amount i did on asseto corsa comp on 2 cars and a shitty circuit. Less than desirable graphics, and not that realistic of a sim.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Putting a non-toggleable speed deadzone on the arrow keys by default is an instant uninstall from me. At no point should speed factor in to how much I turn my wheel, and developers who implement this shouldn't be allowed to touch a game engine, let alone a real car.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolutely boring playing it for free because you have to buy everything in the store to make it fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "in my first race i got dive bombed into a corner and got 4 incident points, 5 seconds later i was kicked for \"going over the incident limit\" this was on the first lap and in the first turn. i did not have 40 incident points. i had 4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "online races load to blackscreen try to restart game can only see half of screen fixes itself only after missing race start rating gets raped because game loads to blackscreens WASTE OF TIME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are not like advertised, the steering with a sim racer is super bad, clutch didnt work, gear shifter didnt work, idk if i just didnt put enough time into figuring it out but for the amount of storage it takes up, its definetely not worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Badly optimized. I can run Automobilista 2 and Le Mans Ultimate on high, but this game on medium settings gets 30 fps on the main straight.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FFB is non-existant for my simagic setup, VR doesn't run well, feels empty like it always has, re-unistall. \n\nDon't buy into the hyper youtubers are paid to create. Plenty of better sims out there... Just get AMS2 on sale and LMU...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lags out at menu screen, something about a timeout error, i do not use multiplayer...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried several things but I can't start an actual race or practice session!\nBesides that, the loading screens are terrible (big ad for special packs).\nAnd the support page on the website shows no support at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful handling not realistic and pay to play you can play only one track and like 3 cars and that is it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT RECOMEND you only get like 6 maps bc the rest u need to pay wich is bs and the steering is very bad you only get like 10 cars its a waste of storage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "controler throttle dosent work its like a button",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy bas anything have to change anti analising ill stick to iracing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's 2025 and I can't properly set up the steering lock in the game.\nMy choices are either to have the in-game wheel completely out of sync with my IRL wheel, or have them in \"sync\" only to notice I can go past the car's steer lock limit AND THE GAME WILL ACCEPT my inputs and make the car turn more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yea it's not good that's not race other game be better than this game  this game has many cars and cirkit but it's all about \nnot free",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT GET THIS GAME! harsh penalties and only 1 car that you can drive without paying. 4 tracks that you can drive on without paying £2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The cars drive great. The tracks are fantastic. The drivers online are absolute morons. Maybe 2 or 3 fair drivers, but the rest of the lobby is pathetic on the daily races. With LFM, or league racing, this could be great. There needs to be a way to kick drivers that fight by ramming when you pull alongside them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lap invalidation is absolutely absurd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "grand turismo 7 , i think they are all playing this online now, dive bombs everywhere",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mostly everything is locked behind a paywall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just get iracing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "noetuuu4ycercduzoi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "slecht",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want to race anything else than whatever is free for a week, then you have to pay a lot. Right at the start, game recomends you a pack worth 30 euro, that gives you a good selection of tracks, but only 1 car of most classes. If you want more, you have to buy packs for every series. It just proves that no game is as expensive, as a free one. \n\nFurthermore game hits me with constant freezes, and crashed after I tried to switch V-sync off. I had to input every control binding for my wheel manually, UI is clearly from 2013, additionally they opted for white background in settings menu, so prep your sunglasses. No, there is no darkmode. At least I wasnt able to find it. \n\nGame looks ok, and sounds good. AI is really nice too. Forcefeedback seems lacking, but I was using default setings, propably could be better with some tweeks.\n\nI can recomend to someone who wants to see if the whole simracing is for him, since you can race a couple of cars on 4 free tracks, but if you want some variety for cheap, then better look at Asetto Corsa or Automobilista 2.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Great new update but once again a big FU to existing customers who had paid for an all inclusive package. There always seems to be a little more to pay with this title. Death by a thousand cuts springs to mind. Very greedy.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game is now horrible with micro strutters, even on a flat screen. Developers dont seem to be bothered in finding out why  or finding a solution.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I get that the game is free, but I don't wanna buy 20 thousand fucking cars with real money",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I woud love to be able to play this game, unfortunatly i can never get a game that has a low enough ping in australia..i always get booted..so i have to play against bots which gets boring..not to mention you gotta buy everything...even though most the prices are decent..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "out of the box, simhub didn't like the game... didn't want to communicate rumble for gear/road/curbs to my bass shakers.\r\n\r\nApart from that, just redownloaded to buy super touring, went to 2 races and couldn't join for whatever reason... went to race another time another week, didn't have the rack... Just make a pack that includes all tracks for that chanpionship so I have all the things I need to race. Then its up to me to buy pack or individually.\r\n\r\nI don't have time to much about, when I load my sim I need to just race.\r\n\r\nBack to AMS2 :) \r\n\r\nFFB is not bad but nothing impressive -feels a little bit week but again not bad.\r\nIt can get expensive - I bought full pack about 5 years ago it wasn't cheap - all in all I might as well have bough a proper game. \r\n\r\nMay be good if you just start but if you're serious go for AMS2 with LFM or other leagues. \r\n\r\nUNINSTALLING",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "triple screen support terrible, dated game and it shows.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its \"free\", except you have to buy almost every track or car. So basically this is just a demo. Its fun, but not the free alternative I was looking for.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Would not recognize Thrustmaster wheel or Fanatec pedals. Call me crazy, but for a game not to recognize well-known products is absurd. Every other game is plug-and-play.\n\nUninstalled, they'd have to pay me to play this free game in the future.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The content is handled in the worst way possible, you have to pay an arm and a leg if you want to have a complete game (more than you would pay for something like gran turismo which has like 100x the content and is often 10 times of better in terms of quality), and its so confusing if you dont know what content you want. Just make the game a 50euro price tag (which is generous) and you are done and would probably make more money that way. I wanted to play with supertouring cars in a variety of tracks and aside from the 10 or so euros id have to spend id also have to spend like 20 more on tracks let alone the rest of the content, and its a shame because they are working with a solid platform, the handling feels extremely nice even for a controller scrub like me and the cars and tracks look good enough, but i cant justify spending money on a game that lacks so many features like night mode, rain, a proper ui, a livery editor and a proper career mode and ive also heard although i cant confirm that the online is a mess. The game is not even in beta and they want you to pay hundreds for the rest of it. Things like these are why racing sims and generally all games and media are going to the nether, monetisation models like these make piracy look like a better and easier option.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Hanging physics and game engine are good. Graphics are fine. I know you can’t expect too much, since this is a free-to-play game — but you only get, like, five tracks available and a certain number of cars available with the base game. Everything else is micro-transactions and paid DLCs. Not a huge fan of that, to be honest, which is the reason why I stopped playing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Requires a persistent online connection.  I'm not sure how, but it bypasses my firewall.  NICKLES AND DIMES.  Everything is sold a la carte; packs seem large, but are extremely limited. Greedy Greedy - strike one. \n\nLots of \"AI\" options.  Nowhere to turn that off, and set it to a simplified model.  Strike two: AI, and constant access to my computer?  Nah. \n\nThe game is good.  Hyper realistic, no flashbacks.  You fail, you restart.  Too many options for car tweaks.  Could use a simplified menu of settings in addition to the extended menu.  Just a suggestion to teach people how to use the options.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible VR performance, even with the \"VR Graphics Preset\" (I guess the game doesn't like AMD GPUs) and the cars feel like driving on rails. I have never driven a Race Car IRL, but I highly doubt it behaves as unresponsive as this.\nThis is the 4th time I have installed this game, because I tell myself it can't be as bad as I remember when it seems so popular on youtube. But it always turns out exactly how I remembered.\nHow is this game so popular? I really don't get it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've tried so many timees... But it's terible. After years my FFB is working now, but the game is undrivable and stutters like crazy.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When i first downloaded the game it told me to get a controller. So i did and i booted up the game tried to start a single player practice session. It then turns out, the game automatically assumes im on keyboard and i have to setup all controls myself because it didnt have a out the box controller option. When i finally learn to drive it just is a manual shifting car, you would assume you could costumise this. NO. and i suck at driving with manual and twitchy steering. Another thing is that it gives you some cars that you can drive in your \"Owned\" category so if i pick a gtr car it wants me to pick a model and then to pick a livery but you have to pay for liverys and you cant drive without a livery. All in all i uninstalled the game faster than it took for me to regret spending 70 gigabytes to have.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was highly anticipating this after Jimmy Broadbent made a recent post, but...\n\nPoorly \"Optimized\" game is completely unplayable in 32:9 with any resolution scaling above 100% (old timer issues)\nVERY rude and unhelpful Technical Support staff through Discord\nNon Existant support in the \"Support\" page within their website\nAll of the installation manuals are from 2014 with no updates\nCopyright is out of date by almost over 2 years\n\nTheyre still pushing sales for this 10+ year old title despite these issues plus more.  \n0/10 Terrible Experience All Around.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was able to start it twice but the load screen is stuck and I get no error or anything so I can't even debug it...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wanted to like this simulator. it was certainly way better than Rennsport, but really is not great overall. first, the car selection was REALLY poor for ftp. Then when i got a car i can actually drive, the wheelbase( in my case a t598 ) would not run with this no matter how i adjusted the settings. likely a skill issue on my end, but i still didn't really enjoy this. if there was a paid version of the game with all the cars id gladly purchase that. but that simply doesn't exist",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is my most played game. I have spent more money on this game than any other because it is, in a lot of ways, the best of the racing games - certainly, in my opinion, the cars feel better to drive than in other games. The big drawback is the need to be constantly online, even when you are playing single player. After the last big update I (along with others) now can't connect to the game without using a VPN. Despite it being the only game I have issues with, and despite it happening directly after a big update, the developers deny it has anything to do with the game, it is something to do with my computer. I won't bore you with the list of adjustments, reinstalling and so on, but I've spent many hours trying to sort it out and made no progress. I only have problems with this game, ergo it is this game that is the problem. If the developers had accepted that there was a problem that affected some users, and that they were trying to sort it out, I would have been happy. Making me waste many hours trying to sort a problem out that doesn't exist on my computer, left me with a feeling of mistrust. I do not trust them and will spend no more on this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is a mess. Server problems, game crashes, but 100 working ads for the car shop. Frustrating experience for a new player.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is unplayable, I can't do anything at all, as soon I launch the game. The screen goes black then is gone to show my desktop screen. My mouse turns into a loading donut. I waited 30 minutes and nothing. This is a fucking joke",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game seldom works properly, constant crashes and boots to the main menu. Decent sim if it does decide to work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Tried the game to see if I could have a quicker racing game to just pick up and play, but it's just stuck in the loading screen and won't even get into a race, tried several times waiting 5 to 10 minutes, still couldn't even play. It's a shame, it looks like it would have been a fun game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "VR doesn’t work with a Pimax Crystal Light (RTX 5090 + 9800X3D). The game just crashes on startup. I have no problems with iRacing, AMS2, LMU, or ACC. Since competitors work out of the box, I don’t feel like spending hours trying to get this one running — so I’ll pass on it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is just one big bug. You start your multiplayer career with a rating of 1500 and a reputation of 70. As soon as you try to drive a few races, the game crashes and you lose 20-50 rating points and 5-30 reputation points every time... What a waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It would seem that I'm not going to get what I'm looking for, which is a racing game which can be used with a controller and largely works out the box with default controller settings, I'm not looking for dynastic career progression and I'm certainly not looking for hours of trial and error to get the car to handle in any sort of fashion that I find usable.  I understand that the problem is mine and not the game's but it is what it is.  Not for me.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "worst ffb ive ever experienced . i have a simucube 2 and no matter what settings ive tried its still dogshit",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "To be honest, really disappointed on this whole free thing. every car worth driving is under a price lock. I didn't get this free game to spend the amount i did on asseto corsa comp on 2 cars and a shitty circuit. Less than desirable graphics, and not that realistic of a sim.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Cannot recommend.  Nice selection of tracks/cars but the mandatory BOP for using assists is ridiculous.  I have never seen another game do this.  What a waste of my time and money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Putting a non-toggleable speed deadzone on the arrow keys by default is an instant uninstall from me. At no point should speed factor in to how much I turn my wheel, and developers who implement this shouldn't be allowed to touch a game engine, let alone a real car.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolutely boring playing it for free because you have to buy everything in the store to make it fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "in my first race i got dive bombed into a corner and got 4 incident points, 5 seconds later i was kicked for \"going over the incident limit\" this was on the first lap and in the first turn. i did not have 40 incident points. i had 4.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "online races load to blackscreen try to restart game can only see half of screen fixes itself only after missing race start rating gets raped because game loads to blackscreens WASTE OF TIME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Badly optimized. I can run Automobilista 2 and Le Mans Ultimate on high, but this game on medium settings gets 30 fps on the main straight.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "FFB is non-existant for my simagic setup, VR doesn't run well, feels empty like it always has, re-unistall. \n\nDon't buy into the hyper youtubers are paid to create. Plenty of better sims out there... Just get AMS2 on sale and LMU...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lags out at menu screen, something about a timeout error, i do not use multiplayer...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The driving feel in this game is impeccable and can often feel fantastic to drive the vast variety of cars around a large choice of tracks, however there lies a few glaring flaws. For one, the free content out of the box leaves a bit to be desired and can be somewhat pricey. More glaringly the AI in this game makes playing in Single Player an exercise in frustration and often leaves a lot to be desired in that cars will often be able to often outbrake you and leave you for dust while you lock up trying to match them in pace, might just be my racing wheel (Logitech G293) but far too often i'm finding myself needing to steer an obscene amount to make hairpins work which consequently makes shifting through gears very difficult out of corners, having zero feel of the pedals before you lock up and fly off into the gravel is infuriating as stated before with the AI often just divebombing into you while often outbraking you with no clear idea on how to improve speed. \n\nAdditionally the game does not reward you for playing in Singleplayer at all unless you like time trials and leaderboard challenges for reasons stated above. Combine that with a tiny population playing the game in Australia (and those not in Australia often kicking you out for high ping...)b  and I'm sadly gonna give this game a not recommended.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried several things but I can't start an actual race or practice session!\nBesides that, the loading screens are terrible (big ad for special packs).\nAnd the support page on the website shows no support at all.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful handling not realistic and pay to play you can play only one track and like 3 cars and that is it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT RECOMEND you only get like 6 maps bc the rest u need to pay wich is bs and the steering is very bad you only get like 10 cars its a waste of storage",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "controler throttle dosent work its like a button",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Buggy bas anything have to change anti analising ill stick to iracing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's 2025 and I can't properly set up the steering lock in the game.\nMy choices are either to have the in-game wheel completely out of sync with my IRL wheel, or have them in \"sync\" only to notice I can go past the car's steer lock limit AND THE GAME WILL ACCEPT my inputs and make the car turn more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "yea it's not good that's not race other game be better than this game  this game has many cars and cirkit but it's all about \nnot free",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT GET THIS GAME! harsh penalties and only 1 car that you can drive without paying. 4 tracks that you can drive on without paying £2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The cars drive great. The tracks are fantastic. The drivers online are absolute morons. Maybe 2 or 3 fair drivers, but the rest of the lobby is pathetic on the daily races. With LFM, or league racing, this could be great. There needs to be a way to kick drivers that fight by ramming when you pull alongside them.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Lap invalidation is absolutely absurd.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "grand turismo 7 , i think they are all playing this online now, dive bombs everywhere",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mostly everything is locked behind a paywall",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "just get iracing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "noetuuu4ycercduzoi",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "slecht",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "awful",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want to race anything else than whatever is free for a week, then you have to pay a lot. Right at the start, game recomends you a pack worth 30 euro, that gives you a good selection of tracks, but only 1 car of most classes. If you want more, you have to buy packs for every series. It just proves that no game is as expensive, as a free one. \n\nFurthermore game hits me with constant freezes, and crashed after I tried to switch V-sync off. I had to input every control binding for my wheel manually, UI is clearly from 2013, additionally they opted for white background in settings menu, so prep your sunglasses. No, there is no darkmode. At least I wasnt able to find it. \n\nGame looks ok, and sounds good. AI is really nice too. Forcefeedback seems lacking, but I was using default setings, propably could be better with some tweeks.\n\nI can recomend to someone who wants to see if the whole simracing is for him, since you can race a couple of cars on 4 free tracks, but if you want some variety for cheap, then better look at Asetto Corsa or Automobilista 2.",
      "voted_up": false,
      "votes_helpful": 47
    },
    {
      "review": "Great new update but once again a big FU to existing customers who had paid for an all inclusive package. There always seems to be a little more to pay with this title. Death by a thousand cuts springs to mind. Very greedy.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Game is now horrible with micro strutters, even on a flat screen. Developers dont seem to be bothered in finding out why  or finding a solution.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I get that the game is free, but I don't wanna buy 20 thousand fucking cars with real money",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I woud love to be able to play this game, unfortunatly i can never get a game that has a low enough ping in australia..i always get booted..so i have to play against bots which gets boring..not to mention you gotta buy everything...even though most the prices are decent..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "out of the box, simhub didn't like the game... didn't want to communicate rumble for gear/road/curbs to my bass shakers.\r\n\r\nApart from that, just redownloaded to buy super touring, went to 2 races and couldn't join for whatever reason... went to race another time another week, didn't have the rack... Just make a pack that includes all tracks for that chanpionship so I have all the things I need to race. Then its up to me to buy pack or individually.\r\n\r\nI don't have time to much about, when I load my sim I need to just race.\r\n\r\nBack to AMS2 :) \r\n\r\nFFB is not bad but nothing impressive -feels a little bit week but again not bad.\r\nIt can get expensive - I bought full pack about 5 years ago it wasn't cheap - all in all I might as well have bough a proper game. \r\n\r\nMay be good if you just start but if you're serious go for AMS2 with LFM or other leagues. \r\n\r\nUNINSTALLING",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "triple screen support terrible, dated game and it shows.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its \"free\", except you have to buy almost every track or car. So basically this is just a demo. Its fun, but not the free alternative I was looking for.",
      "voted_up": false,
      "votes_helpful": 4
    }
  ]
}