{
  "positive": [
    {
      "review": "Very f2p friiendly, basically give you the game 4 free via the coupon \"EXPLORE OUR WORLD\"",
      "voted_up": true,
      "votes_helpful": 34
    },
    {
      "review": "I love the fact that the game is open world, quests are easy to read and follow. I run on a laptop that apparently \"doesn't\" have a GPU so I run on low graphics and it runs great. I can't wait to upgrade to a PC or a better laptop to see the games' FULL potential. This game reminds me a lot of World of Warcraft, (WoW). My father, mother and I played WoW for at least 12 years. I'm hoping this game gets me back into games like this. Keep up the great work!",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "I have been playing this game off and on  (just like the majority of the community) since it's launch in 2007 on our very old (even for the time) family computer. This game isn't for everyone, as it is graphically outdated (but still very beautiful) and an MMO. However,  no matter how many times I put the game down, I end up picking it up again at some point. It is the most faithful adaptation to Tolkein's works in all of media, and even if all you've experienced of this world are the films, it will astonish you (assuming you enjoyed them). The community tends to be majority 30-40 somethings, so take from that what you will. If you've ever wondered what it would be like to follow in the footsteps of the Fellowship across Middle Earth, this is the game for you, as you will experience just that (or as close to it as possible in a cartoonish style landscape). The game is not optimized and has many faults, but despite those faults, it continues to survive and charm all that play it. I am not an employee nor am I affiliated with this dev other than as a consumer, but I cannot recommend this game enough to anyone even slightly curious about it. Good luck to anyone that finds this review useful and downloads the game, and find me inside where I will inevitably be!",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "After 13 years this is still my favorite MMO. Least toxic online gaming community I've ever seen, and the devs treat each quest like a love letter to Tolkien.",
      "voted_up": true,
      "votes_helpful": 18
    },
    {
      "review": "Fun to play and is feeling line Original World of Warcraft felt like (at least to me). Leveling can be sped up with miscellaneous boosts that you'll get along the way, but in no way do you need to use them.\n\nThis is a perfect game that you can take your leisurely time to enjoy and with the ability to change difficulty rating, you can challenge yourself if you have that urge.\n\nI honestly wish I could turn back the clock to 2007 and tell myself to play this game. At the time I was playing WOW (probably addicted to it at that time) and didn't want to give something else a shot. I WISH I had purchased the lifetime VIP account (long time gone now); it was an amazing deal for anyone who got it.\n\nFree to play content is a ton.\nEXPLOREOURWORLD code (if active when you read this; was set to expire on 11/03/2025 but is still officially active through 12/07/2025) adds a literal TON more content; as in a few expansions worth.\n\nMake even $1 real money purchase and you pop from free account to Premium account.\nBuy just one month of VIP (to make yourself into a VIP account) and when the one month is over you drop back down to a Premium account but retain a good amount of VIP perks (obviously not all)\n\nAlso ... the LOTRO points that you can buy for real money and use to get more content, cosmetics, and ease of life items can be earned in game for doing certain quests, deeds, and tasks -- so if you were to save up all earned lotro points, I've read that you could have 6000 by lvl 95 which would actually be enough to buy two expansions.\n\nGive it a shot for free  ... .because it's free.... and assuming you like it, go from there.\n\n(No one paid me or gave me any type of benefit for typing all this out; I just am enjoying what I'm playing. Yes, I've dropped some $$ into it, but not a ton and as I intend to play it for the foreseeable future (At least one year and probably from now on -- not gonna lie, if Ashes of Creation ever goes truly live, I'm going to give it a chance to lure me in, but that will charge monthly forever, so LOTRO will now always be something I play.)\n\nLast thing, the graphics in LOTRO are closer to 2007 graphics, so be sure to set dpi to match your monitor, because the default dpi is quite low. Once you have the graphics set to your monitor and maxed out (doesn't take much of a gpu at all to pull off max settings)\n   --- additionally, go into the UI and you can adjust a ton of things to your liking.\n\nHope this all helps,\nBe well.\n\n\n\n     ---- Checked off the box to indicate I received this product for free, because the game is free to play (with option to spend real money, but it's not necessary to actually do so)",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "You get to see Gimli FEET and Frodo BUMM <3\n\nTop chill old-school MMO for LOTR nerds I've been already playing for more than 10 years and put thousands of hours in. Great F2P model, you get content up to level 95, which is hundreds of hours and you can earn in-game store currency that unlocks new regions by doing what would basically be achievements and completitionist lists.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a great classic MMO and with the codes that are live right now being able to get most of the game completely for free is 100% worth trying out.  The community has been great to play with and learn from.  And with the new starter zones giving free ride ablity, now is the time to try out LOTRO!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "LOTRO is so dope I'm obsessed. It's so chill! I just spend hours fishing in the Shire and exploring, it's the perfect game to unwind with after work.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A very large and expansive game based on Tolkien's works. Old but still continuously updated til this day. Many of the DLCs are paid, but the currency to buy them can be grinded out or as the time of writing this review, be claimed with the code EXPLOREOURWORLD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a long-time Tolkien reader, I approach any adaptation with a healthy skepticism, but LOTRO has consistently been a pleasant surprise. It’s not without its grindy MMO tropes and dated combat, yet the unparalleled dedication to faithfully recreating Middle-earth is its true magic. Wandering from the cozy hearths of the Shire to the solemn grandeur of Rivendell isn't just a gameplay loop; it's a pilgrimage. The world feels lived-in and rich with quiet stories you discover by simply taking the road less traveled. In an age of hyper-competitive games, LOTRO remains a refreshingly thoughtful and immersive sanctuary for those of us who just want to be in the world Tolkien built, at our own pace.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Surprisingly not dead! And still getting updates. A classic for a reason.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Still pretty good. Still getting updates and new content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The Lord of the Rings Online is a welcoming, story-rich MMORPG that truly captures the feel of Middle-earth. The game’s biggest strength is its questing and world-building—locations like the Shire, Bree, and Rohan feel authentic and alive. While the graphics show their age, the art style still holds up, and the music is wonderful.\nCombat is slower compared to modern MMOs, but the deep class system and friendly community make up for it. Best of all, it’s very free-to-play friendly, letting you experience a huge amount of content without spending money.\nIf you enjoy Tolkien’s world and prefer a relaxed, story-driven MMO, LOTRO is absolutely worth trying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game doesn't seem to be overrun with totally insufferable toxic players and that is very refreshing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Old school MMO that is lore correct! Amazing LOTR game. It is clunky at a time, it is laggy at a time, but it is most immersive MMO on the market! It is mostly PVE, but its done correctly. Still getting updates and expansions. Insanely friendly community! Worth a try!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly I don't remember the last time I saw such a friendly, wholesome, world chat. VIP perks are an easy grab and it feels very worth your investment. My personal favorite thing is the fishing and bird log, I'm excited to find them all. This game is a gem and still thriving in 2025.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good game full of magic, charm and clunkiness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been with this game (not through Steam) for close to 18 years. I was there at launch day and have tons of hours ever since. Its not remastered or new but it has some old school, nostalgic charm. If you do not mind its dated mechanics and more traditional MMO style play, you can find hundreds of hours of content. If you love LOTRO and ever reamed of walking into Rivendell or seeing Weathertop, you can. If you ever dreamed of owning a home in Middle Earth, you can. And you can stop playing and come back and not miss a beat. It does not punish you for breaks unlike more modern games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels like a combination of Everquest and Classic WoW. Once you can get around the old UI and get accustomed to things it grows on you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "such an old but enjoyable game.  The game system is great. If you don't need the best graphics, this is the game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It does fill that \"Tolkien itch\" when I feel like it.\nHas some great free to play value but to get the most out of the game, you'd still have to spend (some purchases are quite expensive)\n\nOverall a great MMO to vibe with if you're a fan of old school MMO or an Tolkien fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best MMO's, the writting is great, it looks amazing and it's free! If you're a fan of Tolkien or just looking for a chilll game, then Go Play It RN!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very laid back. can play without a lot of thinking. cool to see the lotr sites and characters in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]A Faithful, Story-Driven Journey Through Middle-earth. Aging, But Still Magical[/h1]\r\n\r\nFew MMORPGs honor their source material as lovingly as The Lord of the Rings Online™. Even after more than a decade of updates, the game remains one of the most immersive ways to experience Tolkien’s world, not through cutscenes or flashy cinematics, but through exploration, storytelling, and a steady sense of adventure. LOTRO is at its best when you’re simply wandering Middle-earth, listening to the music, reading the quests, and absorbing all the small, handcrafted details that make the setting feel alive.\r\n\r\nEvery major region, The Shire, Bree-land, Rohan, Mordor, Gundabad, feels carefully crafted with tone, lore, and atmosphere in mind. The game’s writing is consistently strong; quests are descriptive, warm, and often surprisingly emotional. It’s easy to understand why LOTRO has such a loyal long-term fanbase: it’s not about rushing to endgame, but enjoying the world as you move through it.\r\n\r\nHowever, LOTRO’s age does show. Combat feels slow and somewhat clunky, with long skill animations and global cooldowns that can make fights drag out. While experienced players may find comfort in the rhythm, newcomers often need time to adjust to the older design philosophy. The UI also feels dated, and despite visual updates over the years, LOTRO remains graphically behind modern MMOs, even if the art style and landscapes still hold charm.\r\n\r\nProgression is a mix of satisfying and sluggish. The leveling experience is lengthy but packed with content, offering hundreds of hours of quests. However, the amount of expansions, zones, and systems can overwhelm new players. Monetization is generally fair today compared to the game’s older model, but the sheer number of packs and expansions can be confusing for newcomers trying to figure out what to buy.\r\n\r\nDespite these issues, LOTRO’s heart is undeniable. The community is famously welcoming, role-players thrive, and the developers continue to support the game with updates and events. For players who value narrative, world immersion, and a slower, more thoughtful MMO experience, LOTRO still stands as one of the most unique and rewarding journeys available.\r\n\r\n[h3]The Good:[/h3]\r\n\r\nExceptionally faithful recreation of Middle-earth with deep atmosphere and lore.\r\nStrong narrative focus and memorable quest writing.\r\nFriendly community and years of content across countless regions.\r\n\r\n[h3]The Bad:[/h3]\r\n\r\nCombat is slow, clunky, and noticeably outdated.\r\nVisuals and UI show the game’s age despite updates.\r\nNew players may feel overwhelmed by expansions, systems, and progression paths.\r\n\r\n[h3]Ratings:[/h3]\r\n\r\n[b]Overall:[/b] 8 / 10\r\n[b]Visual:[/b] 7 / 10\r\n[b]Gameplay:[/b] 7 / 10\r\n[b]Story:[/b] 9 / 10\r\n[b]Audio:[/b] 9 / 10\r\n[b]Playability:[/b] 7 / 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the best MMO's out there. Superb writing, an amazing world and great value, especially for a F2P game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty authentic mmo experience that still has that classic mmorpg feel. Great soundtrack, visually well designed. Some of the systems are dated and there is less hand holding than modern games, but the journey is really good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOTRO is a vibe. Yeah, the UI is a bit clunky and it shows its age, but once you're exploring Rivendell for the first time, you just don't care. Worth a try for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though I'm on an off when playing this game, it still manages to bring me back and play through it some more. I did unfortunately lose a really good character when a server shut down but that's okay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have over 500 hours in on this. I initially picked it up back in the days when it was still making the news and played the heck out of it. I recently re-installed it and boy, had I missed it! I'm a huge fan of Middle Earth, and this game is the closest I'll ever get to living that fantasy. I don't care if there are games out there today with \"better\" graphics. This is a beautiful panorama of a world, everywhere you look. MMO isn't really my thing, I prefer solo, but that's not a problem for this game. If you're any kind of a fan of epic fantasy then you should give this Tolkien homage a good, long play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i've played this game for almost 400 hours and i still haven't reached mordor. that's how much content there is. there's so much story to explore and characters to meet. it can feel overwhelming to start but i love a game where you can just run around and explore and figure stuff out at your own pace. also the community is pretty nice even if the social aspect isn't actually that important in the long run. it's nice to know if i need help i can message someone in my kinship and get some. i've only gotten into one fight in world chat and i'd call that an achievement in a fantasy mmorpg lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After all those years its still one of the best mmos that you can play. Some people will stil argue that you have to spend a lot of money to gain content and well not anymore. Developert a giving away content for free in some events and if you dont want to wait you can buy 50 dollars pack with all contnent (without the latest expansion). But anyway its free-to-play game up to level 95 for everyone (and everytime) and believe me, its a lot of hours of content. But the main reason, why people still play this is game is that amazing ladcape of Middle Earth. Its really amazing that you are wondering though the world and you can see all the places that you read about or you saw them in the LOTR trilogy (like defending Minas Tirith or Helms Deep). So if you like classic (slower) leveling system and classic combat (not like that flashy garbage in retail WOW) or you simply are fan of Tolkien stories and Middle Earth you would make a big mistake to not give this game a try. After all its free-to-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this game for years (before I added it to Steam) and I love it. It really brings the lore of LotR to life and I enjoy every minute that I play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the biggest worlds to explore I have seen in games. Designs of some locations are truly breathtaking. A slow leveling experience only adds to the whole package of a casual, stress-free journey through Middle-earth. Highly recommended to any fan of MMOs and/or Tolkien's creations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very underrated MMO.\nCan be a bit overwhelming at the start, but once you learn it, so worth it,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only game where you can explore Middle-earth as a troll-kicking hobbit or a thunder-zapping wannabe wizard, along with a whole cast of other fun races and roles! LOTRO enhances the world with stunning detail beyond the movies and brings the books’ imagination to life. Thank you for the magical experience!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played it WAAAAY back then. Its the most basic MMO and for modern standards really stiff - and there are some annoyances regarding ingame-advertising and popups. But i love it. I love this game so much. Its just an honest adventure, nothing new, really -but it has love in it. Love for the game, love for the fans, love for the world. If you like slow paced mmos where you have to look up stuff and search for the items, farm and read quest-describtions, this is for you. Old school.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game. It's not as busy as most MMOs but it's gaining interest again. \r\n\r\nThe graphics are great for it's age. The developers put a great deal of effort into trying to capture the flavour of the source inspiration material. It's close enough. At times it's even inspiring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastically well crafted world. Hands down the best way to explore middle earth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "RTX 3060, Ryzen 7, 206 down & 26 up.\r\nReally bad stuttering during uptime and downtime.\r\n\r\nStill love the game, though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic old MMO.  \r\n+ classes are unique \r\n+ world is vast \r\n+ LOTR accurate story... \r\n+ new 64bit servers helped with server performance\r\n\r\n- UI is dated especially in 4k\r\n- not much voice acting, which I kind of understand but I wish there would be more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most relaxing and cozy MMOs on the market. The journey through the Middle Earth is the core of the game and you can easily sink hundred of hours immersing yourself into the world of JRR Tolkien. Must play for the fans of the genre and the books.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hours of fun for any fan of Lord Of The Rings even if exploring solo there is plenty of fun to be had.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "outstanding storyline, great quests.  Especially after Mordor, it just gets better and better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "played wow classic for years so i kind of got burnt out on it so i wanted to try something new this game i must say i like does have so lag issues at times but the story and the community is great first day i played i had strangers making me gear never seen that before not in wow anyways will keep playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid MMORPG.\r\nI played it originally back in 2010/2011 and hadn't played it again until this year.\r\nWorked flawlessly on Linux through WINE back then and works great through Proton now.\r\n\r\nWanted a good MMO to play and all the new games are terrible lol.\r\nWorth trying out for sure even if you aren't a big LOTR guy like myself.\r\n(Meaning im not big into LOTR in general)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a great game, though the leveling is a bit slow and the controls are clunky for a newer (wasn't around in the early 2000's) gamer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "*sigh* just no.\n\nHowever, I will concede the fact that if you're into this game and have friends within, sure, its okay.  You've really got to pick and choose what you're going to want and do.  So long as you're diligent about that, you'll have no problems.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such an amazing game, even without the MMO element, they've recreated Tolkiens middle earth perfectly just as it is in the books.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I usually like to make my reviews comical, but this game is done by people with a real passion for Tolkien's world and it is still a genuine pleasure to immerse myself in the different areas to this day. If you don't mind a game with dated (but very pleasing) graphics and despise what Amazon has done to our childhood, then give it a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very humble MMO. It sticks loyal to Tolkien's books and is a marvellous interpretation of Middle Earth. It does have an optional subscription, but those are quality of life features which are not required, hence it not being Pay 2 Win. If you are a fan of LOTR, you will enjoy this game. Graphics and mechanics are outdated, but it is worth playing if you like MMORPGs and/or Tolkien's lore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lord of The Rings Online boasts one of the most expansive (and accurate) depictions of Middle-Earth to-date. In spite of its age, LOTRO's gameplay and graphics are not lagging behind in any meaningful way and actually retain a \"magical\" feel that would be difficult to replicate. The hand-crafted nature of LOTRO is evident in every location you explore, and in every dialogue option you engage with. \n\nThe community is kind, helpful, and committed. As a new player, I found myself adopted into a \"kinship,\" LOTRO's version of a guild, within a week of beginning my quest in middle-earth. I found a community of players that adventure together, quest together, and enjoy fire-side chats together. \n\nFor Tolkien fans, this is a must-play. For MMO fans, this is as robust an experience as you'll get anywhere.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been stuck in the launcher menu. Never played the game once. Been stuck at 88% for dat files download. Shit wont work. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that I really want to dig into one day - a real labour of love from the developers, with a very living, breathing world. The UI needs serious work though - you do get used to it, but only after masses of frustration and searching for guides on how to make it yours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The notion of a truly free-to-play experience is largely illusory. While the game can be accessed without payment, its design architectures strategically encourage monetary engagement from players who wish to experience the full scope of its content.\n\nSeveral mechanics illustrate this approach. Quest distribution and travel systems are deliberately structured to introduce a sense of friction, subtly reinforcing the perceived value of premium currency options such as Mithril coins. These design choices extend the duration of basic gameplay tasks, effectively transforming convenience into a monetized feature.\n\nThis approach aligns with broader industry trends where player time is leveraged as a form of soft pressure toward microtransactions. The result is a hybrid model that merges accessibility with incentivized spending, balancing initial player freedom against carefully engineered limitations.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have come back to this game time and time again, each time because I wanted to see how other parts of the world relate to the books. It is very interesting to consider what other people were doing during the events of the War of the Ring. Fantastic approach to weaving the story around and through the Lord of the Rings books. The books and movies keep bringing me back to go find some other event that occurred in the background.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A beautifully realized MMORPG set in Middle-earth, with cozy towns and sweeping landscapes that let you truly lose yourself in Tolkien’s world. With deep character customization, crafting, and iconic locations from the Shire to Moria. It’s ideal for lore lovers and explorers alike. The steady stream of updates and a welcoming community keep the world alive and rich for longtime players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Incredibly F2P and new player friendly. Those who love the Tolkien universe will enjoy this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unleash the inner bear on a pack of enemies then shift back to man form to continue whatever  i was doing before the pack of enemies just interrupted? yep. my favorite pastime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Originally bought this back at a Circuit City (RIP) liquidation sale back in 2009. Played about 10 mins and hated it. Been in an MMO mood so decided to give it a try again since, hey, it's free now. Definitely shows its age, but I'm enjoying myself enough to have reached level 20 thus far. People in /World are quite nice and chill. Did have a problem with the world loading after the initial tutorial, but after going into the launcher settings and selecting repair, haven't had a problem since.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Motherfuckers on a magic quest\nFellows in the fellowship doing what they do best\n(What if for a while they rode a massive hawk?)\nI think I'd prefer if they walked",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An \"old school\" mmo but still beautiful in many areas.  It's worth a look for anyone who misses the old mmorpg feel",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, if you love Lord of the Rings and its lore, you will go crazy here with all the things you can do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOTRO is less an MMO and more a lovingly curated museum built over Tolkien's grave, if the exhibits were alive and occasionally needed you to kill ten wolves for them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a great mmorpg with a higher than usual difficulty This is the mmorpg for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was questing when 2 people on horseback rode up to me after i killed an orc, and proceeded to bust on my face with their music, a little during their show a dwarf came, got off his horse and clapped at me. then they finished and rode away.\n\nive been playing mmos since a child and i never could find the right one, LOTRO is the right one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you love the Lord of the Rings world/universe, you will love this.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its lord of the rings whats not to like its a little p2w though but otherwise quite fun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "follows the movie from a 3rd party perspective.  Interesting quests, very happy with purchase!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing LOTRO back in 2010 before it moved to steam. It will always be one of my favorites. I started playing it at the right time in my life, & I made many life long friends along the way. Some aren't around anymore, but it always brings a smile on my face seeing all the things they made for me in a past life so many many years ago. It's very nostalgic picking it up & playing it again :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have ryzen 5 3600 \n16gb DD4 3200MHZ\nRx 6600\nWindows i get 60-80fps\nNow on Linux i get 90-130fps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOTR open world! A classic!\nWhat more can you wish for?!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you enjoy a chill MMO with LOTR lore this game is made for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I  have been playing on and off since launch and keep coming back for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play this on the regular with the family, Absolutely enjoy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolute classic. my goat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "stop Tolkien and start playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun if you are into the movies or books.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the story. It really feels like you are in the movie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The greatest LotR game there will ever be.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For an older game it is still fun to play.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Just a nice game for lotr fans",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best Lotr world i've seen in a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good Lord of the Rings game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yes it's old, but it has charm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just ....SO FUN IT IS LIKE GW2 BUT BETTER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MMO with the best community 🥹",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i really like this classic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely still one of the best",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game for LotR fans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nostalgic old school MMO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is fairly true to the lore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its free and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great old way MMORPG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're a fan of the lore, this is a must play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Old but awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fried my motherboard would not reccomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best mmo ever f***ng made",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[i]Elen síla lúmenn’ omentielvo.[/i]",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "I've been trying to play this Load it boot it Nothing works Client Doesn't Work I Haven't even Gotten into the Game from the launcher\n\nI remembered this from my WoW Day Z and Youtube algorithm recommending videos on it however Can't experience it again\n\nAnd Yes All that time spent isn't playtime or Gametime it was time spent trying to Get this Thing Fantastic four Cool running",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Couldn't get the game to install properly; installed once, then started up again telling me I I had a corrupted dat file, game simply wasn't installed. Thought I hadn't created account, yet it seems I have, but with no username saved. Tried to reset, but no emails received. I give up, I'm sticking with LotR:RtM.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried to play on CachyOS with proton and I did the first part of the tutorial but after that it just freezes and crashes every time I try to load on the loading screen. I have a super computer so this thing just doesn't work, at least not on my setup. Tried proton cachyos steam linux runtime and the 10 slr one, same result. Uninstalled.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "cannot even sign into game just keeps saying no account found yet i have an account uninstalled and never installing again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is still plagued by issues with the initial download. I have tried every fix on the forums, followed Hurin's guide to the letter, tried both Steam and standalone launchers, nothing works.\r\n\r\nThis game will die if no new players can download it. Do better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Since game came out i played it. each year come check out again c the changes. Without warning they wipe all my chars off database never recieved email that they taken servers offline and no merge anouncement. THis most dissapointment i ever recieved about this company. Not even given flying F about there loyal players . Just instant erase and intant house  items events items everything gone. F U",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Standing Stone Games, Uz duzno postovanje launcher vam nije ni za kurac i jebem vam majku retardiranu u picku. A ti Stojane napusis mi se kurca picka ti materina retardirana. Jebem mater i tebi i ovoj igrici",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "~200 hours and they deleted the server and my characters. stay away from this game, your characters are not safe.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could create a character, do the tutorial but it freezes in the loading screen after. It seems to be a common issue and that the game works better on older pc's and networks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I started playing in beta. I have since played off and on over the years. I recently logged in and all my characters where gone I was told basically, bye the creators, that they are on old servers and they are basically gone now. That is some bullshit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's just a cash grab now, preying on its few remaining loyal fans who still remember it as the cozy, magical world that was once a joy to be part of.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's very much an mmo and one that suffers from aged servers that cause issues with performance for you and also utilizes a dated engine with a dated version of dxvk, running on dxvk 9 & 10. It ran fine enough for me, but when it has issues hitting 45 fps at low you know somethings up.\n\nMaybe that already put me in for an iffy feeling for what the rest of the game was going to be, so when It starts out with a bunch of character models sliding around with text boxes and occasional full voice acting I was just done, especially when the actual gameplay wasn't doing anything I hadn't seen before.\n\nAlthough part of the time I started trying to re-envision moments of the story but if they were trying to be presented as a filmmaker would. Maybe that moment where I just suddenly get told \"ok your really lazy, fight me cause our blood is awesome\" and it's just meant to introduce combat. If I thought about how that could have been missing presentation of a wide-shot of the village to show the idyllic nature and that previous cow fetch quest as a slow introduction to the abilities of a child of beorn, and instead of getting a quest marker, what if it was an angry shout calling us and it was a close up fatherly lecture about how he feels of the way we've grown up. Suddenly I can see it as something that could be amazing, but I really can't tell if I'm feeding into the game to try to make it good for it, or if that was part of the intention. \n\nI'm not too keen on it, I might poke in a little more to get a more rounded opinion, but between how awkward it is right now and how weird the launcher setup was with the very very VERY obnoxious ads for in game purchases. I'm not really keen to recommend this.\n\nedit: yeah, so it was cool to find out the monster mode pvp existed. I really do think that's a cool idea that would work better if it was significantly more rounded out. Instead it hurts itself on the pains on traditional mmo's where you're given 20 fetch quests to orient yourself with pages of uninformative dialogue before you're sent out to do the pvp in a massive area that's completely devoid of anything at all. Which speaks to the combat a lot in this game. Plus there wasn't really any customization for monster characters and after poking at the main quest a bit more I was thoroughly done when upon following aragorn I was given a ton more writing to justify how I really should do side quests and they're really important because if you REALLY are a follower of aragorn you'd do good wherever you'd go! \n\nAs tone deaf as that was to read when it could've just left it at \"valuable experience for your journey!\" Trying out a few starter quests just really kept me disdaining the combat, it doesn't feel good and there's almost not a reason to do it. A spider infested forest did a total of 16 points of damage out of my thousands of point of health running through and back getting every spider to follow me before I stopped and killed one and went away after that took a ridiculously long time to deal enough damage to that spider. Further travel quests that give you a feel for how vast and empty the world is with nothing to engage you besides more bubble text balloon dialogue and fetch quests or kill x amount of monsters or go here there etc... I'm just not really down to see what lies beyond. It has negative presentation, questionable compatibility, slowed down and further mind numbing combat than the average traditional mmo with systems that are designed around a large quantity of intertwining abilities that have tons of different tiny traits to them that don't really matter and would only matter in higher game content or situations further eradicating the barrier to entry. Maybe there's a good story as people say but I'm just going to cut my losses here honestly. i'd only really care enough to bother if I was being paid to or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't log in. It keeps saying an update error occurred.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can ´t look at the screen without hurting my eyes. UI is just to old...i would try but this is too much for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is okay, but the people surrounding it are creepy. No one wants to play this game anymore, so they pay people to stream it, and they're bullying them while on stream, it actually made me sick witnessing that. I regret ever purchasing anything in this videogame and I won't be returning.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even sign up to play the game without error messages when trying to create an account. Do Not Recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its been updating for three hours, have not even gotten to play yet.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Free To Play this is not free to play, downloaded on steam  go to log in to game and get Error NO SUPSCRIPTON  Notice and can't log in to game this is not free to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "a free to play game that wont launch as there is no subscription found..... absolute waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its fucking trash locks up the pc and runs like dog water dont waste your time i spent this much time downloading it with gig speed just for it to lock and and not work dont waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, it's absolutely ridiculous that I have to open your launcher at all and put in a password every single time. Negative review until this is changed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Main problem: Could successfully play the tutorial. But after going through the portal after the tutorial, the \"Loading\" screen stays forever although the bottom bar is full. Re-log didn't help. Create a second char didn't help (actually, same problem here). Switch between the chars didn't help. Wait for a day and try again didn't help. Have no more ideas even after googling didn't help.\n\nMinor problem: Game is not updated for 4k yet. Some elements can not be scaled up (like the bags), and the windows which are scaled up look pretty bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't create an account, password not accepted. Tried multiple browsers and multiple different passwords, from basic to complex ones using password manager, nothing works.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "well i would leave a review but steam garbage won't install so i am installing from lord home page don't install this game from steam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this is one of the greediest pay to play games ever, wait for the amazon one instead",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "world of warcraft temu edition",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not free. just fake ride to 30 then oh boi u gotta buy stuff",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The third party launcher is gay",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Fix 1440p/4k UI scaling please",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Launcher won't download patch even when I use VPN",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lol, just go play runescape",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't even get it to work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DONT PLAY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ITS TO DIFFICULT\nAND DUMP \nin ALL HANDLINGS,\n\nalso for ingame shop ;P ♥\n\n~ * ~\n\nTHEY WONDER; why they make LOW money,\nbecause THEE WAY TO IT;\nis to difficult\nand NEED to be:\nEASY, QUick and safe, too!!! ;o} ♥",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fdssss",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whichever parasitic company is currently, temporarily owning this IP recently did an infrastructure rework, condensing the available servers per region.\n\nWhat this means:\n- If you recently returned and have paid money (even if its thousands of EU/NA moneys) for any features on your account, they're gone until they figure out their transfer system.  No ETA.\n- No emails were sent, so FU if you didn't log in into the account in August 2025, even though you created it in 2009.\n- If you want more information, check lotro.com.  If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com.",
      "voted_up": false,
      "votes_helpful": 166
    },
    {
      "review": "After being offline for quite a while, I logged back into my account and discovered that everything is gone. My entire game progress, all my items, and characters have been wiped.\n\nI received no notification or email warning me about this. This is especially upsetting as I have invested thousands of hours of my time and a significant amount of money into this account over the years.\n\nFU all of you who are involved in this shit!",
      "voted_up": false,
      "votes_helpful": 78
    },
    {
      "review": "I have a lifetime sub so I come back from time to time, and have had lots of fun here! it used to be a fantastic game, yes there's a fair bit of fun to be had even if your free but the company that currently has it, seems to be trying to get whatever they can out of it, they're adding content so at first your thinking they're still working on it but than you run into other things that has you going, are you serious? They removed rewards for doing certain tasks / deeds without actually updating the reward. So you deal with daily limitations trying to use skills that you wouldn't normally use to get class traits only to finish up and get absolutly nothing. now for a free to play game you do have some nice options to earn lotro points from playing the game, they give out regular freebies to get you thinking about buying more and has a decent story. They've made changes to the game without actually changing the text or fixing things from things they did over 3 years ago! you can't trust rewards....",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "These morons just stranded all my characters by turning the 32bit servers off without even sending out an email about this.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "So the new company just eliminated most of the servers, no option to retrieve my characters. Played off and on since 2007... wtf.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "I have over 10 years in this game bought prob 1000 dollars worth of crap from this company and this game is a joke.  My characters are gone!  And it does NOT look like they will be accessible in the near future if ever.  I had premium housing and spent hours on them.  This is BS.  And  I am not the only one who thinks this way.  If you really wanted to get the message out to transfer  your characters you should have had it in BOLD RED LETTERS on the site as soon as you opened it up over the last month or so.. Im not the only one blindsided by this.  PURE D BS.  Ill be cancelling my subscription with this company immediately this game was actually not that fun.  I really loved my house and all the crap I bought.  I guess i need to rethink buy anything virtual from now on..  This is a reality.  Bye Bye and I am sure I am not the only one getting rid of the subscription.. I hope this game collapses!!!! UGH",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "They just wiped  characters with no proper warning. This is not something I abide by.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Returning to this game after a while can't even log in , customer support is a joke .if i wasnt free i would want my money back",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I really hate to write a negative review for this. This game is great, its a ton of fun to play and I love it. I've been playing it since before I even knew how to play video games, and it's the entire reason I have a email account. But I just learned they removed the old 32-bit worlds without any steam news post or anything, just one thing on their website which I don't read. I have just lost a decades worth of work, my house I spent hours on and the house me and my dad spent many hours on. This is idiotic and I am so mad at Standing Stone Games. This is not how you treat the players that have played the game before you even owned it. I regret giving this company my money. Don't play this game if you think you'll be playing this for a long time. I want this company to see how mad we are at this, if you read this and this has happened to you, please post a review about it. It pains me to see this to the game I quite literally grew up playing.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Like many older games. Theyre not the original owners and dont have the original stuff from the game. They use these to farm information on americans through nostalgia. Steam just rolled over and sai we dont care what you guys do. At least they didnt try to rename it. Steam is allowing AI to strip old games down and be called something new. Stay safe out there.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Never got to play the game. The patching never finishes, the launcher crashes after freezing for several minutes.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I've been trying to play this Load it boot it Nothing works Client Doesn't Work I Haven't even Gotten into the Game from the launcher\n\nI remembered this from my WoW Day Z and Youtube algorithm recommending videos on it however Can't experience it again\n\nAnd Yes All that time spent isn't playtime or Gametime it was time spent trying to Get this Thing Fantastic four Cool running",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Been playing the game off-STEAM for 11 years. Moved to steam, played 60 hours, and took a break. | With their new \"EXPLOREOURWORLD\" promo and new 64 bit server upgrade, I came running back to hop on my character and explore my favorite fictional universe ever created... or so I'd hoped.\n\nSSG did not inform us of a merge via email or offer any sort of communication about a character transfer, and deleted our old progress with the creation of the new server(s).\n\nMy character of 11 years - gone. My anniversary rewards - gone. My limited time titles, mounts, etc. like when we were raising money for sick kids via Extra Life - gone. All of it. It took me straight to character creation upon launch.\n\nUninstalling. Maybe AGS - if the project didn't get axed as suspected - will make their upcoming LOTR MMO with some more consideration for the players. God knows SSG won't.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Hopping along with the others, 'did an infrastructure rework, condensing the available servers per region.\nWhat this means:\n- If you recently returned and have paid money (even if its thousands of EU/NA moneys) for any features on your account, they're gone until they figure out their transfer system. No ETA.\n- No emails were sent, so FU if you didn't log in into the account in August 2025, even though you created it in 2009.'\n\nI was a fairly new player, didn't log in at all for the month of August unfortunately (work and moving house) and now my character and everything I've invested are gone until they HOPEFULLY fix this shithole.\nIt's like everything I've done until that point, all the characters and places I've come to love just doesn't fucking matter now. I can't bring myself to create a new character and go through all that again without the same wonder of the world I had before.\nAbsolutely despicable. Fix your shit.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Standing Stone Games has no respect for its players and their characters when they simply delete them all. Bottomless",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Put in countless hours when this first came out. Had a lot of high level characters. They passed this game to various people....the current one? Deleted all my characters. I have nothing. The time (god knows how long), the items I paid for (a lot), etc.... Nothing. Absolutely nothing. This is called fraud folks. Don't support this POS. Game is dead.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "All of my stuff is gone :) , terrible way to do a server merge. I also did not get emailed, this also happened to other people, GG. -180$",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "From the very first days of the game, 3 problems have not been solved.\r\n1. Night. Yes, exactly night. Turn off the night on the server. You can't see a damn thing. Every time you have to turn the monitor to maximum. Curtain the room with thick curtains.\r\nNight effects even in caves with their own lighting system. Make the game brighter!\r\n2. Running speed. A huge seamless world where you run 99% of the time. Racial and class bonuses do not stack with bonuses from items. To hell with horses, get on, get off, get on, get off...\r\n3. Crafting. Poor. Recipes do not stack, are missing in some levels. To hell with recipes for reputation from level 70.\r\nWith the current cap, it is not relevant and the character needs to be dressed to be able to level up. When you level up your reputation, you will no longer need these recipes and items. and considering that they are disposable... it's complete nonsense to get so worked up over a disposable recipe.\r\nIs it difficult to add bonuses to critical crafting items? the same running speed or resistance. diversify the bonuses.\r\n\r\nconduct a survey on these 3 problems! I'm sure that adequate players will fully support me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The fact they didn't even do a Steam announcement warning people their characters would be wiped if they didn't transfer before the 31st of August and just kept posting patch notes like nothing was happening is criminal, this was becoming one of my favorite MMOs but because I wasn't constantly logging in I get all my characters nuked for the foreseeable future until 32bit transfers come back and hopefully don't have corruptions on the transfer?\r\n\r\nRidiculous.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "This game is literally unplayable rn. Its always been a running gag with the LOTRO community that lag is a part of the game. But dear lord, this is a little bit too much because now im also having to deal with constant crashes resulting from said lag spikes. Everyone still upvoting it for the nostalgia bit arent doing the game any favors.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've officially attempted to play this game 2 times now. Both times have been nothing but a lag fest. Such a shame",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "All 3 hours logged in Steam for this game have been waiting for the launcher to fix itself, only to discover that the game won't even let me log in. My review may change if support bothers responding to my ticket to get a password reset (since I apparently also played DnD Online some time ago, even though I can't remember it that well)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Omg we're in 2025, fix the UI for the high resolutions, I litterally cannot play the game in 2K as the texts are way toooo small and cannot read it",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Was a good game when I played years back. But, with all the changing of hands, my characters are no longer available.  If you're a new player, sure, play. But, risk losing your characters. Returning players, stay away",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing this game for a dozen years, it is easily my favorite MMO and unfortunately it is virtually unplayable now. Hopefully this is a growing pain of the new servers but with so few servers compared to before, the lag is ridiculous and I could never recommend anyone play this game in its current state.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great lore, great universe but huge lags, huge rubberbandings = unenjoyable... I hate to say it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i9 cpu + Radeon 9070 16GB + 32GB RAM w/ 1G/1G fiber internet connection\r\n\r\nEver since patch Update 45.0 and the four subsequent hotfix patches since the game has had a horrible gameplay experience. \r\n\r\nThe game is downright crashing to desktop due to unstable connections, and/or freezing you in place every literal third step due to tick rates coming out of sync between the client and server. You are going to die to a lot of monsters you cannot adapt to because of these issues. Until things are improved on a technical side back-end I cannot recommend this game to anyone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Couldn't get the game to install properly; installed once, then started up again telling me I I had a corrupted dat file, game simply wasn't installed. Thought I hadn't created account, yet it seems I have, but with no username saved. Tried to reset, but no emails received. I give up, I'm sticking with LotR:RtM.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Server lag makes it unplayable at times - worth a try if you have friends playing with you though. Would be like a B+ game if they fixed the lag",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I honestly wish i could play this. But I forgot the password and they don't send reset mails anymore.  There's also the problem of downloading the game itself, constantly stuck at certain moments, having to delete certain DLL files so that it can repair again. \r\n\r\nIt's always such a mess to get the game working. Perhaps if they update their launcher or fix the password system I'll give it another try. But for now one should definitly avoid the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Really sad how many technical hurdles it was to get this running in 2025. I ended up giving up and just uninstalling after a few hours of reading up on typical issues and several attempts to circumvent DirectX errors that updates did not fix.\nI'm sure it's a fun game but I ran out of patience figuring out how to play it.\n\nThis is absolutely an issue and I cannot recommend this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game is still plagued by issues with the initial download. I have tried every fix on the forums, followed Hurin's guide to the letter, tried both Steam and standalone launchers, nothing works.\r\n\r\nThis game will die if no new players can download it. Do better.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Since game came out i played it. each year come check out again c the changes. Without warning they wipe all my chars off database never recieved email that they taken servers offline and no merge anouncement. THis most dissapointment i ever recieved about this company. Not even given flying F about there loyal players . Just instant erase and intant house  items events items everything gone. F U",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Standing Stone Games, Uz duzno postovanje launcher vam nije ni za kurac i jebem vam majku retardiranu u picku. A ti Stojane napusis mi se kurca picka ti materina retardirana. Jebem mater i tebi i ovoj igrici",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "~200 hours and they deleted the server and my characters. stay away from this game, your characters are not safe.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I could create a character, do the tutorial but it freezes in the loading screen after. It seems to be a common issue and that the game works better on older pc's and networks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I started playing in beta. I have since played off and on over the years. I recently logged in and all my characters where gone I was told basically, bye the creators, that they are on old servers and they are basically gone now. That is some bullshit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's just a cash grab now, preying on its few remaining loyal fans who still remember it as the cozy, magical world that was once a joy to be part of.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's very much an mmo and one that suffers from aged servers that cause issues with performance for you and also utilizes a dated engine with a dated version of dxvk, running on dxvk 9 & 10. It ran fine enough for me, but when it has issues hitting 45 fps at low you know somethings up.\n\nMaybe that already put me in for an iffy feeling for what the rest of the game was going to be, so when It starts out with a bunch of character models sliding around with text boxes and occasional full voice acting I was just done, especially when the actual gameplay wasn't doing anything I hadn't seen before.\n\nAlthough part of the time I started trying to re-envision moments of the story but if they were trying to be presented as a filmmaker would. Maybe that moment where I just suddenly get told \"ok your really lazy, fight me cause our blood is awesome\" and it's just meant to introduce combat. If I thought about how that could have been missing presentation of a wide-shot of the village to show the idyllic nature and that previous cow fetch quest as a slow introduction to the abilities of a child of beorn, and instead of getting a quest marker, what if it was an angry shout calling us and it was a close up fatherly lecture about how he feels of the way we've grown up. Suddenly I can see it as something that could be amazing, but I really can't tell if I'm feeding into the game to try to make it good for it, or if that was part of the intention. \n\nI'm not too keen on it, I might poke in a little more to get a more rounded opinion, but between how awkward it is right now and how weird the launcher setup was with the very very VERY obnoxious ads for in game purchases. I'm not really keen to recommend this.\n\nedit: yeah, so it was cool to find out the monster mode pvp existed. I really do think that's a cool idea that would work better if it was significantly more rounded out. Instead it hurts itself on the pains on traditional mmo's where you're given 20 fetch quests to orient yourself with pages of uninformative dialogue before you're sent out to do the pvp in a massive area that's completely devoid of anything at all. Which speaks to the combat a lot in this game. Plus there wasn't really any customization for monster characters and after poking at the main quest a bit more I was thoroughly done when upon following aragorn I was given a ton more writing to justify how I really should do side quests and they're really important because if you REALLY are a follower of aragorn you'd do good wherever you'd go! \n\nAs tone deaf as that was to read when it could've just left it at \"valuable experience for your journey!\" Trying out a few starter quests just really kept me disdaining the combat, it doesn't feel good and there's almost not a reason to do it. A spider infested forest did a total of 16 points of damage out of my thousands of point of health running through and back getting every spider to follow me before I stopped and killed one and went away after that took a ridiculously long time to deal enough damage to that spider. Further travel quests that give you a feel for how vast and empty the world is with nothing to engage you besides more bubble text balloon dialogue and fetch quests or kill x amount of monsters or go here there etc... I'm just not really down to see what lies beyond. It has negative presentation, questionable compatibility, slowed down and further mind numbing combat than the average traditional mmo with systems that are designed around a large quantity of intertwining abilities that have tons of different tiny traits to them that don't really matter and would only matter in higher game content or situations further eradicating the barrier to entry. Maybe there's a good story as people say but I'm just going to cut my losses here honestly. i'd only really care enough to bother if I was being paid to or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't log in. It keeps saying an update error occurred.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can ´t look at the screen without hurting my eyes. UI is just to old...i would try but this is too much for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It says 8.6 hrs on record, that's 8.6 hrs i've been trying to install the game. I'm at file 26302 out of 36135.\nJust. No.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "LOTRO known to be lore accurate. \n\nIncluded They/Them Orcs \nmade the character customization gender nonsense mixed with visual lore breaking. \nThis time after a couple of years i wanted to give it a chance. \n\nBut i will not tolerate this when the community and devs always promoted this game being lore heavy and be as accurate as possible. \n\nIm gonna check out echoes of angmar server.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The game is okay, but the people surrounding it are creepy. No one wants to play this game anymore, so they pay people to stream it, and they're bullying them while on stream, it actually made me sick witnessing that. I regret ever purchasing anything in this videogame and I won't be returning.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't even sign up to play the game without error messages when trying to create an account. Do Not Recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its been updating for three hours, have not even gotten to play yet.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Free To Play this is not free to play, downloaded on steam  go to log in to game and get Error NO SUPSCRIPTON  Notice and can't log in to game this is not free to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its fucking trash locks up the pc and runs like dog water dont waste your time i spent this much time downloading it with gig speed just for it to lock and and not work dont waste your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, it's absolutely ridiculous that I have to open your launcher at all and put in a password every single time. Negative review until this is changed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Main problem: Could successfully play the tutorial. But after going through the portal after the tutorial, the \"Loading\" screen stays forever although the bottom bar is full. Re-log didn't help. Create a second char didn't help (actually, same problem here). Switch between the chars didn't help. Wait for a day and try again didn't help. Have no more ideas even after googling didn't help.\n\nMinor problem: Game is not updated for 4k yet. Some elements can not be scaled up (like the bags), and the windows which are scaled up look pretty bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can't create an account, password not accepted. Tried multiple browsers and multiple different passwords, from basic to complex ones using password manager, nothing works.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "well i would leave a review but steam garbage won't install so i am installing from lord home page don't install this game from steam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The third party launcher is gay",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Launcher won't download patch even when I use VPN",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "lol, just go play runescape",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game wont start.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Can't even get it to work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DONT PLAY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "peak",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "garbage.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ITS TO DIFFICULT\nAND DUMP \nin ALL HANDLINGS,\n\nalso for ingame shop ;P ♥\n\n~ * ~\n\nTHEY WONDER; why they make LOW money,\nbecause THEE WAY TO IT;\nis to difficult\nand NEED to be:\nEASY, QUick and safe, too!!! ;o} ♥",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fdssss",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Whichever parasitic company is currently, temporarily owning this IP recently did an infrastructure rework, condensing the available servers per region.\n\nWhat this means:\n- If you recently returned and have paid money (even if its thousands of EU/NA moneys) for any features on your account, they're gone until they figure out their transfer system.  No ETA.\n- No emails were sent, so FU if you didn't log in into the account in August 2025, even though you created it in 2009.\n- If you want more information, check lotro.com.  If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com. If it fails to load, F5 lotro.com.  If it still fails to load, F5 lotro.com.",
      "voted_up": false,
      "votes_helpful": 166
    },
    {
      "review": "After being offline for quite a while, I logged back into my account and discovered that everything is gone. My entire game progress, all my items, and characters have been wiped.\n\nI received no notification or email warning me about this. This is especially upsetting as I have invested thousands of hours of my time and a significant amount of money into this account over the years.\n\nFU all of you who are involved in this shit!",
      "voted_up": false,
      "votes_helpful": 78
    }
  ]
}