{
  "positive": [
    {
      "review": "I've just begun settling a quaint little village in a meadow. I receive a spam package that arrived at my doorstop, inside of which was a goblin strapped with dynamite that immediately blew myself and my companions up. I'm about to lose hope, my cursor approaches the ominous \"Self Harm\" skill. I instead use my new feat point to learn to talk to animals, after which a Fox tells me \"You will eventually be rewarded as long as you continue to live!\" and suddenly everything is okay. Except it's not; a rogue wizard is attacking my humble meadow village right as my latest tax bill arrives. I throw my panties at it to inflict 2d8+3 Mind damage and they return to me because they're also a boomerang, and my strapped gunner companions use their guns to \"transform them into several pieces of meat\". Then I play a victory fanfare, also using my panties, because they're also considered an instrument.",
      "voted_up": true,
      "votes_helpful": 52
    },
    {
      "review": "You could read the entire wiki behind this game and its predecessor, Elona, and still not have a clear idea of what it’s actually about. You could watch reviews from people like SsethTzeentach and be completely befuddled by the sheer absurdity of the variety of content available to you as a player. You could even read every Steam review for this game, and you'd probably draw the same conclusion as I did before actually giving it a try: [b]Elin is a game that no amount of explanation can do justice - you just have to play it.[/b] That being said, [strike]I'm built different, so my review will definitely be the reason you choose to buy Elin![/strike] here's my best attempt at describing this gem...\n\n[h1]Elin is not [i]just[/i] a Sandbox, Roguelite JRPG:\n[u]it’s a mirror to your soul[/u].[/h1]\n\nIf you’ve seen other reviews and become discouraged by the levels of depravity you can engage in, know that the game is [i]only as weird as you are.[/i] You don’t HAVE to engage in slavery, prostitution, drug trade, cannibalism, etc. If you just want to be a wholesome turnip farmer with a cozy ranch full of chickens, ducks, cows, sheep, and goats, go for it. Alternatively, you could grow crops to turn into drugs and alcohol, and have monstergirls and humans as livestock [spoiler](slaves)[/spoiler], instead. If you want to be an alcoholic dwarf that beats the crap out of people with hammers, worship the god of weightlifting and mining, and carry around an entire piano for both entertaining and killing people, GO FOR IT! Want to be a wizard that pulls out a shotgun when you run out of mana? You get the picture - go for it - you can do whatever the heck you want.\n\n[h2]Elin is special because it commits itself to prioritizing player fun and freedom. Your playthrough will never be exactly like any other, and that’s what’s so beautiful about it.[/h2]\n\n[b]Closing thoughts:[/b] the game is constantly being updated by a developer who candidly loves what he does. There's passion oozing out of every aspect of this game, and you’d be doing yourself a disservice if you didn't at least give the free demo a shot. The only drawback of the demo is that your character has a level cap of 10 or so. Besides that, you virtually have access to the entirety of the game.\n\nThank you, Shuridood, for gifting me this amazing masterpiece of a game. If this is how addicting it is in early access, I can’t wait to see how amazing the finished product will be! Countless combinations of races, classes, builds, etc. and a fun story and lore-rich world to enjoy! This game truly is a gift that keeps on giving.\n\n[h3]BONUS TIPS[/h3]\n[spoiler]If you do decide to try/buy Elin, experiment! Your first hour should be spent goofing around with 2 or 3 characters with different builds so you can get a feel for the game. I started out as several kinds of humans: Juere, Yerles, etc. and tried being a thief, gunner, and farmer. I quickly learned that race and class are mostly for roleplay flavor and early game bonuses. There are things that make races and classes unique, yes, but you're never locked out of achieving what most of them can by middle-to-late game.\n\nSo, if you're looking at all the possibilities and suffering from anxiety or indecision, JUST PICK SOMETHING. Pick what sounds cool to you and you will have fun and figure it out as you go. You've also got a 90-day buffer of no penalties from dying, so use and abuse that to fuck around and see just how much trouble you can get into.\n\nWhat race and class did I ultimately pick? Elean Priest. Why? Because elves are cool and holy magic is cool. No regrets and I've enjoyed over 100 hours with that character. \n\nTL:DR\nALL BUILDS ARE VIABLE, SO PLAY AS WHATEVER YOU WANT.[/spoiler]",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "親愛なるアメリカの皆さん.\nELIN はきっと皆さんが楽しめるユニークな体験です。\n\n買ってください。",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Bought this game under the pretense of going on wacky and grand adventures, but along the way I shifted my efforts into creating a farming empire and a moderately profitable slavery side hustle. Once those were established, I started to act like a teenage girl and went down the wonderful path of vomitmaxxing (bulimia) to raise my stats. Great game.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Now that I have 50 hours, and I'm out of the early game, I can say Elin is pretty good.\n\nIf you're one of those psychopaths that like Elona, you'll enjoy Elin. Feels like a fun little nostalgia trip somtimes, even.\n\nWhile it's true that it's difficult to get used to the new control scheme at first, at least moving over from Elona, it's pretty good and you can accomodate faster than you'd think. It's the main thing that stopped me from playing this game early on, and on retrospective, I feel rather silly about it.\n\nIn it's current state, it has a surprising amount of content, and the updates are fairly frequent. Even so early in development, you can expect to put in 50 or so hours in it.\n\n[h3] How is it compared to Elona? [/h3]\nCompared to Elona, from my perspective, combat isn't as great. Feels to me at least that it's a lot harder to play a melee character specifically. It's way less focused on combat and *pets* overall.\nOn the other sides, some things are a mixed bag, i.e. Some parts of farming are managed more nicely (you can do automation pretty handidly due to the new base system), but others feel better on Elona (the way farming and fertility works feels a bit odd at tims)\nI think this has potential to even surpass Elona given time, but that's a Lot of time we're talking about.\n\nOverall, niche, but if you're in said niche, buy this now.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Verdict: \r\n   This game while not yet finished is already in a more complete state than many final products. It is playable but a bit empty outside of the core gameplay loop at this time. Probably worth somewhere between 10 and 18 Euros (or up to $20 Dollars US) now or so.\r\n\r\nSummary:\r\n    In this game you play a customized character with a class, race, and starting age grouping. What this means is what starting skills you have and how quickly they grow. Nothing is locked away except very specific race and class feats. You mostly level stats and skills by using them and eating foods that boost their growth. Training is required to start learning many of them and afterward can boost the speed of growth but that does get used as a resource.\r\n     The plot is still in process and the final point is unclear but so far has a little bit of ancient mystery and political machinations.\r\n\r\nPros:\r\n + Most features work and there are few bugs. Also has regular updates\r\n + Good mix of farming, combat, and exploration that don't punish you for neglecting the one you hate\r\n + A large cast of recruitable characters, both unique and randomly generated\r\n + Diverse skill sets and equipment to let you make your characters your way\r\n + Seems very mod community friendly\r\n + Turn-based but in a slightly different way than most so it almost feels like it isn't\r\n\r\nNeutral:\r\n * Customizable rules so you can go for perma-death, punishing, or easy but somewhat limited options\r\n * You cannot skip over the early content and associated grind on later characters\r\n * Can visit other players locations via the \"moon gates\"\r\n\r\nCons:\r\n - Very time consuming due to grind if you aren't using the console commands\r\n - Several skills are very obscure as to how they function with hidden mechanics\r\n - A LOT of things are RNG reliant on finding, especially recipes for item construction\r\n - At this time, the only weapon or armor crafting is for wood and stone, also it is random in output\r\n - Many materials are too difficult to reliably obtain and severely limit crafting due to this\r\n\r\nConclusion:\r\n   This game is actually a lot of fun and sometimes addicting if you are into this style of play and combat but doesn't respect the players real world time very well. It can become a grind fest and many of the skills and recipes are VERY tedious to actually level past the initial 10-25 levels. An issue given some recipes require levels around 50-60 to fully unlock.\r\n    It looks like it will be a great game once they get the actual quests working and not just the main quest (which is not yet complete). They also need to speed up leveling and crafting times but it could be an amazing finished product if they do so.\r\n\r\nTLDR: Great potential, works acceptably, has a bit of a grind issue and RNG resource issue.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "I'm surprised I LOVE it game! I'll explain... I am normally attracted to relaxing single player, strategy, fantasy, rpg's and this game actually covers all this. I had a hard time adjusting to the weirdness of the types of creatures, names, tone/theme (both childish and mature content in the same game) and graphics BUT let me tell you - IF you can get past this stuff and give it a chance, It's Amazing! The depth of this game is incredible. If you like games that give you value for your money. This is one of them. Like to dungeon dive? You can do this 100%. Like to craft or farm? you can do this 100% if you like also. If something bothers you about the why things run then simply look into the 48 pages (at time of this writing) of mods. Only real downside is... there's a HUGE learning curve. There is so much to learn and do in this game. I am surprised! Had this on Wish list for months because I didn't know if this game was really for me. The game has active support pages and discord. Anyway, this is just my 2 cents worth of info regarding this game. I hope it helps! (FYI - 78 hours played at the time of this review and I haven't even scratched  to surface of this game!)",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game has so many cool features that make it stand on its own from Elona. It has the whimsy, edgy spirit of its predecessor and it doesn't take itself too seriously. When you die in this game, you type in your last words, and it's sent to the online server for other players to read in the newspaper. That's absolutely brilliant.\n\nAlso, if you wanted something a bit like the new Animal Crossing, it has some similarities there too. You explore the world to gather up materials for your base. Run shops and inns! To add onto the asynchronous multiplayer elements, you can also share what you've built through the online portal system and check out others' builds!\n\nWhat a game. It's so unique, and like many other Japanese games, it's not afraid to be unhinged.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a fun, complex, but rewarding game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The absolute unbridled freedom this game gives you to do basically anything is pretty incredible. There are a few things that aren't quite there yet, but usually there's some weird roundabout material alchemy way to deal with them - for example, you can't make gear out of metal bars, so to craft metal gear you can craft statues out of metal ingots, then disassemble them with a hammer to create logs made of whatever material you used, which can be used to craft \"wooden\" gear that's actually made of metal. The weird roundabout nature is kind of the charm I guess.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is incredible and has so many regular updates. It's fun to check every couple weeks and see how much has been added. The game loop is addicting and there is so much freedom and your adventure can really be anything you want it to be. Everything is so satisfying.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game feels like learning a lenguage from zero.\n\nYou understand nothing till like 10-20 hours of gameplay and in your next playtrhough you \"kinda\" know what you're doing.\n\n\nThe game its simple. Just do whatever you want to get money to pay taxes for your base and to keep some for yourself to buy stuff.\n\nYou can do this by fishing, farming, selling things (from burgers and furniture to people and vomit), making rental houses, setting up a brothel, going to dungeons and selling the loot you don't want... etc.\n\nMeanwhile its a very esoteric game i find it fun even if its hard to understand how it works. Specially the dungeon crawling reminds me of Pokemon Mystery Dungeon.\n\nThe only things i don't like about the game is that for example things like dungeon crawling its pretty useless compared to other ways of making money, not everything is equal so i am always at disadvantage in terms of paying taxes and i am always poor.\n\nMaybe i just don't feel like making a huge rice plantation with huge micromanagement to keep both the chinese farmers enslaved and happy and to keep track of the seasons so i don't lose crops to winter. \n\nI just wanna kill shit and get cool loot.\n\nNot only that but this game has too much weeaboo shit. While i am ok at being able to eat corpses and grow and selling grandpas to the black market, that the best thing to add to your base for tourism are panties and the game feels very anime.\n\n\nOverall good game, ver unhinged. I like it. \n\nYou can do a lot of things in it even if its tough to learn. If you play call of duty and fifa this game is beyond your scope of understanding and the graphics suck ass and have low fidelity sometimes but you can get used to them.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Yeah bro just go try rescue that puppy from the most evil cave of all time for 3 hours for me and I'll give you a beer cooler",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game let's you create bombs by putting eggs in microwaves. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Elin is a weird game. There is nothing like it, I can guarantee at least that much. Elin is essentially an open-world traditional roguelike / mystery dungeon game (not to be confused with modern roguelike/roguelite, permadeath is optional). The closest games mechanic-wise are Doors of Trithius, Pokemon Mystery Dungeon, Stoneshard, Shiren, Caves of Qud, or if you are old enough, UnReal World. If you are a long time traditional roguelike player, you'll understand what you're getting into: grid-bound turn-based tactical combat, all objects within the grid are interactable to some degree, classic floor-based levels for dungeon, procedurally generated dungeon, hunger system, etc. Default difficulty does NOT have permadeath, and I suggest to keep it disabled on your first playthrough.\n\nBeyond the surface however, Elin's roguelite-esque progression only applies to the dungeon crawling part of the game. For the rest of the game, Elin borrows a lot of progression system from survival-craft games instead. Gathering, building, crafting, and unlocking recipe will quickly become an integral part of your gameplay loop. For some combat builds, crafting is a necessity even (i.e: gunner's bullet is far cheaper to craft than buying, brewing is also by far the best way to make money). \n\nAt some point, the survival-craft progression will develop into basic colony simulation. You can recruit new party members, workers, and traders to your land. You can gain revenue from tourists by building an inn, or a restaurant, all comes with land value system that determines tourism attraction. The amount of gameplay mechanics in this game will always surprise you no matter your expectation. Just when you thought you've seen it all, more is coming. These mechanics are not completely superfluous either, as they complement the dungeon-crawling part of the game quite well.. for the most part.\n\nThis game might give you kenshi-like feeling, especially in the beginning. There is no handholding. The only guiding hand is the main story, but its implementation is extremely subtle. You'll get lost and overwhelmed by the sheer amount of poorly explained mechanics. If experimenting is the beauty of kenshi, you'll love Elin for that. My two-cents is don't be like me; trying to min-max my first run. This game is fun to min-max AFTER you learn enough, so save yourself a headache.\n\nIn summary, Elin is a complex yet wacky combination of traditional roguelike, survival-craft, and colony sim that will keep you coming back.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm not convinced this is not a time machine in disguise. Every time I sit down to play it I end up multiple hours in the future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A cargo ship full of autism meets a truckload of Japanese logic, with a dusting of horny. WILD game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Official \"more Elona\" game. Currently in EA but has the potential to be even more Elona than Elona ever was. I love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I made a big mistake buying this game i have shit to do and i cant stop playing, send help please =(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I GOT MODS FOR MASSSS WILLTHEKILLLING 10000\\10 just dont be werid with this game...... PLEZ!!! ;(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Elin is the most insane open world RPG with large freedom in exploration, progression and base building. Game is full of crazy events, funny stories and interactions, There is almost no wrong way to play this game, the world is your oyster and you can break it as much as you can or want to. With such often updates from the dev that barely sleeps you definitely can spend a lot of time having fun. Very much recommend.\n \nBonus points for fishing. 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game that can be played in many ways.\nThere is no right or wrong in Elin, only taxes, and if you\ndon't pay them, you are a dead man and suffering be upon ye.\n\nAll jokes aside though, the game is pretty complex and overwhelming,\nbut once you get past that initial learning curve, it is a very rewarding experience!\n\nAlso this game has some amazing modding support, I haven't gotten into modding it yet myself,\nbut I will definitely do so after \"finishing\" my first playthrough of the game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is just pure art, when it says it is an RPG where you are free to do whatever you want they mean it, I don't know how many times I have died by an OP bystander who did not like my music performance, or how I had to do some \"jobs\" near a tavern to earn enough to eat that day. \nAfter a few games, I discovered the greatest way to have an efficient city: \"slavery\". Now I have an automatized income and can just be gambling at the casino all day on a major city.\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried fishing and died to a whale than i tried doing the main quest for a bit but got 1 shot by the bosses, went back to fishing again and the whale got me again 10/10 best game i played this year ( also f*** you random grass that spawn sometimes and takes resources from my farms)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's kind of like jrpg kenshi. You'll need to use the wiki a lot to figure stuff out, but if you're willing to do that it's a great number go up game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, dev constantly pumps out updates (this man does not sleep) i highly reccommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I assure you that the snail BDSM dungeon is essential to the lore.\n\nThis game is updated extremely frequently, holds an amazing amount of depth and love, and scratches itches I didn't even know I had. I couldn't recommend this to someone who wants something to just pick up and run with, but if you're willing to give it a little time, and learn how it works, I think you'll find yourself getting sucked in to an amazingly immersive world.\n\nNow if you'll excuse me, I have taxes to pay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "watch as the \"x hrs on review time\" goes up exponentially because of how addictive this game is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The developer is as devoted as is humanly possible and then even more. Nightly updates and stable patches once a month. Loads of mods from a friendly and helpful community. That's all before we even talk about the game itself. You don't need to have played the era of games Elin and Elona are a love letter to, but it will help you in understanding how to play a bit better. You aren't forced to play any specific way to succeed and there are a lot of ways to succeed. \r\n\r\nI highly recommend reading everything the game offers to you understand it, and take it all to heart. There are also Red Books you can find in game which expand learning how to play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game that's constantly getting updated. Nice to see how far it's come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you feel like you've been feeling empty, and looking for something that has some real depth in it to fill you up, then this is sure to penetrate.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great game that is constantly having content added. Well worth picking up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Elin's one of those games you get back to every now and then, just like its predecessor. There's a good amount of goofing around, in various variations of amusement. A roguelike, not rogue-lite. Death and Taxes (inescapable). Even spreadsheeters enjoy minmaxing all the fun-juice out of the mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing \"Anime style\" fantasy sandbox rpg. you can either just playing around following instincts and exploring, Make your home an economic power using your management skills, Work toward building and designing you home maps and overdecorate them to perfection, become an overpowered \"isekai protagonist\" fueled by your phd level studies of the game systems or do wathever you want in between got loose all your money in the casino or train you eyes to inhuman reactions as you can in fact nail the slots rythm most of the times...\n\nthis game is as deep as the ocean... and the developers are sitting in the Callenger Deep still digging more depth in it...\n\nI tried to get into Elona in the past, after reading a lot of recomandations online, but wasn't able to, soon after booting the game I got lost, didn't know what to do and stopped playing... \nBut the feeling that I came in contact with something great and was simply not able to access it's potential getting filtered in the process stayed with me... \nI bought Elin on launch because of that, and I'm very happy I did, I played around for roughly 100hours and thought I understood the game, then out of curiosity I wached a couple of videos about it online and, oh boy, I discovered I knew nothing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game with great depth. Many systems to abuse both explicit and esoteric.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basically Elona+ but official. Though, if you already know what Elona+ is then you probably already know you'll like this game.\n\nAn openworld with rogue-like dungeons and optional perma-death(I would not recommend starting with that option). But also now with more fleshed out farm-sim elements and town management mechanics. Crafting also seems to be more useful overall this time around. All contained within an game that encourages irreverent nonsense(e.g. Both a chicken and a little girl are valid for ranching, will lay eggs, can be hatched, milked, slaughtered for meat, can both be promoted to do work as a regular town citizen(or demoted to livestock), sold into the slave trade, be subjected to gene-engineering, brought along as allied npcs, and be an age somewhere between zero and an unreasonably high number).\n\nUltimately, if you're unsure if you'd like this game I'd say try the demo and see. And if you some how grind that out to the limit and are still uncertain try Elona. And if you grind that out and are uncertain try Elona+. And if you grinded that out and still feel like you need a little more to try then just buy Elin already.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have to write a review for the steam awards, so here we go\n\n1.Start game\n2. Choose little girl\n3. ???\n4. UOHHHHHH 😭💢\n\nin all seriousness, thousands of hours of gameplay available to players and game is still in early access, this being a successor to elona, I can't wait for the additions, that and half the map still missing and still being a huge overworld",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Encountered Santa as an event boss in a dungeon. Threw a potion that made him lay an egg. Hatched the egg into a baby Santa and added it to my adventuring party. 10/10 No notes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Elin is a sandbox adventure game, feel free to play it as you'd like, as long as you're able to pay your taxes. Full of emergent gameplay and absurdity. I do reccomend reading up on tips and hidden mechanics, since it can save time spent on grinding stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 500hrs of Elin, can I recommend it as it is in Early Access?\n\nYes. Absolutely. Completely. \n\nNoa is outputting a feature each day on nightly. How he survives is a mystery for me.\n\nAnyway.  Buy it. Buy your parents one. Get your dog to buy one. I'm not asking. I'm telling.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game at its core is a turn-based roguelike dungeon crawler with a deep combat system with numerous stats, spells, and loot that allow you to define a character build just for you. There is a high degree of freedom in creating your own class & character and picking your own playstyle, You can be a frontline tank with a sword&shield, or you can hang back and sling spells & projectiles while your companions take the heat. You can even completely ignore the combat aspect of the game and play it like Stardew Valley/Minecraft by building up your own settlement and recruiting various NPC's to make your own more prosperous and generate revenue through their services. You can practically recruit any NPC to your party in the game, including even some enemy creatures, as long as you build up high enough affinity with them, and this in turn allows them to be useful either in your town, or in your combat party. The freedom of choice in this sandbox is, in my view, unparalleled and every action, every decision holds a tangible reward regardless if you are a pure combat enthusiast or a settlement-builder. With the creator providing regular updates with new content for the Stable version (near-constant if you decide to play the Nightly version, but potentially more buggy), there are potentially hundreds of hours of gameplay waiting for you here.\n\nMight be a bit overwhelming at first when you don't understand how many underlying systems there are and how they interact, especially if you're new to roguelikes, but I suggest taking it slow at the beginning and just explore the world at your leisure. The game's not a linear RPG and there is no in-game time limit. The tutorials and documentation in this game, while they exist, do not capture and explain the full scope of the systems of the game; I recommend checking out Ylvapedia for a more in-depth, community driven compendium for the game's systems.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not even out of EA and its absolutely A+.  Coming from Elona - it was fun to see the world come to life in a way I did not expect. Although, playing the previous game is not necessary to enjoy this ones charm. The world is detailed, charming, and packed with secrets. I am still finding new things.     \n\nThis game is open world, crafting, base building, RPG greatness.  It does not hold your hand and there is not a big arrow to tell you what to do next. It is up to you to explore and have some fun. \n\nYou can save the game whenever you want and learn the mechanics or go hardcore if that's your jam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gotta love the whacky ass shenanigans you get to stumble upon from time to time.\nI wonder if the full release would let you kill the final boss out of cirrhosis like in the first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love the game. It can get rather grindy at times though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "insanely good, lots of depth and a crazy amount of content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "extremely fun game and would recommend just horrible save system.ive lost hrs confusing my saves , backup saves override youre initial save",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a lovely turn based game that I highly recommend looking up guides for when it comes to bosses and item look ups to prevent frustration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "150 hours in i finally feel comfortable reviewing this amazing, fantastical, compleatly unhinged game.\r\n     this game has a steep learning curve and seemingly infinite possibilities for what is ultimately a game of problems and solutions, where every problem has atleast 3 to 4 ways to go about solving them, and for each way, theres probably an esoteric system for it too. its a lot its immense but it is engaging and i have never been without somthing to do, and somthing to suprise me while trying to do it.\r\n      i wont go into any specifics this game is somthing you discover , it is not very well documented, there are a lot of systems , just a lot of things everywhere. there is a tutorial to get you going but it takes the kiddy gloves of quickly. \r\n   + great combat and dungeon crawling, great grinding loops, great sense of adventure and discovery, and the art is fantastic\r\n    +/-  complex, the game will troll you at times, have to trial and error through some things, potential prohibitivly difficult or timeconsuming for some. the sense of humor and general vibe might be a little to weird for some, i personally like it [this game is seriously wild unhinged is not hyperbole]\r\n      -  there are some areas that are still very unbalanced late game , theres not a lot of incentive for certain systems beyond for the fun of it compared to others, will devour all of your spare time. \r\n    if you like sanbox rpgs , or have ever thought \"what if stardew valley had more combat focus and railed  a whole key of coke laced with some shit from mars we dont even know about yet\" you should play this game. if you have a busy life or dont wanna explain to your children why your cat exploded and the farmers are naked maybe your in the wrong place.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game with a large variety of possible playstyles. Sucks you into its grasp before you even know it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great RPG where you can pretty much do anything and has alot of content to do stuff in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's really good, there's a lot there, but good lord I wish everything was just a bit easier to do. Gunna give it another 20 hours because it's clear I've basically scratched the surface. Lafrontier should be incredibly proud.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was kinda hesitant at first if I should try the game. Now...I'm no longer sleeping. Loving the content so far and it's not even fully released yet. I have tried different builds and character paths and I keep discovering new stuff every playthrough. It can get rough early game, but once you get the flow and some gear, the encounters, dungeons, and shenanigans really opens up. Then you start to make a really cool base out of everything you get from your craft/harvest earnings or adventure loot. Either way. So FUN!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recommend with an asterisk.\n\nIt is quite an interesting game with a lot of systems that somehow work together. A rogue-like in mechanics aside from permadeath (unless you want that). The asterisk comes from the large amount of systems which can run pretty deep in complexity. Not nearly as bad as Dwarf Fortress, but hard to compare it to anything aside maybe a Caves of Qud type of game. Aside from that, the other major concern is the sheer randomness of the game, and plenty of strange situational events and humor.\n\nFor example, at the start of the game, one of the earliest quest rewards is a choice of a pet. A dog, cat, bear, or little sister. Being the unknowing person I was at the time, I was somewhat concerned. Wasn't till later when I discovered that all the \"Little Sister\" characters are part of a Certainly-Not-Bioshock side area and their events.\n\nAlso, you can play as a bard and if you're bad enough, the people around you can pelt you to death with stones.\n\nIf the game interests you at all, I'd highly recommend trying to find some casual gameplay footage. Wikis and forum posts will also be your friend while playing for a long while.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun, watch as this turning from 2 hours play time record into a hundred and then a thousand hours play time. \n\nP.S. Where is the goddamn discount for this game?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the most insane and ridiculous sandbox game I have ever played. From one minute you can go from fighting goblins and kobolds in the woods to fighting machinegunners and mechs (potentially with laser guns!) in clockwork industrial environments. Genuine batshit insanity and I am here for it. It is truly one of the only sandbox games (other than Kenshi) where you can do genuinely anything you can set your mind to, and the game even encourages this. Noa is a genius, easy 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very unhinged and very Japanese. Spent many hours trying to figure out how to build a house realizing that I can actually travel to individual plots on the world map for more materials and died to a bomber in the process. \nWent in a dungeon and half my gear burned away. \nThrew a potion at someone then they dropped milk.\nRealized that can capture little-.\n Memes aside, so much for such a low price. Lore is deep and game play is very punishing but rewarding. Definitely recommending Elin to a friend, $20 very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is amazing--especially for an early access game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First hour made a little grass base, some big daddy spawned cause i read a wrong book. Got instantly fucked could not return home - Spend my 90 days in another  village just to beat him. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is impossible to describe or convey why it's so genius and addicting. It's very Japanese in many weird and amazing ways. It's super cute but also has slave trading and succubi. It has dungeon crawling, base building, tons of random loot, farming, can insane amount of crafting, and there's always another funny moment around the corner.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My cat murdered a man tied down to some gallows.\r\nI died from overexerting myself (I was crafting a nail)\r\nGot 1 shot by a gnome in pup cave, 10/10",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I dont know how good is the thing called s3x, but Im 100% sure this game is better than s3x.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I caught a whale in my tiny lake once when I was leveling fishing for the first time and tried to walk with it in my pocket and immediately died. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's crazy how in depth this game is and the developer updates it monthly with tons of new content. If you don't mind the learning curve I would highly recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've been currently holding about 700 stones worth of sugar, or about 9800 lbs for people that enjoy Freedom Units, while I hang myself so my town gathers to beat me while two cat girls both beat and heal me while this is going on and then I sleep with a Little Girl when I get too tired of that, wake up, do it again while about 100 farmers fuel this.  I've also been eating the same cloned food for years now.  It's a carrot pizza.\n\nI don't like carrots.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's so fun but so deep I'm currently confuse which is good sign (wish more game like this come out)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I accidentally went bird watching with a 15 year-old and now Megyn Kelly and the FBI are pounding on my door for opposite reasons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I got mugged and then murdered by a group of angry ducks. Also my cat knows more about investing than I do. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was able to recruit a 16 years old human thief girl who carried dual daggers, had an hobby for drugs, kept calling me \"onii-chan\" and refused to join my party because my charisma was too low.\n\n10/10 GOTY material.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Really fun and can be pretty deep. Comparable to minecraft, terraria, etc. with some randomness.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You cannot be black person. developer come from japan where they put black people in washing machine so if you black person like me you have to put up with be orange because developer do not know what brown is. You can enslave white people and I think that make up for not be able to be black person. Developer not swastika he just come from Japan where they beleive black people only exist in washing machine so if you black person that want play this game like me be ready for that.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "So after 300 hours I finally understand how to play the game.\n\nI'll start with the downsides.\nQuests Types need to be more varied, and you should want to do them all.\nDungeon Diving needs to be more profitable by adding an item type that you specifically sell from dungeons.\nBonito Flake wine needs to net less money.\nThe aging system of humans is weird and wrong, whether that is your 1 year old senior citizen or a \"perfectly normal\" 157 year old baby crawling around at a party. People should start out as babies and become at least adults (eternal 30 year olds are fine)\nRanged weapons need a buff (Guns need easier ammo, bows need to do more damage)\nSome of these can be fixed with mods but a wonderful dev (PBUH) updates often (Huge positive overall)\n\nThat said, everything else is perfect. I love it. Several dozen skills to master, an amazingly interesting cooking/food system, an incredibly in depth base building system (I normally hate base building but I find I enjoy this, in depth monster/ally system, and a wide variety of builds and if you are not sure which one you like just try them all why not.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "My character died because I did too much gambling and couldn't leave the slot machines 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In my (rance like) adventure through this game, I found myself in an orphanage where there was a drug-addicted succubus nun. I recruited her to my collection and gave her a mysterious drug. I didn't know that drug changed your gender. One day she laid an egg, and we cooked it.\n\nWe never learned anything more about the orphanage or the orphans.\n\nPlease buy this so you can experience the most mind-blowing adventure of your life.\n\n\n\"Exquisitely chaotic\" - ME\n12/10\n\n\"Now I know you blind man, but you gotta see this\" - CJ\n11/10\n\n\"Besto Shounen\" - ShounenJump\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i made a grass hut, went to sleep, woke up at night, stepped outside, and got mauled to death by a turkey",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's quite the strange game, but enjoyable all the same.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gotta get past early game and be willing to learn, then it's awesome",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A quirky fun open forever rpg where you can go from dungeon delving, farming, impressing the crowd with song to building your own village.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely insane schizo game, noa does it again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BRO IM DRUNK AS FUUCK RN, BUT YOU SHOULD BUY THIS GAme itS rEALLY GOOD",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great JRPG that plays alot like stardew but its more fleshed out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really addicting and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it, the aesthetic, the music, the crazy things you can do, it's amazing!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "welp down the rabbit hole i go i find myself just itching to get back on this game during and after work my life belongs to elin now\n\ngame cost 20 buck real good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, consistently updated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably the most interesting RPG out there along with Kenshi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's insane how much there is to do here.  Very few games have the ability for me to just get lost for hundreds of hours and still have only barely scratched the surface.  It's an open world sandbox where I can do whatever I want.  Become a powerful wizard unlocking the secrets of the arcane, a mighty warrior exploring countless dungeons, be the worlds greatest tomato farmer, build an inn for visitors to come and stay the night and enjoy my tomato culinary delights, be a luxury wine dealer, start a bunny rescue, become a travelling bard with a head that could take a hit from a meteor at this point and barely register it.  And this is not EA, this is a fully complete game with hundreds of hours of content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "typa game that make you skip dinna \n\nits pretty nice",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Peak out of Peak\nVery fun\nVery Chaotic\n\nAlso I still have no clue what I'm doing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Masterpiece of glorious jank and deep ambition.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "attacked a monster on my base and hit my dog and killed it cooked his meat and cried 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 would definitely get killed by the hermit crab again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Warning: Utter Insanity[/h1]\r\nI have no idea wtf is going on in Elin. Heck, I played Elona for many, many, MANY hours and I have no bloody clue what is going on in Elin or Elona. Now, if you read the wiki, skim the subreddit and then the Steam forums, guess what?\r\n\r\nNobody else really knows what the hell is happening either. We're busy making pizza for the king of the realm just to mix insects into the dough. Why? To get fertilized human eggs, of course!\r\n\r\n[h1]Survival Sandbox Thingy[/h1]\r\nSo, what is Elin? Elin is a survival sandbox that allows you to create a character with many unique options to choose from and then go on your merry way. Will you be an enthusiastic farmer who seeks out the perfect tomato by carefully selecting which seed to cultivate, gaining power in the process? Run a tourist trap? Dive deep into dangerous dungeons seeking untold riches and legendary weapons?\r\n\r\nAll of the above? It's possible. Oh, Elin also has a storyline that you should follow for extra goodies I guess. But take your time. In fact, take a lot of time.\r\n\r\n[h1]The Long Grind[/h1]\r\nElin has a ton of skills and you don't start with most of them. The ones you don't have need to be bought with platinum coins, which you will also need to increase your potential with known skills. Potential is a multiplier to XP that will decay as you get more proficient. As you level up skills, the related attribute will increase, which also has potential.\r\n\r\nOverall, Elin has a lot of skills, a lot of grinding and what some might consider slow progression. I don't mind it, but one should be aware of it.\r\n\r\nOn the plus side, if you feel like you messed up and cannot keep up with the increasing difficulty of the encounters, you can always get rid of some fame (the metric that dictates it) and even get some spare change out of it. And no build is invalid either, experimentation and resource management is the key.\r\n\r\n[h1]Exploits[/h1]\r\nThe wiki will tell you a lot about the general game mechanics and has a few guides. Then there's the subreddit and the community right here on Steam. And no, we most likely haven't remotely figured out what can be done. Elin is an incredibly complex game, with every item and NPC interacting with the world and the player. Killing friendly NPCs for early artifacts, yoinking the tax chest (which is basically the standard these days) and other furniture, finding ways to powergrind certain skills, completely obscure material production chains... it's all out there.\r\n\r\nAnd there's most likely new and exciting ways for us to break it all into bits. If you end up buying this game and find something busted, use it.\r\n\r\nThat's it. My insane ramblings about a completely unhinged RPG. It's great, period, end of story.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "You can fish in this game, and that's sick.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its peak, very enjoyable and funny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "let me show you my prostitute that just laid an egg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I found the small dog but can't find Yrrigs to get the bridge-building manual, but I'm having fun looking.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The litmus test for the neuro-divergent spectrum.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Great weird game. 100% recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just Amazing! A hidden gem. Go Play it. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my favorite schizo game by japanese guy",
      "voted_up": true,
      "votes_helpful": 3
    }
  ],
  "negative": [
    {
      "review": "Stick to the demo, kids. Stick to the demo until the end.\n\nI like how this game looks, and after doing a couple hours on the demo and getting used to all of its systems, I was fairly sure I was going to like it. The presentation is very nice, the tutorial is very comprehensive, and overall it has the delightfully unhinged, procgen energy you'd see in roguelikes like dwarf fortress or caves of Qud, where the chaotic rules of the universe add both comedy and unpredictability to the mix, so, after just a couple of hours mucking around the demo, I decided that I was probably going to enjoy so I bought it.\n\nAnd then I tried to actually play the game.\n\nI'm not sure if I can properly convey how hard Elin spins its wheels in trying to provide the experience you think it's preparing you for. The first missions will cover basic crafting and survival, however before long, your character will go from expending all their energy twice a day while trying to make a hut, to crossing entire countries without breaking a sweat, as the game will quickly pivot  its focus into finding resources and dungeon delving instead. Even before they have access to decent weapons, your character will be forced to confront caves full of enemies that more often than not you can only hope your pet will take care for you, and I say \"hope\" because you have no control over your followers: you can't tell them to stop fighting something, and so at points it felt more like my cat was the one playing and I was just there to micromanage their inventory by constantly giving them food and healing items. Mechanics being presented and immediately being pushed into the background, becoming mostly irrelevant but just relevant enough to feel like an annoying chore is a constant with elin as it quickly darts its focus around in one of the most egregious cases of design ADHD I've ever seen.\n\nBut that's not even the worst of it, because even if you are underequipped and ill suited at the beginning, you can just grind away until you're able to make it through those missions and progress, right? Wrong. After about 2 ingame weeks, you will be forced to tangle with the horrifying sub boss we will all have to deal with sooner or later [thundercrack]: TAXES. Indeed, you will be forced to drop your probably half finished training missions and travel half the map to the capital to pay your due to fantasy IRS. What's that? Why yes,  you should have started making money oh, about a week ago. Shame you still haven't even finished the introductory missions because you were too busy trying to find vines around your base to make a new bow. To round up the frustrating confusion, the game will withhold several vital items and recipes as rewards for training quests dealing with entirely different systems, so you will always feel like you're missing something while the game crams 3 completely different systems down your throat.\n\nAnd that's where you ask yourself: [b]what the fuck is this game's point?[/b] It's not a survival crafter since the focus on surviving basically disappears after a couple hours, it's not a dungeon crawler since it keeps pulling you out of it to deal with is economic management systems, but if that's the case why is the economic management aspect of it so poorly set up and uninvolved?! Is it like a sims game where the point is to make pretty houses? Then why try with all these other mechanics when you obviously gave up on them halfway through? Why all this constant flip flopping between undercooked systems? Why are you sending me into a dungeon before giving me the ability to make weapons? Why is my cat capable of aggroing into everything and yet I'm forced to constantly hand-feed it? [b]Why?![/b]\n\nElin is kinda the yang to Unreal World's ying. While UW is a very rudimentary looking game, with a limited amount of systems that will nonetheless unfold in a comprehensive manner, Elin frontloads its presentation but will lose itself somewhere between wasting your time, withholding information and systems from you, constantly swinging focus, and adding a nice helping of \"oh by the way you should have done this differently, you're fucked now. Bye!\" on top. The best way I can put it is that the game feels... loose. Like, fundamentally so. Superficially looking like a deep and layered mix of survival crafter and dungeon crawler with a nice sprinkling of economic simulator, but instead being full of mechanical dead ends and nonsensical fluff while constantly changing directions on what it seems to expect from you and deliberately making it confusing and obscure because, on the game's own admission, \"well this is a roguelike, so some things will be hard to learn\". I've been able to enjoy other roguelikes without ever having too look up external information, and I haven't been able to make sense of some stuff in Elin despite it featuring like, 4 separate help systems. Please don't use the \"roguelike\" label as a scapegoat to excuse disjointed, unintuitive and disorienting design. If this is the love child of dwarf fortress, kenshi and stardew valley, it sure got every single recessive gene.\n\n(also the game tries way, way too hard for this kind of lolrandom vibe which, while it plays like an adorable time capsule of internet humor circa '05, feels forced and cringy more often than not.)\n\nIf you're thinking of playing or buying this game, by all means, please try the demo. But stick with it all the way to the end. Progress can be passed over to the full game, and to be honest, you'll probably have to restart at some point anyway so whatever. Don't be swayed by the nice graphics and the very competent presentation, because otherwise you might realize that this game is way too unpleasant to play by the time you can't refund it anymore like yours truly.\n\n4/10.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "It's a fun game, it feels good to learn it, but the world feels totally broken. I know it's early access, but it's hard to tell where the bugs end and the game begins. \nWhy do animals (talk) by default?\nWhy do many NPCs have a completely unrelated profile picture?\n[strike] Also, AI translation is one thing, but it would be nice to have reassurance that it's being proofread. I'm constantly wondering if what I read was intended or AI misinterpretation. [/strike]\nAccording to someone on discord, only the changelog is AI translated.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I admit, I may have overestimated the learning curve and time investment to fully appreciate this game which is a sequel to a cult classic. I played the demo.\n\nAnd I'm sure there are plenty of people who understand the change and quality of life from the last game. \n\nWhat I'm trying to say is I never felt so intimidated to sit down and understand an rpg. This is no run of the mill jrpg. There are tons of stats, many unexplained systems, and because of the sheer customization and potential to go out of bounds, I have found it a challenge to find the guard rails to allow me enjoy this game and it's world as chaotic, creative, and sometimes hilariously nonsensical as it is.\n\nAs I get older I find myself with less time to really sit and enjoy and learn. I have also have gotten the impression this game is very much a slow burn which makes me wonder how long new playthoughs would take to get back at a comprehensible level.\n\nI wish to also see more of the story of this world, meet more characters, and help guided on what feels like a very tedious intro. \n\nBut maybe that is the point for what feels like such an advanced and creatively chaotic rpg and I simply had made the wrong purchase and am not the audience for this game currently. In which point I cannot refund, return, or exchange. \n\nWill this game fall into the oh so common pit of games I never will touch again, or a game I lovingly return to and feel more approachable after more updates, quality of life, translation, and improved immersion in regards to portraits and sprite assets?\n\nI don't know, but currently in my stage of life I wouldn't recommend it as much as I actually would.\n\n-Sir Valentine 🌴",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "this game ruined my life because how addicting it is so i have to uninstall or else ill become a broke homeless shutin living in a tiny studio . its really good so i put thumbs down because it will actually genuinkley ruin ur life its so addicting like drugs i canjt stop its like s*x",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Contains pedophilic elements; In the world gen settings there's an option to limit character's ages to 13, the game also gives you 3 options for a companion: a dog, a cat, or \"a little girl\", and I'm sure many more questionable things if I continued to play instead of refunding it.\n\nWeebs continue to prove my theory that they are all pedophiles",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "After hundreds of hours in Caves of Qud, I thought I would love this game. I'm just so incredibly bored. It's just way too much tedium. That's coming from someone who is currently obsessed with Vintage Story. The combat is terrible also. It bombards you with tons of tutorials at the start. I understand you need to teach people how to play the game but it's just information overload and it's not even a little bit fun to do. I felt zero sense of accomplishment from completing them. I see no end to the tedium and it has yet to be even a little bit fun once.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game starts out really fun and once some of the issues are resolved it will be an amazing rpg. I enjoy the concept it reminds me a lot of the original Ultima online with the way growth is handled. There are some serious issues though. 1) Food - difficult to obtain and is very important to have. 2) Familiars are a complete mess, they run off on there own and die so easily, even if the setting say stay by your side. 3) The penalty for dying is excessive and is very off putting to the casual players. 4) The progression between days is very fast. 5) The generation of garbage is confusing on why is this animal crossing?  I am very excited and high hopes for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has very offensive, secluded community and they defend every bad decision of the developer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The clunkyness of the UI and controls, and the unclear nature of the tutorials, make the early game too hard for me to be able to play past it and even enjoy it. The game looks fun when I watch other people play it, but if you want to try it for yourself, be prepared.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stick to the demo, kids. Stick to the demo until the end.\n\nI like how this game looks, and after doing a couple hours on the demo and getting used to all of its systems, I was fairly sure I was going to like it. The presentation is very nice, the tutorial is very comprehensive, and overall it has the delightfully unhinged, procgen energy you'd see in roguelikes like dwarf fortress or caves of Qud, where the chaotic rules of the universe add both comedy and unpredictability to the mix, so, after just a couple of hours mucking around the demo, I decided that I was probably going to enjoy so I bought it.\n\nAnd then I tried to actually play the game.\n\nI'm not sure if I can properly convey how hard Elin spins its wheels in trying to provide the experience you think it's preparing you for. The first missions will cover basic crafting and survival, however before long, your character will go from expending all their energy twice a day while trying to make a hut, to crossing entire countries without breaking a sweat, as the game will quickly pivot  its focus into finding resources and dungeon delving instead. Even before they have access to decent weapons, your character will be forced to confront caves full of enemies that more often than not you can only hope your pet will take care for you, and I say \"hope\" because you have no control over your followers: you can't tell them to stop fighting something, and so at points it felt more like my cat was the one playing and I was just there to micromanage their inventory by constantly giving them food and healing items. Mechanics being presented and immediately being pushed into the background, becoming mostly irrelevant but just relevant enough to feel like an annoying chore is a constant with elin as it quickly darts its focus around in one of the most egregious cases of design ADHD I've ever seen.\n\nBut that's not even the worst of it, because even if you are underequipped and ill suited at the beginning, you can just grind away until you're able to make it through those missions and progress, right? Wrong. After about 2 ingame weeks, you will be forced to tangle with the horrifying sub boss we will all have to deal with sooner or later [thundercrack]: TAXES. Indeed, you will be forced to drop your probably half finished training missions and travel half the map to the capital to pay your due to fantasy IRS. What's that? Why yes,  you should have started making money oh, about a week ago. Shame you still haven't even finished the introductory missions because you were too busy trying to find vines around your base to make a new bow. To round up the frustrating confusion, the game will withhold several vital items and recipes as rewards for training quests dealing with entirely different systems, so you will always feel like you're missing something while the game crams 3 completely different systems down your throat.\n\nAnd that's where you ask yourself: [b]what the fuck is this game's point?[/b] It's not a survival crafter since the focus on surviving basically disappears after a couple hours, it's not a dungeon crawler since it keeps pulling you out of it to deal with is economic management systems, but if that's the case why is the economic management aspect of it so poorly set up and uninvolved?! Is it like a sims game where the point is to make pretty houses? Then why try with all these other mechanics when you obviously gave up on them halfway through? Why all this constant flip flopping between undercooked systems? Why are you sending me into a dungeon before giving me the ability to make weapons? Why is my cat capable of aggroing into everything and yet I'm forced to constantly hand-feed it? [b]Why?![/b]\n\nElin is kinda the yang to Unreal World's ying. While UW is a very rudimentary looking game, with a limited amount of systems that will nonetheless unfold in a comprehensive manner, Elin frontloads its presentation but will lose itself somewhere between wasting your time, withholding information and systems from you, constantly swinging focus, and adding a nice helping of \"oh by the way you should have done this differently, you're fucked now. Bye!\" on top. The best way I can put it is that the game feels... loose. Like, fundamentally so. Superficially looking like a deep and layered mix of survival crafter and dungeon crawler with a nice sprinkling of economic simulator, but instead being full of mechanical dead ends and nonsensical fluff while constantly changing directions on what it seems to expect from you and deliberately making it confusing and obscure because, on the game's own admission, \"well this is a roguelike, so some things will be hard to learn\". I've been able to enjoy other roguelikes without ever having too look up external information, and I haven't been able to make sense of some stuff in Elin despite it featuring like, 4 separate help systems. Please don't use the \"roguelike\" label as a scapegoat to excuse disjointed, unintuitive and disorienting design. If this is the love child of dwarf fortress, kenshi and stardew valley, it sure got every single recessive gene.\n\n(also the game tries way, way too hard for this kind of lolrandom vibe which, while it plays like an adorable time capsule of internet humor circa '05, feels forced and cringy more often than not.)\n\nIf you're thinking of playing or buying this game, by all means, please try the demo. But stick with it all the way to the end. Progress can be passed over to the full game, and to be honest, you'll probably have to restart at some point anyway so whatever. Don't be swayed by the nice graphics and the very competent presentation, because otherwise you might realize that this game is way too unpleasant to play by the time you can't refund it anymore like yours truly.\n\n4/10.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "i really wanted to like this game. for the first 20 hours or so, it actually was pretty satisfying. (excuse my hour count, i played quite a bit of it while offline.) a friend recommended this one saying that it was as complex and insane as dwarf fortress. at the time, that sounded so awesome that i simply had to take him up on it.\n\nwhen my review was positive, it talked about all the crazy things that had happened as i was starting out. the pet cat being an alcoholic, receiving a quest to deliver a rather valuable but extremely heavy game table which basically *forces* you to commit mail fraud, etc etc. many people have already talked about such stories. and don't get me wrong, it genuinely was funny for a while!\n\nthe problem is that dwarf fortress's insanity is baked into the game itself, whereas elin's insanity is a collection of one-off gags that eventually grow stale. \"the quest asked me to deliver what?!?!\" \"i can, ahem, 'watch birds' with a drunken noblewoman on a street, and that's 20% as bad as just eating cat meat?\" \"lmao, what did you say this person's age and gender were?\" but eventually you stop paying attention to the 20-ish lines of dialog or whatnot from the random civilians, and the quests become the same old thing repeatedly. and all that's left is the gameplay.\n\nit's a total grindfest, basically. i once said that \"it's OSRS if it was honest about being a nightmarish capitalist hellscape,\" which is unfortunately more true of the core mechanics than of the game's setting. some people vibe with that, but there are better uses of my time... after the honeymoon period of setting everything up and growing out of weakling status, it devolves into visiting the same presets of dungeons over and over, travelling between a few towns and handling their quests over and over, praying that you can find something to make your plots of land ever slightly more useful. base building in particular takes a LOT of time, with a number of essential recipes locked behind randomization. beyond a certain point, your rate of income becomes basically linear (or at least, pretty hard to expand into a respectable amount). this becomes a problem when important items are worth hundreds of thousands, while you are making just thousands at a time and it is competing with the steadily-growing taxes.\n\nthe aforementioned \"dwarf fortress levels of insanity\" are really just the limited number of tricks you can use to counteract this tedium, taking advantage of completely randomized object composition (beach ball made of dark matter as a quest reward...) and the fact that almost all creatures in the game behave similarly. humans can have eggs, and you can have conversations with livestock. \n\nbut, again, there's only so much you can do. the combat system is click, click, take advantage of ranged weaponry, pray you don't die. the enemies become beefier but your strategic options don't expand much to counteract that. in particular, the magic system was really cool with how you can collect different spells to defend yourself or teleport out of harm's way. until 30 or so hours in, when you've collected nearly all of the spells and realized they *don't* gradually become more complex to help deal with advanced threats. also, some combat mechanics are quite annoying with few ways to defend against. you can pour water on yourself to protect against fire, or focus on finding acidproof equipment. but there is NOTHING you can do to prevent essential equipment from being shattered by frost, other than buying coldproof blankets, which aren't cheap.\n\none more minor thing, there's a pretty significant tonal dissonance in this game. i mean that there's a pretty jarring contrast between the supposedly serious story and the often ridiculous, sometimes questionable, backer-suggested content. i guess some people weren't content to make a mod, lol. but this isn't a huge issue. in fact, the insanity would be welcome if that was properly, continuously reflected in the game itself.\n\noverall, it's decent but not mindblowing. i wouldn't bother if it's not on sale. fun for a while, but you might be making a heck of an effort to see the late-game content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is going to be a challenging review to write because while I cannot in good conscience recommend this game, I do plan on continuing to play it a bit longer.  This is a game that balances several different genres, from farming sim, to gathering/crafting town building sim, to random dungeon crawler.  None of these systems are done well.  Okay, maybe I should clarify here: if the designer/developer is trying to faithfully recreate the experience of playing a 25-year old web browser-based MMORPG, then they have succeeded.  I find that, ultimately, that's the charm and appeal of this game.  The problem is, you have to watch YouTube guides to figure out what to do, and the payoff is building a stone table or just completing a dungeon run.  I can't help but think that the game could still retain that \"low-fi\" aesthetic but have much better learning and progression curve, UI, fluidity, and excitement.  Overall, there is a demographic that this game will absolutely appeal to, but if you're not in that demographic, there are probably better games to try first.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game ruined my life because how addicting it is so i have to uninstall or else ill become a broke homeless shutin living in a tiny studio . its really good so i put thumbs down because it will actually genuinkley ruin ur life its so addicting like drugs i canjt stop its like s*x",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Contains pedophilic elements; In the world gen settings there's an option to limit character's ages to 13, the game also gives you 3 options for a companion: a dog, a cat, or \"a little girl\", and I'm sure many more questionable things if I continued to play instead of refunding it.\n\nWeebs continue to prove my theory that they are all pedophiles",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game starts out really fun and once some of the issues are resolved it will be an amazing rpg. I enjoy the concept it reminds me a lot of the original Ultima online with the way growth is handled. There are some serious issues though. 1) Food - difficult to obtain and is very important to have. 2) Familiars are a complete mess, they run off on there own and die so easily, even if the setting say stay by your side. 3) The penalty for dying is excessive and is very off putting to the casual players. 4) The progression between days is very fast. 5) The generation of garbage is confusing on why is this animal crossing?  I am very excited and high hopes for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has very offensive, secluded community and they defend every bad decision of the developer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The clunkyness of the UI and controls, and the unclear nature of the tutorials, make the early game too hard for me to be able to play past it and even enjoy it. The game looks fun when I watch other people play it, but if you want to try it for yourself, be prepared.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stick to the demo, kids. Stick to the demo until the end.\n\nI like how this game looks, and after doing a couple hours on the demo and getting used to all of its systems, I was fairly sure I was going to like it. The presentation is very nice, the tutorial is very comprehensive, and overall it has the delightfully unhinged, procgen energy you'd see in roguelikes like dwarf fortress or caves of Qud, where the chaotic rules of the universe add both comedy and unpredictability to the mix, so, after just a couple of hours mucking around the demo, I decided that I was probably going to enjoy so I bought it.\n\nAnd then I tried to actually play the game.\n\nI'm not sure if I can properly convey how hard Elin spins its wheels in trying to provide the experience you think it's preparing you for. The first missions will cover basic crafting and survival, however before long, your character will go from expending all their energy twice a day while trying to make a hut, to crossing entire countries without breaking a sweat, as the game will quickly pivot  its focus into finding resources and dungeon delving instead. Even before they have access to decent weapons, your character will be forced to confront caves full of enemies that more often than not you can only hope your pet will take care for you, and I say \"hope\" because you have no control over your followers: you can't tell them to stop fighting something, and so at points it felt more like my cat was the one playing and I was just there to micromanage their inventory by constantly giving them food and healing items. Mechanics being presented and immediately being pushed into the background, becoming mostly irrelevant but just relevant enough to feel like an annoying chore is a constant with elin as it quickly darts its focus around in one of the most egregious cases of design ADHD I've ever seen.\n\nBut that's not even the worst of it, because even if you are underequipped and ill suited at the beginning, you can just grind away until you're able to make it through those missions and progress, right? Wrong. After about 2 ingame weeks, you will be forced to tangle with the horrifying sub boss we will all have to deal with sooner or later [thundercrack]: TAXES. Indeed, you will be forced to drop your probably half finished training missions and travel half the map to the capital to pay your due to fantasy IRS. What's that? Why yes,  you should have started making money oh, about a week ago. Shame you still haven't even finished the introductory missions because you were too busy trying to find vines around your base to make a new bow. To round up the frustrating confusion, the game will withhold several vital items and recipes as rewards for training quests dealing with entirely different systems, so you will always feel like you're missing something while the game crams 3 completely different systems down your throat.\n\nAnd that's where you ask yourself: [b]what the fuck is this game's point?[/b] It's not a survival crafter since the focus on surviving basically disappears after a couple hours, it's not a dungeon crawler since it keeps pulling you out of it to deal with is economic management systems, but if that's the case why is the economic management aspect of it so poorly set up and uninvolved?! Is it like a sims game where the point is to make pretty houses? Then why try with all these other mechanics when you obviously gave up on them halfway through? Why all this constant flip flopping between undercooked systems? Why are you sending me into a dungeon before giving me the ability to make weapons? Why is my cat capable of aggroing into everything and yet I'm forced to constantly hand-feed it? [b]Why?![/b]\n\nElin is kinda the yang to Unreal World's ying. While UW is a very rudimentary looking game, with a limited amount of systems that will nonetheless unfold in a comprehensive manner, Elin frontloads its presentation but will lose itself somewhere between wasting your time, withholding information and systems from you, constantly swinging focus, and adding a nice helping of \"oh by the way you should have done this differently, you're fucked now. Bye!\" on top. The best way I can put it is that the game feels... loose. Like, fundamentally so. Superficially looking like a deep and layered mix of survival crafter and dungeon crawler with a nice sprinkling of economic simulator, but instead being full of mechanical dead ends and nonsensical fluff while constantly changing directions on what it seems to expect from you and deliberately making it confusing and obscure because, on the game's own admission, \"well this is a roguelike, so some things will be hard to learn\". I've been able to enjoy other roguelikes without ever having too look up external information, and I haven't been able to make sense of some stuff in Elin despite it featuring like, 4 separate help systems. Please don't use the \"roguelike\" label as a scapegoat to excuse disjointed, unintuitive and disorienting design. If this is the love child of dwarf fortress, kenshi and stardew valley, it sure got every single recessive gene.\n\n(also the game tries way, way too hard for this kind of lolrandom vibe which, while it plays like an adorable time capsule of internet humor circa '05, feels forced and cringy more often than not.)\n\nIf you're thinking of playing or buying this game, by all means, please try the demo. But stick with it all the way to the end. Progress can be passed over to the full game, and to be honest, you'll probably have to restart at some point anyway so whatever. Don't be swayed by the nice graphics and the very competent presentation, because otherwise you might realize that this game is way too unpleasant to play by the time you can't refund it anymore like yours truly.\n\n4/10.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "i really wanted to like this game. for the first 20 hours or so, it actually was pretty satisfying. (excuse my hour count, i played quite a bit of it while offline.) a friend recommended this one saying that it was as complex and insane as dwarf fortress. at the time, that sounded so awesome that i simply had to take him up on it.\n\nwhen my review was positive, it talked about all the crazy things that had happened as i was starting out. the pet cat being an alcoholic, receiving a quest to deliver a rather valuable but extremely heavy game table which basically *forces* you to commit mail fraud, etc etc. many people have already talked about such stories. and don't get me wrong, it genuinely was funny for a while!\n\nthe problem is that dwarf fortress's insanity is baked into the game itself, whereas elin's insanity is a collection of one-off gags that eventually grow stale. \"the quest asked me to deliver what?!?!\" \"i can, ahem, 'watch birds' with a drunken noblewoman on a street, and that's 20% as bad as just eating cat meat?\" \"lmao, what did you say this person's age and gender were?\" but eventually you stop paying attention to the 20-ish lines of dialog or whatnot from the random civilians, and the quests become the same old thing repeatedly. and all that's left is the gameplay.\n\nit's a total grindfest, basically. i once said that \"it's OSRS if it was honest about being a nightmarish capitalist hellscape,\" which is unfortunately more true of the core mechanics than of the game's setting. some people vibe with that, but there are better uses of my time... after the honeymoon period of setting everything up and growing out of weakling status, it devolves into visiting the same presets of dungeons over and over, travelling between a few towns and handling their quests over and over, praying that you can find something to make your plots of land ever slightly more useful. base building in particular takes a LOT of time, with a number of essential recipes locked behind randomization. beyond a certain point, your rate of income becomes basically linear (or at least, pretty hard to expand into a respectable amount). this becomes a problem when important items are worth hundreds of thousands, while you are making just thousands at a time and it is competing with the steadily-growing taxes.\n\nthe aforementioned \"dwarf fortress levels of insanity\" are really just the limited number of tricks you can use to counteract this tedium, taking advantage of completely randomized object composition (beach ball made of dark matter as a quest reward...) and the fact that almost all creatures in the game behave similarly. humans can have eggs, and you can have conversations with livestock. \n\nbut, again, there's only so much you can do. the combat system is click, click, take advantage of ranged weaponry, pray you don't die. the enemies become beefier but your strategic options don't expand much to counteract that. in particular, the magic system was really cool with how you can collect different spells to defend yourself or teleport out of harm's way. until 30 or so hours in, when you've collected nearly all of the spells and realized they *don't* gradually become more complex to help deal with advanced threats. also, some combat mechanics are quite annoying with few ways to defend against. you can pour water on yourself to protect against fire, or focus on finding acidproof equipment. but there is NOTHING you can do to prevent essential equipment from being shattered by frost, other than buying coldproof blankets, which aren't cheap.\n\none more minor thing, there's a pretty significant tonal dissonance in this game. i mean that there's a pretty jarring contrast between the supposedly serious story and the often ridiculous, sometimes questionable, backer-suggested content. i guess some people weren't content to make a mod, lol. but this isn't a huge issue. in fact, the insanity would be welcome if that was properly, continuously reflected in the game itself.\n\noverall, it's decent but not mindblowing. i wouldn't bother if it's not on sale. fun for a while, but you might be making a heck of an effort to see the late-game content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is going to be a challenging review to write because while I cannot in good conscience recommend this game, I do plan on continuing to play it a bit longer.  This is a game that balances several different genres, from farming sim, to gathering/crafting town building sim, to random dungeon crawler.  None of these systems are done well.  Okay, maybe I should clarify here: if the designer/developer is trying to faithfully recreate the experience of playing a 25-year old web browser-based MMORPG, then they have succeeded.  I find that, ultimately, that's the charm and appeal of this game.  The problem is, you have to watch YouTube guides to figure out what to do, and the payoff is building a stone table or just completing a dungeon run.  I can't help but think that the game could still retain that \"low-fi\" aesthetic but have much better learning and progression curve, UI, fluidity, and excitement.  Overall, there is a demographic that this game will absolutely appeal to, but if you're not in that demographic, there are probably better games to try first.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game ruined my life because how addicting it is so i have to uninstall or else ill become a broke homeless shutin living in a tiny studio . its really good so i put thumbs down because it will actually genuinkley ruin ur life its so addicting like drugs i canjt stop its like s*x",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Contains pedophilic elements; In the world gen settings there's an option to limit character's ages to 13, the game also gives you 3 options for a companion: a dog, a cat, or \"a little girl\", and I'm sure many more questionable things if I continued to play instead of refunding it.\n\nWeebs continue to prove my theory that they are all pedophiles",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game starts out really fun and once some of the issues are resolved it will be an amazing rpg. I enjoy the concept it reminds me a lot of the original Ultima online with the way growth is handled. There are some serious issues though. 1) Food - difficult to obtain and is very important to have. 2) Familiars are a complete mess, they run off on there own and die so easily, even if the setting say stay by your side. 3) The penalty for dying is excessive and is very off putting to the casual players. 4) The progression between days is very fast. 5) The generation of garbage is confusing on why is this animal crossing?  I am very excited and high hopes for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has very offensive, secluded community and they defend every bad decision of the developer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The clunkyness of the UI and controls, and the unclear nature of the tutorials, make the early game too hard for me to be able to play past it and even enjoy it. The game looks fun when I watch other people play it, but if you want to try it for yourself, be prepared.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stick to the demo, kids. Stick to the demo until the end.\n\nI like how this game looks, and after doing a couple hours on the demo and getting used to all of its systems, I was fairly sure I was going to like it. The presentation is very nice, the tutorial is very comprehensive, and overall it has the delightfully unhinged, procgen energy you'd see in roguelikes like dwarf fortress or caves of Qud, where the chaotic rules of the universe add both comedy and unpredictability to the mix, so, after just a couple of hours mucking around the demo, I decided that I was probably going to enjoy so I bought it.\n\nAnd then I tried to actually play the game.\n\nI'm not sure if I can properly convey how hard Elin spins its wheels in trying to provide the experience you think it's preparing you for. The first missions will cover basic crafting and survival, however before long, your character will go from expending all their energy twice a day while trying to make a hut, to crossing entire countries without breaking a sweat, as the game will quickly pivot  its focus into finding resources and dungeon delving instead. Even before they have access to decent weapons, your character will be forced to confront caves full of enemies that more often than not you can only hope your pet will take care for you, and I say \"hope\" because you have no control over your followers: you can't tell them to stop fighting something, and so at points it felt more like my cat was the one playing and I was just there to micromanage their inventory by constantly giving them food and healing items. Mechanics being presented and immediately being pushed into the background, becoming mostly irrelevant but just relevant enough to feel like an annoying chore is a constant with elin as it quickly darts its focus around in one of the most egregious cases of design ADHD I've ever seen.\n\nBut that's not even the worst of it, because even if you are underequipped and ill suited at the beginning, you can just grind away until you're able to make it through those missions and progress, right? Wrong. After about 2 ingame weeks, you will be forced to tangle with the horrifying sub boss we will all have to deal with sooner or later [thundercrack]: TAXES. Indeed, you will be forced to drop your probably half finished training missions and travel half the map to the capital to pay your due to fantasy IRS. What's that? Why yes,  you should have started making money oh, about a week ago. Shame you still haven't even finished the introductory missions because you were too busy trying to find vines around your base to make a new bow. To round up the frustrating confusion, the game will withhold several vital items and recipes as rewards for training quests dealing with entirely different systems, so you will always feel like you're missing something while the game crams 3 completely different systems down your throat.\n\nAnd that's where you ask yourself: [b]what the fuck is this game's point?[/b] It's not a survival crafter since the focus on surviving basically disappears after a couple hours, it's not a dungeon crawler since it keeps pulling you out of it to deal with is economic management systems, but if that's the case why is the economic management aspect of it so poorly set up and uninvolved?! Is it like a sims game where the point is to make pretty houses? Then why try with all these other mechanics when you obviously gave up on them halfway through? Why all this constant flip flopping between undercooked systems? Why are you sending me into a dungeon before giving me the ability to make weapons? Why is my cat capable of aggroing into everything and yet I'm forced to constantly hand-feed it? [b]Why?![/b]\n\nElin is kinda the yang to Unreal World's ying. While UW is a very rudimentary looking game, with a limited amount of systems that will nonetheless unfold in a comprehensive manner, Elin frontloads its presentation but will lose itself somewhere between wasting your time, withholding information and systems from you, constantly swinging focus, and adding a nice helping of \"oh by the way you should have done this differently, you're fucked now. Bye!\" on top. The best way I can put it is that the game feels... loose. Like, fundamentally so. Superficially looking like a deep and layered mix of survival crafter and dungeon crawler with a nice sprinkling of economic simulator, but instead being full of mechanical dead ends and nonsensical fluff while constantly changing directions on what it seems to expect from you and deliberately making it confusing and obscure because, on the game's own admission, \"well this is a roguelike, so some things will be hard to learn\". I've been able to enjoy other roguelikes without ever having too look up external information, and I haven't been able to make sense of some stuff in Elin despite it featuring like, 4 separate help systems. Please don't use the \"roguelike\" label as a scapegoat to excuse disjointed, unintuitive and disorienting design. If this is the love child of dwarf fortress, kenshi and stardew valley, it sure got every single recessive gene.\n\n(also the game tries way, way too hard for this kind of lolrandom vibe which, while it plays like an adorable time capsule of internet humor circa '05, feels forced and cringy more often than not.)\n\nIf you're thinking of playing or buying this game, by all means, please try the demo. But stick with it all the way to the end. Progress can be passed over to the full game, and to be honest, you'll probably have to restart at some point anyway so whatever. Don't be swayed by the nice graphics and the very competent presentation, because otherwise you might realize that this game is way too unpleasant to play by the time you can't refund it anymore like yours truly.\n\n4/10.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "i really wanted to like this game. for the first 20 hours or so, it actually was pretty satisfying. (excuse my hour count, i played quite a bit of it while offline.) a friend recommended this one saying that it was as complex and insane as dwarf fortress. at the time, that sounded so awesome that i simply had to take him up on it.\n\nwhen my review was positive, it talked about all the crazy things that had happened as i was starting out. the pet cat being an alcoholic, receiving a quest to deliver a rather valuable but extremely heavy game table which basically *forces* you to commit mail fraud, etc etc. many people have already talked about such stories. and don't get me wrong, it genuinely was funny for a while!\n\nthe problem is that dwarf fortress's insanity is baked into the game itself, whereas elin's insanity is a collection of one-off gags that eventually grow stale. \"the quest asked me to deliver what?!?!\" \"i can, ahem, 'watch birds' with a drunken noblewoman on a street, and that's 20% as bad as just eating cat meat?\" \"lmao, what did you say this person's age and gender were?\" but eventually you stop paying attention to the 20-ish lines of dialog or whatnot from the random civilians, and the quests become the same old thing repeatedly. and all that's left is the gameplay.\n\nit's a total grindfest, basically. i once said that \"it's OSRS if it was honest about being a nightmarish capitalist hellscape,\" which is unfortunately more true of the core mechanics than of the game's setting. some people vibe with that, but there are better uses of my time... after the honeymoon period of setting everything up and growing out of weakling status, it devolves into visiting the same presets of dungeons over and over, travelling between a few towns and handling their quests over and over, praying that you can find something to make your plots of land ever slightly more useful. base building in particular takes a LOT of time, with a number of essential recipes locked behind randomization. beyond a certain point, your rate of income becomes basically linear (or at least, pretty hard to expand into a respectable amount). this becomes a problem when important items are worth hundreds of thousands, while you are making just thousands at a time and it is competing with the steadily-growing taxes.\n\nthe aforementioned \"dwarf fortress levels of insanity\" are really just the limited number of tricks you can use to counteract this tedium, taking advantage of completely randomized object composition (beach ball made of dark matter as a quest reward...) and the fact that almost all creatures in the game behave similarly. humans can have eggs, and you can have conversations with livestock. \n\nbut, again, there's only so much you can do. the combat system is click, click, take advantage of ranged weaponry, pray you don't die. the enemies become beefier but your strategic options don't expand much to counteract that. in particular, the magic system was really cool with how you can collect different spells to defend yourself or teleport out of harm's way. until 30 or so hours in, when you've collected nearly all of the spells and realized they *don't* gradually become more complex to help deal with advanced threats. also, some combat mechanics are quite annoying with few ways to defend against. you can pour water on yourself to protect against fire, or focus on finding acidproof equipment. but there is NOTHING you can do to prevent essential equipment from being shattered by frost, other than buying coldproof blankets, which aren't cheap.\n\none more minor thing, there's a pretty significant tonal dissonance in this game. i mean that there's a pretty jarring contrast between the supposedly serious story and the often ridiculous, sometimes questionable, backer-suggested content. i guess some people weren't content to make a mod, lol. but this isn't a huge issue. in fact, the insanity would be welcome if that was properly, continuously reflected in the game itself.\n\noverall, it's decent but not mindblowing. i wouldn't bother if it's not on sale. fun for a while, but you might be making a heck of an effort to see the late-game content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is going to be a challenging review to write because while I cannot in good conscience recommend this game, I do plan on continuing to play it a bit longer.  This is a game that balances several different genres, from farming sim, to gathering/crafting town building sim, to random dungeon crawler.  None of these systems are done well.  Okay, maybe I should clarify here: if the designer/developer is trying to faithfully recreate the experience of playing a 25-year old web browser-based MMORPG, then they have succeeded.  I find that, ultimately, that's the charm and appeal of this game.  The problem is, you have to watch YouTube guides to figure out what to do, and the payoff is building a stone table or just completing a dungeon run.  I can't help but think that the game could still retain that \"low-fi\" aesthetic but have much better learning and progression curve, UI, fluidity, and excitement.  Overall, there is a demographic that this game will absolutely appeal to, but if you're not in that demographic, there are probably better games to try first.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game ruined my life because how addicting it is so i have to uninstall or else ill become a broke homeless shutin living in a tiny studio . its really good so i put thumbs down because it will actually genuinkley ruin ur life its so addicting like drugs i canjt stop its like s*x",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Contains pedophilic elements; In the world gen settings there's an option to limit character's ages to 13, the game also gives you 3 options for a companion: a dog, a cat, or \"a little girl\", and I'm sure many more questionable things if I continued to play instead of refunding it.\n\nWeebs continue to prove my theory that they are all pedophiles",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game starts out really fun and once some of the issues are resolved it will be an amazing rpg. I enjoy the concept it reminds me a lot of the original Ultima online with the way growth is handled. There are some serious issues though. 1) Food - difficult to obtain and is very important to have. 2) Familiars are a complete mess, they run off on there own and die so easily, even if the setting say stay by your side. 3) The penalty for dying is excessive and is very off putting to the casual players. 4) The progression between days is very fast. 5) The generation of garbage is confusing on why is this animal crossing?  I am very excited and high hopes for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has very offensive, secluded community and they defend every bad decision of the developer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The clunkyness of the UI and controls, and the unclear nature of the tutorials, make the early game too hard for me to be able to play past it and even enjoy it. The game looks fun when I watch other people play it, but if you want to try it for yourself, be prepared.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stick to the demo, kids. Stick to the demo until the end.\n\nI like how this game looks, and after doing a couple hours on the demo and getting used to all of its systems, I was fairly sure I was going to like it. The presentation is very nice, the tutorial is very comprehensive, and overall it has the delightfully unhinged, procgen energy you'd see in roguelikes like dwarf fortress or caves of Qud, where the chaotic rules of the universe add both comedy and unpredictability to the mix, so, after just a couple of hours mucking around the demo, I decided that I was probably going to enjoy so I bought it.\n\nAnd then I tried to actually play the game.\n\nI'm not sure if I can properly convey how hard Elin spins its wheels in trying to provide the experience you think it's preparing you for. The first missions will cover basic crafting and survival, however before long, your character will go from expending all their energy twice a day while trying to make a hut, to crossing entire countries without breaking a sweat, as the game will quickly pivot  its focus into finding resources and dungeon delving instead. Even before they have access to decent weapons, your character will be forced to confront caves full of enemies that more often than not you can only hope your pet will take care for you, and I say \"hope\" because you have no control over your followers: you can't tell them to stop fighting something, and so at points it felt more like my cat was the one playing and I was just there to micromanage their inventory by constantly giving them food and healing items. Mechanics being presented and immediately being pushed into the background, becoming mostly irrelevant but just relevant enough to feel like an annoying chore is a constant with elin as it quickly darts its focus around in one of the most egregious cases of design ADHD I've ever seen.\n\nBut that's not even the worst of it, because even if you are underequipped and ill suited at the beginning, you can just grind away until you're able to make it through those missions and progress, right? Wrong. After about 2 ingame weeks, you will be forced to tangle with the horrifying sub boss we will all have to deal with sooner or later [thundercrack]: TAXES. Indeed, you will be forced to drop your probably half finished training missions and travel half the map to the capital to pay your due to fantasy IRS. What's that? Why yes,  you should have started making money oh, about a week ago. Shame you still haven't even finished the introductory missions because you were too busy trying to find vines around your base to make a new bow. To round up the frustrating confusion, the game will withhold several vital items and recipes as rewards for training quests dealing with entirely different systems, so you will always feel like you're missing something while the game crams 3 completely different systems down your throat.\n\nAnd that's where you ask yourself: [b]what the fuck is this game's point?[/b] It's not a survival crafter since the focus on surviving basically disappears after a couple hours, it's not a dungeon crawler since it keeps pulling you out of it to deal with is economic management systems, but if that's the case why is the economic management aspect of it so poorly set up and uninvolved?! Is it like a sims game where the point is to make pretty houses? Then why try with all these other mechanics when you obviously gave up on them halfway through? Why all this constant flip flopping between undercooked systems? Why are you sending me into a dungeon before giving me the ability to make weapons? Why is my cat capable of aggroing into everything and yet I'm forced to constantly hand-feed it? [b]Why?![/b]\n\nElin is kinda the yang to Unreal World's ying. While UW is a very rudimentary looking game, with a limited amount of systems that will nonetheless unfold in a comprehensive manner, Elin frontloads its presentation but will lose itself somewhere between wasting your time, withholding information and systems from you, constantly swinging focus, and adding a nice helping of \"oh by the way you should have done this differently, you're fucked now. Bye!\" on top. The best way I can put it is that the game feels... loose. Like, fundamentally so. Superficially looking like a deep and layered mix of survival crafter and dungeon crawler with a nice sprinkling of economic simulator, but instead being full of mechanical dead ends and nonsensical fluff while constantly changing directions on what it seems to expect from you and deliberately making it confusing and obscure because, on the game's own admission, \"well this is a roguelike, so some things will be hard to learn\". I've been able to enjoy other roguelikes without ever having too look up external information, and I haven't been able to make sense of some stuff in Elin despite it featuring like, 4 separate help systems. Please don't use the \"roguelike\" label as a scapegoat to excuse disjointed, unintuitive and disorienting design. If this is the love child of dwarf fortress, kenshi and stardew valley, it sure got every single recessive gene.\n\n(also the game tries way, way too hard for this kind of lolrandom vibe which, while it plays like an adorable time capsule of internet humor circa '05, feels forced and cringy more often than not.)\n\nIf you're thinking of playing or buying this game, by all means, please try the demo. But stick with it all the way to the end. Progress can be passed over to the full game, and to be honest, you'll probably have to restart at some point anyway so whatever. Don't be swayed by the nice graphics and the very competent presentation, because otherwise you might realize that this game is way too unpleasant to play by the time you can't refund it anymore like yours truly.\n\n4/10.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "i really wanted to like this game. for the first 20 hours or so, it actually was pretty satisfying. (excuse my hour count, i played quite a bit of it while offline.) a friend recommended this one saying that it was as complex and insane as dwarf fortress. at the time, that sounded so awesome that i simply had to take him up on it.\n\nwhen my review was positive, it talked about all the crazy things that had happened as i was starting out. the pet cat being an alcoholic, receiving a quest to deliver a rather valuable but extremely heavy game table which basically *forces* you to commit mail fraud, etc etc. many people have already talked about such stories. and don't get me wrong, it genuinely was funny for a while!\n\nthe problem is that dwarf fortress's insanity is baked into the game itself, whereas elin's insanity is a collection of one-off gags that eventually grow stale. \"the quest asked me to deliver what?!?!\" \"i can, ahem, 'watch birds' with a drunken noblewoman on a street, and that's 20% as bad as just eating cat meat?\" \"lmao, what did you say this person's age and gender were?\" but eventually you stop paying attention to the 20-ish lines of dialog or whatnot from the random civilians, and the quests become the same old thing repeatedly. and all that's left is the gameplay.\n\nit's a total grindfest, basically. i once said that \"it's OSRS if it was honest about being a nightmarish capitalist hellscape,\" which is unfortunately more true of the core mechanics than of the game's setting. some people vibe with that, but there are better uses of my time... after the honeymoon period of setting everything up and growing out of weakling status, it devolves into visiting the same presets of dungeons over and over, travelling between a few towns and handling their quests over and over, praying that you can find something to make your plots of land ever slightly more useful. base building in particular takes a LOT of time, with a number of essential recipes locked behind randomization. beyond a certain point, your rate of income becomes basically linear (or at least, pretty hard to expand into a respectable amount). this becomes a problem when important items are worth hundreds of thousands, while you are making just thousands at a time and it is competing with the steadily-growing taxes.\n\nthe aforementioned \"dwarf fortress levels of insanity\" are really just the limited number of tricks you can use to counteract this tedium, taking advantage of completely randomized object composition (beach ball made of dark matter as a quest reward...) and the fact that almost all creatures in the game behave similarly. humans can have eggs, and you can have conversations with livestock. \n\nbut, again, there's only so much you can do. the combat system is click, click, take advantage of ranged weaponry, pray you don't die. the enemies become beefier but your strategic options don't expand much to counteract that. in particular, the magic system was really cool with how you can collect different spells to defend yourself or teleport out of harm's way. until 30 or so hours in, when you've collected nearly all of the spells and realized they *don't* gradually become more complex to help deal with advanced threats. also, some combat mechanics are quite annoying with few ways to defend against. you can pour water on yourself to protect against fire, or focus on finding acidproof equipment. but there is NOTHING you can do to prevent essential equipment from being shattered by frost, other than buying coldproof blankets, which aren't cheap.\n\none more minor thing, there's a pretty significant tonal dissonance in this game. i mean that there's a pretty jarring contrast between the supposedly serious story and the often ridiculous, sometimes questionable, backer-suggested content. i guess some people weren't content to make a mod, lol. but this isn't a huge issue. in fact, the insanity would be welcome if that was properly, continuously reflected in the game itself.\n\noverall, it's decent but not mindblowing. i wouldn't bother if it's not on sale. fun for a while, but you might be making a heck of an effort to see the late-game content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is going to be a challenging review to write because while I cannot in good conscience recommend this game, I do plan on continuing to play it a bit longer.  This is a game that balances several different genres, from farming sim, to gathering/crafting town building sim, to random dungeon crawler.  None of these systems are done well.  Okay, maybe I should clarify here: if the designer/developer is trying to faithfully recreate the experience of playing a 25-year old web browser-based MMORPG, then they have succeeded.  I find that, ultimately, that's the charm and appeal of this game.  The problem is, you have to watch YouTube guides to figure out what to do, and the payoff is building a stone table or just completing a dungeon run.  I can't help but think that the game could still retain that \"low-fi\" aesthetic but have much better learning and progression curve, UI, fluidity, and excitement.  Overall, there is a demographic that this game will absolutely appeal to, but if you're not in that demographic, there are probably better games to try first.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game ruined my life because how addicting it is so i have to uninstall or else ill become a broke homeless shutin living in a tiny studio . its really good so i put thumbs down because it will actually genuinkley ruin ur life its so addicting like drugs i canjt stop its like s*x",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Contains pedophilic elements; In the world gen settings there's an option to limit character's ages to 13, the game also gives you 3 options for a companion: a dog, a cat, or \"a little girl\", and I'm sure many more questionable things if I continued to play instead of refunding it.\n\nWeebs continue to prove my theory that they are all pedophiles",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game starts out really fun and once some of the issues are resolved it will be an amazing rpg. I enjoy the concept it reminds me a lot of the original Ultima online with the way growth is handled. There are some serious issues though. 1) Food - difficult to obtain and is very important to have. 2) Familiars are a complete mess, they run off on there own and die so easily, even if the setting say stay by your side. 3) The penalty for dying is excessive and is very off putting to the casual players. 4) The progression between days is very fast. 5) The generation of garbage is confusing on why is this animal crossing?  I am very excited and high hopes for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has very offensive, secluded community and they defend every bad decision of the developer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The clunkyness of the UI and controls, and the unclear nature of the tutorials, make the early game too hard for me to be able to play past it and even enjoy it. The game looks fun when I watch other people play it, but if you want to try it for yourself, be prepared.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stick to the demo, kids. Stick to the demo until the end.\n\nI like how this game looks, and after doing a couple hours on the demo and getting used to all of its systems, I was fairly sure I was going to like it. The presentation is very nice, the tutorial is very comprehensive, and overall it has the delightfully unhinged, procgen energy you'd see in roguelikes like dwarf fortress or caves of Qud, where the chaotic rules of the universe add both comedy and unpredictability to the mix, so, after just a couple of hours mucking around the demo, I decided that I was probably going to enjoy so I bought it.\n\nAnd then I tried to actually play the game.\n\nI'm not sure if I can properly convey how hard Elin spins its wheels in trying to provide the experience you think it's preparing you for. The first missions will cover basic crafting and survival, however before long, your character will go from expending all their energy twice a day while trying to make a hut, to crossing entire countries without breaking a sweat, as the game will quickly pivot  its focus into finding resources and dungeon delving instead. Even before they have access to decent weapons, your character will be forced to confront caves full of enemies that more often than not you can only hope your pet will take care for you, and I say \"hope\" because you have no control over your followers: you can't tell them to stop fighting something, and so at points it felt more like my cat was the one playing and I was just there to micromanage their inventory by constantly giving them food and healing items. Mechanics being presented and immediately being pushed into the background, becoming mostly irrelevant but just relevant enough to feel like an annoying chore is a constant with elin as it quickly darts its focus around in one of the most egregious cases of design ADHD I've ever seen.\n\nBut that's not even the worst of it, because even if you are underequipped and ill suited at the beginning, you can just grind away until you're able to make it through those missions and progress, right? Wrong. After about 2 ingame weeks, you will be forced to tangle with the horrifying sub boss we will all have to deal with sooner or later [thundercrack]: TAXES. Indeed, you will be forced to drop your probably half finished training missions and travel half the map to the capital to pay your due to fantasy IRS. What's that? Why yes,  you should have started making money oh, about a week ago. Shame you still haven't even finished the introductory missions because you were too busy trying to find vines around your base to make a new bow. To round up the frustrating confusion, the game will withhold several vital items and recipes as rewards for training quests dealing with entirely different systems, so you will always feel like you're missing something while the game crams 3 completely different systems down your throat.\n\nAnd that's where you ask yourself: [b]what the fuck is this game's point?[/b] It's not a survival crafter since the focus on surviving basically disappears after a couple hours, it's not a dungeon crawler since it keeps pulling you out of it to deal with is economic management systems, but if that's the case why is the economic management aspect of it so poorly set up and uninvolved?! Is it like a sims game where the point is to make pretty houses? Then why try with all these other mechanics when you obviously gave up on them halfway through? Why all this constant flip flopping between undercooked systems? Why are you sending me into a dungeon before giving me the ability to make weapons? Why is my cat capable of aggroing into everything and yet I'm forced to constantly hand-feed it? [b]Why?![/b]\n\nElin is kinda the yang to Unreal World's ying. While UW is a very rudimentary looking game, with a limited amount of systems that will nonetheless unfold in a comprehensive manner, Elin frontloads its presentation but will lose itself somewhere between wasting your time, withholding information and systems from you, constantly swinging focus, and adding a nice helping of \"oh by the way you should have done this differently, you're fucked now. Bye!\" on top. The best way I can put it is that the game feels... loose. Like, fundamentally so. Superficially looking like a deep and layered mix of survival crafter and dungeon crawler with a nice sprinkling of economic simulator, but instead being full of mechanical dead ends and nonsensical fluff while constantly changing directions on what it seems to expect from you and deliberately making it confusing and obscure because, on the game's own admission, \"well this is a roguelike, so some things will be hard to learn\". I've been able to enjoy other roguelikes without ever having too look up external information, and I haven't been able to make sense of some stuff in Elin despite it featuring like, 4 separate help systems. Please don't use the \"roguelike\" label as a scapegoat to excuse disjointed, unintuitive and disorienting design. If this is the love child of dwarf fortress, kenshi and stardew valley, it sure got every single recessive gene.\n\n(also the game tries way, way too hard for this kind of lolrandom vibe which, while it plays like an adorable time capsule of internet humor circa '05, feels forced and cringy more often than not.)\n\nIf you're thinking of playing or buying this game, by all means, please try the demo. But stick with it all the way to the end. Progress can be passed over to the full game, and to be honest, you'll probably have to restart at some point anyway so whatever. Don't be swayed by the nice graphics and the very competent presentation, because otherwise you might realize that this game is way too unpleasant to play by the time you can't refund it anymore like yours truly.\n\n4/10.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "i really wanted to like this game. for the first 20 hours or so, it actually was pretty satisfying. (excuse my hour count, i played quite a bit of it while offline.) a friend recommended this one saying that it was as complex and insane as dwarf fortress. at the time, that sounded so awesome that i simply had to take him up on it.\n\nwhen my review was positive, it talked about all the crazy things that had happened as i was starting out. the pet cat being an alcoholic, receiving a quest to deliver a rather valuable but extremely heavy game table which basically *forces* you to commit mail fraud, etc etc. many people have already talked about such stories. and don't get me wrong, it genuinely was funny for a while!\n\nthe problem is that dwarf fortress's insanity is baked into the game itself, whereas elin's insanity is a collection of one-off gags that eventually grow stale. \"the quest asked me to deliver what?!?!\" \"i can, ahem, 'watch birds' with a drunken noblewoman on a street, and that's 20% as bad as just eating cat meat?\" \"lmao, what did you say this person's age and gender were?\" but eventually you stop paying attention to the 20-ish lines of dialog or whatnot from the random civilians, and the quests become the same old thing repeatedly. and all that's left is the gameplay.\n\nit's a total grindfest, basically. i once said that \"it's OSRS if it was honest about being a nightmarish capitalist hellscape,\" which is unfortunately more true of the core mechanics than of the game's setting. some people vibe with that, but there are better uses of my time... after the honeymoon period of setting everything up and growing out of weakling status, it devolves into visiting the same presets of dungeons over and over, travelling between a few towns and handling their quests over and over, praying that you can find something to make your plots of land ever slightly more useful. base building in particular takes a LOT of time, with a number of essential recipes locked behind randomization. beyond a certain point, your rate of income becomes basically linear (or at least, pretty hard to expand into a respectable amount). this becomes a problem when important items are worth hundreds of thousands, while you are making just thousands at a time and it is competing with the steadily-growing taxes.\n\nthe aforementioned \"dwarf fortress levels of insanity\" are really just the limited number of tricks you can use to counteract this tedium, taking advantage of completely randomized object composition (beach ball made of dark matter as a quest reward...) and the fact that almost all creatures in the game behave similarly. humans can have eggs, and you can have conversations with livestock. \n\nbut, again, there's only so much you can do. the combat system is click, click, take advantage of ranged weaponry, pray you don't die. the enemies become beefier but your strategic options don't expand much to counteract that. in particular, the magic system was really cool with how you can collect different spells to defend yourself or teleport out of harm's way. until 30 or so hours in, when you've collected nearly all of the spells and realized they *don't* gradually become more complex to help deal with advanced threats. also, some combat mechanics are quite annoying with few ways to defend against. you can pour water on yourself to protect against fire, or focus on finding acidproof equipment. but there is NOTHING you can do to prevent essential equipment from being shattered by frost, other than buying coldproof blankets, which aren't cheap.\n\none more minor thing, there's a pretty significant tonal dissonance in this game. i mean that there's a pretty jarring contrast between the supposedly serious story and the often ridiculous, sometimes questionable, backer-suggested content. i guess some people weren't content to make a mod, lol. but this isn't a huge issue. in fact, the insanity would be welcome if that was properly, continuously reflected in the game itself.\n\noverall, it's decent but not mindblowing. i wouldn't bother if it's not on sale. fun for a while, but you might be making a heck of an effort to see the late-game content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is going to be a challenging review to write because while I cannot in good conscience recommend this game, I do plan on continuing to play it a bit longer.  This is a game that balances several different genres, from farming sim, to gathering/crafting town building sim, to random dungeon crawler.  None of these systems are done well.  Okay, maybe I should clarify here: if the designer/developer is trying to faithfully recreate the experience of playing a 25-year old web browser-based MMORPG, then they have succeeded.  I find that, ultimately, that's the charm and appeal of this game.  The problem is, you have to watch YouTube guides to figure out what to do, and the payoff is building a stone table or just completing a dungeon run.  I can't help but think that the game could still retain that \"low-fi\" aesthetic but have much better learning and progression curve, UI, fluidity, and excitement.  Overall, there is a demographic that this game will absolutely appeal to, but if you're not in that demographic, there are probably better games to try first.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game ruined my life because how addicting it is so i have to uninstall or else ill become a broke homeless shutin living in a tiny studio . its really good so i put thumbs down because it will actually genuinkley ruin ur life its so addicting like drugs i canjt stop its like s*x",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Contains pedophilic elements; In the world gen settings there's an option to limit character's ages to 13, the game also gives you 3 options for a companion: a dog, a cat, or \"a little girl\", and I'm sure many more questionable things if I continued to play instead of refunding it.\n\nWeebs continue to prove my theory that they are all pedophiles",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game starts out really fun and once some of the issues are resolved it will be an amazing rpg. I enjoy the concept it reminds me a lot of the original Ultima online with the way growth is handled. There are some serious issues though. 1) Food - difficult to obtain and is very important to have. 2) Familiars are a complete mess, they run off on there own and die so easily, even if the setting say stay by your side. 3) The penalty for dying is excessive and is very off putting to the casual players. 4) The progression between days is very fast. 5) The generation of garbage is confusing on why is this animal crossing?  I am very excited and high hopes for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has very offensive, secluded community and they defend every bad decision of the developer.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The clunkyness of the UI and controls, and the unclear nature of the tutorials, make the early game too hard for me to be able to play past it and even enjoy it. The game looks fun when I watch other people play it, but if you want to try it for yourself, be prepared.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Stick to the demo, kids. Stick to the demo until the end.\n\nI like how this game looks, and after doing a couple hours on the demo and getting used to all of its systems, I was fairly sure I was going to like it. The presentation is very nice, the tutorial is very comprehensive, and overall it has the delightfully unhinged, procgen energy you'd see in roguelikes like dwarf fortress or caves of Qud, where the chaotic rules of the universe add both comedy and unpredictability to the mix, so, after just a couple of hours mucking around the demo, I decided that I was probably going to enjoy so I bought it.\n\nAnd then I tried to actually play the game.\n\nI'm not sure if I can properly convey how hard Elin spins its wheels in trying to provide the experience you think it's preparing you for. The first missions will cover basic crafting and survival, however before long, your character will go from expending all their energy twice a day while trying to make a hut, to crossing entire countries without breaking a sweat, as the game will quickly pivot  its focus into finding resources and dungeon delving instead. Even before they have access to decent weapons, your character will be forced to confront caves full of enemies that more often than not you can only hope your pet will take care for you, and I say \"hope\" because you have no control over your followers: you can't tell them to stop fighting something, and so at points it felt more like my cat was the one playing and I was just there to micromanage their inventory by constantly giving them food and healing items. Mechanics being presented and immediately being pushed into the background, becoming mostly irrelevant but just relevant enough to feel like an annoying chore is a constant with elin as it quickly darts its focus around in one of the most egregious cases of design ADHD I've ever seen.\n\nBut that's not even the worst of it, because even if you are underequipped and ill suited at the beginning, you can just grind away until you're able to make it through those missions and progress, right? Wrong. After about 2 ingame weeks, you will be forced to tangle with the horrifying sub boss we will all have to deal with sooner or later [thundercrack]: TAXES. Indeed, you will be forced to drop your probably half finished training missions and travel half the map to the capital to pay your due to fantasy IRS. What's that? Why yes,  you should have started making money oh, about a week ago. Shame you still haven't even finished the introductory missions because you were too busy trying to find vines around your base to make a new bow. To round up the frustrating confusion, the game will withhold several vital items and recipes as rewards for training quests dealing with entirely different systems, so you will always feel like you're missing something while the game crams 3 completely different systems down your throat.\n\nAnd that's where you ask yourself: [b]what the fuck is this game's point?[/b] It's not a survival crafter since the focus on surviving basically disappears after a couple hours, it's not a dungeon crawler since it keeps pulling you out of it to deal with is economic management systems, but if that's the case why is the economic management aspect of it so poorly set up and uninvolved?! Is it like a sims game where the point is to make pretty houses? Then why try with all these other mechanics when you obviously gave up on them halfway through? Why all this constant flip flopping between undercooked systems? Why are you sending me into a dungeon before giving me the ability to make weapons? Why is my cat capable of aggroing into everything and yet I'm forced to constantly hand-feed it? [b]Why?![/b]\n\nElin is kinda the yang to Unreal World's ying. While UW is a very rudimentary looking game, with a limited amount of systems that will nonetheless unfold in a comprehensive manner, Elin frontloads its presentation but will lose itself somewhere between wasting your time, withholding information and systems from you, constantly swinging focus, and adding a nice helping of \"oh by the way you should have done this differently, you're fucked now. Bye!\" on top. The best way I can put it is that the game feels... loose. Like, fundamentally so. Superficially looking like a deep and layered mix of survival crafter and dungeon crawler with a nice sprinkling of economic simulator, but instead being full of mechanical dead ends and nonsensical fluff while constantly changing directions on what it seems to expect from you and deliberately making it confusing and obscure because, on the game's own admission, \"well this is a roguelike, so some things will be hard to learn\". I've been able to enjoy other roguelikes without ever having too look up external information, and I haven't been able to make sense of some stuff in Elin despite it featuring like, 4 separate help systems. Please don't use the \"roguelike\" label as a scapegoat to excuse disjointed, unintuitive and disorienting design. If this is the love child of dwarf fortress, kenshi and stardew valley, it sure got every single recessive gene.\n\n(also the game tries way, way too hard for this kind of lolrandom vibe which, while it plays like an adorable time capsule of internet humor circa '05, feels forced and cringy more often than not.)\n\nIf you're thinking of playing or buying this game, by all means, please try the demo. But stick with it all the way to the end. Progress can be passed over to the full game, and to be honest, you'll probably have to restart at some point anyway so whatever. Don't be swayed by the nice graphics and the very competent presentation, because otherwise you might realize that this game is way too unpleasant to play by the time you can't refund it anymore like yours truly.\n\n4/10.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "i really wanted to like this game. for the first 20 hours or so, it actually was pretty satisfying. (excuse my hour count, i played quite a bit of it while offline.) a friend recommended this one saying that it was as complex and insane as dwarf fortress. at the time, that sounded so awesome that i simply had to take him up on it.\n\nwhen my review was positive, it talked about all the crazy things that had happened as i was starting out. the pet cat being an alcoholic, receiving a quest to deliver a rather valuable but extremely heavy game table which basically *forces* you to commit mail fraud, etc etc. many people have already talked about such stories. and don't get me wrong, it genuinely was funny for a while!\n\nthe problem is that dwarf fortress's insanity is baked into the game itself, whereas elin's insanity is a collection of one-off gags that eventually grow stale. \"the quest asked me to deliver what?!?!\" \"i can, ahem, 'watch birds' with a drunken noblewoman on a street, and that's 20% as bad as just eating cat meat?\" \"lmao, what did you say this person's age and gender were?\" but eventually you stop paying attention to the 20-ish lines of dialog or whatnot from the random civilians, and the quests become the same old thing repeatedly. and all that's left is the gameplay.\n\nit's a total grindfest, basically. i once said that \"it's OSRS if it was honest about being a nightmarish capitalist hellscape,\" which is unfortunately more true of the core mechanics than of the game's setting. some people vibe with that, but there are better uses of my time... after the honeymoon period of setting everything up and growing out of weakling status, it devolves into visiting the same presets of dungeons over and over, travelling between a few towns and handling their quests over and over, praying that you can find something to make your plots of land ever slightly more useful. base building in particular takes a LOT of time, with a number of essential recipes locked behind randomization. beyond a certain point, your rate of income becomes basically linear (or at least, pretty hard to expand into a respectable amount). this becomes a problem when important items are worth hundreds of thousands, while you are making just thousands at a time and it is competing with the steadily-growing taxes.\n\nthe aforementioned \"dwarf fortress levels of insanity\" are really just the limited number of tricks you can use to counteract this tedium, taking advantage of completely randomized object composition (beach ball made of dark matter as a quest reward...) and the fact that almost all creatures in the game behave similarly. humans can have eggs, and you can have conversations with livestock. \n\nbut, again, there's only so much you can do. the combat system is click, click, take advantage of ranged weaponry, pray you don't die. the enemies become beefier but your strategic options don't expand much to counteract that. in particular, the magic system was really cool with how you can collect different spells to defend yourself or teleport out of harm's way. until 30 or so hours in, when you've collected nearly all of the spells and realized they *don't* gradually become more complex to help deal with advanced threats. also, some combat mechanics are quite annoying with few ways to defend against. you can pour water on yourself to protect against fire, or focus on finding acidproof equipment. but there is NOTHING you can do to prevent essential equipment from being shattered by frost, other than buying coldproof blankets, which aren't cheap.\n\none more minor thing, there's a pretty significant tonal dissonance in this game. i mean that there's a pretty jarring contrast between the supposedly serious story and the often ridiculous, sometimes questionable, backer-suggested content. i guess some people weren't content to make a mod, lol. but this isn't a huge issue. in fact, the insanity would be welcome if that was properly, continuously reflected in the game itself.\n\noverall, it's decent but not mindblowing. i wouldn't bother if it's not on sale. fun for a while, but you might be making a heck of an effort to see the late-game content.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is going to be a challenging review to write because while I cannot in good conscience recommend this game, I do plan on continuing to play it a bit longer.  This is a game that balances several different genres, from farming sim, to gathering/crafting town building sim, to random dungeon crawler.  None of these systems are done well.  Okay, maybe I should clarify here: if the designer/developer is trying to faithfully recreate the experience of playing a 25-year old web browser-based MMORPG, then they have succeeded.  I find that, ultimately, that's the charm and appeal of this game.  The problem is, you have to watch YouTube guides to figure out what to do, and the payoff is building a stone table or just completing a dungeon run.  I can't help but think that the game could still retain that \"low-fi\" aesthetic but have much better learning and progression curve, UI, fluidity, and excitement.  Overall, there is a demographic that this game will absolutely appeal to, but if you're not in that demographic, there are probably better games to try first.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "this game ruined my life because how addicting it is so i have to uninstall or else ill become a broke homeless shutin living in a tiny studio . its really good so i put thumbs down because it will actually genuinkley ruin ur life its so addicting like drugs i canjt stop its like s*x",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Contains pedophilic elements; In the world gen settings there's an option to limit character's ages to 13, the game also gives you 3 options for a companion: a dog, a cat, or \"a little girl\", and I'm sure many more questionable things if I continued to play instead of refunding it.\n\nWeebs continue to prove my theory that they are all pedophiles",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game starts out really fun and once some of the issues are resolved it will be an amazing rpg. I enjoy the concept it reminds me a lot of the original Ultima online with the way growth is handled. There are some serious issues though. 1) Food - difficult to obtain and is very important to have. 2) Familiars are a complete mess, they run off on there own and die so easily, even if the setting say stay by your side. 3) The penalty for dying is excessive and is very off putting to the casual players. 4) The progression between days is very fast. 5) The generation of garbage is confusing on why is this animal crossing?  I am very excited and high hopes for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has very offensive, secluded community and they defend every bad decision of the developer.",
      "voted_up": false,
      "votes_helpful": 3
    }
  ]
}