{
  "positive": [
    {
      "review": "[h1][b]Ultimate Once Human Review — The One You Actually Wanted to Read[/b][/h1]\n\nI downloaded [b]Once Human[/b] expecting a casual survival experience…  \nInstead, I found myself fighting a refrigerator with legs while my friend was screaming about cosmic butterflies.  \n[b][i]10/10[/i][/b] already questioning my life choices.\n\n[quote][i]But let’s be serious for a moment — this game is weirdly good.[/i][/quote]\n\n[h2][b]Gameplay & Progression[/b][/h2]\n\n- Level cap is [b]50[/b], and yes, you can hit it in around 3 weeks even if you play like a normal human and not a sleepless gremlin.  \n- Grinding? [b][i]Illegal levels of easy[/i][/b]. Electric tools basically gather everything for you in 0.5 seconds.  \n- Dungeons, Silos, and elite enemies usually drop what they promise within a few runs.  \n- Best loot? Just solve a simple puzzle — sometimes as easy as taking a picture of a statue.\n\n[h2][b]Building & Base Life[/b][/h2]\n\nYou can build a [b]modern house[/b], a [b]fortress[/b], a van-home (mobile depression unit), or even a mini-castle.  \nAnd yes, you can move your entire house like it’s a USB flash drive.  \n[i]Peak technology.[/i]\n\nEach region has its own resources — deserts, jungles, beaches, islands, mountains, swamps, valleys.  \nTryhards take the resource-rich areas, casual players take the beautiful ones.  \n[b]Perfect balance.[/b]\n\n[h2][b]Tech Tree[/b][/h2]\n\nEverything you unlock actually matters: farming, weapon tiers, electricity, crafting machines, and even the cursed gacha machine.  \nIt looks complicated at first but gets easier as you progress.\n\n[h2][b]Weapons & Combat[/b][/h2]\n\nPlay in third-person or first-person.  \nEarly enemies walk slower than my grandma, later ones actually try.  \nWeapons come in two types:  \n- Looted → you disassemble them  \n- Crafted → you invest in them\n\n[h2][b]Familiars (The Real MVPs)[/b][/h2]\n\nYou can have helpers that farm for you: bowls, onions, teddy bears, cats, balloon dogs, fairies, black holes, energy orbs, and even killer bunnies in suits.  \nThey work while you’re offline. Who needs real friends?\n\n[h2][b]Monetization[/b][/h2]\n\nBattlepass is the only thing worth paying for, and even then it’s just cosmetics.  \nGacha uses [b]in-game currency[/b], not real money. Bless this system.\n\n[h2][b]Story[/b][/h2]\n\n99% skippable.  \nThe environment explains the world better than the dialogue anyway.\n\n[h2][b]The Bad Stuff[/b][/h2]\n\n[spoiler]  \n- Building on slopes will make you doubt reality.  \n- Trading system is… “creative.”  \n- Bugs exist — some funny, some annoying (like when bosses refuse to spawn).  \n[/spoiler]\n\nBut the devs are active, communicate well, and give rewards whenever they mess up — which already makes them better than many billion-dollar studios.\n\n[h2][b]Final Verdict[/b][/h2]\n\nOnce Human is chaotic, creative, stupidly fun, surprisingly deep, and way more polished than a free-to-play game should be.  \nIf you enjoy exploring weird worlds, building cool bases, and occasionally screaming at sentient household appliances — you’ll love this game.\n\n[b][i]Highly Recommended.[/i][/b]  \nWould fight cosmic butterflies again.\n\n[i]I played this game on two different Steam accounts, with a combined total of around 640 hours of playtime.[/i]",
      "voted_up": true,
      "votes_helpful": 88
    },
    {
      "review": "Summary: Great game for loot hoarders and base builders. It however contains predatory money practises. example: you see an outfit bundle worth 3380 of premium currency [irl money] but the only top up options are 2280 and 3880, this means you have to buy more top up than you actually wanted to. unfortunatly this is echo'd throughout the store and its not the only predatory practise either. if you are a publisher reading this? cut that stuff out..it will only prevent new people joining the game.",
      "voted_up": true,
      "votes_helpful": 38
    },
    {
      "review": "Good game, doesn't run too well on linux though, but still a good game.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "Once Human ended up being way more fun than I expected. The world is weird and stylish, the combat feels punchy, and exploring for loot is super addictive. It’s one of those games you hop into for a bit and suddenly hours are gone. Definitely worth trying.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Frankly a good game for its price (0€). \r\n\r\nIt's buggy but playable. Only thing I would point out is the amount of information you have to deal with! It's like the team couldn't choose the game's genre so added a bit of everything and it just doesn't work...",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "gameplay is great and fun to play",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "“Staring at the stars and I keep finding more\r\nBreaking through the darkness shining brighter than before\r\nYou're the northern lights I keep on chasing\r\nYou're an ever-changing wonder to explore\r\n\r\nOh my heart is aching but I finally found a cure\r\nIf you're a breaking wave maybe I could be the shore”\r\n\r\nThese lyrics perfectly capture the vibe of the game. The game itself gives you a nostalgic feeling even while you’re playing — like a déjà vu dream you keep coming back to. The visuals are stunninggg and make the whole world feel like a strange but beautiful dreamscape.\r\n\r\nAnd honestly… who here has fallen asleep and ended up dreaming about being in this game? Because I have. My friends have too. It just sticks with you, like “kabiyak ng ating gunita” kind of way. It is the kind of game you keep thinking about even when you’re not playing. Don’t even deny it, I know you agree!!! HAHAH\r\n\r\nIf you feel the same way,\r\n💗 Please nominate Once Human for the Labor of Love Award! They absolutely deserve it. 💯",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I love the mechanics of the game, although it lacks new content. Hopefully, they will make more content in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game while leveling. Once you hit 50 and or finish the missions.. There is nothing but destiny game loop. Replay same things over and over and over to upgrade for the next reset. Repeat. I really like the leveling and farming. You just run out of a reason to to do it. If only this game had more maps being added or more game modes.. Good game to give you something to do while you try and find the next thing to play lol.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been playing for a long time now and the game has grown significantly. It's been a great journey and i'm thoroughly enjoying every day. have a go and see how you like it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h2]Getting into it[/h2]\r\nIt’s a strange game at first, but once it clicks there’s a lot of fun here. I’ve put in around 254 hours and even after taking a break, I know I’ll return. It has that “one more thing to do” feeling with building, exploring and upgrading.\r\n\r\n[h2]Style and world[/h2]\r\nIt’s clearly an Asian-made game and the aesthetics are great. Outfits, weapons and fashion actually look cool, which is something a lot of Western games forget. The world design is weird in a good way, with creatures, biomes and bosses that feel memorable.\r\n\r\n[h2]Servers and progression[/h2]\r\nEach server is its own world with a story and time-gated progress. Join a fresh one if you can, older worlds get quiet near the end. The beginner world is easy but doesn’t have everything unlocked. Once you understand this system, it makes more sense and gives you clear goals to work toward.\r\n\r\n[h2]Gameplay mix[/h2]\r\nYou get a bit of everything: shooting, crafting, collecting creatures, dungeons, base-building and exploring. Building is surprisingly fun and some players make insane designs. Bikes and cars make travelling feel fast and satisfying. There’s also a permanent world where all your progress carries over between seasons.\r\n\r\n[h2]Quick notes[/h2]\r\nCombat can be a little simple at times and some systems can feel messy until you learn them, but overall it stays engaging if you like upgrading, looting and creating your own base.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is literally sum up of pokemon + rust + genshin. They incorporate alot of element from other games into this one game. Seems fun at first especially with friends. But the content kind of get into loop lately. Typical grinding game. Can easily get burnt out if you play solo, but everything changes if you can adapt with the community. The endgame evolve around min maxing the stat of your builds, hunting perfect deviation, and build your perfect home. Hope the dev will keep bring new content instead focusing too much on skins. So this game can maintain their relevant. The review above is all based on PVEs experience, haven't tried the PVP server before. So I can't elaborate much on PVP full pledge server aside from the PVP mini game/ the cargo.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Repetitive but I don't find it boring. This was a game I open only to pass time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "===[ Player Type ]===\r\n☐ Kids\r\n☐ Everyone\r\n☑ Casual players\r\n☐ Pro players\r\n\r\n===[ Graphics ]===\r\n☐ Potato\r\n☐ Really bad\r\n☐ Bad\r\n☐ OK\r\n☐ Good\r\n☑ Beautiful\r\n☐ Masterpiece\r\n\r\n===[ Costs ]===\r\n☑ Free To Play!\r\n☐ Wait for sale\r\n☐ Average\r\n☐ Refund it if you can\r\n☐ Don't do it\r\n\r\n===[ PC Speed ]===\r\n☐ 90' PC\r\n☐ Minimum\r\n☐ Medium\r\n☐ Fast\r\n☑ High end\r\n☐ NASA computer\r\n\r\n===[ Difficulty ]===\r\n☐ You just need 2 arms\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Hard (first few hours)\r\n☐ Dark Souls\r\n\r\n\r\n===[ Gameplay ]===\r\n☐ Really short ( 0 - 2 hours)\r\n☐ Short ( 2 - 8 hours)\r\n☐ Few hours ( 8 - 12 hours)\r\n☐ Long ( 12+ hours)\r\n☑ Endless ( + updates + events )\r\n\r\n===[ Story ]===\r\n☐ It doesn't have\r\n☐ Still better than Twilight\r\n☑ Average\r\n☐ Good\r\n☐ Fantastic\r\n\r\n===[ Issues ]===\r\n☐ Game itself is one big BUG\r\n☐ Bugs destroying the game\r\n☐ Lot of bugs\r\n☑ Few Bugs ( Randomly get stuck and see through walls )\r\n☐ You can use them for speed-run\r\n☐ Nothing\r\n\r\n===[ Modes ]===\r\n☑ Multiplayer: Yes\r\n☑ Single-player: Yes ( But its still a MMO )\r\n\r\nOverall this game is really great. Not many MMORPG Shooters out there that are still doing good. I seen A lot more MMORPG coming out with the same elements to Once Human like Where Winds Meet. I love how those two games are action based MMORPG not just a push a button do a attack skill. You have to click and hold or double click hold double click to do a type of attack. That goes for Both Once Human and Where Winds Meet. Both are amazing games. 10/10!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun, free pew pew game and it's not p2w, just cash shop items for ~~aesthetique~~. i really love the base building in this game as well. highly recommend if you can get past the season wipes",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the concept of the game, post apocalyptic... with character creation, house/base building\n\nPlaying with friends makes it so much more enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good gameplay, the grinding is pretty fair, and resources are abundantly available, so that isn’t an issue although the most frustrating part of the game is definitely the multiple layers of RNG involved with Mods. Other than that, it’s pretty enjoyable if you’re playing with friends and partner and just want a casual adventure and some fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Highly Recommended game if you want to chill and have fun, the game covers a lot of variety covering most of the player styles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game but if V pops into existence to tell me my health is low while I'm fighting for my life one more f&$king time I am bringing him into existence Code Lyoko style and eating him for dinner",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun game and a lot of content love the big map and amazing graphics  7/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "El juego es hermoso, te relaja a mas no poder, si quieren dedicarle a un juego que sea a uno tan interesante com este.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "(I'm not the best at writing.)\r\nBest free game ever I never really liked open world type games but sense this is open world apocalyptic survival game where you play has a meta human and you can choose to do the story or do your own thing like focusing on leveling up or base building or better gear (there are 5 tier, tier 1 needs level 0 tier 2 need level 10 tier 3 need level 20 tier 4 need level 30 and tier 5 you guessed it need level 40.) you can get cosmetics to cover your gear so you can look cool and be strong instead of looking goofy and being strong. the boss fights are kinda mid but still good and hard.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I want to say yes and now to this game. Its got eh bones to be something good but there's A LOT  of jank that makes it difficult to play at times. like why am i level 22 but im stil getting 23 tapped by a silent lvl 5 zombie? i have upgraded clothes etc but they make no footsteps no warnings etc. Also randomly when mid battle a tutorial will pop up and the game doesn't pause while that happens and you'll just die in the menu/ cut scenes. there are follow missions were the nps promis rewards or to heal you give you ammo etc and they don't do bubcus cept push you stand in your way fighting enemies and you cannot retrieve the so called assistance they promised. there's also about 500 menus to look though its not very streamlines at all",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great balance between chill and grind/endgame. Getting started might be slow, but you do not need endgame stats to complete every single thing in this game; you can do most of them solo. There's a lot of different builds that can keep you occupied. The devs also seem to care for the game with weekly updates, but there are glitches still in the game for months now that do not really negatively impact the experience. Game is fun and no pay to win.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games to play when i want to spend times with family and friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun game, lots of solo content. You can play at your own speed and just enjoy the story and lore of the settings. I have a great time just playing alone and wandering the world. Would definitely recommend it to anyone looking for a laid back game with interesting world building. Reminded me of the secret world and fallout 76 in some aspects.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A deep and engaging survival experience with fantastic base building and satisfying weapon customization.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is completely F2P but the cosmetics do cost money. It's a great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I think that the game is extremely beautiful, smooth gameplay and an atmospheric world. The only thing that keeps me away from this game, is that you can only play online, and that isn't really what I expected. And I would love to see a single player mode.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☑ Beautiful\r\n☐ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☐ Very good\r\n☑ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☑ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☐ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☐ Workable\r\n☐ Big\r\n☑ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☑ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☐ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☑ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☐ Long\r\n☑ To infinity and beyond\r\n\r\n---{ Price }---\r\n☑ It's free!\r\n☐ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I heard a lot about this game from my friends and decided to give it a try. Now this review is for people who have a SteamDeck like me not for people that have a PC. Now with that out of the way it a good game but sadly it doesn't run that great on the SteamDeck even if you turn down the game to (Very Low) settings. I watch some video's on YouTube to see if there was something I miss or something else that I could try and help it perform better on the SteamDeck. Sadly nothing did help I hope the makers of this game do make some improvements to the game so it runs better on the SteamDeck. Still giving the over all game a thumbs up because it still a good game and worth playing and just because the SteamDeck Can't run it smoothly doesn't mean this game should get a bad review. Thank you for reading.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have put quite a few hours into this game and is one that I keep coming back to over and over again with friends and solo. What I like most is it seems the devs actually encourage and listen to feedback and implement changes from it. The game scratches my itch for shooting things and building things and exploring all different types of gear and territory builds.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Currently the best PvE looter shooter base builder creature farmer game out there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful game, great crafting options. The best way is to play with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As of writing this review, I've logged a total of 10.4 hrs in this game, with 8.5 of them being today. This game is pretty fun so far. I've had one moment of frustration, but I realized pretty quickly it was my own error in judgment that caused it, all in all, I like this game and will be playing more going forward.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably one of my favorite survival games. Honestly, it gives me the fun of something like Rust, but without the stress of losing all my progress just because I had to step away. It strikes a perfect balance between challenge and chill. I love that there's weapon build crafting and almost RPG-like leveling, so exploring feels rewarding in ways beyond just gathering resources",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its such a great game and i must say ZERO pay to win that's rare these days.\nIf you wanna look pretty you pay for it.\nYou wan't your base to look pretty you pay for it and yes its expensive.\nBut in the end buying a new game cost 80 euro to nowdays and you will probably have less gameplay hours on that game. \ni'm a day 1 player and i am in it now for like 1200 hours and still having fun ^_^\nSo give it a chance its 1000% worth it thank me later.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lololololololol very fun game\r\n\r\np.s. i dident know what to write",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I suggest that new players start in Novice first. Once you get the hang of things, this game is pretty fun. Many themed servers to choose from. Many different types of events are going on. The devs take our feedback and apply it where it applies. They fix bugs as soon as they are able... Doesn't take months and years to fix stuff.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game with so much to do. Enjoy playing alone or with my boyfriend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun gameplay.\r\nI enjoy all aspects of this game, the shooting, the building the farming, and the challenge to keep going and upgrading weapons and armor keeps this game going for me. The more you play/re-play the stronger you get.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Once Human is a great survival + shooter game. Performance is good and gameplay is fun. I like the map and base building system",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "For  F2P game its pretty decent, my only issue is the constant bug that break controller support ( I know controller on pc heresy ! )  but besides that if you like base building and raid bosses this is the game for you. I suggest starting on the novice server then moving to the regular servers to get your bearings with the game.   8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game to play when you don't know what to play, don't be scared of the F2P systems, ive only spent money on a skin everything else is free progress.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it but after doing so many scenarios it gets a little too repetitive so I'm glad they introduced permanent server option :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is addictive, once u get the knack of it. Have Fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This scratches an itch that i cant find with other games. There is a lot of content available now with the multiple scenarios they've added, i've been playing the same character since i've started across multiple servers. I recommend it lots of fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far it is a interesting game. There is lots to do and its not to complicated so far. The visuals are good and some of the weirdier stuff is funny.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far great game. Lots to do. Not overly complicated. Great art style, fun and scary at the same time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The combination of rpg elements, character development, and structural/base development allow the player to be able to customize to their suitable play style and creativity, which i vastly enjoy.  The server specific scenarios present different situations to combat and that is unique to the game, and i have not seen that lately compared to other games.  Needless to say, i am coming from Console , which this game is not on yet.  The story is a bit short and the time ive been on this game, i have seen many \"veteran\" players complain of boredom due to lack of content, but i feel this game is still in its infancy. Look forward to what is to come.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is one of the best survival games on the market.  Super fun world and the combat is amazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "u juego muy in teractivo es muy bueno me gusta mucho aunque la istoria no tiene mucho a parte pues es taen ingles pero fuera de lo minimo me encanta este juego lo juge casi desde que empeso y me fscina mucho la explorasion y interacsion con mas jugadores",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "free fun game the the feeling is unmatched. cool design of creatures scp lore and what not",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fun, beautiful looking map/graphics. 100% recommend!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sticking a new player in the game already at lv 50 without explaining the game, what to do, how to level etc .. I want to build my character from level 1 up , not already be at a high level from jump, You have no weapons  or cloths at that, like come on really.  The game it's self is nice , but I hate  things like that. Don't put a new player in a freaking game and start them out at  high level , without really showing them the ropes and giving them a chance to build up there character. I can careless about pvp or what season the game is in or whatever. I'd rather play a casual version and not all these different ones.....Not my style, I don't even know how to start at lv 1 if I wanted to. The hell type of crap is this ...So Frustrating",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have spent so much time in this game, to the point I have 7+ characters on perm servers. The fact it's f2p is great, but I am a skin whale and buy a ton of the skins. It gives me rust vibes, but I can make everything pretty instead.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Highly recommend this game, not only is it free to play but each season brings a new grind with new challenges. This isnt some pay to win, you get all the deviants, mods, weapons, and armor by simply playing. There are constant updates and events that are entertaining and keep the game fresh. I wish the cosmetics had better drop rates and some of the outfits looked better but overall I am very satisfied with this game and I plan to keep playing it for a long time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Every time I log into this game, I am amazed that it was free. The graphics and game play are smooth, and the story line is a pretty good one. I am an older gamer, and getting the hang of the key-binds was a little challenging. The community is super helpful, and there are small notes all over the world giving hints. I have recommended this to every gamer that I know, and I would highly recommend it for everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I play mostly solo, in such a setting the game is very atmospheric. Guns feel responsive and satisfying. Highly recommend trying.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a free to play MMO this game is exceptional in terms of quality.  My wife and I have been playing it the last week and it has been a lot of fun.  It reminds me a lot of Secret World but with much better graphics and gameplay.  The world building is very good, I highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun to play with friends! Very engaging & addictive\nContent is rich \nGraphics are amazing\ndespite some bugs and a few performance issues that are always being fixed, the game is worth the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Has all the good components of Fallout 76 (scavenging, exploring, survival, events). But its a lot more fun. Its very buggy, especially on controller, very badly explained information and cluttered a.i.\n\nBut it has a ton of depth, and charm.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When a freind told me about this game i was like ya i look at it . Thinking i would play it for a bit a leave it but after getting in the game with a couple of people i relised it a good game.  you can play at you own pace . They is a lot todo in the game the best part its free to play and you only had to buy the dlc if you what to it doest matter as you can play the whole game with out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "def worth a try, although it has its bugs and issues, alot of fun and enough content to keep you playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "games fun and vibrant with constant updates and events and crossovers, the only thing that can get annoying is events sorta being more of a... you do it and you're done type thing, as most events end and the stuff becomes obsolete or null outside of cosmetics, and a lot of the games events involve monthly level resets when you take into them, which for some is fun yeah, for others it's annoying, so take it as it comes with a grain of salt, and grain of sugar both.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Verry good game, plenty to do. good verity of cosmetics and other custom gear. although if you started playing on your phone then try play on pc/ steamdeck you will loose all cosmetics even paid ones. i wouldnt mind redoing the stories but have give up due to loosing all cosmetics that had been paid for. i have tried linking all posible acounts (steam, google, netease, ect.....) please help me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Thios is by far one of the best and most intense games I have ever played. I love the graphics and the building, along with the attention to detaail, when it comes to weapon mechanics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun with friends, people are friendly and supportive from my experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Third Person Survival, Crafting, Looter, Shooter that isn't Pay to Win, doesn't constantly pressure you to buy things like speed ups or unlocks and doesn't have a cash GATCHA system... Yes, Please.\n\nPS. Adjustable titty sizes.\n\nenjoy playing it and am excited to see how far the game will evolve 8.8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay, visuals, combat, and building.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I started playing this game before it came out and I tell you it is by far the best I have played so far in terms of survival, shooting, third person, gathering, farming and construction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let me say from the start, the game is Free to Play - So worth trying it anyway.\r\nIf you like survival, shooters, coop and base building then this game is a must to try/play.\r\nAs can be seen from the hours played, it can really grip you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. While it has glitches and bugs, for the most part, it has charm.\n\nOne of the BEST parts of this game is it's building. It has one of the BEST building systems I have seen in a survival game. More games need to implement the Flight Camera for building.\n\nThere is definitely a Meta for builds, however. I'd love to see them buff other builds to make things a bit more unique, such as Bounce or Fortress Warfare. Currently everyone I have seen runs the same build. \n\nI do hope they increase the number of Hivemates soon. 8 seems really low.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As a casual survival player that prefers to take his time to build out his base, I am enjoying this game a lot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome, super interactive and even better to have fun with friends, totally recommend it!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game different game modes and challenges. \nhas its up and downs in every mode but they work on improvements so its good.\nonly negative thing i would say of the game is the cosmetic prices and buildings other than that its quite solid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, with a story and base building. I like the base building part the most.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game since release, has everything I love in a game. Building, pets, looting, bosses. You can go about your business or there's loads of quests to do. Really does have something for everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A deeply emmersive game with many options of gameplay, survival, PVE and so much more. a little difficult to keep track of where to redeem and what to spend rewards and recourses on because of the multitude of options. and if that wasnt enough the visual style and story concepts are utterly captivating.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once Human is a lot of fun, with survival-crafting that is simple and accessible, but still rewarding to dig into. Building a house is amusing, even if pieces aren’t always cooperative about snapping together in the right orientation. And while the combat is generally pretty basic, the grotesque weirdness of the monsters more than makes up for that, especially when you get a menagerie of weird little creatures of your own to fight with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Neat game. Piles of stuff to craft and it makes sure that ammo is never an issue, I hate survival games that make ammo precious............. Shoot em' if you got 'em. The pet / deviant system is really cool too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, ever since i started playing which is not long ago, i couldn't stop playing it haha :) \r\nI already nominated it for Labor of Love :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really awesome free to play game where the only money that needs to be spent is for cosmetics or a battle pass. I played for many hours without spending a single cent. However, because I had so much fun and thoroughly get so much enjoyment from this game I have spent a few dollars here and there on cosmetic items. Not because I have to, but because I wanted to support the devs because this game is truly fun. There are skimpy outfits all the way to fully tactical, everyone can wear what they want without any complaints. You wanna be decked out in a cute pink outfit with a pink assault rifle go for it, you want to go full tactical with a sniper rifle and handgun rocking military grade armoring, go for it. It is so chill and relaxed despite the content material seeming high octane. Sometimes I just work on my house, sometimes I just wanna scavenge and shoot enemies; hell sometimes I just wanna drive and listen to the radio exploring the scenery. It is truly a wonderful piece of work. HIGHLY RECCOMEND THE GAME, it's free, just give it a shot, put at least a day into it then decide if it is for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really nice gameplay, amazing environment and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a decent survival game with a cool weird-fiction aesthetic. The monster designs and world are intriguing at first. But it falls into the trap of being \"yet another survival craft-'em-up.\" The gameplay loop gets repetitive quickly, and it doesn't really do anything new or better than established games in the genre. It feels a bit janky and unpolished. Might be worth checking out if it goes free-to-play or has a massive content update, but for now, it's skippable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really nice an fun game. A bit repetitive but it's okay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After playing this for over 200 hours I still really enjoy it.\nFor me the Palworld combination wasn't really necessary, but you can just do your own thing and skip it so thats fine.\nI can really recommend it, at least to try it out and see for yourself.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El juego es como Fallout 76 o sea me refiero a que es un MMO de muy alta calidad ya que aunque fallout 76 fue malo en sus inicios despues se convirtio en un juegazo. Las batallas con Jefes son genialesl La mecanica de construir esta genial. Las misiones secundarias son inesperadamente buenas. El sistema de colmenas y clanes esta muy bien hecho. El juego solo se equivoca en crear varios modos de juego o sea raid zone. Ya que si ya existian los servidores PVE y PVP no habia la necesidad de inventar nada mas. Esto divide la comunidad en los que gustan en competir y los que lo odian y por eso cada servidor esta bastante solo, por la cantidad que hay. Eso divide a la comunidad mejor decision seria que hubieran menos servidores con mas gente por servidor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great community. Devs are very good at listening to the players and giving to them what they want (within reason).\nNot a big learning curve for new players. Different scenarios to go to whatever your cup of tea. Large areas to explore. Base building is a blast.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have to say that I find this game very fun!  While it can admittedly be a bit confusing in the menus and starting up, the gameplay is fun and I enjoy exploring and finding deviants and loot.  Huge props to the devs!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever! ...y la mejor comunidad! Como recomendación es conveniente crearse un personaje en un server permanente, sino tenés que volver a subir y mucha gente abandona el juego por eso, tiene un montón de contenido para hacer acompañado o solo (si te gustan los survivals de construcción y farmeo).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Once Human is one of those games that goes from “pretty good” to “absolutely wild fun” the moment you squad up with friends. Solo, the world is mysterious and eerie—but with a group, every weird monster encounter turns into a hilarious story, every base build becomes a team project, and every raid feels like chaos in the best way.\n\nThe game really shines in its co-op mechanics. Exploring the open world together, splitting roles during fights, and pooling resources to build something cool gives you that perfect mix of survival challenge and goofy moments. Half the time you’re fighting off bizarre creatures, and the other half you’re laughing because your friend got launched into the sky by something that shouldn’t exist.\n\nIf you’re looking for a game where the fun comes from the teamwork, the shared discoveries, and the absolute madness that happens when friends jump into a supernatural sandbox together, Once Human nails it. It’s not just a game—it’s a group adventure. Highly recommended if you’ve got a squad.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire game, you have to play a lot for cool weapon and its fun with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun and smooth gameplay. Have not ran into any probs running the game, and having a blast while playing it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Ah! Another how to ruin your life simulator. [/h1]\r\n\r\nThe game is good and the fact that it is growing and improving makes it more impressive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Exciting and impressive creature design. Even though it’s a free game, the ongoing updates make it excellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a very good game. it has jump scares and dungeons. it is far better with friends as then more chaos ensues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "800 hours of my life..... games good overall id say 7/10. Its a great time killer. Its grind has been reduced by quite a lot with recent changes. Cosmetics are worth it to a degree. Devs are constantly improving base building to make it less infuriating when trying to make interesting houses.\r\n\r\nAnimal taming is fun, farming Wolves, Leopards for rare patters to flex on plebs is a great feeling. However since its F2P.... toxicitiy is just an expectation / bingo card game. Racial slurs and names all the time.... its w/e in reality.... but dont be shocked to see it.\r\n\r\nOn the bright side... for the most part most of the Vet players are more than willing to help, give tips, hook you up with cool stuff on occasion if you ask nicely. \r\n\r\nOverall again.... 7/10 for sure, The devs need to give us the full map to play. Endless Dream is like.... Endless Dog sht and most would agree with that sentiment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've only been playing this game for a few days and its a breath of fresh air. The community is amazing and I'm never bored. There's so much to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good free game, probably one of the best on Steam, building mechanic was better than expected. PVE is super easy, pretty underwhelming but it's nice while youre learning the game",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Great game but support is shit!!! 11 days and still no response from Emails (11/25/2025). \r\n\r\nWhen you go to their store (web) you can't associate your STEAM account when you go to it. ONLY if you download their NON STEAM version of the application and use their own game launcher. Then you can associate your player (UID) by it. \r\n\r\nYou buy a server from their website and it doesn't send you an Email or confirmation or how to set it up! It just assumes you are going to go into dedicated sever and know what you are doing.\r\n\r\nThey need to globalize players so they can see each other. We have friends in Europe that have to change to the \"area specific\" region to even play on the dedicated server. Things like this are so 1980's  and need to be addressed.\r\n\r\nChange up or randomize the drops. You know exactly where each drop will be based upon the build!!! For example literally every red pickup truck on the road has a \"cache\" in it, On a certain house you know a cache will be between the set of stairs. If the building has stairs, climb up and go to the kids room and there will always be a \"cache\" there.  Again very 1980's stuff. \r\n\r\nFinally, I understand the game is free but charging $50usd for clothes, or non assembled home and such is outrageous. You will sell a million times more items by making it cost effective!",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "If only the devs would put their efforts on adding maps and content to keep the players engaging this would be the perfect game for everyone, but instead we are getting all the effort and focus on the loot crates because that what brings them money and we have people who want to horde everything and spend their savings to get every loot crate items, It's genuinely sad how they even present the loot crates with such cinematic scenes that we dont get even in the story mode.\n\nYes I played the game for over 1000 hour, did all of Starfall event, Lunar Event, Palworld and whatever, did all scenarios, except the pvp ones, still the count of players id dropping for the reasons I mentioned above, and by no means justify the developers practices.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "A boring and subpar survival game where you get to pay for assets stolen from other games and developers",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Game looks great and runs smooth but it’s dead and boring. When you do get into a match, it’s just full of cheating.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "EDIT: apparently the data reset is optional, but it is basically forced since you cannot have any new updates unless you submit to the reset. Also, my hours will go up from my review because my girlfriend likes this game, not myself. My opinion still stands.\n\nYour data resets every \"season\" and goes to a place called Eternaland. You go back to level 1 during this reset no matter what. You can get your house and what was in your inventory if you grind for it, but since you start back at level 1, you level 20, 30, or possibly better things can't be equipped until you progress back to that point, which, at that point, may not even be worth the grind.\n\nI love the game, but once I found that everything resets, I lost my motivation to play the game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I CANNOT recommend this mess of a 'game'.\nI started it with a friend, expecting some online survival and instead we were introduced with two DIFFERENT tutorials (he got a different one that I did) and NEITHER of them explained ANYTHING about the ACTUAL game.\nWe then got to select a 'scenario' AFTER having played the two different tutorials where we honestly learned NOTHING about the game and because the server selection menu is horrid, we ended up in different servers.....\n\nFurthermore, after we finally managed to join the same server (which required us to create new characters), we then learned that majority of the servers are already filled with empty bases, meaning it was hard to find a place for us to even put down our own base.... And don't even get me started on the fact that if a character name is taken by ANYONE on ANY of the  servers, then it is gone/taken from ALL servers",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game really kinda sucks - just a derivative mess with terrible UI and to top it off? They steal assets from other games and sell them to players. Very classy.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is pretty good from a gameplay perspective. The combat is a basic TPS system, no fancy skills or buttons to click, just point, click, and loot. Guns can have 9 different effects attached with some variance on how those skills manifest. \"Dungeons\" and bosses are well made, and engaging enough. You can farm bosses (some in 28 seconds or probably even much less), but this only helps your progress until a point. The base building is okay (more on the bad side of that later)\n\nUnfortunately this is where the praise ends, and the tide of bull begins.\n\nThe biggest problem for me is that it feels like a cash shop with a game attached to it, rather than the other way around. Any game that demands $50 for a new building skin (which the default building skins are kinda fugly) or has egregious real money loot boxes registers to me as predatory, and I will never give them money and immediately has a short shelf life for me. None of the purchases have anywhere close to enough to being \"worth it\" for me to even do it to support the devs. If they had reasonable prices though, I definitely would spend tons of money on the game. Unfortunately that is not and will never be the case; they are whale hunters through and through.\n\nMoving away from the cash shop, there are also some problems with the gameplay. Bugs are VERY common. Camera glitching through the world, being unable to interact with anything due to getting knocked back during an animation, teleporting enemies and allies due to lag, and (most annoyingly to me), not being able to close a door you just opened and walked through due to your \"actions being too frequent.\"(note that also affects placing building objects. You have to place your stuff once a second, or else it will misregister, and can end up having to redo stuff). Edit: I've done more \"playing\" (more like wrestling their unstable game), and there are too many bugs to even want to type them up here. Just believe me, when I say they are everywhere, they are EVERYWHERE.\n\nAnother thing is that any kind of \"player helper\" be that deviants (basically pals from Palworld (called that crap before the crossover)), water catchers, ore miners, or logging camps all provide a pittance of resources, talking hours to produce what would take 5 minutes or less. I don't expect to be rich from a single mining platform, but for it to be not worth the space, power, or the massive eyesore it costs, when all three are relatively common is bad news.\n\nLastly, their level designs are sub-par for a game with this much investment. The world is great, but the placements of buildings and their contents are confusing, if not a bit funny at times. (laughing at you, Once Human, not with you)\n\nAll in all, another live service destined to be ruined by it's own greed. Despite that though, I have enjoyed playing with friends on a PvE server (PvP is toxic from what I have heard). Definitely recommend having friends to play with before getting into the game, otherwise just go play any half decent singleplayer game. It will be more cohesive, less annoying, and less demanding on your wallet.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It feels too weird, I never see anyone and entire game feels rushed. No wonder they needed a crossover.\n\nDo not trust this game at all! Warning to all players hackers are using an 'in-game' feature to try and add people as well snatch your Steam account, I've had several major issues and I need this game to get crushed out by the community. The devs have zero plans to handle these issues going on, if had to point a finger 100% they knew what they were doing with the feature and are just letting it happen. Stay away from this so bad!!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i waited a long time for this game only to be disappointed, this game as so many bugs and crashes i have given up the will to live to play it anymore. the hours i spent building my house and get in my resources i will never get back",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Would probably be enjoyable but I can't play keyboard and mouse for long and can't use a controller because it randomly turns off inversion while aiming at enemies. I also felt lost the entire time playing, not knowing what I'm supposed to be doing or how to do things. \"Pull out the butterfly, it'll help fight the Siren.\" Okay, how about you tell me HOW to pull it out? Not like I have time to experiment with how to do it myself when there's a giant radio tower thing attacking me with homing invisible bubble looking things. It's also easy to feel overwhelmed with the big menus/options and \"check-ins\". Not knowing what's permanent and what's deleted with the server adds to that stress as well. Just a case of 'this games not for me'. Will probably give it another shot if the controller issue gets fixed before the Palworld colab ends.\nEdit: Tried game again, now I'm being attacked by players while looking through massive amounts of options in the menus even though I've never attacked anyone and was put in a PVE server...Is this game unable to be just PVE? Are you forced to play PVP or something? I think I'm finally done with trying this game out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "neat for a free to play game, the story sucks and \"meta humans\" is also a stupid word",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I loved this game when I first started it, BUT after a while it gets repetitive and boring. \nThe weapon builds, and grind are okay. The base building is cool. The main story is short and once you finish it, very monotonous.The devs release expensive skins and outfits and rake in your money.  $$ While not adding to the actual game play at all. I have spent hundreds on this game and am now at the point where I regret it. \nThe pal-world update is cool and all but the thing that got me into this game was the creepy futuristic aspect and really hoped they would release new monsters to fight and new maps to explore but nope. \nHopefully they hurry up and release some new content and more of the main story otherwise I do not think I will bother playing it anymore.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great game but I never seen a tutorial tell me to do something without actually teaching me how to do it, had to search up almost every step. skill issue or not, not the proper way to start off for my first impression. The UI needs optimizing, my screen just looks like it someone threw up letters all over it, completely unorganized and ruins the immersive experience. Why is playing multiplayer very difficult? why should I need to switch worlds to play with others. the once human \"world\" system is confusing, unnecessary, and it makes teaming way harder then it should be. At least make clear to explain how everything works. This game has huge potential and I still do play it a lot regardless of the irritating flaws. I wouldn't give it the top notch pat in the back but more of a critique on what needs to be streamlined and improved",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Starry Studio aka NetEase Games do not care about this game. This is just another copy of a previous NetEase game in a new skin, build on the same idea on monetization, milking the customer (this is you the gamer). There is a good core of a game but it's all lost potential, getting people hooked just to abandon it and let the loot crate and skin factory take over. Such a shame.\r\n\r\nYes, this is a free game, you do not have to pay for anything but that does not excuse anything that is bad about Once Human. The game is shallow, lacking content, horrible performance on both client and server side, bugs/issues never addressed, poor customer service and so on. They do not seem to know themself what kind of game Once Human is suppose to be and where they want to take it. A free game can be monetized correctly and be great... Path of Exile is a good example of that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I automatically uninstall games where all the characters are pretty girls with revealing clothings. Basically virgin bait for microtransaction.... So dissapointed....",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "St00pid every 6-weeks reset game.  Some of us have jobs, lives, and responsibilities.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You guys ripped assets from no mans sky and placed it into a lootbox?? for shame.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "PLEASE READ!!!: i enjoy this game and will continue to play, BUT there is one huge problem. your character is tied to the server they're are created on. If you want to play on a new server, you must create a new character. When moving to a new server your character's progress is reset to level 1. i get it kinda. but i've been playing for 20 hours on a novice server since i'm new. but now i cant take my character and levels to a harder server. whats worse is the Cosmetics you earn is locked to that character in that server. So if you DO play this game keep this in mind!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game could have been great. I say so in the end game manner, it is great to play if you are just getting into it otherwise. I recommend a PvP server in case you do not want to play with kids, twinks, or older dudes. Especially nowadays vs when this game first came out, everyone tried it, and there was a diverse amount of people to meet. PvE servers are chill, not hating, these/those type of servers are simply better in a group, like most games imo. Cool to experience solo as well the first time too if that is your thing.\n\n After playing for almost a year straight (I also have up to 2000+ hours through the net-ease launcher as well), they simply didn't cater or listen to the right people, focused on the wrong issues while simultaneously not fixing the issues they address as well as can't/couldn't get their coding right for anything to work reliably in PvE or PvP in my experience. Never mind the cheats/hacks/exploits along the way. They cracked down a little on it, but I doubt it works reliably judging by how they have handled mass and minor player issues.\n\nMany times of saying a bug or this or that was fixed, and it usually wasn't, or re enables other bugs... I would blatantly try to test them after the fact and most would still persist. Also, when you shoot (idk if it is fixed but...) your bullets come out from behind the character model, so they are not leaving directly from in from in front of your gun rather and if you have a wall or are trying to aim up directly and have the ground in your background, you will hit that instead of wherever you are trying to lead with you aimer. Simple things like this never got/get fixed the entire 4 thousands hours in total or more I played almost every day for a year...\n\nI stayed for the PvP (and new content that always seemed half slapped together and buggy...) after basically staying up to date and getting literally everything they would release or change. But it got boring, I was sticking around for nothing to happen because they Devs Simply didn't/don't care. After consistently experiencing a bug here and there every minute or two paired with exploiters mainly at the time, having to compensate, wasn't amusing anymore, even for how engaging the game was once you got it down. At least that was the impersonation they gave to the probably thousands of people I met who now never touch it like me. They lost my support, truly.\n\nGame does not really have a theme now... Maybe on release with bare bones, but they took one too many steps in the wrong direction imo. Now you have flashy neon things in a post apocalyptic world and it gave/gives me too much sense/idea of something like the stereotype of Call of Duty being ruined including just ridiculous things that shouldn't even be there or don't fit with the theme. It is all over the place and overstimulating. I have ran into many people (even playing the game as well) who simply didn't care for it because there was too much going on.\n\nA shame gamers cannot have a reliable market nowadays from saturation in the market. The talent shows in your games if you can keep up with the needy gamers now, because it does call for it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "literally changed the game so much in the last 6 months i dont even know what im doing anymore everything is gone all my resources and vehicles",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Soulless and uninspired. Free is a fine price but time is money, and I’ll be spending mine on games that have much more passion than this slop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While yes this game is free so there shouldn't be a low expectation for the game to work, it is clear that the company only cares about creating more content for players to buy without caring about fixing the issues the new content is creating. \r\n\r\nThe game itself doesn't follow the core mechanics that you as a player are forced to follow. Actions of devices and controls work randomly and do not follow any sort of description supplied by the manufacturer. \r\n\r\nWhen filing suggestions, bugs and issues, the manufacturer does NOT acknowledge them, just sends an automated response and hopes that you don't look for any amount of follow-up. I have reported 73 bugs (with photos, dates, time of issue, etc., everything they ask for) and 39 suggestions and not once did I receive any notification or a response or a response at all.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Played this a few months after release, I really enjoyed it, but when Raidzone came out I non-stop played it with my friend and we had a lot of fun, but as of recently cheaters seem to be a lot more prevalent and we decided to take a break for a little while and when we came back the severs were dead and cheaters still seemed to dominate the severs. The problem is, is its not just the cheater, but the cheater will have groups where only the cheater will get banned and then come back to that same group on another account and continue to cheat with no real backlash. This game might find it well to adopt Easy Anti-Cheat or get more admin assistance.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fun. But the obscene usage of clown awards is going to earn the community a nice fat negative review. Then again, it's the average basement-dwelling MMORPG comm that do this stuff.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game is great. really, love it. amazing design, very good pve. pvp is insanely great BUT only if you have decent ping on your region, otherwise its meh, but still very good game.\r\nSo why downvote?\r\n\r\nYou cannot transfer cosmetics between different regions in Once Human; they are region-locked.\r\n\r\nThis is just stupid. its been this way since the game came out. No plans on changing it.\r\nAs a player who need to move to a different region to fix my ping, I cannot transfer my real-money bought cosmetics and items.\r\n\r\nThey are just trying to milk you on all of the regions seperately.\r\nThis is just stupid. As good as this game is, I hope it loses all of its player base until things like this one changes. If a company is not valuing your money properly, you shouldnt support them. not by buying stuff nor by playing their games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe I'm missing something, but every moment spent playing this makes me say \"why don't I just play PalWorld\". Once Human isn't bad, but it feels like my time is better spent elsewhere -- and that's not something I want to feel when gaming.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Once you drop this game, there's no way to return and play again, the developers just wipe accounts as hell, I've been played last time in December 2024, now it's November 2025 and there's no characters nor even my account that was bound to my email, they even don't have a support system so I don't know what to do so I just removed this game from my account.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "first off was a cool game when i first played it liked the story of the game was excited to continue following the story of the game. just recently tried to get back into the game HOWEVER when i tried to play all my stuff was gone everything from the lil homies i found to my clothes i am not a fan of this i grindded 65 hours to get the stuff i had and honestly if i knew there were wipeings i would of never got the game or wasted my time getting the gear i did have. the new scenario sign up is trash im a guy that enjoys the story of a game and it was taken away or at least it was hella confusing.  Would of been dope to keep all the stuff i had and continue the story.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is okay but I'm starting to get bored of it and the grind for my base just feels rough imo, also the gameplay is kind of meh and the audio is awful. I was on the map and apparently a bear was attacking me yet I heard nothing until I got knocked down. and I get shot from a enemy behind me getting downed yet I hear nothing behind me. there is a first person option in cars but it has no freelook and the turning with the wheel feels cheap, the physic's also feel terrible with the cars and you can abuse it when your stuck to get unstuck in a unreal way that looks broken. you also have a rough time building your base if you don't want to do the story a lot which makes unlocking the tech tree for your base more time consuming which I found annoying. also considering the amount of transportation options I've seen there isn't that many options of scrapped transportation on the road. the crafting also feels unbalanced, 5 logs for 1 charcoal feels dumb if there isn't a ton of tree's around you so if you get lets say 1-2k logs you'll only get like 1/4 of that or something in charcoal and it feels like such a waste of time after awhile because charcoal is a really important material in a lot of things from what I seen",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Yes its free, but they really need to lower prices, the world is struggling with cost of living yet they expect you to pull out £££££ for just an outfit,houses etc..lower prices and more people would buy..chests are in the same spots in same types of builds,,randomize it n make us hunt",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A huge potential in this game, but! \nThis is a good example when you have a good product, but awful management. \nIt also looks like netease has abandoned this game. This game needs an art-director, ideological team. \nThe devs spamming really bad gacha cosmetics with zero creativity and the only dumb aggressive rice marketing.\n This game becomes boring pretty fast, plastic world, nothing to do after reaching lvl 50 and closing all dungeons. The events are very boring and primitive, a huge lack of creativity again.  \nAbsolutely dead support even if you spent an amount of money on this game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pain in the butt to get on the same server as your friends. Super complicated. Graphics are great and looks fun, but if you are looking for casual and playing with friends. This aint it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A lot of bugs and kinda abandoned and lost the vibe, becoming trashy update by update. Play only if nothing to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love the paranormal vibe, the survival mechanics also are fine for... well, survival mechanics. The gameplay is... mediocre at best, but I've seen worse.\n\nBut every big update, the game asks me to replace my house. And the snapping is so terrible so I can't put it in the same place as before and it ends up floating.\n\nHonestly, this game has among the worst base building mechanics to ever exist. As much as I like the vibe this game offers, the actual gameplay, and worst of all, base building, require me to give it a negative review. Holy damn.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game started out great.... then they did the lead in to the winter season. What trash. Helping a music band have a concert? WTH. THEN they dug further with that whole mess with the winter season. No thanks. Uninstalled.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game no matter what I do stops at loading 100% without popping up the menu, im pretty tech savvy and even I couldnt fix it, I think it might be my system, wish they fixed it so others could play before adding new content",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I logged in had to sign up for a server logged in was put in a toutorial that gave absoulutly zero instructions and i seemed as if it was atempting to tie a surrvival type game with a story based game\niss this company linked to call of duty lol",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I had CONSTANT issues with this game... not least of all that it CONSTANTLY interfered with my voice chat's and stuff\nif it at least had an enjoyable gameplay loop I wouldn't have minded that so much... but it was (to me) pretty bad and I couldn't even find the specific server I was looking for so I can't even freely play with my friends\n\nHIHGLY STUPID GAME DESIGN",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a stupid game , I was playing for 2 days and they ban me for no reason .....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "can't still play the game, when steam runs in normal user context without admin right\r\n\r\nonly if steam running as admin, i can play. in 2025 it's not acceptable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game sucks shit, especially if you haven't played for a while.\r\nEverything feels shoved in your face while also not explaining a single thing.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too many crashes on the launch of the game. you also need to nerf the moonlord yea with 20 times ur health",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game overall feels poorly designed, from raining inside buildings to poor gunplay, it just feels very unpolished and almost incomplete, let alone very overwhelming for new to casual players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible loading times cosmetics cant be synced between servers this game was a scam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no cross server cosmetics paid items only working for 1 server bad conduct for sales",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute garbage that there are still Fixed Keybinds in this game. Every single keybind needs to be unlocked. Not everyone wants or is able to use WASD. Get rid of fixed keybinds.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Extremely Fun Game. But with the Latest Lunar Event with the Called Lord of the Moonlight. Its so bloody stupid that it becomes Unplayable at certain times. \n\nNo Idea whos plan it was to put this event it but it took the fun out of the game. Dont feel like playing anymore till this event crap has gone.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is so confusing and all over the place help . I want to not look up stuff every 2 seconds on how to do something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "left the game for a bit then came back and i had to restart then i cry",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "UI is a hot mess and somehow worse and messier than your average anime gacha slop, trying to play together with friends is confusing especially with how names somehow are unique, even the description of servers and the lack of explanation of normal OH vs OH raidzone is terribly confusing, game plays worse than a slideshow, zones and everything takes 15 minutes to load, it's a complete mess with what I'm even doing.\r\n\r\nIf you can somehow get past all of it? It ain't a bad survival game to just simply play through.\r\n\r\nI probably wouldn't recommend unless your PC isn't a 5-year-old potato.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overly complicated and cluttered interface, janky gameplay and has a horrible way to introduce new players to the game. It looked interesting in the pictures and videos, definitely has potential, however the multiplayer aspect of the game is very very poorly handled. If you're looking to play with friends... good luck.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It takes over an hour to be able to play with friends as you have to get through the most agonizingly sluggish tutorial I've ever seen in a game.\nThe cutscenes and dialogues take FOREVER because they pad them out with lengthy pauses. Every time you make a dialogue option you have to wait for your character to animate the choice (Not voiced) which is a waste of time.\nEverything about this game seemed designed to artifically slow you down and prevent you from actually playing the game.\n\nIt's free and I still want a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After a week of trying, I uninstalled.\nThe game is packed with systems, menus and mechanics, but barely explains anything. Everything feels chaotic and disorganized, and half the time I felt like I was doing something wrong even when I wasn’t.\n\nSome missions are straight-up unfair: I walked into a zone healthy, and my HP instantly dropped to zero because of some invisible infection. No warning, no tutorial.\nCombat is boring — bosses are basically bullet sponges that require fifty magazines of ammo with zero strategy.\nRift loot runs are thirty-minute box hunts with no payoff.\nProgression feels flat — the game throws too much at you too quickly, yet nothing feels meaningful or earned.\n\nI wanted to enjoy it, but it managed to frustrate and irritate me every single time.\nIt pulls you in, but pushes you away at the same time.\nIn the end, I just deleted it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I once liked this game but the content was very limited. After quite some time of not playing I tried to get back into the game but so much info was thrown at me at the same time with various popups and TO much info being thrown at me all at once, I'll have to pass on this game. It's way to much info all at once with very little explanation. Have game developers not learned from other developers. Bring players into new info slowly so we have a time to learn each system...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game starts up after 5 mins, finnishes loading and shits itself. Had to use task manager to quit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a game mode not for the inexperienced newcomer and or the casual gamer. I played raid zone up till I was able to craft gear, weapons, water, food, and build a simple wooden cabin. I logged off for a few hours, only to log back in to a death, a destroyed base, and everything else gone as well. It seems like I'll have to constantly be playing, because the game punishes you for being AFK.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "1 out of 10.   For a Casual gamer, this game is the worst.    If you are gone for a week, you lose your clan, you gear and your levels.    This is a game for those who are continually on the move, moving on and dont care about building lasting friendships, buildings, characters, or strongholds.     The costumes are for the extremely flamboyant to say the very least.     I loved the first 2 seasons, but, after losing everything I had built the 3rd time...just sucked the fun right out of it.   Cash grab for the severely adhd.   Done.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game does not load so i can't play it the five hours steam says i have played once human.i was waiting for it to load so i could play but it didn't",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game has promise, and over the last few updates, things have been interesting. The base building is fun and people a lot more creative then I have done some amazing builds, but the game is horrible repetitive and has more updates to cash item shop then the actual game content and they lock out regions, so the game isn't open world at all, really wish we had the whole map access not just sections.\r\n\r\nI would love to see them get rid of all these loot boxes that have so much range and amount you have to spend before you can get something you really want. They also need to lower the price on car skins, as they charge you 10gems which means you have open 200 loot bots with no luck to get it, at 180 gems a box, car skins should be 50 dollars each no range no loot boxes, char outfits with animations should be 30 dollars, weapon should be 15-20. \r\n\r\nYou dont go to the super market to buy loot boxes for a chance at the food item you want, no you just buy what you need at the price you have it. So the game is fun to play, even with friends and base building, but beware everything you see you and like is probally cash shop items and skins that you need to pay for. Also i play star citizen so im use to supporting a game i love, but even i think there loot boxes are excessive.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Underneath all the glitzy shiny weeby new content they're adding to the game there was a fun lovecraftian horror open world survival game here... it's still worth playing since that underlying content is still there but is increasingly being crowded out by nonsense so cannot recommend",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just a very badly developed and boring game, too many convoluted and useless mechanics, that once you understand them you realise they don't really help you but are introduced to make your game play horribly un-enjoyable for no other reason than to make your life hell. \n\nGame is pure dog shit, they should shut this game down.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I give up. I've tried everything to get this game to run again (managed to play for about seven hours) I've tried all recommended steps to try and get past this \"Network error. Please check your network connection\" bug(?) Yes, including using a VPN. TRIED EVERYTHING. Reinstalled it twice too. Just won't work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some gameplay elements seems fun but seems to be bug ridden. Assets missing entirely (invisible weapons right at the beginning of the game, voice over appear to be missing and I missed part of the story when I had to quit early on. I would not recommend this game the way I see it but people seem to enjoy it nonetheless. I guess it's worth a try.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The core of the game is good, but I can't recommend investing in playing it. The game is essentially Fallout 4, Division 2, and 7 Days to Die all wrapped up into a k-pop burrito. The aesthetic, cosmetics, and gunplay are all very good. However, you start running into bottlenecks and punishing RNG very quickly. For example, the game hands you new weapons on the regular, but they are temporary and can't be repaired for continued usage without a blueprint. But unlocking said blueprint is locked behind a very limited currency that bottlenecks very quickly. If you're new and don't know the absolute meta picks for weapons/armor, you'll very quickly discover that your mountain of new guns are a waste and you'll begin scraping for every crumb of currency possible. Weapon and armor mods are also a major painpoint as they provide the power/oomph to your setup. But guess what? There are layers upon layers of RNG to get a mod that's worth a darn - and you'll be burning 2-3 types of currency just for the *chance* at a decent mod. What's more, there's such limited information available about the game - even the people playing the game in world chat give bad intel 80% of the time. It's a real shame because the game plays great, but once you invest, you're sucked into a grind that doesn't respect your time *at all.*",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After coming back over a year later to see what new content was like because I was bored I find many bugs from launch still in the game. Enemies getting knocked into walls. Being hit through walls and other large objects. Interface lag when trying to switch weapons or use health items. The only thing they seem to concentrate on is more and more microtransaction junk to fill their pockets, not surprising as they are own by NetEase. Play for free, sure, it helps kill the time but don't waste any of your money on it like I did because I thought it was going to be a great game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game \"Once Human Raidzone\" starts with a high number of cheaters using hacks that go to another level. We’re not just talking about basic cheats like aimbots or ESP, but cheats that allow players to pass through walls, kill others through walls, fly vehicles and suddenly appear on top of your base. Additionally, it is possible for them to raid your base without needing to break through any walls or doors.\r\n\r\nWhile the idea behind the game is good, there is still a lot of room for improvement. For example, the item interaction system feels outdated and is about 15 years behind. It's difficult to interact with boxes and doors inside your base, as you have to stand in a very specific spot to open the right object. This becomes even more frustrating when your base is under attack, as it becomes almost impossible to react quickly and properly.\r\n\r\nIn short, the game needs a lot of work to make it more functional and fair for all players.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "didnt particularly like it that much. too much peppering and yapping with no real charm. didnt captivate me at all. not worth the money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you're a Y axis inverter, this game is unplayable, dont even bother to install it.\n\nif you check \"ivert Y axis\" for camera it works ok while initially moving about, but the minute you try to aim it switches about between inverted and regular randomly.\n\nSome have stated that turning off controller aim assist fixes this... it doesnt,\n\nAlso tried inverting axis on steam controller settings and playing regular in game, this doestn work either.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupidly confusing , oh and if your planning on playing with a controller just forget it haha",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "EDIT: LUNAR REVELRY HAS CHANGED MY OPINION, UNBELIEVABLY STUPID OVERSIGHT IN WHAT COULD HAVE BEEN GAME OF THE YEAR. At night, you just don't have sanity. You can't play for literally half your game time. every 30 minutes, you have 30 minutes of 10% health. Insanely stupid mechanic.\n\n\n\nI want to start by personally thanking the development team for making this game. What an incredible joy. I just recently bought BF6 and Arc Raiders and I'm just so disappointed in them. They are a constant reminder of the awfulness of humanity. This game, on the other hand, has been nothing but fun. I don't even know where to begin. It's the most elaborate open-world sandbox game I've ever played. I've been gaming since the digital age has existed so I've played all manner of games, but this one is just something else. They took all the fun aspects of every other game and somehow fluidly crammed them all into one incredibly fun game. It's Rust in the Control universe (Control was my favorite game, so this game suits me well). Except it's better than Rust because you get to keep your progression now. I'm going to start a list of all the things I love about this game:\n-Combat is surprisingly engaging for how simple it is, you think you're king of the zombies until you're not\n-There is a metric butt-ton of building options to make sick bases\n-Cosmetics are a bit limiting, you can't dye anything, but what's available is high quality\n-Animations are very elaborate while not being cumbersome. They look jank at first, but honestly, it's an incredibly advanced animation system they are using. Try riding a bike in the game, all the animations are so well done and accurate, and the swimming ones are fantastic too. There's even an animation to put bait on your fishing line. On top of that, you aren't put into annoying animation locks like when you're mounting/dismounting your motorcycle; they really understood the assignment here.\n-The progression is very well done, it's fairly slow but constant, so I always feel like I'm progressing without seeing the \"finish line\" (BPD/ADHD people will understand) so it's been great.\n-The community is incredible. Games like Arc Raiders and BF6 have players at each others throat, but it's nothing but chill vibes on this game. Everyone is so incredibly kind and actually play together.\n-It just feels like a game made by a real gamer. Every game lately has felt like it was made by a disconnected boomer developer that doesn't even play games anymore.\n\n-My only main complaint is that the pet system is extremely cute but obsolete as everyone uses Festering Gel.\n\nI'll come back to this list to add more, but for now, I'm greatly suggesting to everyone to play this game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The character customization in this game is actually really good, but that's about as far as I got, as immediately after entering the actual game and beginning the tutorial I was blindsided by how insane the default settings and keybinds are. I'm used to having to adjust settings and keybinds when starting a new game. Default camera movement speeds are painfully slow despite my mouse's high DPI settings, but that's simple enough to change in the settings. For some unthinkable reason yet another game has hold-to-sprint as the default, but at least I can change it to a toggle in the settings. So far so good.\n\nBut then I got into the keybinds after I noticed some odd defaults, like melee being bound to the v key. The keybindings in this game are extensive, and the menu itself is relatively decent, but the problem arises when you want to use a key that is, by default, bound to multiple different functions. One example is the E key, which I wanted to bind the melee to. By default the E key is bound to about... 6 or 7 different functions, which based on their names are all related conditional functions that aren't available to be used at the same time, so it makes sense they'd all be on the same key. While I was able to bind melee to E, when I then tried to reassign the half-dozen functions that got unbound to V, I was thrown into error hell. For some reason, even though these functions are all bound to the same key by default, you as the player are not allowed to rebind them to the same key. If you try to assign two of these functions to the same key, you are immediately confronted with an error popup stating that something else is already bound to that key, and given the option to either cancel the binding or to continue and unbind the currently bound key.\n\nIt drives me absolutely insane when developers do this kind of thing. There is absolutely no reason why the player should not be able to emulate the default keybinding, just with a different key. While I could easily solve this issue using a third party software to leave the terrible default keybindings the way they are and instead remap my actual keyboard, a) I shouldn't have to b) doing so causes its own issues and c) there are so many keybindings in this game that I would need to fix in this way that the end result would be some strange alien keyboard layout that is completely unusable for typing in or out of the game.\n\nIt looks like it might be a good game, but the insanity of the default keybindings and inability to properly rebind them is too frustrating for me to try to deal with, so this one goes back in the uninstalled shelf.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "An amalgamation of stolen assets and lifeless stories. This is the epitome of AI slop - vibecoded, asset-store purchased and blatant theft. There is no way this title can be legal, lmao",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "it was really bad guys. you couldn't pay me to play this. And I probably singed over all my vital organs to china in the user agreement.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this i**** russians or whatever ban legit players and let cheaters to play GG ! wrost admins and creators ever dont play this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "First time playing Once Human.\r\nAt the bginning the story was interesting, it had a good start, but after the first hours, the story was nothing more but a daily task. Whatever aou did, it didn't change anything, it had no impact on the world, rewards were mediocre.\r\nExploring was the part I had most fun. Though I collected so much materials, most of them had no use to me. What was important was food & water and ammonition, which I could make in masses and still had tons of left.\r\nDuring the exploration I got the feeling of a \"dead\" world, as beautiful as the map was make, everything was static. Nothing was danymic, elites stayed on place like a trained dog, no invasion happening, never was anything threatening.\r\nThe rest of the game is full with bying kosmetics or skins.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "yall keep ruining this game and patching it up with unplayable means. this is an incredible game that keeps getting smashed to bits from the developers creating these dog shit events and scenarios and weather mechanics. idk if ill be back next season, i gave it a year and was thrilled to see how many updates there were. just to get thrown into a lunar event capped at 10 health and if you step outside you die from hypothermia even after spending a week grinding for velvet and warm clothes and hot rocks and torches,  still too cold to play this game. do better. also beware the moon lord, hes unkillable and steals your shit constantly and theres nothing you can do about it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "after few days of playing, my account was missing, and game give me new character form 0, all my loots and buildings was disappear",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Broke piece of trash.  Have a massive gun floating in my face and can't see the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wtf do you even do, downloaded the game and im in some weird pokemon shit but naked... okay I guess",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"THE LORD OF MOONLIGHT IS WATCHING YOU\" This is the whole game 24/7. He takes away half your health, lasts like half an hour, and appears every night. Whoever made the choice to add this to the game really hates IT's players. That's right \"IT'S\", cause whatever made this is NOT HUMAN! Really makes the title make sense now. Whoever thought it was a good idea to limit the player's health, then make an impossibly difficult boss with equally as hard goons, and make it all happen once an in game day everyday deserves something that I cannot condone online.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has multiple \"tutorials\". Mine was some weird lab scenario and my partner's was a \"dragged into the weird\" style scenario. My tutorial was a third as long as hers and while hers had a massive map to fight a million overpowered monsters, mine had a single Sirenhead rip-off and useless lore.\n\nIn the actual game, they don't explain that you can only have one character per server, and they \"suggest\" the Novice server to begin. The Novice server is filled to the brim with people's useless beginner bases that never get cleaned up or managed so the entire server is basically full.\n\nCosmetics look cute. Cost money. Don't play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My specs are above the recommended, but the game is stuck on compiling shaders... waited for an hour without any progress. Game is just a waste of space on my drive.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unoriginal derivative slop. \r\nrippoff of control. ripoff of the SCP foundation. jarring tonal shift with the addition of palworld cartoons. this game has no identity. its a messy chimera of better works mashed together. \r\nthe last straw came quickly when i floated to earth holding the talking bird like a low effort fortnite clone. zero interest in continuing. \r\nvery flashy good looking game with absolutely no soul.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Started off good but now that I've tried it again I can see that it went towards a wrong direction. Really annoying decisions, bad events, bad scenarios (whoever made that lunar event that is pvp disguised as pve should be ashamed of themselves) and in general WTH is this game really? What does it want to be? Such a mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is decent. Not sure how they copied pokemon and palworld but still managed to make it completely bland and boring. Fun the first time around for each scenario, after that. Its all the same. Customer support is atrocious, which is why I uninstalled after 400hours.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game seemed interesting at first, but once I got in and finished the opening section, I couldn’t figure out how to add a friend. After spending time searching on Google, we finally managed it—but then we ended up in different worlds, so I had to find a teleport. My map didn’t show anything. When my friend eventually joined my world, they had to walk all the way to me.\n\nI also built a base, but I couldn’t dismantle it because it kept saying I needed permission—even though it was mine. I just don’t understand this game at all.\n\nI spent most of my time just trying to add friends and meet up on the same server. This game needs a lot of work. I’ve already uninstalled it and won’t be coming back. Some people might enjoy it, but too much time is wasted trying to figure out simple things.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nearly impossible to play with friends now. I was on the exact same server and world as my friend, couldn't see him. Went to try and add him by his ID, pulled up a completely random player. \r\n\r\nOn top of that, they made the intro to the game super easy. You basically get everything handed to you. I miss the days when you had to grind for things. Uninstalling and likely never playing again. A shame, I loved this game (once upon a time).",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I just spend 32 usd dollars just to get an 1 outfit, WHICH I actually didn't even got it, instead I got some shitty stuff I didn't even need and I felt like this is a scam, don't buy any in their shop cause it's like a huge gamble apperently.......",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wow. I haven't even played it yet and I'm already put off by how many reviews say they lost 6 months worth of hard work and building. Definitely don't want to waste my life building something that will suddenly disappear. Canceling the download and not playing this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game needs an AI Generated Content disclaimer. Lots of AI Art all over in-game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I was thinking about trying to get back in to once human but now I know it's going downhill. A palworld colab? GARBAGE!! palworld was a trash game that wouldn't even let you take your character to a friends server. Once Human ONCE had a eerie cool vibe but that's gone. Deleting. Terrible colab mistake imo",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrible user interface and having to wait and sign up for different servers is dumb. waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can\"t even play the game because when it loads at 100 present it froze I waited for 45 min and it was still frozen I tried the next day same result I don't know why but at the start of loading it goes perfectly then when it reaches 100 present boom frozen and i will try again also when it freezes it puts my screen to steam   do you have any ideas of whats happening to my once human",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "PORTUGUES:\r\n1°. não é jogo de sobrevivencia, mas jogo de contrução. Vc tem q ficar upando as coisas na base, coleta, upa, fabrica, espera fabricar, 90% do jogo é na base fazendo coisas.\r\n2°. mta burocracia p fazer as coisas, p vc fazer uma picareta, vc precisa pôr uma base, criar a mesa construtora, achar os recursos, habilitar a construção da picareta numa arvore de talentos, mandar fazer, esperar ficar pronto. Isso não faz o menor sentido. \r\n3°. seu char tem fome e sede, vc precisa o tempo td achar liquido e comida, precisa fazer comida p tirar o debuf de escuridão, precisa fabricar os curativos, ou seja, vc fica boa parte do jogo tendo de dar refil em suas coisas. O foco não é na ação , nem em aventura, apenas construção, e manutenção da vida, eu assisti mtos videos desse game, posso falar.\r\n4°. coisa boa q ele tem é a contrução de personagem, vc pode fazer um char bem bonito, como vc prefere, porem não achei a opção de transmog de roupa, ai vc tem q ficar c a aparencia do item q vc equipa, oq p mim é um absurdo, em 2025 vc ainda ficar preso ao q está equipado, deveria ter um painer de aparencia p vc mostrar apenas oq vc quer. Poderia até ter itens desbloqueaveis de aparencia p usar.\r\n\r\nENGLISH:\r\n1. It's not a survival game, but a building game. You have to keep upgrading things at the base, gathering, upgrading, crafting, waiting for crafting to finish; 90% of the game is spent at the base making things.\r\n2. There's a lot of bureaucracy involved in making things. To make a pickaxe, you need to set up a base, create the crafting table, find the resources, enable pickaxe crafting in a talent tree, order it to be made, and wait for it to be ready. This makes no sense at all.\r\n3. Your character gets hungry and thirsty; you constantly need to find liquids and food, you need to make food to remove the darkness debuff, you need to craft bandages, meaning you spend a good part of the game having to refill your supplies. The focus isn't on action or adventure, just building and maintaining life. I've watched many videos of this game, so I can attest to that.\r\n4. One good thing about it is the character creation; you can make a really nice character, however you prefer. However, I didn't find the option to transmog clothes, so you have to stick with the appearance of the item you equip, which to me is absurd. In 2025, you're still stuck with what's equipped. There should be an appearance panel so you can show only what you want. There could even be unlockable appearance items to use.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything about this is bad.\n\nThe game is so easy they have \"insanity\" drain all your hp if you try to go fight enemies far above your lvl.\nI spammed my sanity tea and cleared the lvl 40 area at lvl 20.\nEnemies still too weak.\n\nA big world with alot of tiny hubs with the same enemies, everytime, and same object; Find the 3 crates.\n\nEnemies are so dull, there are like four, maybe even 5 different enemies. You are never in any danger.\n\nLoot ? Worst loot system ever.\nPlay Wack' a' Mole and get blueprints.  WTF...\nAnd the scopes for your guns, gl, those are hidden behind an invisible enemy somewhere in the world.\n\nNot locked behind a fun quest or dungeon or anything. Nope. You either buy the scopes or find them on Google.\n\nBase building ?\nWhy build anything if you don't get raided, just a stupid mechanic to keep you engaged.\n\nI think target audience is low IQ people / teenagers home alone",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't even start. Obviously I have to pick a \"scenario\" (whatever tf that means) which seemingly are different servers and modes. Not sure what to pick. There's no indication of what default is. Just want a standard mode but have to jump through hoops to get there. Here's an old acronym I learned many moons ago. K.I.S.S. Keep. It. Simple. Stupid. You want to arbitrarily name things in a non standardised obtuse manner then I won't be jumping on board.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's a good looking trash. Not even worth the time explaining why is such a big trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "A lot better with a friend. Most people I meet are russian and speak only russian.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nah.. too much everything. was good at the start but they deleted my 20hrs char and thats it.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}