{
  "positive": [
    {
      "review": "First get - MIs Tiny CITY Mod + TINY VFX. Makes the game look great.\nThen get the Divide et Impera mods and you will have 100 hours of conquering before you! Praise be to Mars!",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "in my opinion its the best total war game and the best RTS game you will ever find its and amazing game I would recommend it to anyone who likes strategy games and challenges.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is really great: my inner child loves being able to watch a Roman cavalry charge. But the prologue tutorial campaign has loads of obvious bugs that make it unplayable, that have been there since 2013, and which would be incredibly easy to fix (i.e. getting stuck because you have to recruit but there are no spaces in your army, and not saving after the battle of Salernum). I feel really annoyed at paying £30 to a company that obviously doesn't care about its customers.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ive had Rome II since it came out, and no other game is quite like it. One of the best in the franchise. Been playing on and off for ages. if you like war, strategy, and fantastic mod support, this is the game for you.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Probably the best turn based and historical game out right now, Total War 2 is goated tbh, worth my every hour",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Total War: Rome II is a rich and engaging strategy game that blends empire management with large scale real-time battles. The campaign offers meaningful choices, whether you focus on diplomacy, economy, or military conquest, and each faction has its own unique strengths and playstyle. Battles are epic, with thousands of units fighting on detailed and immersive battlefields. The visuals, sound design, and historical atmosphere create a convincing and enjoyable experience. Overall, Rome II is a must play for anyone who loves deep strategy and ancient history.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I guess there were some serious issues at launch but Rome II - EE is a pretty great TW game. There are issues with the game becoming a major slog mid-late game, once you've pretty much dominated your neighbors, but the combat is fun and the graphics look good. Some people don't like how resources are now managed at the province level, and you can no longer build every little town into a rival of Roma, but really, it's a non issue once you get the hang of managing food and learning what to build and where.\n\nAlso worth noting that the Workshop has tons of mods, from minor music enhancements, to complete overhauls. which extends the replayability of the game once you get done with the included scenarios (which are good, especially teutoburg forest).",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rome II is peak Total War. The mix of huge battles, empire building and classic Roman chaos still hits perfectly even now.\n\nThe game handles Roman history in a way that feels genuinely fun. The Marian Reforms shake up your armies, politics is always stirring trouble and the civil war hangs over the campaign like a storm you know is coming. For a video game, it handles units and historical shifts with surprising accuracy. Each faction feels distinct and the major moments of Roman history actually matter in gameplay.\n\nBattles feel massive and watching a Roman line hold under pressure never gets old. The campaign map is still one of the strongest in the series and it is dangerously easy to fall into the “one more turn” loop.\n\nWhen this game was announced in 2012, me and my friends were stoked. We sat on the school bus talking about how incredible it looked and how our PCs were probably not going to run it. Now it is 2025, I get home from work and I stick the settings on extreme quality, still enjoy diving into a custom battle or starting a fresh campaign. The magic has not worn off.\n\nPlaying Rome II again only highlights how strong this era of Total War was. We need a return to this level of ambition, depth and overall quality.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has an epic ambiance, amazing soundtrack, the battles are fun and engaging. There is no magic or \"monster\" units like in a Warhammer setting, but it doesn't withdraw any epicness from the title.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is the best of the classic RTS wherein you can completely control every aspect of a moving army. the community taking away the chat was completely ridiculous, and has damaged the game immensely. the game now belongs to the trolls, and the discourteous players that remain, for a great many of the skilled players whom labored literal months or years of their lives. after dedicating so long to this platform it has betrayed the principles it once stood for, a free space for all to come together as a community while embracing every aspect of the social aspect of the game. as a citizen of the united states of america i do not agree with stripping the players of their voices. the game functionality simply cannot be the same. no one has a reason to remain in a game, so many games go unfinished. after spending hours in game u may be lucky to fight one match. the other 9 of those 10 games would be DNF scenarios causing many a player to simply put the game down altogether. AS I DID.... i love this game. i do not do reviews. i really hope this helps in some way because i do miss my rome..... thank you",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The last great Total War game (historical - I dont play the fantasy or mythical ones). Hoping for Rome 3 or Medieval 3 in the near future. 10 Years for my total war fix is a long time to wait.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great campaign map. One of the best in the Total War collection",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the battles, especially if you use combined naval and infantry, naval artillery can take out defences from a great distance, also don't really bother getting and archers build 3/4 units of ballista, 4/5 units of cavalry and the rest a good mix of heavy infantry, focus on your family tree, build great bloodlines of leaders, the economic side of the game has been simplified/unified (however you see it), focus on food trade exploration, I play mostly as Roman factions (Junia being my favourite), it's great when you finally become an empire, ends all those silly civil wars (stack mostly your family tree). Excellent fun Great battles awesome sound, amazing graphics, and very replayable, the romans dominate warfare, the Egyptians control trade, gring the diplomacy every few turns !!!!! HAVE YOU SEEN HOW MANY HOURS I HAVE ???",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game, especially with mods, but tends to get a bit boring towards the end as some of the victory conditions take too long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game to play when bored because these games are not short and boring they long and action pacted to me this game is a must buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game. Probably my favorite Total war game mechanically. mods are pretty buggy tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game play and development is always different. There are many different strategies you can use.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved playing it with the DEI mod, constantly doing so.\n\nAlso, hearing your friends rage against horse archers and elephants (playing as Baktria) while they play as Rome, has to be the funniest thing ever, probably how the Romans felt when they faced them against Carthage lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ROME II is still one of the most enjoyable grand strategy games ever released. The combination of deep campaign management and massive real-time battles creates a level of scale and immersion that stays addictive even years later. Every faction plays differently and every campaign tells its own story.\n\nI still remember when the game first came out. My dad bought it for me and I was so excited to play it after school. I rushed home, installed it and then realized my PC back then couldn’t even run it. Years later finally playing it at full settings feels surreal and reminds me why I wanted it so badly in the first place.\n\nThe Emperor Edition updates make the game smoother and more balanced, and with the right mods it becomes even better. Divide et Impera for deeper gameplay, AAA Generals for cleaner character visuals and Ancient Empires for richer atmosphere all blend beautifully with the base game.\n\nIf you enjoy building empires, commanding huge armies and watching history unfold through your decisions, ROME II is absolutely worth your time Mi Lords! For Rome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "11/10 Would recommend to your cat get to lead the SPQR to its full glory. Veni, vidi, vici",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sigue siendo un juegaso pero ya se le nota la edad. Ojalá le hicieran una última gran actualización... solo por la nostalgia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The campagan for people who like long battles and can wait out boring parts, and the historical baatles are fun. but you have to purchase as lot of things like battles and other campagans series and places",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best strategy ware games ever created. Love the different roll play choices.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So with almost 200 hours, I can say the game is good. Why I say not great? because of these funny bug that is still present since launch of units flying upwards whenever the cavalry charges at infantry foot soldiers. Its funny but gets annoying whenever that happens often. That's all I had fun with this game. Recommended it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "addictive. But would be overwhelming if u took the wrong sequence or steps when expanding. Traitors, Uprising, no budget, no food will end ur career as cesar.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is very good graphics are amazing the DLC's are nice i really like the rise of the republic DLC the blood and gore is very good aswell. ngl the blood and gore DLC's for all total war games should be free. but they are in a good price for€2 or€3 but it still should be free.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I Love This Game.... whit mods.\nThe time frame, the way troops look, even the economy. \nThe Greeks/Phoenicians and to some extent the Romans are focus on trade.\nThe Barbarian factions are focus on industry.\nAnd the Easterners are a bland of higher tax % and Trade\nGiving each culture a different feel, even if it lacks  complexity. Mostly it boils down to build buildings that make food and public order to be able to build buildings that make you money and better troops.\n\nSince we have spoke of troops lets talk of troops, battles and progression\nThe Troops are great looking..... but have a Big Flaw in my opinion.\nLets say that you have 6 levy spearmen vs a Praetorian Guard. The Praetorian will win regardless of TACTICS.\nAnd that is I think a big problem whit the battles, tactics don't matter if you have a better army. it is useless to achieve local number superiority against a higher troop type( 6 levy spearmen vs a Praetorian Guard ).\n\nAnd now we come to the Cake.... the battles are a mess.\nThe Broken Toaster that is the Ai is not able to keep its troops in a battle formation\nThe Ai is a pushover on the lower difficulties and a cheating bastard on higher ones( I could go on rants until I foam at the mouth about the Ai, but lets just leave it here) \n\nAnd the Progression is good, but not great.  \nThe game is good until turn 50-60 then you are ether too powerful for one single Faction and the Factions do not gang up on you.\n\nWhit all of that I still like this game. it is not clunky do it has his flaws.\nI Love This Game.... whit mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Mean game, goes hard. Still my favourite of the available Total War games at time of writing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless battles, and doing this for years, feel roman, think roman - and yes its true, this will be your daily roman empire thought.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Strategy Game, Teaches you history, great multiplayer, Active casual and comp communities. overall 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best and classic Total War game ever made!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely the most optimised total war game,you could run this game on a literal potato and I guarantee it would still work.It's got tons of mods and the battles are fine but engaging enough for you to keep playing,give it a shot when its on sale especially if your on a budget setup.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Likely the greatest strategy ever made covering what is easily the most interesting period in human history",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's Total War: Rome II. You definitely get what you expect, which is engaging real-time battles that get deeper and more complex the more you play. I haven't gone into the historic battles yet, but I'm sure I will. \r\n\r\nPlenty of mod support means that even if you don't want to pay $200 for all the official DLC, you can still find more ways to play a game that's a decade-plus-old.\r\n\r\nCriticisms: \r\n1. A lot of the battlefields feel pretty bland unless you're in a forest or city (maybe I've been fighting too many battles on plains). \r\n2. I have to open task manager and go details > set affinity for Rome2.exe > and uncheck one box every single time I open the game. Otherwise, it crashes when I try to load into a battle.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So good that I lose track of time, addicted to the sound when pressing the end turn button.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would attack Syraccus again.\nThen be attacked by Rome who outnumbers me like 1:5 and Rome has better troops then just my garrison.\nBut i defeat them pretty easily only losing my mob, while Rome lost almost everything.\n\nAlso i would again fight like 7 battles for one city againt Baktria",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rome would have lasted 10000 years if you didn’t lose half your income to corruption and spending the other half on a family feud so they don’t ignite a civil war and taking a third of the empire with them. Channel your inner Stalin, assassinate your political rivals and purge their supporters for the good of the empire.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fine, its good. \r\n\r\nMy name is Maximus Decimus Meridius, Commander of the Armies of the North, General of the Felix Legions, loyal servant to the true emperor, Marcus Aurelius. Father to a murdered son, husband to a murdered wife. And I will have my vengeance, in this life or the next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decade later and still one of the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best of the entire total war grand strategy series I've played so far",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HELP IM ADDICTED I KEEP PLAYING THIS GOD GIVEN GAME INSTEAD OF WORKING ON MY GOALS AND  AMBITIONS!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very addicting especially with the DEI mod.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game but the battles might not load on Windows 11 without a little jiggery pokery in task manager, just unassign your last 3 CPUs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still learning the game, it looks good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is pretty much the greatest strategy game ever created. Lots of factions with lots of unique units. The cinematics are great. There are all kinds of nice extra touches that you don't find often in modern games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I go back and forth on Rome 2 tbh. It's good, great looking and the battles are fun. \n\nBut they have introduced a lot of systems that I just would prefer not to be there. The political management side of things is unnecessarily complicated, and the rebellions are just frustrating to deal with as opposed to adding any depth or drama. \n\nI uninstall and reinstall it a lot. It's very fun but also often frustrating in a not fun way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's the best Total War game, in my opinion.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "totally worth to purchase but  somewhere could be not suitable for you as well.\n           the UI:it might be not so good for you because of those signs are not clear engouh.you maybe cannot tell your troops ditails\n           the fight:knife to knife and pica to pica,it costs lots of time to kill others when soidiers in battle\n           the languages:egypt,hellas,roman and so on,their voice---English.I am confused,get a latin voice and something like this cannot be diffcult.But what happened,i dont wanna Romans and Helaas speak English.It is breaking my experience.\nAs what i said,it may be horrible,but totally worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game since it first came out, and nothing comes close.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "childhood game, mods made it an adulthood game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After many patches later. It is indeed playable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "And remember this above all: our Roman gods are watching. Make sure they are not ashamed!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly still my favourite Total War game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game runs smooth if you like RTS then this is the game for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great visuals great game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The time i have put into this game will be much much higher with out a doubt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far from perfect but I always come back to it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "VERY enjoyable and entertaining",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fucking cool ass game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A good  Total War that all new players should start",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WWWWWW game. Best total war game out there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "become Julia and destroy the gauls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good times with great mods",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "lwk the best total war game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing strategy game",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Honor and glory await",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best strategy games I have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing with Divide Et Impera",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "play romans kick ass repeat",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game with mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best strategy game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best Total War game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its Rome, what is there not to like!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game; may enjoyable hours!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endless hours of fun. Incredible battles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rome 2 is fun only with DEI mod.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game just crashes some times.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "satis banger ut verum dicam",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favourite in the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MODS ARE TO DIE FOR \r\nWorth the price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a great game - such an awesome sequel!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game in total war",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Roma Aeterna Victrix",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Favourite game of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Yep. It's a good'n!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i really love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "vujcvhfhyc good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "4/5 -1 forced to have generals in armies.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i too have never finished a campaign... love it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rome 2 4/10, DEI 8/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud game veni vidi vici",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I still remember when this game was announced all those years ago, I was so young, and I loved the total war franchise and you could imagine how excited I was for this game.  I remember playing it around launch and experiencing some really crazy crashes and bugs, the experience was a bit disappointing and since launch I have played this game to limited capacity since.\n\nI will say, this game has come a long way in terms of performance I believe and some of the bug fixes and patch work has definitely helped, but to me this game still just doesn't compare to the older titles. I have tried giving this game many fresh starts trying to understand and enjoy the experience, but each time I load into a battle, I see some of the same things that really made it hard to enjoy Empire and Napoleon total war. \n\nI'm not going to go into to much detail further, but I will say that I can appreciate the attempt at seizing romes former glory, and there are some things I can still appreciate about it, but overall the experience fails to me. I think if I were going to recommend any total war game from the warscape engine era, I would highly recommend shogun 2 total war, its really well polished, and plays extremely well despite its engine.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game is beyond hope. Army units either turn invulnerable randomly where your world class cavalry spends the entire battle unable to beat a small group of archers, or midway thru the campaign, you lose the ability to scroll on the world map unless you can find a save game before it glitched. This is exactly why the video game industry is failing. If they had to return money for people who dislike a game they would not make money. They don't make good games anymore, they just use that money on marketing to convince people to waste money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tried playing this several times with and without mods and always run into issues with custom battles (i.e.: the custom fund glitch) and other parts of the game and interface. The devs don't seem to care at all with any title in this series and just screw over the fanbase. It's a shame for me since I grew up loving the first Medieval title. Can't recommend this game, highly suggest choosing a different franchise and developer altogether.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Windows 11 update broke it and CA devs have been pretty consistently bad at fixing problems with their games since the Warhammer money printer came out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game when i played a few years ago but now in late 2025 I cant load into any battles without crashing and havent been able to find a fix no matter what code is deleted or changed even without mods and files completely deleted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i want to recomend this game because i love playing it but i have had several crashes during campaigns and i am getting tired of it. it started to happen after my update to windows 11 so if you have window 11 dont buy this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Any given older Total War is better and I suggest them you play those instead\r\nIf you somehow prefer the army system where you can't detach units that only exists because CA are bad programmers and couldn't fix a critical bug in their engine, play Attila instead. The battles in Attila are way better than in here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enjoy this game a lot. But at times it is terribly unstable. You can fight an amazing battle and win against all odds,... and then it suddenly crushes without a save. So frustrating!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they game is great but every time i get to a certain  point in the campaign my screen blacked out and i cant do anything but i can still see my mouse cursor on the screen???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just got this crap to play a mod. Wasn't worth it\nThis was the start of dumb Total War, everything before this one was going the right direction, then this RPG oriented and simplified management crap, i wish this trash never came out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rome II is like SimCity (2013), a mediocre game that tries every single way to piss you off. The difference between them is that SimCity had their reckoning, which came from Cities Skylines, & after the reckoning, no one cared about SimCity (2013) except as a weird gimmick from the past. However, Rome II has never had true competition, & as such, people had to make do by modding it. Some of those mods that came out make this game great; however, the base game that you paid for remains mediocre to this day. You don't pay for the game; you pay for the game engine that you run someone else's game on. You should also never buy Rome II at AUD $89.9 when you can wait a month & get it for AUD $22.5, which, even at that price, is still taking the piss out of you from this old game. The DLC pricing for this game is on such a level that even EA would start taking notes. It's okay to like these two games, but people recognise that SimCity (2013) was bad. I do believe that most people here who are saying that this is a great game have some form of Stockholm syndrome. Rome II is bad; it never got good, nor was it replaced by something superior, & it's unworthy of being the best grand battle game set in Roman times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 1431 hours on the game I have officially given up on the game. As im sure you will find out by searching reviews and seeing videos online. This game is absolutely fantastic. Vanilla experience is great but massively improved with mods. Visuals, troop packs, map visuals, sound tracks. I had all of these and had an amazing experience that I will truly never forget. But if you like having those, be prepared to be forced to say goodbye.\nThis was all ruined by their mod launcher. Firstly it started as being laggy but even if i reduced the inactive aswell as active mods it did nothing. Then it got impossible to start the game as it was so laggy it would take 5 minutes to press start because of the mod loader,then told me all my mods are corrupt but would launch it just like before as if nothing was wrong. And now it wont even launch one mod without crashing. But at the end of the day i cant play this game anymore because they changed something. I tried uninstalling, deleting data, deleting the mod launcher. I searched the internet on how to fix it - nothing worked. One of my top 2 games that i always play is now unplayable to me. Thank you for the memories. Goodbye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When you have to play a level for six hours, trying every possible variation to win, with no available option to increase or decrease your chances of winning, it's not good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool looking game, just not my style at all in terms of gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like all total war games, the AI units have faster response time. units that follow orders (ranged actually firing their weapons) in every game the ranged units do this thing where you tell them to attack an in range enemy unit they run forward then get maybe one or two volleys off before the ai infantry who seem to out pace my fresh cavalry lock them in combat one or two units forcing the entire untit to ignore any further orders and stand there being slayed.  I just watched an enemy heavy infantry intercept and then keep pace with cavalry. its hard to enjoy a game when your always playing a cheater.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just installed it and battles do not launch anymore. Watch out that you will very probably need mods to have the game functioning on a recent PC.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Probably the most annoying Total War game. \n\nFrom sloppy, unsatisfying battles that are more stat mashing than tactics, to an unintuitive political system that would be better off not existing, to a kneecapped campaign map with limited armies, to a frustrating province system that is more spreadsheet and encyclopedia book than strategic.\n\nWhile far from a terrible game, any one of the above issues alone make this game pale in comparison to any of the previous titles, including the original Rome Total War. Any time I get the Total War itch and attempt to gain enjoyment from this game and uncover the mystery of why it is well received, and now over a decade old and still one of the most played Total War games, the first battle is a crushing reminder of how tepidly middling, frustrating and unsatisfying this game is. \n\nFor every fault this game has, a previous title corrects(I say that as someone who got into Total War with this game!), and for every new feature this game adds with merit, Attila does better. Rome 2 Total War isn’t awful, but I absolutely hate this game with every fibre of my being, and I think less of you for enjoying it. \n\nTo give some examples of how this game plays out on the battle and campaign map;\n\nBATTLES:\n\nI fought off an attacking army with a garrison, killing the enemy general. The garrison is of predetermined composition that cannot be supplemented without sacrificing a limited field army slot. The next turn the same enemy army attacks my same settlement, and while both my garrison and the enemy army are depleted. However,  because I made the strategic error of killing the enemy general in the last engagement(Sun Zu warns about this!), this enemy army has a completely new and fully replenished elite general’s unit in this battle. Despite completely surrounding this general, my skirmishers emptying into its exposed flanks, this elite unit easily overcomes and destroys my weakened garrison. Where’s the strategy in this? I was actively punished for winning a battle by the fact that the enemy, in my territory, can replenish an entire unit powerful enough to single handedly win battles. My garrison, being limited to the defence of the settlement, is forced to just watch this defeated army sit outside the gates and magically create a new elite generals body guard that will soon slaughter them all!\n\nI made the mistake of playing a Sparta campaign as one of my first campaigns. Sparta is perhaps the faction that makes this game's issues the most apparent, as its roster consists of units with high defence and low killing power, and limited cavalry. Most battles were reduced to slugging matches where after my skirmishers depleted their ammunition, I could do nothing but click 3x speed and watch my superior stats grind down the enemies. Unlike previous games, battles rely far less on morale and it is much more likely units will fight until 10-15 men remain. While this does draw out battles in a way that in theory could introduce more tactical options, in reality it just means you have time to micro your cavalry and skirmishers twice as much to squeeze out a few more kills.\n\nIt should be noted that the new health pool units have make skirmishers busted and cavalry pathetic. Instead of a dice roll if an arrow kills or glances a model, it deals damage that slowly whittles down a unit. Meanwhile a cavalry charge now works in that same fashion, so a charge that would decimate a unit in the original Rome total war might in this game deal damage without killing a single model!  \n\nCAMPAIGN MAP\n\nThe province system limits building options, reducing choice and strategic depth into a spreadsheet meta builder. Where as in the first game, you might have to consider the costs and time of building roads to connect your elite barracks in your home region to your frontier, or perhaps setting up a new recruitment center closer to the front, or maybe a region is overpopulated to the point of squalor and needs more governance. In this game these choices are practically predetermined. Provinces must be specialized into either economic or military with limited building slots at your disposal. Public order is an active consideration that needs to be balanced constantly. It gives the illusion of choice with 15 different types of each cultural, economic and public order building trees, but in reality this just leads to a moment of frustrating confusion as you figure out the ideal building layout for each province through the cumbersome encyclopedia. There isn't a strategy to decide which of the 15 different economic buildings offers a 5% bonus to income, or which of 15 different public order buildings I need to most efficiently keep the province stable. It is an incredibly cumbersome and mind numbing task. \n\nYou’ll also have to stake out a single province to place down all the military buildings and their minor stat boosting compatriots. It's hilarious how poorly implemented and thought out the military building is. To field the whole roster you’ll need a whole province dedicated to the task, leaving most of your units to the mid game when you have etched out enough space. The AI doesn’t have this ability, so most factions spend the entire game with one region and one stack of tier one spear units, the only units they can recruit. I can’t stress out enough just how bad this is, why would I invest in one or two military buildings spread out and unbalancing the awful public order/economy mini game, when I might as well wait out a few more turns with tier one slop and mercenaries until I can plop down each kind of barracks and each kind of stat boosting military building in one province? It is just absolutely mind-boggeling the game is designed this way, both for the player and the fact the AI is totally incapable of interacting with it in a meaningful way! \n\nThe politics system is something I can only imagine no player wants to deal with. In theory it offers interesting mechanics and organic fleshed out civil wars, in reality it is just a nerf to expansion and a chore to deal with. Every couple of turns you have to check in on it, click a few buttons out of dozens of confusing options to bring everything back to stasis. \n\nI could go into the deep reaching effects the removal of general-less armies has, but this review is long enough!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "IMHO Creative Assembly rival Bethesda in their hate for their fans and player base. CA seems to love going out of their way to break their own games and leave players high and dry. They’ll never get any more money from me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The loading screens still freeze from time to time in this 12 year old game. Fix your games ca.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game freezes loading battles on new PC. Fix your shit assholes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Games should never have Achievements which are time-locked so that you can never get them unless you were playing the game at the right time to even be eligible for them. It isn't an “Achievement” to have been playing the game at a particular date and time.\n\nIt is simply a way to ensure that only those who were already playing the game consistently at a specific date and time can ever have 100% Achievements. If you care about getting 100% Achievements, this is not a game for you. Time-locked Achievements will guarantee you will be stuck at 98-99% essentially forever, at a maximum.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Causes my PC to crash, they won't refund it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC is not working very dissapointingby CA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Optimization is just sad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth the squeeze.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as Rome 1",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its mostly all downhill from here",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shite",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I still remember when this game was announced all those years ago, I was so young, and I loved the total war franchise and you could imagine how excited I was for this game.  I remember playing it around launch and experiencing some really crazy crashes and bugs, the experience was a bit disappointing and since launch I have played this game to limited capacity since.\n\nI will say, this game has come a long way in terms of performance I believe and some of the bug fixes and patch work has definitely helped, but to me this game still just doesn't compare to the older titles. I have tried giving this game many fresh starts trying to understand and enjoy the experience, but each time I load into a battle, I see some of the same things that really made it hard to enjoy Empire and Napoleon total war. \n\nI'm not going to go into to much detail further, but I will say that I can appreciate the attempt at seizing romes former glory, and there are some things I can still appreciate about it, but overall the experience fails to me. I think if I were going to recommend any total war game from the warscape engine era, I would highly recommend shogun 2 total war, its really well polished, and plays extremely well despite its engine.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "This game is from 2015. I have a beefy computer and clean install, no mods. It crashes every time I try a manual battle. Folks on reddit found temporary fixes, but no one has a long term solution and even the short term ones seem to stop working after a while. This is really disappointing since the game was fun until it ground to a halt.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "They're really asking $60 for this? I don't think I paid that much when it was new. Despite being a decent game (not as good as the first with mods) I'm giving it a thumbs down just for the ripoff pricing. Its old and it shows.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is beyond hope. Army units either turn invulnerable randomly where your world class cavalry spends the entire battle unable to beat a small group of archers, or midway thru the campaign, you lose the ability to scroll on the world map unless you can find a save game before it glitched. This is exactly why the video game industry is failing. If they had to return money for people who dislike a game they would not make money. They don't make good games anymore, they just use that money on marketing to convince people to waste money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tried playing this several times with and without mods and always run into issues with custom battles (i.e.: the custom fund glitch) and other parts of the game and interface. The devs don't seem to care at all with any title in this series and just screw over the fanbase. It's a shame for me since I grew up loving the first Medieval title. Can't recommend this game, highly suggest choosing a different franchise and developer altogether.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Windows 11 update broke it and CA devs have been pretty consistently bad at fixing problems with their games since the Warhammer money printer came out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game when i played a few years ago but now in late 2025 I cant load into any battles without crashing and havent been able to find a fix no matter what code is deleted or changed even without mods and files completely deleted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The start of the downfall of what was once one of the greatest strategy game developers ever. Bad launch, constant dip and dime dlcs and still a mess almost a decade after launch.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I thought that the version I played long time ago was kinda an early release and the issues are resolved but this game has too many major problems that it's hard to list them all (steam review limitations). I do my best to list them as much as I can with evidence and comparison to rome 1.\n- The archery in this game is so bad that slingers have more range and power than any archer in the game. In rome 1, slingers have short range and they shoot straight instead of a ballistic trajectory. Projectiles in rome 2 have a very lame slow motion trajectories to the point that you can easily dodge them. Also your unit flashes red before it's hit by enemy arrow even just before the enemy shoots its arrows. Also in rome 1, height advantage was immediate, to the point that even slightest change of elevation would change the range of your archers in a certain direction. Rome 2 is more like a simplistic mobile game that your units have a fixed circle of range around them.\n- The game has insane friendly fire similar to rome 1. However, rome 1 barbaric invasion fixed this issue to a great degree. In this game one single enemy horse gets too close to your archers and instead of fleeing when facing 10000 archers, it jumps in and your archers just kill each other by shooting 1000 arrows into each other.\n- Enemy AI is way worse than rome 1. The enemy just follows you even when they make a fort to defend themselves. In rome 1, this behavior could be seen only when the enemy had significantly larger army to just blindly chase you. The enemy archers tactically flee even when they are behind a massive army. So you can easily trick them to stop shooting by spam attack and cancel. This behavior existed in rome 1 to a limited degree but the AI was smart enough to camp behind the line and continuously shoot.\n- There are near zero physics in this game, much less than rome 1. For instance, in rome 1, shield was a real object that the direction of arrow and shield would matter a lot. This game is pretty much a mobile game such that the arrows just hit sponges and usually they kill no matter how large the shield is or the direction of the shield. It doesn't matter if you shoot enemy from behind or front, they just carry shield on their head and things are pretty much like Age of Empires 1.\n- The campaign AI is so annoying. Enemies just go to force march and dodge your entire army and when you force march to chase, on next turn they cancel force march and ambush you and destroy all your army while ally armies can't join because it's an \"ambush\" then they again switch to force march and disappear to the darkness of the map. The only way to counter is to just hide in cities or chase enemy army by normal marching like idiots and AI just runs around for 1000 turns and if you forget to do your move for one turn you lose your entire army and city.\n- The enemy decides to take siege of your city and you immediately lose soldiers due to starvation!\n- Attacking a city has too many bugs. Battering rams not attacking gates (cursor doesn't change at all), ladders go crazy. I thought that these were bugs that were fixed in later versions but it seems like these bugs are some features of the game.\n- The stupid mobile game \"policies\" and penalties of \"expansionism\" is so bad to the point that when you start the game, you ask yourself \"why should I fight?\". You can just make a few same-culture allies and sit there forever and your allies take the entire earth. No penalty no gameplay.\n- In this game, there is limited charge implementation. Units are kinda spongy and they just rub into each other. In rome 1, even if you had the worst cavalry with a bow and near zero melee ability, you could order to charge and they charged properly even if they die immediately on contact. In rome 2, your soldiers are just confused and just walk to enemy then turn around in a confused way. Even foot soldiers had proper charge in rome 1, even the peasants. In rome 2, they pretend to charge but almost no action is happening.\n- In rome 1, there was a tiny chance that a soldier gets confused in city and gets lost far away from its unit usually when a gate is too crowded. Rome 2 doesn't have tight streets, rocky terrain, and dense buildings but soldier fragmentation happens a lot! The worst part is that if enemy attacks that single soldier far away from the unit, your entire unit 1 mile away would say \"we are attacked from behind\" and flees! In rome 1, if a soldier is lost and bumps into enemy, the unit 1 mile away won't flee for being attacked from behind or something.\n- In rome 1, you could not send 10 soldiers to attack 500 enemy soldiers even if you have 10000 soldiers on the battlefield far away. In rome 2, you always need to kill enemy unit to the last soldier even if it is completely isolated. The morale system is very simplistic so that soldiers only care about total size of armies and barely care about their situation. Even mobs rarely flee early and you have to kill almost to the last soldier. I hate how simplistic and stupid the morale system is. Losing generals has very small effect in rome 2. In rome 1, death of a fancy general caused a massive morale loss of your army and when the general was alive, even if he was far away, the effect on total morale was big. Also, I never ever seen enemy army deciding to flee early based on the situation in rome 2. In rome 1, sometimes the enemy was deciding to entirely flee from the battlefield and avoid any contact. In rome 1, a routing unit could change its mind and return to battle but not in rome 2.\n- This game has some magical abilities so that you can cast spell on your soldiers and enemy soldiers in a very strange and stupid way. In rome 1, the effect of general was very global and rally barely had any magical effect.\n- Fatigue in rome 1 was very sensitive to terrain slope. I don't even notice anything in rome 2. Does this logic even exist? In rome 1, being on a hill not only gave so much power to your archers but also it could make enemy soldiers tired to climb and when they reach to you, they are already tired depending on the slope they had to travel.\n- The campaign map has annoying elevation changes and clouds and \"unassigned skill\" or \"unassigned edict\" that make the game annoying. The map of rome 1 was easier to understand despite the potential to have many number of armies. In rome 2, you have few armies but the map is hard to understand and flags are less descriptive. Also some factions have very bad color on battlefield that you can't see the type of the unit.\n- Why most of the cities don't have even basic walls? I don't like the province system that you control a village and your ally controls the main city. Rome 1 was way better.\n- For some reason greeks and romans speak fluent british english while british people in this game kinda talk like pigs snoring and they have worse accent. Historically those greeks and romans were speaking just like these mexicans that high-likely the developers of this game mock them every day. Also asian people have strange offensive dialog that shows some level of propaganda is embedded in this game. Rome 1 had integrity.  Eastern factions constantly say \"what cruelty do you wish oh lord?\", hmm?\n- The music is horrible to the point that violin sound really causes headache in the battles. Compared to rome 1 music, this is absolute garbage that I can't even defend a single battle track of rome 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The moment i saw arrows were not real arrows and were instead white lines and randomly enemy units would drop dead i stopped playing, Shogun 2 did it better so i'm gonna just keep playing that.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The grand campaign can be fun, probably the only good thing about this game.  The historical battles are an absolute joke.  Troop counts that dont make sense and dont fit what troops were there historically leading to some pretty stupid battles where theyre just simply too hard when in reality, the side youre on had more troops yet the enemy has well over double your troops... again historically that makes no sense.  Your troops are beyond useless and retreat with an almost full squad... winning the battle yet my men retreat for no reason leading to a loss after a long time of careful prep, general is still alive too.  Big battles just simply dont work right.. its like the engine cant handle it.. your men wont listen...  its just frustrating for something that isnt hard.  Go to custom battle and its broken.. again the engine cant handle the amount of troops making big siege battles unplayable... Go into grand campaign and you dont experience any of this BS.  \n\nPlayed for so long on just grand campaign and loved it.  Decided to try what else this game has to offer and it was so bad that it made me realize how broken this game is... I uninstalled and just had to put out a review.  I can only recommend the game for the grand campaign... everything else its like hellen keller created it.  And not to mention having blood and gore as a DLC add on is scummy beyond scummy.. youd think that would be part of the main game.. like how stupid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CA's greed is unmatched. They release DLC for 10+ euros and yet they REFUSE to fix anything about the game. No textures, no bug fixed, not even implementing the fixes created by the community. Not to mention they killed multiplayer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've tried so many times through the years to enjoy this game. But it is filled with bugs and blatant cheats that benefit the AI that it is just unplayable. I've tried mods and other forms of ways to play this game. But it is just absoluetly one of the worst in the entire series. Sieges are a joke and the \"bad luck\" that seems to strike all the time as the player is to ridiculous to ignore. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i want to recomend this game because i love playing it but i have had several crashes during campaigns and i am getting tired of it. it started to happen after my update to windows 11 so if you have window 11 dont buy this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sucks to say since I loved the first Rome Total War game, but this is genuinely the worst installation in the franchise I've experienced. I would recommend any other Total War game before this one, because they are way more intuitive and fleshed out. Warhammer III, Shogun II, Three Kingdoms, each a unique experience and hours upon hours of fun. This one however just finds a way to be irritating and annoying at every turn.\n\nI won't go into specific critiques because it's honeslty the smallest complaints but they cause constant friction and pile up, but just a few are things like the wonky camera controls, units defaulting to walking over sprinting, slow early game progression, the AI making decisions that are dog-water in their longterm but a masterclass in making your experience miserable. I just couldn't get a foothold in fun with this, and that saddens me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Any given older Total War is better and I suggest them you play those instead\r\nIf you somehow prefer the army system where you can't detach units that only exists because CA are bad programmers and couldn't fix a critical bug in their engine, play Attila instead. The battles in Attila are way better than in here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enjoy this game a lot. But at times it is terribly unstable. You can fight an amazing battle and win against all odds,... and then it suddenly crushes without a save. So frustrating!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they game is great but every time i get to a certain  point in the campaign my screen blacked out and i cant do anything but i can still see my mouse cursor on the screen???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just got this crap to play a mod. Wasn't worth it\nThis was the start of dumb Total War, everything before this one was going the right direction, then this RPG oriented and simplified management crap, i wish this trash never came out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rome II is like SimCity (2013), a mediocre game that tries every single way to piss you off. The difference between them is that SimCity had their reckoning, which came from Cities Skylines, & after the reckoning, no one cared about SimCity (2013) except as a weird gimmick from the past. However, Rome II has never had true competition, & as such, people had to make do by modding it. Some of those mods that came out make this game great; however, the base game that you paid for remains mediocre to this day. You don't pay for the game; you pay for the game engine that you run someone else's game on. You should also never buy Rome II at AUD $89.9 when you can wait a month & get it for AUD $22.5, which, even at that price, is still taking the piss out of you from this old game. The DLC pricing for this game is on such a level that even EA would start taking notes. It's okay to like these two games, but people recognise that SimCity (2013) was bad. I do believe that most people here who are saying that this is a great game have some form of Stockholm syndrome. Rome II is bad; it never got good, nor was it replaced by something superior, & it's unworthy of being the best grand battle game set in Roman times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 1431 hours on the game I have officially given up on the game. As im sure you will find out by searching reviews and seeing videos online. This game is absolutely fantastic. Vanilla experience is great but massively improved with mods. Visuals, troop packs, map visuals, sound tracks. I had all of these and had an amazing experience that I will truly never forget. But if you like having those, be prepared to be forced to say goodbye.\nThis was all ruined by their mod launcher. Firstly it started as being laggy but even if i reduced the inactive aswell as active mods it did nothing. Then it got impossible to start the game as it was so laggy it would take 5 minutes to press start because of the mod loader,then told me all my mods are corrupt but would launch it just like before as if nothing was wrong. And now it wont even launch one mod without crashing. But at the end of the day i cant play this game anymore because they changed something. I tried uninstalling, deleting data, deleting the mod launcher. I searched the internet on how to fix it - nothing worked. One of my top 2 games that i always play is now unplayable to me. Thank you for the memories. Goodbye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When you have to play a level for six hours, trying every possible variation to win, with no available option to increase or decrease your chances of winning, it's not good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool looking game, just not my style at all in terms of gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like all total war games, the AI units have faster response time. units that follow orders (ranged actually firing their weapons) in every game the ranged units do this thing where you tell them to attack an in range enemy unit they run forward then get maybe one or two volleys off before the ai infantry who seem to out pace my fresh cavalry lock them in combat one or two units forcing the entire untit to ignore any further orders and stand there being slayed.  I just watched an enemy heavy infantry intercept and then keep pace with cavalry. its hard to enjoy a game when your always playing a cheater.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Imagine having to constantly force quit a game because half your army jumps into the ocean. So many game-breaking bugs. How does this game have such a good reputation. Also, the tutorials are terrible. Not hard to beat, but the game does a terrible job of teaching you the mechanics. Key game mechanics were left unmentioned, and I only stumbled upon them by watching YouTube guides.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everytime I load into a game it gets stuck on the loading screen at 0%. Wish I could refund this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just installed it and battles do not launch anymore. Watch out that you will very probably need mods to have the game functioning on a recent PC.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Probably the most annoying Total War game. \n\nFrom sloppy, unsatisfying battles that are more stat mashing than tactics, to an unintuitive political system that would be better off not existing, to a kneecapped campaign map with limited armies, to a frustrating province system that is more spreadsheet and encyclopedia book than strategic.\n\nWhile far from a terrible game, any one of the above issues alone make this game pale in comparison to any of the previous titles, including the original Rome Total War. Any time I get the Total War itch and attempt to gain enjoyment from this game and uncover the mystery of why it is well received, and now over a decade old and still one of the most played Total War games, the first battle is a crushing reminder of how tepidly middling, frustrating and unsatisfying this game is. \n\nFor every fault this game has, a previous title corrects(I say that as someone who got into Total War with this game!), and for every new feature this game adds with merit, Attila does better. Rome 2 Total War isn’t awful, but I absolutely hate this game with every fibre of my being, and I think less of you for enjoying it. \n\nTo give some examples of how this game plays out on the battle and campaign map;\n\nBATTLES:\n\nI fought off an attacking army with a garrison, killing the enemy general. The garrison is of predetermined composition that cannot be supplemented without sacrificing a limited field army slot. The next turn the same enemy army attacks my same settlement, and while both my garrison and the enemy army are depleted. However,  because I made the strategic error of killing the enemy general in the last engagement(Sun Zu warns about this!), this enemy army has a completely new and fully replenished elite general’s unit in this battle. Despite completely surrounding this general, my skirmishers emptying into its exposed flanks, this elite unit easily overcomes and destroys my weakened garrison. Where’s the strategy in this? I was actively punished for winning a battle by the fact that the enemy, in my territory, can replenish an entire unit powerful enough to single handedly win battles. My garrison, being limited to the defence of the settlement, is forced to just watch this defeated army sit outside the gates and magically create a new elite generals body guard that will soon slaughter them all!\n\nI made the mistake of playing a Sparta campaign as one of my first campaigns. Sparta is perhaps the faction that makes this game's issues the most apparent, as its roster consists of units with high defence and low killing power, and limited cavalry. Most battles were reduced to slugging matches where after my skirmishers depleted their ammunition, I could do nothing but click 3x speed and watch my superior stats grind down the enemies. Unlike previous games, battles rely far less on morale and it is much more likely units will fight until 10-15 men remain. While this does draw out battles in a way that in theory could introduce more tactical options, in reality it just means you have time to micro your cavalry and skirmishers twice as much to squeeze out a few more kills.\n\nIt should be noted that the new health pool units have make skirmishers busted and cavalry pathetic. Instead of a dice roll if an arrow kills or glances a model, it deals damage that slowly whittles down a unit. Meanwhile a cavalry charge now works in that same fashion, so a charge that would decimate a unit in the original Rome total war might in this game deal damage without killing a single model!  \n\nCAMPAIGN MAP\n\nThe province system limits building options, reducing choice and strategic depth into a spreadsheet meta builder. Where as in the first game, you might have to consider the costs and time of building roads to connect your elite barracks in your home region to your frontier, or perhaps setting up a new recruitment center closer to the front, or maybe a region is overpopulated to the point of squalor and needs more governance. In this game these choices are practically predetermined. Provinces must be specialized into either economic or military with limited building slots at your disposal. Public order is an active consideration that needs to be balanced constantly. It gives the illusion of choice with 15 different types of each cultural, economic and public order building trees, but in reality this just leads to a moment of frustrating confusion as you figure out the ideal building layout for each province through the cumbersome encyclopedia. There isn't a strategy to decide which of the 15 different economic buildings offers a 5% bonus to income, or which of 15 different public order buildings I need to most efficiently keep the province stable. It is an incredibly cumbersome and mind numbing task. \n\nYou’ll also have to stake out a single province to place down all the military buildings and their minor stat boosting compatriots. It's hilarious how poorly implemented and thought out the military building is. To field the whole roster you’ll need a whole province dedicated to the task, leaving most of your units to the mid game when you have etched out enough space. The AI doesn’t have this ability, so most factions spend the entire game with one region and one stack of tier one spear units, the only units they can recruit. I can’t stress out enough just how bad this is, why would I invest in one or two military buildings spread out and unbalancing the awful public order/economy mini game, when I might as well wait out a few more turns with tier one slop and mercenaries until I can plop down each kind of barracks and each kind of stat boosting military building in one province? It is just absolutely mind-boggeling the game is designed this way, both for the player and the fact the AI is totally incapable of interacting with it in a meaningful way! \n\nThe politics system is something I can only imagine no player wants to deal with. In theory it offers interesting mechanics and organic fleshed out civil wars, in reality it is just a nerf to expansion and a chore to deal with. Every couple of turns you have to check in on it, click a few buttons out of dozens of confusing options to bring everything back to stasis. \n\nI could go into the deep reaching effects the removal of general-less armies has, but this review is long enough!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no its horrible. The original is was way better, the information pannels make it hard to see what troops you got and its way harder to see ur town dont like it. wish they would bring back the original",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "How is there not a option to disable Civil war or slave uprisings?????? slave armys are way too powerful and will spawn in 4 armys a turn 20 units strong!!!!!! destroying everthing they come across would be a great and a simple setting if you could simply disable these two obnoxious things. the fact that some peasant slaves are as much of a threat as they are is ridiculous they are more of a threat then any other faction because they will spawn in random places in the  empire where you have no armys and proceed to destroy everthing also the civil war element is totall bs i dont care for dealing with the politics in this game therefore im punished with half of my empire turning against me 4 plus hours wasted in a heartbeat..... other then those two things i mentioned the game is pretty fun but its sadly unplayable due to those two things you cant turn off for some reason.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "IMHO Creative Assembly rival Bethesda in their hate for their fans and player base. CA seems to love going out of their way to break their own games and leave players high and dry. They’ll never get any more money from me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The loading screens still freeze from time to time in this 12 year old game. Fix your games ca.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game freezes loading battles on new PC. Fix your shit assholes",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The big problem with this game is, that after a certain number of turns it gets buggy. So i have a campaign thats like 130 turns now and sometimes battles dont load and results in a game crash. Somehow its also the case that when i want to exit it sometimes doesnt work and the game crashes. This ofc ruins teh whole campaign and is one of the reasons i havent played a full camapign even after +800h.\n\nThere are ofc other issues such as the AI being braindead, but this is in every TW game or the mod loader breaking and resulting it being laggy.\n\nOtherwise the game is decent and worth the money if its 10-15 euro, but keep in mind that it is an older title and its only 32bit (issues with newer CPUs and cannot use more than 4gb VRAM). \n\nRome 2 was the last good historical title that was released and form all the games from TW is the only one i still play semi regulary. The reason i am not recommending it outright is bc of the campaign issues and these will sadly never be fixed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Games should never have Achievements which are time-locked so that you can never get them unless you were playing the game at the right time to even be eligible for them. It isn't an “Achievement” to have been playing the game at a particular date and time.\n\nIt is simply a way to ensure that only those who were already playing the game consistently at a specific date and time can ever have 100% Achievements. If you care about getting 100% Achievements, this is not a game for you. Time-locked Achievements will guarantee you will be stuck at 98-99% essentially forever, at a maximum.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DLC is not working very dissapointingby CA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Optimization is just sad",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth the squeeze.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not as good as Rome 1",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its mostly all downhill from here",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stupid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shite",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I still remember when this game was announced all those years ago, I was so young, and I loved the total war franchise and you could imagine how excited I was for this game.  I remember playing it around launch and experiencing some really crazy crashes and bugs, the experience was a bit disappointing and since launch I have played this game to limited capacity since.\n\nI will say, this game has come a long way in terms of performance I believe and some of the bug fixes and patch work has definitely helped, but to me this game still just doesn't compare to the older titles. I have tried giving this game many fresh starts trying to understand and enjoy the experience, but each time I load into a battle, I see some of the same things that really made it hard to enjoy Empire and Napoleon total war. \n\nI'm not going to go into to much detail further, but I will say that I can appreciate the attempt at seizing romes former glory, and there are some things I can still appreciate about it, but overall the experience fails to me. I think if I were going to recommend any total war game from the warscape engine era, I would highly recommend shogun 2 total war, its really well polished, and plays extremely well despite its engine.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "This game is from 2015. I have a beefy computer and clean install, no mods. It crashes every time I try a manual battle. Folks on reddit found temporary fixes, but no one has a long term solution and even the short term ones seem to stop working after a while. This is really disappointing since the game was fun until it ground to a halt.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "They're really asking $60 for this? I don't think I paid that much when it was new. Despite being a decent game (not as good as the first with mods) I'm giving it a thumbs down just for the ripoff pricing. Its old and it shows.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is beyond hope. Army units either turn invulnerable randomly where your world class cavalry spends the entire battle unable to beat a small group of archers, or midway thru the campaign, you lose the ability to scroll on the world map unless you can find a save game before it glitched. This is exactly why the video game industry is failing. If they had to return money for people who dislike a game they would not make money. They don't make good games anymore, they just use that money on marketing to convince people to waste money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tried playing this several times with and without mods and always run into issues with custom battles (i.e.: the custom fund glitch) and other parts of the game and interface. The devs don't seem to care at all with any title in this series and just screw over the fanbase. It's a shame for me since I grew up loving the first Medieval title. Can't recommend this game, highly suggest choosing a different franchise and developer altogether.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Windows 11 update broke it and CA devs have been pretty consistently bad at fixing problems with their games since the Warhammer money printer came out.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game when i played a few years ago but now in late 2025 I cant load into any battles without crashing and havent been able to find a fix no matter what code is deleted or changed even without mods and files completely deleted.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The start of the downfall of what was once one of the greatest strategy game developers ever. Bad launch, constant dip and dime dlcs and still a mess almost a decade after launch.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I thought that the version I played long time ago was kinda an early release and the issues are resolved but this game has too many major problems that it's hard to list them all (steam review limitations). I do my best to list them as much as I can with evidence and comparison to rome 1.\n- The archery in this game is so bad that slingers have more range and power than any archer in the game. In rome 1, slingers have short range and they shoot straight instead of a ballistic trajectory. Projectiles in rome 2 have a very lame slow motion trajectories to the point that you can easily dodge them. Also your unit flashes red before it's hit by enemy arrow even just before the enemy shoots its arrows. Also in rome 1, height advantage was immediate, to the point that even slightest change of elevation would change the range of your archers in a certain direction. Rome 2 is more like a simplistic mobile game that your units have a fixed circle of range around them.\n- The game has insane friendly fire similar to rome 1. However, rome 1 barbaric invasion fixed this issue to a great degree. In this game one single enemy horse gets too close to your archers and instead of fleeing when facing 10000 archers, it jumps in and your archers just kill each other by shooting 1000 arrows into each other.\n- Enemy AI is way worse than rome 1. The enemy just follows you even when they make a fort to defend themselves. In rome 1, this behavior could be seen only when the enemy had significantly larger army to just blindly chase you. The enemy archers tactically flee even when they are behind a massive army. So you can easily trick them to stop shooting by spam attack and cancel. This behavior existed in rome 1 to a limited degree but the AI was smart enough to camp behind the line and continuously shoot.\n- There are near zero physics in this game, much less than rome 1. For instance, in rome 1, shield was a real object that the direction of arrow and shield would matter a lot. This game is pretty much a mobile game such that the arrows just hit sponges and usually they kill no matter how large the shield is or the direction of the shield. It doesn't matter if you shoot enemy from behind or front, they just carry shield on their head and things are pretty much like Age of Empires 1.\n- The campaign AI is so annoying. Enemies just go to force march and dodge your entire army and when you force march to chase, on next turn they cancel force march and ambush you and destroy all your army while ally armies can't join because it's an \"ambush\" then they again switch to force march and disappear to the darkness of the map. The only way to counter is to just hide in cities or chase enemy army by normal marching like idiots and AI just runs around for 1000 turns and if you forget to do your move for one turn you lose your entire army and city.\n- The enemy decides to take siege of your city and you immediately lose soldiers due to starvation!\n- Attacking a city has too many bugs. Battering rams not attacking gates (cursor doesn't change at all), ladders go crazy. I thought that these were bugs that were fixed in later versions but it seems like these bugs are some features of the game.\n- The stupid mobile game \"policies\" and penalties of \"expansionism\" is so bad to the point that when you start the game, you ask yourself \"why should I fight?\". You can just make a few same-culture allies and sit there forever and your allies take the entire earth. No penalty no gameplay.\n- In this game, there is limited charge implementation. Units are kinda spongy and they just rub into each other. In rome 1, even if you had the worst cavalry with a bow and near zero melee ability, you could order to charge and they charged properly even if they die immediately on contact. In rome 2, your soldiers are just confused and just walk to enemy then turn around in a confused way. Even foot soldiers had proper charge in rome 1, even the peasants. In rome 2, they pretend to charge but almost no action is happening.\n- In rome 1, there was a tiny chance that a soldier gets confused in city and gets lost far away from its unit usually when a gate is too crowded. Rome 2 doesn't have tight streets, rocky terrain, and dense buildings but soldier fragmentation happens a lot! The worst part is that if enemy attacks that single soldier far away from the unit, your entire unit 1 mile away would say \"we are attacked from behind\" and flees! In rome 1, if a soldier is lost and bumps into enemy, the unit 1 mile away won't flee for being attacked from behind or something.\n- In rome 1, you could not send 10 soldiers to attack 500 enemy soldiers even if you have 10000 soldiers on the battlefield far away. In rome 2, you always need to kill enemy unit to the last soldier even if it is completely isolated. The morale system is very simplistic so that soldiers only care about total size of armies and barely care about their situation. Even mobs rarely flee early and you have to kill almost to the last soldier. I hate how simplistic and stupid the morale system is. Losing generals has very small effect in rome 2. In rome 1, death of a fancy general caused a massive morale loss of your army and when the general was alive, even if he was far away, the effect on total morale was big. Also, I never ever seen enemy army deciding to flee early based on the situation in rome 2. In rome 1, sometimes the enemy was deciding to entirely flee from the battlefield and avoid any contact. In rome 1, a routing unit could change its mind and return to battle but not in rome 2.\n- This game has some magical abilities so that you can cast spell on your soldiers and enemy soldiers in a very strange and stupid way. In rome 1, the effect of general was very global and rally barely had any magical effect.\n- Fatigue in rome 1 was very sensitive to terrain slope. I don't even notice anything in rome 2. Does this logic even exist? In rome 1, being on a hill not only gave so much power to your archers but also it could make enemy soldiers tired to climb and when they reach to you, they are already tired depending on the slope they had to travel.\n- The campaign map has annoying elevation changes and clouds and \"unassigned skill\" or \"unassigned edict\" that make the game annoying. The map of rome 1 was easier to understand despite the potential to have many number of armies. In rome 2, you have few armies but the map is hard to understand and flags are less descriptive. Also some factions have very bad color on battlefield that you can't see the type of the unit.\n- Why most of the cities don't have even basic walls? I don't like the province system that you control a village and your ally controls the main city. Rome 1 was way better.\n- For some reason greeks and romans speak fluent british english while british people in this game kinda talk like pigs snoring and they have worse accent. Historically those greeks and romans were speaking just like these mexicans that high-likely the developers of this game mock them every day. Also asian people have strange offensive dialog that shows some level of propaganda is embedded in this game. Rome 1 had integrity.  Eastern factions constantly say \"what cruelty do you wish oh lord?\", hmm?\n- The music is horrible to the point that violin sound really causes headache in the battles. Compared to rome 1 music, this is absolute garbage that I can't even defend a single battle track of rome 2.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The moment i saw arrows were not real arrows and were instead white lines and randomly enemy units would drop dead i stopped playing, Shogun 2 did it better so i'm gonna just keep playing that.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The grand campaign can be fun, probably the only good thing about this game.  The historical battles are an absolute joke.  Troop counts that dont make sense and dont fit what troops were there historically leading to some pretty stupid battles where theyre just simply too hard when in reality, the side youre on had more troops yet the enemy has well over double your troops... again historically that makes no sense.  Your troops are beyond useless and retreat with an almost full squad... winning the battle yet my men retreat for no reason leading to a loss after a long time of careful prep, general is still alive too.  Big battles just simply dont work right.. its like the engine cant handle it.. your men wont listen...  its just frustrating for something that isnt hard.  Go to custom battle and its broken.. again the engine cant handle the amount of troops making big siege battles unplayable... Go into grand campaign and you dont experience any of this BS.  \n\nPlayed for so long on just grand campaign and loved it.  Decided to try what else this game has to offer and it was so bad that it made me realize how broken this game is... I uninstalled and just had to put out a review.  I can only recommend the game for the grand campaign... everything else its like hellen keller created it.  And not to mention having blood and gore as a DLC add on is scummy beyond scummy.. youd think that would be part of the main game.. like how stupid.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CA's greed is unmatched. They release DLC for 10+ euros and yet they REFUSE to fix anything about the game. No textures, no bug fixed, not even implementing the fixes created by the community. Not to mention they killed multiplayer.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've tried so many times through the years to enjoy this game. But it is filled with bugs and blatant cheats that benefit the AI that it is just unplayable. I've tried mods and other forms of ways to play this game. But it is just absoluetly one of the worst in the entire series. Sieges are a joke and the \"bad luck\" that seems to strike all the time as the player is to ridiculous to ignore. Do not recommend.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i want to recomend this game because i love playing it but i have had several crashes during campaigns and i am getting tired of it. it started to happen after my update to windows 11 so if you have window 11 dont buy this",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sucks to say since I loved the first Rome Total War game, but this is genuinely the worst installation in the franchise I've experienced. I would recommend any other Total War game before this one, because they are way more intuitive and fleshed out. Warhammer III, Shogun II, Three Kingdoms, each a unique experience and hours upon hours of fun. This one however just finds a way to be irritating and annoying at every turn.\n\nI won't go into specific critiques because it's honeslty the smallest complaints but they cause constant friction and pile up, but just a few are things like the wonky camera controls, units defaulting to walking over sprinting, slow early game progression, the AI making decisions that are dog-water in their longterm but a masterclass in making your experience miserable. I just couldn't get a foothold in fun with this, and that saddens me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Any given older Total War is better and I suggest them you play those instead\r\nIf you somehow prefer the army system where you can't detach units that only exists because CA are bad programmers and couldn't fix a critical bug in their engine, play Attila instead. The battles in Attila are way better than in here.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Enjoy this game a lot. But at times it is terribly unstable. You can fight an amazing battle and win against all odds,... and then it suddenly crushes without a save. So frustrating!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they game is great but every time i get to a certain  point in the campaign my screen blacked out and i cant do anything but i can still see my mouse cursor on the screen???",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just got this crap to play a mod. Wasn't worth it\nThis was the start of dumb Total War, everything before this one was going the right direction, then this RPG oriented and simplified management crap, i wish this trash never came out.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Rome II is like SimCity (2013), a mediocre game that tries every single way to piss you off. The difference between them is that SimCity had their reckoning, which came from Cities Skylines, & after the reckoning, no one cared about SimCity (2013) except as a weird gimmick from the past. However, Rome II has never had true competition, & as such, people had to make do by modding it. Some of those mods that came out make this game great; however, the base game that you paid for remains mediocre to this day. You don't pay for the game; you pay for the game engine that you run someone else's game on. You should also never buy Rome II at AUD $89.9 when you can wait a month & get it for AUD $22.5, which, even at that price, is still taking the piss out of you from this old game. The DLC pricing for this game is on such a level that even EA would start taking notes. It's okay to like these two games, but people recognise that SimCity (2013) was bad. I do believe that most people here who are saying that this is a great game have some form of Stockholm syndrome. Rome II is bad; it never got good, nor was it replaced by something superior, & it's unworthy of being the best grand battle game set in Roman times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 1431 hours on the game I have officially given up on the game. As im sure you will find out by searching reviews and seeing videos online. This game is absolutely fantastic. Vanilla experience is great but massively improved with mods. Visuals, troop packs, map visuals, sound tracks. I had all of these and had an amazing experience that I will truly never forget. But if you like having those, be prepared to be forced to say goodbye.\nThis was all ruined by their mod launcher. Firstly it started as being laggy but even if i reduced the inactive aswell as active mods it did nothing. Then it got impossible to start the game as it was so laggy it would take 5 minutes to press start because of the mod loader,then told me all my mods are corrupt but would launch it just like before as if nothing was wrong. And now it wont even launch one mod without crashing. But at the end of the day i cant play this game anymore because they changed something. I tried uninstalling, deleting data, deleting the mod launcher. I searched the internet on how to fix it - nothing worked. One of my top 2 games that i always play is now unplayable to me. Thank you for the memories. Goodbye.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When you have to play a level for six hours, trying every possible variation to win, with no available option to increase or decrease your chances of winning, it's not good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool looking game, just not my style at all in terms of gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Like all total war games, the AI units have faster response time. units that follow orders (ranged actually firing their weapons) in every game the ranged units do this thing where you tell them to attack an in range enemy unit they run forward then get maybe one or two volleys off before the ai infantry who seem to out pace my fresh cavalry lock them in combat one or two units forcing the entire untit to ignore any further orders and stand there being slayed.  I just watched an enemy heavy infantry intercept and then keep pace with cavalry. its hard to enjoy a game when your always playing a cheater.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Imagine having to constantly force quit a game because half your army jumps into the ocean. So many game-breaking bugs. How does this game have such a good reputation. Also, the tutorials are terrible. Not hard to beat, but the game does a terrible job of teaching you the mechanics. Key game mechanics were left unmentioned, and I only stumbled upon them by watching YouTube guides.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everytime I load into a game it gets stuck on the loading screen at 0%. Wish I could refund this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just installed it and battles do not launch anymore. Watch out that you will very probably need mods to have the game functioning on a recent PC.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Probably the most annoying Total War game. \n\nFrom sloppy, unsatisfying battles that are more stat mashing than tactics, to an unintuitive political system that would be better off not existing, to a kneecapped campaign map with limited armies, to a frustrating province system that is more spreadsheet and encyclopedia book than strategic.\n\nWhile far from a terrible game, any one of the above issues alone make this game pale in comparison to any of the previous titles, including the original Rome Total War. Any time I get the Total War itch and attempt to gain enjoyment from this game and uncover the mystery of why it is well received, and now over a decade old and still one of the most played Total War games, the first battle is a crushing reminder of how tepidly middling, frustrating and unsatisfying this game is. \n\nFor every fault this game has, a previous title corrects(I say that as someone who got into Total War with this game!), and for every new feature this game adds with merit, Attila does better. Rome 2 Total War isn’t awful, but I absolutely hate this game with every fibre of my being, and I think less of you for enjoying it. \n\nTo give some examples of how this game plays out on the battle and campaign map;\n\nBATTLES:\n\nI fought off an attacking army with a garrison, killing the enemy general. The garrison is of predetermined composition that cannot be supplemented without sacrificing a limited field army slot. The next turn the same enemy army attacks my same settlement, and while both my garrison and the enemy army are depleted. However,  because I made the strategic error of killing the enemy general in the last engagement(Sun Zu warns about this!), this enemy army has a completely new and fully replenished elite general’s unit in this battle. Despite completely surrounding this general, my skirmishers emptying into its exposed flanks, this elite unit easily overcomes and destroys my weakened garrison. Where’s the strategy in this? I was actively punished for winning a battle by the fact that the enemy, in my territory, can replenish an entire unit powerful enough to single handedly win battles. My garrison, being limited to the defence of the settlement, is forced to just watch this defeated army sit outside the gates and magically create a new elite generals body guard that will soon slaughter them all!\n\nI made the mistake of playing a Sparta campaign as one of my first campaigns. Sparta is perhaps the faction that makes this game's issues the most apparent, as its roster consists of units with high defence and low killing power, and limited cavalry. Most battles were reduced to slugging matches where after my skirmishers depleted their ammunition, I could do nothing but click 3x speed and watch my superior stats grind down the enemies. Unlike previous games, battles rely far less on morale and it is much more likely units will fight until 10-15 men remain. While this does draw out battles in a way that in theory could introduce more tactical options, in reality it just means you have time to micro your cavalry and skirmishers twice as much to squeeze out a few more kills.\n\nIt should be noted that the new health pool units have make skirmishers busted and cavalry pathetic. Instead of a dice roll if an arrow kills or glances a model, it deals damage that slowly whittles down a unit. Meanwhile a cavalry charge now works in that same fashion, so a charge that would decimate a unit in the original Rome total war might in this game deal damage without killing a single model!  \n\nCAMPAIGN MAP\n\nThe province system limits building options, reducing choice and strategic depth into a spreadsheet meta builder. Where as in the first game, you might have to consider the costs and time of building roads to connect your elite barracks in your home region to your frontier, or perhaps setting up a new recruitment center closer to the front, or maybe a region is overpopulated to the point of squalor and needs more governance. In this game these choices are practically predetermined. Provinces must be specialized into either economic or military with limited building slots at your disposal. Public order is an active consideration that needs to be balanced constantly. It gives the illusion of choice with 15 different types of each cultural, economic and public order building trees, but in reality this just leads to a moment of frustrating confusion as you figure out the ideal building layout for each province through the cumbersome encyclopedia. There isn't a strategy to decide which of the 15 different economic buildings offers a 5% bonus to income, or which of 15 different public order buildings I need to most efficiently keep the province stable. It is an incredibly cumbersome and mind numbing task. \n\nYou’ll also have to stake out a single province to place down all the military buildings and their minor stat boosting compatriots. It's hilarious how poorly implemented and thought out the military building is. To field the whole roster you’ll need a whole province dedicated to the task, leaving most of your units to the mid game when you have etched out enough space. The AI doesn’t have this ability, so most factions spend the entire game with one region and one stack of tier one spear units, the only units they can recruit. I can’t stress out enough just how bad this is, why would I invest in one or two military buildings spread out and unbalancing the awful public order/economy mini game, when I might as well wait out a few more turns with tier one slop and mercenaries until I can plop down each kind of barracks and each kind of stat boosting military building in one province? It is just absolutely mind-boggeling the game is designed this way, both for the player and the fact the AI is totally incapable of interacting with it in a meaningful way! \n\nThe politics system is something I can only imagine no player wants to deal with. In theory it offers interesting mechanics and organic fleshed out civil wars, in reality it is just a nerf to expansion and a chore to deal with. Every couple of turns you have to check in on it, click a few buttons out of dozens of confusing options to bring everything back to stasis. \n\nI could go into the deep reaching effects the removal of general-less armies has, but this review is long enough!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no its horrible. The original is was way better, the information pannels make it hard to see what troops you got and its way harder to see ur town dont like it. wish they would bring back the original",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}