{
  "positive": [
    {
      "review": "I love sniper elite resistence, as  new gamer I picked it up quite easy. However, I started on 5 and feel a little ripped off with the survival maps from 5 being reused on a game I paid new game dollar for and the fact that nearly a year after the games release there are still bugs in the maps.",
      "voted_up": true,
      "votes_helpful": 13
    },
    {
      "review": "It seems a bit redundant being similar to Sniper Elite 5, with a few small changes from its predecessor, which isn't necessarily the worst thing that could happen.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A solid return for the series. Sniping feels amazing as always, with satisfying ballistics and brutal kill-cams. The missions give you multiple ways to approach targets, and the stealth gameplay is actually rewarding. It’s not perfect, but if you enjoy tactical shooters and slow, planned combat, this one is definitely worth playing.\n\n8/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "A nice, slow paced action game where your willingness to perform thorough reconnaissance is well rewarded, and simple mistakes will result in having to change position very quickly. It's fun setting traps, distracting enemies, timing your shots to be masked and such. I had a great time playing carefully through the campaign.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Nice single player gameplay but i wish it had a bigger story and more maps!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is not bad by itself, gameplay is everything u knew from previous titles in the series, the only new addition is Propaganda missions. Game, as usual with Asura engine lacks proper anti-alliasing option, unless u playing on 4k resolution. Biggest downsight is the fact that developers just decided to recycle some maps from SE 5. If u gonna buy it on bigger sale, u gonna be satisfied.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i enjoy it , the only thing that bugs me is when you have to keep running around after youve killed everybody just to find some files , it seems to happen quite often that they create a maze of rooms and corridors that dont lead you where they should .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game series I have played and this one tops it again. But I still miss Karl.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a good game but the Denuvo Anti-Cheat that has to be installed to play multiplayer causes my pc to freeze when launching the game for the first time everyday. It gives me a Catastropic Chipset Error. I have to do a hard reset when it freezes to restart game then it works perfectly. Rebellion should fix this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game, I play it a lot and found out about it from the youtuber slorgs and I've always loved his videos. People say you should just get Sniper Elite 5 but that game is about the French against Hitler while this is the British. I just think people wanted a reason to write a bad review for this game. If you want to play this game then go ahead, don't listen to the people that say to do something otherwise. Have Fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game for fans of the sniper elite franchise. Fun solo campaign but even better with a team. Strongly recommend picking this up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is keeping up with the Sniper Elite franchise. It is both fun and challenging to play. And that is only for solo play. I still need to try the co-op.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played every sniper elite game from series. Like always, it was fun and perfect for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is another awesome release for the Sniper Elite series and I really like this one. As of this post, 25 Nov 2025, I've played 133 hours. \r\n\r\nSE: Resistance runs great on Linux Mint using Steam. Like the two previous games in the series, the only thing I did was set compatibility to use Proton Glorious Eggroll. \r\n\r\nI recommend this game to any current fans, and for those that like good stealth games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had a lot of fun with this installation of the Sniper Elite series. As a huge fan of this franchise, I think it's just as solid as any of their releases, except SE3, because jank. But the game flows well, looks great, mechanics are easy to remember and use like the rest of the prior games. Also, it gives a nice insight as to what was going on while we were playing as Karl in SE5, and love the fact we had a different area to explore. Definitely worth the money!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SE:Resistance short&easy\n-> Good \"DLC\" to SE4 for all Sniper Elite Fans, but not worth a full price titel! \n-> Wait for Sale, then buy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the greatest games of 2025 It is so fun I cannot describe it any other way this game deserves to be number one game of 2025 It's so well optimized the level of detail and over 120 FPS Just using a little over four gigabytes of VRAM on Ultra the optimization in the game engine itself are superb superior and amazing thank you developers for bringing such a beautiful game too our hands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Sniper Elite series is my comfort, go-to game whenever I need a little pick me up. Can't get enough of the eye spy and snipey snipes. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even though there's bad things about this game like any, it still has the charm and derpy ragdoll moments of any other SE game, and they gave us a Karl DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. Tons of expansive areas to move through. Somewhat linear but you arent stuck following a tight direction.\r\n\r\nLots of add-on content. Tons of replay value",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly not a bad game even if its just a leach off of the game sniper elite 5. Play if you want more maps :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent game, fun. lots to do. good action and all round a fun play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although not much of an improvement on Sniper Elite 5 this game is very much \"more of a good thing\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great graphics, great gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am thoroughly enjoying this. Gameplay is solid, story is great and the bullet cams are chefs kiss",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it even though this version seems easier to comp-lete at normal level",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nothing beats no 4 but this is a really fun replayable game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great sniper game without all the frenzy and chaos of other steam games. It is more of stalking and sniping or melee kills.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "some mechanics like climbing ladders or movement when navigating tight corners can be a bit clunky at times but otherwise its a very solid game. i like the map designs a lot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Das nuts is fun hah i just loveee shoting nazis... Btw its sniper elite same formula still fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game to play in Co-op with someone who enjoys the game. So far so good more co-op mission please but cheaper. Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a very in-depth story game, with amazing visuals and a nice spin-off to the Sniper Elite series. Very good story and I love the sniping action",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I just love it. Love the graphics. The only thing I miss is my tripwire...but great game overall, hope to get more DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I recommend this game to all budding snipers out there. I loved all the Down Loads  Great work Rebellion.\r\nMore of the same please. I can't wait for the next adventure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nobody is talking about this game and it is criminal. I saw somebody playing this on youtube and decided to pick it up, because it just looked fun. This game is now one of my favorites. The invasion system is just amazing. The gun handling, breathing, weapon variety, level design. All great.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played SE 4,5, and now Resistance.  I have been waiting for some less linear maps, and this had some advancement in that department.  This series is just plain fun, and I am happy they don't change the formula too much, just enough, and realize we just want more maps and cooperative fun..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are wondering should you buy this game, yes and no. I personally like the game and its spin on the Resistance point of view.  The missions are fun to play and theres couple new items such as the (shock granade)& (exploding bullets) more ways to play missions. I do like the use of the familiar weapon wheel and other menu's from SE5 they work well. The story is well writen and interesting. Overall i like it, however there is some issues.\n- Some places your character might get stuck while crouching or laying down.\n- Graphics look weird sometimes.\nOthers complain the game feels rushed and empty but i dont get that feeling other than the few bugs. There might be more but thats what im noticing, Not game breaking for me but annoying for sure. I do hope the issues are fixed but because of those i can't recommend the game at full price. If you can get a discount then absolutely get it if not dont buy. Will update review after playing DLC missions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Follows the typical Sniper Elite formula and been a good game so far. My only real complaint, a pet peeve really, is when developers sense your aim point to trigger a reaction in the enemy character. They use it a lot in this series. Guess the enemy are all psychic?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Invasion multiplayer mode is fun, let's you ruin other people's single player games. And by ruin, I mean enhance by adding me as an hostile NPC. Or you. Or anyone, really. Also it has graphics. The game does.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's actually an okay game\r\n\r\nhaving a spin-off where you play as Harry Hawker instead of karl Fairburne, worth to buy during sale",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay wise it's a copy paste of SE5 but game is really good. Buy it on sale along with its DLCs. Worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is great! Graphics for 2025 a little lackluster",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it just me or is this the best Sniper Elite so far? Usually I don't review games until I have 100 hours under my belt but I just bought some DLC to further explore those missions. Very interesting collection of guns so there's endless ways to play the missions. It's a great value for your entertainment dollars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would recommend resistance to be played but I will say I was a bit disappointed in it.  It lacked the \"surprises\" in the main game and become very much rinse and repeat from mission to mission.  Also, they made it so that it was very difficult to upgrade your weapons because the damned workbenches were a bitch to find - even after playing a scenario multiple times.  I always found it laughable for the game to tell you that you are going on the most dangerous mission ever - but we cant afford to outfit you properly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its fun hunting people down. Especially the more skilled snipers. 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game to sneak around and explore in. Great visuals and gameplay. Plus invasions are super fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good fun. Nice sniper-aim-shoot game. Graphics and game play are very good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game with stunning graphics and a beautiful story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like the other games in the series, it's a great game and always exciting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the series , but this should be part of the Sniper Elite 5 really. Regardless, gonn await for a new one!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always fun shooting Nazi's in the head, Great gameplay. I love the sneeky/coward mode. Finish them one by one from a distance while keeping unseen. Whhaaaaa.: I am a great worrier!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great fun, especially with friends. The kill cam is great. The single player missions are a challenge and there is no one there to get mad if I can not Play at someone else's level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Feels more like an expansion of the fifth, nonetheless good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great fun especialy the co-op with a friend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite is a bit recycle from sniper elite 5 I sill enjoy all the content that this game has",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "British comedic responses instead of Karl's usual spiel, but great non-the-less (?)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking to become a surgeon, give this game a go! Very detailed bullet cams!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not too bad. Quite short with a very few maps. Get it during a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good storyline and shooting system",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent. Another great installation in the SE franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun campaign mode getting harder with each mission. I do feel like the developers could have come up with some new ways to attack the enemy physically",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sometimes, more of the same is just fine.\n\nWhat you're getting with Sniper Elite: Resistance, is basically more Sniper Elite 5. New maps, new guns (to a degree) and more of the same tried and tested gameplay.\n\nFor me, this was perfectly adequate this time around. Graphics and gameplay hold up well and the game was perfectly enjoyable, although I did get a very slight feeling of \"been there, done that\".\n\nI would really love to see future games cater a bit more to a proper long range shooting experience. On the simulation difficulty setting, it would be great to have some real mechanics for the player to gauge distance instead of just displaying a number in the binos. Maybe better wind gauging mechanics, instead of a line in the scope.\n\nWhatever updates they choose to go with, I do hope for a little innovation from future titles but if you have enjoyed the Sniper Elite series so far, you won't go far wrong with this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bang Bang, he shot me down\r\nBang Bang, I hit the ground\r\nBang Bang, that awful sound\r\nBang Bang, the Axis Invader shot me down",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Shooting Nazis in the balls is always a hoot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good addition to the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is top tier i hope next years is also amazing",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's more Sniper Elite. You already know if you are gonna like it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Usual Sniper Brilliance - just does not get tired",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's okay, but should have been a DLC.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love sniper elite... so much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it runs so goodly that i am playing it now again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems to be okay, for the most part",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "i very good product i recomende to by the product",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best shooters arround",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Killing Nazi's is always satisfying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great resistance havin fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Immersive in all aspects.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best sniper games available",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game so much fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best in the series!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just keeps getting better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "more sniper elite is always a good thing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's OK if you like this sort of thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS good  #4 is the beast",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gun go boom",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Indeed very elite sniping",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it all right",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shooting in testicles? eyes? feet? xray kills? hell to the yeah",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Old but gold series",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its good as Sniper Elite 5. 7.5/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "DON'T FIX WHAT ISN'T BROKEN",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "After playing for just 3 minutes this looks, feels and IS the same sniper elite 5 with an annoying new voice and character.bring carl back, come up with something new, make huge maps with LOTS of targets.WASTE OF MONEY. SHAME REBELLION!  :(",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "The overall experience feels incredibly unpolished, with awkward movement mechanics that detract from the gameplay. Character navigation feels clunky, especially when trying to vault over small obstacles or maneuver around minor rubble and debris. This lack of fluidity gives the game an outdated, almost early-2000s feel, which is a significant step back from previous Sniper Elite titles.\r\n\r\nI’m glad I didn’t pay more than $20 for it, because this entry feels like a downgrade, rather than an upgrade, compared to its predecessors. To make matters worse, the game has been monetized to the point where additional DLCs, which should have been part of the base game, are being sold as extra content. The inclusion of paid skins and levels feels like a cash grab, undermining the core experience.\r\n\r\nIt’s disappointing to see what was once a standout franchise take such a turn. It feels like the end of an era for Sniper Elite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Even worst than the SE5, the protagonist is so \"carismatic\" like Connor from AC3, very annoying, maps are shorter, is a DLC of 5 but much worst",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly more of an expansion to Sniper Elite 5 than a true new entry, which would be fine if it was cheaper, the levels are smaller and less interesting on average than SE5 and the new protagonist some how managed to be even less interesting than the old one... unless you can't get enough of the SE5 invasion mode buy on deep discount other wise just buy SE5 if you haven't already",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "\"No\" since there's no mixed option. \n\nThis game has some good levels, fun sniping moments, etc. There's a lot I liked, but there's nothing I liked more than SE5, so from the perspective of someone who owned that I can't recommend this. \n\nThis game's slight edge in level design doesn't offset buggier AI and worse production values. \n\nI'd love another game with Harry Hawker as the protagonist, though, that was a fun element.\n\nNo, but if you LOVE Sniper Elite and you like the sound of playing as Harry for a change then on sale it doesn't feel too bad of a buy. Made me want to go play more of 5 in the end though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For multiplayer: too many bugs, too many failed or refused connections, too many, many, many players cheating. If you leave a lobby and look for another one, it only lets you enter the one you left (5-10 times in a row)!!!! Unbelievable.... And last but not least, in many lobbies, 1-2 seconds of lag, unacceptable in shooter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glorified SE5 DLC not worth anything more then like £15",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a DLC, not a new game.\n\nIf you wanna play more of SE5, buy it.\n\nIf you want something new, wait for SE6.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "Bunch of reused assets from SE5 including direct clones of maps\nVery bad post processing effect leaves everything noticeably yellow and green.\nAnti-consumer pricing model\nDenuvo\nRain in the game is a complete technical disaster. Obviously attached to player, no rain sound, obnoxious white splashes.\n\nI can't be bothered writing more, this just pisses me off. Here's your negative review.\n\nThis is nothing more than a reshuffle of SE5 with big downgrades.\n\nDO BETTER!",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "I want to like this game I really do. This is just a SE5 DLC. Its a cheap rushed sad version of SE5. There is no excuse for the number of reused assets in this game.",
      "voted_up": false,
      "votes_helpful": 100
    },
    {
      "review": "Very bare bones. Not as good as Sniper Elite 5. Feels very much like a cheap, rushed cash-grab. I was introduced to Sniper Elite 5 and became a fan. Thought I'd be excited for Rebellion's next game. Now I'm realizing they're just another soulless company run on DLC and greed. Gonna stay away from their company and games from now on.",
      "voted_up": false,
      "votes_helpful": 80
    },
    {
      "review": "Don't waste your money!   To be fair....IF you are going to play this SOLO, then it looks like it would be fun to play, like the other Sniper Elite games.  HOWEVER...if you plan on playing this in co-op with a friend..forget it.  The anti-cheat, or should I say, anti-playable Denovu crap, makes the game unplayable.  It queues up the movement keys so bad, that when you release the key, the character continues to move for anywhere from 7-10 seconds longer.  So off a cliff, into the enemy lines, what ever direction you were heading.  And don't plan on the Devs doing anything about it.  I got an email from them basically saying, it's ok that I got a refund...have a good day. \nAnd before anyone asks, YES I tried every recommended fix/alteration to correct the issue.  The ONLY thing that fixed the issue, was removing Denovu.\nHave a great day guys!",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "It's an OK game, but essentially it's just more of the same and the story is even worse than in the Sniper Elite 5.\n\nThis series has a good gameplay foundation, but they NEED to evolve in terms of story/mission quality and variety and, even more, in setting diversification. I will not buy another WW2 Sniper Elite game, but i would gladly buy one with a setting in Vietnam war, Korea war, Winter War or any other fresh setting and good story.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Feels rushed. Story feels dull and shallow. The detail is missing. And I don't get why the protagonist sounds like a tough male but is portrayed as a corpulent shy teen with acne. Maybe the developers felt like that would match their playerbase more. Very rude.\n\nAreas feel empty. I have the idea that there are significantly lesser enemies in the game then previous installments. (My settings are the same). I could easily Rambo myself through the missions, because the lack of enemies made tagging and sniping very boring.\n\nAfter completion no urge to replay any mission. Think i'm going to play and ES5 again and gaze in awe of the detailed interiors of bunkers and the masses of AI enemies.\n\nIf you liked the series and want to give this one a try, best to buy it in a sale!",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After being a long time since SE 3-4 on Switch and for a couple of month the current title,  (while still in dev) supporter no finally have to give up with feeling of sheer disgust and nausea. Game is crap, for it's unbalanced, ridiculuos in many aspects, saying in stumbling at crossing the futile puny obstacles like small fences whatnot, but what this shitty title is really shining is its idotic anti-cheating policies which allows the openly cheating persons to dominate over the field without any borders any punish poor (stupid) fair players for their consistency. I can say I've wiped it out and never will buy nothing from this team again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was looking forward to this game. But I should have waited to buy it. I'm actually kinda angry with myself for buying it on release. When Sniper Elite 4 was released, I enjoyed it but I couldn't help but feel \"Huh, this just kinda feels like Sniper Elite 3...\"  But there was a more stuff, an interesting story, and I found myself pleasantly invested.\n\nWhen 5 came out, I'm gonna be honest. It felt like the EXACT same game as Sniper Elite 4. Everything felt the same, looked the same, the maps were BIGGER but I kinda was getting tired of every level being a sneaking mission. I was hoping to see some WWII combat with support sniping. Meet with Allied soldiers and work your way across enemy lines. But it was just another \"Nazi Evil Secret Plan must be stopped.\"  Which... is fine?  I just wanted more.\n\nThen this game came out, and not only do I HATE the characters, but like others have said it feels like a DLC to 5 being released at full game price. I've reached the end as a fan of this series I think... unless the next one (if there's a next one) does something incredibly different. I'll probably skip it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have loved and played the entire sniper elite series.   This is by far the laziest, and worst game  yet.   I was bored immediately.  This is SE5 dlc.  I put off buying the game as I heard others say that, bought on sale.   Should have waiting until it was free.  Is SE5 with a pointless new character, talks to much, looks like a child, game is not finished, glitches galore. I could go on, but it's trash.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried it out cos I got Slorgs videos recommended, turns out this game sucks ass harder than your average Ubisoft game.\nEven on ultra settings with HDR enabled and all that this game looks like it's from 2 Gens ago. Whoever worked on this - You're a disappointment to the series and I hope you have a great time learning from this cos holy shit do you suck at making games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is essentially Sniper Elite 5, exact same everything. The only difference is that you play as a new character. Other than that, the maps are bigger but in return it seems to have a distinct lack of enemies. Overall, if you just want a continuation of SN5 missions, this is legit. But if you want innovation in the series, this is not it. Was disapointing having to do the exact same mission objectives as the previous game. At least put in new textures, fonts, menu, skill system, literally anything different. Only ever conceivably worth if it is on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So this is a odd review. The game itself is perfect. More Sniper Elite gameplay. Nice amount of weapons, maps and modes. So why the bad rating? My game crashed every few minutes and I find out why. Denvuo. Once I reinstalled the game without it installed, the crashing went away. I contacted Rebellion and they tried blaming my M.2 drive it was installed on. I mean, I do get maybe thats an issue, even if I don't understand how. But the fact anti-cheat software crashes a game at all is a big issue for me. Now if I want to play online, I can't. Because the game crashes. \n\nOnly good news is I got the deluxe version for $40 at another site. So I'm not to mad, I'm getting my moneys worth at least single player. Which honestly is the biggest part for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even worst than the SE5, the protagonist is so \"carismatic\" like Connor from AC3, very annoying, maps are shorter, is a DLC of 5 but much worst",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly more of an expansion to Sniper Elite 5 than a true new entry, which would be fine if it was cheaper, the levels are smaller and less interesting on average than SE5 and the new protagonist some how managed to be even less interesting than the old one... unless you can't get enough of the SE5 invasion mode buy on deep discount other wise just buy SE5 if you haven't already",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing for just 3 minutes this looks, feels and IS the same sniper elite 5 with an annoying new voice and character.bring carl back, come up with something new, make huge maps with LOTS of targets.WASTE OF MONEY. SHAME REBELLION!  :(",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The overall experience feels incredibly unpolished, with awkward movement mechanics that detract from the gameplay. Character navigation feels clunky, especially when trying to vault over small obstacles or maneuver around minor rubble and debris. This lack of fluidity gives the game an outdated, almost early-2000s feel, which is a significant step back from previous Sniper Elite titles.\r\n\r\nI’m glad I didn’t pay more than $20 for it, because this entry feels like a downgrade, rather than an upgrade, compared to its predecessors. To make matters worse, the game has been monetized to the point where additional DLCs, which should have been part of the base game, are being sold as extra content. The inclusion of paid skins and levels feels like a cash grab, undermining the core experience.\r\n\r\nIt’s disappointing to see what was once a standout franchise take such a turn. It feels like the end of an era for Sniper Elite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad copy of SE5. This is first Sniper Elite that is so doll, predictable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seriously disappointed in this one. Loved the last two. This one just doesn't come together for many reasons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"No\" since there's no mixed option. \n\nThis game has some good levels, fun sniping moments, etc. There's a lot I liked, but there's nothing I liked more than SE5, so from the perspective of someone who owned that I can't recommend this. \n\nThis game's slight edge in level design doesn't offset buggier AI and worse production values. \n\nI'd love another game with Harry Hawker as the protagonist, though, that was a fun element.\n\nNo, but if you LOVE Sniper Elite and you like the sound of playing as Harry for a change then on sale it doesn't feel too bad of a buy. Made me want to go play more of 5 in the end though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For multiplayer: too many bugs, too many failed or refused connections, too many, many, many players cheating. If you leave a lobby and look for another one, it only lets you enter the one you left (5-10 times in a row)!!!! Unbelievable.... And last but not least, in many lobbies, 1-2 seconds of lag, unacceptable in shooter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glorified SE5 DLC not worth anything more then like £15",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a DLC, not a new game.\n\nIf you wanna play more of SE5, buy it.\n\nIf you want something new, wait for SE6.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "Bunch of reused assets from SE5 including direct clones of maps\nVery bad post processing effect leaves everything noticeably yellow and green.\nAnti-consumer pricing model\nDenuvo\nRain in the game is a complete technical disaster. Obviously attached to player, no rain sound, obnoxious white splashes.\n\nI can't be bothered writing more, this just pisses me off. Here's your negative review.\n\nThis is nothing more than a reshuffle of SE5 with big downgrades.\n\nDO BETTER!",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "I want to like this game I really do. This is just a SE5 DLC. Its a cheap rushed sad version of SE5. There is no excuse for the number of reused assets in this game.",
      "voted_up": false,
      "votes_helpful": 100
    },
    {
      "review": "Very bare bones. Not as good as Sniper Elite 5. Feels very much like a cheap, rushed cash-grab. I was introduced to Sniper Elite 5 and became a fan. Thought I'd be excited for Rebellion's next game. Now I'm realizing they're just another soulless company run on DLC and greed. Gonna stay away from their company and games from now on.",
      "voted_up": false,
      "votes_helpful": 80
    },
    {
      "review": "Don't waste your money!   To be fair....IF you are going to play this SOLO, then it looks like it would be fun to play, like the other Sniper Elite games.  HOWEVER...if you plan on playing this in co-op with a friend..forget it.  The anti-cheat, or should I say, anti-playable Denovu crap, makes the game unplayable.  It queues up the movement keys so bad, that when you release the key, the character continues to move for anywhere from 7-10 seconds longer.  So off a cliff, into the enemy lines, what ever direction you were heading.  And don't plan on the Devs doing anything about it.  I got an email from them basically saying, it's ok that I got a refund...have a good day. \nAnd before anyone asks, YES I tried every recommended fix/alteration to correct the issue.  The ONLY thing that fixed the issue, was removing Denovu.\nHave a great day guys!",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "It's an OK game, but essentially it's just more of the same and the story is even worse than in the Sniper Elite 5.\n\nThis series has a good gameplay foundation, but they NEED to evolve in terms of story/mission quality and variety and, even more, in setting diversification. I will not buy another WW2 Sniper Elite game, but i would gladly buy one with a setting in Vietnam war, Korea war, Winter War or any other fresh setting and good story.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Feels rushed. Story feels dull and shallow. The detail is missing. And I don't get why the protagonist sounds like a tough male but is portrayed as a corpulent shy teen with acne. Maybe the developers felt like that would match their playerbase more. Very rude.\n\nAreas feel empty. I have the idea that there are significantly lesser enemies in the game then previous installments. (My settings are the same). I could easily Rambo myself through the missions, because the lack of enemies made tagging and sniping very boring.\n\nAfter completion no urge to replay any mission. Think i'm going to play and ES5 again and gaze in awe of the detailed interiors of bunkers and the masses of AI enemies.\n\nIf you liked the series and want to give this one a try, best to buy it in a sale!",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After being a long time since SE 3-4 on Switch and for a couple of month the current title,  (while still in dev) supporter no finally have to give up with feeling of sheer disgust and nausea. Game is crap, for it's unbalanced, ridiculuos in many aspects, saying in stumbling at crossing the futile puny obstacles like small fences whatnot, but what this shitty title is really shining is its idotic anti-cheating policies which allows the openly cheating persons to dominate over the field without any borders any punish poor (stupid) fair players for their consistency. I can say I've wiped it out and never will buy nothing from this team again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was looking forward to this game. But I should have waited to buy it. I'm actually kinda angry with myself for buying it on release. When Sniper Elite 4 was released, I enjoyed it but I couldn't help but feel \"Huh, this just kinda feels like Sniper Elite 3...\"  But there was a more stuff, an interesting story, and I found myself pleasantly invested.\n\nWhen 5 came out, I'm gonna be honest. It felt like the EXACT same game as Sniper Elite 4. Everything felt the same, looked the same, the maps were BIGGER but I kinda was getting tired of every level being a sneaking mission. I was hoping to see some WWII combat with support sniping. Meet with Allied soldiers and work your way across enemy lines. But it was just another \"Nazi Evil Secret Plan must be stopped.\"  Which... is fine?  I just wanted more.\n\nThen this game came out, and not only do I HATE the characters, but like others have said it feels like a DLC to 5 being released at full game price. I've reached the end as a fan of this series I think... unless the next one (if there's a next one) does something incredibly different. I'll probably skip it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have loved and played the entire sniper elite series.   This is by far the laziest, and worst game  yet.   I was bored immediately.  This is SE5 dlc.  I put off buying the game as I heard others say that, bought on sale.   Should have waiting until it was free.  Is SE5 with a pointless new character, talks to much, looks like a child, game is not finished, glitches galore. I could go on, but it's trash.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried it out cos I got Slorgs videos recommended, turns out this game sucks ass harder than your average Ubisoft game.\nEven on ultra settings with HDR enabled and all that this game looks like it's from 2 Gens ago. Whoever worked on this - You're a disappointment to the series and I hope you have a great time learning from this cos holy shit do you suck at making games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is essentially Sniper Elite 5, exact same everything. The only difference is that you play as a new character. Other than that, the maps are bigger but in return it seems to have a distinct lack of enemies. Overall, if you just want a continuation of SN5 missions, this is legit. But if you want innovation in the series, this is not it. Was disapointing having to do the exact same mission objectives as the previous game. At least put in new textures, fonts, menu, skill system, literally anything different. Only ever conceivably worth if it is on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So this is a odd review. The game itself is perfect. More Sniper Elite gameplay. Nice amount of weapons, maps and modes. So why the bad rating? My game crashed every few minutes and I find out why. Denvuo. Once I reinstalled the game without it installed, the crashing went away. I contacted Rebellion and they tried blaming my M.2 drive it was installed on. I mean, I do get maybe thats an issue, even if I don't understand how. But the fact anti-cheat software crashes a game at all is a big issue for me. Now if I want to play online, I can't. Because the game crashes. \n\nOnly good news is I got the deluxe version for $40 at another site. So I'm not to mad, I'm getting my moneys worth at least single player. Which honestly is the biggest part for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even worst than the SE5, the protagonist is so \"carismatic\" like Connor from AC3, very annoying, maps are shorter, is a DLC of 5 but much worst",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly more of an expansion to Sniper Elite 5 than a true new entry, which would be fine if it was cheaper, the levels are smaller and less interesting on average than SE5 and the new protagonist some how managed to be even less interesting than the old one... unless you can't get enough of the SE5 invasion mode buy on deep discount other wise just buy SE5 if you haven't already",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing for just 3 minutes this looks, feels and IS the same sniper elite 5 with an annoying new voice and character.bring carl back, come up with something new, make huge maps with LOTS of targets.WASTE OF MONEY. SHAME REBELLION!  :(",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The overall experience feels incredibly unpolished, with awkward movement mechanics that detract from the gameplay. Character navigation feels clunky, especially when trying to vault over small obstacles or maneuver around minor rubble and debris. This lack of fluidity gives the game an outdated, almost early-2000s feel, which is a significant step back from previous Sniper Elite titles.\r\n\r\nI’m glad I didn’t pay more than $20 for it, because this entry feels like a downgrade, rather than an upgrade, compared to its predecessors. To make matters worse, the game has been monetized to the point where additional DLCs, which should have been part of the base game, are being sold as extra content. The inclusion of paid skins and levels feels like a cash grab, undermining the core experience.\r\n\r\nIt’s disappointing to see what was once a standout franchise take such a turn. It feels like the end of an era for Sniper Elite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad copy of SE5. This is first Sniper Elite that is so doll, predictable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seriously disappointed in this one. Loved the last two. This one just doesn't come together for many reasons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"No\" since there's no mixed option. \n\nThis game has some good levels, fun sniping moments, etc. There's a lot I liked, but there's nothing I liked more than SE5, so from the perspective of someone who owned that I can't recommend this. \n\nThis game's slight edge in level design doesn't offset buggier AI and worse production values. \n\nI'd love another game with Harry Hawker as the protagonist, though, that was a fun element.\n\nNo, but if you LOVE Sniper Elite and you like the sound of playing as Harry for a change then on sale it doesn't feel too bad of a buy. Made me want to go play more of 5 in the end though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For multiplayer: too many bugs, too many failed or refused connections, too many, many, many players cheating. If you leave a lobby and look for another one, it only lets you enter the one you left (5-10 times in a row)!!!! Unbelievable.... And last but not least, in many lobbies, 1-2 seconds of lag, unacceptable in shooter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glorified SE5 DLC not worth anything more then like £15",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a DLC, not a new game.\n\nIf you wanna play more of SE5, buy it.\n\nIf you want something new, wait for SE6.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "Bunch of reused assets from SE5 including direct clones of maps\nVery bad post processing effect leaves everything noticeably yellow and green.\nAnti-consumer pricing model\nDenuvo\nRain in the game is a complete technical disaster. Obviously attached to player, no rain sound, obnoxious white splashes.\n\nI can't be bothered writing more, this just pisses me off. Here's your negative review.\n\nThis is nothing more than a reshuffle of SE5 with big downgrades.\n\nDO BETTER!",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "I want to like this game I really do. This is just a SE5 DLC. Its a cheap rushed sad version of SE5. There is no excuse for the number of reused assets in this game.",
      "voted_up": false,
      "votes_helpful": 100
    },
    {
      "review": "Very bare bones. Not as good as Sniper Elite 5. Feels very much like a cheap, rushed cash-grab. I was introduced to Sniper Elite 5 and became a fan. Thought I'd be excited for Rebellion's next game. Now I'm realizing they're just another soulless company run on DLC and greed. Gonna stay away from their company and games from now on.",
      "voted_up": false,
      "votes_helpful": 80
    },
    {
      "review": "Don't waste your money!   To be fair....IF you are going to play this SOLO, then it looks like it would be fun to play, like the other Sniper Elite games.  HOWEVER...if you plan on playing this in co-op with a friend..forget it.  The anti-cheat, or should I say, anti-playable Denovu crap, makes the game unplayable.  It queues up the movement keys so bad, that when you release the key, the character continues to move for anywhere from 7-10 seconds longer.  So off a cliff, into the enemy lines, what ever direction you were heading.  And don't plan on the Devs doing anything about it.  I got an email from them basically saying, it's ok that I got a refund...have a good day. \nAnd before anyone asks, YES I tried every recommended fix/alteration to correct the issue.  The ONLY thing that fixed the issue, was removing Denovu.\nHave a great day guys!",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "It's an OK game, but essentially it's just more of the same and the story is even worse than in the Sniper Elite 5.\n\nThis series has a good gameplay foundation, but they NEED to evolve in terms of story/mission quality and variety and, even more, in setting diversification. I will not buy another WW2 Sniper Elite game, but i would gladly buy one with a setting in Vietnam war, Korea war, Winter War or any other fresh setting and good story.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Feels rushed. Story feels dull and shallow. The detail is missing. And I don't get why the protagonist sounds like a tough male but is portrayed as a corpulent shy teen with acne. Maybe the developers felt like that would match their playerbase more. Very rude.\n\nAreas feel empty. I have the idea that there are significantly lesser enemies in the game then previous installments. (My settings are the same). I could easily Rambo myself through the missions, because the lack of enemies made tagging and sniping very boring.\n\nAfter completion no urge to replay any mission. Think i'm going to play and ES5 again and gaze in awe of the detailed interiors of bunkers and the masses of AI enemies.\n\nIf you liked the series and want to give this one a try, best to buy it in a sale!",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After being a long time since SE 3-4 on Switch and for a couple of month the current title,  (while still in dev) supporter no finally have to give up with feeling of sheer disgust and nausea. Game is crap, for it's unbalanced, ridiculuos in many aspects, saying in stumbling at crossing the futile puny obstacles like small fences whatnot, but what this shitty title is really shining is its idotic anti-cheating policies which allows the openly cheating persons to dominate over the field without any borders any punish poor (stupid) fair players for their consistency. I can say I've wiped it out and never will buy nothing from this team again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was looking forward to this game. But I should have waited to buy it. I'm actually kinda angry with myself for buying it on release. When Sniper Elite 4 was released, I enjoyed it but I couldn't help but feel \"Huh, this just kinda feels like Sniper Elite 3...\"  But there was a more stuff, an interesting story, and I found myself pleasantly invested.\n\nWhen 5 came out, I'm gonna be honest. It felt like the EXACT same game as Sniper Elite 4. Everything felt the same, looked the same, the maps were BIGGER but I kinda was getting tired of every level being a sneaking mission. I was hoping to see some WWII combat with support sniping. Meet with Allied soldiers and work your way across enemy lines. But it was just another \"Nazi Evil Secret Plan must be stopped.\"  Which... is fine?  I just wanted more.\n\nThen this game came out, and not only do I HATE the characters, but like others have said it feels like a DLC to 5 being released at full game price. I've reached the end as a fan of this series I think... unless the next one (if there's a next one) does something incredibly different. I'll probably skip it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have loved and played the entire sniper elite series.   This is by far the laziest, and worst game  yet.   I was bored immediately.  This is SE5 dlc.  I put off buying the game as I heard others say that, bought on sale.   Should have waiting until it was free.  Is SE5 with a pointless new character, talks to much, looks like a child, game is not finished, glitches galore. I could go on, but it's trash.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried it out cos I got Slorgs videos recommended, turns out this game sucks ass harder than your average Ubisoft game.\nEven on ultra settings with HDR enabled and all that this game looks like it's from 2 Gens ago. Whoever worked on this - You're a disappointment to the series and I hope you have a great time learning from this cos holy shit do you suck at making games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is essentially Sniper Elite 5, exact same everything. The only difference is that you play as a new character. Other than that, the maps are bigger but in return it seems to have a distinct lack of enemies. Overall, if you just want a continuation of SN5 missions, this is legit. But if you want innovation in the series, this is not it. Was disapointing having to do the exact same mission objectives as the previous game. At least put in new textures, fonts, menu, skill system, literally anything different. Only ever conceivably worth if it is on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So this is a odd review. The game itself is perfect. More Sniper Elite gameplay. Nice amount of weapons, maps and modes. So why the bad rating? My game crashed every few minutes and I find out why. Denvuo. Once I reinstalled the game without it installed, the crashing went away. I contacted Rebellion and they tried blaming my M.2 drive it was installed on. I mean, I do get maybe thats an issue, even if I don't understand how. But the fact anti-cheat software crashes a game at all is a big issue for me. Now if I want to play online, I can't. Because the game crashes. \n\nOnly good news is I got the deluxe version for $40 at another site. So I'm not to mad, I'm getting my moneys worth at least single player. Which honestly is the biggest part for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even worst than the SE5, the protagonist is so \"carismatic\" like Connor from AC3, very annoying, maps are shorter, is a DLC of 5 but much worst",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly more of an expansion to Sniper Elite 5 than a true new entry, which would be fine if it was cheaper, the levels are smaller and less interesting on average than SE5 and the new protagonist some how managed to be even less interesting than the old one... unless you can't get enough of the SE5 invasion mode buy on deep discount other wise just buy SE5 if you haven't already",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing for just 3 minutes this looks, feels and IS the same sniper elite 5 with an annoying new voice and character.bring carl back, come up with something new, make huge maps with LOTS of targets.WASTE OF MONEY. SHAME REBELLION!  :(",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The overall experience feels incredibly unpolished, with awkward movement mechanics that detract from the gameplay. Character navigation feels clunky, especially when trying to vault over small obstacles or maneuver around minor rubble and debris. This lack of fluidity gives the game an outdated, almost early-2000s feel, which is a significant step back from previous Sniper Elite titles.\r\n\r\nI’m glad I didn’t pay more than $20 for it, because this entry feels like a downgrade, rather than an upgrade, compared to its predecessors. To make matters worse, the game has been monetized to the point where additional DLCs, which should have been part of the base game, are being sold as extra content. The inclusion of paid skins and levels feels like a cash grab, undermining the core experience.\r\n\r\nIt’s disappointing to see what was once a standout franchise take such a turn. It feels like the end of an era for Sniper Elite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad copy of SE5. This is first Sniper Elite that is so doll, predictable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seriously disappointed in this one. Loved the last two. This one just doesn't come together for many reasons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"No\" since there's no mixed option. \n\nThis game has some good levels, fun sniping moments, etc. There's a lot I liked, but there's nothing I liked more than SE5, so from the perspective of someone who owned that I can't recommend this. \n\nThis game's slight edge in level design doesn't offset buggier AI and worse production values. \n\nI'd love another game with Harry Hawker as the protagonist, though, that was a fun element.\n\nNo, but if you LOVE Sniper Elite and you like the sound of playing as Harry for a change then on sale it doesn't feel too bad of a buy. Made me want to go play more of 5 in the end though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For multiplayer: too many bugs, too many failed or refused connections, too many, many, many players cheating. If you leave a lobby and look for another one, it only lets you enter the one you left (5-10 times in a row)!!!! Unbelievable.... And last but not least, in many lobbies, 1-2 seconds of lag, unacceptable in shooter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glorified SE5 DLC not worth anything more then like £15",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a DLC, not a new game.\n\nIf you wanna play more of SE5, buy it.\n\nIf you want something new, wait for SE6.",
      "voted_up": false,
      "votes_helpful": 91
    },
    {
      "review": "Bunch of reused assets from SE5 including direct clones of maps\nVery bad post processing effect leaves everything noticeably yellow and green.\nAnti-consumer pricing model\nDenuvo\nRain in the game is a complete technical disaster. Obviously attached to player, no rain sound, obnoxious white splashes.\n\nI can't be bothered writing more, this just pisses me off. Here's your negative review.\n\nThis is nothing more than a reshuffle of SE5 with big downgrades.\n\nDO BETTER!",
      "voted_up": false,
      "votes_helpful": 74
    },
    {
      "review": "I want to like this game I really do. This is just a SE5 DLC. Its a cheap rushed sad version of SE5. There is no excuse for the number of reused assets in this game.",
      "voted_up": false,
      "votes_helpful": 100
    },
    {
      "review": "Very bare bones. Not as good as Sniper Elite 5. Feels very much like a cheap, rushed cash-grab. I was introduced to Sniper Elite 5 and became a fan. Thought I'd be excited for Rebellion's next game. Now I'm realizing they're just another soulless company run on DLC and greed. Gonna stay away from their company and games from now on.",
      "voted_up": false,
      "votes_helpful": 80
    },
    {
      "review": "Don't waste your money!   To be fair....IF you are going to play this SOLO, then it looks like it would be fun to play, like the other Sniper Elite games.  HOWEVER...if you plan on playing this in co-op with a friend..forget it.  The anti-cheat, or should I say, anti-playable Denovu crap, makes the game unplayable.  It queues up the movement keys so bad, that when you release the key, the character continues to move for anywhere from 7-10 seconds longer.  So off a cliff, into the enemy lines, what ever direction you were heading.  And don't plan on the Devs doing anything about it.  I got an email from them basically saying, it's ok that I got a refund...have a good day. \nAnd before anyone asks, YES I tried every recommended fix/alteration to correct the issue.  The ONLY thing that fixed the issue, was removing Denovu.\nHave a great day guys!",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "It's an OK game, but essentially it's just more of the same and the story is even worse than in the Sniper Elite 5.\n\nThis series has a good gameplay foundation, but they NEED to evolve in terms of story/mission quality and variety and, even more, in setting diversification. I will not buy another WW2 Sniper Elite game, but i would gladly buy one with a setting in Vietnam war, Korea war, Winter War or any other fresh setting and good story.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Feels rushed. Story feels dull and shallow. The detail is missing. And I don't get why the protagonist sounds like a tough male but is portrayed as a corpulent shy teen with acne. Maybe the developers felt like that would match their playerbase more. Very rude.\n\nAreas feel empty. I have the idea that there are significantly lesser enemies in the game then previous installments. (My settings are the same). I could easily Rambo myself through the missions, because the lack of enemies made tagging and sniping very boring.\n\nAfter completion no urge to replay any mission. Think i'm going to play and ES5 again and gaze in awe of the detailed interiors of bunkers and the masses of AI enemies.\n\nIf you liked the series and want to give this one a try, best to buy it in a sale!",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "After being a long time since SE 3-4 on Switch and for a couple of month the current title,  (while still in dev) supporter no finally have to give up with feeling of sheer disgust and nausea. Game is crap, for it's unbalanced, ridiculuos in many aspects, saying in stumbling at crossing the futile puny obstacles like small fences whatnot, but what this shitty title is really shining is its idotic anti-cheating policies which allows the openly cheating persons to dominate over the field without any borders any punish poor (stupid) fair players for their consistency. I can say I've wiped it out and never will buy nothing from this team again.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I was looking forward to this game. But I should have waited to buy it. I'm actually kinda angry with myself for buying it on release. When Sniper Elite 4 was released, I enjoyed it but I couldn't help but feel \"Huh, this just kinda feels like Sniper Elite 3...\"  But there was a more stuff, an interesting story, and I found myself pleasantly invested.\n\nWhen 5 came out, I'm gonna be honest. It felt like the EXACT same game as Sniper Elite 4. Everything felt the same, looked the same, the maps were BIGGER but I kinda was getting tired of every level being a sneaking mission. I was hoping to see some WWII combat with support sniping. Meet with Allied soldiers and work your way across enemy lines. But it was just another \"Nazi Evil Secret Plan must be stopped.\"  Which... is fine?  I just wanted more.\n\nThen this game came out, and not only do I HATE the characters, but like others have said it feels like a DLC to 5 being released at full game price. I've reached the end as a fan of this series I think... unless the next one (if there's a next one) does something incredibly different. I'll probably skip it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I have loved and played the entire sniper elite series.   This is by far the laziest, and worst game  yet.   I was bored immediately.  This is SE5 dlc.  I put off buying the game as I heard others say that, bought on sale.   Should have waiting until it was free.  Is SE5 with a pointless new character, talks to much, looks like a child, game is not finished, glitches galore. I could go on, but it's trash.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Tried it out cos I got Slorgs videos recommended, turns out this game sucks ass harder than your average Ubisoft game.\nEven on ultra settings with HDR enabled and all that this game looks like it's from 2 Gens ago. Whoever worked on this - You're a disappointment to the series and I hope you have a great time learning from this cos holy shit do you suck at making games.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game is essentially Sniper Elite 5, exact same everything. The only difference is that you play as a new character. Other than that, the maps are bigger but in return it seems to have a distinct lack of enemies. Overall, if you just want a continuation of SN5 missions, this is legit. But if you want innovation in the series, this is not it. Was disapointing having to do the exact same mission objectives as the previous game. At least put in new textures, fonts, menu, skill system, literally anything different. Only ever conceivably worth if it is on sale.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "So this is a odd review. The game itself is perfect. More Sniper Elite gameplay. Nice amount of weapons, maps and modes. So why the bad rating? My game crashed every few minutes and I find out why. Denvuo. Once I reinstalled the game without it installed, the crashing went away. I contacted Rebellion and they tried blaming my M.2 drive it was installed on. I mean, I do get maybe thats an issue, even if I don't understand how. But the fact anti-cheat software crashes a game at all is a big issue for me. Now if I want to play online, I can't. Because the game crashes. \n\nOnly good news is I got the deluxe version for $40 at another site. So I'm not to mad, I'm getting my moneys worth at least single player. Which honestly is the biggest part for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Even worst than the SE5, the protagonist is so \"carismatic\" like Connor from AC3, very annoying, maps are shorter, is a DLC of 5 but much worst",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly more of an expansion to Sniper Elite 5 than a true new entry, which would be fine if it was cheaper, the levels are smaller and less interesting on average than SE5 and the new protagonist some how managed to be even less interesting than the old one... unless you can't get enough of the SE5 invasion mode buy on deep discount other wise just buy SE5 if you haven't already",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "After playing for just 3 minutes this looks, feels and IS the same sniper elite 5 with an annoying new voice and character.bring carl back, come up with something new, make huge maps with LOTS of targets.WASTE OF MONEY. SHAME REBELLION!  :(",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "The overall experience feels incredibly unpolished, with awkward movement mechanics that detract from the gameplay. Character navigation feels clunky, especially when trying to vault over small obstacles or maneuver around minor rubble and debris. This lack of fluidity gives the game an outdated, almost early-2000s feel, which is a significant step back from previous Sniper Elite titles.\r\n\r\nI’m glad I didn’t pay more than $20 for it, because this entry feels like a downgrade, rather than an upgrade, compared to its predecessors. To make matters worse, the game has been monetized to the point where additional DLCs, which should have been part of the base game, are being sold as extra content. The inclusion of paid skins and levels feels like a cash grab, undermining the core experience.\r\n\r\nIt’s disappointing to see what was once a standout franchise take such a turn. It feels like the end of an era for Sniper Elite.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Bad copy of SE5. This is first Sniper Elite that is so doll, predictable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Seriously disappointed in this one. Loved the last two. This one just doesn't come together for many reasons.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"No\" since there's no mixed option. \n\nThis game has some good levels, fun sniping moments, etc. There's a lot I liked, but there's nothing I liked more than SE5, so from the perspective of someone who owned that I can't recommend this. \n\nThis game's slight edge in level design doesn't offset buggier AI and worse production values. \n\nI'd love another game with Harry Hawker as the protagonist, though, that was a fun element.\n\nNo, but if you LOVE Sniper Elite and you like the sound of playing as Harry for a change then on sale it doesn't feel too bad of a buy. Made me want to go play more of 5 in the end though.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For multiplayer: too many bugs, too many failed or refused connections, too many, many, many players cheating. If you leave a lobby and look for another one, it only lets you enter the one you left (5-10 times in a row)!!!! Unbelievable.... And last but not least, in many lobbies, 1-2 seconds of lag, unacceptable in shooter",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glorified SE5 DLC not worth anything more then like £15",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "No",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}