{
  "positive": [
    {
      "review": "“Absolutely amazing. Thanks to this game, I fell into the grimdark rabbit hole of 40K lore—and I regret nothing!”",
      "voted_up": true,
      "votes_helpful": 256
    },
    {
      "review": "[h1] Pros  [/h1]\n✔ [b]Titus[/b]\n✔ big men\n✔ big armor\n✔ big bugs\n✔ pure adrenaline\n✔ satisfying executions\n\n[h1] Cons [/h1]\n✘ Leandros \n✘ having eyes & ears when Leandros is in the cutscene\n✘ Leandros is breathing the same air as  [b]Titus [/b]\n✘ I cannot legally execute him for being a snitch\n✘ He is the human equivalent of an unskippable ad\n✘ Leandros \n✘ Leandros \n\n[h1] Rating [/h1]\n [b]9 / 10 game  [/b]\n [b]-40,000 / 10 Leandros  [/b]",
      "voted_up": true,
      "votes_helpful": 265
    },
    {
      "review": "I love this game, but theres so much wasted potential that it hurts, the main attraction of the game (operations) could be made less repetitive if saber would allow us to play the campaign missions as if they were part of the operations, the huge gaps between new batches of content deplete the playerbase and only when new content arrives makes the game feel alive for a couple weeks at best, also the progression is pretty underwelming overall. \r\nAlthough i understand that they are already thinking of SM3 it sucks that this game, with little changes, could be so much more.",
      "voted_up": true,
      "votes_helpful": 84
    },
    {
      "review": "This game is so masculine, so testosterone inducing that I grew two exatra set of balls",
      "voted_up": true,
      "votes_helpful": 178
    },
    {
      "review": "Great game, love it (I wish there were more classes though, espacialy a terminator one)\r\n\r\nFOR THE EMPEROR!!!",
      "voted_up": true,
      "votes_helpful": 54
    },
    {
      "review": "This game is pure therapy for anyone who enjoys loud explosions, flying limbs, and feeling like a walking exterminatus. The gameplay hits so hard you start believing you were born for bolter justice. The graphics are juicy, the sound design screams like an angry sergeant, and shredding Tyranids has never felt this satisfyingly crunchy. Perfect after a long day: jump in, destroy half a planet, leave refreshed. In short: loud, brutal, gorgeous. Totally recommended.",
      "voted_up": true,
      "votes_helpful": 33
    },
    {
      "review": "This game is so violent I love it, the visuals and environment (even know nearly melting my cpu on release) are beautiful. Titus is an interesting character, the first game left me wanting more and was great to finally see where he ended up. Campaign is a little too short in my opinion but I suppose quality over quantity, gameplay is violent with good flow with beautiful 40k backdrop and scenery.  PvP ain't my cup of tea but from what I played its not too bad, PvE and co-op is very fun and has replay value NOW, at the beginning the content was lack and glitches in the warp made playing with brothers near impossible but by the Emperors blessing I have limited issues now. Few things I personally didn't like was lack of different executions, always seeing the same few ones per weapon gets boring. I wasn't the biggest fan of Captain Acheran and Brother Chairon, they just seemed out of place or something.\n\nLeandros bites the kerb in 4K",
      "voted_up": true,
      "votes_helpful": 31
    },
    {
      "review": "Amazing 3rd person shooter! Campaign was a bit short but awesome, and you can keep playing in Operations and Siege. Operations are other 3 squad missions, Siege is basically waves in Horde mode. There is also PvP but I'm not into that, so only did it for achievements. 6 classes to choose from, all very nice. Bots are not bad on easier difficulties, they come to revive and they don't get stuck, but obviously better with other players. The scenery, brutal executions and both melee and ranged combat are all beautiful.\r\n\r\nRecommended 10/10",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Very good game overall. Pretty and detailed if you've got the hardware (good CPU and 16 GB of VRAM for the 4K textures, useful even in 2K). Alien entrails have never looked so good.\nThe campaign is nice but not extraordinary; it's kind of a long prologue for the rest of time you'll spend in game.\nPvP felt imbalanced and wasn't fun, avoid; but that's not my cup of tea in general.\nPvE/co-op is where there's most meat. Bots aren't good, so in higher difficulties you'd better play with (competent) people. Combos, 6 character classes, varied weapons and skill trees: very satisfying to play once you're used to it.\nThe game has been released over a year ago, and the developer keeps adding new free content like maps, etc., which is nice too.",
      "voted_up": true,
      "votes_helpful": 19
    },
    {
      "review": "One of the best games to play with your friends. They are still adding new updates to the game and the best thing is all the new content is free with standard edition. Only monitisation game supports atm is cosmetics and optional which is rare these days. I will definitely come back to play new updates they have added since launch. This is one of those games whose campaign is Absolute Cinema. Easy Recommendation for co-op experience",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "First things first, because this was extensively discussed in the forums: the controls in Space Marine 2 definitely need some getting used to. They’re a bit overloaded with ranged combat, melee combat and various parry and dodge mechanics. This requires a bit of experimenting until you find a control scheme that suits you. I ended up binding melee to the F key with parry on mouse 4 and aiming on the right mouse button. With this, the controls felt okay for the most part. Still, I feel this game might play better with a controller. On Jumppack: I liked those controls better in the first game.\n\nThis is not a game in which you do everything and kill everything by yourself. The tyranid enemies are so plentiful that you can’t get them all. So in single player, a good number of them will be handled by the AI companions. In co-op mode, your teammates will also take care of a good chunk of them, of course. Battles can get pretty chaotic at times and maintaining oversight of what happens gets challenging sometimes, which I think is intentionally and somewhat true to the source material.\n\nGameplay wise, the closest comparison is obviously Space Marine 1, but the game reminded me a bit of Red Faction Armageddon at first. Later, I got a bit nostalgic of Dark Souls, since you’ll come across a lot of churches in which you can dodge-roll through the church pews - just like in FromSofts game.\n\nI’m not sure if I like the mechanic of the co-op missions being so much intertwined with the campaign. I always tried to select the next mission I would play based on what would make the most sense to me story-wise. That meant frequently switching game modes from campaign to co-op and vice versa. This is not a seamless process at all though, since it requires some loading screens and character setup, the latter not really being there in the campaign. Also, the co-op missions are a bit immersion breaking in terms of storytelling, since the gameplay dynamic is of course a bit different there, especially If you play the campaign in single player. Co-op can also be played privately with bots, but that makes them much harder and is besides their intention - they’re meant to be played with three human players. The campaign itself is great and I very much enjoyed playing through it.\n\nThat co-op mode, called ‘Operations’, has character customization and a perk leveling system. This means that most sessions play out with people rushing through the levels while trying to get as many kills as possible and going through the mission as fast as possible, because kills and completing missions both give you XP. So naturally, most players want to go through fast for quicker leveling up. I’m not a fan of that I must say, because as I was trying to enjoy the levels and their surroundings, taking my time and finding all the dataslates, this rushing of the other people really sometimes destroyed said enjoyment to some degree. The experience depends on how you and your teammates play, so your mileage may vary.\n\nThere’s also another co-op mode called ‘Siege’, which is a horde mode that throws endless waves of enemies at you. Not really what I’m interested in. Besides that, they also included a multiplayer PvP mode, but I’m not into competitive multiplayer at all, so I can’t comment on and won’t judge that mode.\n\nGraphics are great, the game looks stunningly beautiful and very detailed. Likewise, the sound is superb for the most part. I have absolutely no complaints about the game’s tech. It’s very polished and it runs very well, between 90 and 110 fps for me, playing on a 5 year old 3060 Ti with pretty high settings and DLSS set to Quality. This was kind of surprising for me, since I thought that I would struggle to maintain 60 fps. But that was no issue at all. Granted, I only played it in 1080p.\n\nAll in all, I did not enjoy this game as much as I did Space Marine 1, which I really liked a whole lot. Other than the graphics, I’m struggling to find any real improvements compared to its predecessor, which came out 13 years before this one. Operations mode is basically Vermintide light, the horde mode lacks long-term motivation for me. Objectively speaking though, I realize that this is a very good game. It’s well made, runs great and offers variety with its set of different game modes, some of them complementing each other. So I recommend this game to you if you’re looking for a third-person shooter with a heavy emphasis on melee combat and if you like the first Space Marine game. It just didn’t fully click with me.\n\nSimilar games that I can also recommend: Space Marine 1 (obviously), Red Faction Armageddon, Vermintide 2, Lost Planet 3",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "As a long term warhammer fan, i looked forward to this from the day it was announced.\nand so far have not been disapointed, \nmultiplayer is a pure delight, especially with two battle brothers backing you up \ni never had any memory leak problems although i heard there were at launch \narmour costumisation held my attention for hours trying to find the perfect look for my marine \ni have made friends while playing and had fun with my existing ones \nall in all, i will look forward to the future of this and any games that may come from it \nin my opinion is the game worth it?\nmy 396 hours speak for itself",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A game that features the complete package. Awesome campaign, explosive PvE and also PvP. They don't make games like this anymore, that's for sure. Game's such fun it deserves all the praise it got. Kudos to Saber, incredible job!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's not perfect, way better with friends, top difficulty on operations is an absolute slog to get through, however, with the right build challenge and power fantasy can be met. I have been playing since day one, it's improved ALOT but still can be annoying. Mainly you can't rush in and just kill enemies for the imperium of mankind, you have to be patient and learn patterns and combos to make it through the higher difficulties. If you're itching for something like space hulk deathwing, this isn't it. Buy on a sale, all of the games dlc is just cosmetics which is based. Last part, if you want to enjoy operations, level up with tyranids as they are so much easier to learn/fight than chaos when starting",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fantastic Grapics, very satisfying Gameplay, i would say a must as a Warhammer 40k Fan\r\nOnly downside was that the singleplayer story was relatively short but other than that i have no complains, game recommended! Even for people that never had anything to do with Warhammer 40k it could be a great introduction into this fun rabbit hole",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Honestly didnt believe we were getting this. Definitely didnt think it was going to be as good as it wound up being. \n\nThank you to all the hard workers within the 40k community nostalgiaposting about Space Marine 1 to help convince Geedubs that there was interest in a sequel.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Angry Norwood level 4 man punches a multitude of alien flowers in space, has numerous awkward elevator rides with his toxic co-workers, and wonders why he can only hold 2 ranged weapons, instead of 4, like last time.\n\nGameplay is good, but I wish there was more game progression, more campaign customziation, some RPG elements. it feels like there were a few steps backwards in this game, compared to Space Marine 1, which had a bit more personality, better voice acting for Titus, but this, is still pretty great game.\n\nI do miss green boyz yelling: 'WAAAAAH, IT'S SPOIS MUHREENZ!\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "There have been many warhammer games. Every single one of them has fallen short of the power of my own imagination. Until Space Marines 2. This game has captured the setting of warhammer better than just about any game I have ever played. With this and Rouge Trader, warhammer fans are eating like emperors. \n\nIf you like this game, and like Baulders Gate 3. Please check out Warhammer 40K: Rouge Trader.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Finally, a good warhammer game.\r\nA lot to unlock in a multiplayer, and most satisfying finishers ever",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The amount of love, care, and attention to detail that was put in this game is staggering. The devs really have brought the world of 40k to life beautifully in this game. The environments, the set pieces, the epic battles raging on everywhere, not to mention the characters, are just so overwhelmingly well done that it's difficult not to just stare at everything. \n\nThe campaign is a spectacularly executed epic which on its own is well-worth your time. After that, there are (currently 10) single missions called Operations which are full-fledged 30-45 minute experiences each, rich in detail and flavour, that add a lot of extra content and variety. Plus a wave-based endless mode, daily/weekly challenge operations, and PVP. So quite a lot overall. \n\nOutside of the campaign, you can play multiple different classes, unlock cosmetics, build your own custom armour from a variety of chapters, earn perks, masteries, skins, etc. etc. Great fun in co-op!\n\nThe only downside is the difficulty, which is in my opinion not suitable for casual gamers that just want to experience the world. Even the lowest difficulty is quite hard when you're starting out, and above that it quickly escalates. The worst offender is a new PvE Chaos enemy called the spawn which simply tanks all your hits, rushes in, and then takes off all your health faster than you can blink. It's extremely hard to learn to parry their entire moveset, and while a single one is usually manageable, they always come in pretty big groups that are nigh-impossible to deal with.\n\nAlso, the bots are almost totally useless, as they deal decreased damage, enemies kinda ignore them, and bots don't complete mission objectives or try to prevent enemy reinforcement waves from being called in. Playing with bots on the first difficulty level is harder than playing with other people on the third one. So playing with others is almost mandatory.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has quite affected me and that I started to learn about the universe and bought some minifigures and a starter set and painting them for the emperor!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Easily one of the best games in past couple of years. Universe is portrayed as it should be, gameplay is fun, game is in active support and all the new operations are given out for free. There are some rough edges but they are totally outshined by everything else in the game.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Honestly this game is phenomenal. The visuals, the lore, the story, and the gameplay are a masterpiece. If you ever wanted to feel like a space marine then this is the game for you. The main campaign is extremely cinematic and feels like a movie the entire time you are playing. It's campaign has a decent length and is very seamless when playing with friends. The multiplayer operations are very fun and you can spend quite a lot of time playing them over and over as they have just enough change each time when running them to keep the fights entertaining and they throw in quite a bit of challenging encounters. The game constantly gets updates, frequently adding more and more things to play around with and fight. Then we get to customizing, and here things get very cool. They have added so many things to change and color that it is pretty close to being able to do what you want with your favorite chapters. I understand that some people might be turned off on cosmetics being sold and some of their favorite chapters being behind a paywall, but I can say without a doubt I'll still buy them. All of the new content is free and they haven't pulled any bad moves with it. The devs listen to the community often and they frequently hot-fix/hot-buff or nerf to make things feel balanced. I haven't gotten to the PvP yet, but from what I've heard, a lot of my friends like it. I've just been focused on tearing Tyranids apart and stomping Chaos. If you really want a game to enjoy brutally stomping hordes in, this is your game. Even if you aren't a fan of Warhammer lore, this is a very good way to get into it. For the Emperor!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "You know a game is so good when the worst thing you can say about it is that is too short. I want more",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a [b] VERY enjoyable game for players looking to carve through hordes, and not have to spend too much time on high combat depth [/b]. This is[b] also for fans of warhammer 40k [/b], especially raging hard on fans of Space Marines (like myself and my obscene plastic collection) because the [/b] stunning visuals and the beautiful sounds bring the universe and combat to life [/b]. I actually taste the in-game air when I play!\n\nHowever [b]due to that lack of depth and in my opinion questionable design decisions, if playing solo, the PVE/PVP aspects can get monotonous [/b] and as some have said feel a bit grindy. [b]If you don't have friends who are interested and dedicated to play with you, you will find yourself putting this aside and only picking it up on occasion [/b] to scratch the itch. \n\nAlso, the devs for some reason have an aversion to certain features that would[b] in my opinion [/b]improve player experience:\n+ Suping up the power level of your weapons and armor - feeling that shift from grunt to chapter master be more pronounced\n+ Allowing for ALL cosmetics be cross class functional, even chaos ones\n+ Allowing for two or more players to play the same class in pve missions\n+ Allowing a full PVP stack of friends to create their own party as opposed to the 3 player limit\n\nThat being said, [b] all the above is available in the fan made and dev sanctioned \"Astartes Overhaul\" mod, which is a fantastic mod that fills these gaps for you [/b] should you wish, and make solo play far more interesting and engaging. \n\nGet this game... \n...or don't. \nI'm not your dad.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "8/10\n\n\ngreat atmospheric wh40k game\ngreat graphics and optimization\nmultiplayer lacks of variety of maps, gameplay etc",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Lags on steamdeck though it says in description that it works good with basic graphic settings. good game though",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great campaign, the PVE missions are fun and devs keep adding content with updates.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm playing through it for the second time after playing on PS5. Thanks to Steam for the free multiplayer! A stunning adventure in the atmospheric Warhammer 40k universe. The gameplay is engaging, and on higher difficulty levels, you have to carefully plan your missions and choose your weapons. ood graphics and performance, my GeForce 3060 Ti produces a very nice picture with 60fr. I really enjoyed the impact of hitting enemies and the melee combats. I'm waiting for the Space Marine 3, and in the meantime, I'll be replaying missions/online.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Recommended by friend to try. It's obvious not for faint-hearted person cause this game will make you feel overwhelmed when you never play previous space marine or similar shoot-slash-dodge-roll-parry thing kind of game.\n\nIgnore those who said it's maxing testosteron or proving how masculine this game, well this is coop game, using brain and skill is a must, cooperate and play your class well. Don't be a quitter, a bad teammate who take all stims when you're max lvl prestige player, not even a troll. Be a real battle brother, Emperor protects you!\n\nPros: sophisticated cinematic Warhammer 40k, campaign lore is good, has connection to the first space marine, coop also in campaign mode, more pve operation mode, chaos map is more difficult and challenging, and weekly hard somehow it's \"crazy\" hard.\n\nCons: matchmaking is a meh (saber game problem?) sometimes no one joined, sometimes quitter joined, few time and rarely joined random good player.... Laggy when someone joins game, sometimes suddenly crashed and can't rejoin because someone already joined the game after 20min playing, hmmmm, fair enough? no. When you loose, so few xp, when you don't reach first checkpoint you got 0 xp. Tough? no balls they said, just redo and gitgud.\n\nEnjoy the game, I recommend if you don't have friends to play with and struggle with hard difficulties, go to official discord, some good peeple will help. :)\nEliminate the heretics, For the Emperor!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A great continuation of the first game, clearly made with love and with attention to source material. Great gameplay and can't wait for the future content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Endless blood and death.\r\nSwiftly does the Raven strike,\r\n[b]For The Emperor! [/b]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The coolest gameplay, plot, graphics, and optimization",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "The peak queer experience in the modern age. I'm happy that the boys get this kind of representation in 2025. Be an immortal sweaty man, surrounded at all times by other immortal sweaty men doing the thing you all enjoy doing best; expressing love through violence and brotherhood [or whatever you want to call it]. Its cute actually. Just look at the rest of the comments for this game. It's basically a coming out party.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Ah Space Marine 2, this game has to be one of the best third person coop games I have played in a very long time. \n\nlets break it down;\nPros\n> The campaign albeit short is incredibly fun and well written.\n> The Coop is extremely fun especially with the boys.\n> The executions in this game are ALWAYS satisfying.\n> The classes of marines offer a playstyle to suit anyone.\n> Visually this game is striking even on a lower end PC.\n> The fact that the devs have announced a new 40k game and are still putting effort and time to keep this one alive and healthy is also a huge W.\n> The customization for your marine is extensive but also fits into the 40k universe.\n> Big men\n\nCONS\n> Unfortunately the PVP is currently full of very sweaty individuals who do in fact need to touch some grass\n> I have experienced a plethora of visual bugs that have sometimes ruined muhmersion\n> This game can become repitive as the levels are quite limited (Even though there are new missions coming out regularly)\n> Leandros\n> Why can i not play as a dreadnaught :(\n> They could have made the story longer\n> Possibly could have added more enemy factions\n> Lots of known server issues that have caused peoples game to falsely accuse them of modding (happened to me)\n\nConclusion: Warhammer 40k: Space marine 2 is a great game that I would recommend to most people especially if they are into Warhammer. I think the game is for the most part well designed and well optimized for everyone of any system to play. The game has meaty, gory executions that really scratch an itch for me and the gunplay is smooth and satisfying, and really captures the 40k universe.\n\nAll in all 9/10\n\nFor the Emperor!\n\nFIX YOUR SERVERS.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "awesome game and graphics. very happy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Campaign was nothing special but the rest of the game modes are AWESOME!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Space Marine 2 is a solid successor to Space Marine, fits well into the Warhammer universe, and offers engaging and fun action combat and shooting mechanics. It is slight marred by a limited map pool creating repetitiveness in the game's multiplayer progression-based features",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "🤬 รีวิว Warhammer 40,000: Space Marine 2: ไอ้เกมเหี้ยนี่มันคือความสะใจขั้นสุด! 🤬\nฟังนะ! ถ้ามึงไม่ชอบเกมที่ เลือดสาด โคตรมันส์ และไร้สาระแบบมีสไตล์ มึงก็ไสหัวไป! เกมนี้มันไม่ใช่เกมปัญญาอ่อนที่ให้มึงมานั่งเก็บดอกไม้! มันคือสงคราม!\n\n🖕 นี่คือสิ่งที่แม่ง โคตรสุดติ่งกระดิ่งแมว 🖕\nมึงคือไอ้ตีนโตที่มาพร้อมกับชุดเหล็กนรก! มึงได้เล่นเป็น Space Marine เว้ย! ไม่ใช่แค่ไอ้ทหารกระจอกที่ตายห่าตั้งแต่โดนยิงนัดแรก ชุดเกราะ Power Armour มันทำให้มึงรู้สึกเหมือน รถถังที่วิ่งได้ ทุกย่างก้าวแม่งโคตรหนักแน่น ฟีลลิ่งของการเป็นทหารชั้นยอดขององค์จักรพรรดิคือ ของจริง!\n\nไทรานิดเหรอ? สวะชัดๆ! มึงจะได้เจอพวกเหี้ยนี่เป็น ร้อยเป็นพันตัว! เทคโนโลยี Swarm ของไอ้ Saber Interactive แม่งสุดยอดจนน่ากลัว! ศัตรูแม่งกรูกันมาเหมือนมึงกำลังยืนอยู่ท่ามกลาง คลื่นเอเลี่ยนกระหายเลือด แต่มึงไม่ต้องสน! หยิบ Heavy Bolter ขึ้นมาแล้ว สาดกระสุนแม่ม ให้เละเป็นโจ๊ก! มันคือการสังหารหมู่แบบมหากาพย์ ที่โคตรสะใจจนขนลุก!\n\nเสียงแม่งโคตรดัง! ไอ้ปืน Bolter ที่มึงยิงออกไปมันไม่ได้มีเสียงแค่ \"ปังๆ\" แต่แม่งคือเสียง \"ตับๆๆๆ\" ที่ดังสะท้าน! เสียงโซ่ของ Chainsword ที่กำลังสับไทรานิดจน เลือดพุ่งกระฉูด คือดนตรีร็อกของสงคราม! เสียงแม่งโคตรเร้าใจจนมึงอยากจะ ตะโกนด่าเอเลี่ยน ไปด้วยเลย!\n\nการฆ่าแบบดิบเถื่อน: มึงไม่ต้องมานั่งกั๊ก! จังหวะที่มึง พุ่งเข้าไปสับไทรานิดตัวใหญ่ด้วย Chainsword แล้วจบด้วยท่า Execution ที่โคตรโหด! หัวขาดบ้าง ตัวขาดบ้าง เลือดแม่งกระจายเต็มหน้าจอ มันคือความรู้สึกของการได้ปลดปล่อยความบ้าคลั่งออกมาอย่างเต็มที่! เกมเหี้ยนี่มันไม่แคร์ความรู้สึกใคร!\n\n💩 ส่วนที่แม่งอาจจะ หงุดหงิดนิดหน่อย 💩\nเนื้อเรื่องมันก็ไม่ได้หวือหวาอะไรมาก: เออ... มึงก็รู้ มันคือ Warhammer 40K เรื่องมีอยู่แค่ \"ไปฆ่าพวกเอเลี่ยนเลวๆ พวกนี้ซะ!\" ถ้ามึงคาดหวังว่าจะมีบทพูดคมๆ หรือดราม่าน้ำตาไหล มึงคิดผิด! แต่มันก็ดีแล้ว! เพราะมันจะได้ไม่ต้องเสียเวลาจาก การฆ่าล้างโคตร ของมึงไงล่ะ!\n\nภารกิจมันซ้ำซากนิดนึง: เออ มึงอาจจะต้องทำซ้ำๆ คือ ไปที่นี่ ฆ่าแม่งให้หมด ไปอีกที่ ฆ่าแม่งให้หมด แต่มันสำคัญตรงไหนวะ? ในเมื่อ การฆ่าทุกครั้งมันโคตรมันส์ และเต็มไปด้วยฝูงศัตรูให้มึงได้ปลดปล่อยอารมณ์!\n\n🤘 สรุปเหี้ยๆ 🤘\nWarhammer 40,000: Space Marine 2 คือเกมสำหรับพวกที่ต้องการ ความดิบเถื่อน ความรุนแรง และความสะใจแบบไม่ต้องมีเหตุผล! ถ้ามึงอยากจะสวมบทบาทเป็น เทพเจ้าแห่งสงคราม ที่เดินฝ่ากองทัพศัตรูโดยไม่สะทกสะท้าน!\n\nมึงต้องเล่นเกมนี้! ไปซัดหน้าไอ้พวกเอเลี่ยนเหี้ยนี่ซะ! FOR THE EMPEROR! (องค์จักรพรรดิคุ้มกะลาหัวมึงนะไอ้ลูกหมา!)\n\nต้องการให้กูเจาะลึก ความรู้สึกในการเล่น Co-op ว่ามัน \"ป่าเถื่อน\" ขนาดไหน? หรืออยากให้กูหาข้อมูลเกี่ยวกับ อาวุธที่ \"โคตรพ่อโคตรแม่โหด\" ที่มึงจะได้ใช้?",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Barbie dress-up for men.\r\nA blast to play, filled with action and testosterone.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "perfectly encapsulates the feeling of a third person arcade style shooter with replay ability that cant be beat. cosmetics are great just wish the element of pay to unlock wasn't there, the amount of cosmetics obtainable by just playing the game echoes from an era when you paid the retail price you had the entire game at your finger tips. \n\ncampaign is solid, multiplayer feels like a call back to gears of war and the PVE is just as much challenging as it is worth the rewards. Fantastic entry to the franchise and it sits lovely on my shelf with all my other warhammer games",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I enjoy Space Marine 2 overall and plan to continue putting time into its multiplayer. However, I want to highlight the issues that may be major detractors for others, especially anyone on the fence.\n\n[h2]Combat & Difficulty[/h2]\nEnemy damage in this game is extremely bursty. It’s very easy to get killed quickly, which makes the overall experience feel punishing—sometimes more than it should. You do have defensive tools like dodge and parry, and a successful parry lets you perform a gun strike. The issue is that gun strikes offer no invincibility, so you can get interrupted or simply overwhelmed before the move can help you. When encounters get chaotic (which they often do), this can create a lot of frustration. Higher difficulties also add more elite enemies, which only amplifies these problems.\n\n[h2]Cutscenes & Pacing[/h2]\nThe game opens with an unskippable cutscene—worth noting for players on a refund timer or for anyone who dislikes story segments. Everything afterward can be skipped, but the opener might annoy people who just want to get into gameplay.\n\nPacing is another issue. The game has a lot of stop-and-go moments: move forward, fight enemies, walk to the next objective, wait for a story segment to finish, and repeat. For a game clearly designed with replayability in mind—especially with its co-op Operations mode—it’s odd that the campaign has so many forced pauses baked in.\n\n[h2]The Rat Mission[/h2]\nThere is one mission in the campaign involving a massive swarm of rats, and it’s genuinely awful. The rats can instantly kill you, and these deaths feel abrupt, unfair, and frustrating. It’s a low point in the design, and it stands out sharply from the otherwise more conventional mission structure.\n\n[h2]What the Game Does Well[/h2]\nDespite those issues, I do find the core gameplay fun. Mowing down hordes as a Space Marine feels great, and the weapon feedback is excellent. The game also includes multiple classes in its multiplayer Operations mode, and each one has different builds that offer meaningful character expression and variety in how you tear through Chaos or Xenos forces. This part of the game is engaging and keeps me coming back.\n\n[h2]Conclusion[/h2]\nSpace Marine 2 has clear strengths—satisfying combat, strong class variety, and fun co-op—but also notable flaws in pacing, encounter design, and difficulty tuning. If you're willing to push through some frustrating moments, there’s a solid action game underneath, but its rough edges may be deal-breakers for some players.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games I have ever played. It's got a great story and the multiplayer never seems to get old with all the new stuff that keeps coming out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A fun and easy way to raise your T-level, guaranteed.\n\nPvP is a laggy, unbalanced mess but the co-op PvE modes are a blast and, combined with a variety of unique classes, offer a good bit of replayability.\nPlus ripping and tearing through hordes of enemies never gets old - execution finishers especially!\n\nGame crashes too much though...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very fun gameplay. Love the story even though its short. For the emperor.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Everyone who is a fan of the wh40k universe will appreciate the amount of detail and the love they put into this game but I really wish the story would be longer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game, but the main story was kind of short for my taste.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game captures what its like to be a Space Marine, a walking tank; it's an absolute power trip and I love it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game better and better. Reclamation is a great update.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game, interesting and fun to play with friends.\nFOR THE EMPEROR!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nA bit sad that they created a second Season Pass although I bought the first one before launch thinking it will include all of the DLCs in the future...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game but singleplayer is lonely you cant handshake the ai brothers need friends to perform the handshake",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Play this for the gameplay because the main story is honestly pretty bad. Pacing is bad, Imurah or whatever his name is isn't memorable or interesting in anyway and the rest is just fan service. Space Marine 1 had more interesting characters and a better paced plot. Space Marine 2 is hard carried by it's great gameplay and (Mostly) decent armor customization is enough to justify purchasing the game... when it's on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One of the best Wh40k games to date, runs well, plays well.\r\n\r\nCons: Very CPU hungry",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Space Marine 2 is a must-play thrill for anyone who loves fast action, big battles, and pure gaming fun!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is a great game for a warhammer fan but the updates comes late along with new challenges  and cosmetics",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A solid entry to the franchise and a great model to keep the game updated. All gameplay features are received for free and you only pay for cosmetics, which have only gotten better with time. Short yet sweet campaign that can be played in coop, Old school style multiplayer and a bunch of story related coop missions to play dress up marine in and show your drip. The endless wave mode is a bit undercooked at the moment imo.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Nice and excellent. But PC version still have some bugs..........",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "no enemy can stand against the truly most powerful characters in the 40k universe, a full squad of named characters",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Space Marine 2 is a sequel that surpasses the original in every regard. Bigger, better, prettier, and more badass.\n\n+ Amazing graphics with impressive art design that immerses you in the 40k universe.\n+ Fun and intense gameplay with the right blend of shooting and satisfying melee combat.\n+ Fantastic campaign with great set pieces and stand-out moments. (\"LEAD ME TO THE SLAUGHTER\").\n+ Multiplayer versus, operations, and horde modes.\n+ Purchasable cosmetics fit and make sense within the IP/lore, and you can still customize your characters how you want.\n\nAbsolutely worth picking up for any fan of third person shooter/action games, and definitely for fans of the 40k universe. This is a 10/10 game that honestly doesn't get enough praise for what it delivers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game didn't know anything about 40k but this game got me so in that I started slowly to learn the lore. Love the game play even tho some times it gets repetative still its really captivating expecually if you are a part of one of the chapter communitys that exist.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Space Marine 2 really captures the feel of the 40K universe. The feel of being a space marine and chopping through hordes of enemies is a lot of fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just bought it on sale even tho I can't play this game because I don't have a good PC/Laptop. Always been a Big Fan",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Some crash issues aside, (probably due to my pc), this game runs VERY well and the game is just REALLY fun to play! Seige, Strategems and Ops on higher difficulties are VERY fun to run, especially with friends! Love fighting against the Tyranids, as their designs really appeal a ton to me! Highly recommend for anyone looking to get into Warhammer, as this was my first entry into the franchise!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---{ Graphics }---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ MS-DOS\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ It's just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Audio }---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☑ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☑ Workable\n☐ Big\n☐ Will eat 10% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Difficulty }---\n☐ Just press 'W'\n☑ Easy\n☐ Easy to learn / Hard to master\n☐ Significant brain usage\n☐ Difficult\n☐ Dark Souls\n\n---{ Grind }---\n☐ Nothing to grind\n☑ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☐ Average grind level\n☐ Too much grind\n☐ You'll need a second life for grinding\n\n---{ Story }---\n☐ No Story\n☐ Some lore\n☑ Average\n☐ Good\n☐ Lovely\n☐ It'll replace your life\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☐ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i am a humble halo lore enjoying refugee and recommend this for scifi shooter fans. i thought the game was satisfying when i finished the campaign knowing nothing about warhammer, and it's only becoming better as i immerse myself more into the story beyond the game.\n\nmy big wish is that they'll \"port\" the co-op exclusive enemies + weapons + stratagems + difficulties to the campaign as a NG+ mode or something similar",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay and customization are the best parts to the game. Sometimes feels repetitive due to similar content (operations vs siege vs stratagems), but they're always working on adding more to the game. The main thing that needs reworking is the level progression as there is very little incentive to prestige all over again just to gain one more skill. Overall though, this is a really fun game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "+++ The Emperor calls you 🫵 to fulfill your duty! +++\r\n\r\nNo for real, great game, they captured being a Space Marine as best as I've played!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Empecemos por lo malo que he detectado en 95H, UE5 significa optimizacion y estabilidad imposibles, el contenido tarda 3 o 4 meses en surgir por ende se vuelve un poco monotono, los problemas de conexion terminan en una eleccion de si queres ir al menu o cerrar el juego cuando podrian directamente mandarte al menu. \r\nAhora a lo bueno, uno de los mejores coop-shooters de 2024, no solo por la fidelidad al lore y a los fans si no por su simplicidad y respeto a los jugadores. Si bien tiene multiples DLC y multiples oportunidades de monetizacion, la direccion que eligieron de basar todo el progreso en horas de juego es increible, otras compañias deberian de tomar de ejemplo a Saber con este juego, o Arrowhead con Helldivers 2 (pese a tanto drama generado por sony) o al mismisimo Larian Studios con Baldur's Gate 3. Lo que hace bueno a este juego es todo el conjunto de buenas decisiones que tomo Saber a la hora de desarrollar, pese a las cosas malas, las buenas sobrepasan estas. Lo recomendaria desde que salio, hasta el dia que salga SM3.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "PRAISE BE TO SPACE KING! You play as a large, angry man who turns millions of bugs into paste with a chainsword that sounds like pure justice! It is the perfect training simulator for purging the universe of everything that isn't us! 9 out of 10 severed heads!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Sometimes you want to solo game sometimes you and some mates just want to SMASH THE XENOS. and oh boy can you enjoy wrecking stuff in this game. The skill is mostly in the special bosses and whilst it might get repetetive at times, the atmosphere makes up for a lot. the Bolter sounds meaty, the chainsword roars and the crumbling imperium feels nice and dark. Welcome Spacemarine to the 40K milenium",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is very immersive and fun, combat is engaging and satisfying, very overshadowed by poor design of punishing progression in online operations mode that removes your perks when prestiging, making you feel weak again and forcing you to do lower difficulty missions or be a burden on your friends carrying you, and doing lower difficulty of course means you get less xp per run making it even more of a grindy hell. It is guaranteed this is the main factor that is driving people away from committing to it long term, seeing as it took me over 200 hours to get all classes to max prestige and most of the weapons to their respective max levels as well. However if you are a 40k fanatic, or this game makes you one, you will no doubt endure the Emperor's Challenge that Saber has created and become one of the brothers keeping our chapter alive, and I salute you! \r\n\r\n---FOR THE EMPEROR!!!---",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great graphics, great game, great balance. Updating for nomination, Patch is great.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "if you’re into massive power armor, brutal combat, and pure, unfiltered violence, then Space Marine 2 is exactly the game for you",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "OH YES WE ARE SOOOO BACK.... and what a comeback. \nThis is a letter of love to all the gamers out there that like to blow heads and purge filthy Xenos in the name of The Emperor.\nEven tho the campaing seems a little bit the same to the first one. It Doesnt disappoints its simple but effective, the combat its amazing and even tho there is some minor bugs. Its not game breaking.\n\nAn upgrade of the first one indeed and its absolutely worth of your time and money. A masterpiece indeed pls give it a try.\n(YOU EVEN GET BARBIE STYLE CUSTOMIZATION FOR FREE!!!!!!) Major Sarkaana pls step on me....",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have mixed feelings about this game. \n\nOn one side, I absolutely love it. It's one of my favourite games to play on occasion.\nOn the other side, I hate how it's divided my friends as to what we should be playing.\n\nMy friend is an avid 40k fanatic. He bought the game for me and we played from day one. I've encountered all the network woes, content droughts and erratic matchmaking. I think that's normal in most game launches, unless you're Larian Studios.\n\nI highly doubt they will add African servers, and to my understanding this is a P2P game. Why is it that when I join a friend in the same country and province, our ping starts at 20. When we load into a new area, it jumps to 200, the equivalent of an EU server. What gives?\n\nI'm not a fan of achievements being locked behind PvP. \n\nNot a review point but advise for this game: I think an important lesson is that (with all life encounters), it's good to practice and hone your skills. Space Marine 2 requires time and practice to understand the gameplay and mechanics. You will get better with time and discipline.\n\nPlease don't expect to power through everything because \"ARR WE'RE SPACE MARINES\". Keep your emotions in check and don't let rage consume you. Don't rage quit and bail on your battle brothers because the game's too hard. The Emperor Protects.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is absolutely fantastic.\nPvE & PVP never feels repetitive and leveling does not feel grindy at all\n\n✔Campaign\n✔PvE\n✔PvP\n✔Action",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great bit of fun , difficult but rewarding combat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's quite hectic and I'm not very good at it, but I find it surprisingly fun and enjoyable... even if I suck at it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "STOP MAKING GAMES WITH UNREAL 5 we waited a DECADE..... 4 allows 4 player squads!\nUNREAL5 is TRASH - three player squads. Resources are bloated and crap. 4 was perfect! even the candles looked better! ROLL IT BACK. OR don't even bother to do it again... there's always spacehulk where you FEEL like a 40K  war machine.. why am I getting whipped when jumping in the air? why am I loading for trash shaders for so long? Unreal 5! KNOCK IT OFF... Do 4-5 man squads !  what are all these units for? IF IM GONNA GET JAMMED UP MAKE ME A TERMIE AT LEAST! not some Cadian with trash picked out of a bargain bin. - other then that have fun. Get one shotted pressing a button on a door or lift. BOY, thanks for the paid paint schemes. WHOOPTY DO. Ranged Terminids and Melee Chaos?  AND THATS ALL? Back shot and all armor drained by Gaunts? WHERE DO THEY KEEP THEIR KIT? why do they let me run by and attack ONLY when I hit a button? why do I need to HOLD a BUTTON DOWN to pick anything up? Feed yourself to Nurgle. No that's too good. Get captured by \"Eldar\". OH who are they? Orks? Huh whoozat? COME ON. WAKE UP.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I absolutely love this game, continuing to get updates and following through with promises. Take note other companies, this is how you build trust with your player base. \nThere will always be people who are not happy with the speed these updates are coming out and sure, they might be valid, nevertheless - they come out.\nI'm super excited to see what the future holds for the Space Marine franchise and what else Saber Interactive come out with!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game has grabbed me and refused to let go. This game got me acting unwise\n\nBut the real game changer is the community. I came for the fun of a 40k game, but I stayed because I somehow stumbled into a squad of absolute legends who make every session 10x more fun (and some times 20x more unhinged).\n\nIf you’re wondering whether Space Marine 2 is worth playing, just look at my hour count. No sane person spends hours on something they don’t love doing. (might be addicted)\n\n10/10, would dive into a Tyranid swarm again. FOR THE EMPEROR",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Takes some time to get used to the combat (very different from  the first game), but once it clicks it's very satisfying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is very good and enjoyable.. Until you try the last 2 difficulty settings.. naaaah they are balanced for WeMod users or real Ultramarines... never again... the rest of the game is godly tho FOR THE EMPEROR!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fast and skilled melee combat with solid shooting mechanics. Overall, the game feels quite \"okay\". Gameplay itself doesn't have any major standouts and doesn't do anything innovative that I can think of.\r\n\r\nThe real draw to this game is the attention to lore of the 40k universe. Characters, in game models, weapons, and even background details are recognizable to longtime and even casual fans.\r\n\r\nWhile it shouldn't affect the score overall, Warhammer games tend to be lacking. This one is one of the few that break that trend and is quite good. Again, the draw here is the okay gameplay, dumb fun of an action melee shooter, but mostly the fantastic display of the 40k world for both old fans and to bring in new ones.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The Emperor has given us a glorious game so grab a couple battle brothers, ask the Machine God for a blessing and CRUSH the Heretics. Machine God, set us free.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a casual player that knows nothing about Warhammer lore. I was drawn in by the gameplay and replayability. Great game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have to say, I’m now 200 hours into this game and have finally reached the point where I can give a full verdict. The single-player campaign is fun, and I even did a second playthrough with a buddy who picked the game up. That being said, where this game shines is PvE. Siege Mode is great, and Operations are well done and very replayable.\n\nEach class makes the game feel fresh, and the leveling curve for each one always feels like a new experience compared to the last. The game is definitely a game of skill, and it feels very rewarding when you master a weapon or class build.\n\nThere are some downsides: Siege Mode is fun but needs more content. Also, some classes are just too weak to handle higher difficulty Siege runs. Overall, the devs seem to update the game regularly. All major new maps and classes (like the upcoming Techmarine) are free; the only paid DLC is just character skins. If you like a game that requires high skill (like Dark Souls), then this is for you. Well worth the buy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "7/10 - I definitely recommend this game if you can get it on sale. \r\nGameplay:  Fun Game.  I really liked the mix between ranged and melee fighting.  The counter and dodge system is good enough.  The game is little on the easy side at normal, but the harder difficulty can be challenging. \r\nGraphics:  Stunning.  The level design and detail are amazing.  I found myself stopping the look at the environments and the hoards of tyranid swarms as they approached.  I just wish there was more of it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Darktide was my first real introduction to 40K and I found myself very curious about 40K lore. They kept the lore at a minimum in Darktide, and I can see why after diving into it myself- it gets dense fast. If you're considering this game as a fellow varlet, realize it's nothing like Darktide. Buy this game if you want a more complete picture of the 40K universe. In Darktide, you're limited to operating in a single city of a single planet as either an Astra Militarum or Adeptus Arbites operative and you're only fighting against 3 vague Chaos sub-factions (Scabs, Dregs, Infested). SM2 expands the experience to 3 planets, 20+ Astartes Chapters, 1 Xeno faction, and several Chaos factions (which are actually playable). \r\n\r\nOnce you A) get past the unnatural controls (on keyboard/mouse), B) acclimate to following the frenzied action in 3rd person, C) grind a few weapons to an actual playable level, this game rises from a flashy, mindless shooter to a moderately tactical/strategy game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game, cosmetics are a bit pricey tho",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Purge the Xenos.\n\nSatisfying combat, incredible atmosphere, and a campaign that respects the lore. Whether you're solo or in co-op, crushing Tyranids has never felt this good.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game. Kill bug. Be happy. Better with friends. Make friends. Kill bug with friends. This is the cure to male loneliness. \n\nProgression feels good. \n\nDisconnections still suck because no longer kill bug with friends. :(\n\n9/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The long awaited sequel to the hidden gem that was the first Space Marine game, comes larger swarms of enemies, size, details and scale of the world faithful to the Warhammer 40k universe, memorable characters and scenes to view. The gameplay is smooth, having elements of both third person shooters without a cover system, and a fleshed out hack and slash gameplay against enemies in melee combat.\n\nThe campaign story takes place in the Indomitus crusade era of Warhammer 40k which happens after 8th edition so every space marine in this game is a primaris space marine despite firstborns still existing in lore. Titus returns from the first game along with some new faces of both Gadriel and Chairon fighting against Tyranids [spoiler] and Thousand Sons traitor warband [/spoiler]. \n\nI personally do not want to nitpick Space Marine 2 because the devs at Sabre Interactive put a lot of genuine care to their game and respected their audience in terms of free gameplay updates, and less anti-consumer practices of other game studios, but compared to the 1st space marine game there are a few pet peeves of mine. The weapons feel and sound like oversized assault rifles rather than the heavy hitting bolter rounds described in lore, the marines don't feel as heavy as in the first game, and combat is more akin to a souls-lite than feeling like an unstoppable juggernaut, but that is just my opinion.\n\nDespite the mind-blowing campaign and replayable operations mode, the PvP mode is not as good because the teams do not get mixed after finishing a match which leads to one team winning over and over again until people inevitable leave, chaos customizations is limited compared to their loyalist counterparts since the game focuses on loyalist space marines.\n\nOverall, a fun game to play especially with friends considering the 3 player campaign, operations, and horde mode are all PvE, experience to gain to unlock weapon upgrades, class perks and character customization. The game is periodically updated to always add something refreshing to play and work for, a breath of fresh air in the modern gaming world when players are losing faith with most AAA game studios.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Do not listen to the negative reviews brother. The forces of chaos are trying to discourage you from joining the fight once again. Come brother, and may we join forces in delivering righteous fury upon our enemies in the name of the God Emperor!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've never encountered a game like this before. Where I'm both the badass who hacks away at the enemies and the fan cheering on \"YEAH! RIP HIS HEAD OFF! FOR THE EMPEROR!!!\" during an execution. The PvP game modes could do with some tweaks. After all, and I'm saying this for new players, the learning curve is a sheer cliff.\r\n\r\nBesides that, an amazing game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i wanted to refund because i usually dont like these types of games but then it put me in a MOVIE. it felt like i was really a part of every little thing happening around me, not like it was a part of MY story. It felt more like I was this little piece of this huge universe, that doesnt revolve around me",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game so far but my god, im 93 mins into the the game and im STILLLLLL tryna do the prologe.... i just wanna play the actual game like ffs. most annoyying / long prologe ive ever seen in gaming",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing graphics, fun fighting, and cool characters.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Definitely awesome game. All Warhammer fans must be pleased!\r\nHere we have an exciting though a bit short campaign where you will shoot and cleave, blast and stomp against enemies of the Emperor alongside with your brothers.\r\nAlso there are some side missions which are connected to campaign aaand... here you are entering PVE-mode, where you can play either with bots or other players to master and upgrade weapons and unlock new skins. Here you can customize your spacemarine's armor, use different paints and decals. You can do the same in PVP-mode where an eternal multiplayer war is going.\r\nThe game is super spectacular with all of its hordes of enemies on your screen. Blood and gore. Exposions and destruction.\r\nFor the Emperor!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "W game, like everything about the game, could use some more addons.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Getting disconnected on siege mode on high waves is super fun. Plus you get absolutely nothing, no xp, no rewards, just the middle finger by Saber.",
      "voted_up": false,
      "votes_helpful": 51
    },
    {
      "review": "Amazing game, graphics are good and the gameplay is solid.\n\nBut also PLEASE FIX THE SERVER ISSUES. The amount of times I've got to the end of a mission only to disconnect, booted back to title screen with no option to re-join. AND lose all XP and stats from said mission.\nJust got really far into a Siege match, spent around 2 hours on it and just lost everything.\n\nI'm 56 hours into this game but praying I can get a refund.",
      "voted_up": false,
      "votes_helpful": 71
    },
    {
      "review": "Was great until patch 11 now epic levels of disapointment...  the load times have doubled, or more, and i keep getting booted because it says im running MODs when im not.  I was running SM2 through steam on linux mint and then patch 11 dropped and became unplayable.  i switched to Nobara Linux to see if it would help and now it just says im running MODs. absolute BS for the price point of the game...\r\n\r\nCPU: 12th Gen Intel(R) Core(TM) i7-12650H (16) @ 4.70 GHz\r\nGPU 1: NVIDIA GeForce RTX 4060 Max-Q / Mobile [Discrete]\r\nGPU 2: Intel UHD Graphics @ 1.40 GHz [Integrated]\r\nMemory: 8.26 GiB / 15.30 GiB (54%)\r\nSwap: 1.86 GiB / 24.83 GiB (8%)\r\nDisk (/): 15.78 GiB / 934.45 GiB (2%) - btrfs",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Great game. Great story. Great game play. Unfortunately the \"mods detected\" glitch on unmodded games has hit me hard. I'll update if I (or the devs) fix it. But for now, this is bullsh*t and it's incredibly frustrating.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "you are in siege mode for 1.5h++ get disconnect from server and get nothing, i read a lot of review and some ppl reporting that they are getting disconnecting from siege (i have this problem only there idk)\n\nanother problem some players like my friend can't even connect to multiplayer anymore due to \"modification\", he did not modify anything (he checked a lot), the game support does not help either",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "The PvE operations and campaign are fine. However I would not recommend PVP. It is unbalanced when it comes to matchmaking. Don't think Saber Interactive will ever fix it and don't ever plan to fix it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Great anit-cheat. Does jack-all but crash my machine spirit if I have the audacity to play BG3 some time before rebooting.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "great visuals and sound, but clunky repetitive combat (mele part)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I expected a deep single-player campaign, but the game is more centered around multiplayer. Not what I was looking for, but fans of online play might enjoy it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "PERFORMANCE SUCKS!!!! GAME LOOKS AMAZING BUT I DON´T WHY I GO FROM 120 FPS into the single digits on some parts I just try everything to fix it...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "30mins of gameplay and cannot even see the starting screen, after searching google there are so many people having same issue and cannot find a fix easily, im going to refund anyway",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is stupid in PVP, many guys are cheating game, game issues many, aim assists like aimbot and admin do not fix, they even dont care and just focus on update stupid cosmetic, pve maps to earn money from newbies. I DONT RECOMMEND",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game still is incredibly laggy and unoptimised even when I have the recommended requirements",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Eh, it's not terribad, but it's just not good, nor worth it's asking price.\r\n\r\nThe game gets the overall atmosphere and visual style right. The maps and set pieces are actually pretty neat and detailed, and the backdrops, particularly the live battlefields (where you will see hundreds, if not housands, or combatants that you can ACTUALLY SHOOT) are extremely immersive. Also the whole mechanic of Tyranid swarms trying to charge you atop of a wall, with you mowing down dozens of them in salvos, is done well.\r\n\r\nBuuuuuut that's kinda all the good points already mentions. The game's performance isn't great, which is the reason I refunded it *twice* on my two previous rigs, the one not being able to boot the game at all, the other stuttering to much in the early levels for me to keep it. After getting a new PC (and, to clarify, this one's hardware is absolutely overproportionate and hasn't run any recent title at less than maximum FPS) I decided to give it a 3rd try, and it does run stable now. If only barely.\r\n\r\nStory-wise, the 8h campaign is rather simplistic with only minor twists that you would have to be daft not to see coming. The soundscape is likewise bland, and the game utterly fails to make any of the weapons feel actually good to use. At one point I heard a faint buzzing noise from around a corner, rounded it, and came to face an NPC tank mowing down a tyrannid swarm with a heavy bolter. I was legitimately dumbfounded at how absolutely undertuned the weapons sound effects were.\r\n\r\nNow, this could maybe all be overlooked if at least the gameplay was exciting. But it was likewise forgettable. There are some interesting points, particularly early in the campaign, but once you get past the tyranid bit, the gameplay legitimately takes a turn for the worse because at least the tyranids felt interesting to fight due to their slightly less orthodox tactics.\r\nGuns, as mentioned, don't feel to great, and the bigger enemies are both bullet spongy, and incentivize you to deal with them in melee, thus emphasizing that kind of close range combat. Yet the melee combat system barely deserves to be called that, and is essentially a single-button system that has very, VERY little variety or thought beyond 'slap the enemy until he winds up a parryable attack with a big glowing indictator, slap him another time for good measure, than leisurely press the second-long parry'. \r\n\r\nNow, after the campaign, the game technically has a number of Coop PvE missions and a PvP mode, with some light class customization and stuff... but I'll be honest, the gunplay was so damn dull, I'm not exactly motivated to even try that out, and will instead just go back to Darktide (which, by the by, gets the sound design of the weapons done so much better it's amazing how they didn't just copy that).\r\n\r\n\r\nOverall score: 3.5/10\r\nGraphics are fine, but everything else is strictly sub-par. Not even worth a buy on a sale, just get literally any other game instead, or just replay Space Marine 1 if you really crave to be a Space Marine.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Would not recommend in it's current state. There's been ongoing network issues for months now, which make the game completely unplayable, recent patches seem to advise they're addressing the issue, but it's still cooked.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Alt tabbing destroys this game, and the fights are never fair.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "PvE boring as f...  No way to unlock gear through PvP forcing you to do sh...y PvE.   Meele tottaly broken and overpowered in PvP. dont buy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is extremely immersive and the story is utterly captivating, then it drops off, which isn't good for an 8 hour campaign.\n\nThe parry system uses the same sound for parryable and unparryable attacks, some attacks aren't telegraphed, attacks have hitboxes behind the enemy, dodges don't function sometimes, and spawns don't account for location, events, team size, level, player-skill rating, or ping (all of these are modern AAA innovations and aren't copyrighted).\n\nThe demon enemy is so egregious it warrants its own section, it has a rush attack that effectively cannot be dodged due to the parry timing being off, the hitbox being too big, the enemy not responding to staggers, and to top it all off there are usually more than one which will render you stunlocked (it is also astonishingly fast).\n\nThere is a bug which makes the game detect mods that don't exist which locks you out of pretty much all of the game and the only fix is to manually delete the games files and steam verify which will reinstall all 60GB (this is not a rare occurrence and takes hours to remedy). The devs shifted blame away from themselves instead of disabling scanning for mods outside of PVP, a VERY easy solution they refused to listen to us on.\n\nthe customisation UI is incredibly confusing when it comes to selecting colours, load times are too long, you'd expect a maximum loading time of ten seconds with low optimisation, you can get triple that. utter nonsense.\n\nThe DLC, lets be honest is too much even on sale, that is the price of medium indie titles for only cosmetics, considering the IPs reputation it could be worse. (They thankfully aren't pay-to-win)\n\nTLDRR: This game is REALY good, it just has a LOT of issues, most affecting the gameplay itself and making it effectively a dice role if you want to play at the higher levels rather than relying on skill, it also has that one MAJOR bug that locks you out of multiplayer (where the majority of the game is) I WOULD NOT BUY THIS GAME. (Unless you have Gb-capable internet, a supercomputer, and money to burn as a WH40K fan)\n\nOn a scale of Shambolic(1) to Iconic (10) I rate this a Good (6), its a game that is established itself and is all round fun to play, but fails to compete against more prominent titles in the genre, such as Helldivers II at a Great (7).",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Joining people can install 'mods' that just kicks you to the main menu and you can't play. Amazing...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The assault class jump indicator under your reticle at all times is insane, you can't turn it off- EVER.\n\nI got through the campaign and it was... okay; the whiney baby ultramarines in your party gets old, (aren't they supposed to be augmented to not be emotional b*tches?).\n\ngetting into the PvE Operations lined me up with an interest in the assault class as a main; however they have a permanent jump indicator under your aiming reticle at ALL TIMES and there is no option to disable it or make it dynamic- it is just there; this big glowing icon on the ground everywhere you aim. \n\nI have never had a single UI option disenfranchise me from a game so fast in my entire life. I haven't played it since I found out this wasn't a bug- but in-fact; intended behaviour.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "this game, its such a half and half, graphics? good. gameplay repetitive, so much potential for differentiating playstyles like loadouts having perk trees corresponding to your guns, weird that isnt a thing, and i have to change perk trees and skills just to be proficient with my weapons, they shouldve released this game with at least 3 horde mode maps, and twice the amount of content, ii wish they were given more dev time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Campaign is fun, I'm sure the online gameplay is fun too but I'm unable to access it for some unknown reason. \"Error Code 14\" no further information, and no explanation as to how i'm able to access the entire rest of the internet without any issues, but i'm somehow unable to connect to Focus Home's multiplayer server. Glad I got it on sale, cause if I'd paid full price for this I'd be pissed. \n\nI'll recommend it when they fix their online connectivity, until then I'd recommend you just pirate it for the campaign.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Well, as fun as it can be, if you're looking for the hack-and-slash power fantasy good times, look to the previous title. Space Marine 2 has been experiencing an identity crisis since launch, pretty much. The game tries to act like a souls-like, a horde shooter and a hack-and-slash, yet because of the soulslike elements the hack-and-slash portion feels frustrating, and is further amplified with no smart enemy placement due to its horde shooter aspects, meaning you will inevitably get caught in a situation where your imminent death is simply unavoidable, and you could not do anything about it. Your guns feel like peashooters, and you catch every stray bullet you can and will drop within brief seconds on the highest difficulties. Long story short: Recommended for people who enjoy fighting Malenia.\r\n\r\nThe dev team caters gameplay content mainly to the upper skill level of players as of now, which is essentially a niche minority, seeing as how the game almost completely devolves into dark souls once you really get up in those high difficulties. \r\n\r\nAll in all, okay game, graphics good, music... meh, World looks nice, but the gameplay loop is just varying difficulty of dark souls going from beginner friendly to Monster Hunter to Elden Ring. \r\n\r\nI could go into more detail, but I believe that just making sure people know what they're getting into is more than enough. It's not really Space Marine, the Emperor's angels, His wrath embodied, and more like... Foul Tarnished...",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "How bad can a game run?\r\n\r\n30fps on an i5 12600k and RTX4070ti and settings set to Medium. 60fps with DLSS ultra performance and frame gen.\r\nIt's worse than Monster Hunter Wilds. I have better performance on Cyberpunk 2077 maxed out RT overdrive.\r\n\r\nAnd the gameplay is clunky, quite boring, slow. They all talk wayyy too much.\r\nStory is uninteresting and unimaginative.\r\n\r\nI hate this blighted overhyped spawn of entertainment software.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game has horrible input timing and loves to just deny you even when you do input correctly. It's mostly about how you block and dodge and the game LOVES making sure you can't through input manipulation.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I could not play with my friend because of the stupid \"Mods detected\" error.\r\nThe game itself lacks depth and gameplay diversity - there are far too few maps, the plot's epic overload becomes annoying very soon, the enemies are bullet sponges. Most of the bolter variants are the same and give no feeling of impact.\r\nIt is worth playing for the campaing and one round of operations.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Siege update broke the game, it launches to a black screen.\n\nEdit:\n\"Saber Help\" told me to fill a support ticket but it doesnt work; I got an email from postmaster telling me that the details couldn't be delivered to support@focus-entmt.com",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is not fun. Melee is shit, ranged weapons are shit. Most class perks are shit. Most gun perks are shit. Expected to kill thousands, with your gun with less than 100 ammo. Requiring a clip or more to bring down a simple majoris. Spawning three extremis cause the game hates you. Hyping up melee, where you get destroyed by so many ranged enemies. And to top it all off, they expect you to max your class and prestige four times to get prestige perks which are also shit. Everything will one shot you, they expect you to fight for your contested health, melee barely gets any contested health back and you can't fire your gun since so many enemies are attacking you at the same time.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was riding elevators, pressing buttons, and watching cutscenes for at least 60% of the game. Straight dookie.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I am constantly kicked with \"mods detected\" \r\nI do not run mods (ever) yet I cant play the game anymore.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Game is good, the server connection issues is annoying to deal with tho. Its become so frequent that sometimes its unplayable.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As you can see I've stacked up quite a lot of hours, having quite a good time in game and here is the thing - I have hard time to strongly recommend the SM2.\n\nThe game is all in all satisfying but has way to many issues:\n- Poor design choices (enraged enemies, stunlocks, chaos spawns)\n- Jank (issues with parry/dodge resgistration, hitboxes)\n- Devs need way to much to time to fix bugs or provide proper buffs to some classes/weapons\n- Updates seems to be half-baked and not really thought-out\n- Connections issues, where is the basic lobby browser?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The most mid of the mid IPs, with the most mid of the mid third person shooters out there, and since it's better to just hit the enemies with melee, I'll also count this game as a hack 'n' slash... so, it's also mid as an action game.\n\nSo... lame as a shooter, at its best, weak as hack 'n' slash, boring co-op campaign, the story was a big whatever and I was happy when I saw the credits going up. Just skipped that thing and rushed to uninstall this game.\n\nI have doubts if I would consider this better than Suicide Squad, they seem at the same ballpark to me, and this game is even worse than 'Sushi Squad' in some aspects, however the main thing for me is, this one was more expensive, so I'm way more annoyed for buying this one.\n\nTo cut short, a big waste of money and time.\n\n\n[table]\n    [tr]\n\t[th]F[/th]\n\t[th]E[/th]\n\t[th]D[/th]\n\t[th]C[/th]\n\t[th][h1][b]B[/b][/h1][/th]\n\t[th]A[/th]\n\t[th]AA[/th]\n\t[th]AAA[/th]\n\t[th]S[/th]\n\t[th]SS[/th]\n\t[th]SSS[/th]\n    [/tr]\n[/table]",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fuck this game and its servers. I keep getting disconnected when the mission is almost over. FUCK YOU SABER at least add a reconnect button",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "[b]Amazing Potential, Poorly Managed Execution[/b]\r\n\r\nAfter spending over 740 hours in Space Marine 2, I can confidently say this game has incredible potential — but it’s buried under layers of poor management, technical problems, and neglect by a developer who was clearly shocked by the game’s success and unprepared to handle the demand and sales that came with it. \r\n\r\n[b]Missing Essentials[/b]:\r\nThe game lacks even the most basic features — like a simple in-game communication system, and the ability to track, add, or chat with friends directly from the menu. These are standard in any modern multiplayer game, yet still missing here.\r\n\r\n[b]Gameplay & Technical Issues[/b]:\r\nAnimations are often broken or incomplete, and hit registration fails in almost every match, making combat inconsistent and frustrating.\r\n\r\n[b]Cheating Problem[/b]:\r\nThe game is FULL of cheaters, and despite players submitting clear video reports, most remain unbanned for months. Developers seem to have no real anti-cheat strategy or enforcement, which kills the game’s long-term integrity.\r\n\r\n[b]Controller Aim Assist[/b]:\r\nAim assist for controllers is so overpowered that many PC players have switched to controller just to gain an edge. It behaves almost like an AimBot , completely breaking PvP balance and turning matches from skill-based fights into technical exploitation.\r\n\r\n[b]Matchmaking & Server Issues[/b]:\r\nMatchmaking is extremely poorly optimized. In many 6v6 matches, you’ll see 11 players with pings over 180 ms, while one sits at 20. The system fails to balance teams or select proper servers based on player location or count.\r\nTeam composition is also a mess — it’s common to see level 30+ players all on one side and under-15 players on the other. This massive imbalance discourages new or casual players and is killing overall participation.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the vibes and aesthetic carry this game\r\n\r\nCombat can be fun but overall it's a bit clunky and monotone. the campaign is woefully short. the only other game mode i'd care for is fortress but even there the map is terrible and you're hassled with side objectives instead of fighting. \r\n\r\nfull of arbitrary limitations, apart from a few badass moments it was disappointing",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I'm a little conflicted on this one. On the one hand, the content that's there is quite good. Graphics and assets are all beautiful and the combat is smooth and satisfying, but overall, there just isn't much singleplayer content. For a $60 game, you kind of see everything pretty quick and gameplay becomes repetitive. PvP and PvE modes didn't click for me, so as someone who mainly bought this for the campaign, I don't feel that the content justifies the pricetag, even at a discount.\n\nAll-in-all, I would recommend this game to a person like me for maybe $10. If you're more interested in online play, though, this game could still be worth it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When I pay you for the ultimate version of something that means I BOUGHT THE PRODUCT.... You dont get to turn around a month later and release 'DLC' - I am SO sick of this.... It is NOT 'DLC' its CUT CONTENT! Its a whole bunch of the product I ALREADY PAID YOU FOR sliced off and repackaged. I NEVER would have bought the product if you made it clear you were going to do this you morally bankrupt maggots.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy if you hate timing mechanics, with no way to learn the game other than frustration and failure loops.\n\nAlright, core game play, is shit, filled with abusive fail loop mechanics. No joke, they likely hired psychologist adjacent folk, with no sense of ethics, to make as many hooks and negative feedback loops of addiction as they could find. Game weighs on making you feel bad, not accomplished, but a failure. Preys on some really dark, and negative sub psyche elements and motivations.\n\nSo, yeah, buy. But, put in offline, visit mod Nexus, and just play that way pretending the official Saber run part online does not exist, because it shouldn't with how they made the product to be this way. Trust me, you are missing nothing skipping the online portions as Saber does it, over doing everything solo, offline, with mods to make it playable.\n\nGo ahead Saber, keep catering toward those 10k or so sweats. Hats off, on sales, you pulled enough to live on that, for now. But yeah, if there is ever a Space Marine 3 made by this team, management and monetization wise, or really this is enough of an albatross as it should follow them the rest of their careers into any game they make, don't be surprised if it is avoided. Those huge numbers you sold to, and left this game in the unfun, unfair, abusive engagement driving state it is, isn't something I'd wish to invest in.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game, but servers are ass and it's worse on some levels than others for some reason. Literally can't complete the final mission because it lags so bad",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just started playing this game more after reading about the awesome mods the community put work into. I dont play multiplayer and was having a blast, until they updated 11.0. From what I can tell, it was to basically ruin the mod scene. Now my game basically doesnt work. I am assuming this is so you pay the outrageous $60 for just a bunch of cosmetic items (which I already bought by the way). Extremely disappointing, just another game company trying to bleed your wallet dry.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pls fix pvp it's in such a garbage state with assaults instakilling every game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fun game. Cannot play PVE as it says I've mods installed. Mods were not touched.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "welcome to super grind fun game but insane grind for what the game is and the content it has",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I loved this game but, Im no longer able to play the game now because I was quick matched into an operation match where someone had mods and now the game thinks I have mods enabled. \n\nI basically lost all my progress. I tried all the solutions I could find to fix it. Nope!!!!!!! Mod detected, still won’t go away!!!!!! I tried uninstalling it and reinstalling the game completely. NOPE!!!!! Reboot to last cloud save. NOPE!!!!!!! Load a very, VERY old console cloud save. Did you think that would work??? OF COURSE IT DIDN'T WORK!!!!!! I’m pretty sure I tried everything. The game still says mods detected even though I’ve never installed mods to this game NOT ONCE!!!! All I did was boot up the game to see the new update and clicked quick match and the game placed me into a match (THAT THE GAME PLACED ME IN BY THE WAY!!!!!) and then I immediately saw an assault class with a heavy class only weapon and before I could even react BOOM you were kicked from the game for using unauthorized mods and now the game thinks I modded my game and won’t let me play anymore. Unless there’s a way to fix this and get my progress back I’m never changing this review and highly discourage anyone wanting to play or buy this game unless you wanna play solo only with AI or with friends who won’t download mods. But you still might wanna check with them first so you don’t get false flagged as well for having mods!!!!\n\nEdit: So it also looks like people are also getting false flagged for having mods, even though they didn’t download mods in there games and or match’s to begin with. I love this game I really do. But they need to fix this severe game breaking problem\\ bug URGENTLY and send out a patch or fix for those who have false flagged and never downloaded mods. Also if you play this game only on console, definitely turn off cross play immediately. This is at least lowering the chances of you getting false flagged for mods that you never installed to begin with as well. It can still happen to you but it’s less likely to happen, at least that’s what I’m being told. I’m happy that some people are able to fix this problem and are able to play the game again but as of this moment, Im pretty sure I tried everything and it didn’t fix anything.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Let the game die, pure shit, dlc shit, operations just ok stratagems pure shoit",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The PvE balance is really terrible. You’ve added a large number of elite enemies meaningless just to increase difficulty, while players have very limited abilities. Leveling up is also too tedious, and the replay experience is almost zero. Spacemarine II could have been much better, but you’ve already ruined this game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gameplay mechanics, level & enemy variety too shallow\ndifficulties and unlock progression not that satisfying\nbloated textures are very nice to look at, though for me it doesn't justify the wasted ssd space + load times\nmarine customization is cool\nesg\n\nback to hoxxes\n\n(alternatives worth checking out depending on taste helldivers2, vermintide2, darktide, DRG, L4D2, monster hunter series, granblue fantasy: relink, nioh)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is 10 hours long. Then you go to PVE or PVP. Another 10-15 hours. It wouldn't be bad if 4 of those 10 hours are watching a loading bar...buy if you miss those old '90s vibes",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Shortish take on this game:\r\n\r\nJust as you get into the campaign, it ends. Beyond that its a horrible grind fest, by the time you finish leveling a marine 4 times (resetting everything) your bored of the content. It does become more fun once you have abilities/builds unlocked but getting there is a grind. Hard and Hardest difficulties the enemies become bullet sponges and hit like a truck, very boring.\r\n\r\nGame does look amazing,\r\nCost of season pass is too much..\r\n\r\nUnlucky brothers..",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Tried giving this a chance twice, from substantial difficulty onwards playing solo is impossible. I can't upgrade my weapons anymore because I keep dying right at the end of every mission because the final boss will rush you constantly leaving no room to dodge, coupled with all the other enemies shooting from a distance while the boss charges you is not anyone's idea of fun. Why all the nerfs? Why only 1 extra weapon? This game has a severe balancing problem that doesn't seem like it will be fixed. I really want to like PVE in this game because its the only mode besides the Campaign where I don't have to play against people. What a shame. Single player enjoyers AVOID.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "wanted to try out the coop mode after finishing the first campaign mission and was instantly kicked and banned due to having a 'modded game'. i have not altered anything, all i did was install and play it and now im locked out of two thirds of the game i paid for.\n\nit has been two weeks and support hasnt even bothered to reply yet.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "every time: joining server , loading , joining server , loading , joining server , loading\nI think I spent more time staring at loading screens than playing the game itself.\nThe game is genuinely good, but this annoying problem keeps ruining the whole experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Forced Anti-aliasing. your choice is either TAA, DLSS or FSR, all terrible options that blur the game. gotta love having tons of detail in your game only to blur it all into mush. the gaming industry needs to learn to stop doing this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the game but, I've never played anything so disrespectful of a persons time, not even close.\r\nThis is nothing to do with grind ect this is just straight out no appreciation for the absurd amount of time you play and get nothing or very little in return. \r\nI've also always thought the pvp sucked big time, it's nothing like it could/should of been. \r\nI'll 100% change this review if in further updates things get better but it's a hard pass from a returning player.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "PvP is completely unplayable as long as shock grenades continue to exist in its current form\r\nAn entire major game mode being unplayable because of a singular item is enough to sour my thoughts on this entire game, yes I am that petty",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Despite its expansive universe and lore, the game's actual gameplay experience falls short. The grim and dark elements are not present. The main campaign story lacks relevant development, missing meaningful dramatic plot points or impactful built-up developments, and the potential for a more expansive narrative in the co-op operations is underutilized (it just lazilly follows along the story of the main campaign). The basic content in the game requires an absurd amount of grinding, and the existing missions lack variety. For example, armor pieces require 20 to 30 completed operations to unlock (unique to every class!), while the available operations are only 9 or 10. Some weak developed systems place an excessive emphasis on providing grinding for the consumer/player, who essentially works on the same few missions with no variety in approach, possible paths to follow, or different enemies or outcomes to choose from. The situation of those scenarios is consistent and predictable. It's the same exact thing, every time. You will fight the 1 of 3 same types of enemies, every single time. Paid DLC allows consumers (and I emphasize consumers, it's a deliberate choice of words here) to accumulate in-game currency and unlock additional cosmetic options. These items are not immediately accessible upon purchase! \nThe above are my personal opinions and experiences, which represent my individual perspective only.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Controls are clunky and game play is linear. Keyboard mouse worse than controller. Expensive for console graphics, don't understand why PvE is \"online\". Clear franchise money grab, Atmosphere is pretty good but the game is literally button bash in a straight line, stuff dies, move on. \n\nReminds me of the game play loop of games by Warner brothers with much less freedom. Not for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nope!!!!!!!!!!!!!!!!!!!!!!!!! the story is okay at best its not great Id rather play SM1 again than this flop but the whole game is built around multiplayer, you can have bots playing with you, through there close to useless and I mean useless! the leveling up and getting better guns gear is only for multiplayer what the actual f??? they needed that in the actual campain not just multiplayer base.\n\nIts very unbalanced and clunky and feels like your wearing a glass suit that has many many cracks in it for armour and the enemy are bullet sponges of course, the majority of the time I was rolling an rolling then rolling its just not fun to play at all and the weopons have no punch to them the granades are lifeless.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "very literally just constantly crashes every 20 minutes without fail, even on a monster PC, just crashes OVER and OVER, after HOURS of optimizing settings to almost the lowest, doing pc maintenance, updating the drivers, verifying game files, disabling overlays, no background processes, and a solid internet connection.\r\n\r\nvery literally the game is most of the time unplayable, and progression is completely impossible as it crashes before any mission is finished, and therefore before any rewards are given.\r\n\r\nwhoever coded and optimized this, fire them and blacklist them from the industry permanently.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Loading screens take up between 3-7 min every match with an SSD drive. Worse than 2005 Console load times, unacceptable. Can't recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So far i haven't been able to launch the game, it's freezing on the start menu and crashing. My drivers are up to date. I'll change this review when i can play the game...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Loading screen simulator\n\nGot to play one match in the span of an hour because of excessive loading screens and lobby issues.\n\nOther than that it's a fun game but the load times are killing it for me.\n\nI want to say that almost a third of my hours in this game are spent just staring at a black screen while waiting for a loading screen that takes me to a character select screen which goes directly into another loading screen. This is assuming the match I'm loading into hasn't already been lost, which would take me into another loading screen. And God forbid the lobby host leaves, because that's another loading screen to take you back to the battle barge, which could honestly just be a menu.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game never worked even once for me. Only game I've ever owned that hasn't at least let me played a small fraction of. Crashes every single time. They refused my refund. DO NOT BUY! Even if the game doesn't play they won't make things right. Game and company that made it are both TRASH!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is buggy, I keep getting booted out of games because of \"mods detected\" even though i never had any mods or used them, no fix to it as well... dont but",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "TL;DR: game crashes, don't buy\n\n\nI was looking forward to playing this game, since I am a big Warhammer fan. However, this piece of shit game crashes from the very first cutscene. I have updated drivers, GEFORCE 3070 RTX, Intel i-9, 32 GB of RAM. I have never seen such broken and unoptimized game since the first release of Cyberpunk. I do not recommend this game, since you can't even play it without crashing. And the loading time for loading the main menu is too long. Even on sale, this game is not worth it, it will leave you frustrated by the endless amounts of crashes, whether its main campaign or online servers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Positve - Good graphics, voicing, storyline etc. \nNegative - If it was any more linear it would be a train on rails. I didn't expect open world but the restrictions on where you can go is ridiculous and you can't do anything but follow the programmed path.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you like space marines and riding elevators, this is your game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this has some areas that are wildly out of balance with the rest. feels like devs didnt do any balance passes or have no idea how to make a game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is great but the glitch that causes textures to not load still isn't fixed. I finished the campaign and everyone's faces looked like playdough along with almost every surface in the game. \r\n\r\nIt's unfortunate because  the game itself is actually really good but the low res textures really dampened the experience. \r\n\r\nI'll happily update the review if this finally gets patched.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs cannot balance Siege mode for the life of them, coming from someone who enjoys difficulty in games.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game consistently crashes during opening sequence of campaign. audio continues to play while video stops completely. despite multiple settings changes, nothing fixes the issue. do not purchase unless you have a state of the art tech in your PC",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good game, but the game is either way too easy or way too hard on higher difficulty. The spikes in difficulty on harder settings ruins the experience. I keep having to dial down to \"Normal\" for certain areas. Wish the game was play tested more. Needs balance.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The controller button layout sucks ass. Do not install if you hope to only use controller. Its a good game but its next to hopeless until they fix the controller mapping.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Saber has made a lot of boneheaded decisions for the worse lately. They are catering to the worst part of any multiplayer fanbase, the vocal minority that always scream about a game being too easy.\n\nGame used to be good but now it is just sad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Campaign is fine really. It's everything else that makes me think this game is made by Arrowhead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gamepad controls are the opposite of intuitive. Melee is an afterthought. I spent an hour trying to interact with this game using a gamepad, gave up, and went back to painting my minis.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game until the the latest update after a year of playing it now does not work with my controller at all",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am a huge 40k fan and was really looking forward to this game so much so I got the 2 year anniversary edititon as i love cosmetics. Sadly, it is un-optimised as many reviews have since mentioned and there is constant stuttering and issues. I crashed 3 times at the intro before I had even played. No matter what guide I follow to solve it, the cinematics are still lagging, the quality is reduced to the point i feel i am back in time with an age old game and the general experience of the game is thus ruined. Furthermore, the gameplay and mechanics are just not for me...and i play very similar games..i loved the first one but this is just not right.  Very disapointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The only upside of the game is that it is a very faithful and good looking/sounding adaptation of the 40k world, with good attention to detail. For any fans of the world I actually do recommend it, if the game happens to work on their computer.\r\n\r\nOtherwise I find the combat less fun than the previous game - I really don't enjoy the forced QTE-y parry/dodge mechanic, the performance/optimization is terrible, you will fps dips on any PC, but most importantly it's pretty buggy. \r\n\r\nAmong other bugs I ended up getting the crashing-on-every cutscene bug, conveniently far enough into the game that I am no longer eligible for refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thanks to patch 11, this game has become a single loading screen with a progress bar that never moves. Thanks saber!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When the game works, it's poetry in motion. Some of the best gameplay in this genre in years imo. However with patch 11, the game has become completely unplayable. For the most recent missions I have a success rate of 20% success. 60% of the time the game crashes near the end of the mission completely wasting my time. The other 20% of the time I get kicked for trying to get armoury data and gene seed while the other 2 people speed run the mission, and I get kicked. Absolutely abysmmal experience and from a company of this caliber it is completely unacceptable. Fix the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The art and animation is excellent.... and that's about it.\n\n-Levels are super linear, when there is a branching segment, it's usually a some ammo or a grenade, or an audio log\n\n-The progression system isn't interesting, the perks do things like \"25% damage when you switch to your pistol\", or \"your rifle does 10% more but your pistol does 10% less\"\n\n-There's low weapon variety, you have a bolt gun and a heavy bolt gun, the difference between them is a few bullets and a point in damage.\n\n-And most disappointing of all is the lack of enemy variety. It feels like you're only fighting two types of enemies, medium sized guys, and little swarm guys. You shoot and execute the medium sized guys, and use a melee attack when the little guys get too close. Occasionally a larger boss enemy will show up, but the strategy to fighting them is no different than fighting the small guys. Half way into the game, the little and medium enemies turn from aliens into humans, but the strategy and feeling of fighting them is exactly the same thing. There's some flying guys, but they show up so little, and they aren't hard to deal with, you forget they're even there. You go from hallway to hallway employing the exact same strategy every time. The weapons don't feel unique or different enough, you can just use whatever.\nIt's not a bad game per se, it's just mid.\n\nTL;DR\nToo repetitive",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Mods detected\" disconnects\nIf you have this issue after buying the game just refund. Not worth it.  \nOtherwise game is amazing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought every DLC, enjoyed the hell out of it, but now I cant load into any multiplayer game, get the N-14 error. Ive tired every listed option to fix this, reinstall, date and time, security settings, crossplay off, integrity of files. I can load into the battle barge but thats it. Yet they continue to push out major DLC updates, but won't fix a very large and very known bug. Dont waste your money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "salamander dlc broke my game. Says I have mods when Ive never downloaded mods.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let me begin with I love this game, I think its incredible and fun to just mindlessly grind away. But there is an issue where a player who has never had mods installed gets kicked because of an error stating \"mods detected.\" It makes it impossible to play and they aren't doing much of anything about it. Once this is fixed this game is a 10/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "GAME and graphic is superb but the constant crash if and dropping is game killer, dont recommend it until fixt,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun when it works but there are so many server issues and in this patch 11.0 there's a literal game breaking bug that doesn't even let me play with other people cause the game thinks I'm using mods even though I've never installed any. This mixed with constant server issues. Can't really recommend it at the moment",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game but breaks occasionally to the point that its unplayable. You will be kicked for having mods detected due to server side issues as of patch 11 but this has been a bug for awhile. Can not recommend a game with an unaddressed critical flaw like this unfortunately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Getting kicked from Online play because it says im playing Modded even tho i dont have any mods installed really annoying. coming back from 2 weeks of working to play some sm2 and it does not let me play because Saber is so bad at their jobs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game has an impossible moment where you have no chance to live when there are 3-5-10 red incoming attack and there's nothing you can do in the game to prevent this except uninstalling the game to save yourself from becoming stupid and try to comprehend why they would do this. Spacemarine 3 nah 4 nah, fix the 2nd one first bro.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Technically good but still boring. I don't really care for the lore and find it morbid and yucky.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So I gotta start this review by saying I really love the core game play loop. My main class the heavy class and I can't get enough of mowing down waves of enemies with a heavy bolter. The main story is really good and polished.\n\nNow for the worst part, the online modes simply do not work for me. Before anyone says its my internet, I am connected to an ethernet cable, I have a good internet connection, I can run a video on YouTube, be in a discord call with my buddies and be just fine playing any other  online multiplayer game all at the same time. Of the last 10 sessions I've tried to play this game online with the boys it has ended the exact same way without fail no matter what game mode it is. I'm able to load into the battle barge, load up into a mission, get about half way through the level, then get booted back to the F***ing title screen. This game is my go to horde shooter right now and the fact that I literally can no play it online with my fellow brothers is insufferable. I have scoured reddit, youtube, steam forums for a solution to the issue and have yet to find one that works. I can not recommend this game when the online portion does not work and has been a known issue for over a year at this point.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This was a fun game, with a lot of tight action and epic set pieces. WAS fun, that is, until the 11.0 patch. At that point, it decided that I was a cheater and kicked me from multiplayer with a \"Mods Detected\" message.  I am not modding, nor am I cheating in any way. In fact, I haven't cheated at a video game since the Game Genie back in 1990. ¯\\(ツ)/¯",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game runs like a piece of shit. Do better. Frame gen shouldnt be a strategy for a game like this. Optimize a the fucking game before shoveling shit to your fan base. \nI guess it helps to have a cult following of boomers cause you can give them a 3d screen saver of the microsoft pipe render and they will think thats the best fucking thing since farm agriculture. CAUSE THEY ARE THAT OLD.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "source material and production value is pretty good but the gameplay is horrible. like, mobile phone game level of quality.  melee is a sloppy mess and ranged attacks are boring because the enemies are super spongey.  campaign is laughably short and repetitive, look elsewhere if you're looking for any kind of interesting story or lengthy quest.  to level up (and possibly have a better chance in the higher difficulties) you have to grind relentlessly, and the game is definitely not fun enough to warrant that. we struggled through a mission on the 2nd to easiest difficulty and unanimously decided the effort isn't worth it.  world war z would be a good example of a game similar to this that is actually fun to play.  possibly worth it if it's on a deep sale ($10 or less) and you have at least one buddy that will suffer through it with you.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great concept, great game (was).\nRuined by mild devs.\nImagine making 11.0 available on pts, and then right before the launch making changes 😂",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game. \n\nHowever, I had a lot of problems with it crashing during intial boot ups.  Once I powered through that by just trying over and over, it seemed to stabilize.  Once in game though, it was not a smooth experience.  I experienced multiple instances of heavy slow downs and textures not loading.  Add on the fact that this requires kernel level anti-cheat, and this would be a hard pass for me next time.  Remove the anti-cheat, optimize the game and this is becomes an easy recommend.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'll start off by clarifying that as an introduction to the Warhammer 40k universe, this game does fine, although I wouldn't consider it the best way to get into the setting.\nAlthough I think Titus is a mildly interesting character, the story of this game is pretty bad. He's the only person in this game who experiences some kind of character development over the course of the story, and even then it's rather boring and shallow.\nI also felt like the portrayal of the antagonists made them far more boring than they could've otherwise been (however Tyranids are always boring, so I'm complaining more about how the Thousand Sons are more than the Tyranids).\n\nThe gameplay is pretty generic third person shooter stuff, although I don't really mind that. However, the multiplayer is awful. The maps feel like they aren't designed well with the gameplay in mind and drastically limit what each player could do in a way that reduces combat to \"my gun is better than yours\". and speaking of that, the balancing of the multiplayer modes is terrible, because the weapons you have as a beginner are far worse than the weapons people who've been grinding the game for hundreds of hours have to a degree where it makes matches less fun and really only incentivizes playing to grind with the hope that eventually your weaponry will be good enough to actually have fun.\nThe PvP is especially bad as it's basically just a rehash of Team Fortress 2 but with less thought put into it.\nFrankly, even though I don't like the story very much, the multiplayer was so boring that the singleplayer is the best part of the game imo.\n\nI get why you'd maybe really want this game if you want to roleplay your favorite chapter or something, but if you do get it I recommend getting it when it's on sale because it is definitely not worth full price",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}