{
  "positive": [
    {
      "review": "You can basically see the strings of spaghetti code this game is made with. But damn if it´s not one of the most fun coop games out there.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "despite hilarious game crashes and bugs, its still a fun and worth game to play, especially, stealth heist",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "just faught metro police whlie saving Goats from buring buildings and driving classical Doge Muscle cars. GOAT 10/10 would rocket launch again.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The game is truly fun, but if you can't choose between buying payday 2 or payday 3 then I suggest buying payday 2 though payday 3 has better textures and gun play movement I suggest payday 2 more for its diversity of weapons and heists, also the crazy amount of masks and customization options for them and mostly crashes less as well than its sequel so tbh just save yourself the money and buy payday 2 its more fun and has better heists in my opinion",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "To be entirely fair, I don’t even remember if there is a tutorial (I think there was), but learning all of the in depth mechanics is hell. Still recommending it because at least my laptop can run it, and it’s actually surprisingly calming getting to vaporize people with a microgun",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "PayDay 2 is an incredibly fun cooperative game that excels at delivering exciting heists and a strong sense of teamwork. It’s rare to find a game that so effectively captures the adrenaline rush of a bank robbery or a high-stakes job. The moment-to-moment gameplay is a blast, making it a title I consistently recommend to friends looking for a great co-op experience.\n\nOne of the best aspects is the variety of heists available. Whether my team and I are subtly cracking a safe in a jewelry store, going loud with a full-blown bank assault, or running a more unusual job like stealing a rare artifact, the missions always feel diverse and engaging. The game brilliantly balances planning and execution, allowing for both careful stealth and chaotic action, depending on the crew's approach.\n\nThe customization is top-notch. Building my character with specific skills, choosing from a massive arsenal of weapons, and even customizing my masks makes the progression feel personal and rewarding. There’s always a new build to try or a new weapon to master, which adds significantly to the replay value.\n\nMost importantly, the game thrives on communication and cooperation. Coordinating with teammates, shouting \"Medic!\" when things get tough, and successfully pulling off a difficult heist with friends creates some of the most memorable and satisfying moments I’ve had in gaming. It’s a game that genuinely gets better the more you play it with a consistent crew.\n\nFor anyone who enjoys co-op shooters and the allure of a well-executed caper, PayDay 2 is an absolute must-play. It’s a game that keeps on giving, offering hours of strategic, exciting, and immensely satisfying gameplay.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "its held together with shit piss and cum. but it is a peak game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "perfect gaem. Only ruined because the cashgrab game payday 3, disgustingly of a cashgrab. That's payday 3. payday 3 is worth only story wise. In coclusion payday 2 > payday 3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Even in the big 25 this game holds up only bad thing about this game is the fact that it has 35+ dlc's why is there so many dlc just put that into the base game dam it i am not paying 100+ dollars for ts",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] I \"like\" that the game itself is much smaller in content than its million DLCs. [/h1]\n\n     All I've achieved in this game is to shout loudly to civilians to lie still, and steal small things, robbing an ATM for fun along the way, playing at a difficulty no higher than the \"difficult\" level, because if the difficulty is higher, then the temperature of my processor in my head will gradually equalize with the temperature of the Star. Betelgeuse, and all this because of the crazy damage of the special forces, impenetrable shields, crazy tysers and fucking juggernauts!\n\n     I recommend this game if you have a lot of money and nerves.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best game ever. even better than gta 5 ngl and prob gta 6 ( if u have friends to play whit )\n\n100/10 amazing work overkill!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing, fun and funny, but i always end up being, 5 BULLETS LEFT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i've played this fucking game since 2015-2016 and i still love it. please dont stop updating this overkill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun with friends and randos\r\nHas its goofy moments\r\nLots of guns, heists and MONEY!\r\nlots of drills and medkits\r\nLots of mods and easily modable\r\n\r\n9/10 beans",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice to play in VR, cause chaos, and troll random teammates from the internet without even trying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game, but it needs **OPTIMIZATION**. holy 85GB, my potato pc cannot handle that, aside from that, it is REALLY fun. spoon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic. Good stealth game, or good assault game. Good variety, good replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chaos complete with theft, murder, and funny moments. I found this game through a video by the TheRussianBadger (if you know, you know) and man, I regret not finding this game faster :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, lots of fun, good features and great NPCs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's pretty old, yeah. But the experience you get for only 10 euro, on sale regularly. Is amazing. The attention to detail is cool too. The characters are likeable. The missions are fun. You can choose ways to do things your way. Go loud. Go quiet. Mismatch both. Have different builds for what you want. There's a lot to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Greatest game of all. This has to be the game with the best ending so far. This was very fun, but we gotta move on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 Game with lots of content in it, Good Graphics and just for 3$ is crazy!\r\n\r\nTrust me you will enjoy it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its been a game I have played for years. I love it and it would be a very definite blast to some new players",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game. Make money very quick by Cook Off, do the other heists for shits and giggles, and to grind achievements. 9.8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tried, but didn't like doing crime. Makes you shoot cops in the opening scene, I just couldn't do it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun, and we still get updates and new additions despite being 12 years old. i prefer this game over payday 3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a really fun game for people who want to feel overpowered but still challenged enough to make it enjoyable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very interesting heisting game that with mods can be an even bigger and greater experience, definently recommend for anyone who likes heisting/horde killer games, you atleast test it with a friend once before thinking anything about it :P",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game, the only problem is that almost everything is hidden behind a pay wall that is the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like this game and the sfx. also dallas is literally made of titanium because he can take five hundred twenty one bullets and still secure those dolla dollars. also the masks are cool, swear to god i want one irl. the only thing is that im lonely so i have to play with bots. nothing classic lol. overall great game and you should definitely put your hard earned savings into this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is fun and kinda grindy early game. good to play with friends and the stealth only jobs are annoying and hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "lots of content, however, most of the fun stuff is behind a ton of paid dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "break into buildings steal stuff kill all of the civilians 10/10 great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ive always been a simple man, give me a gun and a mask and i WILL rob a bank. Truly who wouldn't which is why i implore to you to gaze upon the ultimate simulation of what its like to live in san andreas complete even with its own subscription and money hungry vampires.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really liked this game a lot cuz its my fav game for 6 years and still playing this game😎",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun bank heist game i dislike some of the spawn mechanics but other than that its worth playing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got round house kicked by a cloaker. Called the N word by my teammate. Great game. Would definitely recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a pretty fun game and has good compatibility with mods.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game to play with your friends . Lately the devs did let payday community down and im upset about it . Here for steam nomination award.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is very fun to play alone, with randoms, or with friends. The many heists and weapons keep the game interesting and like there is something more specific to work towards.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best game to play with friends, always fun to come back to. (reviewing just for game awards lol)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun. Haven't played the original or the third one yet but this game really keeps you on your toes on higher difficulties!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Payday 2 is a really fun co-op heist game with tons of content and customization. The gameplay is exciting, but it might not be for everyone — still a solid experience if you enjoy tactical teamwork and planning your own chaos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Title: Still One of the Best Co-op Heist Games in 2025\r\n\r\nAfter all these years, Payday 2 is still unmatched when it comes to pure heist chaos and teamwork. The game is old, yes, but the content, the build variety, the mods, and the replayability keep it alive. Whether you’re stealthing a bank or going loud for hours, it stays fun.\r\n\r\nThe only downside is the matchmaking… you’ll always find that one teammate who throws the whole heist. But that’s also part of the Payday experience.\r\n\r\nIf you enjoy strategy, loud action, or just clown-level fun with friends, this game still hits.\r\n9/10 – Crime never gets outdated.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Do a stealth mission fail the stealth restart game repeat until you do without  failing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is peak and comically large spoon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very good, unfortunately my friend refused to buy it when it was on sale cuz he had a bad PC, and now i play only with randoms, i hope that when he read this, he rethink about buying the game, its quite pricey tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so I rob things for money but I barely get to spend the money that I robbed. This game is confusing,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pros:\nAll DLCs are usually under 7$ each (Most are under 4-5$)\nLots of maps in regular game without DLC's\nBlast with friends\nGood Gun system\nAmazing Modding system (Gun Mods)\nA bunch of achivements\n\nCons:\nThe hostage AI bugs sometimes and just stands there, which makes sense this is an old game\nKinda boring solo\n500 snipers and Captain Winters = instant death\n\n(Also it says I have to disclose how I got it free, my friend gifted it to me when it was on sale)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "seeing the differences between this game and payday 3 is actually pretty interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love playing a game from 2013 where its okay to run akimbo shotguns that shoot high explosive shells at the rate of a minigun at any person (armed or unarmed) and hitting them with a giant golden spoon to make sure theyre dead. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic game!! lots of fun with friends or with public",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There are so many very memorable parts to this game. If you haven't tried it its time,\r\nThis isn't peer pressure. It's just your turn.\r\n\"Alright Ramblers, lets get ramblin'.\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I do like this game. It has a variety of heists for different types of people. It can be really easy or really hard depending on you mood and you can never beat planning a heist with a friend in this game! Defo worth trying!\n\n10/10 Would need medic bag again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite multiplayer games i've played yet its comical how the devs have treated it over the years (looking at you update 240.3). But there is a lot of fun to be had in this game (especially if you have friends) and also has a high skill ceiling if you really want to squeeze the most out of this game. However, this game in its current state has a certain ick due to all the content locked behind paywalls and aren't even in the game anymore. That being said this game also has a lot of bugs that can be alleviated a bit with mods (please play this game with mods its like needed). Still heavily recommend trying it especially if its on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game makes you FEEL like you are playing in the soviet era as that was the last time the servers were updated",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is vary fun! even tho i just stared and its like call of duty but it is better it has a lot of hist to do some are vary hard some are ez it is a good game to play i think u will stay up all night playing it and if u are having a bad day i recmend to play this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "playing this game is like being in a 10+ year marriage, i hate it, consider leaving it for good, and ponder what my life would be like be like if i chose a different option. But in the end, i always come back and love it the way i did when we first met.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gud gaem.\n(but fr this is the best heisting game there is. If you like stealing shit and killing people then this game is for you)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its PAYDAY 2 ya know what this game is. You've seen it a million times already. Just buy it already get some buddies and have a blast. Its still fun in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is great but there is one problem i have, the White House mission is broken, i keep crashing before i can even play it. i dont know why. i dont think this game had any intense updates to the regular version, my pc is a gaming computer, and it can run high resolution games like gta or sons of the forest. so whatever is going on with payday 2 on the white house mission, my game cannot handle it. i cant even get passed the starting screen without completely crashing, yet i can handle EVERY OTHER mission just fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is awesome i have been playing this game since i was 9. everything about this game is amazing, the action,the updates,the songs,perfect and i think everybody deserve to have this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game. Cops and robbers, helmets fly, lots of guns. Pew pew!\n\n7.8/10 would heist again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spent 30 minutes sitting in a corner just for 1 achievement that didn't give me anything. Worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "こいつはとんでもない時間泥棒だ！\n\n低難易度でまったり遊ぶのもよし、知識と経験を積んで高難易度に挑むもよし。\nゲーム性や戦術やビルドの幅の広さから無限に遊べてしまういいゲームです。\nセール中は格安で遊べるので気軽にやってみよう。",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this on the PlayStation 4 before writing this, so I do have more hours than what it says. I do have fun in the game. I love the UI and how everything is set up. The masks are also pretty great. I think it does go for pretty cheap when it's on sale and that's when I picked it up, otherwise I can't really suggest a game at full price at all",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly probably the best Heist game you can buy, though the latest updates of them raising DLC prices and adding in a subscription is a bit lackluster but I see why hopefully the money makes payday3 worth buying",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i HATE when games release incomplete and have 500 million dlcs because of it. i am not spending my money on a game that comes in parts. using a dlc unlocker is always morally correct\n\nanyways the game is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, has a lot of stuff to do a varring ways to do them and for like 10 bucks its a steal",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Payday 2 is one of those games that never really gets old. It’s a mix of chaos, teamwork, and strategy that keeps you coming back for “just one more heist.” The thrill of pulling off a perfect stealth job feels amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed playing Payday 2 especially online or with friends, the missions were fun, the guns, masks and characters were all cool to use and play as and the maps were memorable. Playing stealth in this game while hard was honestly the most fun I had, going loud was fun too but it get's boring wiping out entire police forces over and over again and just feel's very unrealistic but I get it for gameplay reasons.\n\n8.4/10 very good game that still holds up today even thought it's age is more than showing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it fun. go stealth for boring and easy and extra exp. Go loud for big boom, noises and amazing music by simon viklund",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not played in 5 years so decided to reset my steam achievements and my entire account. This game is still just as fun as I remember it and it's downright shameful how bad PAYDAY3 is in respect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "In terms of gameplay, we'll likely never see this style of game executed in such a polished and complete package again. Many have tried to copy this game but they've never been able to recreate with success. This game will always be the GOAT🐵👍🏿",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn't play this until recently, and only really played with friends so I don't have a lot to say, but from what I have played is fun and games can get hectic with a lot going on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Payday 2 is by far superior to Payday 3. This masterpiece of a game is definitely inspired by Christopher Nolan's \"The Dark Knight\" and Michael Mann's \"Heat\".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only shooter game I play and keep coming back to.\n\nIt's Payday fellas!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "People like to say Payday 2 had a shaky launch (it did) so we should give Payday 3 the benefit of the doubt since it also had a shaky launch.\n\nDifference is, two years after Payday 2 released and got its shit together, it still had an average of around 20K players. People were happy. They make it a great game.\n\nTwo years after Payday 3 released, its got a 24 hours peak of 418 players. I mean just look at the positive reviews on it- some people who rate it positive even say that it's just 'okay'.\n\nPayday 2 had passion and care and people who really wanted to try and make a great game WITH the community.\nPayday 3 was the biggest heist they've ever designed. Either that, or they just decided that they weren't going to use what they learned in the first two years of Payday 2 and not listen to the playerbase.\n\nGG starbreeze. I'll always remember the hype of thinking Payday 3 would be Payday 2 with a bigger budget and a better engine and better animations.\n\nAnyways, just go wishlist Den of Wolves. Made by the devs who made Payday 2 great, and Simon Viklund soundtrack. It's the Payday 3 you wanted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The White House is bugged at the moment whereby when I'm trying to play with my friends, we got disconnected immediately at the pre-planning stage itself and even if we continuously trying to get into the game, we only able to get as far as right into the game and it would still disconnect us. Please fix the bug asap as we really want to play the Payday 2 secret.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun good game use to play this on xbox its like night and day better on pc kinda gets borning did all maps game is not hard at all i suggest using mods to make it harder or to improve the ai as its brain dead down side is the company is money hungry af milking an old game but hey most big corps are",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great heist game with shooting, stealth, and RPG mechanics. You can spend a ton of time playing this game with your friends, and I recommend it to everyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember playing this game back in high school wit h a big group of friends. I don't talk or hear much from them anymore but this game holds so many memories. I love this game, this game is perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is great although sometimes its laggy overall one of if not the best horde shooters ive played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "es un juego complejo y simple a la vez, si es para jugar solo no lo recomiendo en absoluto.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A Recension of Payday 2: The Symphony of Crime\n\nPayday 2 is not merely a cooperative first-person shooter — it is an intricate ballet of chaos, precision, and greed. Developed by Overkill Software, the game invites players into the slick leather gloves of professional criminals whose art lies in orchestrating the perfect heist. Whether it’s a discreet bank infiltration or a full-scale downtown shootout, Payday 2 transforms criminality into a thrilling performance of teamwork and timing.\n\nWhat makes the game truly magnetic is its mastery of tension. Every mission feels like a living, breathing puzzle. You can ghost silently through hallways, disabling cameras and tying up guards, or embrace the pandemonium of alarms, SWAT raids, and shattered glass. The game rewards creativity — no heist ever plays out the same way twice. With its robust progression system, countless masks, weapons, and skills to unlock, Payday 2 seduces players into endless experimentation.\n\nThe atmosphere drips with gritty charisma. The soundtrack, a pulse-pounding electronic storm by Simon Viklund, turns every firefight into a cinematic adrenaline rush. The visuals, though aged, still capture the neon-lit menace of modern crime. Most impressive of all is the cooperative dynamic: success demands communication, trust, and the subtle rhythm of coordinated chaos.\n\nYes, the game has flaws — occasional bugs, steep learning curves, and AI quirks — yet they fade behind the sheer exhilaration of pulling off the perfect score with friends. Payday 2 is a testament to organized anarchy, a digital rebellion that celebrates risk, strategy, and style. It remains, to this day, one of the most intoxicating multiplayer experiences ever crafted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9 out of 10 medic bags!\r\n\r\nThe gameplay may be a bit clunky at first if you come from games with very quick-paced action, but once you get used to it and the perk system and start getting better weapons for builds, it's smooth sailing. DLCs are also quite recommendable in general. BBQ is the best for any pyromaniacs there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have been playing this game since last year and i can say it´s one the best game i ever played even though it is old.\nFantastic game, graphics, enviroment, characters and story.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love the game but after new update if i use a cams my characters hand disappeared",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love being the silly aussie (Sydney) to annoy my frens :3.... except when the game crashes :D (no \"fixes\" others have given me worked for me at all)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Payday 2 Review — 9/10 (The Most Fun You Can Have With a Mask On)\n\nPayday 2 is pure, chaotic, adrenaline-pumping joy. It’s a game where you and three friends put on creepy clown masks, walk into a bank like you own the place, and then try to walk out with duffel bags full of cash before the police arrive with every helicopter in existence.\n\nEvery heist feels like a ridiculous action movie. One minute you’re sneaking around disabling cameras like a shadowy ninja, and the next you’re knee-deep in SWAT teams while someone screams “WHY IS THE DRILL JAMMED AGAIN?!” It’s absolute madness—and it’s amazing.\n\nThe build customization is wild, too. You can become a silent ghost with a silenced pistol, a doctor bag-carrying team medic, or a walking tank with a minigun who just refuses to die. No matter how you play, there’s always some new strategy to try or some new ridiculous weapon to experiment with.\n\nThe best part? No two heists feel the same. Something always goes wrong in the funniest way possible, and those disaster runs become legendary stories you talk about forever.\n\nSure, the UI can look confusing for new players, and some graphics are showing their age—but once the action starts, you won’t care. You’ll be too busy doing your best Michael Mann bank robbery impression.\n\nPros\n\nHeists that are nonstop fun and chaos\n\nTons of builds, weapons, skills, and gadgets\n\nAmazing co-op moments that make you scream, laugh, or panic\n\nHuge amount of content that keeps the game fresh\n\nCons\n\nLearning curve sharper than a throwing knife\n\nGraphics are a little old, but who’s looking at walls when there’s a heist going on?\n\nFinal Verdict:\nPayday 2 is a wildly fun co-op heist simulator that turns every mission into a story worth telling. Grab your mask, load your gun, and let’s get paid.\nScore: 9/10 — Crime has never been this fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its cool because spoon but every decision Starbreeze makes gives me permanent brain trauma.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun with friends and randoms likewise, unless they troll lol",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I owned it on Xbox. Now I own it here. Different platform, same victims. Time well wasted.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "wait for timer, shoot cops. unlock another timer and shoot more cops. 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun game but most of everything are locked behind dlc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Time flies.\nAn amazing game in which I have so many memories as far back as high school to as recently as 2025! \n\nAll about robbin banks and killin tanks, DGZ don't get zapped!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bro best game i love heavy loadouts i walk in with a whole minigun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice to play with friends.\nJust stay away from the monetization part of the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Plan, shoot and escape with style while your crew covers your back. Every heist is chaotic, tense and ridiculously fun. Even when things go wrong you can’t help but laugh and try again. It’s pure crime spree joy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It slaps. So much gear, so many builds, and pulling off a clean stealth heist with friends feels amazing.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Subscription system & raising prices, really - for this old game and the DLCs?!?! So this is your attempt to make some money after ruining Payday 3. How pathetic to treat your players/fans like this... F*** these devs!!",
      "voted_up": false,
      "votes_helpful": 147
    },
    {
      "review": "A gun I loved using back in the day all of a sudden became unusable unless I join the official community group on steam, or make a Starbreeze Nebula account. Unfollowing the steam group disables the gun again.\r\n\r\nIt is sad that many people are born into this world and think that these anti-consumer practices are normal. Taking away freedoms we used to have before, so that the developer can more easily collect our data or advertise to us. I have no trust in this game's developers.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Milking your fans never ends well, maybe should have put more effort into making payday 3 if you are so strapped for cash.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Monetizing a 12 year old game is new levels of cringe. Can’t recommend with the current business practices.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I love this game with all my heart. There’s no other game that gives me the feels like payday 2 but it comes to a point where I just can’t play because of its outdated engine,crashing,freezing and other game breaking stuff. Payday 3 is just not filling that void for payday 2.i hope for a better future for payday",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Half of the game is actually DLC, and they have the nerve to price it at 70£...(an 11 year old game's DLC...and on \"sale\"... in this economy...)\nThe gameplay is stretched out and most of the missions are the same/ they get boring quick, rewards are minimal, and the cops spawn like ants with guns\nI must have merked at least half the Earth's population in game by now...and they were all cops...who would've thought and what are the odds?\nBad design by nature, you guys should collab with Rockstar games, they also like microtransaction profits and don't care about making games better lmao",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's not what it was, at some point they sold the company and they became a GREED based company.\n\nBroken promises with WW2 game\nBroken promises with PD3\n\nBroken soul of a game.\n\nNow with monthly subscription.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game changes my windows mouse sensitivity, how and why. (my friend also have this exact problem so not just my machine)",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its fun but its also filled to the brim with issues, constant crashing, enemies that spawn with no thought for placement, and teammate AI that seem to have a concussion at best and are outright braindead at worst. The crashing itself seems to happen for the most stupid reasons, like someone joining the lobby will crash the game, someone dying will crash the game. The fact this hasn't been fixed in all this time makes no sense to me. There are also issues that relate to the game logic itself. You cannot pick the locks on doors, crouch or even sprint without wearing a mask. It is impossible to sneak without wearing a mask. Why? you also can't take your mask off once you've put it on. I hate this. Enemies also seem to spawn sometimes purely to force you into combat scenarios. I've noticed a plethora of instances where the game spawns enemies in front of me as i turn a corner, literally falling from the sky, practically guaranteeing you get caught Then you get into the guns. The majority of weapons are dlc, as are the attachments. An extended mag is dlc. Why are attachments dlc? Its a game i like that feels as if it tries its hardest to be hated. Its a 6.5/10 get it on sale. I have no idea why the game was as popular as it was",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "used to be fun but some things just dont age well\nand mods make it even worse because they're somehow more unstable than this spaghetti coded mess\nwish the best to new dev team tho",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lets see the writing on the wall and then double down on bad decisions, sticking ourselves in the past and never growing. It wont be long before this dev goes the way of the dodo bird and that saddens me. I wish they would have went for an open world mmo bank robbing game instead of add subscriptions to an old game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried three times to get the Pazuzu Mask on The Diamond job, but there's NO WAY to get it done under 10 minutes with how slow the Helicopter is and The Gas Chamber's unhelpful puzzle hints. Can you PLEASE have it be unlockable differently? It just won't work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "missed the boat on this, tried it in the past year for the first time and just am not sold",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrível. Péssimo. Tenebroso. Apenas é ultrapassado na sua miséria pelo seu sucessor.\n\nComprem o Payday : The Heist, primeiro da série. É melhor, mais barato e puxa menos pelo pc.\n\nAwful. Only overtaken its misery by its sucessor PD3.\n\nBuy PD:TH, cheaper, better, less punishing on PC specs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After years of not playing this game I was looking forward to dip into this world of crime once again. However, when trying to play with friends I was unable to join a lobby or even know how to find the lobby let alone where you can insert a lobby code. It's amazing how, in 2025, it's a headache to find a way to play this multiplayer game. After 30 to 40 minutes of trying and failing we decided to play something else.\r\n\r\nIn my recollection Payday 2 was a mighty fun game, but nowadays I won't even bother installing it again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "motion sickness.....this game makes me wanna throw up, which is lame because it looks fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Its become overwhelmingly clear this company will do whatever it takes to make money BESIDES make a game people wanna buy (once) and play, and if you do that they will take everything they can, fucking vampires. I get that money is more important than reputation, longevity, or quality, but that doesn't mean you deserve literally any of it. Making a game from 2013 is hilariously corporate \"why don't you bend over\" behavior from a team that regards its fanbase as brainless ants. Please dont ever waste our time with video games again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Atrocious gunplay and just awful game mechanics throughout, the first Payday is a much better game in every way.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absurd amount of DLC, golden years of this game was before the skins were added.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Studpid game, cop are like zombies, might as well play walking dead lol. Btw ai is so rtarded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, I used to have a lot of fun with friends playing this casually years ago. But after installing to play this for the first time in years to play some old school Payday together we simply couldn't get the lobby to work.\r\n\r\nAnd if it's this hard to just get a multiplayer game going I simply stop to bother playing this game. I can get that a lot of hardcore players that play this game day to day still get it to work and have a blast. But for casual play, this is just too much.\r\n\r\nThanks for the fun in the past, but for now, farewell. I'll boot up another game instead.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Runs like dog shit on modern hardware I keep getting random freezing. I have tried everything to verifying files, changing graphic settings, downloading mods, switching compatibility modes, running as admin, etc.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is a very bad game super slow and makes my headset crash a ton DO NOT BUY its a scam like big scam",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Used to be good. It's horribly unoptimized, most of the content is locked behind paywalls and subscriptions, and they couldn't even make payday 3 good.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "crashes randomly and the artificial difficulty of DSOD while fun is also so bullshit on some heists with insane spawn rates, locations, and sightlines with absurd objectives",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a boring game, even for 2013 standards. On top of that, it is over 80 gb. Unbelievable. I got it for free and still don't want to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Massively overrated and overhyped game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the monetary decisions of the companies involved with this game make me never want to play it again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A subscription???? So instead of making GOOD new games, you retroactively enshitify you older ones? What a trash company.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "steam are f u c k i n g scamming c u n t s  all dlcs are in the game just use mods to get them",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Subscription, lel no grow up and sit on it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Worst mistake was trusting on a company that shoot it self on the foot for more than 5 years.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Complete TRASH... Multiplayer wont work.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played hundreds of games in my life. I have never had sensitivity issues, feelings of nausea or headaches from games, but this game gives me those symptoms. \r\n\r\nThis game is actually miserable to play. Throwing a flashbang in another room will shake your camera, FOV is constantly shifting, enemies are constantly staggering you, flashing you, concussing you; throwing about your camera. Moving around feels like you're shaking a fizzy drink whilst opening it, it feels like you're constantly on ice and there are no settings that remedy this. (Yes I have tried increasing my fov, depth of field, head bobbing). Nothing works. Just goes to show how a company do not care whatsoever about customers. \r\n\r\nI've heard a lot of good things about payday 2 and honestly I'd love to try it since I've come from payday 3 and it really lacks content. But, this game is actually so poorly made that I cannot play it. Skill issue I guess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Subscriptions?.. for payday 2?.. Starbreeze... here's my answer: No.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Dead game. This is all you need to know about this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "wasn't for me, better with friends",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "thought it was gonna be better and i just dont know why",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bruh this game is so bad LMFAOO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "starbreeze bad dlc",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "no shit game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game too easy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I LOVE IT WHEN IM DEEP IN A VERY STEALTHY AND HIGH PAYING MISSON AND THE GAME JUST SO HAPPENS TO KICK ME OUT CAUSE THE DEVS ARE NOT THE SMARTEST TOOL IN THE SHED SO STOP CALLING THIS A DEAD GAME CAUSE MORE PEOPLE PLAY THIS THATN PAYDAY 3 CALL THAT A DEAD GAME AND ALSO U MIGHT ASWELL SHUTDOWN UR BUSINESS CAUSE YOU ARE ALL USELESS THANK YOU HORRID GAME",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "why the hell is there a subscription.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "забагованное дерьмо.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Çok kötü",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "succ",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Adding a subscription to try milk a 12 year old game and upping the price of the dlc bundle because you refuse to put any money or effort into the sequel is downright shameful. The illusion that this is saving you from purchasing $250 worth of dlc is a lie, it's been over a decade since most of this content was added and it's (quite thematically) daylight robbery that it still costs this much. According to steamDB, the price for the infamy collection has gone up by roughly 1.5x as of September (previously $175 aud, now $254 aud assuming no prior dlcs purchased)\n\nWill never be purchasing any product marred with the starbreeze logo on it again, you have burned every last shred of goodwill with your community",
      "voted_up": false,
      "votes_helpful": 2791
    },
    {
      "review": "Imagine making a fantastic game, managing to keep it alive for over a decade, have its quality still surpass its successor, and having a fantastic reputation, only to absolutely go scorched earth on both your game and rep because you wanted an extra bit of what is pocket change to a big money company like you, Starbreeze. Congratulations, you managed to kill your biggest cash cow because you wanted that extra bit on cha-ching. \r\n\r\nWe thought we were the heisters, but it was really Starbreeze who was stealing all the money. And what do we get? \"Oh, you can have every DLC in Payday 2! But only if you keep giving us money!\". And didn't I hear they jacked up the prices for DLC after launching this awful subscription where you'll pay money to not own anything? Disgusting.\r\n\r\nIt's a fun game and I love playing it, but after the greed of the company, I can't leave anything positive. Fix yourselves, Starbreeze, or your greed will cause you to suffocate",
      "voted_up": false,
      "votes_helpful": 119
    },
    {
      "review": "Subscription system & raising prices, really - for this old game and the DLCs?!?! So this is your attempt to make some money after ruining Payday 3. How pathetic to treat your players/fans like this... F*** these devs!!",
      "voted_up": false,
      "votes_helpful": 143
    },
    {
      "review": "Devs raised DLC bundle prices and then made a monthly subscription to own the DLCs, just get base game and wolfpack\n\nEdit: they reduced DLC bundle price back to original but honestly wolfpack is still all you need",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "upping the price of a 12 year old games DLC by 50 percent just to try justify a subscription for it is insane I used to like this game now I will never by a starbeeze product ever again",
      "voted_up": false,
      "votes_helpful": 66
    },
    {
      "review": "never touching starbreeze again after the spit in the face of them rising the price of DLC from a game from 2013. then giving you a subscription service to \"save you money\"\n\n\"bro we need the money\"\n\nShould've made Payday 3 better then.\n\n how do you fumble such a loyal fanbase so quickly?",
      "voted_up": false,
      "votes_helpful": 117
    },
    {
      "review": "2025 and they add a subscription service on top of the expensive DLCs LoL the gaming industry is a joke",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "Absolutely shameless for Starbreeze to add a subscription service for this game. They are trying to milk Payday 2 as much as Rockstar is with GTA 5. The fact they put less support into Payday 3 says enough for me to avoid these devs in the future. From making a game about robbery to robbing the players themselves. Despicable.",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "It's incredibly disheartening to see my most played game be the subject of blatantly predatory monetization tactics from Starbreeze, but it's not like it's the it's time (cough cough safes cough cough 75 dlcs). Launching a monthly subscription service for dlcs 12 years after the launch of a game SCREAMS not only desperation but also a complete lack any sense or respect for your customers. That combined with a quiet 50% price hike of the dlc bundle that includes everything trends towards malicious. It's incredibly sad to Starbreeze absolutely fumbling to the point where this was even considered. Please, do not pay for the subscription service, and avoid the game if this is not removed.\n\nEdit: They've since announced that price increase of the Infamous Bundle is going to be walked back, but that still doesn't change my opinion of the price hike + subscription service, nor the recommendation of this review. There's simply no way to justify a monthly subscription plan for a game like this. Again, please take your money elsewhere and don't support such practices.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "TL;DR - publishers sabotaged Payday 3 with cost cutting decisions during development. due to making a terrible return (from their own stupidity) on that game, they are now shamelessly milking this game for any potential sales (discount spam, DLC subscription thing). give this company money, and it's going to the void, not fixing the decade-old bugs in Payday 2, and probably not Payday 4 either. have a great day\n\nthematically and aesthetically, this game is great. locations were cool and well thought out, missions were generally interesting, and the characters and voice actors were amazing. there's a reason it had a cult following for so long.\n\nimo, gameplay is showing it's age and is still buggy at times, but the skill system is still cool and very customizable. i can see why some still enjoy playing. \n\nthe following is a deeper dive into why people are mad at this game, and why you probably shouldn't buy it at this point. \n\n\n\nso obviously, the DLC subscription thing sucks. not just because that monetization model already kinda blows, but because the dev's publishers are insanely greedy and want to maximize profits. bet you never heard that one before lol\n\nfor some background, OVERKILL was acquired by Starbreeze in April 2012. the massive funding influx allowed them to finish and drop The Heist, and also helped them big time with the later stages of development of the game that i'm writing this for. payday 2 was a massive hit on launch, and had tons of free and paid DLC consistently being released from Nov 2013-Aug 2017. payday 3 was announced in 2016, so it wasn't surprising when the DLC releases eventually slowed down in early 2018. PD2 was starting to dwindle in popularity, and the devs had a follow up to make.\n\nthe dumpster fire that ensued after this was depressing. in march 2021, after PD3 had been in development using their very own Valhalla engine for 4 years, Starbreeze made the official call to switch to Unreal 4. why? to save money and time, of course.\n\n anyone with the slightest tiddlywink of game dev knowledge knows how insanely challenging it is to be forced to switch engines mid-project, especially when the engine you're switching from WAS INTERNALLY BUILT OVER MANY YEARS WITH MILLIONS OF $$$ IN FUNDING AND CATERED SPECIFICALLY FOR THE TYPE OF GAME YOU ARE WORKING ON. \n\nbut \"idk software engineers are kinda expensive.\" -Starbreeze, probably\n\nyes, there are many benefits to working with a standard engine like unity or unreal, especially if you are inexperienced. but in this case, why would you trash the custom-tailored foundation that has been mastered by your employees to fire a few engineers and gain the ability to google a few basic things (things that they knew how to do on Valhalla anyways)??  had they started the game from scratch on UE4, maybe, MAYBE, this would have made sense and ended up working out. but that definitely did not happen lol\n\nso knowing this, it's sad but not exactly surprising that PD3 released in the state it was in. they had the terrible servers, crazy bugs, had to add missing gameplay features and controls, then fix THOSE bugs, then everyone was furious about no offline mode, etc etc. again, especially when considering the fact that the game had half as much development time in UE4 as Valhalla, Starbreeze essentially doomed their devs for a terrible launch and a persistent game of catch-up.\n\n\n\nnow lemme tie this back to why you should not buy PD2, despite it still being decent. since 2019 Starbreeze has released 50 DLCs (as listed on the payday wiki), and the 4 free ones of the 50 were not actual game content. for comparison, some of the most memorable heists in the franchise were released in the first 4 years of PD2's life as free DLC, just ask anyone that played. \n\nand even though this game is cheap right now, don't get suckered. what happened to Payday is a repeated pattern across many big studio/publishers (Ubisoft, EA, Nintendo, Tencent, Nexon, etc.); they have/get ownership of a studio/IP, then attempt to profit-max as if the logistics and finances of video game production and sales are the same as a tangible object, like a vehicle or computer. \n\nevery single time this cycle happens with a beloved franchise, the result is a loss for everyone; the company's profits dip, devs are then either fired or overworked, and THEN us consumers overpay for, at best, half baked games. remember, these companies need your money to keep operating. and i'm not your dad, but i strongly advise that you know where your money is going after you buy any video game. because to the publishers and dodgy studios, sales numbers are infinitely louder than any review, comment, or tweet. so, you have the power to help stop this shit without even doing anything.\n\n\n\nthanks for reading my boredom ramblings love u homie",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Nope, subscription added? how bout you just make the DLC cheaper or add it together in bundles.  Obvious scam is obvious.  Such a shame too this game used to be legendary",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Haven't ya milked the game enough, now adding subscription? \ninstead of making pd3 better, starbreeze the true heister.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "they seriously thought upping the price of decade old DLC and then charging a subscription for it was a good idea?\nStarbreeze is speedrunning their attempt to lose players. If they REALLY dont want us playing PD2, they should fix 3.",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "maybe if you actually put some effort into payday 3 you wouldn't need to beat payday 2's corpse.\n\nfuck you and your subscription. you have to BUY the game, and you dont even get all the DLCs?? why the FUCK would any new player pick that option?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Fun game unfortunately owned by a bunch of fraudulent hacks that don't seem willing to do right by their fans, always messing up and then blaming the fans for it and putting the burden on them.\n\nFor a quick recap of history, Overkill decided to make two games that flopped - a WW2 Payday 2 clone, and a TWD Payday 2 clone - and then they decided to milk this game adding bad, unoptimized DLC and guilt tripped the fans into financially bailing them out of having paid for the rights to a dead franchise - no pun intended.\n\nThen Payday 3 was simply a failure by all metrics and now the same is happening. Going back to Payday 2 and guilt tripping the fans into bailing them out of their string of horrible and hostile decisions that led to Payday 3 being an utter failure.\n\nAlso, the game itself runs awful and all a recent \"optimization\" update did for me is straight up make the game crash after loading every single heist. I don't know how you make a 2013 game run even worse than it already did. Overkill/Starbreeze is just a bunch of fraudulent hacks not worth anyone's money or attention and they rely on holding the rights to the Payday franchise hostage because they're too incompetent to even realize Payday 2 was just lightning in a bottle for them.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "do not buy games from this company, instead of trying to fix the game they hyped for so long, they increased the price of all dlc for a 10 year old game and added a subscription to get access to them, fuck this company.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Starbreeze has decided in their infinite wisdom that because they cant seem to figure out why Payday 3 was such a failure even with an entire Community telling them why it was terrible and what would make it better has decided to take out their frustrations on Payday 2 by adding a subscription service to it in an attempt to try to make a quick buck off of the people that would rather play a worthwhile game. Not to mention letting licenses lapse so people are missing out on the opportunity if they got into the game late. Poor business decisions on Payday 3 are coming back to bite Payday2 now lets hope they listen to the community for once and either make smart choices or just leave it alone.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Adding a subscription service to a game from 2013 that you no longer make updates for is a truly wild new take on corporate brainrot. \n\nStarbreeze, just make a bundle of the game and all DLC for $30 and then go back to fucking off.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "Adding a subscription to a 12 year old game because your newer game was absolute garbage is some new low.  Do not support this dev, your money will go much further elsewhere.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Yall are some of the most dumb pieces of shit imaginable. Since payday 3 didn't do that well yall decide to put a subscription on 12 year old game instead of properly working on it?????",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Payday 3 is dead, so they're adding a subscription to Payday 2. And to \"encourage\" players to get the subscription, they bumped the price of the Infamous Collection by $50. There's not new content in it, they didn't fix anything, they just want more money.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Subscription dont even cover all DLC's, whats the point? Apart from greed. Maybe y'all pseudo-devs would get a PAYDAY, if instead of begging for money in the decade year old game, y'all were competent enough and used your noodle to make things right.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "[h1]DO NOT SUPPORT STARBREEZE[/h1]\n\nThese guys no longer make money from PD3 so they crawl back to PD2, raise DLC price so they can promo a subscription for a 12 yo game!!\nBunch of scum, what's wrong Starbreeze? Milking your fan for years with ton of DLC wasn't enough!?",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I really hope the monthly subscription model is some kind of sick joke.\r\n\r\nDo not kill the last good game you have.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "They added subscription model for a 12 year old game because nobody is buying their tons of overpriced dlc\nWhat the actual fuck",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Benefits of pirating this game:\n+Scarface character pack\n+No need to pay for h3h3 characyer pack so ethan doesn't benefit\n+You can enjoy every heist without starbreeze milking this cow just to use another\nCons:\n-Starbreeze dicksuckers shun you (Not really a con but an inconvenience)\nI love this games skills and perk decks but I can't enjoy if it gets raped and used like starbreeze is some toxic ex.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "new content or bug fixes? nah not important. who wants a better game? pffft. \n\nwhat we really needed was a subscription based model in this decade old abandoned game. \n\ngreed ruins everything.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "A gun I loved using back in the day all of a sudden became unusable unless I join the official community group on steam, or make a Starbreeze Nebula account. Unfollowing the steam group disables the gun again.\r\n\r\nIt is sad that many people are born into this world and think that these anti-consumer practices are normal. Taking away freedoms we used to have before, so that the developer can more easily collect our data or advertise to us. I have no trust in this game's developers.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "A good game but Starbreeze pretty much is nuking this franchise from orbit with every dumb goddamn decision that comes out of that rats nest. \n\nIf this is actually going to be the future of Payday, then I expect this franchise to die a slow and painful death.\n\nDO NOT BUY THE SUBSCRIPTION. DO NOT WASTE MONEY ON THE INFAMOUS BUNDLE.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "PAYDAY deserves better than Starbreeze. I say this as a heavily disgruntled fan. I guess I know who to send a game franchise to if I want to watch it crash and burn (other than Microsoft).",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "you cant just bump up the full collection by 45% without adding any content because you want your subscription for a 10+ year old game to look more appealing",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "StarBreeze going down the Ubisoft path: subscription for a 12 y/o game. Screw you SBZ. You betrayed us twice. Fuck, this was one of my favourite games! \nSTAY AWAY FROM THIS SCAM!",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Wish Steam, or the games industry, had a refund system in place for when greedy corporations, or publishers enact a fundamental change to a game years after you purchased it.\n\nHow is this legal? Why would anyone defend this? Over a decade after release, and Starbreeze decides to add a subscription to their game? This doesn't benefit your experience as a player, this doesn't show you're a valued customer--you're a financier. This is a product disguised as a game.\n\nNo thanks. Stand up for yourself, don't allow corporations to turn a game you paid for into a monetization machine. This isn't normal. If a business pitched a subscription model to you years after your purchase, you'd think it was a scam or you'd be upset. Nothing different here.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A sneaky subscription on a 12 years old game Payday 2? \nAttempt on pushing us into buying a live-service disaster game Payday 3? \n\nNice try, devs and CEO. Anyway, welcome to the next phase of \"finding out\".",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game was truly awesome. Its legacy has been ruined so that a dying company can stave off bankruptcy for a little while longer.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "A subscription service after 12 years? For a game that didn't need it? After fumbling payday 3? I don't care how much money your shareholders have, take whichever ones made this decision and shoot them. This is how a game is killed.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This studio managed to hit rock bottom with payday 3, and we thought they couldn't go any lower. Unfortunately for us, the devs got access to a drillevator to dig deeper in their infinite greed. So on a related note, go play Deep Rock Galactic instead of this studio's slop, at least there the only greed you have to deal with is your own. ROCK AND STONE!",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "welp folks, pack up and leave, payday is gone, just go follow whatever Simon Viklund is doing, not these wankers",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "They fucked up Payday 3 and now are adding a subscription system to a 12 years old game, Overkill/ Starbreeze you both are pathetic devs.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "love the game but the dlc subscription is just a fucking joke, greedy corporation milking a 12 year old game for what? because the games after this one flopped",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "how about instead of adding a subscription to a 12 year old game, claiming \"we need the money\", you make a good fucking game so you don't find yourself in this situation. fuck off. stop focusing on monetization, that's how you make something far from fun that appeals to no one. it's been proven time and time again that video game that focus on making a product that is consumer friendly, fun, has passion, appeals to a lot of people and makes more than enough profit, then look at every game these days trying to min-max monetization, trying to find every possible way to nickle and dime players... all soulless products with no appeal, no player retention. starbreeze never learns huh.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Payday 3 flopping so much that we raise DLC prices by 1.5x on a 12 year old game, then we decide to add a subscription for all the DLC.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Pay Day is not a game about robbing a Bank......\r\nIts a game that Rob You..... You are THE BANK.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Increase the cost of the DLCs and put a subscription for them in a really, really old game that was already pay to win was a lame move. Can't give thumbs up for that. \nThe game is like 12 years and still full of bugs, it just crashes for nothing in the middle of the heists, fail joining the game and what they do? try to fix it? No. Let's profit a bit more on them. \nI still enjoy the game, but i'm not buying anything else on payday 2. I Hope payday 3 keep failing, they don't deserve any better.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "What you promised us, did not deliver in Payday 3. To punish players with a subscription to your older game is downright criminal. No company should be trying to nickle and dime their customers. Video game companies are getting out of hand. Don't support this game until changes are actually made.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Adding a subscription to try milk a 12 year old game and upping the price of the dlc bundle because you refuse to put any money or effort into the sequel is downright shameful. The illusion that this is saving you from purchasing $250 worth of dlc is a lie, it's been over a decade since most of this content was added and it's (quite thematically) daylight robbery that it still costs this much. According to steamDB, the price for the infamy collection has gone up by roughly 1.5x as of September (previously $175 aud, now $254 aud assuming no prior dlcs purchased)\n\nWill never be purchasing any product marred with the starbreeze logo on it again, you have burned every last shred of goodwill with your community",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "switched from steam online services to epic online services. updates now require a complete reinstall, subscription service for dlc while shadow doubling dlc price. overall scummy devs, keep away",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Good game, but driving up the price of the DLC bundle and then adding a subscription for a 12 year old game is just bizarre. It's not even like this game is even being updated anymore.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "They just created a problem and are trying to sell you the solution... on a 12 year old game... instead of making the new one worth thinking about....",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game already had a tumultuous history of shady issues in the past. Now the dev's, being desperate for more money  after the failure of Payday 3 likely near bankrupting them, have decided to add a subscription system to this 12 year old game. That of course is after raising the price on basically all their dlcs.\n\n£3.99 a month? This game regularly went on sale for less than that, for the whole game.\n\nWhat a joke. Don't buy this crap.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Love the game and I love the fact that I'm watching a 27 million dollar company collapse in real time.\n\nWelcome to Hell, Starbreeze",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "You people are what's wrong with the gaming industry, go back to serving us fries.\n\nSeriously, a subscription for a 12 year old game?? Go bankrupt.",
      "voted_up": false,
      "votes_helpful": 11
    }
  ]
}