{
  "positive": [
    {
      "review": "ABELARD! Tell everyone how incredible this game is, then announce my presence to these heathens before I burn their entire planet.",
      "voted_up": true,
      "votes_helpful": 89
    },
    {
      "review": "The best CRPG in video game history... \n\nAnd over the past 40 years, I've played other ones, one by one.\n\nNone of them come close to Roque Trader's RPG atmosphere...",
      "voted_up": true,
      "votes_helpful": 49
    },
    {
      "review": "Overwhelming at first (first run abandoned after roughly 20 hours) it gets easier to digest if you manage to resist the first 20 to 30 hours, due to an absolute ridiculous number of skills to choose from at characters level (and all characters level up at the same time...and they are many, towards the end of the game).\nHowever, if you are into these sort of games (i.e. isometric turn based RPGs) and like the 40K setting, this is a must play. There is also a lot to read...and I mean A LOT.\nIt is clear that the developers put a lot of effort and love into this game. The writing is excellent and if you are familiar with the setting, it is a joy to read. There are some bugs, but nothing game breaking. A couple of side quest did bug out, but I could live with it.\nSuggestion: Do not store anything in the captain’s safe...trust me.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Really good CRPG, it has some flaws, like performance for how it looks it runs worse than some better looking games or the duration (for some people a 150h run trying to do everything might be too much), or the space battles feel like they drag for far too long.\n\nBut the story is really good, and there are lots of choices, if you dont mind playing a long game and you prefer them that is also a really good point for it, it has a lot of side content, although most of it is really short quests than end in a combat encounter or a few rooms of exploration in a planet while exploring the expanse.\n\nOverall it's a pretty solid CRPG, and i'd say it can be pretty begginner friendly compared to other crpgs, there is also pretty decent builds that are easy to pick up, and the devs keep improving and patching the game. It gets discounted on big sales, worth picking up then, or even without a sale if you are a fan of both warhammer and the genre.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I never thought I'd be writing a review for a Warhammer 40k CRPG. But here I am. Owlcat has managed to not only create a Warhammer 40k CRPG but to do it most excellently. It's neck and neck with a coupla other CRPGs but Rogue Trader is my favorite game in recent memory, particularly after a full season of DLC and the big 1.5 patch. \r\n\r\nRogue Trader is a lengthy, meaty RPG, offering plenty of depth in the combat, character builds and reactive decisions on offer. Main characters aren't measured by simple good and evil but by dogmatic, iconoclast and heretic, with higher levels in one limiting the other two to lower levels. The characters are excellent, good and evil, and excellently voice acted. Environments are dark and creepy. Pawel Perepelica's soundtrack thrums and synths in all the most grimdark of ways. Rogue Trader is not a game that you pick up and throw away but a healthy feast that keeps you playing well after the credits have rolled. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "This game is unfair to every other dev and publisher team out there. Clearly, videogames can be this fucking good, so what gives? \r\n\r\nThe amount of text can be very offputting for some, but you can usually skim through text to get the general gist of things if you have a hard time focusing on reading so much. Everything in this game is worth everything you need to go through. Good combat, good skill building opportunities, good story, good characters and definitely a very good amount of content. I was repeatedly surprised by just how much there is\r\n\r\nThank you Sister Argenta, you carried my run time and time again",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Owlcat Games does WH40K justice. A fantastic RPG game set in the current times using well adapted mechanics. \r\n\r\nFun.\r\nDeep.\r\nExpansive.\r\nReplayable.\r\n\r\nThat's what Rogue Trader is. The engine used in the Pathfinder games, but better. Good skill sets that have great range and utility combined with a massive amount of synergy between the classes and loadouts. But not all it perfect because the camera angles need work in the tactical combat and land exploration parts of the games. But that's probably a mostly \"me\" problem.\r\n\r\nThis game is so good, that I don't even recommend buying it on sale, because I feel like the devs/studio deserve our cash.\r\n\r\nYea, I really like it!",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "Some of the best Warhammer 40K available, and the game play is alright too.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "120 hours in and I've barely scratched the surface of this game, find myself reading every bit of text and exploring every nook and cranny. Genuinely one of the best games I've ever played and I've never been a fan of this genre, but I am hooked. Incredible story telling, combat is so satisfying once you've got a few builds.. (Argenta heavy bolter.. come on.) Already planning my next playthroughs and I'm not even half way done. 10/10",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Warhammer 40K: Rogue Trader — A Masterclass in Grimdark Roleplay\n\nWarhammer 40K: Rogue Trader is one of the finest CRPGs I’ve ever played. Owlcat didn’t just adapt the 40K universe — they brought it to life with a level of depth, consequence, and atmosphere that feels both authentic and monumental.\n\nThis game nails the essence of the 41st millennium: the weight of command, the razor-edge of faith and heresy, the thrill of discovery, and the crushing scale of the Imperium. Every decision hits hard. Every moment feels earned.\n\nCharacters & Companion Arcs\n\nThe companions are the heart of this game, and Owlcat outdid themselves. Each character has their own moral compass, emotional depth, and personal journey that feels entwined with your dynasty’s fate.\n\nUlfar is absolutely best bro — loyal, steadfast, honorable, and a grounding presence in a universe gone mad. Every scene with him feels authentic and earned. A true warrior-poet of Fenris.\n\nKibella? Best girl, without question. Her presence radiates intensity, mystery, and power, and her story is one of the most compelling emotional arcs Owlcat has ever written.\n\nKibella’s Romance Arc\n\nWithout spoiling a thing:\nHer romance path is phenomenal.\nIt’s layered, surprising, heartfelt, and beautifully paced. It respects her character — fierce, proud, and deeply complex — and creates a connection that feels meaningful rather than forced. One of the most satisfying romance arcs in modern CRPGs.\n\nAtmosphere & World-Building\n\nThe worlds you visit feel alive, dangerous, and sacred. Whether you're walking through cathedral-like voidship corridors or stepping onto hellish frontiers, the game captures the aesthetic and soul of 40K perfectly. The music and voice acting elevate every encounter.\n\nGameplay & Systems\n\nDeep, crunchy mechanics? Check.\nTactical, satisfying turn-based combat? Absolutely.\nDynasty management, voidship battles, colony building, and moral decisions that echo across entire sectors? This game has it all.\n\nLooking Toward the Future\n\nPatch 1.5 shows just how committed the devs are, and the future DLC roadmap looks incredible.\nAnd when Owlcat eventually steps into Dark Heresy?\nIf it carries even a fraction of Rogue Trader’s narrative brilliance, it’s going to be legendary.\n\nFinal Verdict:\n\n10/10 — An unforgettable CRPG epic, filled with heart, darkness, triumph, and some of the best character writing in modern gaming.\nUlfar is best bro. Kibella is best girl. And I cannot wait for more.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Who designed the skills/talents in this game?? Each time one of your 6 characters gains a level, you have to choose from over 100 different new talents (per char). The worst part about constantly selecting from hundreds of talents is that none of them are good. None of them are cool new spells or abilities, they are all very minor buffs (e.g. If your character casts a spell on another character that hasn't damaged an enemy this turn, then that character gains 3 hit points). \nThere are very few fun or useful new abilities, you end up just using the same shoot or melee swing every turn and occasionally casting a minor buff or debuff.\nI'm still giving this a thumbs up because there was clearly a lot of work put into the game and an expansive world full of lore. But the skills in this game are extremely tedious, boring, and useless.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "АБЕЛЯР! Расскажи всем, какая это невероятная игра, а затем объяви о моём присутствии этим варварам, прежде чем я сожгу всю их планету.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I absolutely love the game\n\nI absolutely hate the bugs\n\nSingleplayer:\n\n- Equipment tends to unequip/re-equip itself between missions;\n- Solomorne loses all his equipment randomly. One of the causes - calling him to the bath.\n\nMultiplayer:\n\n- Desyncs;\n- Lost connection to server.\n\nAlso inventory management in coop could be less annoying.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "overall 40k-vibe is great, CRPG mechanics are pretty much the same from Kingmaker - clunky but enjoyable, companions are not all fleshed out, but overall  distinct and interesting. If you know Owlcats or enjoy CRPGs this game worth your time and money",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is for true 40k fans only. It is awesome. Be prepared to read a ton of dialogue and to research the best choices for your colonies and builds for your Rogue Trader and allies. (Sanctic Psyker build is the best). If you're the kind of person that likes to skip cut scenes and dialogue then you're a heretic who is forbidden from playing His holy CRPG.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of THE BEST Warhammer 40k games there is. Incredible Immersion, Story and Gameplay. Easy Recommend for WH40k fans that like top-down, turn-based RPGs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an amazing game. The best thing is the story, and the combat is fun as well, but it has a problem: leveling up is a pain in the ass. It feels like a chore, with too many skills and abilities that mostly just overcomplicate things and don't add much. But even with this issue, the game's strong points make it a must-play",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "With Rogue Trader Owlcat Games has cemented it's place at the top of the CRPG market. Excellent writing, deep and engaging characters, atmosphere that sucks you into every single level as well as outstanding voice acting and soundtrack. To top it all off, every Owlcat release learns and builds on top of its predecessor. \n\nAs with their Pathfinder games, Rogue Trader transcends the license it is built on - forming an engaging and attractive narrative that works even if you are not familiar with the Warhammer 40k franchise. \n\nAt the time of writing the only way for Owlcat seems to be up - though a part of me also has to live with the concern that maybe one day I will be looking back on these glory days with a tear in my eye like I do with Bioware and Obsidian.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Singlehandedly got me into the Warhammer universe.\n\nDefinitely the most polished out of the three Owlcat games - it's amazing how far they've come since Kingmaker, finally worthy of the brilliant writing in all of them.\nYou should definitely give it a try if you're either a fan of DnD-like games or of WH40k in general, simple as that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's an Owlcat game, that ought to say it all.\n\nIt has been a bug ridden mess for months, and it's still not clean.\nIt's a min maxer paradise (hell for most people), every time you must level up a whole team and choose between hundreds of skills.\n\nBut it's an Owlcat game !\nSo it's also an incredible CRPG and a much needed representation of how the 40K universe works outside of the unending war thing.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Heavy bolter go brrrrrrrr.\r\n\r\nBest 40k game on the market and it keeps getting better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The story has been pretty great so far. Recruitable characters have a lot of variety between them, so there is something for everyone. I have only ever played this game in co-op mode. Therefore, a few words about that. This game's co-op is well done other than the fact that there are quite a few single-player only areas. Most of them are story-related though and don't take a lot of time to complete. Something else to note is that the owner of the lobby decides all of the dialogue. Other players can, however, vote on the dialogue option that they find most fitting for the situation. Personally, me and my friend also experienced a notable amount of de-synch early on, but it got less frequent on each patch. Sadly, this game isn't fully voice acted, which takes away from otherwise memorable moments a bit, but it is definitely bearable. Overall, I would recommend this game to anyone that enjoys turn-based rpgs and/or Warhammer 40k in general and has the patience and time to complete a game with a longer story.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game if you're into these kinda games!\r\n\r\nA loooooooot of content, fun gameplay and great writing.\r\nA lot of decision making, and they actually matter and affect the story in meaningfull ways.\r\n\r\nI don't think you have to know a lot about warhammer to enjoy this one, though knowing a bit about it will help you for sure.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An incredibly cool game!\r\n\r\nIf you're a Warhammer fan, you shouldn't even have to wonder whether to play it.\r\n\r\nFor everyone else, it might be a good entry point into the universe.\r\n\r\nIt's important to understand that this is an old-school RPG. It requires a lot of reading and wading through hundreds of perks, talents, and so on.\r\n\r\nUnfortunately, it's also full of bugs, so installing the ToyBoh mod is a must.\r\n\r\nIt's useful for completing broken quests in console mode and winning those boring generic battles that just waste time and offer no fun.\r\n\r\nAnd three killer features: the ability to have multiple romances simultaneously, adding navigator points (believe me, this is a garbage, annoying mechanic and is best avoided with a mod), and most importantly! The ability to see companions' dialogue, even if they're not in your party but on the ship. This greatly expands your horizons in a single playthrough.\r\n\r\nI'm looking forward to the next OwlCat game and hope they clean up the perk and talent system a bit from unnecessary junk.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great crpg set in the 40k universe with awesome companions and cool quests.  If you like rpgs or the 40k universe i think you will have a blast with this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honestly never understood 40k Warhammer lore until I played this. I'm definitely going to buy dark heresy when it comes out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "---[Graphics]---\n☐ I want to forget this ever existed\n☐ Made in Paint, but with passion\n☐ Decent, even kind of nice to look at\n☒ You can tell someone had both vision and a budget\n☐ As if an angel gently touched my eyes with a bare foot\n\n---[Audio]---\n☐ Scraping a knife on a plate would make more sense than this\n☐ Sounds like someone’s drumming on pots - but on beat\n☐ Doesn’t hurt, but not memorable either\n☒ Solid work, just missing that wow\n☐ A soundtrack I’d actually listen to outside the game\n\n---[Atmosphere]---\n☐ None whatsoever, felt like working in Excel\n☐ Existential sadness in digital form\n☐ The vibe was so strong even my cat came to watch\n☐ So thick you could cut it with a knife\n☒ So good I forgot what grass feels like\n\n---[Gameplay]---\n☐ At least it works… sometimes\n☐ Not a game - more like a test of patience and reflexes\n☐ Works great - when it works; otherwise, restart\n☒ Simple but satisfying\n☐ Smooth as butter melting in a pan\n\n---[Story]---\n☐ There just isn’t one - what did you expect?\n☐ Plot as deep as a puddle after rain\n☐ There is a story, but do I get it? No idea\n☐ A tale I’ll remember in dreams and memes\n☒ It changed my life\n\n---[Longevity]---\n☐ One-time adventure, like a bag of chips\n☐ You can replay it... if you’re aiming for 100% completion\n☒ Replayable, but never hits like the first time\n☐ Mods breathe new life into the game - too bad not into me\n☐ The game lives its own life, and I’m jealous\n\n---[Repetition]---\n☐ Now I know how NPCs feel\n☐ Feels like a job, but with better music\n☐ Perfect background for podcasts\n☒ Repetitive, but in that “one more time!” kind of way\n☐ Nothing repeats - not even my mistakes\n\n---[Bugs]---\n☐ The game tried to fall apart, but sheer willpower kept it together\n☐ Bugs? Yes, but at least they’re consistent\n☐ Sometimes it breaks, sometimes it works - like my life\n☒ A few bugs here and there, but none killed the fun\n☐ Runs like a dream - even without a Day One patch\n\n---[Adult Content]---\n☐ None at all, even NPCs don’t flirt\n☐ A few suggestive lines, but nothing grandma couldn’t handle\n☒ Rated 18+, but more Netflix than hub\n☐ Best played with headphones - and maybe with the door locked\n☐ Full-on anatomy education\n\n---[Price]---\n☐ Sold a kidney for this\n☐ A bit pricey, but at least it looks good in the library\n☐ Fair price for the amount of content\n☒ Cheaper than lunch\n☐ Straight-up free\n\n---[Summary]---\n8,5/10\n\n---[Personal impressions]---\nTo sum it up — for me this game deserves an 8.5, which is why I’m raising the average score. At first, I didn’t think it would pull me in so much, and that I would literally wake up wondering what new things would await me. Constantly reading in English was quite tiring for me, since it’s not my native language and I prefer to read in my own, but I still didn’t have any major problems. I really miss full voice acting, even though there is at least partial dubbing. The ending of the game, and the way all the decisions you make throughout the whole playthrough have their impact at the end, actually brought me to tears. To conclude, I’ll just say: a very good game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is almost unplayable without the knowledge of the WH40K lore, which made me to research it. Now i have 100+ new books and understand EVERYTHING! So, good game, love it. Great for thous, who love tabletop RPGs as any other game developed by Owlcat so far.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As a recent convert to CRPG (after avoiding them like the plague for years and now trying to gobble them all up as quickly as possible), I was intrigued by what I had heard about Rogue Trader. First, let me say that you don't need to know basically anything about the 40K universe before jumping into this game and I actually think this is a phenomenal introduction to the world. The DLC is integrated wonderfully into the main story and doesn't feel like some bolted on side content. The game is loaded with decisions and choices that allow you to really roleplay and build your team however you want. There are actual consequences to those choices and you can't please everyone. I have enjoyed a number of other CRPGs but the combat here is fantastic. Seems to draw a lot of inspiration from tactical games like XCom. The weapons and classes feel varied and there is so much to explore and do. Be warned, you will be doing a lot of reading. The game can feel like a novel at times but tends to intercut that with tactical gameplay which helps to even that out. \n\nOnly mild con is that the game isn't fully voice acted. I would honestly buy a DLC that offered full voice lines for all the characters as the voiceovers that are there are fantastic and add a lot to the immersion. \n\n10/10 would recommend (please add voicelines as paid DLC, I know it's expensive to voice a game) and can't wait for Dark Heresy",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Just finished the game - 423 hours on record, as I had to visit every system and do almost all of the side quests.\n\nLove, love, love this game.  Great stories and quests, great characters and dialog, and fantastic combat system.\nYou even get to do light colony management and ship battles!  \n\nI found the characters much more enjoyable than the ones in Balder's Gate 3, and I love all things 40K so it helps to like the setting.   The lore and stories were all spot-on, so if you like 40k, you'll love this game.\n\nBTW, I'm not a huge fan of vanilla fantasy settings, but maybe I'm just bored from them.  (I'm 65).\n\n40K is like one dark comedy throughout as it's so grim it's hilarious.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game with great developer support. 40k Baldurs gate.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "For someone who doesn't get to have a huge amount of game time these days...because...well life gets in the way...I have thoroughly enjoyed the >250hrs I have put into playing this epic game. Most of the owlcat games that I have played have been very good, and with this one they took the Games Workshop WH40K name and gave it an amazing game that it deserves. This is quite simply the perfect game for me...good characters, great story, challenging gameplay and enough repeatability for me to have come back and played the whole thing through more than once [a very rare thing for me with having such short amount of free gaming time]. \r\n\r\nRather than read the ramblings of a >45yr old gamer....treat yourself and simply play the game and enjoy it. \r\n\r\nWhat's more, because they haven't finished the games DLC rollout [DLC with actual extensions to the game, and not just skins]...I know that there will be a further full playthrough again in the future...and that makes me happy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "One the best games ive played in awhile, it takes a little bit to get to the actual game but once you do you will have to make yourself stop playing to get some sleep. So much to do in this one and very good mechanics.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This right here is one of the best W40K games I had the pleasure to play (and I probably sank way more hours into it, then I should have). Not only are its mechanics relatively intuitive, but the gameplay and lore surrounding it is exceptionally well made. It even got me into the world of tabletop Warhammer RPG. It is made with care and attention to detail (regarding such an enormous game in scope; some bugs occur from time to time, but where don't?). I usually dislike turn-based combat in videogames, yet this game resparked the interest in 40K lore again. The power fantasy is also well handled (even though if it sometimes becomes not true to lore), and the story and voice acting are superb. Owlcat have good experiences with CRPGs, and I can't wait to put more hours into this game, but also into their upcomming title Dark Heresy. Keep up the great work and remember: The Emperor (and Abelard) protects!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "a genuine 40k game, characters don't all feel lame like they're one-dimensional autistic gay theater kids like in bg3, story and writing is solid and faithful to 40k, gameplay is great, and the music is fantastic. Only space combat feels a little annoying.\n\nu better be able to speed read or you're cooked, because this game be opening a literal book in your face for some encounters and like 5% of it is actually VA'd\n\n11/10 would xenocide eldar and turn their sacred homeworld into a prosperous breadbasket for humanity every playthrough again",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pretty good game if you're into Warhammer and it also serves as a good way of looking into the ordinary life in that universe, by playing something that isn't a space marine.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "owlcat does it again. not much to say if your into crpgs its great, want a warhammer game without smurfs its great, want to be the sneering imperialist that has the zeal and furver boner for he who sits on terra this is the game for you. Great game great story fun all around with that Owlcat charm only downside(not really) is that you will read a book the size of the entire horus heresy novels with not much VA but hey atleast you will excercise your noggin",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't normally like games this long but I adored this whole thing from front to back, and I honestly would be ok with it being longer or the world map being bigger so there's more to explore. There is always something happening in this game. It may not be a traditional open world but I got lost in 3 hour side tangents from single warp jump events more times than I can remember. There's an incredible sense of forward momentum that carries throughout the entire length of the game. The end manages to stick the landing too. Do you like choice and consequence in RPGs? This game has more choices and more consequences than any other game I've played. You will make decisions in the first 20 minutes that will be relevant 90 hours later. \n\nThe companions are my favorite in any CRPG I've played. They are all flawed and feel like real people. You do have influence over how their personality shapes up, but at major moments they will make their own decisions based on that influence, instead of you telling them what to do. They will argue with and dislike each other, and sometimes you will have to pick a side. They will make mistakes and you can choose whether you want to forgive them. I've seen people say that some of them don't really have an \"arc\" so to speak, which is true, but I don't think all of them needed one. I've grown kind of tired of how many modern RPGs have companion side quests that are some kind of grand \"self discovery\" where you are making all their choices for them. I got a lot more attached to these people for the fact that they were working through their own issues. They are who they are, interacting with them was fun, and they still have a variety of different endings. \n\nThe underlying roleplay system is addictive too. It isn't nearly as complex as other Owlcat games, but it's still deep enough to have a ton of variety in play styles. You have a lot of options but it's hard to make a straight up bad character in this game, especially if you're playing on normal. At first it does feel kind of complex, but it isn't hard to get a grasp on. The fact that all of your options for each archetype are available on the list from the beginning makes it look intimidating, but it lets you plan out your build which is something I really appreciate. That drove me kinda crazy in BG3 because I wasn't familiar with DND 5e. The best thing to do is just read what you have available and then favorite the skills that look cool or that you want to build around and you'll be fine. Even if you don't do this and just kinda pick stuff when you feel like it you'll probably still be able to get through the game on normal. Gear itemization isn't as good as Diablo but this is the closest a non-ARPG has made me feel to that kind of experience. You can get very OP in this game. I don't know where else to mention this so I'll just say it here, I only had 1 bug in the entire time playing and it was patched mid-playthrough. No crashes or anything either.\n\nThe first DLC expansion, Void Shadows, is the best DLC in any game I've played. It's so intertwined with the main story and well written that I honestly wouldn't have been able to tell it was DLC if I didn't already know it was. It is seriously a highlight of this game. I wouldn't say the same about the 2nd DLC, Lex Imperialis. I think that one is worth buying purely for the mechanical stuff it adds. The gear it adds is fun and Arbites is a pretty great background to pick when you make your character. I didn't like the quest for it a ton though. It has it's moments but overall compared to the base game and especially Void Shadows it wasn't as good. I'm hesitant to call it straight up bad but out of the entire game it was definitely the low point. \n\nFinally, the main story. It is good. I was a 40k fan going in so I wasn't ever lost in terms of lore, but I think this game does a pretty good job of explaining whats relevant in way that a newcomer could understand. Having meta knowledge of the setting did allow me to figure out some things before my character did, and that was pretty fun. I would be curious to see how someone who is completely new would handle some of these choices. In terms of 40k games there's a massive variety of stuff to see here. I don't want to spoil it because a lot of it was pretty surprising to me and going in blind is really fun. A good chunk of the companion quests are pretty heavily interlinked with the main story in a satisfying way. The plot it's self is intriguing and they do a good job of tying everything together at the end. This game spins a lot of plates at once. Once I started following the different breadcrumb trails and trying to piece everything together I got hooked and couldn't stop playing. In general this game is very reactive in ways that will sneak up on you or that you might not even realize. When a decision directly affects something and it comes up in dialogue, it's highlighted in blue and when you hover over it it'll tell you what you did. The thing is, there's a lot of times where the direct effect doesn't come up in dialogue. There's times you won't know what you're watching is because of something you did. There's missable interactions that lead to plot revelations or even different endings. Sometimes those secret endings are even different depending on what choices you make throughout the game. There was a time where I did part of a companion quest that went completely fine and when I looked it up after, it turned out there was several other pretty drastic outcomes that I wouldn't have even known about if I hadn't looked it up on a whim. This game is massively replayable in that respect.\n\nOverall, I loved this game. It's the most fun I've had with an RPG since Fallout New Vegas and maybe even since Fallout 1. I highly recommend doing what I did and starting the game in Grimdark mode. This is basically a permadeath mode where you're locked to 1 save, but if you die then you can just continue the save in normal mode. I'm definitely guilty of save scumming in most RPGs or reloading my save to see how different dialogue options play out. Being committal in this game really lends its self to the sense that you are leading these people through this crisis. When the mode is active the combat is a lot more tense too. I made it about 53 hours in before dying, and I enjoyed it so much that I self imposed the no reloads rule for the entire rest of the playthrough. That is definitely how I'm playing all future RPGs going forward. I need to play the pathfinder games now. I cannot wait for the new DLC for this game as well. It's going to be centered around an egotistical archaeologist necron lord named Trazyn (my favorite character in the whole setting), and exploring his planet sized gallery. It is going to be 40k night in the museum and it'll rule. Dark Heresy will be a day one purchase when it comes out. Owlcat went god mode with this game and they have a new fan.\n\nThe emperor protects.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really nice game, the equivalent of Baldur's Gate 3 but for the Warhammer 40k.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A definite improvement from past Owlcat games.\nComparatively, the combat, leveling and general scaling are much more fluid and easier to operate than their pathfinder games.\nI think the game accurately captures a portion of the Warhammer universe.\nThere are of course flaws, such as for Co-Op, If your friends want to create their own character, the host has to create it for them in the character creator, they are unable to customize it themselves, mildly cumbersome but manageable.\noverall I think Owlcat did a pretty good job!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I need to edit my review: I still think that making players grind through the first system and all of its protracted missions before letting us go full sandbox is a brave design decision. However, the dev's have been pumping content into the game, so that first system grind isn't soul destroying like it used to be. Looting remains a clunky chore (why no onscreen map?). Good game otherwise, with good devs.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The one thing any player needs to know before stepping into Rogue Trader is this: the game is ENORMOUS. In every possible sense.\n\nIt took me around 200 hours to finish it, including a couple of false starts. By the end of it, I was fully immersed in WH40k lore, comfortable with every nuance of game ruleset, cheerfully embracing the role of an filthy rich aristocrat, and firmly convinced that every problem in the Imperium can be traced back to those damned xenos.\n\nIt was a remarkable journey, and I’m grateful to Owlcat for it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game if you like sci-fi, are a fan of the warhammer universe, or are interested in getting to know more about it! The game introduces you to all of the lore quite smoothly.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Дать честный вердикт этой игре так же тяжело, как отличить истинного верующего от еретика в дыму сражения. Она слишком разнолика. Моменты, когда воля Императора явно ведёт тебя вперёд, внезапно сменяются такой духотой, что и Нургл бы отвернулся. Неожиданный ролевой отыгрыш вспыхивает в самых рандомных уголках, будто благословение Омниссии, - и радует, как редкий святой болт. Но в тех местах, где ты наверняка ожидаешь глубины, пустота зияет хуже варп-аномалии.\n\nЭта двойственность просачивается во всё: в сюжет, в механику, в саму ткань геймплея… и уж точно - в оптимизацию, где одни моменты сияют как пластины силовой брони, а другие ржавеют, будто их грызли ксеносы.\n\nМузыку похвалю отдельно - она сродни хоровому гимну Адептус Механикус: безупречная, всеобъемлющая, создающая атмосферу настоящей войны в беспощадном мраке будущего. Но всё остальное… очень спорно. Несмотря на то, что я отдал игре более ста часов своей жизни - как верный слуга императора - восторг здесь соседствует с разочарованием",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is such an interesting game. If there's a sequel, please localize it into Japanese.\nI find it very disappointing that so few interesting games like this get Japanese localization, so I consider this game truly valuable.\nI'll definitely buy the next one if it comes out, so I'm really looking forward to it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Finished the game with both DLCs.\r\nSimply put: the best computer game set in the WH40k universe, If you like great writing, fantastic atmosphere and a solid RPG framework then Rogue Trader will not disappoint you.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is a masterpiece. Only through Act 2 but the dialogue, lore, and mechanics/systems are all A+. I haven't found an RPG to really sink time into for a long time, but this is definitely letting me do that!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Rogue Trader is not \"My First RPG.\"  The character abilities are numerous and complex, and with 6 active party members plus gear, it can be overwhelming.  But as long as you can handle all that, you'll find a fun, story-driven game with great writing and deep lore.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The amount of work and dedication that went into creating this beast of a game is astounding",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good fun, nails the 40k vibe, and the alignment system (Dogmatic/Iconoclast/Heretic) fits the universe well.\n\nHeretic choices tend to be cartoonishly Evil right from the start, rather than properly emulating Chaotic corruption by starting seemingly reasonable and working your way up to full madness and damnation, but, well... you, the Player, know exactly what you're getting into by picking those choices anyway, so it's forgivable.\n\nIf you're a fan of 40k, get it. If you're not a fan of 40k, get it anyway, it's a good CRPG in its own right.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game captures the essence of the 40K universe fantastically. Combat mechanics are intricate and have a surprising amount of synergies, and overall make for a very \"Start as nothing but become something\" sort of game. \nStory and plot hooks are very good; some are very obvious tropes and but they still bely a few clever twists and a few revelations I honestly didn't expect.\nThe ending slides made me sad though; I briefly forgot this was a 40K game and wanted my \"and they lived happily ever-after\" but alas it's not so.\nOnly had 2 small bugs that I was able to get rid of by saving and relaunching the game.\nAlso, probably the best implementation of Orks in Purple I've ever come across.\nRecommend highly if it's on sale, recommend moderately if not, especially with new DLC's coming out.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have played quite far in chapter 1 but will wait for all the DLC before playing again. This will be quite a wait as each DLC comes with bugs and flaws that needs ironing out. What I have played is good and I am looking forward to actually play the game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This may be my most played game of 2025 and for good reason.\n\nIf you enjoy 40K as a setting but want a perspective from something other than a Space Marine, then this is the game for you. Great story, great characters, decent amount of replayability with various endings and paths to get there.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "10/10 love it great for anyone looking to learn about the 40k universe gives you a great insight into the more normal part of the series that is not just SPACE MARINES!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sunk 100+ hours into this at time of writing.  Initially bounced off it a couple of times as it has a bit of a steep learning curve, but once I go into it its a very good game even with the odd bit of Jank in there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While quite buggy on release and some bugs continue to persist in one form or another it's still one of my absolute favourite games. I enjoy all the companions, the soundtrack and atmosphere are amazing, the combat when classes come online is also really fun and blowing up an entire room of enemies before they get a turn is quite satisfying if cheesy.\nAs someone who until this wasn't into 40k at all the game did a pretty good job at explaining who was what and what I was doing and definitely got me into the universe. \nIts first DLC Void Shadows integrates quite well into the basegame and I have a hard time remembering how things were without it.\nThe final act feels quite unfinished but at this point I'd be more surprised to find a cRPG with a polished final act.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have had this game for only a couple of weeks and am already starting my third playthrough.\nBoth the story and the gameplay are tonnes of fun to explore, especially when you do things slightly differently between playthroughs and can compare the results.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wasn't really into Warhammer 40k lore, but I really like turn-based tactics games. This game is excellent in all regards, although leveling up characters can be very time consuming. My only real nitpick is the lack of voice acting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "WH 40K RT: It took you near 200 hours to complete the game, would you recommend this game to other players?\r\nMe: Yeah, I suppose I would if I got lost in an adventure for almost 200 hours...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not many games can actually stuff a lot of 40k content into it and show off well, this game dose that very well. From the normal people around a world and from a rouge traders eyes, which isn't explored very much besides a few novels here and there and parts in the main 40k lore. I can say it's an amazing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game scratched the itch after coming off of Divinity Original Sin 2 and BG3.  Action, romance, humor, and the darkness that only 40k can provide.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Behing BG3 the best current CRPG, set in Warhammer 40k universe, it is able to explore so many factions and lore. Very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game. Incredible writing and even works if you don't know all that much about Warhammer 40k.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're looking for a fully voice-acted, amazing graphical experience; look elsewhere. If you hate to read, this definitely isn't the game for you. \r\n\r\nHowever; if you enjoy well-crafted stories, engaging characters, and long for a power fantasy in which you slay demons and gods, then this is the game for you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not usually a fan of crpgs nor am I into the over the top lore of 40K. But for some reason, this game is working for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Came to this game because it looked like BG3..... staying because its fantastic and a real good time, can't recommend it enough. The 40K universe is incredibly rich",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After multiple playthroughs of Rogue Trader i can safely say that this is probably the best Warhammer 40K RPG. Cannot wait for Dark Heresy! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "By exceptionally far, the best WH40k game out there\nSurvive the roughness of the first chapter and you will enjoy truly one of the written best games of all time\n\nAbsolute Cinema.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For such a long time, i've been waiting for a CRPG set in the Warhammer 40k universe. And almost as if the stars aligned, one of my all time favorite RPG companies was the one to do just that.\n\nI love this game. I can't recommend it enough. It's not as good as Owlcat's last game Pathfinder Wrath of the Righteous, but it's comes at a really close second. Let's go for it in sections:\n\nSoundtrack: a solid 9/10. It's the perfect representation of Warhammer. It's heavy, it's powerful, it's sacred! A wonderful mixture of church organs, heavy drums and choirs (the CHOIRS, man...) It's merely lacking more solemn songs, like Mechanicus' soundtrack, but it's a really good win nonetheless!\n\nGameplay: 9/10. This game is turn based and you have NO IDEA how freeing and easy to understand this game's stats and archetypes turned out to be after the    N I G H T M A R E   that was Pathfinder's character building. But don't get me wrong, this game has one of the most robust character builders yet. (Not visually, we'll get to that). You get to pick your homeworld type, your origin, an archetype, your stats, what was your biggest achievement and your worst moment and all of these details change your stats, influence your build and even give you dialogue choices and world reactivity. It may seem daunting at first, trust me, but it's a lot more digestible when you get to the action! The only reason I don't give it a 10 is because this game has some seriously boneheaded bosses that are just plain not fun to fight due to poorly made design choices... (You'll know what i'm talking about when you get to them)\n\nVisuals: 8/10 The game is GORGEOUS. Warhammer settings, monsters, warp abominations, ships and architecture are recreated wonderfully in the game. Even if it's an isometric perspective game, it doesn't spare details on the character models, vehicles and map/level design. It DOES however really heat up your machines and the game can stutter at times, which I don't really understand why...we're not playing Cyberpunk, it's a turn-based Isometric RPG....And unfortunately, I have to deduct a point for what i'm about to say (and i know it's gonna sound like nitpick) but why can't we have more augment options? Where are the fancy robotic eyes and prosthetic legs and limbs? I know, we're not gonna hit Tech-Mage levels of metal but we could have gotten some cooler options...\n\nOverrall, I'd give this game a 9.5/10. It's a fantastic choice for anyone wanting to get into the world of Warhammer 40k, and it's magnificent to know that not only are the developers still putting updates and small bugfixes into this game, but they're taking everything they learned and making ANOTHER Warhammer CRPG! You should buy this one and already save up some cash for Dark Heresy when it comes out!\n\nGood luck, Lord Captain. And Praise the Emperor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just starting out but I like the combat, a bit more tactical, leveraging cover, positioning etc...  Looking forward to building the characters a bit.  The Psyker seems op in the beginning will see what happens later on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Endlessly replayable, hundreds of hours of content and fantastic storytelling and characters. Familiar to people who have played baldurs gate 3 while being a great entry point to those who are new to the Warhammer 40k universe. \r\nLots of reading is required but the occasional voice acting feels very unique and intriguing to each voiced character. \r\nGameplay and progression offer lots of customization allowing new strategies and loadouts every playthrough with new dlc and updates added frequently to the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. lower budget then Buldurs gate, but a must for all WH fans.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great universe, and game keeps getting better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun, the combat mechanics is what you would expect of a TRPG, the story is rich and if you are a warhammer 40k fan, then you are going to be pretty happy with all the lore this game packs.\nThere are some minor bugs related to some of the dialog options or character activation, but they are pretty minor and super far between.\n\nI would love to see more detailed stories around some of the factions and more unique enemies!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[b] Very good game [/b] \r\n\r\nCan be a bit text heavy, especially for someone who is not well-versed in WH40K lore, but even without understanding everything has a fun and compelling story (mostly). However it is a bit slow to start. I had spent 5 hours in my first playthrough before I even finished the prologue (I was reading everything). The game reallly started getting interesting once Act 2 started, so if you have the time I would recommend getting that far before deciding if you want to finish.\r\n\r\nGameplay is incredibly deep (although not overly complicated). It's one of the \"easy to learn, difficult to master\" types. Lots of options for character builds, but that inevitably leads to some brokenly powerful ones too.\r\n\r\nCharacters are interesting, although some can be a little bland. And there are enough interactions to warrant (haha) more than one playthrough... even if it takes a ridiculously long time to do so.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The writing is pretty good in this one. RPG systems are... there. It's as broken as ever past midgame still, though. You can and probably will kill everything in 1 round past act3. That being said, the game is enjoyable, so can recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Baldurs Gate and Xcom had a 40k baby. There is a lot more game inside than you would expect. Controller support could use more love, clearly designed with mouse and keyboard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is excellent for any CRGP fans and it truly shines as a gem for a fandom that has been subjected to some terrible 40k shovelware.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game of beauty within the grim dark future of the 41st Millennium. It might be the most story/lore-rich game in the Warhammer universe. The CRPG is excellent, with a lot of care and love put into it. The DLCs are great as well and integrate very well into the base game. The first 3 acts are built excellently, but the 4th act has pacing issues and Act 5 is quite short, but after such a long game, it might be a good thing to have a short last act as a climax. \n\nLike everything in Warhammer 40k, the story is grim and hopeless, and that's the way it's supposed to be.\n\nThe game's mechanics are very complex for people with no understanding of CRPG mechanics. Talent selection, weapon and item choice and understanding character and companion mechanics are challenging in the beginning, but still playable and completable on normal difficulty. For people who use online build guides, the game might become too easy even at the hardest difficulty, especially in Act 4 and Act 5.\n\nI'd encourage every Warhammer fan and CRPG fan to try this game. It's excellent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Owlcat continues to improve its presentation and storytelling with each game. The companions are great, and the gameplay is fun...if you know what your doing. My main gripe is that the barrier to entry for things like character builds and progression can be a little off, i felt more lost than i did with pathfinder. But to me thats a minor gripe when i get to play one of the best entry point narratives for Warhammer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly fun look into the 40k universe. Lots of reading but not boring at all, and the replay potential is great. Love the companions as well, some are more lacking than others but overall lovable. Atmosphere and art style ties it all together and makes it one of my favorite rpgs ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game.  Keep adding new races and locations please.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just finished my first Playthrough and yea, the game is absolutly worth its price. \nThis game is also a great demonstation of a Studio learning over the years, it has the game and mechanical Depth of their Pathfinder games but is far more Comprehensive, the only things i googled where out of curiosity but the games was fair to beat (towords the latter half even rather easy) on Daring.\nAnd as one of the reviewers that i to into consideration for my decision to play this said, there is allways something happening, this were about 140-150 hours of playing. But one warning, if you don't enjoy reading (alot) this game might be not for you, it's great story dialogue is mostly written, as it was in Pathfinder.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're already interested in the lore of Warhammer 40k, this is a pretty good game to get into. If you're not, then the variety of builds, storytelling and cast of characters are sure to rope you in.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is my all time favorite game. The story, characters, gameplay, and visuals are absolutely phenomenal.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game. Very immersive and the story is writen very well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game with a few blemishes. It's a hard one to recommend for everyone as lots of people will no doubt be turned off by these faults, but for Owlcat fans, RPG fans, and even Warhammer fans, I think it's worth a shot. \r\n\r\nFirst I have to say that the writing and immersion into Warhammer 40k is top notch here, without a doubt one of the best of any Warhammer game. As an RPG it's also fantastic, VERY deep character builds and lots and lots of choices to make throughout, especially among good and evil. You do feel like a ruler by the end, with multiple colonies, armies, and power over civilizations. It's a game that's begging to be played multiple times and that's great.\r\n\r\nFor the downsides, the game still has rough edges. The balance is ridiculous, even after recent updates, it's still insane. The first two chapters feel about right and I managed to play well enough on medium difficulty, but once chapter 3 hits and especially in chapters 4 and 5 it just goes nuts. Enemies have multiple attacks per round, multiple health bars, prerequisites before they can be damaged etc. It stops being fun and just gets exhausting as chapters 3, 5, and most of 4 are almost pure combat. I knocked the game down to story difficulty, maybe could have done the one above it, but again, just exhausting. It's balanced around grinding for the best gear, optimized builds, and perfect tactical play, which I guess is great for those wanting a challenge, but it was a lot for me.\r\n\r\nSame can be said for ship combat, which at first I hated and didn't think it should exist in a game like this, but I've come around to like it a little more by the end of the game. It's just balanced poorly and far too difficult since your options for ship gear and abilities are far more limited than in ground combat.\r\n\r\nFinally I'll say this is a minor quibble, but while the game is super epic on a galactic Warhammer scale, I feel taking a regular person starting the game with a revolver and growing them so powerful that you wipe entire Drukhari Kabals, Chaos Space Marine squads, Chaos Gods, and every type of Necron diminishes the power of these entities in the lore. Not that you shouldn't encounter and defeat these groups, just that you alone shouldn't be able to do it. I guess once again it's a balance issue...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely up there with Divinity, Baldur's Gate, and Pathfinder as one of the best CRPG experiences",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is how you do a RPG in the Warhammer universe. Everything from the writing, atmosphere, companions... it evokes what it's like being a servant of the Emperor in the 41st millennium. If you're a Warhammer 40k fan, or a fan of well-written CRPGs in general, this is well worth your time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great RPG from very intersting setting. Grimdark, with lot of options on how to solve problems",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best RPGs out there with a a variety of decisions and consequences. Despite its leveling system that is overwhelming, it is very enjoyable and secures a good experience for the RPG lovers out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "So far great atmosphere, great music, the classes function pretty uniquely and the gameplay is fun. \nIt's pretty easy and I'm not even a big cRPG player on the second highest diffculty so probably a good place to start in the genre.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game (and dark tide) were my introduction to the warhammer40k universe. \nI'm not saying it's too fun or too addictive... but i just spent my food money on mini's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun, Owlcat swerves from fantasy to Sci-Fi as they make another cRPG, this time set in the Warhammer universe.\n\nSo, gotta compare it to previous games, cause Owlcat has a reputation and... Having played it a bit, I haven't encountered as many bugs as some of their previous titles, so that's good! Granted, I also wasn't a day 1 adopter, so it's possible they have some of them ironed out. Doesn't mean it's bug free, but it's an improvement from what they've put out.\n\nThe game is also a lot easier, they're not quite the killer GM they've always been in previous games, so you know, if you just want to play without having to be a complete master of the game system that is kind of a decent point.\n\nNow, on how authentic a Warhammer experience it is... On that I can't really say. I don't know a whole lot about this universe, and so that makes it difficult for me to judge how loyal it is to the source material. Having said that, I am enjoying the writing quite a bit. The party members are fun, and none of them have made me want to space them yet. We'll see how that plays out.\n\nThe combat in this game is on a tactical grid map, similiar to Final Fantasy Tactics or Xcom. There's a few things that took me some time to get used to (such as not being able to take a move action after attacking) but it's not bad at all, pretty intuitive and easy to learn. And once you start getting good at it, well it feels really awesome to just dismantle  an entire enemy squad without injuries.\n\nSo far, the empire management seems... unoffensive I guess is the best term to describe it. It hasn't drawn me in yet, but neither has it just been a part of the game I just do not want to engage with. So, yay I guess.\n\nOverall, if you're a cRPG fan and need a break from fantasy and want to try a sci-fi setting for awhile, this is one I would highly reccomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Warhammer 40,000: Rogue Trader[/h1]\r\nLet me start out with:\r\nI have never explored into the Warhammer 40k universe before (other than Total War) so Warhammer 40,000: Rogue Trader is my first dive.\r\nNow, I know there a ton of \"top-down CRPG story games\" out there, but only a few of them had a story that really stuck (with me). I needed something that was different - something new.\r\nAnd let me tell you: the Warhammer 40k universe? It's different.\r\nIn the best way.\r\n[i]Also, this review is a scatterbrained collection of things I liked about the game. There are a ton of other reviews listing pros and cons if that's more your fancy.[/i]\r\n\r\n[h2]Soundtrack[/h2]\r\nI spent an ungodly amount of time with this game idle in the background. I'd get on to play but end up getting sidetracked and spiraling into production-mode with the music playing in the background (which I later [url=https://store.steampowered.com/app/2682660/Warhammer_40000_Rogue_Trader__Deluxe_Pack/?curator_clanid=43222021]bought the soundtrack[/url] just to support the devs and get it in FLAC). The point is - I didn't want to leave the world. It may be seeping with corruption; but it's a soothing lullaby in the real world of corruption and darkness beyond the screen. From hearing the tracks in the space map to the echoes of duty from the bridge - the soundtrack in this game really is amazing.\r\n\r\n[h2]Writing[/h2]\r\n[h3]Power Fantasy Trope[/h3]\r\nLet's talk about the power fantasy trope and how it's done right. You are a Rouge Trader with supreme authority. In a world of darkness and chaos, you have the illusion of power. Your choices will impact the lives of billions living under you (and the story). You'll navigate politics, faction relations and affairs of foreign races. You'll feel the weight of your power - or abandon it to chaos (if you choose to go down that route).\r\n\r\n[h3]Companions[/h3]\r\nOhhh, the companions. One of the best parts of this game imo. They're well written and each unique; it genuinely feels fun to explore your companion's stories as they accompany you across the Expanse.\r\n\r\n[h3]Written Visuals[/h3]\r\nBeing a somewhat isometric game, most of the visuals you'll be getting is via written descriptions. As someone who never explored the 40k universe before, when reading some of the descriptions, I was shocked, disgusted, and in awe - and sometimes all three. This really is one of those games where you have to see it inside your head to actually feel it; and Rogue Trader's writing style allows you to do that. I felt compelled to read every line. They were oozing with sickening detail that I was eating up like gravy.\r\n\r\n[h2]Gameplay[/h2]\r\nIt acts pretty similar to games in the genre. And that's not necessarily a bad thing. Why break something that works, right? Although, it can get repetitive towards the end (like most CRPGS!). it's fun for the bulk of the game when you're learning the systems and assembling your party.\r\n[h3]Progression and Character Building[/h3]\r\nThere are a ton of different skills and a multitude of ways to build your characters. If you avoid online guides, you'll spend hours in the progression menus. The combat can become pretty easy if you build your characters right and synergize the party. So, as always, abuse moderately :)\r\n[h3]Combat[/h3]\r\nSomething I liked about the combat is that every sequence had a story. I never really felt like I was crawling through a dungeon and wiping out mobs for the sake of killing things; each encounter had a story (and usually) a conversation behind it.\r\n\r\n=================\r\n[h1]Summary[/h1]\r\nIt will be hard for me to forget my experience with this game. I went into it with minor expectations and was enthralled by the world and characters within it. The Warhammer 40k lore was a blast to learn & experience through Rouge Trader.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm currently ticking up to 90 hours now in game, here are my thoughts:\n\nSETTING:\nI really enjoy 40k as dark universe, but something which bugs me about it is how much of it focused on the imperium of man, I get it, they are humans which is something we can relate to, (if one can relate to what becomes of human culture in 40k) but the imperium is only 1 of many different xeno species which inhabit the universe is what is meant to be a all out war.\nThis game doesn't quite have that feel, at least not yet at where I am in the game.\n\nQuite often I'm dealing with issues within the imperium itself, dealing with criminal Gangs, uprisings, corruption and difference of opinion.\nNow interacting with aliens (aka Xenos) does happen, rarely but it does happen, it feels like 1/10 missions relate to xeno's which gets me excited when it finally occours.\nChoas also plays big part in it too, perhaps more than I'd like, but they make a good enemy, they are in it about 1/3 missions.\n\nSometimes I feel like the game is deliberately taking the piss as there is literally one mission when you have to wait in a que to get administration paperwork done... That's not why people go into games workshop for.\n\nthere are some missions which I find to be absolute gems... but for me it can feel like a slog to get to and you may never know until you'll hit it.\n\nand there is ALOT OF content, which is good.\n\nGAMEPLAY:\nSo the game doesn't have a lot of hand holding, there is information available, but I feel like there is Too much information to learn how to play a game. no one likes to read technical manuals to entertain themselves.\n\nI'm still learning how to do some things, but I'm feeling like I got the majority of what I need to know, once you know it becomes pretty easy to remember.\n\nSome of the character abilities are confusing, and the explanation doesn't really help either. most of them are just buffing abilities you use before you make your attack, it makes building a character a bit trickier, you could spend hours and hours researching what each ability does and still only scratch the surface.\n\nThe gameplay has xcom style vibe to it as well as owlcats other pathfinder games. so if you played either of them you know what you're in for.\n\nencounters can be tricky at times with a lot of fights too easy and the occasional super hard one, but overall i haven't hard to much difficulty progressing. \n\nthe game has puzzles too which owlcat studios don't have the greatest reputation for, but fortunately most of them aren't mandatory and there are plenty of online walkthroughs you can use if you get stuck, i definately used some in a few instances and don't regret it.\n\nSTORY:\nthe story is superb, I know this may seem contradictory to my comments about the missions but there is a significant difference between the two. The mission generally consists of getting the plot device or dealing with a \na antagonist, the story is why you are doing this things which i think the game handles well, the characters in the game is what brings it all to life, with these characters you actually become to be able to relate to what it is actually like living in the 40k universe and my god it's a mad house of gut wrenching drama on all levels.\neven the minor NPC'S you may only encounter once add so much to the experience. \nJust to give a brief example of one character explaining the ingredients of what they use as 'soup' to feed the less fortunate crew members of your own ship, he offered me a bowl... I declined. and made damn sure they were fed properly afterwards.\n\nThat said, Sometimes the Text of the game gets a bit heavy, and I'm finding myself skipping through alot of it... it depends on my mood, usually I'll skim read it to see if anything jumps out at at me at the worst of times. \n\nOVERALL:\nThis may not be the most glowing review, but I'm still giving it a thumbs up.\nI don't regret the purchase or it's DLC (which I recommend getting for first time buyers) , \nit's got plenty of story, action, intrigue and content to occupy you for a month.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not since Dragon Age Inquisition has a game abosrbed my attention so much as has Rogue Trader. This game is brilliant and really captures the feel of the 40K universe. The lore is amazing an each dialogue encapsulates just how grim dark the galaxy is.\r\n\r\nI am just commencing chapter 3 and cannot wait to see what is next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game if you enjoyed Pathfinder and into Warhammer setting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has been taking up way too much of my time since I bought it. I can't stop playing it. My wife is probably going to hide my PC soon. Since you're a rogue trader of The Imperium of Man, you can't be too much of a nice guy. And if it's heresy, you must eliminate it. I've been enjoying the story so far. The combat is nuanced, but not so overly complicated that it's not fun. The ability to explore space with your voidship scratches that exploration itch. The space combat is pretty basic. I can see myself doing quite a few playthroughs. May The Emperor protect you on your travels through the warp.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so insanely good! \r\n\r\nI've been a WH40K fan from practically the beginning. Starting from laboriously painting my models for WH40K Epic up through playing a large number of digital titles through now.\r\n\r\nThis game is the only one I've played that is truly immersive. It's through and through the WH40K universe, and your both personal and policy decisions matter. You have to balance personal power and aims with the potential to be tainted by Chaos. \r\n\r\nThis game is wickedly clever with unintended consequences. You want to really think about whether or not to do something and, if you do it, how you do it. I got a tad apathetic about that recently, even with hundreds of hours of play. One hasty decision, and I now have a chance of being hunted on one of my own planets by bounty hunters, lol. Who ironically think they're helping me out and probably expect to get paid by me!\r\n\r\nEvery single part of the game is very well balanced. \r\n\r\nThe story line is very sandboxy and engrossing. It feels like you can go almost anywhere and do almost anything.\r\n\r\nThe only, very minor criticism I have is, why aren't there more pirates and xenos to crush in space???\r\n\r\nI've destroyed them all and they've not shown up again at all. Not even one in so many turns. Have I really so thoroughly conquered the Koronus Expanse? I really enjoyed the ship to ship battles, is all.\r\n\r\nAgain though, fantastic game! Highly, 110% recommend! If I could only have one of all the 12 WH40K digital titles I have, this one would be it.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Multiplayer is plagued with constant desyncs. Dev's have said nothing on it so they are just tricking people with the \"Online Coop\" tag when it can take 30 min to do a single round\n\nWill change review when desyncs are finally addressed.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game was sold as a cooperative game, but this is a lie. While act 1 is somewhat playable co-op, the second player will frequently be left behind. This happens for the first time during the games first morality check, which will always leave player 2 behind unpassable barriers. This will keep happening. Depending on your group composition (officers and cassia are biggest offenders) you might be able to make it almost halfway through act 1 before the real problem begins to show its head, the deadly desync.\r\n\r\nThis game desyncs constantly. The inbuilt pauses to warn you of traps or found loot will desync you. Any sort of extra turn action in combat will desync you. Most aoe has a reasonable chance of desync. Reloading from said desync also takes far too long. Each time you must redownload the save file, which will slowly increase in size, and download incredibly slowly. 6mb saves take upwards of 30 seconds, then you have to load the game again, which takes a bit as well. Now, a minute or two load time seems not so bad, but then you realize this will start happening more and more frequently. By act 2, expect 1 desync a round. Expect this to balloon to 2 or 3 a round by act 4. This review will stay negative until the devs fix anything beyond act 1 or show any gameplay beyond act 1, since thats all they are willing to refine. This isn't early access.\r\n\r\nAs for the rest of the game, its passable. Dialogue is fine, if a bit convoluted. One of the worst games for \"thats not what I wanted\", which might be a translation issue, but I've played other non-english rpgs and they aren't usually this bad. Characters are surprisingly good, if a touch one note. Navigating the game isn't great, tons and tons of loading screens, lots of them pointless. Its maybe a quarter voiced, which is neat, but leaves other parts particularly wanting for it. \r\n\r\nIf you are playing it solo, it gets a 3/5. Not the usual 40k shovelware, but still feels about 20 years behind on game design. Closest cousin is Kotor era rpgs. Its like a really mid version of that.\r\n\r\nIf you are playing co-op, it gets a 1/5, and that one point is for how much less busy work there is to do by splitting up half the cast's level ups and equipment on someone else. It is shovelware and mostly non-functioning.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I cannot fathom why players like this trash. Its combat system is dreadful. Line of sight rules must have been programmed by a blind man. Its unit turn sequence is arbitrary and frankly dumb. Its rpg elements are strictly for the die hard fans.  A grave disappointment",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game was an 8-9/10 for me. The gameplay is fun, but I wish it was fully voice-acted. For 60 hours, I did all the side quests I could find, resolved rumors, and thoroughly enjoyed my first playthrough, even on the Unfair difficulty. I had a great time... until Chapter 3.\r\n\r\nThis chapter alone can completely break the experience, and I hope whoever designed it is no longer with the company.\r\n\r\nWithout spoiling why or the specific setting, that chapter locks you in with zero gear and two random companions. In my playthrough, these were two other sniper builds, and my main character was also a sniper build. They only give you two base-level snipers, meaning I had to kill a boss and eight other enemies while being surrounded and within range of all those mobs from turn one naked. The boss alone has 500+ HP. No matter what I tried, I couldn't even reach a second round; I just got swarmed and defeated immediately. to give you a pespective in term of damage, If all my character were critical hitting that boss every time, it would take at the very least 2 or 3 turn to kill that boss alone. \r\n\r\nI looked at a guide and saw that other players received different companions. If I could choose my tank, I would have a chance, but nope—it's random. \r\n\r\nThe first thing that comes to mind is: \"Well, respec.\" However, you lose the ability to respec for the entire chapter. So, unless you are very lucky and get your tank among the companions you receive first, you will have to drop the difficulty. I did, and I lost all interest in the game as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Massively not for me.\n\nMechanically opaque.\n\nExpositionally dense.\n\nI find the game, past about Act 2, seems to devolve into a disjointed series of increasingly unbalanced combat encounters, with minimal payoff. These encounters are alternately massive boss/miniboss fights with hundreds of HP and massive damage output, or absolute stomps with tissue-paper enemies. Not much in between. The combat system is...not the best, and certainly not good enough to stand up to being shoved in the player's face every 30 seconds for 5-6 hours of the game's plot at a stretch. Add to this the incremental and often undecipherable 'bonuses' you get from leveling up, and the constant stream of identical, mostly trash loot, and it doesn't even offer much reward for your toil here.\n\nThe story is a convoluted ball of plot threads punctuated and slowed down further by navigating the huge difficulty spikes, and I felt like understanding my moment-to-moment motivations was a rarity in the latter half of the game. All in all, Acts 1 and 2 had me unable to put it down, Act 3 and beyond had me feeling reluctant to pick it up. Eventually I've just sort of come to the realization that I don't care anymore, and it's not worth my time to keep forcing myself through tedious combat after tedious combat to get the story resolution I felt owed. I'm at the point of just uninstalling and writing it off. Maybe reading the endings if it matters.\n\nI understand that I'm about 1-2 hours from where the plotlines *start* to come together into a coherent narrative - but I've been so put off by how onerous getting to this point has become, how unfriendly and obstructive its entire design philosophy seems to be, that I just don't care anymore.\n\nI buy myself roughly 1 new game per quarter. I can usually tell within the refund window whether I will like it or not. Unfortunately, this time it was only very late in the game that I began to feel it was overstaying its welcome and exhausting to interact with. So that's this quarter's game down the drain for me. It is rare that I'd say I actively hate a game, and it's even rarer for it to be one that's generally loved (looking at you, Souls games), and it's *almost unheard of* for it to be a part of a franchise I generally adore (in fact I can't think of any other examples), but this one's on that list, unfortunately.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I was excited to try this game because I enjoyed their other game (Pathfinder), but I really wasn't feeling this one. I feel like it's good for the first hour or so, and then after that it slowly tapers off and gets more and more boring. I would say if you're desperate for something - anything - to play, then maybe pick this up since it provides a lot of content in itself. But how fun the content itself is? Subjective perhaps, but for me it was meh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if they fix the game crashing bugs, and I will change my review.  the game itself is fun(except the walls of texts sometimes), but it has so many bugs.  stat calculations failing, veil degradation fails, sometimes the enemies just stand around skipping their turns, but the most annoying is the game crashing bug when opening the inventory.  sometimes power weapon visuals cause this, other times buff visuals.  I noticed that other owlcat games sorta have optimization issues with their graphics.  at the very least they could give us an option to turn off electrical weapon visuals in \"appearance\" like they do with helmets and backpacks.  I use amd rx 6500.  so if you use AMD, you might wanna think twice before getting the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The space navigation aspect of the game just ruined it for me.  Flight combat was annoying, but what really killed it was the warp navigation.  Ran out of navigator's insight and couldn't regenerate it without unexplored content, so I couldn't get to events I needed to get to before the time for them to pass expired.  This is a tiny bit of chapter 1 and even early chapter 2, but it becomes a bigger and bigger part of the game to where I just couldn't put up with it any more.  Such a shame because I loved the rest of the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F U N\n\nUpdate:\nnot so fun anymore with all the bugs,\nso if you play Heretic your experience is a Masochist.\nI have already re-wired my brain to play as a Moron.\n\nI can't imagine the DLCs with all them bugs.\nIf they don't fix their game, says a lot about their DLCs.\nWho the #$R%@#$T wants to pay for a buggy product.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I want to like it, but I keep bouncing off.\n\nThere are tons of stats, and characters can pick from many perks and abilities, but the way it is presented makes it feel overly dense and obtuse. There is A LOT of reading in this game. Not just in the (mostly well written) dialogue, as you may expect in an RPG, but also in the extensive tooltips and lore background. Sadly after the first 30 minutes, nothing is is voiced any more and that feels like a HUGE miss. Overall it's not exactly bad, but if I want to read 40k, I'll rather go for one of the many great novels.\n\nThe characters are quite cool, and it does have a nice and interesting variety of classes, but that sadly doesn't translate well to the combat. While there are a lot of customization options within classes, during combat you generally just keep repeating the same couple of actions. The encounters rarely have interesting setups. It just feels like another X cultists in a hallway. Sometimes there is some environmental interaction, but it's more the occasional gimmick. It gets repetitive quickly.\n\nThe spaceship management is ok, I guess. It feels a bit tacked on but it's fine from what I saw of it.\n\nThere is some really good stuff here, and I hope they will improve upon it in Dark Heresy. Hopefully then we'll finally get a great 40k RPG, as sadly this is not it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It starts strong, but everything after Act 1 it becomes is sooooo boring. The game will routinely waste your time with needless animation in exploration and planet scanning for little bits of nothing. It's fun for a while, but it gets very old, very quick. \r\n\r\nAs for positives, it absolutely nails the aesthetic and has multiple builds that actually work (mostly due to Rogue Trader being a less bloated system than Pathfinder), and offers far more tactical approaches other than \"pre-buff and nuke\". Dedicated tanks are actually a thing. The sounds are also on point for the most part, with the biggest issue being the players own voice. \r\n\r\nSome options are good, but most are terrible. Funnily enough, there are more male voices than Female (6 vs 5), with none of the old Pathfinder voices making a return, which can make finding a voice to matches your character really hard.\r\n\r\nShip battles are terrible. They are slow, they are boring, they don't really allow you be tactical, and you seem to ALWAYS go last regardless of circumstance, and you CAN be attacked on the first turn. This has lead to my ship being in a fairly dire position before I can even do anything. \r\n\r\nSpeaking of not doing anything...my character is going down the heretic path. It's not well structured, it's cartoon  levels of evil. There is no subtlety of Slaanesh, no grand plan of Tzentch. It's very surface level \"Blood for the Blood God\". But worst of all, you have a Sister of Battle and an Inquisitor. Neither really do anything about what you are doing despite saying \"I'm installing a known heretic into a position of power\" or \"In the name of my Dark Master, I will sacrifice your entire colony\". The companions just...don't react, and you are really given any companions that really make a heretical playthrough worth while. There isn't a companion that I've actually really liked. There just...all the same dogmatic \"Imperial Truth\", \"Xeno's should all be murdered\". I miss the grumpy dwarf, or the scheming spider-cat.\r\n\r\nTo fix this, all that is needed would be an option where you could a \"Dogmatic\" approach in \"cleansing heresy\", though in secret you could be offering up their souls to Khorne. It matters not from where the blood flows. Small things like that would help me feel as though my character was actually a heretic.\r\n\r\nAnd the bugs, because it wouldn't be an Owlcat game if the game had fewer bugs than Bethesda.\r\n\r\nIf you are interested, pick it up on heavy discount like I did, but expect the fantasy to wear off very quickly, and hearing things like \"Everything up till the end of Act 3 is fine\" does not inspire confidence.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really wanted to like this game, so much potential, but it's 2025 and doesn't autosave with any meaningful frequency, meaning on harder difficulties you'll end up tediously reading the same dialog, and fighting the same fights you've already done before multiple times. This simple failure to implement a basic common feature absolutely ruins the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Short version:  6/10\nIts like a cake made with some amazing ingredients.... which got served to you half baked.\nI pushed myself to finish it because i love the work they did on the environment, characters and dialogues, but unfortunately the rest just falls flat.\n\nLonger version : \n\nDespite being one of the best renditions of the the 40k world, i'd give the game a 6/10, which is increadibly fustrating since they built such an amazing 40k world \nbut skipped out on the rest of what makes the game fun.\n\nThe game has some awesome quests and characters with interesting back stories and dialogues... All taking place in a very detailed and loving built environment based on 40K lore.\nGame pushes you to make hard choices very much in theme with what you would expect in warhammer, space combat is pretty fun and there is a great variety of stuff to do and places to visit... hell you even get to go to comorragh....\n\nBut its all screwed up by literally everything else in the game.... such as awfully boring and mediocre character levelling / abilities / gear / combat and enemy Ai... \n\n\nThe characters leveling and abilities system is just too boring, to the point that I felt levelling up and picking new abilties was a chore since most of the abilities look like they were written up by an accountant. Imagine levelling up after a long quest and looking forward to learning new awesome exciting abilities, INSTEAD you are presented with a ability that does a whopping extra 7% damage to enemies in cover or bleeding now does an extra 5% damage or getting a bonus 5% damage per point of agility if conditions X Y and Z are met...... it really feels like they grab Tim from accounting to design this stuff.\n\nThe majority of the abilities are so DAMN boring and the same goes for the gear in the game.\n\nits insane that in a lore rich setting like 40k, the devs did not find the time to add a tiny bit of lore fluff to the gear you find, I'd find guns with names like \"Archeotech las rifle\" Or \"Ancient Terran monocle\" but they would have ZERO lore or info on it except that it does +5% accuracy or something equally banale.... They had the whole lore of 40K to pick through and it genuinely feels like they just took only the names of stuff like \"Bolter Lasrifle melta\", you can remove the name/image and drop these items into whatever random scifi game and they would fit right in.\n\nI spent most of the game considering the upgrading my gear or levelling up a necessary chore, I ended up using a guide to just pick whatever they reccomended out of boredome.\n\nThe combat parts of the game are mediocre at best, strategy here is pretty much finding the best chain of abilities for each character to deliver max damage.... then repeating this FOR EVERY DAMN FIGHT IN THE GAME. There is literally no reason to change your strategy since the enemies vary so little in terms of their abilities, just copy paste the exact tactic and its good to go till you finish the game.\n\nThe enemy Ai is Sooooooo bad, they all behave the same except a couple of the Bosses ( only a couple, most of them still fight like some random melee or range minion). Lost count of how many times i've had the enemy spray and kill its own allies by complete accident, they just spray bullets in your general direction and it doesnt even care if most of them will hit their allies, i've even had mini bosses getting themselves killed by their own minions lmao.\n\ni recommend playing on higher difficulties since Normal is just ridiculously simple but that wont fix the Ai's stupidity.\n\nI've seen people complain about bugs and getting locked out of quests or even unable to progress but I have not experienced anything like that to be fair.\n\nBut the game does have weird quirks like showing you an in game cinematic... but stick a random pillar or bit of scenery to block the view, and i couldnt rotate the camera either, i just had to make due with subtitles.\n\nThe game is also very inconsistent when it comes to Voicing the characters,  most of the important bits of chapter one seems voiced, but the rest seems to be random.\nlike you'd get some voiced lines in the middle of some random sidequest on chapter 3.... but the big speech with one of the main NPCs of the game RIGHT before the big finale ? naaaah we dont need ta voice that !\n\nIts not a bad game if you can bear the faults but man it could have soooo much better with only a tiny bit more effort.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "completely wrong listed system requirements, game is very demanding and poorly optimized",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "We tried playing co-op for a little while, but once the game gave up on providing its quality voice acting for the sheer mountains of text that there is between gameplay, Rogue Trader couldn’t hold our attention. I’m also not too fond of the characters here since most everyone has unresolvable, violent, sociopathic, and/or generally dislikable traits. Similarly, the dialogue options that the game gives you match this universe’s ruthless theming, so your input is mostly uncomfortable, political choices over the lesser of many evils. To be fair, the CRPG combat isn’t half bad. Even early on, you can tell that there’s a lot of depth to it. However, it can be slow (especially taking turns with co-op), a little too chance-based, and excessive with buffs/debuffs. While the amount of text-only conversation will likely be a plus for some solo players, silently reading long-winded paragraphs doesn’t mesh well with a co-op playthrough. For that, I cannot recommend our experience with Rogue Trader.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Over a year since release and it's still a bug riddled mess.  The game is great when it works, and I was willing to forgive when it was new, but this far after release and mainline quests just fail to function.  I'm done.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really feel bad... but I just did not enjoy this - I was playing multiplayer and i have never been more bored... :/\n\nHaving only the \"Rogue Trader\" make decisions or open new areas is just the most annoying thing ever. I can understand why this is implemented but it ruins the game play.\n\nYes you can assign someone to be the Rouge Trader, but for each session I play with my friends...? not a multiplayer game in any way shape or form.\n\nALSO character creation for multiplayer is an utter nightmare... you're saying the Rouge Trader (pretty much going to be your host unless assigned) HAS to be created by them, and you cannot take control in any way????????????? I ain't doing all of that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat system is tedious. Walking-around 3d camera is tedious. Seems I always have to rotate it or I will not be able to see down the hallway, or some loot in the corner that is nigh invisible without rotating but wasn't seemingly intended to be hidden. It's like I'm a full time adventurer, part time camera man.\n\nThat said, the story and the dialog and the music and the setting are all very good (and I'm just getting into those elements) and I will continue playing but I would've greatly preferred an old school 2d camera like Ice Wind Dale or countless others where I can just see what I need to see. It's not like there's anything especially interesting to look at.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe great game but still no Polish languages.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, extremely boring game overall as it features far too much encounters in turn-based mode that take ages. If those encounters were tactically interesting, it wouldn't be a problem, but in two acts I didn't find one good fight. Owlcat is far better at designing good combat in real-time than in turn-based. \nAs for the story, well, it's Warhammer so it was sure from the beginning I wouldn't like it. And as the story telling isn't Owlcat strong point either (WotR was quite dull to remain polite; Kingmaker at least had an original setting for its main antagonist), you read useless informations about an uninteresting world because there isn't a proper plot, just a basic mystery. \n\nThe travel and colony systems aren't bad, but those mechanics serve no real purpose overall, they're just flavor element to diversify what you do in front of your screen. Not the best way to counter the boring numerous fights you'll have to go through. \nOn the RP part, I didn't find much, it's far too classical. Too bad a game like Disco Elysium was released to offer proper RP in such games, and devs don't dare to use it while it's a lot better than their usual generic options. \n\nDev' really have to rethink their way to make turn-based games by either making meaningful fights that imply to use your brain at least a little, either diminishing the number of fights there are, either by using a good old tool that exists for decade, the auto-resolve. Those useless fights break immersion far too much. \n\nOne thing is for sure, even if I get Dark Heresy on Humble Bundle, I won't install it, I cannot trust Olwcat on that one. I wait for their other incoming title to see if it's worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great ambiance but didn't enjoy the combat system which felt to me unclear and too complex.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you are really really into isometric turn based RPGs this might be for you, but frankly after 18 hours I don't feel I have progressed much or discovered anything narratively exciting, it is a very slow game and the combat gets quite repetitive as its frequent forced combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game overstays its welcome after act 2, last act being a chore through and through. Additionally, I still experienced bugs in my ending screens after all this time. Frankly, a waste of time and money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game just put me in a no can get out corner, on easy mode, with no healing kits. Kept on having steam at this heretic hideout put flesh wounds on characters, finally found a merchant, unable to get because the profit mechanic has kits at 12 and I am 11... so.. yeah all the time I put in dead, gone, destroyed, wasted, as out of kits and now unable to go on.\r\n\r\nOwlcat, I really wanted to love and see the game through. But, yeah this many hours in, to just flat out get fucked over, on an item like this, fuck it. Discouraged, and feeling like an idiot for having bought the game now.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloated and plainly trying to hard to be something which it fails at.\r\n\r\nYou ave no sense of agency and get no real feel of the remit of a rogue traders life.\r\n\r\nSkills are so hideously bloated trying to make it seem like there is a lot of complexity when it is clear here is not.\r\n\r\nThe \"romances\" are laughably bland along with the cut scenes which seem straight out of the 90s render wise.\r\nAnd as for the colony and planet building?? Terrible.\r\nForced myself to play to see what happens bu got so bored I just googled it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sadly I would love to give this game a positive review, but i've encountered a bug where my game crashes everytime I open the Admech Characters inventory.  Apparently its a known bug and I will happily edit this review if it gets fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Advertises steam workshop support despite removing it nearly a year ago",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "\"Hmmm I want to sit through 80+ hours of young adult novel tier writing, and maybe some romance written by a virgin\" \n\nsaid no one but the unfathomably insane",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Could be fun - if I didn't get stuck every 1/2 hour with some barely explained quest telling my I can't proceed until I do the thing they barely explain. Just let me play the damn game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Recent update wrecked Carnival of Misery, a DLC class ult. Like..... why.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constant bugs causing me to restart missions, doors not opening, NPC's not moving after dialogue.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Only a few hours in but I can already feel I will get bored of this game quickly\n\nGraphics are from 2010, but somehow pushing my laptop to its limit. \n\nBoth the combat and exploration feels underwhelming coming from Baldur's Gate 3, I'm not sure how to explain it but it just feels completely unpolished and boring. \n\nWould have been great in 2010, but I expected more from a game released in 2023.\n\nUpdate: I really tried to force myself to play it until the end of the prologue, but it was simply too boring and bland to continue, I uninstalled the game. Waste of money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Clunky and buggy mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sanctum made me want to shoot myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm probably playing it wrong",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes too many times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Look, I have been a fan of 40k since the 1980s. I'm an old man who loves the very beginning of 40k. I was there. Owlcat is my favorite roleplay compy developer by far. They are the best for compy RPG. But this situation with the multiplayer server desync and crashing is unforgivable. If you are going to do multiplayer why after more than a year is this still broken? It makes me not trust owlcat anymore after kingmaker after wrath after rogue trader. I think I can't anymore. It makes me sad after I tried hundreds upon hundred of hours of gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Owlcat does some amazing games with deep rich lore and characters.  Writing is top-notch and makes you want to explore the depths of the world you are playing in.\n\nHowever, this game is handicapped by the slog game play.  Too many skills, most all of them unfun or pointless.  Combat is either too easy or stupid hard with no in between.  Maps are huge and if you take time to look for everything and loot this will turn into a 300 hour game easily.  \n\nI will not post a review on anything spoiling any game story, play or mechanics but know that for every amazing or fun thing to do there will be 3 bland or bad things to make up for it.",
      "voted_up": false,
      "votes_helpful": 52
    },
    {
      "review": "lore-wise it's great, but combat gets boring and the gameplay is very repetitive",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "Wait to buy this game until they release a complete version. I spent 60 hours, having great fun. But then they add new stuff to earlier acts (not DLC) and mess with builds through balancing. It's a hefty RPG system and when they balance stuff you have to relearn the rules and either respec everyone in the party or start a new game. It's honestly frustrating and punishing for someone who just got the feel for it. And it sucks because it is a good game. \n\nWorst part is, I don't know if they will re-balance things again. I honestly recommend waiting until they have a finished version.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "That's the yellow yes and no thumb.\r\n\r\nI quit at Uralon The Cruel. \r\n\r\nFrom what I gather online, there are two kind of players, some that went into ROGUE TRADER like its a classical TRPG (Fire Emblem and the likes), did pretty well then found out at ACT 4 that they \"weren't playing the game right\". The rest either spent hours reading stat spreadsheets, or downright copied what they saw online, built insane broken characters and cheesed the game. \r\n\r\nA short comment on difficulty and game design. I just beat Nine Sols. Nine Sols is \"Sekiro hard\". Nine Sols has one of the most demented last boss fight I've ever seen in a video game. But by the time you get to this point, you've mastered each and every gameplay aspect and you're equiped for the challenge.\r\n\r\nRT's end game is rubbish. You can't be a hundred hours in and suddenly learn, out of the blue, that you're playing it wrong. That's just bad game design, even if part of the community wants to gaslight you into believing that it's not.\r\n\r\nI was invested in the game until then. I even found some enjoyment in those somewhat dull Ship Fights. The whole \"trading\" and colony management thing feels like an afterthought. The story is neat even if it's a bit of lore dump. \r\n\r\nWhether you'll appreciate the game depends on how much you'll tolerate the frustrating final acts and that god awful UI.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "An excellent interpretation of the TTRPG system. A great story and a suspenseful plot. Gameplay is polished, mechanics are fine and the 40k world that they are showing us is great BUT...\n\nits almost 2 years after release and the game is a buggy mess, constant error logging. Game is using same old unity engine used in kingmaker. Weird visual glitches and progression locking/ game breaking glitches. Like infinite loading screens. Also no way of communicating and trying to resolve them with the devs, did not respond to a single bug report. Game needs A LOT more time to be in a solid state from a technical point of view. \n\nWait for some 10$ sale and give it a try",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Too heavy handed with patches.  Reinventing certain classes while still keeping progression/understanding of ability synergies  vague and confusing keeps me from touching this game for a second run.  Can't recommend in this state.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Still some bugged quests and dodgy game mechanics that sometimes stop you from progressing the main story. I was really enjoying it until starting Chapter 3 with no navigator points. I have spent hours trying to trigger the rare events that give you the required navigator points but no joy. Pretty poor design.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "The game is really, really good, from a mechanical, story, and visual perspective. However, it's bogged down by an unacceptable amount of bugs, and a series of completely baffling UI decisions. Leaving a review mostly because i'm frustrated at how good this game could be. \n\nExamples:\n- No training grounds to test your builds\n- Contradictory or sometimes missing information about key abilities (especially the overseer archetype), though it's hard to tell if this is because of bugs or a lack of clarity.\n- Respeccing is expensive, which is especially annoying given no way to test abilities without locking them in.\n- No way to see other potential skill trees before you've committed to respeccing.\n- Upgraded abilities don't tell you that they're upgraded or what the effects of the upgrade are. For that you have to look at your characters talents, of which those who are upgrades make no effort to distinguish themselves from the other 30 talents your character has, meaning you have to remember the two or three additional effects all of your abilities will have by the end of the game.\n\nIf all of this was fixed, this game would easily surpass BG3 for me, as the best cRPG i've ever played. If you're in it for the story i'd still recommend it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "*Sigh*\nSame story since Kingmaker, Owlcat starts amazingly strong and then begins huffing gas or something. \nStrong classes, great synergies, decent storytelling and engaging companions. And then we start with the DLCs and everything falls apart. Each new update revises and revises and revises mechanics and play-styles into a gray goo. Total slop where new DLC classes, origins or any other gimmick has to shine so we just hammer the previous ones into oblivion. Ad infinitum, or at least until the new project grabs people's attention. \n\nOwlcat games should be played once at ~1 year after release so that major issues are solved and then shelved forever. If trying to play after 2 or 3 years it just feels convoluted, messy and disjoined by all the Frankenstein patching (also looking at you WotR, you absolute disappointment)",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "The intro few hours was great, good voice acting, great story, really compelling. Once that is over the voice acting vanishes, replaced with endless walls of text, the quality dips heavily and the game is significantly less compelling.  \n\nFeels like they ran out of funding after the intro. Very inconsistent game which really ruins what otherwise is a pretty interesting idea.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "A well designed game should feature a series of gradually escalating challenges, with regular checks to make sure you are mastering the various mechanics and game systems, culminating in a final test that puts it all together.\r\n\r\nRogue Trader is, unfortunately, not a well designed game.\r\n\r\nThat is not to say it is not a [i]fun[/i] game. But the developers have created such a poorly balanced system that they are unable to create meaningful challenges without ignoring or negating game mechanics, and the final series of bosses does not test the player's mastery over the tactical gameplay, but instead how broken their character builds are. If you are not able to put out several [b]thousand[/b] points of damage in a single round (a damage check that is not seen [i]anywhere else in the game[/i]) then you will find yourself stuck with your only recourse being to reload a save from several hours prior and respec your entire team.\r\n\r\nIf you're fine with an experience that is 90% enjoyable but completely shits the bed in the last 10% (or, are a Warhammer fan and are used to dealing with a product that is compromised in some way) then I think you will probably find this game to be worth it, but I can't say it is a product I would [i]recommend[/i].",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Multiplayer is plagued with constant desyncs. Dev's have said nothing on it so they are just tricking people with the \"Online Coop\" tag when it can take 30 min to do a single round\n\nWill change review when desyncs are finally addressed.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "i love this game but even with toybox mod this game breaks so many time and the ending keeps breaking even when you do all the steps fot the nomos ending it breaks so much and you cant fix it with the mod",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If waiting for the AI to finish its turn is considered fun, this game is what you want. Conversation? Waves of combat. Furthering the story? Waves of combat. Exploring new sectors? Waves of combat. Waves of combat? Waves of combat. \n\nMost of these encounters are generally no name minions with no impact on the story. The combat is great, from the feeling of landing hits to the strategy of building your team. Enemy variety is great, so I've no idea why they chose to stick you in combat every five minutes. It's almost as if they were so proud to have crafted such a system that it'd be a shame to not be in combat for a single moment. \n\nMuch of the story becomes characters talking at you through walls of text instead of actual conversations, as if you were reading a book instead of playing a roleplaying game. Some people who are already into the universe may enjoy this type of storytelling, but I certainly do not. Characters are good enough, with some GREAT twists, and some of the side quests are masterfully crafted. \n\nSound is great, from the firing of a bolter to the soundtrack that makes me consider falling to my knees to praise the Omnissiah.  The atmosphere is fantastic, from Nurgle Nurgling to vistas vistasing. \n\nOverall, a great game, for reasons others have already gushed over. I do feel like this game was meant solely for WH40K fan, and I'm sure that they all enjoy this. But cut out half the combat and my enjoyment of the game would probably increase considerably. And I give this game a negative PURELY out of my absolute hatred of the never ending combat. \n\nTL;DR Game is great but there is far too much repetitive combat. Played on 1.4.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "This game was sold as a cooperative game, but this is a lie. While act 1 is somewhat playable co-op, the second player will frequently be left behind. This happens for the first time during the games first morality check, which will always leave player 2 behind unpassable barriers. This will keep happening. Depending on your group composition (officers and cassia are biggest offenders) you might be able to make it almost halfway through act 1 before the real problem begins to show its head, the deadly desync.\r\n\r\nThis game desyncs constantly. The inbuilt pauses to warn you of traps or found loot will desync you. Any sort of extra turn action in combat will desync you. Most aoe has a reasonable chance of desync. Reloading from said desync also takes far too long. Each time you must redownload the save file, which will slowly increase in size, and download incredibly slowly. 6mb saves take upwards of 30 seconds, then you have to load the game again, which takes a bit as well. Now, a minute or two load time seems not so bad, but then you realize this will start happening more and more frequently. By act 2, expect 1 desync a round. Expect this to balloon to 2 or 3 a round by act 4. This review will stay negative until the devs fix anything beyond act 1 or show any gameplay beyond act 1, since thats all they are willing to refine. This isn't early access.\r\n\r\nAs for the rest of the game, its passable. Dialogue is fine, if a bit convoluted. One of the worst games for \"thats not what I wanted\", which might be a translation issue, but I've played other non-english rpgs and they aren't usually this bad. Characters are surprisingly good, if a touch one note. Navigating the game isn't great, tons and tons of loading screens, lots of them pointless. Its maybe a quarter voiced, which is neat, but leaves other parts particularly wanting for it. \r\n\r\nIf you are playing it solo, it gets a 3/5. Not the usual 40k shovelware, but still feels about 20 years behind on game design. Closest cousin is Kotor era rpgs. Its like a really mid version of that.\r\n\r\nIf you are playing co-op, it gets a 1/5, and that one point is for how much less busy work there is to do by splitting up half the cast's level ups and equipment on someone else. It is shovelware and mostly non-functioning.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This game was an 8-9/10 for me. The gameplay is fun, but I wish it was fully voice-acted. For 60 hours, I did all the side quests I could find, resolved rumors, and thoroughly enjoyed my first playthrough, even on the Unfair difficulty. I had a great time... until Chapter 3.\r\n\r\nThis chapter alone can completely break the experience, and I hope whoever designed it is no longer with the company.\r\n\r\nWithout spoiling why or the specific setting, that chapter locks you in with zero gear and two random companions. In my playthrough, these were two other sniper builds, and my main character was also a sniper build. They only give you two base-level snipers, meaning I had to kill a boss and eight other enemies while being surrounded and within range of all those mobs from turn one naked. The boss alone has 500+ HP. No matter what I tried, I couldn't even reach a second round; I just got swarmed and defeated immediately. to give you a pespective in term of damage, If all my character were critical hitting that boss every time, it would take at the very least 2 or 3 turn to kill that boss alone. \r\n\r\nI looked at a guide and saw that other players received different companions. If I could choose my tank, I would have a chance, but nope—it's random. \r\n\r\nThe first thing that comes to mind is: \"Well, respec.\" However, you lose the ability to respec for the entire chapter. So, unless you are very lucky and get your tank among the companions you receive first, you will have to drop the difficulty. I did, and I lost all interest in the game as a result.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Massively not for me.\n\nMechanically opaque.\n\nExpositionally dense.\n\nI find the game, past about Act 2, seems to devolve into a disjointed series of increasingly unbalanced combat encounters, with minimal payoff. These encounters are alternately massive boss/miniboss fights with hundreds of HP and massive damage output, or absolute stomps with tissue-paper enemies. Not much in between. The combat system is...not the best, and certainly not good enough to stand up to being shoved in the player's face every 30 seconds for 5-6 hours of the game's plot at a stretch. Add to this the incremental and often undecipherable 'bonuses' you get from leveling up, and the constant stream of identical, mostly trash loot, and it doesn't even offer much reward for your toil here.\n\nThe story is a convoluted ball of plot threads punctuated and slowed down further by navigating the huge difficulty spikes, and I felt like understanding my moment-to-moment motivations was a rarity in the latter half of the game. All in all, Acts 1 and 2 had me unable to put it down, Act 3 and beyond had me feeling reluctant to pick it up. Eventually I've just sort of come to the realization that I don't care anymore, and it's not worth my time to keep forcing myself through tedious combat after tedious combat to get the story resolution I felt owed. I'm at the point of just uninstalling and writing it off. Maybe reading the endings if it matters.\n\nI understand that I'm about 1-2 hours from where the plotlines *start* to come together into a coherent narrative - but I've been so put off by how onerous getting to this point has become, how unfriendly and obstructive its entire design philosophy seems to be, that I just don't care anymore.\n\nI buy myself roughly 1 new game per quarter. I can usually tell within the refund window whether I will like it or not. Unfortunately, this time it was only very late in the game that I began to feel it was overstaying its welcome and exhausting to interact with. So that's this quarter's game down the drain for me. It is rare that I'd say I actively hate a game, and it's even rarer for it to be one that's generally loved (looking at you, Souls games), and it's *almost unheard of* for it to be a part of a franchise I generally adore (in fact I can't think of any other examples), but this one's on that list, unfortunately.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I cannot fathom why players like this trash. Its combat system is dreadful. Line of sight rules must have been programmed by a blind man. Its unit turn sequence is arbitrary and frankly dumb. Its rpg elements are strictly for the die hard fans.  A grave disappointment",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "if they fix the game crashing bugs, and I will change my review.  the game itself is fun(except the walls of texts sometimes), but it has so many bugs.  stat calculations failing, veil degradation fails, sometimes the enemies just stand around skipping their turns, but the most annoying is the game crashing bug when opening the inventory.  sometimes power weapon visuals cause this, other times buff visuals.  I noticed that other owlcat games sorta have optimization issues with their graphics.  at the very least they could give us an option to turn off electrical weapon visuals in \"appearance\" like they do with helmets and backpacks.  I use amd rx 6500.  so if you use AMD, you might wanna think twice before getting the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The space navigation aspect of the game just ruined it for me.  Flight combat was annoying, but what really killed it was the warp navigation.  Ran out of navigator's insight and couldn't regenerate it without unexplored content, so I couldn't get to events I needed to get to before the time for them to pass expired.  This is a tiny bit of chapter 1 and even early chapter 2, but it becomes a bigger and bigger part of the game to where I just couldn't put up with it any more.  Such a shame because I loved the rest of the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F U N\n\nUpdate:\nnot so fun anymore with all the bugs,\nso if you play Heretic your experience is a Masochist.\nI have already re-wired my brain to play as a Moron.\n\nI can't imagine the DLCs with all them bugs.\nIf they don't fix their game, says a lot about their DLCs.\nWho the #$R%@#$T wants to pay for a buggy product.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Let e just start by saying I've played a lot of Top Down Turn Based RPG from Tyranny, to Torment, from BG3, to ones that I can barely remember in the classic D&D genre. Rogue Trader is a game that if you are familiar with 40K, you will probably really enjoy, but for me it was a swing and a miss. I loved Space marines as a kid, but never really grew into the lore, etc.\r\n\r\nIf you are expecting BG3 levels of chracter connection, it's nowhere near the mark. There's barely any romance in this which always felt like a bonus in other games of similar style. Instead you have a world that if it's unfamiliar will force you to try and remember complex character names, and titles. Read through endless dialogue that just doesn't feel natural or relatable.\r\n\r\nIt felt more like a slog, than an immersive experience. Instead of starting you off with a nobody, you are almost immediately thrust into one of the most powerful positions in the game, and the trade off is you often don't feel like you care about the development of the character you are playing. Also, if you are expecting a trade game, it's not that either as there's no money system.\r\n\r\nIn comparison to the majority of titles out there, it's not geared towards new players, it has a completely disjointed way of playing, and although more interesting than a lot of others, it doesn't hit the mark for me. I can see why it would for others though.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It starts strong, but everything after Act 1 it becomes is sooooo boring. The game will routinely waste your time with needless animation in exploration and planet scanning for little bits of nothing. It's fun for a while, but it gets very old, very quick. \r\n\r\nAs for positives, it absolutely nails the aesthetic and has multiple builds that actually work (mostly due to Rogue Trader being a less bloated system than Pathfinder), and offers far more tactical approaches other than \"pre-buff and nuke\". Dedicated tanks are actually a thing. The sounds are also on point for the most part, with the biggest issue being the players own voice. \r\n\r\nSome options are good, but most are terrible. Funnily enough, there are more male voices than Female (6 vs 5), with none of the old Pathfinder voices making a return, which can make finding a voice to matches your character really hard.\r\n\r\nShip battles are terrible. They are slow, they are boring, they don't really allow you be tactical, and you seem to ALWAYS go last regardless of circumstance, and you CAN be attacked on the first turn. This has lead to my ship being in a fairly dire position before I can even do anything. \r\n\r\nSpeaking of not doing anything...my character is going down the heretic path. It's not well structured, it's cartoon  levels of evil. There is no subtlety of Slaanesh, no grand plan of Tzentch. It's very surface level \"Blood for the Blood God\". But worst of all, you have a Sister of Battle and an Inquisitor. Neither really do anything about what you are doing despite saying \"I'm installing a known heretic into a position of power\" or \"In the name of my Dark Master, I will sacrifice your entire colony\". The companions just...don't react, and you are really given any companions that really make a heretical playthrough worth while. There isn't a companion that I've actually really liked. There just...all the same dogmatic \"Imperial Truth\", \"Xeno's should all be murdered\". I miss the grumpy dwarf, or the scheming spider-cat.\r\n\r\nTo fix this, all that is needed would be an option where you could a \"Dogmatic\" approach in \"cleansing heresy\", though in secret you could be offering up their souls to Khorne. It matters not from where the blood flows. Small things like that would help me feel as though my character was actually a heretic.\r\n\r\nAnd the bugs, because it wouldn't be an Owlcat game if the game had fewer bugs than Bethesda.\r\n\r\nIf you are interested, pick it up on heavy discount like I did, but expect the fantasy to wear off very quickly, and hearing things like \"Everything up till the end of Act 3 is fine\" does not inspire confidence.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Really wanted to like this game, so much potential, but it's 2025 and doesn't autosave with any meaningful frequency, meaning on harder difficulties you'll end up tediously reading the same dialog, and fighting the same fights you've already done before multiple times. This simple failure to implement a basic common feature absolutely ruins the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Short version:  6/10\nIts like a cake made with some amazing ingredients.... which got served to you half baked.\nI pushed myself to finish it because i love the work they did on the environment, characters and dialogues, but unfortunately the rest just falls flat.\n\nLonger version : \n\nDespite being one of the best renditions of the the 40k world, i'd give the game a 6/10, which is increadibly fustrating since they built such an amazing 40k world \nbut skipped out on the rest of what makes the game fun.\n\nThe game has some awesome quests and characters with interesting back stories and dialogues... All taking place in a very detailed and loving built environment based on 40K lore.\nGame pushes you to make hard choices very much in theme with what you would expect in warhammer, space combat is pretty fun and there is a great variety of stuff to do and places to visit... hell you even get to go to comorragh....\n\nBut its all screwed up by literally everything else in the game.... such as awfully boring and mediocre character levelling / abilities / gear / combat and enemy Ai... \n\n\nThe characters leveling and abilities system is just too boring, to the point that I felt levelling up and picking new abilties was a chore since most of the abilities look like they were written up by an accountant. Imagine levelling up after a long quest and looking forward to learning new awesome exciting abilities, INSTEAD you are presented with a ability that does a whopping extra 7% damage to enemies in cover or bleeding now does an extra 5% damage or getting a bonus 5% damage per point of agility if conditions X Y and Z are met...... it really feels like they grab Tim from accounting to design this stuff.\n\nThe majority of the abilities are so DAMN boring and the same goes for the gear in the game.\n\nits insane that in a lore rich setting like 40k, the devs did not find the time to add a tiny bit of lore fluff to the gear you find, I'd find guns with names like \"Archeotech las rifle\" Or \"Ancient Terran monocle\" but they would have ZERO lore or info on it except that it does +5% accuracy or something equally banale.... They had the whole lore of 40K to pick through and it genuinely feels like they just took only the names of stuff like \"Bolter Lasrifle melta\", you can remove the name/image and drop these items into whatever random scifi game and they would fit right in.\n\nI spent most of the game considering the upgrading my gear or levelling up a necessary chore, I ended up using a guide to just pick whatever they reccomended out of boredome.\n\nThe combat parts of the game are mediocre at best, strategy here is pretty much finding the best chain of abilities for each character to deliver max damage.... then repeating this FOR EVERY DAMN FIGHT IN THE GAME. There is literally no reason to change your strategy since the enemies vary so little in terms of their abilities, just copy paste the exact tactic and its good to go till you finish the game.\n\nThe enemy Ai is Sooooooo bad, they all behave the same except a couple of the Bosses ( only a couple, most of them still fight like some random melee or range minion). Lost count of how many times i've had the enemy spray and kill its own allies by complete accident, they just spray bullets in your general direction and it doesnt even care if most of them will hit their allies, i've even had mini bosses getting themselves killed by their own minions lmao.\n\ni recommend playing on higher difficulties since Normal is just ridiculously simple but that wont fix the Ai's stupidity.\n\nI've seen people complain about bugs and getting locked out of quests or even unable to progress but I have not experienced anything like that to be fair.\n\nBut the game does have weird quirks like showing you an in game cinematic... but stick a random pillar or bit of scenery to block the view, and i couldnt rotate the camera either, i just had to make due with subtitles.\n\nThe game is also very inconsistent when it comes to Voicing the characters,  most of the important bits of chapter one seems voiced, but the rest seems to be random.\nlike you'd get some voiced lines in the middle of some random sidequest on chapter 3.... but the big speech with one of the main NPCs of the game RIGHT before the big finale ? naaaah we dont need ta voice that !\n\nIts not a bad game if you can bear the faults but man it could have soooo much better with only a tiny bit more effort.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "completely wrong listed system requirements, game is very demanding and poorly optimized",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "We tried playing co-op for a little while, but once the game gave up on providing its quality voice acting for the sheer mountains of text that there is between gameplay, Rogue Trader couldn’t hold our attention. I’m also not too fond of the characters here since most everyone has unresolvable, violent, sociopathic, and/or generally dislikable traits. Similarly, the dialogue options that the game gives you match this universe’s ruthless theming, so your input is mostly uncomfortable, political choices over the lesser of many evils. To be fair, the CRPG combat isn’t half bad. Even early on, you can tell that there’s a lot of depth to it. However, it can be slow (especially taking turns with co-op), a little too chance-based, and excessive with buffs/debuffs. While the amount of text-only conversation will likely be a plus for some solo players, silently reading long-winded paragraphs doesn’t mesh well with a co-op playthrough. For that, I cannot recommend our experience with Rogue Trader.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Over a year since release and it's still a bug riddled mess.  The game is great when it works, and I was willing to forgive when it was new, but this far after release and mainline quests just fail to function.  I'm done.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I really feel bad... but I just did not enjoy this - I was playing multiplayer and i have never been more bored... :/\n\nHaving only the \"Rogue Trader\" make decisions or open new areas is just the most annoying thing ever. I can understand why this is implemented but it ruins the game play.\n\nYes you can assign someone to be the Rouge Trader, but for each session I play with my friends...? not a multiplayer game in any way shape or form.\n\nALSO character creation for multiplayer is an utter nightmare... you're saying the Rouge Trader (pretty much going to be your host unless assigned) HAS to be created by them, and you cannot take control in any way????????????? I ain't doing all of that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Combat system is tedious. Walking-around 3d camera is tedious. Seems I always have to rotate it or I will not be able to see down the hallway, or some loot in the corner that is nigh invisible without rotating but wasn't seemingly intended to be hidden. It's like I'm a full time adventurer, part time camera man.\n\nThat said, the story and the dialog and the music and the setting are all very good (and I'm just getting into those elements) and I will continue playing but I would've greatly preferred an old school 2d camera like Ice Wind Dale or countless others where I can just see what I need to see. It's not like there's anything especially interesting to look at.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Maybe great game but still no Polish languages.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, extremely boring game overall as it features far too much encounters in turn-based mode that take ages. If those encounters were tactically interesting, it wouldn't be a problem, but in two acts I didn't find one good fight. Owlcat is far better at designing good combat in real-time than in turn-based. \nAs for the story, well, it's Warhammer so it was sure from the beginning I wouldn't like it. And as the story telling isn't Owlcat strong point either (WotR was quite dull to remain polite; Kingmaker at least had an original setting for its main antagonist), you read useless informations about an uninteresting world because there isn't a proper plot, just a basic mystery. \n\nThe travel and colony systems aren't bad, but those mechanics serve no real purpose overall, they're just flavor element to diversify what you do in front of your screen. Not the best way to counter the boring numerous fights you'll have to go through. \nOn the RP part, I didn't find much, it's far too classical. Too bad a game like Disco Elysium was released to offer proper RP in such games, and devs don't dare to use it while it's a lot better than their usual generic options. \n\nDev' really have to rethink their way to make turn-based games by either making meaningful fights that imply to use your brain at least a little, either diminishing the number of fights there are, either by using a good old tool that exists for decade, the auto-resolve. Those useless fights break immersion far too much. \n\nOne thing is for sure, even if I get Dark Heresy on Humble Bundle, I won't install it, I cannot trust Olwcat on that one. I wait for their other incoming title to see if it's worth it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Great ambiance but didn't enjoy the combat system which felt to me unclear and too complex.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Man I just can't do all this combat, what the hell. I was doing okay until I got to act 3 and then the whole game fell apart for me, and it took so damn long to get here. Got into a stretch which was a bad combat followed by a bad combat followed by a bad combat followed by a fake-out cutscene into another bad combat and I'm like fuck this.\r\n\r\nThe combat is fun in moderate doses, but it's straight up broken/unbalanced, so in practice the game is just about mowing down the bad guys with your stupidly overpowered character/equipment combos. Which again, is fine in small doses, but this game does not give you combat in small doses.\r\n\r\nStory stuff is okay, but I can think of a bunch of recent games that do this same sort of reactivity pseudo-D&D type thing better and with fewer bugs. There's a lot of good stuff going on in this game but it's just so much effort for small rewards. It's a slog. In truth it's more like a 3/5 game than a bad game, but Steam doesn't let you vote that way so here goes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If you are really really into isometric turn based RPGs this might be for you, but frankly after 18 hours I don't feel I have progressed much or discovered anything narratively exciting, it is a very slow game and the combat gets quite repetitive as its frequent forced combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So. I like Rogue Trader and I like WH40K. I'm no expert on the lore for sure, but I consider myself a casual fan. I bought this to play it on the Steam Deck. It's much better for me on a proper PC, however it plays okay on Steam Deck.\n\nAfter a couple of initial attempts at a playthrough, I have some thoughts.\n\nThe story and the set up seems fantastic. I know it's an older game than Space Marine II, but the trappings and the dressing of WH40K seem great. Maybe not top notch like the aforementioned game, but it's great. And the storyline, while it doesn't maybe cleave to exactly what I know of the Koronus Expanse from the TTRPG, it seems similar.\n\nThe difficulty seems really uneven. The first time I played through, a major encounter early in the game just destroyed my characters. Maybe I didn't know what I was doing, but it was not a good experience. Trying again on the lowest difficulty, however, and it was far too easy. Can't please everyone, I guess. I did love the feel of some of the more powerful weapons that cameo early in the game, and the Adepta Sororitas' Bolter, the sound and the heavy punch when it hit was a great feeling.\n\nAnyway, the main thing the combat is missing, IMO, is Overwatch as a standard move. Maybe I played too much XCOM2 before I jumped back into this game, but its absence was supremely notable to me.\n\nA lot of the voice acting (when it's there) is good, possibly great. I love Idira's actor, she was scene-chewing, but she knocked it out of the park for me. I didn't like that some seemingly major characters were just missing portraits entirely, or voice. And periodically the voice lines just disappear. What's up with that? Makes it feel really uneven.\n\nMy second rage uninstall was when I got to a puzzle where a Tech-Priest party member kept chastising me for not doing a tech ritual right. I was like, why isn't he doing it, then? The instructions for it are intentionally vague, I'm sure, but I tried to look at the situation and figure it out and it was super obtuse to me. Irritating. That coupled with the middling combat, though the progression on the easiest difficulty was fine (I was levelling up and getting new silly abilities regularly, which was fine).\n\nI really wanted to like this game, but... and this could be I'm finding I'm not liking that many experiences lately, it was all a bit meh. I feel bad for saying that, as I know how hard people work on these games, but yeah, not worth my time and I wish I could get my money back.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The game overstays its welcome after act 2, last act being a chore through and through. Additionally, I still experienced bugs in my ending screens after all this time. Frankly, a waste of time and money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "You are always outnumbered and have insufficient gear. Everything has an option to change or can be interacted with, but very little is actually relevant to play. If you go into a fight that you can't win, you typically lose an hour of progress or more trying to find where you're \"supposed\" to go. This game suffers from the same problems as most isometric RPGs - too much choice with no real consequence, frequent bugs that ruin game play or your ability to save, and an inability to leave a scene if you can't pass it. That, plus the \"everything sucks\" atmosphere of 40k. I regret that it took six hours of game play to learn all this, because now I can't get a refund. Using a controller is possible, but not intuitive.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "until owlcat stopp forcign bad minigames down our throat, thsi  game is  not recomended. it now needs cheat mods to skip the bad ship combat.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bloated and plainly trying to hard to be something which it fails at.\r\n\r\nYou ave no sense of agency and get no real feel of the remit of a rogue traders life.\r\n\r\nSkills are so hideously bloated trying to make it seem like there is a lot of complexity when it is clear here is not.\r\n\r\nThe \"romances\" are laughably bland along with the cut scenes which seem straight out of the 90s render wise.\r\nAnd as for the colony and planet building?? Terrible.\r\nForced myself to play to see what happens bu got so bored I just googled it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "You're given massive lore questions, then expect to answer with 6 massive lore answers to choose from.  f this, not for me.  You have to be a WarHammer 40000 genius to know what's going on to play this game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Endless dialogues. I can not do a step without 30mins of dialogues.\nIs it a computer game or a book?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Sadly I would love to give this game a positive review, but i've encountered a bug where my game crashes everytime I open the Admech Characters inventory.  Apparently its a known bug and I will happily edit this review if it gets fixed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All I've been doing is fighting ridiculous little squabbles on the ship. I've done no trading. I am not impressed. 15 dollar game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Advertises steam workshop support despite removing it nearly a year ago",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The mechanic descriptions are inconsistent and often incorrect, and beyond that, you find abilities frequently not working at all in combat due to bugs. This is made all the more intolerable by the annoying companion dialogue lines. The combat doesn't offer a challenge to those familiar with the genre due to how easy it is to make a broken character.\n\nTraveling on the map makes the same handful of random encounters repeat over and over which quickly becomes tedious, especially with how slow animations and large quantities of enemies drag the encounter out. Few long distance warp jumps can make travel difficult with the map being criss-crossed by faded out squiggly red warp routes.\n\nThe player only has a limited quantity of lockpicks, explosives  and other items required to access containers and areas of the world map. Somehow, with all the resources of a rogue trader, buying more melta charges is out of the realm of possibility. This can lock the player out of content if they are careless with the consumables.\n\nThe story is okay. The highlight of the game is its sound design. Under all the issues there is a good game. At the time of writing, playing this game in multiplayer leads to more time spent in loading screens than in combat due to how frequent desyncs are.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Hmmm I want to sit through 80+ hours of young adult novel tier writing, and maybe some romance written by a virgin\" \n\nsaid no one but the unfathomably insane",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In the 1.5 update, Owlcat has, in an attempt to \"fix\" the Commissar background, essentially decided that the only way to play a character with a Commissar origin is as an \"evil\" character.\n\nThe main feature of the Commissar background now requires you to shoot your allies (party members or NPCs), with the strongest effect triggered when you actually kill the targeted ally.\n\nThis change makes it practically impossible to play anything other than an \"evil\" Commissar. From a role-playing perspective, it also feels completely absurd that your companions neither react to nor comment on your psychopath character who keeps shooting everyone in the back for buffs — even when this behavior clearly contradicts their personalities.\n\nInstead of \"fixing\" the Commissar background in this way, Owlcat should have made the new mechanic optional, left the original version intact, or implemented a more balanced solution that supports different playstyles.\n\nSince I played as an Commisar (not \"evil\", not psychopath), I have no interest in continuing this playthrough. I am also not interested in starting a new one. Therefore a thumbs down\n\nIf someone has a strong dislike of the Cain / Gaunt Novels and is interested in an evil, psychopath commissar playthrough, this could be considered a recommendation.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Recent update wrecked Carnival of Misery, a DLC class ult. Like..... why.....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "constant bugs causing me to restart missions, doors not opening, NPC's not moving after dialogue.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Only a few hours in but I can already feel I will get bored of this game quickly\n\nGraphics are from 2010, but somehow pushing my laptop to its limit. \n\nBoth the combat and exploration feels underwhelming coming from Baldur's Gate 3, I'm not sure how to explain it but it just feels completely unpolished and boring. \n\nWould have been great in 2010, but I expected more from a game released in 2023.\n\nUpdate: I really tried to force myself to play it until the end of the prologue, but it was simply too boring and bland to continue, I uninstalled the game. Waste of money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Clunky and buggy mess.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "zzzzzzzzzzzzzzzzz  fell asleep within 20 mins, boring af",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Sanctum made me want to shoot myself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm probably playing it wrong",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes too many times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Look, I have been a fan of 40k since the 1980s. I'm an old man who loves the very beginning of 40k. I was there. Owlcat is my favorite roleplay compy developer by far. They are the best for compy RPG. But this situation with the multiplayer server desync and crashing is unforgivable. If you are going to do multiplayer why after more than a year is this still broken? It makes me not trust owlcat anymore after kingmaker after wrath after rogue trader. I think I can't anymore. It makes me sad after I tried hundreds upon hundred of hours of gameplay.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "lore-wise it's great, but combat gets boring and the gameplay is very repetitive",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "If waiting for the AI to finish its turn is considered fun, this game is what you want. Conversation? Waves of combat. Furthering the story? Waves of combat. Exploring new sectors? Waves of combat. Waves of combat? Waves of combat. \n\nMost of these encounters are generally no name minions with no impact on the story. The combat is great, from the feeling of landing hits to the strategy of building your team. Enemy variety is great, so I've no idea why they chose to stick you in combat every five minutes. It's almost as if they were so proud to have crafted such a system that it'd be a shame to not be in combat for a single moment. \n\nMuch of the story becomes characters talking at you through walls of text instead of actual conversations, as if you were reading a book instead of playing a roleplaying game. Some people who are already into the universe may enjoy this type of storytelling, but I certainly do not. Characters are good enough, with some GREAT twists, and some of the side quests are masterfully crafted. \n\nSound is great, from the firing of a bolter to the soundtrack that makes me consider falling to my knees to praise the Omnissiah.  The atmosphere is fantastic, from Nurgle Nurgling to vistas vistasing. \n\nOverall, a great game, for reasons others have already gushed over. I do feel like this game was meant solely for WH40K fan, and I'm sure that they all enjoy this. But cut out half the combat and my enjoyment of the game would probably increase considerably. And I give this game a negative PURELY out of my absolute hatred of the never ending combat. \n\nTL;DR Game is great but there is far too much repetitive combat. Played on 1.4.",
      "voted_up": false,
      "votes_helpful": 21
    },
    {
      "review": "Wait to buy this game until they release a complete version. I spent 60 hours, having great fun. But then they add new stuff to earlier acts (not DLC) and mess with builds through balancing. It's a hefty RPG system and when they balance stuff you have to relearn the rules and either respec everyone in the party or start a new game. It's honestly frustrating and punishing for someone who just got the feel for it. And it sucks because it is a good game. \n\nWorst part is, I don't know if they will re-balance things again. I honestly recommend waiting until they have a finished version.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "That's the yellow yes and no thumb.\r\n\r\nI quit at Uralon The Cruel. \r\n\r\nFrom what I gather online, there are two kind of players, some that went into ROGUE TRADER like its a classical TRPG (Fire Emblem and the likes), did pretty well then found out at ACT 4 that they \"weren't playing the game right\". The rest either spent hours reading stat spreadsheets, or downright copied what they saw online, built insane broken characters and cheesed the game. \r\n\r\nA short comment on difficulty and game design. I just beat Nine Sols. Nine Sols is \"Sekiro hard\". Nine Sols has one of the most demented last boss fight I've ever seen in a video game. But by the time you get to this point, you've mastered each and every gameplay aspect and you're equiped for the challenge.\r\n\r\nRT's end game is rubbish. You can't be a hundred hours in and suddenly learn, out of the blue, that you're playing it wrong. That's just bad game design, even if part of the community wants to gaslight you into believing that it's not.\r\n\r\nI was invested in the game until then. I even found some enjoyment in those somewhat dull Ship Fights. The whole \"trading\" and colony management thing feels like an afterthought. The story is neat even if it's a bit of lore dump. \r\n\r\nWhether you'll appreciate the game depends on how much you'll tolerate the frustrating final acts and that god awful UI.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "An excellent interpretation of the TTRPG system. A great story and a suspenseful plot. Gameplay is polished, mechanics are fine and the 40k world that they are showing us is great BUT...\n\nits almost 2 years after release and the game is a buggy mess, constant error logging. Game is using same old unity engine used in kingmaker. Weird visual glitches and progression locking/ game breaking glitches. Like infinite loading screens. Also no way of communicating and trying to resolve them with the devs, did not respond to a single bug report. Game needs A LOT more time to be in a solid state from a technical point of view. \n\nWait for some 10$ sale and give it a try",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Too heavy handed with patches.  Reinventing certain classes while still keeping progression/understanding of ability synergies  vague and confusing keeps me from touching this game for a second run.  Can't recommend in this state.",
      "voted_up": false,
      "votes_helpful": 9
    }
  ]
}