{
  "positive": [
    {
      "review": "Grim Dawn is often spoken of as though it were merely a distant echo of Diablo, born in its shadow and destined never to escape it. Yet this is a misconception. Yes, its lineage is impossible to deny — the isometric perspective, the relentless combat, the endless hunt for loot, the dank caverns and infernal beasts — all these remind one of Blizzard’s legacy. But here the similarity ends. Grim Dawn is not a tale of a world fighting against damnation. It is a tale set long after damnation has already won. Humanity is not resisting the end — it is sifting through its ashes. What remains of the world is cracked, rusted, quiet. Here, magic is no divine gift, but a disease that clings to the flesh of the dying. The gods are silent. Salvation is no longer on offer. And it is this silence that gives the game its unmistakable presence.\n\nThe world of Grim Dawn does not tell its story with pompous cutscenes or heroic proclamations. It whispers it through scorched journals found in abandoned farms, through the final scribbles of dying soldiers, through broken machinery and crumbling village walls. The narrative is not handed down like scripture, but unearthed like bones. And upon these bones grows one of the most intricate role-playing systems the genre has seen. The dual-class mechanic, at first glance familiar, reveals itself to be a marvel of creative freedom: arcanist-soldiers, occultist-shamans, necromancer-demolitionists — combinations that should not make sense, and yet they do. Add to this the Devotion system — constellations of ancient powers drawn across a darkened sky, each gifting subtle strength — and building a character becomes less like ticking boxes, and more like practising alchemy: deliberate, risky, and strangely beautiful.\n\nCombat in Grim Dawn does not dazzle the eye — it weighs upon the hand. Every swing, every explosion feels tangible, as though steel genuinely meets bone, and fire truly burns through oil and cloth. The music does not soar to angelic heights, as in Diablo II; rather, it seeps into the world like mist over moorland — quiet, mournful, ever-present. It belongs not to heroes, but to survivors. It is not a hymn of hope, but the low hum of a forge still burning in a ruined town because to stop would mean admitting defeat. And in this weariness lies a peculiar comfort.\n\nOne cannot, in fairness, compare Grim Dawn to Diablo IV in terms of production spectacle. Crate Entertainment does not possess Blizzard’s coffers, nor its orchestras, actors, or cinematic bombast. But what they do possess is rarer: craftsmanship, resolve, and a kind of honest reverence for the genre. Grim Dawn does not flatter the player, nor beg for applause — it simply exists, solid and unpretentious, like an old stone bridge built to endure storms rather than impress passers-by. It expects you to learn, to fail, to rise, and try again — and in return, it offers a world that respects your time and intelligence.\n\nThus, Grim Dawn is not a “Diablo clone,” but rather a parallel branch of ARPG evolution. If Diablo is myth — glorious, biblical — then Grim Dawn is chronicle. If Diablo sings of saving the world, Grim Dawn quietly asks what one does when the world is already lost. And in that simple, solemn question lies its strength. It stands, firmly and humbly, somewhere between Diablo II and Diablo III — not to surpass them, but to walk its own road, through fog, mud and broken steel.",
      "voted_up": true,
      "votes_helpful": 85
    },
    {
      "review": "Grim Dawn is a Dark-Fantasy ARPG originally crafted in 2016 by a studio of less than 10 developers. Having played a decent amount of ARPGs before like Path of Exile, Incredible Adventures of Van Helsing, Torchlight or Diablo 4, i will say that Grim Dawn gave me the most amount of enjoyment for the time invested. I got the base game on heavy discount but later bought all expansions full price to experience the game to it's full extend.\n\n[b][u]Classes:[/u][/b]\nThere is no fancy character creator, you basically directly jump into action and upon first leveling up, you will have to chose one out of 6 (9 with Expansions) classes. When reaching level 10 you decide which secondary class you want to play which allows for up to 45 different class combinations. The decision is final for that character so if you want to test out the other possibilities you will have to create a new character.\n\n[b][u]Build/Respec:[/u][/b]\nClasses are the only aspect of the game that you will lock in completely. Everything else can be changed however you see fit. The respec-cost is minimal at first but will increase with the amount of times you made use of the system (but it's capped so it's impossible to brick your character at some point).\n\n[b][u]Loot/Gear/Crafting:[/u][/b]\nOf all the ARPGs i played i like the Loot and Crafting system in Grim Dawn the best. You get plenty of Loot on your adventures and the dynamic level scaling allows you to revisit starting areas on higher difficulties and still find upgrades. Minibosses and most elites each have items that are guaranteed to drop (so called \"Monster Infrequents\") which tremendously help getting the build of your choice rolling before Endgame. Later you will find Recipies for Legendary Gear aswell as full legendary Item drops to keep the Gearprogression going. For Set-items, you have the possiblity to craft multiple helmets for example and transmute them into the missing Setpieces so once you find the recipe, you can craft the whole set. In Addition you will find Components to further tailor your gear to your needs. Same goes for Augments (which are sold by merchants) that mostly cover your defensive resistances. There is no targetfarming for Legendaries, everything can drop everywhere so the game does a great job not locking you into boring grinding of the same activity (but it can be quite frustrating sometimes if that one piece you're missing for your build doesn't drop). Grim Dawn also has a very nice Lootfilter directly integrated.\n\n[b][u]Story/World:[/u][/b]\nLets face it, noone plays ARPGs for the story, but it does it's job well enough to keep you somewhat invested. The interesting part is Grim Dawns faction system where you collect favors and reputation doing quests. The higher your reputation, the more items will be unlocked for the faction merchant. Same goes the other way around tho, you lose reputation for rivaling factions and upon maxing it out, they will send special bosses (nemesis) that are tough to take down but drop good loot. Each difficulty is it's seperate campaign, so you can side with one faction on normal difficulty while siding with the other faction on Elite or Ultimate Difficulty. Quests are in general straightforward (kill x of these, collect x of that) but there are some nice hidden quests aswell as hidden areas. Unfortunately there's one big secret Quests that you cant do if you side with the wrong faction, both secret quests from the storyexpansions can be done regardless of your decisions made in the game.\n\n[b][u]Endgame:[/u][/b]\nBeside gearprogression, there are a few pinnacle bosses that pose a real threat. In addition to that, the Crucible DLC added a Horde mode with minor tower defense mechanics. The Forgotten Gods Expansion added the Shattered Realm, an Endless Dungeon on a timer that increases in difficulty the deeper you go. I beat Crucible and it was a nice way to farm legendaries. For the Shattered Realm on the other hand you need a very good build with even better gear to advance to the levels with worthy loot. My build hit a wall around Ultimate lvl35 and it just wasn't enjoyable grinding Nemesis bosses with 10m+ hp for minutes. I like the fact that if you just want to experience everything the game has to offer, you dont need a perfect build. But if you really want to, you can grind forever to minmax everything. The Endgame emphasis definitly lies in playing new characters and testing new builds\n\n[b][u]Difficulty/Complexity:[/u][/b]\nI personally would put Grim Dawn between Diablo 4 (super casual) and Path of Exile (super nerdy/complex). Like mentioned above you can experience everything with a suboptimal build. But the game has enough depth in both skill- and talent tree to keep you engaged for at least 100 hours. I would still recommend using a Build Guide (Youtube/Grimtools) if new to the game so you get a better grasp what items to look out for.\n\n[b][u]Some personal annoyances:[/u][/b]\n- The biggest gripe i had with the game was always having to wait a moment for the loot to drop before automatically picking it up (components eg.), wish there was an option to remove or reduce the delay.\n- The Basegame Secret Quest on Ultimate Difficulty was locked for my character because i sided with the Death Vigils Faction (for the Achievement) instead of the Kymons Chosen. So i would have had to create and grind another char to Endgame to experience it. Do yourself a favor and side with Kymons Chosen on Ultimate\n- Enable VSync to cap the FPS, my GPU was flying 500+ fps for some reason before that ^^'\n- Disable Keybind for Weaponswap (in the heat of battle i sometimes accidentaly pressed it since it was next to my HP potion)\n- Disable Keybind for Camera Rotation (was next to the Map hotkey which i had opened half the time since compass was too small)\n- Mutually exclusive achievement (finishing Questline on Ultimate for both Deaths Vigil and Kymons chosen requires me to play another char to endgame)\n- Barrowholm Faction Trader is only unlocked if you sided with them on that difficulty (i have to switch difficulty every time i wanna buy something even tho i'm (now again) friendly with that faction on ultimate)\n- Siding against Barrowholm locks you out of a pinnacle boss for that difficulty (i would only side against them on Elite for the achievement so you keep access to that boss on Normal and Ultimate)\n- Generally my tip for Ultimate Difficulty: Side with Kymons Chosen (for secret quest), with Barrowholm (for Faction Merchant and Pinnacle Boss) and Outcast (for faction merchant) so you dont have to switch difficulties. In that regard, i would side with deaths Vigil faction on Normal/Elite difficulty and stock up on some of their augments before starting ultimate\n\n[h3] Conclusion: [/h3] \n\nGreat game for every ARPG fan and still relevant almost 10 years after release, the biggest expansion is announced for 2026. Also no timegating (just go to menu to reset session/bosses) or microtransaction bullsh*t. Fully playable offline, but has online component if you want to play with friends or trade items. Apart from a few random crashes almost bugfree, extremely well polished systems aswell as a satisfying gameplayloop without having the player needlessly grind for hundreds of hours in order to experience the full game. Frequent Discounts but honestly worth the full price",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "Had this game forever and always come back to it.  One of the greatest aarpg for your money",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "Really enjoyed this game. It offers offline play which games such as Path of Exile, Diablo don't offer. I really think it is good to have offline singleplayer option for ARPGs for people who just want to chill and enjoy the game with 0 lags. I can't even count how many times I lost my progress on Emperor's Labyrinth in PoE, it is just frustrating...",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "I can honestly say Grim Dawn is one of the most rewarding ARPGs I’ve ever played. The atmosphere is dark and immersive, the combat is crunchy and satisfying, and the sheer amount of build variety kept me experimenting long after finishing the main story. The dual-class system is genius—it constantly tempts you to try “just one more” character.\r\n\r\nWhat really sets Grim Dawn apart is how much it respects your time. Every dungeon crawl, faction choice, and loot drop feels meaningful. The expansions and endgame content add even more depth, making the world of Cairn feel endless.\r\n\r\nAfter countless hours, I managed to unlock every single achievement—and that journey was incredible. From surviving hardcore mode to tackling the toughest bosses, each milestone felt like a badge of honor. It wasn’t just about grinding; it was about mastering the game’s systems and truly conquering its challenges.\r\n\r\nIf you’re into ARPGs and want something that combines old-school grit with modern polish, Grim Dawn is a must-play. And if you’re the type who loves chasing achievements, trust me—it’s worth going all the way.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "A great ARPG hidden under dated graphics and less than optimal UI. Overall I'd recommend it as I'm enjoying it the more I play it.\r\n\r\nPros:\r\n- Abundance of classes and full player freedom in skills / stats / and multi classing combinations.\r\n- Diablo 2 style loot hunting + crafting and more.\r\n- Hidden bosses, loot, and lore.\r\n- Maps are more open and less linear than modern ARPGs. Which encourage explorations, etc.\r\n\r\nCons:\r\n- Dated graphics and excessive particle effects make it hard to see what is going on which makes it easy for you to die.\r\n- Janky UI and poor explanation of mechanics in game.\r\n- Tilt: Magic items are yellow (Rare in D2), Rare are green (Set in D2), Epics are blue (Magic in D2). Skrreee",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Grim Dawn is a very densely packed game with phenomenal expansions. I think my two favorite aspects of the game are that you can make any of the skills work for a build - some you may need support skills for due to cooldowns or sheer cost per cast, but there are no real dud skills here.\r\n\r\nThe other big thing I appreciate is that for almost every idea you could have there's at least some support. Some conversion combos are less supported than others, but in general if you decide you want your giant laser to be effectively necrotic? There's support for that. Want your Beefy swordsman to be unfettered by the concept of physical damage because it's all elemental now? There's ample support for that.\r\n\r\nThe one warning I'd give is that there will be times where you're not entirely sure what killed you, but it always boils down to \"work on your resistances\" because the game is actually pretty fair with the number of \"circuit breaker\" skills you can get your hands on to shave off or prevent damage...unless your resists are in the dumps and you get one shot.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "One of the best ARPGs out there, dark mood, great loot, and deep character builds. Fantastic for long-term progression.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I played Grim Dawn on the series x (very good by the way) built a pc and just purchased again, the depth of builds is amazing, I can not stress enough that going through the game on normal going onto elite and then ultimate is like a tutorial, the game starts when you get to ultimate! you will have learnt (to a degree) what builds are made of, getting and farming gearsets that will really make a difference to your build! the amount of times I understood more and more well I would start another character just to try out different things and then go back to my main character. Its very addictive, if you love arpgs get this game, you can play offline to, the graphics are old but more then good enough and I really do enjoy the music. With so many disapointing games that have been relased you just cant go wrong, Recommended and bloody cheap!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's an ARPG that understands that the RPG part is just as important as the action. Yes, there is a bit of jank and there are other ARPGs that do the combat better, but the progression in this game is probably the best in the genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game. Wish it had more of an endgame loop, but the maps are designed very well. Runs perfectly on linux-based OS.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I tried this game when it was first released in beta and it was an unplayable mess, but I liked the vision and aesthetic so I kept coming back. Over the years, this game has morphed into one of the best ARPGs I have played. It feels so good to mow down massive clumps of enemies, the game is cool about respecting your time and giving you items that fit your build, and there is a ton of content. Devs are quite active still and the game gets constant upgrades, lots of build variety and personalization options. Overall if you can get past the fact that it isn't as sleek and modern looking as some of the other ARPGs out there, you will grow to love this one.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, and I wanted to say that I think a lot of the reviews saying the story is 'blah' or whatever probably aren't reading anything, because the lore is tight.  Scientist creating hybrid human-monster enemy that eventually sacrifices his _daughter_ to perfect his research; an explorer looking for treasure behind a rock wall, only there's a detail about them you'll probably wanna find out (quickly); an overturned cart and a corpse in the middle of the 'The Descent' movie set that spits out a lore note saying he was gonna be rich by taking the dangerous route - and buddy I really could go on and on.  Sure you can laugh and say half the hours I have are spent reading (and I don't read or listen to every single thing either) but I promise I don't regret a *moment* I took to pay attention, and maybe you won't either.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Exceptional RPG Diablo like. I think it surpasses D2 even remastered. In multiplayer, the drops are different (in a good way!) It's a very good 4 killing time in waiting of a new D3/D4 season. The dungeon crawling is simply beautiful with huge dungeon maps and astonishing graphs. Fain immersive atmosphere!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Grim Dawn is the only game where I happily spend hours collecting loot that makes me look like a medieval trash goblin with god tier powers. I go in planning to play for twenty minutes and suddenly it’s 3 AM and I’m arguing with myself about whether +2 to some spell I barely use is worth rebuilding my entire character. The world is dark, creepy, and full of monsters that explode like piñatas full of gear, and honestly it’s beautiful. Every build feels like a science experiment where the laws of physics politely step aside so I can become a lightning throwing, pet summoning, chaos machine. It’s addictive, satisfying, and dangerously fun. Grim Dawn got its hooks in me and refuses to let go, and I’m not even mad.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Been vibing this with the boys lately. Such a vibe and just outright fun. Enjoying playing around with the new classes from the recent sale!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Grim Dawn is what happens when someone takes Diablo and gives it way more freedom. The combat is fast, fun, and addictive, and the class system allows for tons of creative builds (Oathkeeper + Occultist worked great for me). Add gear customization and the Devotion system, and you’ve got so many possibilities it can feel endless.\n\nGraphically, it looks a bit dated but it runs flawlessly and nails that dark, gritty atmosphere. The story or characters didn’t hook me, but the exploration and loot grind definitely did. Some repetition here and there, yet it never got boring.\n\nA great Diablo-like with depth and personality. No flashy cinematics needed, just pure, solid gameplay.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Easily one of the best ARPG's i have ever played. I hold it up there with Diablo 2 in my top favorites. The class system allows you to combine two existing classes into a new one. So there are so many combination types. The lore is deep. It's told very well. Grim Dawn has dark Victorian/Old Western gothic theme to it's world. As of this review, no seasons, no nerfing/buffing patches. Just good ol fashion ARPG story playthrough like the OG days of Diablo 1 & 2, Champions of Norrath and Titan Quest. The game does have higher difficulty, Elite Dungeon runs and an endless timer mode for challenge and better loot for replayability. I can't wait for The Fangs of Asterkarn expansion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay is somewhat a slightly more upgraded Diablo 2 in terms of looks and feel. Obviously smoother. I recommend divining it a try.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, countless possibilities and build to make",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its been almost 10 years, I might as well put a review on this bad boy.\n\nGrim Dawn is a heavily atmospheric post-apocalyptic isometric rpg where you plow through hordes of enemies in the name of being a complete fucking badass. To simplify it, this game is like Diablo, but better! The videos on the store page don't do it justice, there's something truly special about running through the countryside slaughtering every unholy abomination that stands in your way. Furthermore, there's a lot of diversity in what your playstyle can be, you can lean really hard into a specific archetype or cherry pick skills here and there from every archetype. My personal favorite is the Demolitionist because it lets me run around with a supercharged shotgun, and retaliate with an explosion when I get touched on something like a 4 second cooldown. That's just enough time for me to run up on a group, kill half of them with the shotgun, and then wipe the rest out with the explosion when one of them inevitably attacks. I know that many a year ago, when I tried the game for the first time, I had played a Necromancer who ran around clubbing things to death. It wasn't very effective, but it was fun.\n\nAnd honestly, I think thats why I like this game so much. It has the atmosphere and storytelling that you'd look for in this type of grim (ha) story, but at the end of the day you could just forego caring about the story and just use it as a vehicle for your own personalized killing spree.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game! One of the better in its genre. It is challenging at times, but with the right build, it stays low key chill so it doesn't feel too much like a grind. The DLC adds a lot of content, so you really get a lot of bang for your buck. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's sad to see so few open public worlds, but the game itself is very enjoyable. I especially love the dual class system and how unique it makes every combination, decision on where to spend points and item builds feel.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth playing if you like isometric ARPGs. Some interesting capabilities for those who like class modding.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After nine years of patches, we're still waiting for the sun to rise on our Grim Dawn...\n\nThis game's pretty good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A solid low-budget spiritual successor to Diablo 2. Good pacing, good monster identity, fun classes and fun itemization. Not much more you can ask for from an ARPG.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good stuff. couple of beers minimum complexity is possible, so is masters' degree in forum kung-fu, i guess. good for the \"worked all day, just need some dopamine\" crowd",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredibly fun game, good for at least one run if you enjoy ARPG's. Developers are still releasing balancing patches 9 years later, even with no additional DLC releases. Worth its price, is a steal if it goes on a discount",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Heeheehee stabby stabby wade through blood.\n\nThere's all kinds of little dongles and buttons and feats and you need to be aware that resistances make a huge difference and you're supposed to basically get a guide and respec constantly for the Constellation stuff. But the core gameplay is perfect. It's just perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game wish it was multiplayer. Only thing this game does not have and it would make this game up to World or Warcraft and Guild Wars 2",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, just getting started. Just had hand surgery so the \"point and click\" play is perfect. looks great on my pc at max settings. combat is smooth. Story easy to follow, very d2 like game and that is the goat, so yeh. Cool atmosphere and setting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Surprisingly awesome from start to finish and relentlessly replayable.  Classes for all play styles, and a levelling up and gear system that keeps everything relevant on an ongoing basis.  There's even areas in the game that always scale to be just above your current level, so you can go back and farm them for experience to your heart's content.  \r\nIt's good.  Real good.  And there's still more to come, nearly a decade after release.  Get in on this ARPG heavy hitter, you'll be glad you did.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grim Dawn is an exceptional ARPG that masterfully combines deep lore, challenging gameplay, and rewarding character customization. The Necromancer class truly stands out with its unique blend of dark magic and army-summoning abilities, allowing for versatile playstyles and a satisfying sense of power. Whether commanding undead minions or unleashing devastating spells, the Necro adds a rich tactical layer that keeps the game fresh and engaging. Highly recommended for fans of dark fantasy and strategic combat!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like unga bunga builds. Combat, exploration, loot accumulation, and music are good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, the art style is really grim.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing ARPG, I love it I love it so much its great and the lore and world are super cool. I will WHOLEHEARTEDLY recommend to play with a WASD mod. It is a gamechanger.\r\n\r\nAside from that, it just works and makes you think about how to make a build, then do it and test it and synergies and stuff. It is \"outdated\" in the sense that the genre has evolved towards more \"action\", and yet it holds as one of the best in the genre",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite not getting much attention like always-online arpgs like poe, grim dawn is low key the best arpg out there in my opinion. Build variability, replayability is top notch.\r\nOnly thing this game needs is a graphical overhaul but still it is very much playable territory from a graphichal stand point.\r\nDefinitely recommend you to stick until you get to middle-end game. Once you play it once, you will play it more I am 100% sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very fun, but specific aspects of the game are not explained well.  Recommended for people who have previous experience playing ARPGs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The developers perfected every aspect in this game. Insanely good game.\n\nDefinitely worth full price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Years worth of entertainment and updates. One of the best ARPGS out there.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After more than 750 hours of playing this game, I can confidently say it is the closest any ARPG has come to capturing the feel of the original Diablo II (outside of Diablo II: Resurrected). The depth, atmosphere, and gameplay systems put it in a league of its own.\r\n\r\nCharacter & Class Customization\r\n\r\nThe customization options are extraordinary. The ability to mix and match different classes—or \"masteries\"—allows you to tailor your character exactly how you want to play. Much like Titan Quest, hybrid builds are not only possible but encouraged. Across all my hours, I don't believe I’ve come across a build that can’t complete the main campaign. While some setups clearly excel in endgame content, every build is at least capable of clearing through the full game.\r\n\r\nAttributes & Devotion System\r\n\r\nThe attribute system is simple, intuitive, and easy to understand—very standard but well executed.\r\n\r\nThe devotion system, however, is a standout feature. It functions almost like a secondary talent tree that adds tremendous depth and power to your build. With the right planning, devotion choices can completely transform your gameplay and open up some incredibly powerful combinations. I highly recommend using GrimTools to locate all the devotion shrines and optimize your setup.\r\n\r\nGameplay & Atmosphere\r\n\r\nThe gameplay experience is exceptionally engaging. Combat feels impactful, animations are smooth, and the pacing strikes a perfect balance between tactical positioning and relentless action. The dark, gritty environments capture the essence of classic ARPGs and maintain a strong thematic tone throughout the campaign and endgame.\r\n\r\nEnemy encounters are well varied, boss fights often require awareness and preparation, and the overall difficulty curve feels rewarding rather than punishing. Controls are responsive, build synergies feel meaningful, and progression always gives you something new to chase—whether it's new skills, gear upgrades, or deeper mechanics to refine.\r\n\r\nLoot & Progression\r\n\r\nThe loot system is outstanding. Item drops feel impactful and meaningful, rarities are well balanced, and the game consistently rewards experimentation. Legendary and set items often promote specific build ideas, encouraging creativity rather than forcing meta choices. There's a satisfying variety of affixes, crafting options, and item modifications, all of which support long-term build development.\r\n\r\nFarming feels purposeful rather than tedious, and the layering of different item types—rare drops, crafted gear, components, and augmentations—creates a deep but approachable progression loop. Every upgrade feels earned, and there’s genuine excitement in finding gear that unlocks a new level of potential for your build.\r\n\r\nOverall, this game delivers an exceptional ARPG experience that honors its roots while providing immense build freedom and rewarding progression. For fans of classic Diablo II-style gameplay, it is as close as it gets without being the real thing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely great game and if that isn't enough, there is a strong modding community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Prefer this over most other ARPGs. Have close to 1000hrs on my other account. Almost endless customization. Progression feels very much worth the time investment (and very satisfying). Actually gets alot better during mid-late game (usually its the early game that hooks you but dies off around the 2nd act in other games).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game just started but it feel so different from other games like it. Very fun game, story and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just began playing the game. Its name is really well chosen and is a great description of the overall athmosphere, which is very grim and dark. It's done with a lot of love for the genre. Smashing monsters and stuff is all the rage! It doesn't require a great deal of grind; it reminds me of games like dungeon siege, torchlight or diablo. Highly recommend it if you're into any of those.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "old but gold.dualclassing as its best.open end power play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. And the Dev's are literally STILL making active updates even though it's been out for almost 10 years. Surprised it's not mentioned more often alongside other Diablo-likes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid Diablo/PoE clone with quite rich options. The world/story is not as interesting though.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best ARPG games of all time with so much content and build options it is crazy that is does not get more recognition. You can mix different classes in any way you want, you can spend points on more abilities in constellations with bonuses which is a great and easy way to create the type of build you want. The gear in the game can give you abilities which can alter your play style or enhance your current build to become unstoppable. There are various challenges that will test every piece of your build ranging from challenge dungeons and end game systems with crazy strong menaces that will hunt you down for killing too many of their kind on a reputation system that rewards and punishes at the same time. The graphics and audio is so good for an older game and will keep you happy with the gore and lore . This game is top tier and is much better than any of the top ARPGs with bigger budgets. A must play.\r\n10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grim Dawn a charming Arpg that  just a delight to play. I have done 2 full runs so far and I will do many more. The game is fun the abilities just hit right.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took a little while to get used to the movement because I'm not a typical gamer, or even really a gamer at all now days. But, very interesting game to play and follow the story-line.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game fucking rocks. I don't know why I haven't given a review for it yet, I guess I forgor.\nBuild diversity and the freedom to do whatever you want is *so* nice in this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve only played Grim Dawn for about five hours, but man, it’s been way more fun than I expected. I’ve played the Diablo games before and those kinda started feeling like chores after a while, but Grim Dawn just feels good to play. The story’s actually interesting, the world is cool, and the voice acting is shockingly good for an indie game. And honestly, with how AAA games keep falling apart lately because everyone’s chasing money instead of making something good, it’s kinda refreshing to jump into a game where you can actually feel the passion behind it. These devs clearly care, they listen, and it really shows. Five hours in and I’m already hooked.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grim Dawn is one of the best arpgs ever made, some claim it to be the true successor of Diablo 2.\nIt's casual friendly but at the same time it has depth to keep arpg veterans occupied for a long time.\n\nPros: Extremely polished with 10 years of updates, no fomo, no seasons, no stupid microtransactions, can be played offline, dozens of viable builds, superb itemization, humongous map, many qol options, highly moddable with some amazing mods and overhauls, low price, i could go on and on.\n\nCons: Graphics are not the best. Game doesn't look bad but graphics are a generation behind when compared to POE2 or D4. Traders are scattered all over the huge world and at some point i find it tedious to visit them when i want to upgrade equipment. I don't like secret areas and puzzles in arps, especially when they lock you out of valuable skillpoints if you miss them, this is not a crpg. Fortunately the hidden areas that reward skillpoints are not many.\n\nCan't wait for the new dlc and Grim Dawn 2! Thumbs up from me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The main game is pretty decent, the lore bits are very interesting (and it's almost everywhere, you'd be missing half the game if you didn't read the notes), and the atmosphere is superb.\nI only got the Ashes of Malmouth expansion, but it was okay, just not quite worth the price (that I current see is 18 Euro, that's a bit steep).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an absolutely extraordinary game, and you wouldn't think that's the case just by looking at it. I actually find it to be a cross of old-school Diablo games and even something like the World of Warcraft leveling experience, where adventure, atmosphere, pacing, and side quests make it dynamic and interesting. I highly recommend this gem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First ARPG, had a great time. Combat is super punchy, the gameplay loop is incredibly addictive and the game rewards exploration.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.  Endlessly repeating maps I can look  up.   But great atmosphere, heaps of character build options and satisfying progress. I think also the sound really makes it.  excellent moody soundtrack and great combat sounds.  The story is cool (I don't read in game notes, just followed a youtube reading of them!)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The base game and it's expansions could alone last you years with build variety, but do yourselves a favor and get Reign of Terror. This brings the entirety of Diablo II + Lord of Destruction to Grim Dawn, adds Diablo II's 7 classes + Grim Dawn's 9 which totals to 16 with dual-mastery for every one of them. Do not download the version from the Crate Entertainment forums as they are out of date (as of writing), instead use their discord to get the latest versions which they link on the forum post. Do not pass up Grim Dawn itself like I did for a while, it's absolutely worth playing through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is very good for a hack/slash. Fun progression, lots of levels and monsters to kill. Very similar to Titan Quest and The Adventures of Van Helsing, since I've played both. The devotions are not that simple to understand, but once you get them, they really round out the game play. Overall, I def. recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and addicting to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, probably the best ARPG of all time, there is nothing really wrong with this game. It is deep, it has satisfying combat, good endgame, good aesthetics and lore. If you have liked any Diablo game or PoE, then definitely try this.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game based on Titan Quest engine. I wish the number of mobs was lower and it was harder to kill them. It gets a bit boring just running through the hordes of them pressing one button.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's comparable to Diablo. Although I feel it's a bit more involved. I like that though. The Devotions (passives) are super cool in how you can choose which ones you want regardless of class. The lore is pretty good as well. Playing this on a portable is great as well. Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very enjoyable game.  Enjoy the number of different classes and playing styles available.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun entertaining game. Wish the game was bigger for a mmo type.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best ARPGs. It has surprisingly good texts, and some decisions-with-consequences which are refreshing for the genre. Several skill trees benefit the diversity of the builds possible. A bit limiting in some ways, like if you only look at DPS of the weapon, you'll end up with only 2-handed ones, it's hard to compare different styles of fight right away. Also it has a loyal community, and some useful tools like Grimtools, GD Stash that may smooth out some things. All in all, a decent competition to the Titan Quest!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has remained true to their playerbase, unlike others that sold out to Krafton.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun and has a good story to it and a lot of skills to mess around with , genuinely so peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game plays just like any other game in it's category, what sets it apart is it's theme. It perfectly captures the feeling of distraught and attrition, while having a down to earth realistic feeling to it. I love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "plays like TQ but is FAR better, at least so far (didnt realise it was done by the TQ devs!!).. but I havent played this game in many years, so we'll see how the updates have affected it. considering how pathetic TQ is (just recently replayed it after many years) even after all its updates!!!\n\nthe story isnt bad, but I would have preferred the prologue actually explain why you were given 'armour and a weapon' when they explicitly state they dont trust you! after just being possessed.  seems like a pretty important thing to state.. wouldnt you?!?\n\nbut there are also plenty of game play issues, like the way map icons disappear from the map as you 'move away' from it! what are these devs thinking? honestly the harder you make it to play the game.. the less likely ppl will play it! and dont tell me they are trying to be 'old school'.. we're way past that excuse! being able to track things IN GAME.. is mandatory.. gone are the days I used paper and pencil to draw maps!! and I dont want them back!!\n\nthen there are the ridiculous mechanisms where the enemy spawn 'out of the ground'.. it's mostly skeles, spawning from pavement that really annoys me! if they spawned out of bone collections or something...sure.. but there is no visual indication that there are bones.. and they 'just appear'.. its really dumb.. whereas the ghosts are visible! they should be the ones 'appearing out of no where'!! I also dont like a lot of the outdoor level layouts.. areas you SHOULD be able to path thru are blocked (oh noes! you cant cross thru that toe deep water!!).. its just petty linear pathing the devs 'designated' arbitrarily..just about everything should be 'destroyable'!! its also a VERY heavy spell effect game, and its almost impossible to determine what spells are from the enemy vs what you've cast.. especially the ground effect kind.. it just kinda gets annoying when you're low on health and just happen to walk into that puddle of acid YOU didnt cast which was being hidden by the flames you did cast! only really an issue in boss fights (with the high damage of their spells).. but still they should have 'thought of a way', to help you distinguish!\n\nthere are also numerous bugs (which is no surprise since its the same mob that did TQ which was also a bug ridden mess!).. one in particular that constantly annoys me is stat requirements for items. I wear some item, apparently meeting the requirement at the time, then exit the game. start it up the next day and all of a sudden the item is red! somehow the stat req is no longer met and I have no idea why! its not like I put the item on 'mid combat' or something.. plenty of other issues (like 'cloud saving'! MORONIC devs!!), which you'd think should have been addressed by now.. but no.. they are more interested in releasing DLCs than fixing issues.\n\nI do enjoy the game, so I 'put up with' this... but all these issues and bugs definitely reduce the enjoyment!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is like Diablow 2 when it first came out.... and I think Last Epoch is modeling after this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very Relaxing to explore. Great music, nice character build customization. QoL features are good, New Player in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. You can turn your enemies into rotting sludge using the cursed power of necromancy  and the best part is, all in the name of good. Recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I haven't an ARPG like this in some years, but I picked this up on a whim and I'm really enjoying it. For the entry cost on sale, the game offers a lot of content and tons of replayability given the combinations of skills available. It can seem overwhelming at first, but it really just boils down to your class, skills, and gear. Once you get the menu navigation and combat down, you'll have a great time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Grim dawn has been a lot of fun to play around with. It doesn't have the exhausting depth of POE, so this is a fun casual alternative. 8.3/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IDK what to say that has not been said.....this is the best of both worlds...ARPG with MMO aspects (reputation, uber boss unlocks, world tier difficulty etc), music, graphics, talents. builds. and  *combat* are all solid, as is the world, but at YOUR own pace. The slower paced start on the entry level difficulty are different than your standard APRG, but that can easily be overcome once you get the basics down and crank it up. Crate rocked this one and I cannot wait for the next expansion. If you're newer to this type of ARPG, check out GrimTools for guidance on builds and gearing. If you do not know how to build out what you want for your first play through; do NOT worry!!! There are so many to choose from and great content creators that can help! I have built a few on there myself (a first for me) and I can say that once you have played through the first time, you will not overthink trying new things and different classes. Sometimes, you look at a game like POE (which is amazing!) and feel like you'll always \"be behind the curve\"and that simply does NOT exist here; just have some fun! There is not anything else quite like this one; enjoy the ride. Its a single player ride that FEELS like it took the best from ARPGs and MMOs, and made into a single player exp. While I bought this on sale, I grabbed everything on Steam to support further development....I would pay AAA $ for this one and the great news is, you do NOT have to!!! Go have some fun and before too long, you will be posting here too :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the single player aspect and the gear accumulation part. Games like this Fallout, Skrim, ect. all appeal to me. I guess i like the feeling of getting stronger.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like ARPGs, this game rules and this studio is an independent gem worth supporting. Grab the base game, play through it a bit, and I almost guarantee you'll come back for the DLCs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only if you have a good pc. anything other than a NASA computer and this garbage is unplayable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent diablo clone with a relatively short campaign. you could complete your build in maybe 2 or 3 days if you played constantly.\nthe story is relatively boring, the map is absolutely terrible and the game has very little in terms of annotating what is important or where you should be going. the game requires you to actually look for the objective by exploring the map which might be good or might be bad depending on the mood of the player but I guarantee you will still be looking up online where to go or where things are eventually. occasionally there might be a star on your mini-map, and the game hides very important devotion shrines constantly (the strongest buffs in the game which are essential to your character). resistances are extremely important at times and very meaningless during most of the game, meaning you can create a very strong character that takes no damage and is blitzing through everything, and then get 1-shot by a crystal randomly because i'm guessing whoever made this thought that resistance/gear checks in WOW or diablo were the most cheeky high IQ smarty pants thing in the world. builds stem from stacking one elemental buff to the usual gear dependency build that one shots the entire game because of one circumstantial change to an ability, so the usual diablo clone thing. \n\nall the areas in the game look relatively boring, visually it looks like whoever the art director was REALLY liked the witcher 2. game has reputation grinds because you love grinding in single-player rpgs. I wouldn't buy this unless it was discounted, even at 25 bucks at todays price. overall it feels like a watered down path of exile but if path of exile was actually fun to play. one thing I also didn't mention is that the game features a lot of bosses which, unless you have a lot of those resistances I mentioned earlier, will absolutely fucking destroy you unless you have a gun and can just run away or kite the boss to death: meaning melee builds are much harder to play than ranged builds, so I just recommend going demolitionist and getting some guns for your first build",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its an alright game, however it fails to stand in comparison to Path of Exile or Path of Exile 2. It has subpar graphical quality, an even more subpar story, and even more subpar difficulty levels. i am playing on veteran difficulties as a necromancer/Occultist and the game is braindead easy. I am playing on Veteran with no gear, nothing just bare naked and washing everything. There are times i just stand there, leave the room come back and everything is dead. So is this that game which is going to dethrone Path of Exile 1/2, hell no. Is this a good alternative for when the leagues are down, yea. is it worth the full chargable purchasing price, hell no. Get it sale like I did. The graphical quality is subpar also at best. I am runnin ga 5090 and even with that it looks attrocious. There is no reason that in almost 2026 that older games cannot release a high res texture pack for support with newer cards. I mean how many times has Fallout 4 been made too look amazing with high rez texture packs? I mean they remade diablo 2 ffs to look like a god mode game. Your telling me this game cannot pop out a high res texture pack? Its just pitiful and the main justification on why you never pay full price for this game, only sale price. Also the story is lackluster, its just dogwater to be frank with you. Still its a good filler between poe leagues like I said. \n\nReview update: game is still damn easy, level 50 and I am just murdering ultimate difficulty with little to no effort. Playing necro/occultist with build focus on raw pets with max pad backdrop(blood pox). I am waiting on something of actual difficulty to come my way. As right now there is nothing. Crucible also easy. The whole game is easy with my build.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really caters to my goblin compulsions to plunder shiny objects",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you are tired of POE2 and don't wanna play Diablo, this is a good choice for you. Not bad. Similar system, something different",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Less complicated than PoE, more rewarding than D4. Just enough spice in the sets to get you to want to level all the way to 100.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Went for a picnic, met some monsters.  Kept calm and grimmed on.  Turns out those monsters had some nice stuff.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Infinite ammount of variety compared to some others, like D.....\nYou can make a build with as many buttons as you desire, even 0.\nNo annoying flask management.\nNo incomprehensive one shots, all are either, not enough resists, defense or you didn`t dodge the big attack.\nYou can for the most part tank anything, with a any build, provided you get enough resist, defense,\nApart from ubers, those might need some more work.\nDon`t forget to get some kind of life gain.\nCampaign AND getting to LVL 100 is easily doable with any build, provided you get enough defense, resists.\nYou can chill with this game and still find it super engaging, thanks to build variety and loot variety.\nYou do play the campaign over and over again BUT, it is very well crafted.\nThe charm, lies in getting to thresholds and seeing your character evolve every step of the way, which does make you want to keep playing, the longer you play.\nYou can buy Elite/Ultimate unlocks for your following characters, if you don`t want to play through the campaign 3 times, with every single character.\nAt max level you have either the option to start a new character or try to beat all endgame challenges with your currenct character, like ubers, Nemesis, normal dungeons and the infinite dungeon.\n\nIf you are an endgame fanatic, that wants to be on one character forever, this game probably ain`t it, however, if you like making tons of new builds, this is definetly it.\n\nApparently mods can make this game even better for some, not for me though, i am thousands of hours in and i am still making new builds, base game is that good.\n\nI suppose the one big negative i have for this is, that, if i want to play with other players, for me personally the connection to other players hasn`t always been the best, might be better for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely addictive and the devs have supported it for years and are about to release *another* expansion. Highly recommended.\n\n(Also, it runs great on macOS via Crossover).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has all the elements of the old classic arpg and enhanced it to be customizable for the player.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best ARPG on PC. Little slow on the new expansion but it will be worth it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The pace and combat aren’t always super fast or flashy compared to some other ARPGs. If you prefer ultra-high-speed visuals and constant explosions, you may find some parts a little restrained. But that slower, more deliberate style is part of what makes Grim Dawn special — it gives you time to strategize, experiment with builds, and actually feel the impact of every skill and upgrade.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Leagues better than Diablo 4 and only a fraction the price.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I still play this every now and then. And even after 600 or so hours, it still is fun. The loot. The builds. The lore. So much content. Can't wait for the new expansion.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best inventory management sim games with some ARPG elements",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "[b]🟢 Pros:[/b]\n[list]\n[*] Flawless performance on Linux Mint 21.3 with Proton\n[*] Created by developers who previously worked on the acclaimed [i]Titan Quest[/i]\n[*] Deep character customization and class combinations\n[*] Satisfying loot system\n[*] Atmospheric, dark setting with a great soundtrack\n[*] Tons of replayability\n[*] Frequent updates and expansions adding new content and improving the game\n[/list]\n[b]🔴 Cons:[/b]\n[list]\n[*] Visuals may feel dated to some players\n[*] Repetitive gameplay with grinding and repeated missions, which may become monotonous over time for some players\n[/list]\n\n[i]Grim Dawn[/i] is an exceptionally polished ARPG crafted by developers who previously worked on the legendary [i]Titan Quest[/i]. Their experience shines through in the game’s satisfying combat, deep character customization, and the flexible dual-class system.\n\nThe game’s atmosphere is dark, gritty, and immersive, setting it apart from [i]Titan Quest’[/i]s more mythological, heroic tone. In [i]Grim Dawn[/i], you’re immersed in a grim, post-apocalyptic world where danger lurks at every turn.\n\nOn Linux Mint 21.3 Cinnamon, the game runs absolutely flawlessly — no tweaks or adjustments needed, just smooth and stable gameplay. Linux users will especially appreciate how well-optimized the title is.\n\nIf you’re looking for a deep, atmospheric ARPG rich in content and replay value, [i]Grim Dawn[/i] is absolutely worth your time — especially if you enjoyed [i]Titan Quest[/i].",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Top 3 games of all time and I can confidently say that only having 158.5 hours at the time of making this. THANKS BIG BRO FOR GETTING ME THIS GAME :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Have yet to sellout like Last Epoch did to Krafton or PoE did to Tencent and leadership wants to leave ASAP for their \"exit strategy\". Supporting Grim Dawn means your money goes to a hardworking studio, not a corpo, which every other ARPG seems to be a part of.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "still one of the greatest arpgs around, if you can get over the graphics and focus on the looting you will be in love with it the whole time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underappreciated entry in the ARPG genre somewhere between D2 and PoE.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Underrated game! A must-play if you like dungeon crawlers like Diablo",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Cool game and all but it gets real boring after awhile.  Buy it on sale and give it a try but don't ever pay full price for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This is not a good game. The combat is really clunky and the progression is quite confusing. You are spammed with quests that are not intuitive at all. I don't get the positive reviews at all.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Very little build variety.\nSome masteries (Inquisitor, Arcanist, Nightblade) require very specific items to start, to the point where char doesn't work at all.\nMany quests and items are difficulty-limited. Game NEEDS to be played 3 times to get all upgrade points.\nStory gets boring after 4-5 playthroughs; it can't be skipped or speed up. And when you realize the game is THAT repetitive, when all POI located in the same places, it becomes boring x2.\nThere's practically no endgame as such — all a player can do is level their character to 100 and equip them with a mythical (semi)exclusive set, which is essentially useless already; there's no point in using it, there is none to grind.\nItems and loot in general is VERY bad and unbalanced, with virtually zero variety, vendortrashed 80-90% of anything that drops. You simply choose one damage stat, resistance and flat damage stat, that's it! Set items have extremely poor stats; quality is meaningless when a legendary item is several times worse than a log picked up from a random chest.\nHonestly, I was very disappointed, because it seems like a new DLC is coming out, but this game feels so empty. Till the entire combat system, masteries and loot be redone\\reimagine, there is no point to play anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is like Titan Quest with a couple of improvements, but the game is still shallow and doesn't generate surprising moments like more recent ARPGS do. Now, I didn't spend hundreds of hours in, my whole 20h first playthrough was basically spamming one or two skills and listening how sounds system glitches out because it couldn't process too much attacks per second.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros: I like the art style a lot, it ran very well on my computer\nCons: the targeting system is semi broken. the game is click to move with no WASD option, and your character will constantly keep moving around in a clunky way and attacking the wrong direction. \nYou can sort of fix this by using attack in place by holding shift, but then you have to clunkily walk up to an enemy, hold shit, stand still, and attack. I dont know who came up with this targeting system, but it seriously sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game is extremely short. Almost like they sell you a full game in a bunch of little DLC pieces. . .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "god this game is so janky. controls repeatedly stop working. this should be marked as do not enter for steamdeck",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "let me have the console in solo. it s a solo game that i pay for to run on my pc solo so i should be able to have all consol option and not be force to download a tool made by someone else to customize my char",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Player housing has been requested by the community numerous time, yet, they refuse to add it. Don't pay for this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 93% rating on steam. It seems i'm in the 7% \r\n\r\nThis game is so boring and repetative. I have this song from the game burned into my mind because it literally plays on loop and never stops.\r\n\r\nThe areas are all the same, It's forest, Caves, Dusty areas. Recycle until you fall asleep. \r\n\r\nThe quests are outdated and a pain in the ass to figure out where to go, Just give me a marker on the map so i can click where to go in the Rift portals. \r\n\r\nCombat is clunky at times and i find the controls don't match what i want to do.\r\n\r\nI don't know what else to say. I have no interest left and after 2 5-7 hour long attemps at playing the game. There's nothing here for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "A bad ARPG. Poor pathing. Poor targeting. Poor gameplay.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Severe quality issues/Extremely bad, user-hostile experience at low levels\n\nI am not new to this game. Played it a lot last year, paused for a while, started with a new character and the experience is horrid. Far worse than the last time.\n\nDrop rates are skewed hostile against your build. At least that's what I observed. You will get drops of every time you already have, stuff you don't need, stuff that's useless for your build, and the item types you need won't drop. \n\nThere also seems to be a bug introduced where bosses randomly do way more damage than is level or difficulty-setting appropriate, when your gear and build is level appropriate, resulting in a one-shot without warning.\n\nI have posted reports on both of these issues and was denied support; the issues were falsely marked as \"opinion\". I would not report this or post a thumbs-down if it didn't actually happen.\n\nI cannot recommend this game in its current state until it's fixed to professional design standards.\n\nIf you want a comparable but better game, I highly recommend Chronicon. It costs a lot less, too.\n\nUPDATE: What the hell... a developer is stalking my posts instead of forwarding the issue for fixes or improvements, especially when the issues are easy to fix. What the hell is this? Now the review is a hard NO, forever. I have NEVER seen any other developer sink to this level of creepy:\n1) dismissing anomalous behavior reported as \"opinion\"\n2) Making undue assumptions of \"skill issue\" when there clearly was none\n3) Personal attacks (accusation of \"farming clown awards\")\n4) Creepy behavior - FOLLOWING the customer's review to fling FUD at it\n\nAnyone who's reading this, take note - something is seriously wrong here and it ain't me. Unprofessional in one aspect, probably unprofessional in all. Buyer beware.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boringly repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's an odd game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam harasses users for reviews. Please give an option in the settings to remove these intrusive prompts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's probably a great game but I bought this game to play with a friend who already has the game. Due to him already purchasing one of the DLCs, he is no longer able to play with anyone who only has the base game. Not sure why it's coded this way but I'm not interested in purchasing a whole DLC before I even know if I like the game so I just returned it. Disappointing. Hope they fix.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Was fun for a while but gets boring. Their idea of making something harder is to add a ridiculous amounts of monsters and one shot bosses.  All these type of games are the same.\n\nI played some more... still boring.\n\nI tried one more time. Still disappointed. Getting one shot all session is boring and make the game dull.  This game gets old fast and I will never play it again. All these types of games are the same.  Boring after a few hours.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Cool game and all but it gets real boring after awhile.  Buy it on sale and give it a try but don't ever pay full price for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "I know I'm in the minority and most people enjoy this game (and chances are you will too), but for me this is probably one of the most boring and bland ARPGs of all times (and I've been playing them since D1).\n\nGive it a try, if you enjoy it, good for you. If you don't enjoy it after an hour, return it, because it won't get any better.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "This is not a good game. The combat is really clunky and the progression is quite confusing. You are spammed with quests that are not intuitive at all. I don't get the positive reviews at all.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "If you're thinking it's anything like PoE or PoE2, it's not for you.\r\nThe pace of GD is significantly slower and the moment to moment gameplay just doesn't click for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "This is like Titan Quest with a couple of improvements, but the game is still shallow and doesn't generate surprising moments like more recent ARPGS do. Now, I didn't spend hundreds of hours in, my whole 20h first playthrough was basically spamming one or two skills and listening how sounds system glitches out because it couldn't process too much attacks per second.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pros: I like the art style a lot, it ran very well on my computer\nCons: the targeting system is semi broken. the game is click to move with no WASD option, and your character will constantly keep moving around in a clunky way and attacking the wrong direction. \nYou can sort of fix this by using attack in place by holding shift, but then you have to clunkily walk up to an enemy, hold shit, stand still, and attack. I dont know who came up with this targeting system, but it seriously sucks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "god this game is so janky. controls repeatedly stop working. this should be marked as do not enter for steamdeck",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "let me have the console in solo. it s a solo game that i pay for to run on my pc solo so i should be able to have all consol option and not be force to download a tool made by someone else to customize my char",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game has 93% rating on steam. It seems i'm in the 7% \r\n\r\nThis game is so boring and repetative. I have this song from the game burned into my mind because it literally plays on loop and never stops.\r\n\r\nThe areas are all the same, It's forest, Caves, Dusty areas. Recycle until you fall asleep. \r\n\r\nThe quests are outdated and a pain in the ass to figure out where to go, Just give me a marker on the map so i can click where to go in the Rift portals. \r\n\r\nCombat is clunky at times and i find the controls don't match what i want to do.\r\n\r\nI don't know what else to say. I have no interest left and after 2 5-7 hour long attemps at playing the game. There's nothing here for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Player housing has been requested by the community numerous time, yet, they refuse to add it. Don't pay for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's a game I like for it resembles Titan Quest but I feel like the fun is gone once you've done all the quests. Crucible mod keeps you entertained for a little longer. I found Shattered Realm is quite annoying as it is extremely difficult. It might be more fun and easier multiplayer, I can't say as I usually play singleplayer games.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "A bad ARPG. Poor pathing. Poor targeting. Poor gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Absolutely garbage fucking game.  You die far too easy, and to lower tiered enemies, as well.  Pro tip: When you die to a level x9 mini-boss in a sewer under the town, it doesn't make you want to keep playing the game.  It makes you want to uninstall, and never touch it again.  The game's balance is trash.  Don't even consider trying \"Veteran\" difficulty, as you'll die to the first fucking mob you see.  It's also insanely glitchy, no matter how low you dial the graphics down.  Really screams \"amateur effort\" grade, here.  The mechanic of losing XP, when you die, has got to be one of the dumbest, most moronic game design choices ever.  It's quite obviously ripping off that failed, BS system from Diablo 2.  Also their new \"Dash\" mechanic, is yet more instances of trying to add something that was never needed, instead of focusing on things that direly needed help, such as game balance.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Severe quality issues/Extremely bad, user-hostile experience at low levels\n\nI am not new to this game. Played it a lot last year, paused for a while, started with a new character and the experience is horrid. Far worse than the last time.\n\nDrop rates are skewed hostile against your build. At least that's what I observed. You will get drops of every time you already have, stuff you don't need, stuff that's useless for your build, and the item types you need won't drop. \n\nThere also seems to be a bug introduced where bosses randomly do way more damage than is level or difficulty-setting appropriate, when your gear and build is level appropriate, resulting in a one-shot without warning.\n\nI have posted reports on both of these issues and was denied support; the issues were falsely marked as \"opinion\". I would not report this or post a thumbs-down if it didn't actually happen.\n\nI cannot recommend this game in its current state until it's fixed to professional design standards.\n\nIf you want a comparable but better game, I highly recommend Chronicon. It costs a lot less, too.\n\nUPDATE: What the hell... a developer is stalking my posts instead of forwarding the issue for fixes or improvements, especially when the issues are easy to fix. What the hell is this? Now the review is a hard NO, forever. I have NEVER seen any other developer sink to this level of creepy:\n1) dismissing anomalous behavior reported as \"opinion\"\n2) Making undue assumptions of \"skill issue\" when there clearly was none\n3) Personal attacks (accusation of \"farming clown awards\")\n4) Creepy behavior - FOLLOWING the customer's review to fling FUD at it\n\nAnyone who's reading this, take note - something is seriously wrong here and it ain't me. Unprofessional in one aspect, probably unprofessional in all. Buyer beware.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boringly repetitive",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's an odd game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is so boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Steam harasses users for reviews. Please give an option in the settings to remove these intrusive prompts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's probably a great game but I bought this game to play with a friend who already has the game. Due to him already purchasing one of the DLCs, he is no longer able to play with anyone who only has the base game. Not sure why it's coded this way but I'm not interested in purchasing a whole DLC before I even know if I like the game so I just returned it. Disappointing. Hope they fix.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Cool game and all but it gets real boring after awhile.  Buy it on sale and give it a try but don't ever pay full price for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Was fun for a while but gets boring. Their idea of making something harder is to add a ridiculous amounts of monsters and one shot bosses.  All these type of games are the same.\n\nI played some more... still boring.\n\nI tried one more time. Still disappointed. Getting one shot all session is boring and make the game dull.  This game gets old fast and I will never play it again. All these types of games are the same.  Boring after a few hours.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This is not a good game. The combat is really clunky and the progression is quite confusing. You are spammed with quests that are not intuitive at all. I don't get the positive reviews at all.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This is like Titan Quest with a couple of improvements, but the game is still shallow and doesn't generate surprising moments like more recent ARPGS do. Now, I didn't spend hundreds of hours in, my whole 20h first playthrough was basically spamming one or two skills and listening how sounds system glitches out because it couldn't process too much attacks per second.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros: I like the art style a lot, it ran very well on my computer\nCons: the targeting system is semi broken. the game is click to move with no WASD option, and your character will constantly keep moving around in a clunky way and attacking the wrong direction. \nYou can sort of fix this by using attack in place by holding shift, but then you have to clunkily walk up to an enemy, hold shit, stand still, and attack. I dont know who came up with this targeting system, but it seriously sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very little build variety.\nSome masteries (Inquisitor, Arcanist, Nightblade) require very specific items to start, to the point where char doesn't work at all.\nMany quests and items are difficulty-limited. Game NEEDS to be played 3 times to get all upgrade points.\nStory gets boring after 4-5 playthroughs; it can't be skipped or speed up. And when you realize the game is THAT repetitive, when all POI located in the same places, it becomes boring x2.\nThere's practically no endgame as such — all a player can do is level their character to 100 and equip them with a mythical (semi)exclusive set, which is essentially useless already; there's no point in using it, there is none to grind.\nItems and loot in general is VERY bad and unbalanced, with virtually zero variety, vendortrashed 80-90% of anything that drops. You simply choose one damage stat, resistance and flat damage stat, that's it! Set items have extremely poor stats; quality is meaningless when a legendary item is several times worse than a log picked up from a random chest.\nHonestly, I was very disappointed, because it seems like a new DLC is coming out, but this game feels so empty. Till the entire combat system, masteries and loot be redone\\reimagine, there is no point to play anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is extremely short. Almost like they sell you a full game in a bunch of little DLC pieces. . .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "let me have the console in solo. it s a solo game that i pay for to run on my pc solo so i should be able to have all consol option and not be force to download a tool made by someone else to customize my char",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Repetitive and boring. Kept switching from 32 to 64 bits at whim. Controls hopelessly broken or just don't work. i cannot understand what all the hype is about.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "god this game is so janky. controls repeatedly stop working. this should be marked as do not enter for steamdeck",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Player housing has been requested by the community numerous time, yet, they refuse to add it. Don't pay for this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 93% rating on steam. It seems i'm in the 7% \r\n\r\nThis game is so boring and repetative. I have this song from the game burned into my mind because it literally plays on loop and never stops.\r\n\r\nThe areas are all the same, It's forest, Caves, Dusty areas. Recycle until you fall asleep. \r\n\r\nThe quests are outdated and a pain in the ass to figure out where to go, Just give me a marker on the map so i can click where to go in the Rift portals. \r\n\r\nCombat is clunky at times and i find the controls don't match what i want to do.\r\n\r\nI don't know what else to say. I have no interest left and after 2 5-7 hour long attemps at playing the game. There's nothing here for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boringly repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's an odd game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam harasses users for reviews. Please give an option in the settings to remove these intrusive prompts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's probably a great game but I bought this game to play with a friend who already has the game. Due to him already purchasing one of the DLCs, he is no longer able to play with anyone who only has the base game. Not sure why it's coded this way but I'm not interested in purchasing a whole DLC before I even know if I like the game so I just returned it. Disappointing. Hope they fix.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Cool game and all but it gets real boring after awhile.  Buy it on sale and give it a try but don't ever pay full price for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Was fun for a while but gets boring. Their idea of making something harder is to add a ridiculous amounts of monsters and one shot bosses.  All these type of games are the same.\n\nI played some more... still boring.\n\nI tried one more time. Still disappointed. Getting one shot all session is boring and make the game dull.  This game gets old fast and I will never play it again. All these types of games are the same.  Boring after a few hours.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This is not a good game. The combat is really clunky and the progression is quite confusing. You are spammed with quests that are not intuitive at all. I don't get the positive reviews at all.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This is like Titan Quest with a couple of improvements, but the game is still shallow and doesn't generate surprising moments like more recent ARPGS do. Now, I didn't spend hundreds of hours in, my whole 20h first playthrough was basically spamming one or two skills and listening how sounds system glitches out because it couldn't process too much attacks per second.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros: I like the art style a lot, it ran very well on my computer\nCons: the targeting system is semi broken. the game is click to move with no WASD option, and your character will constantly keep moving around in a clunky way and attacking the wrong direction. \nYou can sort of fix this by using attack in place by holding shift, but then you have to clunkily walk up to an enemy, hold shit, stand still, and attack. I dont know who came up with this targeting system, but it seriously sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very little build variety.\nSome masteries (Inquisitor, Arcanist, Nightblade) require very specific items to start, to the point where char doesn't work at all.\nMany quests and items are difficulty-limited. Game NEEDS to be played 3 times to get all upgrade points.\nStory gets boring after 4-5 playthroughs; it can't be skipped or speed up. And when you realize the game is THAT repetitive, when all POI located in the same places, it becomes boring x2.\nThere's practically no endgame as such — all a player can do is level their character to 100 and equip them with a mythical (semi)exclusive set, which is essentially useless already; there's no point in using it, there is none to grind.\nItems and loot in general is VERY bad and unbalanced, with virtually zero variety, vendortrashed 80-90% of anything that drops. You simply choose one damage stat, resistance and flat damage stat, that's it! Set items have extremely poor stats; quality is meaningless when a legendary item is several times worse than a log picked up from a random chest.\nHonestly, I was very disappointed, because it seems like a new DLC is coming out, but this game feels so empty. Till the entire combat system, masteries and loot be redone\\reimagine, there is no point to play anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is extremely short. Almost like they sell you a full game in a bunch of little DLC pieces. . .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "let me have the console in solo. it s a solo game that i pay for to run on my pc solo so i should be able to have all consol option and not be force to download a tool made by someone else to customize my char",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Repetitive and boring. Kept switching from 32 to 64 bits at whim. Controls hopelessly broken or just don't work. i cannot understand what all the hype is about.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "god this game is so janky. controls repeatedly stop working. this should be marked as do not enter for steamdeck",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Player housing has been requested by the community numerous time, yet, they refuse to add it. Don't pay for this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 93% rating on steam. It seems i'm in the 7% \r\n\r\nThis game is so boring and repetative. I have this song from the game burned into my mind because it literally plays on loop and never stops.\r\n\r\nThe areas are all the same, It's forest, Caves, Dusty areas. Recycle until you fall asleep. \r\n\r\nThe quests are outdated and a pain in the ass to figure out where to go, Just give me a marker on the map so i can click where to go in the Rift portals. \r\n\r\nCombat is clunky at times and i find the controls don't match what i want to do.\r\n\r\nI don't know what else to say. I have no interest left and after 2 5-7 hour long attemps at playing the game. There's nothing here for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boringly repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's an odd game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam harasses users for reviews. Please give an option in the settings to remove these intrusive prompts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's probably a great game but I bought this game to play with a friend who already has the game. Due to him already purchasing one of the DLCs, he is no longer able to play with anyone who only has the base game. Not sure why it's coded this way but I'm not interested in purchasing a whole DLC before I even know if I like the game so I just returned it. Disappointing. Hope they fix.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Cool game and all but it gets real boring after awhile.  Buy it on sale and give it a try but don't ever pay full price for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Was fun for a while but gets boring. Their idea of making something harder is to add a ridiculous amounts of monsters and one shot bosses.  All these type of games are the same.\n\nI played some more... still boring.\n\nI tried one more time. Still disappointed. Getting one shot all session is boring and make the game dull.  This game gets old fast and I will never play it again. All these types of games are the same.  Boring after a few hours.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This is not a good game. The combat is really clunky and the progression is quite confusing. You are spammed with quests that are not intuitive at all. I don't get the positive reviews at all.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This is like Titan Quest with a couple of improvements, but the game is still shallow and doesn't generate surprising moments like more recent ARPGS do. Now, I didn't spend hundreds of hours in, my whole 20h first playthrough was basically spamming one or two skills and listening how sounds system glitches out because it couldn't process too much attacks per second.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros: I like the art style a lot, it ran very well on my computer\nCons: the targeting system is semi broken. the game is click to move with no WASD option, and your character will constantly keep moving around in a clunky way and attacking the wrong direction. \nYou can sort of fix this by using attack in place by holding shift, but then you have to clunkily walk up to an enemy, hold shit, stand still, and attack. I dont know who came up with this targeting system, but it seriously sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very little build variety.\nSome masteries (Inquisitor, Arcanist, Nightblade) require very specific items to start, to the point where char doesn't work at all.\nMany quests and items are difficulty-limited. Game NEEDS to be played 3 times to get all upgrade points.\nStory gets boring after 4-5 playthroughs; it can't be skipped or speed up. And when you realize the game is THAT repetitive, when all POI located in the same places, it becomes boring x2.\nThere's practically no endgame as such — all a player can do is level their character to 100 and equip them with a mythical (semi)exclusive set, which is essentially useless already; there's no point in using it, there is none to grind.\nItems and loot in general is VERY bad and unbalanced, with virtually zero variety, vendortrashed 80-90% of anything that drops. You simply choose one damage stat, resistance and flat damage stat, that's it! Set items have extremely poor stats; quality is meaningless when a legendary item is several times worse than a log picked up from a random chest.\nHonestly, I was very disappointed, because it seems like a new DLC is coming out, but this game feels so empty. Till the entire combat system, masteries and loot be redone\\reimagine, there is no point to play anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is extremely short. Almost like they sell you a full game in a bunch of little DLC pieces. . .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "let me have the console in solo. it s a solo game that i pay for to run on my pc solo so i should be able to have all consol option and not be force to download a tool made by someone else to customize my char",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Repetitive and boring. Kept switching from 32 to 64 bits at whim. Controls hopelessly broken or just don't work. i cannot understand what all the hype is about.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "god this game is so janky. controls repeatedly stop working. this should be marked as do not enter for steamdeck",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Player housing has been requested by the community numerous time, yet, they refuse to add it. Don't pay for this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 93% rating on steam. It seems i'm in the 7% \r\n\r\nThis game is so boring and repetative. I have this song from the game burned into my mind because it literally plays on loop and never stops.\r\n\r\nThe areas are all the same, It's forest, Caves, Dusty areas. Recycle until you fall asleep. \r\n\r\nThe quests are outdated and a pain in the ass to figure out where to go, Just give me a marker on the map so i can click where to go in the Rift portals. \r\n\r\nCombat is clunky at times and i find the controls don't match what i want to do.\r\n\r\nI don't know what else to say. I have no interest left and after 2 5-7 hour long attemps at playing the game. There's nothing here for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boringly repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's an odd game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam harasses users for reviews. Please give an option in the settings to remove these intrusive prompts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's probably a great game but I bought this game to play with a friend who already has the game. Due to him already purchasing one of the DLCs, he is no longer able to play with anyone who only has the base game. Not sure why it's coded this way but I'm not interested in purchasing a whole DLC before I even know if I like the game so I just returned it. Disappointing. Hope they fix.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Cool game and all but it gets real boring after awhile.  Buy it on sale and give it a try but don't ever pay full price for this game.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Was fun for a while but gets boring. Their idea of making something harder is to add a ridiculous amounts of monsters and one shot bosses.  All these type of games are the same.\n\nI played some more... still boring.\n\nI tried one more time. Still disappointed. Getting one shot all session is boring and make the game dull.  This game gets old fast and I will never play it again. All these types of games are the same.  Boring after a few hours.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This is not a good game. The combat is really clunky and the progression is quite confusing. You are spammed with quests that are not intuitive at all. I don't get the positive reviews at all.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "This is like Titan Quest with a couple of improvements, but the game is still shallow and doesn't generate surprising moments like more recent ARPGS do. Now, I didn't spend hundreds of hours in, my whole 20h first playthrough was basically spamming one or two skills and listening how sounds system glitches out because it couldn't process too much attacks per second.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pros: I like the art style a lot, it ran very well on my computer\nCons: the targeting system is semi broken. the game is click to move with no WASD option, and your character will constantly keep moving around in a clunky way and attacking the wrong direction. \nYou can sort of fix this by using attack in place by holding shift, but then you have to clunkily walk up to an enemy, hold shit, stand still, and attack. I dont know who came up with this targeting system, but it seriously sucks",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Very little build variety.\nSome masteries (Inquisitor, Arcanist, Nightblade) require very specific items to start, to the point where char doesn't work at all.\nMany quests and items are difficulty-limited. Game NEEDS to be played 3 times to get all upgrade points.\nStory gets boring after 4-5 playthroughs; it can't be skipped or speed up. And when you realize the game is THAT repetitive, when all POI located in the same places, it becomes boring x2.\nThere's practically no endgame as such — all a player can do is level their character to 100 and equip them with a mythical (semi)exclusive set, which is essentially useless already; there's no point in using it, there is none to grind.\nItems and loot in general is VERY bad and unbalanced, with virtually zero variety, vendortrashed 80-90% of anything that drops. You simply choose one damage stat, resistance and flat damage stat, that's it! Set items have extremely poor stats; quality is meaningless when a legendary item is several times worse than a log picked up from a random chest.\nHonestly, I was very disappointed, because it seems like a new DLC is coming out, but this game feels so empty. Till the entire combat system, masteries and loot be redone\\reimagine, there is no point to play anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is extremely short. Almost like they sell you a full game in a bunch of little DLC pieces. . .",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "let me have the console in solo. it s a solo game that i pay for to run on my pc solo so i should be able to have all consol option and not be force to download a tool made by someone else to customize my char",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Repetitive and boring. Kept switching from 32 to 64 bits at whim. Controls hopelessly broken or just don't work. i cannot understand what all the hype is about.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "god this game is so janky. controls repeatedly stop working. this should be marked as do not enter for steamdeck",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Player housing has been requested by the community numerous time, yet, they refuse to add it. Don't pay for this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has 93% rating on steam. It seems i'm in the 7% \r\n\r\nThis game is so boring and repetative. I have this song from the game burned into my mind because it literally plays on loop and never stops.\r\n\r\nThe areas are all the same, It's forest, Caves, Dusty areas. Recycle until you fall asleep. \r\n\r\nThe quests are outdated and a pain in the ass to figure out where to go, Just give me a marker on the map so i can click where to go in the Rift portals. \r\n\r\nCombat is clunky at times and i find the controls don't match what i want to do.\r\n\r\nI don't know what else to say. I have no interest left and after 2 5-7 hour long attemps at playing the game. There's nothing here for me.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "boringly repetitive",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's an odd game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Steam harasses users for reviews. Please give an option in the settings to remove these intrusive prompts",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's probably a great game but I bought this game to play with a friend who already has the game. Due to him already purchasing one of the DLCs, he is no longer able to play with anyone who only has the base game. Not sure why it's coded this way but I'm not interested in purchasing a whole DLC before I even know if I like the game so I just returned it. Disappointing. Hope they fix.",
      "voted_up": false,
      "votes_helpful": 14
    }
  ]
}