{
  "positive": [
    {
      "review": "such a creative and great game (jebidiah is on an interstellar transfer to kcalbeloh that will last 1000 years)\r\nalso do not get KSP 2, it is abandonware",
      "voted_up": true,
      "votes_helpful": 48
    },
    {
      "review": "\"Accidentally\" killed ~150 Kerbals in a failed rocket launch. When I tried to close the game right after, it froze and I was left with the Kerbal on the title screen staring at me.\n\nJudging me.\n\nGame finally closed after two minutes. I was left contemplating my actions. 10/10 experience would highly recommend.",
      "voted_up": true,
      "votes_helpful": 32
    },
    {
      "review": "To this day, yes. because ksp 2 is a total shitbox. don't buy ksp 2. Also get Kitten Space Agency (KSA) when it releases. it is pretty much ksp 2 but way better, as it was made by modders for ksp 1",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "One of the most fun and engaging games I've played. There's a few reasons why the game stays strong after all those years:\r\n\r\n- MODS: You have tons of mods to download and play with (community support is amazing)\r\n- Replayability: the game can be played forever if you have enough creativity \r\n- Polishing: even without mods the game is well designed and polished.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The Gameplay is awesome!  The gravity is also realistic.  The problems are that the graphics SUCK and it lags.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Too much science for my brain to process . I haven't been to space more than three times, but I mostly like to abuse the astronauts and make them explode in my dumpster- grade rockets. Very epic game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "very fun! what i like is that there is an entire FICTIONAL star system, albeit quite similar to the solar system. also the physics are nice, and some of the mods are incredible! its quite sad that the development has ended. nevertheless, great game! i recommmend!\n(i also recommend installing CKAN for easier mod downloading)\nby the way, my play hours are incorrect, because im playing on a different instance that doesnt count hours on steam :p",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Best game of all time, it is also one of the best games for modding as there are many tools and forums on how to.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not for everyone. In fact I have only dedicated enough time to visit other planets not make bases yet.  If the nerd in you have to calculation/Design challenge itch this will be for you. Not actual math just understanding the concepts.  Like burning fuel ratio in vacuum verses air. Or, Quick accent verses long burns to get to escape velocity.  Re-entry at an angle to avoid burn up ect..",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I like space so this is a really fun game for me I like how easy it is to make rockets even tho they might not work I can always learn from last time or when I'm building a plane I love how I can just glide or crash land into the water or fly into space anyways I would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I get cracked by the kraken often but besides that the game is fun with a few glitches",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just about every kerbal i hire will at some point be stranded for the remainder of their days on some distant celestial body. They will never see their family, or friends ever again. 10/10 perfect game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "🌟🚀 KERBAL SPACE PROGRAM: THE GAME THAT YEETED MY BRAIN INTO ORBIT 🚀🌟\r\n\r\nOkay listen… I downloaded Kerbal Space Program thinking, “lol little green dudes in space, this’ll be chill 😌.”\r\nI was WRONG. This game grabbed me by the EVA suit and launched me into a 500-hour vortex of pure chaotic joy 😂🔥\r\n\r\nFirst of all:\r\n✈️ Airplanes? Yup.\r\n🚀 Rockets? Absolutely.\r\n🛸 Spaceships?? You bet your boosters.\r\n🛠️ Literally anything you can dream up??? THIS GAME SAYS “DO IT, COWARD.” 😤💚\r\n\r\nI’ve built majestic star cruisers, cursed noodle rockets that vibrate out of existence, planes that technically fly (if you count “screaming into the ground at Mach 3” as flying), and even a space station that only exploded twice (personal best 😎).\r\n\r\nThe Kerbals themselves? Pure icons. Little green chaos gremlins who smile through G-forces that would liquefy a normal human. Absolute kings. 👑💚\r\n\r\n10/10 would strand a Kerbal on the Mun again 😭🌕🔥\r\nBuy it. Build stuff. Explode stuff. Laugh. Cry. Repeat. 🚀💥🤣",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've played this games for years on the old launcher before steam. The worst part about this game is the fact there isn't a sequel. As far as I'm concerned one of my favorite game OAT. 10/10 do recommend (especially on sale).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "-start playing KSP\n-launches first rocket\n-fails\n-revert to launch\n-works the 2nd try\n-spend 8 days trying to get to orbit (fails multiple times)\n-fast foward 2 weeks, jeb is now in an orbit around the sun with a 70yr orbital period\n10/10 would sent Kerbals to space for eternity again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game to this day holds up as one of the greatest space simulation games to ever be released. It's a bit of a learning curve, but can be very fun. The game gives you a lot of creative freedom, and there's always somewhere to explore.\r\nIf you love space games, I highly recommend this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Have never even got to the moon because all my ships crash and burn, killing my kerbals or they fly off into the vast coldness of space. This game is stupid. Play it right now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Basics are easy to understand, but the game has incredible depths and can be played repeatedly. Still holds up amazingly and with mods feels like it's been released yesterday. DOESN'T need a sequel!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Even in 2025 this game is amazing! I would recommend mods but there are countless hours of fun out this and I actually have learnt a lot about space travel too!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wants to explore eve, build rocket and launch, rocket spins and crash, add fins, relaunch, escapes kerbin's SOF, not enough fuel, add more tanks, relaunch, makes it to eve, gets too close and burns up in atmosphere, no more funds, accept a rescue contract, build rescue rocket, launch rocket to Mun, get to Mike Kerman, runs out of fuel, starts a rescue mission for a rescue mission, waste all fuel trying to rendezvous, gives up\r\nMan I love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Better than KSP2.  And if you're ever bored, mods change up the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the very complex ideas that don't have to be mastered for the game to be fun. I started without the tutorials because I didn't know they existed, so it's pretty newbie friendly and has a high skill cap.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i learned actual rocket science for these weird green creatures, dont buy this game if you have a life becuase you will lose it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Peak game, really fun with mods, fun for all ages",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Few joy in this world are as pure as conquering orbital mechanics with rockets made of wooden sticks and elmer's glue. A reminder that even us apes can conquer stars.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is absolutely worth it for anyone looking for a unique game set on the planet Kerbal. The career mode has you starting from scratch, building rockets and collecting that sweet science to level up a tech tree that gives you access to even bigger rockets and airplanes. There’s also a creative sandbox mode with unlimited parts and money.\n\nThis game is purely physics based, which makes things quite difficult with a high learning curve. You’ll definitely feel like you’re learning actual rocket science the further you dig into it and see the complexity. However, when you do achieve something, like orbit, it feels like a real actual achievement. There’s a whole solar system to explore, and a massive community that supports with mods and discussion.\n\nKSP 2 exists, but doesn’t quite compare to the original. Buy this game and enjoy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the most amazing games I have ever played.\r\n\r\nBeware modding, as once you start you cannot go back.\r\n\r\n10/10 would reccomend great time sink",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Shame it's dying. Still great. Hopefully modding communnity will keep it alive forever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game and it's fun to play and helps you with areospace engineering and space macanica",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game it is intresting challenging and funny but i would like a option to download premade roketships and satalites in sandbox 10 out of 10 tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Final Verdict: [b]82/100[/b][/h1]\n\n[b]Average: 75-84 (75-84%)[/b]\nPerformance or gameplay meets the passing mark but remains average.\nThere are areas that could be improved to enhance the gaming experience.\nCautiously Recommended - ✔\n\n[h2]Player Opinion Steam Review[/h2]\n\n[b]Gameplay Experience (18/25)[/b]\n\n[i]Intuitive Controls - Easy to use.[/i]\n☑ Very Difficult (+1)\n☐ Difficult (+2)\n☐ Moderate (+3)\n☐ Easy (+4)\n☐ Very Easy (+5)\n\n\n[i]Balanced Gameplay - Fair and equal.[/i]\n☐ Poorly Balanced (+1)\n☐ Somewhat Balanced (+2)\n☐ Moderately Balanced (+3)\n☑ Well Balanced (+4)\n☐ Perfectly Balanced (+5)\n\n\n[i]Player Engagement - Involving and captivating.[/i]\n☐ Not at all (+1)\n☐ Slightly (+2)\n☐ Moderately (+3)\n☑ Very (+4)\n☐ Extremely (+5)\n\n\n[i]Decision Relevance - Meaningful choices.[/i]\n☐ Meaningless (+1)\n☐ Not Meaningful (+2)\n☐ Somewhat Meaningful (+3)\n☑ Quite Meaningful (+4)\n☐ Highly Meaningful (+5)\n\n\n[i]Rewarding Progression - Satisfying advancement.[/i]\n☐ Very Unsatisfying (+1)\n☐ Unsatisfying (+2)\n☐ Neutral (+3)\n☐ Satisfying (+4)\n☑ Very Satisfying (+5)\n\n\n[b]Presentation & Immersion (17/25)[/b]\n\n[i]Compelling Storyline - Engaging narrative.[/i]\n☐ Not Interesting (+1)\n☐ Slightly Interesting (+2)\n☑ Moderately Interesting (+3)\n☐ Very Interesting (+4)\n☐ Extremely Interesting (+5)\n\n\n[i]Immersive Atmosphere - Captivating environment.[/i]\n☐ Not Immersive (+1)\n☐ Slightly Immersive(+2)\n☐ Moderately Immersive (+3)\n☑ Very Immersive (+4)\n☐ Completely Immersive (+5)\n\n\n[i]Visual Aesthetics - Stunning graphics.[/i]\n☐ Not Appealing (+1)\n☐ Slightly Appealing (+2)\n☐ Moderately Appealing (+3)\n☐ Very Appealing (+4)\n☑ Extremely Appealing (+5)\n\n\n[i]Audio Quality - High-quality sound.[/i]\n☐ Not Engaging (+1)\n☑ Slightly Engaging (+2)\n☐ Moderately Engaging (+3)\n☐ Very Engaging (+4)\n☐ Extremely Engaging (+5)\n\n\n[i]Polished HUD - Clean and functional interface.[/i]\n☐ Very Unfriendly (+1)\n☐ Unfriendly (+2)\n☑ Neutral (+3)\n☐ Friendly (+4)\n☐ Very Friendly (+5)\n\n\n[b]Design & Technical Aspects (22/25)[/b]\n\n[i]Game Design - Well-crafted mechanics.[/i]\n☐ Poorly Designed (+1)\n☐ Somewhat Designed (+2)\n☐ Moderately Designed (+3)\n☐ Well Designed (+4)\n☑ Excellently Designed (+5)\n\n\n[i]Content Quality - Rich and diverse.[/i]\n☐ Poor Content (+1)\n☐ Limited Content (+2)\n☐ Moderate Content (+3)\n☐ Extensive Content (+4)\n☑ Abundant Content (+5)\n\n\n[i]AI Behavior - Intelligent and realistic.[/i]\n☐ Very Poor (+1)\n☐ Poor (+2)\n☑ Average (+3)\n☐ Good (+4)\n☐ Excellent (+5)\n\n\n[i]Settings - Flexible and customizable.[/i]\n☐ Very Limited (+1)\n☐ Limited (+2)\n☐ Moderate (+3)\n☐ Flexible (+4)\n☑ Highly Flexible (+5)\n\n\n[i]Technical Issues - Minimal or no problems.[/i]\n☐ Numerous (+1)\n☐ Moderate (+2)\n☐ Limited (+3)\n☑ Minor (+4)\n☐ None (+5)\n\n\n[b]Final Considerations (25/25)[/b]\n\n[i]Overall Satisfaction - General enjoyment level.[/i]\n☐ Very Dissatisfied (+1)\n☐ Dissatisfied (+2)\n☐ Neutral (+3)\n☐ Satisfied (+4)\n☑ Very Satisfied (+5)\n\n\n[i]Microtransactions - In-game purchases.[/i]\n☐ Extensive (+1)\n☐ Substantial (+2)\n☐ Moderate (+3)\n☐ Minimal (+4)\n☑ None (+5)\n\n\n[i]Replay Value - Longevity and replayability.[/i]\n☐ Very Low (+1)\n☐ Low (+2)\n☐ Moderate (+3)\n☐ High (+4)\n☑ Very High (+5)\n\n\n[i]Cost-to-Play Ratio - Money spent vs hours played.[/i]\n☐ Overpriced (+1)\n☐ Poor Value (+2)\n☐ Fair Value (+3)\n☐ Good Value (+4)\n☑ Excellent Value (+5)\n\n\n[i]Recommendation.[/i]\n☐ No (+0)\n☑ Yes (+5)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun to make a huge candle (rocket) and shoot it off in to space in ksp",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a hard game but that aside doing anything is really rewarding. The actually good version of the KSP \"Series.\" Overall a must buy for any library! If you get stuck on anything just check the [url=https://wiki.kerbalspaceprogram.com/wiki/Main_Page] wiki! [/url]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is more than a spaceflight game, it's as detailed of an engineering simulator as you want. You can spend thousands of hours not even leaving the atmosphere, and thousands more not going farther than Minmus.\n\nThen you can add mods to it and make it into a flight simulator where you build the plane yourself and a science fiction future universe where you can have warp drives and go to other star systems. My play time is actually still pretty low. I know a few people with many, many times more hours than I do, and they still find new things to do in the stock game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "unparalleled attention to detail and the most intuitive building system i have ever seen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "KSP is Awesome. Yeeting Kerbals to their intergalactic doom is peak gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I downloaded it because 1st i had the money and the other game, space flight simulator two was taking too long. I'm not trying to take away sfs users but i don't think it's coming out anytime soon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Genuinely one of the greatest games of all time. \n\nA bit tricky to learn at first but this game excels at rewarding you with a grand sense of achievement for your effort and accomplishing milestones, that or at the very least makes your failures fun explosive & spectacular!   \n\nSadly, I would only recommend picking it up during a sale due to Take-Two's anti-consumer practices and sorta just treating the franchise as a cash-grab and abandoning support. Unlike KSP2, THIS game is at least a complete package.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fly me to the moon and let me play among the stars or burn in the atmosphere because my boosters glitched in time warp lol. Love the game, hate the bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm not sure what's wrong with the new one, but this game is challenging and wonderful. If I had to make a suggestion, I find it too difficult to theorize before I run a trial. Kek kek, tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love KSP1 It is no longer in active development, but it is a more finished game than KSP2 will ever be, of course KSA is here to do what KSP2 didn't but while KSA is in its early stages and you want a more finished game, play KSP1, of course the game is enhanced with mods, which there are plenty of. Of course there are its flaws like the deep space kraken that kills your mission, but then again, there are quicksaves.\nI love KSP and I hope KSA can fufill what KSP2 didn't. But for now if you are looking for something like KSP, there is nothing like it this is kind of a once in a lifetime game...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game, got to the moon within 12 hours. A tip for beginners is to actually follow each of the tutorials, it helps out a ton!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Build rocket\r\nrocket crash\r\ntweak rocket\r\nrepeat till works\r\nmission succeed\r\nneuron activation\r\nfind mods\r\nnow game 100x better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game, teaches alot, and also weirdly funny physics engine",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, dont buy KSP2 it is buns. KSP 1 with free mods to make it look better is so much more worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jebediah kerman has been floating in low orbit around kerbin in an untouched save game for a year.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Been playing this game since 2015, so obviously I'm more like 2000h in than 5 :P It's my favorite game of all times so of course I highly recommend it!\r\n\r\nEspecially don't go for KSP2, it's pure hogwash. Get KSP1 instead - tons of mods are available, and the community is still very active 10 years on!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jebediah... he's.. gone... his rocket spun out of control, and I forgot to add a parachute. At least he went out happy smiling at me in the bottom corner of my screen.. 10/10 super fun game!! :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a bit of a learning curve, which can be extremely smoothed over and overcome easily with YouTube tutorials. I waited for it to be on sale for a while because I thought it would be a silly little game I'd enjoy for a short while and probably move on from. Let me tell you.. I'm >40 hours in and I feel like I've only played it for 8. Once you get the basics, there's a steady growth in skill and understanding of the principles and it just becomes pure FUN, the time flies playing this game. I landed a Kerbal on the Mun, didn't have the fuel to get him back into Lunar Orbit for extraction, and he was stranded. I then built an unmanned craft to rescue him, only to realize my comms failed on the far side crater of the Mun, where my guy was stranded. This led me to build a simple pair of Polar and Equatorial Satellites for communication. Finally, after this, I got my stranded Kerbal to Lunar orbit, but not enough fuel to get home. Thus, I had to improvise and attempt a Rendezvous rescue and spacewalked him to the rescue craft. Just this little silly go to the Mun and back contract forced me to learn about satellites, comms, unmanned craft, solar eclipses affecting your craft's power (or lack of), how to land and take off efficiently in a vacuum, how to rendezvous and essentially perform a live docking, and has forced me to think about future infrastructure improvements in communication via planetary satellite systems that I will launch in the future to make future missions more smooth. Holy cow, I am absolutely addicted. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game was excellent to play, however the launcher combined with a few dozen mods make for a long or completely failed startup.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My most played game on Steam, Kerbal Space Program is awesome!  Warning, very addictive once you start building and flying (sometimes exploding) rockets you just can't stop!!!  Highly recommend this game to everyone!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After almost 200 hours in this game I can easily say that it is worth any price, especialy when you like science and physic lessons. Amount of mods for this game is incredible, so even when it will bore you, you can just try some of them. They are giving you much more planets and moons, new parts of spaceships, and they are better than oficial extensions at, usually, for free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "definitly recomend this game i got jeb bill and bob stuck on duna for 19 years and got a computer when i saved him good times",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a fun game but some parts are blocked off from one of the dlc's but other than that its a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game that lets you make any goofy rocket you want to on the way to success",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun realistic a bit hard to turn planes but over all a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice graphics \r\nplayes for3 months and its very good except at first you need to learn the controls but once you get the hang of its  a very good game \r\nw",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This was quite possibly my first ever purchased game on steam. It was so long ago in fact, that in the years since I've made my way through to college. And, even though its development is long gone, I still regularly come back to play it like no other game. It isn't exactly for everyone, and that shined true for many of those who I find myself accompanied; but, for me, it was like no other. Kerbal Space Program truly is the titan of its niche, it is quite possibly the greatest spaceflight simulator, and builder, of all time. Whilst the graphics are dated, and you'll find yourself accompanied by lag some time in, you yet can still find yourself years into a game, discovering yet new sights, and achieving yet undiscovered feats along the way. To put it simply, Kerbal Space Program is one of my most cherished games among my collection, and it is a fair shame that it's development and sequel got shelved.\r\n\r\nTempus iucundum erat, vetus amicus. It was a nice time, old friend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes it is a good game with a lot 2 do and a differnt solar system makes the game alot more fun but DONT try to go back in time this absolutly dismantled my copy and it now refuses to open and i no longer have any of my data it was fun while it lasted tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My average KSP experience\r\n1. Load into game.\r\n2. add another new save to the pile\r\n3. Go to VAB.\r\n4. Try to make moon rocket.\r\n5. launch rocket and realize i have no idea what im doing.\r\n6. overshoot and run out of power.\r\n7. cry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Only played for 30 hours. Will play for 30,000 more.\r\nIf you can launch the same rocket 40 times improving 400 more, and still failing yet still trying this is for you.\r\n\r\nPlease dont get mods that arent Visual ones.\r\nPLEASE\r\n\r\ndont buy KSP 2, it looks nicer and thats about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "once you learn the basics this game allows a high level of freedom to make some crazy things and play the game how you want",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so fun, yesterday I played for 3 hours strait after school.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My proudest achievement so far is launching a rocket that immediately flipped upside down, spun like a blender, and exploded so violently that my monitor flinched. Jebediah is still smiling though, which I think means he’s either fearless or concussed.\nI’ve made more “accidental submarines” than functioning rockets, my space station is now “orbiting” somewhere under the ocean, and every launch costs more virtual money than my real car. I once forgot parachutes and just stared silently at the screen as my brave little green dude plummeted back to Kerbin like a meteor of regret.\n10/10 would defy the laws of physics (and common sense) again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "IT IS KSP ... real good, lots of great mods, an amazing community, a bit of a learning curve to figure out how to do anything. There are a lot of terrible in game tutorials, but you can just go to youtube and learn how to do anything from a ton of great creators. Also, don't play KSP 2, that game sucks.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Always check your staging!\r\nEasily one of the best games of all time, responsible for teaching me almost everything i know about space travel (thanks scott manley) <3\r\n\r\nFly safe!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's good for it's price. It prioritizes physics over fun so at times it can be a bit frustrating, but it's pretty cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is very fun if you are a good builder because you can build a lot of different aerospace vehicles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game has helped me with calculating tragectories and making sure there is enough fuel and more this game is helping me in school to thank you squad!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great realistic and stupidly funny space game, would recommend once its on sale!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun and educational. If you're into space exploration, this game is for you. it's old but all the mods available can make it so beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Quite possibly the best sandbox game I have played. (No, minecraft doesn't count). Arguably the most realistic space exploration game in existence. You can quite literally spend hundreds of hours learning about the design challenges and piloting challenges of rockets and spacecraft, then take those spacecraft and colonize the solar system with ground bases or orbital space stations. There's something about that that just screams freedom to me, build anything you want, go literally anywhere within the solar system (and this isn't like a toy solar system like in Outer wilds, this is actual solar system scale). The game has an extremely steep learning curve, this IS rocket science, but its also very rewarding to get into.\n\nMy only complaint is that the game is a true sandbox, there are only 2 things you could potentially consider game objectives. The first is career mode. This is a game mode where you need to do quests to earn money and unlock parts. It's better than nothing but kind of artificial, the quests are procedurally generated and while there is some novelty to figuring out how to complete them when you start out, or even how to minmax the quest rewards by completing multiple quests at once, its not THAT compelling. This is generally how I play the game though. The second is the anomalies, on select planetary bodies and moons (most of them as far as I am aware) there are strange structures for the player to find. It's kind of like a easter egg hunt to find them all, again, not that much of a motivator but its something. Other than that you are working with self imposed goals and challenges, if you are the type of person that enjoys self directed play you will feel right at home here.\n\nI'll also briefly mention that the game has a rich modding scene with tonnes of gameplay, content and quality of life mods, ranging from robotics to new planets to explore etc. Did I mention that this game also has aviation? Cause it does, as if space exploration wasn't enough, you can also build planes.\n\nAll in all, if you are looking for a challenging sandbox game that is one of a kind, this is it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hey devs if your still out there and your reading this i wanna say that your game is still a sucessful game and that's all i wanted to say✨",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Kerbal Space Program is an amazing space simulation game. It’s challenging, creative, and incredibly rewarding. Learning how to build rockets and reach other planets feels great, and even the failures are fun thanks to the Kerbals’ humor. If you like science, engineering, or just experimenting, this game is a must-play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "jeb got launched into the vast vacum of space at about 8 sextilion meters per second by the very failed orbit around jool.  very nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun game! (quick warning: very time consuming tho so buy only if u can invest in learning from guides)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "legendary status game with infinite modding possibilities. you'll want this one in your library for sure",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I grew up with Kerbal Space Program, and it’s one of those games that stays with you long after you stop playing. It’s the perfect mix of curiosity, chaos, and creativity. The first time you manage to reach orbit — or explode spectacularly trying — you realize just how special this game really is.\n\nThere’s something magical about how it teaches you real rocket science without ever feeling like homework. You learn through failure, you celebrate small victories, and you start to see space not as an unreachable place, but as a playground for ideas. Every launch feels personal, every mission an adventure.\n\nAnd then there’s the music — that iconic, hopeful soundtrack that captures the feeling of discovery perfectly. It’s calm and inspiring all at once, the kind of music that makes even your smallest milestones feel epic. Hearing it swell as your ship breaks through the atmosphere still gives me chills.\n\nThe charm of the Kerbals, the humor, and the sheer joy of exploration all come together to make something timeless. Even years later, Kerbal Space Program remains one of the most inspiring and rewarding games ever made — a true celebration of imagination, curiosity, and reaching for the stars. 🚀",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i’ve only played 64 hours and i have managed to get to duna back to kerbin. This game is a lot of fun but you will need to watch a lot of tutorials in order to understand the game. 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great game, if u dont play for a while you will forget how to play, great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you like space exploration and simulator games I really recommend picking up Kerbal Space Program",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really fun game and exciting to learn and play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is super good. But optimization and bugs... \nGame is very realistc. Asteroids are so many. comets are really cool!\nKerbal space program are cool. Physics realistic., Asteroids and comets are many. And!!! Can make funny crations. \nSo KSP is very good I recomend.\nSquad Thank you!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorites of all time. I built model rockets as a boy, but never imagined I could ever learn as much as I did just playing this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game. was my childhood favorite. sometimes I come back to it, just to live my childhood a bit.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I liked that it is so realistic and a little hard but, no one likes easy games so hard is fun.I didn't dislike anything, I love space and engineering. I recommend it for people who are looking for a challenge.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An amazing game if your into building planes and rocket ships and love flying them,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ever want to build a space ship and believe in the human need for exploration, this is your game, become video gaming rocket science with this adorable spin into the maddening calculations of spacecraft.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "With this game, few mods and JSBSim/GMAT I'll become a GNC engineer. If you like rockets and space then this game is the one(KSP>KSP2)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun, can spend hours playing this game, although it may not be for some as it has a rather steep learning curve.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Taught me space travel mechanics, and gave me an appreciation of orbital mechanics and physics. Haven't fed my kerbals once though, or given them any bathroom breaks. Kinda just stuff 'em in the smallest can possible, all alone with no communications or entertainment, barely a window. But they love it. So it is perfectly ethical in my opinion.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "use to play on console and was always disappointed by the graphics, so i was thrilled when ksp 2 came out... we all know how that ended up. saw this on sale the other day and downloaded the game aswell as the dlcs and i am happy to say that im not disappointed. definitely needs some graphical mods to enjoy a little more, but the community has so many free mods that are super easy to install. would 100% recommend this classic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very good plus educational. Good to learn in a fun way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Complex and I had to go to YouTube for additional help. It's a fun challenge if you are interested in space flight.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game\n10/10\nrip jeb and the other 50 kerbals that died on my missions",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i can barely make it to minmus without the rocket exploding still pretty fun to launch kerbals into suicide missions tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome and accurate physics. Can be a bit hard if you're a beginner.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool game but contracts are REEEAAALLY buggy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome Game.  Somewhat dated, highly recommend mods once you get the hang of it.  Does not hand hold, which is nice but frustrating at times.  lots of guide videos out there for beginners.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "truly a classic.\ni've killed more kerbals than this game has players at this point, so if you're reading this review, i need you to change that",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "classic space game but the publisher killed it\r\ndon't support the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In a vacuum, this is actually a really good game. If I were in a different mood I'd actually recommend it.\n\nHowever, below the surface it's a complete and utter s###show. From what I understand, the original developers either sold off the property or were bought out wholesale by another publisher. While that's not a problem in and of itself, this publisher has mismanaged KSP into an early grave. They killed the sequel that people were already playing and paying money for early access to, they've gone all but radio-silent on KSP other than to sell new merch, and they're generally just milking the property dry without actually providing a single ounce of actual value to the IP or the consumer.\n\nI'm not going to recommend you pirate a game illegally. But, on a completely unrelated note, if ever there was a game that the publisher didn't deserve to profit off of... this might be the one.\n\nIt's a great game and it should be played and appreciated. But its new owners shouldn't be rewarded for running it into the ground.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "after trying for an hour to make opt-out data collection and not succeed i lost mood for this game. we'll see some day but idk.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dogshit physics and the career/science modes are a little lack-luster. also good luck trying to take it seriously in career/science mode because things like to explode if you look at them wrong.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "says payable on steam deck but the controls on it are disgusting you fail to mention you need a keyboard, not impressed at all, a great game failed by bad controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ive ever played spent hours dying over and over again the ui is impossible to figure out get ready to look up a tutorial if you want to do the most basic gameplay. 0/10 complete waste of money never seen a worst game in my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogshit physics and the career/science modes are a little lack-luster. also good luck trying to take it seriously in career/science mode because things like to explode if you look at them wrong.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can,t luntch any of my rockits pls someone like the develipor fix this bug",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun for a time but there is a sense of \"so what?\" when you actually achieve something. Without mods there is little depth to the actions you do. Going to planets or moons is really just to unlock science to get more parts to do the same thing but slightly different. \r\n\r\nThis is also not mentioning the bugs and weird save system that finally got me to tap out on replay. I just lost several hours of progress due to some weird orbit glitch that made my ship disappear when I switched camera views. And the autosave somehow didn't kick in, and my quicksaves either got overwritten or didn't work, so I was set back hours. \r\n\r\nIt really made me think though, what's even the point in trying again? What actual goal is there beyond an arbitrary sense of accomplishment? If loading from saves is also so fragile, what's the point of doing persistent missions? I was trying to land three craft next to each other on Minmus for a base. Every time I loaded a save they would jostle around and float in the air. What's the point of doing something the game isn't equipped for? It seems like all the effort went into the rocket building, and not enough into exploration missions or base building. \r\n\r\nYou could probably max out the science just by flying around Kerbin and maybe flying around Mun once or twice. The depth in this game is what you make of it, but when it bugs and doesn't allow that freedom, I see little point in fighting the game to be something that it is not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks but im a fat virgin loser addict",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too scary for little ole me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Better to watch than to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant load in",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "KSP 1 is a great game but you should absolutely not buy it regardless.\n\nThe game is amazing and has amazing mods as well. Probably a 9/10 still to this day.\n\nHowever, the publisher was bought up by a private equity firm called Haveli Investments. Development on KSP 2 was shut down despite them selling it in early access, the developer was disbanded, and now they are dropping scummy merchandise drops for KSP 1.\nThis equity firm is showing that they are not interested in having any game developed or published, they are just greedy and want money for doing nothing. Please do not give it to them.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "In a vacuum, this is actually a really good game. If I were in a different mood I'd actually recommend it.\n\nHowever, below the surface it's a complete and utter s###show. From what I understand, the original developers either sold off the property or were bought out wholesale by another publisher. While that's not a problem in and of itself, this publisher has mismanaged KSP into an early grave. They killed the sequel that people were already playing and paying money for early access to, they've gone all but radio-silent on KSP other than to sell new merch, and they're generally just milking the property dry without actually providing a single ounce of actual value to the IP or the consumer.\n\nI'm not going to recommend you pirate a game illegally. But, on a completely unrelated note, if ever there was a game that the publisher didn't deserve to profit off of... this might be the one.\n\nIt's a great game and it should be played and appreciated. But its new owners shouldn't be rewarded for running it into the ground.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "they stopped development for this game to focus on the sequel, but the sequel was the same game but worse at every metric and then they decided to abandon both projects, those games are pretty much dead.\n\nbut hey, as the time of writing (31-08-2025) you can pre-order merchandise so the studio might be dead but someone is milking money out of it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "1 / 10 - This game didn't work very well on our computer. This game is meant for gaming computers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after trying for an hour to make opt-out data collection and not succeed i lost mood for this game. we'll see some day but idk.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "says payable on steam deck but the controls on it are disgusting you fail to mention you need a keyboard, not impressed at all, a great game failed by bad controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ive ever played spent hours dying over and over again the ui is impossible to figure out get ready to look up a tutorial if you want to do the most basic gameplay. 0/10 complete waste of money never seen a worst game in my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogshit physics and the career/science modes are a little lack-luster. also good luck trying to take it seriously in career/science mode because things like to explode if you look at them wrong.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can,t luntch any of my rockits pls someone like the develipor fix this bug",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun for a time but there is a sense of \"so what?\" when you actually achieve something. Without mods there is little depth to the actions you do. Going to planets or moons is really just to unlock science to get more parts to do the same thing but slightly different. \r\n\r\nThis is also not mentioning the bugs and weird save system that finally got me to tap out on replay. I just lost several hours of progress due to some weird orbit glitch that made my ship disappear when I switched camera views. And the autosave somehow didn't kick in, and my quicksaves either got overwritten or didn't work, so I was set back hours. \r\n\r\nIt really made me think though, what's even the point in trying again? What actual goal is there beyond an arbitrary sense of accomplishment? If loading from saves is also so fragile, what's the point of doing persistent missions? I was trying to land three craft next to each other on Minmus for a base. Every time I loaded a save they would jostle around and float in the air. What's the point of doing something the game isn't equipped for? It seems like all the effort went into the rocket building, and not enough into exploration missions or base building. \r\n\r\nYou could probably max out the science just by flying around Kerbin and maybe flying around Mun once or twice. The depth in this game is what you make of it, but when it bugs and doesn't allow that freedom, I see little point in fighting the game to be something that it is not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks but im a fat virgin loser addict",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too scary for little ole me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Better to watch than to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant load in",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "classic space game but the publisher killed it\r\ndon't support the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In a vacuum, this is actually a really good game. If I were in a different mood I'd actually recommend it.\n\nHowever, below the surface it's a complete and utter s###show. From what I understand, the original developers either sold off the property or were bought out wholesale by another publisher. While that's not a problem in and of itself, this publisher has mismanaged KSP into an early grave. They killed the sequel that people were already playing and paying money for early access to, they've gone all but radio-silent on KSP other than to sell new merch, and they're generally just milking the property dry without actually providing a single ounce of actual value to the IP or the consumer.\n\nI'm not going to recommend you pirate a game illegally. But, on a completely unrelated note, if ever there was a game that the publisher didn't deserve to profit off of... this might be the one.\n\nIt's a great game and it should be played and appreciated. But its new owners shouldn't be rewarded for running it into the ground.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1 / 10 - This game didn't work very well on our computer. This game is meant for gaming computers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after trying for an hour to make opt-out data collection and not succeed i lost mood for this game. we'll see some day but idk.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "says payable on steam deck but the controls on it are disgusting you fail to mention you need a keyboard, not impressed at all, a great game failed by bad controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ive ever played spent hours dying over and over again the ui is impossible to figure out get ready to look up a tutorial if you want to do the most basic gameplay. 0/10 complete waste of money never seen a worst game in my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogshit physics and the career/science modes are a little lack-luster. also good luck trying to take it seriously in career/science mode because things like to explode if you look at them wrong.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can,t luntch any of my rockits pls someone like the develipor fix this bug",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun for a time but there is a sense of \"so what?\" when you actually achieve something. Without mods there is little depth to the actions you do. Going to planets or moons is really just to unlock science to get more parts to do the same thing but slightly different. \r\n\r\nThis is also not mentioning the bugs and weird save system that finally got me to tap out on replay. I just lost several hours of progress due to some weird orbit glitch that made my ship disappear when I switched camera views. And the autosave somehow didn't kick in, and my quicksaves either got overwritten or didn't work, so I was set back hours. \r\n\r\nIt really made me think though, what's even the point in trying again? What actual goal is there beyond an arbitrary sense of accomplishment? If loading from saves is also so fragile, what's the point of doing persistent missions? I was trying to land three craft next to each other on Minmus for a base. Every time I loaded a save they would jostle around and float in the air. What's the point of doing something the game isn't equipped for? It seems like all the effort went into the rocket building, and not enough into exploration missions or base building. \r\n\r\nYou could probably max out the science just by flying around Kerbin and maybe flying around Mun once or twice. The depth in this game is what you make of it, but when it bugs and doesn't allow that freedom, I see little point in fighting the game to be something that it is not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks but im a fat virgin loser addict",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too scary for little ole me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Better to watch than to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant load in",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit Game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "classic space game but the publisher killed it\r\ndon't support the game",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "In a vacuum, this is actually a really good game. If I were in a different mood I'd actually recommend it.\n\nHowever, below the surface it's a complete and utter s###show. From what I understand, the original developers either sold off the property or were bought out wholesale by another publisher. While that's not a problem in and of itself, this publisher has mismanaged KSP into an early grave. They killed the sequel that people were already playing and paying money for early access to, they've gone all but radio-silent on KSP other than to sell new merch, and they're generally just milking the property dry without actually providing a single ounce of actual value to the IP or the consumer.\n\nI'm not going to recommend you pirate a game illegally. But, on a completely unrelated note, if ever there was a game that the publisher didn't deserve to profit off of... this might be the one.\n\nIt's a great game and it should be played and appreciated. But its new owners shouldn't be rewarded for running it into the ground.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "1 / 10 - This game didn't work very well on our computer. This game is meant for gaming computers.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "after trying for an hour to make opt-out data collection and not succeed i lost mood for this game. we'll see some day but idk.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "says payable on steam deck but the controls on it are disgusting you fail to mention you need a keyboard, not impressed at all, a great game failed by bad controls",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "worst game ive ever played spent hours dying over and over again the ui is impossible to figure out get ready to look up a tutorial if you want to do the most basic gameplay. 0/10 complete waste of money never seen a worst game in my life",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "dogshit physics and the career/science modes are a little lack-luster. also good luck trying to take it seriously in career/science mode because things like to explode if you look at them wrong.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can,t luntch any of my rockits pls someone like the develipor fix this bug",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's fun for a time but there is a sense of \"so what?\" when you actually achieve something. Without mods there is little depth to the actions you do. Going to planets or moons is really just to unlock science to get more parts to do the same thing but slightly different. \r\n\r\nThis is also not mentioning the bugs and weird save system that finally got me to tap out on replay. I just lost several hours of progress due to some weird orbit glitch that made my ship disappear when I switched camera views. And the autosave somehow didn't kick in, and my quicksaves either got overwritten or didn't work, so I was set back hours. \r\n\r\nIt really made me think though, what's even the point in trying again? What actual goal is there beyond an arbitrary sense of accomplishment? If loading from saves is also so fragile, what's the point of doing persistent missions? I was trying to land three craft next to each other on Minmus for a base. Every time I loaded a save they would jostle around and float in the air. What's the point of doing something the game isn't equipped for? It seems like all the effort went into the rocket building, and not enough into exploration missions or base building. \r\n\r\nYou could probably max out the science just by flying around Kerbin and maybe flying around Mun once or twice. The depth in this game is what you make of it, but when it bugs and doesn't allow that freedom, I see little point in fighting the game to be something that it is not.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game sucks but im a fat virgin loser addict",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "too scary for little ole me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Better to watch than to play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant load in",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Shit Game",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}