{
  "positive": [
    {
      "review": "Enjoyed this so much when it came out, must have shot my way through at least 4 playthroughs. 100%-ing it is a bit of a chore, but doable. Vaas is one of the all time Great Antagonists.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "good game, little bit repetitive. the only thing is ubisoft connect ruin it",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Discover the Far Cry franchise with this one, as everybody was talking about it.\nDecided to give it a try and wow, I was not disappointed ! \n\nThe story is engaging, crazy, raw, funny and wild. The map is huge and you can really have fun with pretty much anything. And a big 👍 for the weed mission !",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I compleated this game more then 50 times and it is still best shooter in world...",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "amazing game amazing story its worth the price.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "\"Did I ever tell you what the definition of insanity is?\n\nInsanity is doing the exact same f*cking thing over and over again, expecting sh*t to change. That is crazy.\n\nBut the first time somebody told me that, I don't know, I thought they were bullsh*tting me so, boom, I shot him.\n\nThe thing is, okay... he was right. And then I started to see it everywhere I looked. Everywhere I looked, all these f*cking pricks, everywhere I looked, doing the exact same f*cking thing, over and over and over and over and over again. Thinking 'This time, it's gonna be different.\n\nNo, no, no, no please! This time it’s gonna be different.'\n\nDid I ever tell you the definition of insanity?\"",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "It's a classic a masterpiece by Ubisoft. It is fun, engaging, and interesting throughout, and was a massive success back in 2012 when it launched as a result. And even in 2025, it holds up extremely well, despite missing a few QoL features added in later Far Cry entries.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "100%, used to play it when i was very young, story pretty good ending is alright, some achievements are annoying like 'rocks always win' especially if you finished the game other than that Solid game. 8/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "My favourite FarCry game! \nI have played this game like 3 times (twice not through steam.. xD)\nThe story, gameplay and mechanics are really good, and even the cinematics in this is amazing, despite the fact that it was created back in 2012.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "FarCry is the best game series of al time with number 3 as the best of all 6, even with 2 being the first one i ever played. Ubisoft PLEASE START REMASTERING THIS SERIES PLEEEEAAAAASSSSSEEEEE.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "amazing game. Pirate it if you actually want to own it tho. ubisoft is anti consumer",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "\"Did I ever tell you what the definition of insanity is? Insanity is doing the exact same freaking thing over and over again, expecting things to change. That is crazy.\"",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The best far cry game in history story is good the game is good overall the gameplay is decent enough the graphics are not the best because it's an old game but over all it's a really good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is what Far Cry 2 should have been. Carefully crafted, detailed map with good variety of elevation and layout. Engaging story with interesting characters that makes you feel invested in the outcome. Fun missions. Good weapon variety and customization. Bloom on the scopes should probably be fixed. The reticles are basically unusable. Otherwise, the gunplay generally feels good. AI is a bit janky, but good for the time. \n\nOverall this is a very solid game that will remind you of better days and better games made by better devs. They don't make them like they used to.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 3 is an amazing game with a great story and fun open-world gameplay. It did crash a few times on my RTX 4060 since it’s an older game and not perfectly optimized, but locking the FPS to 60 made it stable. Still one of the best Far Cry games ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the best game ever made and you should play it, then immediately kys because its only downhill from there. trust me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and second best far cry game must play, recommend 100%",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun sandbox and open world to explore, one of my favorite games to replay from time to time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wasn't too terribly difficult a game which was disappointing but the story was pretty great, especially in the first half of the game. Exploring the island is also pretty fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Completed (11/27/2025) - Happy Thanksgiving! \n\nDid I ever tell you the definition of insanity? Insanity is, doing the exact same thing over and over again expecting different results. That. Is. Crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ah i love how the people in this game speak indonesian but i dont think it was culture accurate, im from SEA so i can say that most of it is bullshit, love the game tho, the mechanic, the gameplay, chef kiss",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My great grandpapi told me old stories of the things he and the boys did in the good ol days. glad to see they finally adapted his average summer break into a game into a masterpiece ill show my little scamps to tell em bout there ol pops.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Liked how the story was going, but what did it for me is the great combat system and gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game from this franchise so far. More realistic gameplay, unlike the newer far cry games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games  from the 2012 era worth memorable characters and amazing gameplay. Played it on the ps3 originally and came back to 100% it on PC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 3 is amazing! Great open world, intense action, and an unforgettable villain. Highly recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this banger back in 2012. Great Game. Nice Story. Nice Mechanics like crafting and weapon attachments and color/patterns. Also love the Burning down Weed Mission with the song by Skrillex and Damian Marley - Make it bun dem. Ahem got a spicy scene there too if i remember properly. Playing Poker was another fun thing. However i played this in 2025 again so i can relieve them old days but no the game crashes. It crashes when i head towards the underwater cave where i have to get some plants for making antidote to save Daisy. As soon as i get in water towards the cave entrance *blank*. Love the game but hate the crash. My opinion is if you haven't played this game do play it once. Also now i need to sign in to Ubisoft account everytime i wanna play the game. Got refund.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LOVED THE GAME the gameplay. story, jasons tranformation... tho.. i chose the alternate ending with Citra killing you.. and.. i was shocked.. and it left weird feeling in me.. idk what to say... i kinda think about it alot.. it was my first playthorught.. and.. i feel guilty that i chose the bad ending..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All around good game, I really like the story and the gameplay generally, Although, the mechanic of hunting I did find annoying, I wish that it was tied into the story a bit more, When I wanted to craft a bigger bag or something I would have to go far out of the way from the story just to hold more crack pipes or whatever. Besides that, the game is well worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brilliant Story & Gameplay. The Open world is fun and there is a lot to explore.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game can't handle the presence and power of a RTX 4070TI, to the point of crashing every 30 minutes. I've never restarted a game more in my life, in fact, I probably have more hours in the settings menu than actually trying to 100% this decade old game.\r\nHave I ever told you, the definition of insanity?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best FarCry game, very fun to run around the open world and liberate camps and such",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gameplay: 9/10\r\nNice combination of hunting, treasure hunting and action combat.\r\nHunting: The challenge made for the specialized weapon also good to introduce new weapon to players\r\nTreasure hunting: Everything excellent except the underwater treasure with aquatic animals nearby. They should have one weapon that can be used underwater.\r\nCombat: It's just generic shooting games but the upgrade for the weapon is not unlocked by the progress made it easy.\r\n\r\nStory: 10/10\r\nImmersive story with 2 endings. With the story development, you can feel the main character effort to resolve the problems.\r\n\r\nPerformance: 10/10\r\nThe graphic for the game is suitable for the released date of the game and as long as I remembered, there's no bug that I encountered.\r\nCPU: Ryzen 7 7800x3d\r\nGPU: Radeon RX 9060 XT\r\nRAM: 32 GB\r\n\r\nValue: 9/10\r\nWith the price of the game, you can spend 60 hours and complete 100% achievements in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Such a good game! it taught me the definition of insanity! \r\nSuch a good game! it taught me the definition of insanity!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crashes on PC, randomly, and runs just okay on the Deck... and the launcher sucks, BUT the story, and the game itself is pretty neat. It's like a time capsule, needs to be tweaked for optimization of most modern hardware, oh and no multiplayer.\r\n\r\nso-so recommend, I'm enjoying every hour however",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got all achivements for ts game and its was fire the achivements were annoying to get but the game was fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of my comfort-food games. Something I can come back to once in a while and just get lost in the gameplay loop grinding out and going for bases.\n\nBut damn why is it so buggy now? Why do I have to sign in every time?? My login isn't even saved. \n\nAlso it crashes unless I set it to DX9 which is fine but then it still crashes sometimes.\n\nAnd then it has frame rate DROPS which is just ridiculous. My old gaming laptop used to run it flawlessly. \n\nStill recommended but most other games I wouldn't bother trying to simply get them to work properly.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A game where a tourist becomes Rambo. Vaas taught me the definition of insanity — replaying the game again and again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finished this game eons ago before Steam, and loved it.\r\nPlaying now in 2025... hum now feels off, doing UX things that these days are smooth and ironed out, for example, the UI is huge, and cant be scaled down.\r\nPlays really well on Steamdeck.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Probably a very good game... played one sit down and after that the game cant load my save file. Just yeets me out by closing the game. I don't like when games require you to tinker and mess with the files to make it work. 10/10 I guess..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is legendary and goated i got the pack that gets all the far crys and this is the best one in the whole franchise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Considering all that happens, its a miracle that Jason Brody's story went on as long as it did, let alone even end.\r\n\r\nStrangely a bit of an emotional rollercoaster (story wise), youll get sad with Jason, happy with Jason, and especially mad with Jason.\r\n\r\nA beautiful, as well as fun game from a generally great era for video games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 3 isn’t just a great game, it’s the game that carved the path for the entire modern Far Cry series. Every time I play another Far Cry game, I can’t help but think, “Yep… this exists because Far Cry 3 set the bar so high.”\r\n\r\nThe story? Iconic. Vaas? One of the greatest villains in gaming history. The island? A perfect blend of beauty and chaos. The freedom? Unmatched at the time and still ridiculously fun today.\r\n\r\nThe crafting, the exploration, the sheer sense of wild adventure, Far Cry 3 got all of it right first. It’s the reason the formula even exists. The later games might go completely off the rails with it, but Far Cry 3 is the blueprint. The OG. The spark that ignited the entire franchise’s modern identity.\r\n\r\nEven today, firing it up feels like returning to where open-world FPS greatness was born.\r\n\r\nIf you’ve never played it, you’re missing the foundation of the whole franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "trip down memory lane! Vass was one of the best antagonist in a video at 2012 at the time spent so much time on the xbox now playing thru on pc would pick up if on sale look for the bundle sale of all the far cry series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is fuckin Far Cry 3 hermano the best Far Cry game. Fucking buy it. Fucking do it. Play the fucking game already. Do it bitch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft's best work, all the things are on point, totally banger, one of the best game i ever played  must play game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best story games I have ever played, just perfection. The map, characters, main villain, like nothing more could make it better. Definitely in my top 3 games. ,,Do you the definition of insanity?'' Quote goes hard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the gameplay was fun, the story was good\r\nthe only thing i didnt like about this game was that it kept crashing every 20 - 30 minutes\r\ni l",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, really enjoyed playing it. will surely recommend you guys to really it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but FUCK UBISOFT i'd better download it from torrent without ubisoft connect and other shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you haven't played Far Cry 3, you're missing out on a classic. The gunplay is solid, Taking over encampments is loads of fun, and exploring the map is a simple joy. \nThe game still holds up graphically today and the map is a beauty to trek through. \nMichael Mando as Vaas is such an iconic role.  I honestly wish they did more with him. \nI'd highly recommend picking up this game, especially on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely awesome game. I watched some gameplay videos and thought ehhhh I don't think it would be for me. But playing it was an entirely different experience. If you're on the fence I recommend you grab it while it's on sale and give it a go it is well worth it. Overall experience was fantastic, 9/10. \r\n\r\nAnd Vaas deserves some love he did a fantastic job with his voice acting.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great ambiance and story immersion.  Good graphics and gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so many vegetation for 2012 WOW\n\na reeal FAR CRY from it's peers of the time, which was LEGO BATMaM and MINECRAST\n\nenjoy UBISOFT and cherish the GENIUS villain and recognize the INSTANT classic\n\nvery crazy! some say they went too FAR...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Did I ever tell you what the definition of insanity is? Insanity is doing the exact same thing over and over again, expecting something to change.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is THE Far Cry game, all the ones after are repainting the same formula because this one sold so well,  good ol´ Ubisoft wont listen to their own writing, i guess the executives truly are... Insane",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is one of the best games i have ever played , and it's arguably the best game in the series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super game, the combat mechanism is super fluid with respect to time of game release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but it is poorly optimized and crashes alot for no reason",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A timeless classic, a phenomenon game, an INSANE experience. I'll start with some praises that I've heard before: the soundtrack and the OST, really fitting, the graphics still being amazing even to this day (sure I would say it looks like a 2020 game but it still holds up), Vaas, both how he is written and his voice actor, is the cherry on top, the Alice in Wonderland metaphorms and also the HUGE feeling of semi power creep once you start getting more skills (getting compensated with tougher enemies).\nNow to the small things I didn't like: random car spawns during outpost takeouts (Ik it's random but it can still be annoying), enemies having big sight range from time to time and Jason's voice actor lacking unlike all the other ones during cutscenes. I guess the first two complaints may lead to some negative thoughts (skill issue, which I would say it's 50-50) but the last one is true.\nStill totally recommend it even in 2025.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is goated but has aged quite poorly. Pick it up on sale if you'd like to experience where the current Far Cry formula started.\n\nPS Vaas is one of the greatest antagonists of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this game back during Christmas 2012, and at the time it was an amazing experience. Ubisoft recently added Steam achievements, which brought me back — and here I am in 2025, playing it again.\r\n\r\nI have to say, the graphics still hold up surprisingly well for a 13-year-old game. The biggest highlight is definitely the main antagonist — the now legendary Vaas. The gameplay? Honestly, I enjoyed it more than most recent titles.\r\n\r\nOne thing worth mentioning: optimization on modern systems isn’t the best. I had a few crashes until I switched from DX11 to DX9 — after that, the game’s been rock solid.\r\n\r\nIf you’re looking for a game that defines insanity, this is the one for you. Still an unforgettable and positively insane experience after all these years.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the OG's for the \"Area-hopping tower climber\" games. Casting, acting, animations are great and still hold up properly for 2025, the gunplay feels aged now but still holds up good.\r\n\r\nSolid game, 7/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's great. Fun gunplay, awesome setting, foreign baddies that speak in tounges, Nacho Varga, and Paper Planes by MIA, what more could you really ask for?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the games pretty good, the crashing every 10 minutes is not, if you download some third party software and fix the crashing though then its pretty good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played it day one on a GTS 250 that screamed louder than Vaas himself. Game still slaps in 2025. The vibe, the story, the freedom — pure chaos in paradise. Ubisoft accidentally peaked here. 🔥🏝️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7/10 \nNot the masterpiece YouTubers claim it is, the story is the best in the series bar none but is falls apart about halfway through when vass dies. \nPretty good game, not much i can say, really...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Did I ever tell you what the definition of insanity is? Insanity is doing the exact... same fucking thing... over and over again expecting... shit to change... That. Is. Crazy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the part where he rips a tooth out to heal himself\nVery realistic since i've done it once myself",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "El mejor Far Cry de toda la saga, cuando Ubisoft hacia grandes juegos, es recomendable para cualquiera que le interese en lo mas minimo disparar y ver una gran historia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "(Game #14 of my 2025 100% Marathon.)\nThis was the second game of my 2025 list that gave me a feeling of phantom nostalgia, and one of the games that I fully believe deserves all of the praise heaped at its feet. FC3 stands a triumph of ludonarrative cohesion, telling a story of one man's descent into insanity and loss of himself at the hands of an island that seeks to exploit anyone who finds themselves there. The story and characters are engrossing, bolstered by rock-solid gameplay and a tight mission structure. My only gripes are with some of the visual quirks that come with many early 2010s games, such as over-tuned screen-space ambient occlusion (dark halos around objects), and Bloom (with a capital B) that oftentimes blows out the white values in the sky. Some mods are available to address some of the outdated visuals and I suggest you give them a look. The 100% grind for this game is not reflected in Steam achievements, so if you are only achievement hunting, you will wind up doing roughly 75% of the content, with the rest being samey assassination or hunting missions, and hunting for relics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignoring Ubisoft as a company\nThis game is honestly a work of art",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome experience. Lots of things to do and to find in the island. Far Cry franchise never dissapoints.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A murder playground, with a plot that works because it acknowledges the player's actions/gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best depiction of imperial colonialism ever! 11/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Far Cry 3 – Ubisoft’s Masterpiece 🔥\r\nUbisoft cooked with this one. A perfect mix of chaos, freedom, and storytelling. Vaas is one of the greatest villains ever, the island feels alive, and every moment is pure adrenaline. Still unmatched after all these years.\r\n\r\n“Did I ever tell you the definition of insanity?”\r\n– Vaas\r\nRating: ★★★★★",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Story line was awesome! but collecting all those items.... Mama Mia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Crazy ass villain, awesome soundtrack, and the best mission of all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "did I ever tell you what the definition of insanity is?\nI love Ubisoft; one of their greatest works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Проходил ее очень давно, а как появился хороший пк решил перепройти и насладиться ей",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best far cry game and a AMAZING story 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fat man cries 5, game is pog. 9/10 Jason Brodies would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I want Citra to step on my balls. Pc port was ass tho.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game for transgender people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rare win for ubisoft cause they removed the online achievements, making the steam version less of a chore when it comes to getting one hundred percent. Still the best game series despite falling off a bit when you hit the second island.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Could not stop playing this. Awesome game. Wish I'd bought it sooner!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "after a decade, it still kicks ass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game but requires work around",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is very good but game crashes sometimes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "still the best far cry in 2025. a remake of this game would be the shit",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Прикольная игра но сука ебучие юбисофт не дают нормально поиграть",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still the best Far Cry of all. Masterful game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh yes you get kidnapped by a drug and human trafficker very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Кого бля ты бля? Их бля, или их бля? НАААААС, или САААААС!?\"  -  Ваас Мотомото (Цитаты Мудрейших)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um jogo incrivel continuo amando",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Glad they brought back the achievements for this classic.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This games still holds up in 2025, Super enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i dont know how 4 was a literal downgrade in every sense compared to this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "learned poker for an achievement. 10/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best Far Cry ever made, hands down.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "have to sign in every time you open the game, ubisoft is actively stopping work arounds but not fixing the issue",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "Ubisoft Connect Sucks, My game got hacked without me knowing and I can't do shit since Ubisoft sucks ass. Support steam, but fuck Ubisoft and I hope they burn and go bankrupt over this shit.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Will not launch because Ubishit likes launching things only on their launcher. Tried everything to get it to open. Fuck you Ubisoft",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Even after all the fixes I managed to find a mission I cannot beat due to constant crashing. \r\n\r\nEverytime I booted up the game to go to the mission \"infiltrating the ship\" the game just crashed earlier and earlier. As much as I wanted to beat this game there are better ways to use my time rather than trying to fix a game that had 0 thought put into it's future proofing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashes constantly, literally unplayable",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is good, but it is unplayable for me. I tried multiple fixes but the game crashes at least once an hour, usually more often. A couple of times it would not een let me load a save, each time requiring a different fix. On some random reddit post I saw that apparently the game hates cpus with more than 8 cores, maybe that is it. After [spoiler] killing vaas and [/spoiler] reaching the lower portion of the map the crashes became more frequent so I gave up on the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is ok for an old game, but it is constantly crashing. And no real solution online. Just suggestion....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not actually playable, no matter which settings are used. Crashes every 2-5min.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game on PC is completely broken. Tried every single possible fix out there including disabling cores on my CPU, game will NOT launch at all. Think it may have something to do with the absolutely retard ubisoft connect app just HAVING to launch to play any shit game they've ever released. I was playing it completely fine on my xbox 360 and wanted to get more than 15 fps so I bought it to play on pc and the game doesn't launch at all. The game itself is phenominal, but cannot be played on pc. Will just keep playing on my 360.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Demands Ubisoft login to start game. Also silently installs Ubisoft Connect onto you computer and litters a shortcut to it onto your desktop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They took away the cooperative & multiplayer modes. I want a refund.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "One of the best games in the far cry series. I picked it up on sale. It has constantly crashed the further into the game I've played. Tried a lot of things. Older games honestly have bad ports, I'm not sure if I blame the developer. As of now, the game is pretty much broken. I would recommend finding another way to play this game. I'll keep trying to fix it just so I can enjoy the re-run, but avoid purchasing this copy of FC3 to avoid the hassle.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Awesome game, however I just paid full price for a STORY game that i'm not even sure i can play offline. not only that but ubisoft requires you to log in to it's bs portal EVERY TIME you boot the game, and there is not a save password option. ubisoft, why do you hate us? :(",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Crashes constantly, especially when saving progress.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm writing this on 11/29/25. It's a fun game but unplayable on steam in 2025. Too many technical problems. The game was designed for systems from almost 15 years ago. It freezes, crashes, has audio problems, etc. I solve one problem and then there's another.\r\n\r\nNot a big deal. The game did not cost that much. I'll watch the cut scenes on youtube or something.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DID I EVER TELL U THE DEFINITINION OF INSANITY? yeah that this game crashing after every mission loading in and then u have to start the WHOLE mission again. ubisoft back again with the instead of doing a good game making the player waste lifetime in the game instead of making a good game crashes the whole time. hope woke ubisoft will die and get bought by a company what actually wanna make good games",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not only do I have to enter my f***ing Ubisoft account password in the f***ing Ubisoft launcher every time I launch the game because there's no \"remember me on this device\" feature, but today I also encountered a problem where, because Ubisoft services are unavailable, I can't log into my f***ing account in the f***ing Ubisoft launcher to play this f***ing game.\r\nOkay, the game is actually pretty good, so I don't recommend the f***ing Ubisoft launcher, not the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is literally unplayable past around 20 minutes. It crashed and now won't even start. Tried launching it directly from the application. Tried launching it from Steam. Tried launching it directly from Ubisoft Connect. Tried two online \"fixes\" regarding DirectX versions. Now I'm waiting for it to re-download to re-install it before trying \"fix\" #3. If I ever get this working I'll update this review.\n\nUpdate: install #3, fix #6, none of it worked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Great game.  Enjoyed for awhile but, now it crashes and fails to load so much I don't have the time for it.  The game requires a lot time as is with not being able to save progress mid mission.  Have to get to a check point and that may take over a hour.  Doesn't remember my settings either.  Have to set fullscreen and medium graphics everytime.\r\n\r\nShame.  FarCry 2 was one of my all time favorites.\r\n\r\nI am uninstalling this and glad I only spent a few bucks on it while on sale.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game but ubisoft connect is cancer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this game, or any other Ubisoft game. I just wanted to Play AC and Farcry again after years and you can only play with an Ubisoft Connect account....\nAt this point I was already pissed, but I thouht to myself I quickly make an account and play. That's were I was wrong. Made an account for a service I didn't even want and finally wanted to play my games I  paid for. After account creation it wanted me to confirm my email, which I did, only to be forwarded to the loggin screen again. Entered the same loggindetails I just entered 30s ago. There was a problem. Wrong Email or Password. \nWTF! \nIn disbelieve I tried the same eMail and Password again and got my account susspended for fishy behaviour or some BS.\nSo I paid for a SINGLEPLAYERGAME I can't play rn because I supposedly messed something up registering for a service I didn't want in the first place.\nI just wanted to play an over 10 year old game and now I'm angry and sad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "unplayable on newer software it stutters and freezes every 20s sadly i already missed the refund window, also ubisoft launcher is probably a sign that u should not buy the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The story, characters, and overall setting never really grabbed me. On top of that, the gunplay feels off, the weapons come across as odd and weightless, making combat surprisingly unsatisfying. Despite all of Far Cry 2 flaws, its atmosphere, tone, and more grounded gameplay kept me far more invested.\r\n\r\nLooking back, I think I let the overwhelmingly positive reception push me into trying to finish Far Cry 3 more than once, but honestly, it’s just not the game for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game doesn't even have online play anymore and i have to log into some long lost ubisoft account to play? Ubisoft products are complete ass with this bullshit. Let me just launch the fucking game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft launcher that crashes the game every time i take damage\n COOL Gimme money mfers",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cool game. Came back to this to replay it after a year or two, and the first mission on master difficulty, when i have to run from vaas and his lackeys, is an absolute shit show for its rng. 25+ tries and multiple videos pulled up, and somehow no-one else is struggling from the fact the enemies are literally hitting every single bullet on me like im marked for death by the CIA. Maybe it's horrendous luck or, maybe its just crappy old bitchass game design.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Having to sign in to play a singleplayer game is wild. 0/10. If I wasn't gifted this years ago I'd return this immediately.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have loved this game since it came out. So I decided to give it a try now that I have a bit of free time. Well the game is brilliant the actual running of it is a nightmare. I have tried running it in compatibility mode. I have tried everything the internet suggests even going so far as to disable all but one CPU core. I would want everyone to play this game if they hadn't, unfortunately there is no real way to actual play and enjoy it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a fantastic game, the visuals still hold up even for a game from 2012 in my opinion, there is some great voice acting, Vaas in particular and the world is just fun to explore with plenty of open world activities...\n... but in it's current state it is unplayable. I am experiencing constant crashing. I don't know if it is my location on the map (cannot fast travel away or move more than a few hundred metres), or if it is just a point of the story (need to go meet Cintra).\nOh and the Ubisoft launcher! Needs confirmation every time I want to play, asks me to re-authenticate which it sometimes fails to do... come on Ubisoft! You added the steam achievements so that gives me hope you've not completely forgotten about this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "For me it's a pass. I did not enjoy this game as much as i thought i would. Vaas is probably the only thing i enjoyed and he's not even the main point of the game. This was the start of Ubisofts downfall. It's just one big checklist with not much substance to hold it all together. The main character is vaguely interesting but makes dumb decisions so much it became annoying. The game play is way too basic to really say it's fun. Just an all around disappointment for me.\n\nTldr: Vass is cool but couldn't save a dull, repetitive, Substance lacking experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't get the game to run on Windows 11. Tried compatability mode. Tried reducing the number of cores my CPU is using. Tried patches. Nothing works. At this point I'd rather them just remaster the game so I can repurchase it so I stand a chance at actually playing the game. \nShame. One of the most iconic games of all time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If Ubisoft cannot connect to the internet, you cannot play the game you paid for.\r\n\r\nAlso buggy with weird weapon balance and bad audio design, but that doesn't really matter because even if it was a masterpiece it wouldn't be worth buying.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft connect.\nYou have to enter your ubisoft account password every time you launch the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I used to play this on PS3 back in boarding highschool but since then I prefer to play on PC. I didn't have an internet connection at school so I played offline. You cannot do this on PC with this version because it forces you to log into Ubisoft Connect to play the game, and Ubisoft has broken every workaround we have... except the one I've been turning to more and more as it becomes more and more user friendly to do so.\n\nI'm getting my money back and playing the game elsewhere. Go to hell, Ubisoft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I am so happy Ubisoft shares are dropping to oblivion. They well deserved it.\r\nOnce a great game factory, now the cancer of the game industry.\r\nCan't even play the good old games anymore, thanks to Ubisofts customer unfriendly default - the main reason I will rather cut off my legs then ever again buy anything that has (part-)ownership of Ubisoft or any meaningful relationship with this annoyance of a company.\r\nF*ck You and happy dying!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I cannot in good conscience recommend anyone buy something locked behind the ubisoft launcher, that thing is cancer. besides that, it crashes constantly on modern hardware with stuttering, artifacting, pop-in and weird mouse issues on modern hardware.\r\nThe game itself was great back in the day though.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy. You must launch into UbiSoft connect each time, and it wont allow you to log in.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game crashes on launch before even loading a save, or crashes at the end of a cinematic scene that cannot be skipped, forcing you to watch the cinematic scene over again (and it's literally the opening one, no less), when not crashing the computer completely. Game is unplayable in a very literal sense. No wonder so few people have even the first achievement. Guess Ubisoft's such a small indie company they can't afford to fix stuff like this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "NOT COMPLETE-ABLE\n\nDoenloaded for and played on steam deck. Overall it looks great on steam deck Oled and plays relatively smoothly. I didn't change any settings or reduce graphic abilities and it ran mostly fine and looked beautiful. When situatioms get busy there can be a drop in frame-rate but it didn't last long enough or personally bother me enough to bother changing the settings.\n\nBUT - if you are the type of gamer who likes to roll credits on the games you play, then play a different version of this game. In the final mission \"betting against the house\" the difficulty gets ramped upto beyond nightmare difficulty. This is not a skill issue, its a known bug. Even when dropping the difficulty to the easiest, you hit a section where you get bombarded by missiles and you can not possibly see where they are coming from or prevent it. Tried for over an hour on this mission that should be a cakewalk by this stage. It is definitely a game breaking bug.\nAfter googling the issue to see others met the same fate on this mission and only a handful of people persevered long enough for the bug to \"fix itself\" after restarting multiple times, I just cannot recommend playing FC3 on steam.\n\nImagine spending 40+ hours on a game, upgradung all the skills, doing all the side missions and getting to the climax of the story and having to hit the \"delete\" button. Sheesh, don't waste your time or money.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Funny story. I wanted to select an appropriate username to express my feelings about the mandatory third-party launcher, but I just couldn't come up with a unique one.\n\nI finally settled on fuckubi745285.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It crashes when I try to load my save and start a new one; every time I try to play, it asks me to log in to Ubisoft.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "- Requires sh*tty Ubisoft Client to play\r\n- Doesn't even launch unless you limit your CPU to 31 or fewer cores\r\n- Random crashes\r\n\r\nCan't recommend it like this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Uplay and the crashes keeping me from my husband Vaas like an evil abusive father. But I love him, Ubisoft. I love him.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Does not start on a Windows 11 system .  Just hangs on the loading screen until you kill the process.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ubisoft please go bankrupt and get ur games off steam u are the biggest mistake in gaming history and deserve all the hate",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The protagonist is such a dudebro asshole I'd rather see him dead. Musik is all over the place, and way too aggressive. Whole game seems very waaaah dudebro aggressive alphamale warrior culture noble savage bullshit to the teeth. 2/5",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "VERY buggy on Windows 11.  Constant crashes and load errors.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game crashed more times than I killed enemies in total.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "why do i need to log in to another launcher to play a game i bought on steam?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "would be nice if I could past the splash screen",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck ubisoft connect im glad u vermin r going out of business",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cutscenes that cannot be skipped. Seriously: No.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubisoft please unlink my DAMN ACCOUNT",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "great game until screw ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Glitchy mess, can't change ADS sensitivity",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ubisoft software is infuriating",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Plin de crash-uri baiatu' cuifiatu'",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes constantly",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashes every few mins",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuckass ubisoft launcher bro",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "elek",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "keeps fucking crashing, the game itself is great and has one of the best antagonist among the video game industry, \n\na shame that Ubisoft doesn't bother optimizing the game for PC and forces the player to launch the game by the horrible launcher Ubisoft Connect, that asks you EACH time to sign in.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "Game is fun as hell, but ubisoft sucks lmao. why do i need to use that other (really bad) launcher? AND I have to type my ubisoft password EVERY TIME I want to play. At least they finally implemented achievements.\r\nOverall: 8/10",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Insanly good game, but it crashes every 15-45 min. Fix your shitty ass bugs Ubisoft",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "have to sign in every time you open the game, ubisoft is actively stopping work arounds but not fixing the issue",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Ubisoft Connect Sucks, My game got hacked without me knowing and I can't do shit since Ubisoft sucks ass. Support steam, but fuck Ubisoft and I hope they burn and go bankrupt over this shit.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Game would be great if it didn't crash so often. How a game this old is so poorly optimized makes no sense.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Keeps crashing. It's impossible to play. Ubisoft staff keep spamming the same comment too \"check out our website for fixes that don't work!\"",
      "voted_up": false,
      "votes_helpful": 23
    },
    {
      "review": "Will not launch because Ubishit likes launching things only on their launcher. Tried everything to get it to open. Fuck you Ubisoft",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is actually really, really good\nBut in the current state the game is in, i have to give it a negative review.\nIt crashes every couple of minutes which is killing the immersion",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Have fun spending 20 minutes trying to make a damn account for an OFFLINE game. Did I even play it? Hell no. I'd rather my money back than waste my time figuring this crap out, they can't even make their account creator work properly. Figures, it's Ubisoft",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Uplay requires entering password to launch the game, even after selecting 'remember me'.\r\nCrashed the entire system on first auto save after starting the 'tutorial' BSOD said memory registry error, the game is overwriting active memory.\r\nDownloaded a mod that  patches the game for Ubi, it also fixes QoL features in the game more or less to players wants. This fixed the BSOD but. . .\r\nFrequently crashes to desktop while auto saving progress. \r\nThe game is still requiring a password just to start the game. Uplay is already logged in and running, WTF is the point of remembering login if I have to enter them to play a SP game the I can mod the snot out of anyway? It is no wonder this games has such low achievement completion rates, no one plays it after they buy it...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Modern system does not accept it to work, you can make it (I managed to run game in 800x600, but it's completely not worth it), but I guess it is much easier to find some old device to run it, is it woth it? idk...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "When you buy this game and hit that play button you are immediately immersed in a hostile environment and suffer devastating losses. That's right, you have to make a ubisoft account before your character can hold a weapon. The game itself is decent if not a tad cliche, something to expect for its age. But wow, this game crashes a lot; and if it didn't crash, it stutters! There is also no reason to have a single player require internet connection to play or use.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Get ready to login to your ubisoft account every five minutes while this absolute gem of a game proceeds to crash nonstop and remind you that your comfort hobby is no longer fun or convenient and that those less stressful years of your life are long gone.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is sooo iconic. Great gameplay, great story, great visual. But UBISOFT CONNECT made it so horrible: suddenly crashing the game, always asking the password, sometimes freezing the game. IT BECOME SO UNBEARABLE.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Even after all the fixes I managed to find a mission I cannot beat due to constant crashing. \r\n\r\nEverytime I booted up the game to go to the mission \"infiltrating the ship\" the game just crashed earlier and earlier. As much as I wanted to beat this game there are better ways to use my time rather than trying to fix a game that had 0 thought put into it's future proofing.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game now has always online DRM. it prompts you to log in to Ubisoft every single time you launch the game and if you don’t have internet you can’t play. \n\nI’m refunding this garbage.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "sucks. crashes a lot and can't play when uplay does not work properly. just uninstalled it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashes constantly, literally unplayable",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Its a great game, but it does not run well on modern systems, tried every fix on the internet. Using a Ryzen 9 7950X3D 64 GB of DDR5 RAM and a RTX 4080 Super and i cannot even run at 50 fps and even if it did the stuttering makes it impossible to play",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is good, but it wont run on any new games, and it kept crashing for me. While i could play it, it was very good.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "FCK Ubisoft Connect, its horrendous, hell of a challenge just to launch the effin game. fck u.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "still one of the greatest Far Cry`s ever made but sadly it runs like Dogshit with the New Gen Pc`s. constant crashes, ubisoft disconnects, more crashes, loading problems, visual glitches where the whole map`s Floor is black and so on. i would love to go back to this Classic and run through the best Story with the best Antagonist ever but sadly its really hard just to be able to play even after tweaking every setting possible :(",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is a relic from an age where ubisoft wasn't the scummiest game company in the business. Gotta love a third party launcher.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Do not buy. Unplayable garbage. It crashes every other checkpoint",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game itself is good, but it is unplayable for me. I tried multiple fixes but the game crashes at least once an hour, usually more often. A couple of times it would not een let me load a save, each time requiring a different fix. On some random reddit post I saw that apparently the game hates cpus with more than 8 cores, maybe that is it. After [spoiler] killing vaas and [/spoiler] reaching the lower portion of the map the crashes became more frequent so I gave up on the game.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is ok for an old game, but it is constantly crashing. And no real solution online. Just suggestion....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not actually playable, no matter which settings are used. Crashes every 2-5min.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game on PC is completely broken. Tried every single possible fix out there including disabling cores on my CPU, game will NOT launch at all. Think it may have something to do with the absolutely retard ubisoft connect app just HAVING to launch to play any shit game they've ever released. I was playing it completely fine on my xbox 360 and wanted to get more than 15 fps so I bought it to play on pc and the game doesn't launch at all. The game itself is phenominal, but cannot be played on pc. Will just keep playing on my 360.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Demands Ubisoft login to start game. Also silently installs Ubisoft Connect onto you computer and litters a shortcut to it onto your desktop.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "can't play without an ubisoft account even tough my handlers is Valve. going to wait for the collective action against Ubisoft to see if i can collect on the courth judgement to get a refund outside of steam.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would rather get shot in the balls than play this horrible version of the game also fuck ubisoft connect",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "locked out of my game and account suspended, screw ubisoft so much let me play the game i SPENT MY GODDAMN HARD EARNED MONEY ON.\r\n\r\nif buying isnt owning as they say...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is fun. It's Farcry, duh. \r\n\r\nOne problem. Ubisoft.\r\n Scummy publisher that absolutely WILL remove games from your account if not logged in for a long time, or help you recover your account if you lose access to the associated email account. \r\nSteer clear of Ubisoft whenever possible.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Love the game, but it is unplayable, crashes every 40 mins, then at the helicopter scene with Vaas it just crashes every time, and after trying to run it again, it loads and then pink screen and crashes again. Also f ubisoft launcher, I bought the game in Steam, that MEANS I want to play it in steam. P.S. Ubisoft's launcher makes you sign in every single time you try to play.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game, Great even.\r\n\r\nUbisoft connect is a cancer to your PC",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game crashing constantly in Windows 11, I would not recommend buying it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I can say, even starting the game I started to have problems.\nClassic ubisoft slop.\nUpdate: I've downloaded a mod that skips all cutscenes, which actually made the game run normally for a time. However game chrashes and deletes half hour of progress you've done and right now, whenever I try to load my auto save, game closes itself. My savefile is hardlocked in the part where you jump into a ravine and try to escape.\nFuck Ubisoft, fuck your ubisoft launcher, fuck your piece of shit game, gargle my balls like a jawbreaker, Go watch Pyrocynical's video instead of purchasing the game, and gonna try to get a refund despite I got this game as a gift.\nhttps://www.youtube.com/watch?v=z77lmes2bFo&t=20s",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}