{
  "positive": [
    {
      "review": "This game has been a pleasant gem for me. I've enjoyed the exploring, graphics, detail to creatures and the easy learning curve. It runs smooth on my computer and phone so I can play it when travelling for work or at home. Have spent less so far than what I would on a triple A and for what I've experienced, money well spent on mental therapy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Plenty to do. I wasn't really expecting much since the game was free and some reviews were pretty harsh, but ended up really getting into it and having fun. I just wish there were more options for attire, maybe there will be more options later on? I'm glad I didn't listen to the negative reviews, I don't get how some people are saying that it was hard to navigate, In any case, I think ppl should just try it out for themselves. Personally I'm enjoying this game a lot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game with good graphics. wainmarrows are expensive, same dupes getting everytime",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game! Yes its a gatcha game, so you will have to spend some cash.  Only real downside to this game: too many menu's! You can get lost in the menu's sometimes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a hero gatcha-ish game with auto battler, so it's fine for what it is. I didn't finish the storyline, but it seems fine, not terrible, not amazing. You get some character customization with your starting character, and it feels like you can usually get sufficient resources of various kinds just by playing and having patience. Overall, if you want a dnd flavored hero collector, this will do. \r\n\r\nThere Are ample opportunities for you to spend money on the game, but I didn't see anything that is locked into a state of 'you can only acquire this by spending real world money'. To compare and contrast with a similar game I played for longer: This game doesn't seem to be introducing limited time acquisition cross over characters that then get power crept by more readily available characters just a few months after they were introduced. So you aren't going to be in a situation like in FFBE where you saved up a bunch of summons and blew them out getting 4 copies of event only gilgamesh only to have his massive combat capability and combo synergy with other characters become mostly irrelevant a few months later. \r\n\r\nAt least at the time of the review, you don't have to worry about some limited time cross over summon being a thing, introducing FOMO to you, and then becoming irrelvant even if you went in on them. There aren't any equipment items that only show up in a 'new player welcome package give us 10 dollars' that ify ou miss out you can never acquire again later. You don't have a pop up every single day going 'give us money give us money give us money'.\r\n\r\nThere's ways to spend money, but the game isn't obnoxious about them. If you want to be able to set up your guys with upgrades and gear and figure out how to combo different characters, their abilities, elements, and play around with synergies and how unit placement might alter the impact of a particular character in battle? This can scratch that itch. You can engage in limited control over the fights (mostly in when characters use their ultimates), but you can also leave it to the auto battle element, minimize the game, let it auto grind some resources out for you while you do other things, and come back to it and use the resources you got from your guys being able to handle things just fine without your direct oversight. \r\n\r\nIt's fine, I'd give it a passing grade for being competently made and not obnoxious with the monetization. I didn't put any money into it, and it's a free to play game as baseline, so I feel like checking the 'did you get this product for free' check mark on the review would be misleading to select. Everyone gets it for free, it's not like I was given a review copy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game i do recommend it. Its better than before quality of life is great.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great strategy game with dark imagery and great graphic design",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is ok at best, but I was bored through most of the beginning. The camera angle during combat is unchangeable unless I missed something, which can completely block units that you can't see. That makes any manual ability inputs longer/harder to do, especially when there are towering units blocking everything in its way. That forces you to just use auto, which has several issues.\nYou level up everything simultaneously (Resonance), which is great. I like that concept that removes the need to grind every single unit to make them playable. You just pick up and play with any character. Some micromanage things remain like gear, but the accessibility for casual players is there.\nThe main issue is that, even without all the free rewards or whatever promotion the game gives, There is no difficulty. I doubt you'd get any real challenge for several hundred hours of gameplay. It's really just click the auto navigate to go straight to the objective, then let auto combat do its thing. It's an idle game that needs your constant attention to keep going once each tasks are completed within 30 seconds. \nEither turn this into a fully idle game or raise the overall difficulty where auto doesn't always automatically succeed.\n\nHowever, most of the negative reviews can be ignored. There's nothing confusing with the quests, I haven't had any technical issues, and the game can still be enjoyable if you like a basic D&D style of story over thoughtful gameplay. It's clear that the devs enjoyed making the game and put in a lot of silly jokes or unordinary concepts in regards to lore or inconsequential mechanics (like the player turning into a sentient dice), but it feels like they forgot to make the core of the gameplay fun. All the focus went toward pivoting a generic storyline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice gacha, they give you a few nice chars to begin, but for now that's it. Let's see late game. But as a DnD style game, has astonishing graphs, good lore and overall performance. Reward wise.. a little lacking, but it's a gacha game, what to expect. \r\nI will update this in due time :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The fact that I can swithc gear around and you remind me some have no gear or are lacking gear.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "loads to do makes raid look like a joke",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome fun enjoyed alot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WoW,\r\nso far this is perfect.\r\nHighly Recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a gacha game through and through. It even has an annoying energy mechanic and roughly a thousand currencies.\r\n\r\nWhat makes it charming is its ties to D&D, its interesting storyline, and the fact that you needn't spend any money (at least not for the first 20 hours or so, which is pretty good for a fun, free game). I don't know if there's any life in the endgame. As a gacha game, I'd guess there's probably none, but I am willing to take the trip there to find out.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "since the re-launch the game is in a much better place. core mechanics are all the same, but its far less grindy than before.\nfor example, you dont have to individually level up each character so you only run Goblins a handful of times to get your \"account\" to 100, and all toons are done!\n\nscrolls invested in characters also carry over between seasons now. \nand also very FTP friendly if you put in the work - i finished 18th last season without spending anything",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "People comparing this game to Raid are plain delusional. There is no greater evil in the gaming industry than Plarium, period.\nThis game is not perfect, but you can do really well as a free to play.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game has a very interesting way of taking the salient elements of team build strategy rpg and automating the boring parts to pin point where the fun is. It's got a lot of fun types of combat and open world encounters to keep me coming back. The downside is they bottleneck advancement or levels caps for a couple of days at time. It has a lot of currencies which can get confusing to get stuff for character development.  There is a decent amount of pay to play, but not as bad as other games I've tried. You can get a lot of enjoyment playing for free if you are willing to take your time. \r\n\r\nThe strategy has a pretty decent learning curve based on keywords and team builds, but it's rewarding once you figure it out. I'd like to see them remove some of the time periods to advance. I find I have to quit the game and come back the next day when I want to keep playing because all of the content is locked with a timer. I also play more than most people, so that may not be the case for you. \r\n\r\nMy suggestion is to try this game. It may surprise you.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game has been a pleasant gem for me. I've enjoyed the exploring, graphics, detail to creatures and the easy learning curve. It runs smooth on my computer and phone so I can play it when travelling for work or at home. Have spent less so far than what I would on a triple A and for what I've experienced, money well spent on mental therapy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Plenty to do. I wasn't really expecting much since the game was free and some reviews were pretty harsh, but ended up really getting into it and having fun. I just wish there were more options for attire, maybe there will be more options later on? I'm glad I didn't listen to the negative reviews, I don't get how some people are saying that it was hard to navigate, In any case, I think ppl should just try it out for themselves. Personally I'm enjoying this game a lot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game with good graphics. wainmarrows are expensive, same dupes getting everytime",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game! Yes its a gatcha game, so you will have to spend some cash.  Only real downside to this game: too many menu's! You can get lost in the menu's sometimes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a hero gatcha-ish game with auto battler, so it's fine for what it is. I didn't finish the storyline, but it seems fine, not terrible, not amazing. You get some character customization with your starting character, and it feels like you can usually get sufficient resources of various kinds just by playing and having patience. Overall, if you want a dnd flavored hero collector, this will do. \r\n\r\nThere Are ample opportunities for you to spend money on the game, but I didn't see anything that is locked into a state of 'you can only acquire this by spending real world money'. To compare and contrast with a similar game I played for longer: This game doesn't seem to be introducing limited time acquisition cross over characters that then get power crept by more readily available characters just a few months after they were introduced. So you aren't going to be in a situation like in FFBE where you saved up a bunch of summons and blew them out getting 4 copies of event only gilgamesh only to have his massive combat capability and combo synergy with other characters become mostly irrelevant a few months later. \r\n\r\nAt least at the time of the review, you don't have to worry about some limited time cross over summon being a thing, introducing FOMO to you, and then becoming irrelvant even if you went in on them. There aren't any equipment items that only show up in a 'new player welcome package give us 10 dollars' that ify ou miss out you can never acquire again later. You don't have a pop up every single day going 'give us money give us money give us money'.\r\n\r\nThere's ways to spend money, but the game isn't obnoxious about them. If you want to be able to set up your guys with upgrades and gear and figure out how to combo different characters, their abilities, elements, and play around with synergies and how unit placement might alter the impact of a particular character in battle? This can scratch that itch. You can engage in limited control over the fights (mostly in when characters use their ultimates), but you can also leave it to the auto battle element, minimize the game, let it auto grind some resources out for you while you do other things, and come back to it and use the resources you got from your guys being able to handle things just fine without your direct oversight. \r\n\r\nIt's fine, I'd give it a passing grade for being competently made and not obnoxious with the monetization. I didn't put any money into it, and it's a free to play game as baseline, so I feel like checking the 'did you get this product for free' check mark on the review would be misleading to select. Everyone gets it for free, it's not like I was given a review copy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game i do recommend it. Its better than before quality of life is great.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a FTP game with in game rewards and they give you many of them,also you can also buy stuff in the game to help along your journey",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best \"turn based\" game, amazing graphics! much better than Raid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a laid back, strategy game, this one is really good.  Lots of limitations, but still far too much to do in a day to get bored in under 2 hours... every day.  But... if you don't understand the strategy behind the different character skillsets, it will overwhelm you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remember no one forces your hand to whip out and use credit cards\ngrow the fuk up, for mobile ( and PC port ) game is fine for what it is, just use your fuckin common sense if you have any left or call gambling addiction hot line if you cant stop\nI will recommend this game \n\nthey did everything better than anything out there\n- story\n- graphics\n- music\n- world\n- complexity\n- content\n- pvp is good and fun, just learn game mechanics\nand its free to play",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great strategy game with dark imagery and great graphic design",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is ok at best, but I was bored through most of the beginning. The camera angle during combat is unchangeable unless I missed something, which can completely block units that you can't see. That makes any manual ability inputs longer/harder to do, especially when there are towering units blocking everything in its way. That forces you to just use auto, which has several issues.\nYou level up everything simultaneously (Resonance), which is great. I like that concept that removes the need to grind every single unit to make them playable. You just pick up and play with any character. Some micromanage things remain like gear, but the accessibility for casual players is there.\nThe main issue is that, even without all the free rewards or whatever promotion the game gives, There is no difficulty. I doubt you'd get any real challenge for several hundred hours of gameplay. It's really just click the auto navigate to go straight to the objective, then let auto combat do its thing. It's an idle game that needs your constant attention to keep going once each tasks are completed within 30 seconds. \nEither turn this into a fully idle game or raise the overall difficulty where auto doesn't always automatically succeed.\n\nHowever, most of the negative reviews can be ignored. There's nothing confusing with the quests, I haven't had any technical issues, and the game can still be enjoyable if you like a basic D&D style of story over thoughtful gameplay. It's clear that the devs enjoyed making the game and put in a lot of silly jokes or unordinary concepts in regards to lore or inconsequential mechanics (like the player turning into a sentient dice), but it feels like they forgot to make the core of the gameplay fun. All the focus went toward pivoting a generic storyline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice gacha, they give you a few nice chars to begin, but for now that's it. Let's see late game. But as a DnD style game, has astonishing graphs, good lore and overall performance. Reward wise.. a little lacking, but it's a gacha game, what to expect. \r\nI will update this in due time :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game if you like auto battlers / team builders / gacha.\n\nLots of diversity in units and team comps, a lot of variety in content and more western / realistic graphics which is a nice change from the usual anime art style that you typically see in this genre.\n\nYou also get a lot of pull currency just from playing the game. 300 to guarantee premium units looks like a lot at first but if you just log in and do your dailies you get more currency than you'd think and there are frequent reruns on premium banners.\n\nIf you don't like auto battlers or gacha then this game definitely isn't for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful team builder game! Have played mostly free (put in box price 60$) and have been able to be mostly competitive. There are definitely people dumping money but that does not mean they can build a good team and you can pass them with some time and dedication. This game can be played as a full time game with 1 account, a full time game with multiple accounts, or even just as a casual fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, complex strategy and different team builds!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty decent, much to improve but if you like this genre this game is alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright and fun enough as f2p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very good RPG Fantasy GAme and not to expensive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You  have to sign up on your phone before  you can  even login.  Clearly would have used my phone if I could, or wanted to. Shit Design choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is fine once you know best strategies to use lol kinda.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "people need to ''chill'' more as we ''gamers'' say ... the game  is not bad at all.. \ni saw ''much worse'' or ''less satisfying'' games that cost 20 $_30 $ ...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Takes a while to get used to, but once you do its great. ****",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun free game whit lots to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played this game before and its still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The fact that I can swithc gear around and you remind me some have no gear or are lacking gear.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great grapich",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "loads to do makes raid look like a joke",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game of its kind",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesome fun enjoyed alot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "quiting raid , this is  a perfect game to spend your free time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good and chill",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "WoW,\r\nso far this is perfect.\r\nHighly Recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good clicker game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just do",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My gambling addict friend said if I post a review and it gets 150 likes and 50 Awards that he will buy me a case of beer, some vodka and 1 kg of lemon So im just gonna leave this here.\n\nМой друг-игроман сказал, что если я опубликую отзыв и он наберет 150 лайков и 50 наград, он купит мне ящик пива, немного водки и 1 кг лимона, так что я просто оставлю это здесь.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This is a gacha game through and through. It even has an annoying energy mechanic and roughly a thousand currencies.\r\n\r\nWhat makes it charming is its ties to D&D, its interesting storyline, and the fact that you needn't spend any money (at least not for the first 20 hours or so, which is pretty good for a fun, free game). I don't know if there's any life in the endgame. As a gacha game, I'd guess there's probably none, but I am willing to take the trip there to find out.",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "since the re-launch the game is in a much better place. core mechanics are all the same, but its far less grindy than before.\nfor example, you dont have to individually level up each character so you only run Goblins a handful of times to get your \"account\" to 100, and all toons are done!\n\nscrolls invested in characters also carry over between seasons now. \nand also very FTP friendly if you put in the work - i finished 18th last season without spending anything",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "People comparing this game to Raid are plain delusional. There is no greater evil in the gaming industry than Plarium, period.\nThis game is not perfect, but you can do really well as a free to play.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game has a very interesting way of taking the salient elements of team build strategy rpg and automating the boring parts to pin point where the fun is. It's got a lot of fun types of combat and open world encounters to keep me coming back. The downside is they bottleneck advancement or levels caps for a couple of days at time. It has a lot of currencies which can get confusing to get stuff for character development.  There is a decent amount of pay to play, but not as bad as other games I've tried. You can get a lot of enjoyment playing for free if you are willing to take your time. \r\n\r\nThe strategy has a pretty decent learning curve based on keywords and team builds, but it's rewarding once you figure it out. I'd like to see them remove some of the time periods to advance. I find I have to quit the game and come back the next day when I want to keep playing because all of the content is locked with a timer. I also play more than most people, so that may not be the case for you. \r\n\r\nMy suggestion is to try this game. It may surprise you.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game has been a pleasant gem for me. I've enjoyed the exploring, graphics, detail to creatures and the easy learning curve. It runs smooth on my computer and phone so I can play it when travelling for work or at home. Have spent less so far than what I would on a triple A and for what I've experienced, money well spent on mental therapy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Plenty to do. I wasn't really expecting much since the game was free and some reviews were pretty harsh, but ended up really getting into it and having fun. I just wish there were more options for attire, maybe there will be more options later on? I'm glad I didn't listen to the negative reviews, I don't get how some people are saying that it was hard to navigate, In any case, I think ppl should just try it out for themselves. Personally I'm enjoying this game a lot.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good game with good graphics. wainmarrows are expensive, same dupes getting everytime",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game! Yes its a gatcha game, so you will have to spend some cash.  Only real downside to this game: too many menu's! You can get lost in the menu's sometimes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a hero gatcha-ish game with auto battler, so it's fine for what it is. I didn't finish the storyline, but it seems fine, not terrible, not amazing. You get some character customization with your starting character, and it feels like you can usually get sufficient resources of various kinds just by playing and having patience. Overall, if you want a dnd flavored hero collector, this will do. \r\n\r\nThere Are ample opportunities for you to spend money on the game, but I didn't see anything that is locked into a state of 'you can only acquire this by spending real world money'. To compare and contrast with a similar game I played for longer: This game doesn't seem to be introducing limited time acquisition cross over characters that then get power crept by more readily available characters just a few months after they were introduced. So you aren't going to be in a situation like in FFBE where you saved up a bunch of summons and blew them out getting 4 copies of event only gilgamesh only to have his massive combat capability and combo synergy with other characters become mostly irrelevant a few months later. \r\n\r\nAt least at the time of the review, you don't have to worry about some limited time cross over summon being a thing, introducing FOMO to you, and then becoming irrelvant even if you went in on them. There aren't any equipment items that only show up in a 'new player welcome package give us 10 dollars' that ify ou miss out you can never acquire again later. You don't have a pop up every single day going 'give us money give us money give us money'.\r\n\r\nThere's ways to spend money, but the game isn't obnoxious about them. If you want to be able to set up your guys with upgrades and gear and figure out how to combo different characters, their abilities, elements, and play around with synergies and how unit placement might alter the impact of a particular character in battle? This can scratch that itch. You can engage in limited control over the fights (mostly in when characters use their ultimates), but you can also leave it to the auto battle element, minimize the game, let it auto grind some resources out for you while you do other things, and come back to it and use the resources you got from your guys being able to handle things just fine without your direct oversight. \r\n\r\nIt's fine, I'd give it a passing grade for being competently made and not obnoxious with the monetization. I didn't put any money into it, and it's a free to play game as baseline, so I feel like checking the 'did you get this product for free' check mark on the review would be misleading to select. Everyone gets it for free, it's not like I was given a review copy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game i do recommend it. Its better than before quality of life is great.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "It's a FTP game with in game rewards and they give you many of them,also you can also buy stuff in the game to help along your journey",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "best \"turn based\" game, amazing graphics! much better than Raid.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "For a laid back, strategy game, this one is really good.  Lots of limitations, but still far too much to do in a day to get bored in under 2 hours... every day.  But... if you don't understand the strategy behind the different character skillsets, it will overwhelm you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remember no one forces your hand to whip out and use credit cards\ngrow the fuk up, for mobile ( and PC port ) game is fine for what it is, just use your fuckin common sense if you have any left or call gambling addiction hot line if you cant stop\nI will recommend this game \n\nthey did everything better than anything out there\n- story\n- graphics\n- music\n- world\n- complexity\n- content\n- pvp is good and fun, just learn game mechanics\nand its free to play",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Great strategy game with dark imagery and great graphic design",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is ok at best, but I was bored through most of the beginning. The camera angle during combat is unchangeable unless I missed something, which can completely block units that you can't see. That makes any manual ability inputs longer/harder to do, especially when there are towering units blocking everything in its way. That forces you to just use auto, which has several issues.\nYou level up everything simultaneously (Resonance), which is great. I like that concept that removes the need to grind every single unit to make them playable. You just pick up and play with any character. Some micromanage things remain like gear, but the accessibility for casual players is there.\nThe main issue is that, even without all the free rewards or whatever promotion the game gives, There is no difficulty. I doubt you'd get any real challenge for several hundred hours of gameplay. It's really just click the auto navigate to go straight to the objective, then let auto combat do its thing. It's an idle game that needs your constant attention to keep going once each tasks are completed within 30 seconds. \nEither turn this into a fully idle game or raise the overall difficulty where auto doesn't always automatically succeed.\n\nHowever, most of the negative reviews can be ignored. There's nothing confusing with the quests, I haven't had any technical issues, and the game can still be enjoyable if you like a basic D&D style of story over thoughtful gameplay. It's clear that the devs enjoyed making the game and put in a lot of silly jokes or unordinary concepts in regards to lore or inconsequential mechanics (like the player turning into a sentient dice), but it feels like they forgot to make the core of the gameplay fun. All the focus went toward pivoting a generic storyline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice gacha, they give you a few nice chars to begin, but for now that's it. Let's see late game. But as a DnD style game, has astonishing graphs, good lore and overall performance. Reward wise.. a little lacking, but it's a gacha game, what to expect. \r\nI will update this in due time :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game if you like auto battlers / team builders / gacha.\n\nLots of diversity in units and team comps, a lot of variety in content and more western / realistic graphics which is a nice change from the usual anime art style that you typically see in this genre.\n\nYou also get a lot of pull currency just from playing the game. 300 to guarantee premium units looks like a lot at first but if you just log in and do your dailies you get more currency than you'd think and there are frequent reruns on premium banners.\n\nIf you don't like auto battlers or gacha then this game definitely isn't for you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wonderful team builder game! Have played mostly free (put in box price 60$) and have been able to be mostly competitive. There are definitely people dumping money but that does not mean they can build a good team and you can pass them with some time and dedication. This game can be played as a full time game with 1 account, a full time game with multiple accounts, or even just as a casual fun game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, complex strategy and different team builds!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty decent, much to improve but if you like this genre this game is alright",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its alright and fun enough as f2p",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a very good RPG Fantasy GAme and not to expensive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You  have to sign up on your phone before  you can  even login.  Clearly would have used my phone if I could, or wanted to. Shit Design choice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is fine once you know best strategies to use lol kinda.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "people need to ''chill'' more as we ''gamers'' say ... the game  is not bad at all.. \ni saw ''much worse'' or ''less satisfying'' games that cost 20 $_30 $ ...",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Takes a while to get used to, but once you do its great. ****",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun free game whit lots to do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played this game before and its still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The fact that I can swithc gear around and you remind me some have no gear or are lacking gear.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great grapich",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "loads to do makes raid look like a joke",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game of its kind",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesome fun enjoyed alot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "quiting raid , this is  a perfect game to spend your free time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great!",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Until they actually allow the game to log in through steam I cannot in good faith recommend this game. Trusting a log-in to any other system is at best asking for trouble. 2 hours of downloading time and then not one of the log in options worked to allow playing the game. Uninstalling it now so disappointing because it looked like it could have been fun.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I played this in Beta and checked back on it recently ,since it's \"revival\" just out of pure curiosity. I am ready to finalize my thoughts on this 'piece'.\n\nDragonheir had a strange niche when it released of being a very self-absorbed, weirdly Western RPG -targeting, P2W gacha in the AFK clone subgenre. It's features and highlights include UI and optimization to elicit a nostalgic 2013 mobile game era that absolutely no one missed. The days of absence of gameplay and graphics, cheap design tools and limited phone power, after one too many rugpulls over the years, the mobile player base has grown up and wisened up to such tactics. Not to understate, how the era involved Western consumer direct exposure to the third world, like breathing in raw sewage while stuck in traffic on your way to work.\n\nThere is a real \"I designed this, it's my first game\" amateurishness about it, which will undoubtedly remind the player of D&D and other D&D sub and off-brand products. But it also tries to \"cash in\" on D&D revival of the BG3 era of last couple of years, by adding obnoxious dice rolling everywhere. I've never clicked so much since playing Diablo. This is about the only connection to D&D or really any RPG. For the most part, it's a copy&paste Chinese \"lower buyer\" gacha some 'fan' bought to make his own mobile bestseller. \n\nInexplicably, the devs of this masterpiece decided to compound it's problems by borrowing the lesser \"multi-server, mmo-style, PoE season\" system from the less popular titles in the gacha space. This skinner box feels a LOT like a testing ground for AFK devs to try ideas that they know for certain are doomed to fail, just to make sure they are right, in a live environment.\n\nSo, what's \"new\" in the ressurection? Honestly, I didn't notice much difference. I'm out of the loop on cheap mobile games lately, so I don't know the standard. It's pay to play and once the free currency runs out, you no longer have any reason to keep going. This may very much be the standard nowadays, for all I know. They really expect you to pay for nothing, and they promise not to deliver, cause they game is as unfinished as the beta was, for the most part. This is more or less the experience the first time around, only nice to know that anyone dumb enough to give them money got completely ripped off cause the reset came with a full server wipe, with a maximum of 10 pulls in compensation for playing before, even if you spent a million dollars.\n\nThe only real new thing is the new players I guess that are giving it a shot from a new perspective. Some of them seem like they are in the third world. Also there is strange new characters, like the mysteriously overpowered Chinese woman who's superpower is that she's Chinese and is able to solo entire teams, despite being mid-tier according to the official tier lists (which dont even exist.) \n\nThere is really no hope of appealing to any D&D or RPG fan. This is still true, throughout. It's one of those games you can't really critique, because you would just end up critiquing everything ad nauseum. There is so little that it does right, that it's actually a coincidence when you manage to find fun in it. \n\nIt does not surprise me in the slightest, that WoTC, officially partnered with THIS mobile title, of them all. It's actually exactly perfect, in every way, in this regard. How do you make a game so f%*@#() BAD it can't even play itself? This is it, this is the absolute bottom of the gaming barrel, floating in the sea, in the grand interdimensional toilet that they call gacha gaming. \n\nIn summary:\n-nothing for gambling addict: no real waifu, no wild chance, very linear and boring\n-nothing for grind addict: no real carrot on a stick, unrewarding grinding\n-nothing for daily login: 1 pull a month is your motivator, literally \n-none of the promo codes work\n-you have to play the (horrible) singleplayer every season, but you dont get the \"new player free currency\" frontload everytime, which is the only way it can work\n-and finally, their one idea which was seasons and retaining your 'collection' they completely dropped the ball on because they did a full wipe of every account in the first year",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "This game hasn't changed at all, It remains extremely pay-to-win and If you wanna see whales take the best prizes in everything this game offers... feel free to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Some cool concepts, some cool systems, many taken from games like Raid Shadow Legends, Afk Journey and Genshin impact even, horrible execution, soulless gameplay and design, P2W, i literally stopped playing mid fight cause it was so dull and mind numbing. Don't bother, even the first 10 hrs aren't fun in any way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Pretty presentation, shallow core. Lots of grind, lots of systems, not much real payoff. It gets old quickly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've taken fat steamy bowel movements that have looked better than this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game update new content , leave you behind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nope, they did a reboot and I can't find it. or play it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "pay to win",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "you will enjoy the game at the beginnig but after that you will discover that it is just waste of time and it is p2w btw",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "W. T. F.\n\"Look everyone! It has dungeons and dragons in the name!\"\nUtter garbage.\nThis \"game\" makes Raid: Shadow Legends look like a serious strategy game. Worse, its gratuitous monetisation makes the aforementioned Raid look F***ING GENEROUS.\n\nLet me be clear with this: I am no D&D know-it-all. I've played a few games of it, played baldurs gate and icewind dale, and watched the cartoon when I was a kid. The first thing that had me dubious of their entire set up was in the intro, where we get a BS \"tutorial\" of a bunch of magical scrubs going up against - allegedly - Tiamat.\nNow, Tiamat has 5 heads - one for each type of non-metal dragon. Theirs has 3. Seems like the devs nerfed the dragon goddess.\nNow, somehow, this bunch of unheard of \"heroes\" managed to lop off one of these heads, and then they promptly \"fled\" the battle.\nOne of them took one of Tiamat's heads off with one hit. ONE HIT. Decapitated one of Tiamat's heads. From a freaking dragon GODDESS. And that made them say \"lets flee\"?!\nIf you're having a tough fight with someone, and by some miracle the other guy loses an arm, you don't bloody run! You've literally just won! The loss of a major limb causes any creature to bleed out! Not to mention with only 3 heads instead of 5, you've just slashed Tiamat's fighting capacity by a third, and yet you run away?!\nWho wrote this garbage?!\n\nProblems with the right, and BASIC D&D CANON aside, the game looks good.\n\nBut that's all.\n\nIt takes up over 8 gigs of HD space, and is little more than a crappy auto-battler.\n\"Oh but you get to direct the characters's ultimates!\"\nNo, you mean I have to sit there watching a bunch of counters ticking up until their portraits are highlighted and then drag an icon onto a screen.\nHardly the most involving tactical combat.\nCheckers is more tactically demanding.\n\n\"Oh but you get to upgrade your characters and equip them with gear!\"\nYou mean I have to craft a bunch of stuff that allegedly increases their stat lines, which has no effect on them getting their asses handed to them. Seriously, you \"recruit\" a dwarf on the adventure who's supposed to be a f***ing tank who \"specialises in taking damage\". The guy gets one shot practically every fight - he dies in seconds, and then the party line up gets demolished BEFORE ANY OF THE ULTIMATES ARE READY.\nYes, he's the same level as the enemies.\nYes, he's equipped.\n\nIts deliberate to make you spend resources \"levelling up\", and consider dropping cash for the endless amounts of cash shop upgrades, items, premium currencies, and premium character summons and just about everything else you can think of to nickel and dime you into sending bank.\n\nf*** off. I've seen this kind of garbage in so many games now, its just a sick joke.\n\nThey get your hopes up on the \"create character\" screen, by displaying a bunch of races, and have you picking their appearance from a few different options - which are laughably few - which displays the 6 stats most D&D veterans are happy to see: the old STR, DEX, CON stuff. Except the stats are barely above 10, and I'm pretty sure have bugger all impact on the game regardless of which you choose.\n\nIf I rolled a D&D character and all the stats were 10 and 11, I'd make a new one.\n\n\nSummary:\npay2win garbage auto-battler that makes Raid: Shadow Legends look generous and like a tactical masterpiece.\n\nAVOID.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Until they actually allow the game to log in through steam I cannot in good faith recommend this game. Trusting a log-in to any other system is at best asking for trouble. 2 hours of downloading time and then not one of the log in options worked to allow playing the game. Uninstalling it now so disappointing because it looked like it could have been fun.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It is playable without micro-transactions, but still P2W. The \"open world\" sucks and the related quests too.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this in Beta and checked back on it recently ,since it's \"revival\" just out of pure curiosity. I am ready to finalize my thoughts on this 'piece'.\n\nDragonheir had a strange niche when it released of being a very self-absorbed, weirdly Western RPG -targeting, P2W gacha in the AFK clone subgenre. It's features and highlights include UI and optimization to elicit a nostalgic 2013 mobile game era that absolutely no one missed. The days of absence of gameplay and graphics, cheap design tools and limited phone power, after one too many rugpulls over the years, the mobile player base has grown up and wisened up to such tactics. Not to understate, how the era involved Western consumer direct exposure to the third world, like breathing in raw sewage while stuck in traffic on your way to work.\n\nThere is a real \"I designed this, it's my first game\" amateurishness about it, which will undoubtedly remind the player of D&D and other D&D sub and off-brand products. But it also tries to \"cash in\" on D&D revival of the BG3 era of last couple of years, by adding obnoxious dice rolling everywhere. I've never clicked so much since playing Diablo. This is about the only connection to D&D or really any RPG. For the most part, it's a copy&paste Chinese \"lower buyer\" gacha some 'fan' bought to make his own mobile bestseller. \n\nInexplicably, the devs of this masterpiece decided to compound it's problems by borrowing the lesser \"multi-server, mmo-style, PoE season\" system from the less popular titles in the gacha space. This skinner box feels a LOT like a testing ground for AFK devs to try ideas that they know for certain are doomed to fail, just to make sure they are right, in a live environment.\n\nSo, what's \"new\" in the ressurection? Honestly, I didn't notice much difference. I'm out of the loop on cheap mobile games lately, so I don't know the standard. It's pay to play and once the free currency runs out, you no longer have any reason to keep going. This may very much be the standard nowadays, for all I know. They really expect you to pay for nothing, and they promise not to deliver, cause they game is as unfinished as the beta was, for the most part. This is more or less the experience the first time around, only nice to know that anyone dumb enough to give them money got completely ripped off cause the reset came with a full server wipe, with a maximum of 10 pulls in compensation for playing before, even if you spent a million dollars.\n\nThe only real new thing is the new players I guess that are giving it a shot from a new perspective. Some of them seem like they are in the third world. Also there is strange new characters, like the mysteriously overpowered Chinese woman who's superpower is that she's Chinese and is able to solo entire teams, despite being mid-tier according to the official tier lists (which dont even exist.) \n\nThere is really no hope of appealing to any D&D or RPG fan. This is still true, throughout. It's one of those games you can't really critique, because you would just end up critiquing everything ad nauseum. There is so little that it does right, that it's actually a coincidence when you manage to find fun in it. \n\nIt does not surprise me in the slightest, that WoTC, officially partnered with THIS mobile title, of them all. It's actually exactly perfect, in every way, in this regard. How do you make a game so f%*@#() BAD it can't even play itself? This is it, this is the absolute bottom of the gaming barrel, floating in the sea, in the grand interdimensional toilet that they call gacha gaming. \n\nIn summary:\n-nothing for gambling addict: no real waifu, no wild chance, very linear and boring\n-nothing for grind addict: no real carrot on a stick, unrewarding grinding\n-nothing for daily login: 1 pull a month is your motivator, literally \n-none of the promo codes work\n-you have to play the (horrible) singleplayer every season, but you dont get the \"new player free currency\" frontload everytime, which is the only way it can work\n-and finally, their one idea which was seasons and retaining your 'collection' they completely dropped the ball on because they did a full wipe of every account in the first year",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game hasn't changed at all, It remains extremely pay-to-win and If you wanna see whales take the best prizes in everything this game offers... feel free to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "just a money grab game mainly, one of worst greed level out there. so these is how it works, season 1 you can buy for 80 instead of regular price (100) chances to summon at first you think this is normal until somewhere along they raise it to 100, season 1 otherworld horn i got 2 legendary summon and starlight summon also 2 legendary, season 2 i got zero legendary in both.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Some cool concepts, some cool systems, many taken from games like Raid Shadow Legends, Afk Journey and Genshin impact even, horrible execution, soulless gameplay and design, P2W, i literally stopped playing mid fight cause it was so dull and mind numbing. Don't bother, even the first 10 hrs aren't fun in any way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poor customer service. very unhelpful. Otherwise, the game has a large variety of things to do. Great graphics with an interesting story-line. Don't put money in it though.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When we play for more than 30 minutes, and without being either retarded or severely intoxicated (the way only drug addicts consider funny), then this is a heavily pay 2 win styled `moderated board game + eye-candy´. The game intro is neat, but thereafter it does not even matter, what character we play, as constant fetch-quests force us to ignore the main story AND our personal character choices. My dwarven thief and my highlander archeologist both cast the same spells (up to level 40) and the summoning of companions is so erratic that it can spoil a game, until we pay money to save time. As known with this type of games: Bored high level players spam the chat with their egomania, and it is hard to find `friends´ to even test once what multiplayer parts offer. Having been away for years, I had higher hopes for patches & updates, but we only got more of the same.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I cannot support this game as much as i wanted to. Its a DND themed/rip-off gotcha game which some people may enjoy but the tutorials are mostly non-existent and you don't get to pick a class you just get to pick what your character looks like and depending on what they LOOK like is your \"class\". Which is so confusing, an you randomly get companions which also dont have classes from what i could tell. I waited for this game for a very long time to come to Steam in the Americas and im very disappointed in it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty presentation, shallow core. Lots of grind, lots of systems, not much real payoff. It gets old quickly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't want to work on my Windows PC. It's nothing PC related, I open the game and it's just a black screen, nothing happens.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried to play the game, downloaded everything, updated everything, went into the login screen, attempted to login using my gmail, it said login success then I got a popup stating no game client found or something along those lines while clearly the game was running. Tried several times same result. So I cannot play the game. Perhaps the logon process needs to be simpler",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game has issues logging in. soe days it wont let me play deleting",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I thoroughly enjoy this game but the shockingly poor pull rates are a major deal-breaker. 0.033-2% for a single legendary hero is insanely low. I tested with 100 of each roll dice, 1 legendary out of 200 rolls. The developers claim there is bad luck protection at guaranteed legendary on the 70th roll, but evidently this is not true. On top of that, P2W players are crazy over-powered. I think the global chat should be disabled because all I see is players from servers which are later into the game, sharing strategies with newer servers and not allowing those players to learn the game, test, discover and formulate their own strategies. If you spend the time to formulate a great line-up, it can be incredibly frustrating when other players simply copy-paste your line-up and don't take the time to develop the line-up further.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is trash  \ncan`t start play because of error at 7.8 \ndont even tray to instal this trash game!!!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I explored the map for the first story quest but there is no way out and no clue. I tried everything but no help. Im stuck in the story quest for 2 days. This game is No Player Friendly. I dont recommend this game. Total waste of my time. Bullshit!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What the hell is the point of having a game on steam if you cant even log in with steam?!?!?! Fuck this game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They want a facebook,  apple,  or yahoo acct to log in.   Forget that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've taken fat steamy bowel movements that have looked better than this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun for the few couple of 10 hours. Could not manage to get me into it (82 hours, half of it from grinding and opening the game on the background)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoy of playing this game, but after the sale of this game by the previous owners, the comfort left the game. Even the banal entrance to the game is now a quest - launch the game so that you see the list of servers, this is a 1 in 20 chance. But that's not all - you also need luck to enter, because after choosing an entrance, you won't be allowed into the game, but will be shown cinematics. At the same time, support gives useless advice that doesn't work, like \"uninstall the game and reinstall.\" I'm tired of deleting and installing this kind of game every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its just very boring, worthless time-sink",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game update new content , leave you behind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah man. This is some p2w, full of ads and claim menus BS.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nope, they did a reboot and I can't find it. or play it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mobile game slop",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "p2w like most of mobile crap games",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So whats this is a mobile game for pc",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't get past the login verify",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pay to win",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "you will enjoy the game at the beginnig but after that you will discover that it is just waste of time and it is p2w btw",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "W. T. F.\n\"Look everyone! It has dungeons and dragons in the name!\"\nUtter garbage.\nThis \"game\" makes Raid: Shadow Legends look like a serious strategy game. Worse, its gratuitous monetisation makes the aforementioned Raid look F***ING GENEROUS.\n\nLet me be clear with this: I am no D&D know-it-all. I've played a few games of it, played baldurs gate and icewind dale, and watched the cartoon when I was a kid. The first thing that had me dubious of their entire set up was in the intro, where we get a BS \"tutorial\" of a bunch of magical scrubs going up against - allegedly - Tiamat.\nNow, Tiamat has 5 heads - one for each type of non-metal dragon. Theirs has 3. Seems like the devs nerfed the dragon goddess.\nNow, somehow, this bunch of unheard of \"heroes\" managed to lop off one of these heads, and then they promptly \"fled\" the battle.\nOne of them took one of Tiamat's heads off with one hit. ONE HIT. Decapitated one of Tiamat's heads. From a freaking dragon GODDESS. And that made them say \"lets flee\"?!\nIf you're having a tough fight with someone, and by some miracle the other guy loses an arm, you don't bloody run! You've literally just won! The loss of a major limb causes any creature to bleed out! Not to mention with only 3 heads instead of 5, you've just slashed Tiamat's fighting capacity by a third, and yet you run away?!\nWho wrote this garbage?!\n\nProblems with the right, and BASIC D&D CANON aside, the game looks good.\n\nBut that's all.\n\nIt takes up over 8 gigs of HD space, and is little more than a crappy auto-battler.\n\"Oh but you get to direct the characters's ultimates!\"\nNo, you mean I have to sit there watching a bunch of counters ticking up until their portraits are highlighted and then drag an icon onto a screen.\nHardly the most involving tactical combat.\nCheckers is more tactically demanding.\n\n\"Oh but you get to upgrade your characters and equip them with gear!\"\nYou mean I have to craft a bunch of stuff that allegedly increases their stat lines, which has no effect on them getting their asses handed to them. Seriously, you \"recruit\" a dwarf on the adventure who's supposed to be a f***ing tank who \"specialises in taking damage\". The guy gets one shot practically every fight - he dies in seconds, and then the party line up gets demolished BEFORE ANY OF THE ULTIMATES ARE READY.\nYes, he's the same level as the enemies.\nYes, he's equipped.\n\nIts deliberate to make you spend resources \"levelling up\", and consider dropping cash for the endless amounts of cash shop upgrades, items, premium currencies, and premium character summons and just about everything else you can think of to nickel and dime you into sending bank.\n\nf*** off. I've seen this kind of garbage in so many games now, its just a sick joke.\n\nThey get your hopes up on the \"create character\" screen, by displaying a bunch of races, and have you picking their appearance from a few different options - which are laughably few - which displays the 6 stats most D&D veterans are happy to see: the old STR, DEX, CON stuff. Except the stats are barely above 10, and I'm pretty sure have bugger all impact on the game regardless of which you choose.\n\nIf I rolled a D&D character and all the stats were 10 and 11, I'd make a new one.\n\n\nSummary:\npay2win garbage auto-battler that makes Raid: Shadow Legends look generous and like a tactical masterpiece.\n\nAVOID.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Until they actually allow the game to log in through steam I cannot in good faith recommend this game. Trusting a log-in to any other system is at best asking for trouble. 2 hours of downloading time and then not one of the log in options worked to allow playing the game. Uninstalling it now so disappointing because it looked like it could have been fun.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It is playable without micro-transactions, but still P2W. The \"open world\" sucks and the related quests too.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this in Beta and checked back on it recently ,since it's \"revival\" just out of pure curiosity. I am ready to finalize my thoughts on this 'piece'.\n\nDragonheir had a strange niche when it released of being a very self-absorbed, weirdly Western RPG -targeting, P2W gacha in the AFK clone subgenre. It's features and highlights include UI and optimization to elicit a nostalgic 2013 mobile game era that absolutely no one missed. The days of absence of gameplay and graphics, cheap design tools and limited phone power, after one too many rugpulls over the years, the mobile player base has grown up and wisened up to such tactics. Not to understate, how the era involved Western consumer direct exposure to the third world, like breathing in raw sewage while stuck in traffic on your way to work.\n\nThere is a real \"I designed this, it's my first game\" amateurishness about it, which will undoubtedly remind the player of D&D and other D&D sub and off-brand products. But it also tries to \"cash in\" on D&D revival of the BG3 era of last couple of years, by adding obnoxious dice rolling everywhere. I've never clicked so much since playing Diablo. This is about the only connection to D&D or really any RPG. For the most part, it's a copy&paste Chinese \"lower buyer\" gacha some 'fan' bought to make his own mobile bestseller. \n\nInexplicably, the devs of this masterpiece decided to compound it's problems by borrowing the lesser \"multi-server, mmo-style, PoE season\" system from the less popular titles in the gacha space. This skinner box feels a LOT like a testing ground for AFK devs to try ideas that they know for certain are doomed to fail, just to make sure they are right, in a live environment.\n\nSo, what's \"new\" in the ressurection? Honestly, I didn't notice much difference. I'm out of the loop on cheap mobile games lately, so I don't know the standard. It's pay to play and once the free currency runs out, you no longer have any reason to keep going. This may very much be the standard nowadays, for all I know. They really expect you to pay for nothing, and they promise not to deliver, cause they game is as unfinished as the beta was, for the most part. This is more or less the experience the first time around, only nice to know that anyone dumb enough to give them money got completely ripped off cause the reset came with a full server wipe, with a maximum of 10 pulls in compensation for playing before, even if you spent a million dollars.\n\nThe only real new thing is the new players I guess that are giving it a shot from a new perspective. Some of them seem like they are in the third world. Also there is strange new characters, like the mysteriously overpowered Chinese woman who's superpower is that she's Chinese and is able to solo entire teams, despite being mid-tier according to the official tier lists (which dont even exist.) \n\nThere is really no hope of appealing to any D&D or RPG fan. This is still true, throughout. It's one of those games you can't really critique, because you would just end up critiquing everything ad nauseum. There is so little that it does right, that it's actually a coincidence when you manage to find fun in it. \n\nIt does not surprise me in the slightest, that WoTC, officially partnered with THIS mobile title, of them all. It's actually exactly perfect, in every way, in this regard. How do you make a game so f%*@#() BAD it can't even play itself? This is it, this is the absolute bottom of the gaming barrel, floating in the sea, in the grand interdimensional toilet that they call gacha gaming. \n\nIn summary:\n-nothing for gambling addict: no real waifu, no wild chance, very linear and boring\n-nothing for grind addict: no real carrot on a stick, unrewarding grinding\n-nothing for daily login: 1 pull a month is your motivator, literally \n-none of the promo codes work\n-you have to play the (horrible) singleplayer every season, but you dont get the \"new player free currency\" frontload everytime, which is the only way it can work\n-and finally, their one idea which was seasons and retaining your 'collection' they completely dropped the ball on because they did a full wipe of every account in the first year",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game hasn't changed at all, It remains extremely pay-to-win and If you wanna see whales take the best prizes in everything this game offers... feel free to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "just a money grab game mainly, one of worst greed level out there. so these is how it works, season 1 you can buy for 80 instead of regular price (100) chances to summon at first you think this is normal until somewhere along they raise it to 100, season 1 otherworld horn i got 2 legendary summon and starlight summon also 2 legendary, season 2 i got zero legendary in both.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Some cool concepts, some cool systems, many taken from games like Raid Shadow Legends, Afk Journey and Genshin impact even, horrible execution, soulless gameplay and design, P2W, i literally stopped playing mid fight cause it was so dull and mind numbing. Don't bother, even the first 10 hrs aren't fun in any way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poor customer service. very unhelpful. Otherwise, the game has a large variety of things to do. Great graphics with an interesting story-line. Don't put money in it though.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When we play for more than 30 minutes, and without being either retarded or severely intoxicated (the way only drug addicts consider funny), then this is a heavily pay 2 win styled `moderated board game + eye-candy´. The game intro is neat, but thereafter it does not even matter, what character we play, as constant fetch-quests force us to ignore the main story AND our personal character choices. My dwarven thief and my highlander archeologist both cast the same spells (up to level 40) and the summoning of companions is so erratic that it can spoil a game, until we pay money to save time. As known with this type of games: Bored high level players spam the chat with their egomania, and it is hard to find `friends´ to even test once what multiplayer parts offer. Having been away for years, I had higher hopes for patches & updates, but we only got more of the same.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I cannot support this game as much as i wanted to. Its a DND themed/rip-off gotcha game which some people may enjoy but the tutorials are mostly non-existent and you don't get to pick a class you just get to pick what your character looks like and depending on what they LOOK like is your \"class\". Which is so confusing, an you randomly get companions which also dont have classes from what i could tell. I waited for this game for a very long time to come to Steam in the Americas and im very disappointed in it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty presentation, shallow core. Lots of grind, lots of systems, not much real payoff. It gets old quickly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't want to work on my Windows PC. It's nothing PC related, I open the game and it's just a black screen, nothing happens.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried to play the game, downloaded everything, updated everything, went into the login screen, attempted to login using my gmail, it said login success then I got a popup stating no game client found or something along those lines while clearly the game was running. Tried several times same result. So I cannot play the game. Perhaps the logon process needs to be simpler",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game has issues logging in. soe days it wont let me play deleting",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I thoroughly enjoy this game but the shockingly poor pull rates are a major deal-breaker. 0.033-2% for a single legendary hero is insanely low. I tested with 100 of each roll dice, 1 legendary out of 200 rolls. The developers claim there is bad luck protection at guaranteed legendary on the 70th roll, but evidently this is not true. On top of that, P2W players are crazy over-powered. I think the global chat should be disabled because all I see is players from servers which are later into the game, sharing strategies with newer servers and not allowing those players to learn the game, test, discover and formulate their own strategies. If you spend the time to formulate a great line-up, it can be incredibly frustrating when other players simply copy-paste your line-up and don't take the time to develop the line-up further.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is trash  \ncan`t start play because of error at 7.8 \ndont even tray to instal this trash game!!!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I explored the map for the first story quest but there is no way out and no clue. I tried everything but no help. Im stuck in the story quest for 2 days. This game is No Player Friendly. I dont recommend this game. Total waste of my time. Bullshit!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What the hell is the point of having a game on steam if you cant even log in with steam?!?!?! Fuck this game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They want a facebook,  apple,  or yahoo acct to log in.   Forget that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've taken fat steamy bowel movements that have looked better than this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun for the few couple of 10 hours. Could not manage to get me into it (82 hours, half of it from grinding and opening the game on the background)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoy of playing this game, but after the sale of this game by the previous owners, the comfort left the game. Even the banal entrance to the game is now a quest - launch the game so that you see the list of servers, this is a 1 in 20 chance. But that's not all - you also need luck to enter, because after choosing an entrance, you won't be allowed into the game, but will be shown cinematics. At the same time, support gives useless advice that doesn't work, like \"uninstall the game and reinstall.\" I'm tired of deleting and installing this kind of game every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its just very boring, worthless time-sink",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game update new content , leave you behind.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah man. This is some p2w, full of ads and claim menus BS.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Nope, they did a reboot and I can't find it. or play it",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mobile game slop",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "p2w like most of mobile crap games",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "So whats this is a mobile game for pc",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can't get past the login verify",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not worth your time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "pay to win",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "you will enjoy the game at the beginnig but after that you will discover that it is just waste of time and it is p2w btw",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "W. T. F.\n\"Look everyone! It has dungeons and dragons in the name!\"\nUtter garbage.\nThis \"game\" makes Raid: Shadow Legends look like a serious strategy game. Worse, its gratuitous monetisation makes the aforementioned Raid look F***ING GENEROUS.\n\nLet me be clear with this: I am no D&D know-it-all. I've played a few games of it, played baldurs gate and icewind dale, and watched the cartoon when I was a kid. The first thing that had me dubious of their entire set up was in the intro, where we get a BS \"tutorial\" of a bunch of magical scrubs going up against - allegedly - Tiamat.\nNow, Tiamat has 5 heads - one for each type of non-metal dragon. Theirs has 3. Seems like the devs nerfed the dragon goddess.\nNow, somehow, this bunch of unheard of \"heroes\" managed to lop off one of these heads, and then they promptly \"fled\" the battle.\nOne of them took one of Tiamat's heads off with one hit. ONE HIT. Decapitated one of Tiamat's heads. From a freaking dragon GODDESS. And that made them say \"lets flee\"?!\nIf you're having a tough fight with someone, and by some miracle the other guy loses an arm, you don't bloody run! You've literally just won! The loss of a major limb causes any creature to bleed out! Not to mention with only 3 heads instead of 5, you've just slashed Tiamat's fighting capacity by a third, and yet you run away?!\nWho wrote this garbage?!\n\nProblems with the right, and BASIC D&D CANON aside, the game looks good.\n\nBut that's all.\n\nIt takes up over 8 gigs of HD space, and is little more than a crappy auto-battler.\n\"Oh but you get to direct the characters's ultimates!\"\nNo, you mean I have to sit there watching a bunch of counters ticking up until their portraits are highlighted and then drag an icon onto a screen.\nHardly the most involving tactical combat.\nCheckers is more tactically demanding.\n\n\"Oh but you get to upgrade your characters and equip them with gear!\"\nYou mean I have to craft a bunch of stuff that allegedly increases their stat lines, which has no effect on them getting their asses handed to them. Seriously, you \"recruit\" a dwarf on the adventure who's supposed to be a f***ing tank who \"specialises in taking damage\". The guy gets one shot practically every fight - he dies in seconds, and then the party line up gets demolished BEFORE ANY OF THE ULTIMATES ARE READY.\nYes, he's the same level as the enemies.\nYes, he's equipped.\n\nIts deliberate to make you spend resources \"levelling up\", and consider dropping cash for the endless amounts of cash shop upgrades, items, premium currencies, and premium character summons and just about everything else you can think of to nickel and dime you into sending bank.\n\nf*** off. I've seen this kind of garbage in so many games now, its just a sick joke.\n\nThey get your hopes up on the \"create character\" screen, by displaying a bunch of races, and have you picking their appearance from a few different options - which are laughably few - which displays the 6 stats most D&D veterans are happy to see: the old STR, DEX, CON stuff. Except the stats are barely above 10, and I'm pretty sure have bugger all impact on the game regardless of which you choose.\n\nIf I rolled a D&D character and all the stats were 10 and 11, I'd make a new one.\n\n\nSummary:\npay2win garbage auto-battler that makes Raid: Shadow Legends look generous and like a tactical masterpiece.\n\nAVOID.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "Until they actually allow the game to log in through steam I cannot in good faith recommend this game. Trusting a log-in to any other system is at best asking for trouble. 2 hours of downloading time and then not one of the log in options worked to allow playing the game. Uninstalling it now so disappointing because it looked like it could have been fun.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "It is playable without micro-transactions, but still P2W. The \"open world\" sucks and the related quests too.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "I played this in Beta and checked back on it recently ,since it's \"revival\" just out of pure curiosity. I am ready to finalize my thoughts on this 'piece'.\n\nDragonheir had a strange niche when it released of being a very self-absorbed, weirdly Western RPG -targeting, P2W gacha in the AFK clone subgenre. It's features and highlights include UI and optimization to elicit a nostalgic 2013 mobile game era that absolutely no one missed. The days of absence of gameplay and graphics, cheap design tools and limited phone power, after one too many rugpulls over the years, the mobile player base has grown up and wisened up to such tactics. Not to understate, how the era involved Western consumer direct exposure to the third world, like breathing in raw sewage while stuck in traffic on your way to work.\n\nThere is a real \"I designed this, it's my first game\" amateurishness about it, which will undoubtedly remind the player of D&D and other D&D sub and off-brand products. But it also tries to \"cash in\" on D&D revival of the BG3 era of last couple of years, by adding obnoxious dice rolling everywhere. I've never clicked so much since playing Diablo. This is about the only connection to D&D or really any RPG. For the most part, it's a copy&paste Chinese \"lower buyer\" gacha some 'fan' bought to make his own mobile bestseller. \n\nInexplicably, the devs of this masterpiece decided to compound it's problems by borrowing the lesser \"multi-server, mmo-style, PoE season\" system from the less popular titles in the gacha space. This skinner box feels a LOT like a testing ground for AFK devs to try ideas that they know for certain are doomed to fail, just to make sure they are right, in a live environment.\n\nSo, what's \"new\" in the ressurection? Honestly, I didn't notice much difference. I'm out of the loop on cheap mobile games lately, so I don't know the standard. It's pay to play and once the free currency runs out, you no longer have any reason to keep going. This may very much be the standard nowadays, for all I know. They really expect you to pay for nothing, and they promise not to deliver, cause they game is as unfinished as the beta was, for the most part. This is more or less the experience the first time around, only nice to know that anyone dumb enough to give them money got completely ripped off cause the reset came with a full server wipe, with a maximum of 10 pulls in compensation for playing before, even if you spent a million dollars.\n\nThe only real new thing is the new players I guess that are giving it a shot from a new perspective. Some of them seem like they are in the third world. Also there is strange new characters, like the mysteriously overpowered Chinese woman who's superpower is that she's Chinese and is able to solo entire teams, despite being mid-tier according to the official tier lists (which dont even exist.) \n\nThere is really no hope of appealing to any D&D or RPG fan. This is still true, throughout. It's one of those games you can't really critique, because you would just end up critiquing everything ad nauseum. There is so little that it does right, that it's actually a coincidence when you manage to find fun in it. \n\nIt does not surprise me in the slightest, that WoTC, officially partnered with THIS mobile title, of them all. It's actually exactly perfect, in every way, in this regard. How do you make a game so f%*@#() BAD it can't even play itself? This is it, this is the absolute bottom of the gaming barrel, floating in the sea, in the grand interdimensional toilet that they call gacha gaming. \n\nIn summary:\n-nothing for gambling addict: no real waifu, no wild chance, very linear and boring\n-nothing for grind addict: no real carrot on a stick, unrewarding grinding\n-nothing for daily login: 1 pull a month is your motivator, literally \n-none of the promo codes work\n-you have to play the (horrible) singleplayer every season, but you dont get the \"new player free currency\" frontload everytime, which is the only way it can work\n-and finally, their one idea which was seasons and retaining your 'collection' they completely dropped the ball on because they did a full wipe of every account in the first year",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game hasn't changed at all, It remains extremely pay-to-win and If you wanna see whales take the best prizes in everything this game offers... feel free to play.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "just a money grab game mainly, one of worst greed level out there. so these is how it works, season 1 you can buy for 80 instead of regular price (100) chances to summon at first you think this is normal until somewhere along they raise it to 100, season 1 otherworld horn i got 2 legendary summon and starlight summon also 2 legendary, season 2 i got zero legendary in both.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Some cool concepts, some cool systems, many taken from games like Raid Shadow Legends, Afk Journey and Genshin impact even, horrible execution, soulless gameplay and design, P2W, i literally stopped playing mid fight cause it was so dull and mind numbing. Don't bother, even the first 10 hrs aren't fun in any way.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Poor customer service. very unhelpful. Otherwise, the game has a large variety of things to do. Great graphics with an interesting story-line. Don't put money in it though.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "When we play for more than 30 minutes, and without being either retarded or severely intoxicated (the way only drug addicts consider funny), then this is a heavily pay 2 win styled `moderated board game + eye-candy´. The game intro is neat, but thereafter it does not even matter, what character we play, as constant fetch-quests force us to ignore the main story AND our personal character choices. My dwarven thief and my highlander archeologist both cast the same spells (up to level 40) and the summoning of companions is so erratic that it can spoil a game, until we pay money to save time. As known with this type of games: Bored high level players spam the chat with their egomania, and it is hard to find `friends´ to even test once what multiplayer parts offer. Having been away for years, I had higher hopes for patches & updates, but we only got more of the same.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I cannot support this game as much as i wanted to. Its a DND themed/rip-off gotcha game which some people may enjoy but the tutorials are mostly non-existent and you don't get to pick a class you just get to pick what your character looks like and depending on what they LOOK like is your \"class\". Which is so confusing, an you randomly get companions which also dont have classes from what i could tell. I waited for this game for a very long time to come to Steam in the Americas and im very disappointed in it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Pretty presentation, shallow core. Lots of grind, lots of systems, not much real payoff. It gets old quickly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't want to work on my Windows PC. It's nothing PC related, I open the game and it's just a black screen, nothing happens.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried to play the game, downloaded everything, updated everything, went into the login screen, attempted to login using my gmail, it said login success then I got a popup stating no game client found or something along those lines while clearly the game was running. Tried several times same result. So I cannot play the game. Perhaps the logon process needs to be simpler",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game has issues logging in. soe days it wont let me play deleting",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I thoroughly enjoy this game but the shockingly poor pull rates are a major deal-breaker. 0.033-2% for a single legendary hero is insanely low. I tested with 100 of each roll dice, 1 legendary out of 200 rolls. The developers claim there is bad luck protection at guaranteed legendary on the 70th roll, but evidently this is not true. On top of that, P2W players are crazy over-powered. I think the global chat should be disabled because all I see is players from servers which are later into the game, sharing strategies with newer servers and not allowing those players to learn the game, test, discover and formulate their own strategies. If you spend the time to formulate a great line-up, it can be incredibly frustrating when other players simply copy-paste your line-up and don't take the time to develop the line-up further.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is trash  \ncan`t start play because of error at 7.8 \ndont even tray to instal this trash game!!!!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I explored the map for the first story quest but there is no way out and no clue. I tried everything but no help. Im stuck in the story quest for 2 days. This game is No Player Friendly. I dont recommend this game. Total waste of my time. Bullshit!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "What the hell is the point of having a game on steam if you cant even log in with steam?!?!?! Fuck this game",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "They want a facebook,  apple,  or yahoo acct to log in.   Forget that.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I've taken fat steamy bowel movements that have looked better than this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It was fun for the few couple of 10 hours. Could not manage to get me into it (82 hours, half of it from grinding and opening the game on the background)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I enjoy of playing this game, but after the sale of this game by the previous owners, the comfort left the game. Even the banal entrance to the game is now a quest - launch the game so that you see the list of servers, this is a 1 in 20 chance. But that's not all - you also need luck to enter, because after choosing an entrance, you won't be allowed into the game, but will be shown cinematics. At the same time, support gives useless advice that doesn't work, like \"uninstall the game and reinstall.\" I'm tired of deleting and installing this kind of game every time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its just very boring, worthless time-sink",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game update new content , leave you behind.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}