{
  "positive": [
    {
      "review": "Ubisoft really said \"Let's make a viking game, give the main character the hidden blade, and call it assassins creed",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "Look, Spoiled America loves to find reasons to hate things, but honestly, there's almost nothing to complain about here.\r\n\r\nSure, it crashes sometimes, and yeah, there are some weird, wonky glitches. My Asgard mount looked warped once, and some NPCs reset awkwardly after events. Big deal. I've had way worse experiences.\r\n\r\nIf you like Assassin's Creed, you're going to like this. Period.\r\n\r\nThe weapons and variations are fun. I love the classic sneak attacks from bushes and rooftops, and the general combat flow is solid. It feels like an Odyssey and Skyrim hybrid, just minus the dragons. The ability tree is amazing; you can be a Viking brute, an archer, or a sneaky assassin. Tons of play styles to mix up.\r\n\r\nThe extra modes are what really push this game over the top. They are seriously cool and not just throwaways:\r\n\r\nRaiding: Get your adrenaline fix. Gathering the crew, sailing, and crashing a monastery for loot is brutal and satisfying as hel.\r\n\r\nSettlement Building: Watching your base, Ravensthorpe, grow from a dump into a proper home is genuinely rewarding. It’s the heart of the game and makes coming back feel important.\r\n\r\nAsgard Questline: Playing as Havi (Odin) in Asgard is wild. It’s this massive, gorgeous fantasy side-game that fits perfectly.\r\n\r\nNiflheim (The Forgotten Saga): Love the roguelite mode. It's a quick, high-stakes blast through the realm of the dead. Great for keeping the combat skills sharp.\r\n\r\nJust buy it when it's on sale. Be frugal. Less to complain about if you don't pay full price.",
      "voted_up": true,
      "votes_helpful": 23
    },
    {
      "review": "People usually complain about this game being so long and so repetitive, they complain about it not feeling like an Assassin's Creed... I get it, it is ABSOLUTELY LONG, and NOT AN ASSASIN'S CREED experience that you would expect. \n\nBUT - It has absolutely stunning graphics, a huge map that feels so alive and yet full of solitude at the same time. ABSOLUTE BEAUTY! And about being repetitive, every other game is repetitive to some extent. This one may feel repetitive in terms of mechanisms, looting and fights you have to go through, but all the locations are very different. Locations like Cavern of Trials etc. are so fascinating! \n\nAnd yes, it's NOT A GOOD ASSASIN'S CREED experience, I accept it. But it doesn't mean it's bad as a game. It gives off those Norse vibes with a load of awe-inspiring myths and legends. Boss Fights feel like an easy Souls Game, but that's relaxing! \n\nI just love this game! Everyone who wants to live as a Viking & as a Norse god (If you get the DLCs too), this is the perfect game, believe me!",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "Man this has been really fun, been very slowly going through the main story, and all the DLCs, and I'm still going. \nReally nice to explore and see the whole game.\nThe only thing I hated was the damn Cairn Rock Stacking, I feel the need to do everything but man, these things were so annoying.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It makes sense that there would've been assassins even during the viking-period (since assassins have always been active), and it would be weird if a VIKING would become a full assassin. So the way the story went is very well done (option to go full a-viking but also able to sneak and assassinate). \r\nBesides that, I really enjoy the RPG aspect. It can feel one-toned from time to time, but there is plenty to do to help with that. Also Dag and Sigurd should both take a chill pill.\r\n\r\nMoral of the story, it's not your typical AC game, but great soft RPG game to keep up with the lore!",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Assassin’s Creed Valhalla lets you live your best Viking life: rowing, raiding, and aggressively petting every wolf you meet. I set out to avenge my clan and somehow ended up remodeling half of England, collecting 400 weapons I’ll never use, and playing more dice games than actual assassinating.\n\nCombat is chunky, exploration is gorgeous, and Eivor solves problems with the subtlety of a flying axe. Historically inaccurate? Maybe. Historically awesome? Absolutely.\n\n10/10, would aggressively befriend another raven.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good gameplay and fight mechanic, good story, kinda repetitive in some point like raiding and killing enemy for ancient of order, overall good, 7,5/10, edit, ending was so bad",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm not the biggest gamer ever but I love adventure and historical fiction so this has been right up my alley.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Doesn't stray far from other AC games.  Same sneak up and stabby them in the back gameplay.  I enjoy it, though.  The story is interesting enough as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a good viking game! A lot of things to do and explore. The game plays and looks great with few glitches here and there. Definitely spend time on the open world stuff (blue orbs on the map) because they are the most fun outside of the main story line. Although it's yet another AC game where you're not an assassin. :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "EDIT: I have previously not recommended the game due to frequent crashes. From what I could gather, the problem stands in how the frames are displayed and it can crash the driver no matter if you are using nvidia or amd. However, I managed to get rid of the problem by maxing out the graphics settings, removing the upscalling, setting the fps limiter to 60 on a 120hz display and the v sync to adaptive (even though I have free sync active). I have managed to get a good few hours in without any more crashes. Even if it would still happen once in a blue moon, having about 5 hours without a crash is good enough for me. If not possible to play without upscaling or to max our graphics, I would still try to limit fps and enable v sync (adaptive if using g sync or freesync). I do not know exactly what fixed it, but this is what I've done and I hope it helps you if facing similar issues.\n\nThe playing cycle and the stories are goodish. I am not particularly interested in the Norse mythology like I was in the Greek one, but it is nevertheless an interesting take on the gods, albeit it lacks soul a bit and it feels mundane at times. It's not truly inspiring, but it serves the purpose of creating a context for the game. The arc stories however are quite good, nothing out of the ordinary, but they are fun to play for the most part.\n\nThe fighting feels lively and I enjoy it. I don't know how it would feel on the higher difficulties because I have no interest in being frustrated, but on lower ones it feels like AC with parrying and dodging playing a big role as well as a lot of improvements and great cinematic finishers. I don't think you can totally dislike the combat, it feels complete, polished and has me coming back.\n\nThe raids as well as the sieges feels great and exciting. The mechanics are satisfying and after you begin to understand the basic ways of getting into buildings it feel rewarding as well. It's a great mechanic and I think a great majority of people will enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is good.\n\nBut the game will crash every few minutes if you start the game with a google chrome tab open, even if you have memory to spare, i dont know how nor why this happens, but its ubisoft so it do not surprises me.\n\nIf you started the game with a tab open and it starts crashing just verify the game files, it should fix.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you come into this game without any expectations then it is super fun to play with a huge map, lots of collectables and activities to complete. I haven't completed it yet and I am only 58.5 hours in but I am really enjoying it. Some missions can be repetitive but it is a great game with lots to do, accomplish, interesting storylines, interesting plot points and side characters. Like all AC games the romances are not really impactful to the story but okay. However, the DLC Dawn of Ragnarok was interesting with all the Norse Mythology elements and all the story beats. If you are willing to try this game without any pre expectations then it might surprise you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Playing this after AC:Origins, for me this game was superior from every point of view, especially the combat. One of my fav. AC games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A rich Viking adventure with a sprawling open world, satisfying combat, and deep RPG elements. Raiding monasteries, building your settlement, and exploring medieval England feel immersive and rewarding. The story is engaging, though it can stretch a bit long. Despite some occasional bugs, it’s a visually impressive and content-packed experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the first assassins creed game i ever played. i love it so much honestly and i'm not even close to finsihing it. great story, great quest lines and awesome graphics. i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Come Raid this game....For plunder....For Glory ....and For VALHALLA. So come Join the Vikings and claim your place in Valhalla",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to hate on this game a lot before I played AC Shadows. Overall, I still feel relatively the same. The game is seriously over bloated with lousy rewards and gameplay incentives. I do not like needing to discover all individual pieces of every armor set, I do not like the grind to level them up, and I do not enjoy that the main incentive for \"wealth\" are what's precisely needed to level them up. The main story is mostly just as uninteresting. The main story is like Minutemen missions in Fallout 4. Another settlements in need of your help. The parts of the main story that are focused are amazing. It just feels like they rarely happen compared to the rest of the \"main story\". \n\nThe graphics are phenomenal. If you want to get lost in a world inspired by history then this is a great game. AC lore enthusiast will find  a ton here as well if their patient enough. I recommend it on sale at a cheap price and if someone has a lot of time on their hands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game but the grind is harder is never lupus",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, content seems bloated but that's better than having no side content at all, story goes well, tons of things to explore, bosses, weapons, fighting styles, playstyles, skills and what not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have enjoyed all the assassin creed games I would recommend all of them if someone is into playing pretty much by their selves.  This is definitely a big plus for me in any game but the storyline, the graphics, and even the game play is most enjoyable.  The only bad thing I have to say about this game is the crashes that I do get lately after playing up to six ours then just shutting down has been annoying.  I have tried all the fixes and nothing has worked so to account for this I just save more than just letting it auto save for me.  Still love the game and will keep playing just hope they come up with a fix for this soon, been going on for the last two months.  It has never done this till now so not sure what is going on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game crept up on me. I was going through the motions and the game just took over. I think I am like half way through it and it is just so different from the other Assassins creeds games. i thought odyssey was the best, but this game is like a real experience...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game play and graphics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best Assassins creed to ever play. Story rich, the combat is amazing, the views and scenery are gorgeous, many many missions and things to do, the skill tree is brilliant. My favourite arc so far has been Island of skye I know odd and as short as it is but I found Kassandra so interesting and really wished they dived deeper into her and her story and background and had a pit full of missions with her. I haven't finished the base campaign yet but I am on it. I am trying to 100% comletionist this game meaning every achievment and missions+ side quests completed. it'll take over 280+ hours but it's so worth it for this game. Get wraith of the druids, Ragnorok and francia it adds so much more content and so wroth every penny, Get this game whenever you finacially either when it goes on sale or not on the sale whenever you can AND play ittttt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game, solid story, fun mechanics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is a time sink if your into that, if you go into this thinking that it an a.c game your half right. i would recomand getting the silver and xp boost just to make the game a little more bite size. because the skill trees are vast. \n\n1. combat, at first it feels clunky but after a few moments when you start getting use to it, you'll understand that its more button timed then it button mash. i like that you can use differnt wepons in each hand and how they keyed into the timed system. its a refeshing feeling to hit something and have it actually flinch and no just eat the damage that i just hit him with. for the fact of combat in this game i give it 6/10 due to the lvl based combat. [plays like an rpg]\n \n2. stelth, its kinda pointless in this game yes its there yes it has some uses but it doent mash well with the combat.\nits wayyy to op you can take over any camp without trying just but doing a stelth bow run. for that reason i give it a 3/10 just breaks the game in ways that make it unfun to play because it turns each area into a grind moment and if you get caught or seen it doent punish you. you just go oh well then proceed to wipe out the whole army with an axe. \n\n3. story. its long atlest 50hr. the female/male choice shouldnt be there they shouldve picked one or the other and built the story from there because it brakes the story there moment where if feels like you shouldve been the opposite gender and other moment that you were the right gender. i shouldnt be even talking about gender in a a.c game. to other people theres alot of story holes but i feel like it was brought together well its just confuseing even if you follow the power lvl base that they have in game but i do see what they were trying todo just didnt pan out like that. for this i gave the story a 2/10 its too long and it feels like fetch quest even though your not doing fetch quests.\n\n4. crashing issues, yes it true no matter what you do to fix the game it will crash. out of my 70hr playthrough ive spent 5hr sitting in loading screens ive done all that they recomand to fix the issue but it has todo with the game itself. brakes the game and the momentum for that ill give the playable a 2/10 just pushes the game to feel more like a grind and not like a story.\n\n5. price point. this game shouldnt be over 50 dollars. for almost 200 dollars for the complet game NO not worth it it a joke yes your paying for the content but if you wanted this much of a grind just go play a free mmo rpg in my eyes this game is only worth 20 bucks and 5 buck per dlc its as polished and smooth as 50 grit sand paper and they should use some of that 50 grit to acully polish the game with that being said i give it a 1/10 that the lowest score i ever given a video game for price.\n\nnow the score 14/50 with a score like that i cant recomand this game to anyone unless you like to grind games for fun. DO BETTER E.A .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is great, I honestly prefer AC Odyssey. However, it has it's own flair to it, something draws me in, I don't know weather it's the similarity to Odyssey or it's just the Viking theme but I'm fine with singing the games praises.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, if you like the theme.\r\nI don't understand people complaining about being too big and bloated, it is an assassin game, so nothing new. And people like this big games to relax to after work.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game - I love the viking theme but this game is again another huge success in the AC franchise. love it so far.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly.. at first i wasn't too happy with the gameplay and game control but that was on XBOX one but after getting it on PC... I won't lie but it's actually alot better",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it. Need a crossover w/ Skyrim and these game mechanics. Would literally be the best game ever made.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow this is an awesome game graphics are spectaculer gamepaly is sick and on sale it is damn cheap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an excellent RPG. It has great value for your dollar and you can easily spend 100's of hours in game doing stuff. When it comes to graphics, combat, story, etc... its superb. The only negative thing is that it's not a good assassins creed game if you feel me. There's assassins creed sprinkled in pieces and it fills out the story line but when it comes to overall feel, not assassins creed. Again, great solid game for a viking rpg.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An immersive and interactive experience.\r\nExcellent and accurate storyline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Let me start with the good things about the game - it's a really good Viking simulator, unique graphics, a pretty well-made and challenging map, the combat system is good and we'll stop with the good things here. The game has an incredibly unnecessarily long story that feels unnecessarily drawn out in a way that makes you not want to play the game again. I understand that Eivor is a Viking and doesn't want to beat people up the way Assassins do, and prefers to do it in a duel, but why the hell is the game called Assassin's Creed when even the main character says he's not an Assassin, he just liked the cause and would help them. I don't know what the guy who came up with this concept was smoking, but I want the same thing. But the game is still playable and I would give it a 7.5/10, and that's just because of the story, not because it's bad, but because it's unnecessarily long and boring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hmm how do i start.. Okay its a pretty long story line which blends perfectly with the ac lore,(especially the modern day story line), The main character is a beast , Eivor is a very good character however the story doesn't revolves much around him its mostly his clan and his brother Sigurd. Combat is very good , the weapons ,the bows, the abilities are so cool(Dive of the Valkaries personal favorite), The music is just on point map is huge lots of side quests personal fav was the asgard quest however some might not like it, Kassandra DLC is great , At the time I am writing this I only played that DLC none other, There's just a lot to explore in Assassins Creed Valhalla , This game might not be for everyone but I liked it have played over 90 hrs and still plan to explore the variety of content it offers definitely worth trying out if its dirt cheap.(which it does pretty much every 1 or 2 months) Rating wise i'd give this an 8/10 just because there are some main story line quests which are boring, Overall a pretty decent Viking game but a mediocre Assassins creed game in the terms of stealth not the lore part.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good game to kill some(a lot of) time. The story is too long drawn out and not well presented. The world is very beautiful at times and huge too. The mount mechanics need to be bettered, they seem too float-y. Overall, I play this game to refresh my mind after playing too much of FPS games and enjoy traversing the big open-world, writing my Viking story. This game got unwarranted and below the best criticism but it is a good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game; plenty to do, love the story, the characters are cool and the aesthetic is top tier.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've got 150hrs on this game on PS and the whole \"would you recommend this game to a friend is a No/Yes, the base game absolutely not, its way to long, the combat sucks (wish they kept it AC Odyssey style that was a lot better) and for what you'd expect from \"viking assassin's\" it's a long way off, I'd rate it 6.8 out of 10.\r\n\r\nbut here's the YES! part, the DLC\"s are Fantastic especially the wrath of the Druid, that's cool as. just have to get through the main game to get there. also I'm going to keep this spoiler free, but there's a story beat that has a certain Giant dog that you can just skip and it doesn't even effect anything, alter anything or add valuable information, wtf is that all about Ubisoft.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Assassin's Creed game yet. It should have been the Crusaders next, NOT SANDBOX.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Storyline isnt as great as the others, but overall details is super.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a game, as an Assassin's Creed game maybe not really in line with the rest, meaning it's more a viking game in my opinion... But what a game... Well made, good story, game play is smooth, lots of things to discover, multiple ways of playing, and all in all just a fun viking rampage game. I'd say buy it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is far from perfect but its not that bad.I would say the combat is a downgrade compared to Odyssey.Overall i would say 6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Disgrace to black-flag , but better than unity",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not finished the game yet. But I can definitely see the complaints and the praises of this game.\r\n\r\nThe combat is very solid but lacks some more variety kill animations. This is solved via the abundance of weapons, but it is more of a personal gripe. Perfect Parry is the best perk for combat hands down.\r\n\r\nThe stealth is... okay? Surprisingly decent and it is much easier to spec into assassination damage than previous titles. Although, you need a perk that allows you to do a QTE to assassinate more challenging enemies. The bow is also pretty darn good when doing stealth.\r\n\r\nI also see why people say the story drags on a lot. Big event happens, cliffhanger and then \"Another settlement needs your help\" type thing with forging alliances. Breaks the pacing of the game heavily.\r\n\r\nStability wise, I have a pretty decent PC and the game runs very smooth with next to no frame drops. But... it has randomly crashed 6 or 7 times in the past 2 weeks for what feels like random reasons. It especially sucks when the game crashes after a raid and then I have to redo it.\r\n\r\nOverall at the current time, I'd probably give the game a 6/10 so far maybe 6.5/10. It is better than average and I'd say it is a 'good' game. Just not a 'great game' or an 'amazing game'.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't know why there are so many meh or neg reviews as of late. I really like the story and the massive expansive world you're able to explore 10/10! I think there are some people who just want the action to be turned to 11 all the time, and this one has that at most times but there are also areas where you can just chill and enjoy the beautiful world!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Старый викинг поучает молодого:\n\n— Если вы причалили к берегу английской деревушки и видите церковь — грабьте сразу её.\n— Но почему?\n— Если там есть церковь, то в самой деревне уже грабить нечего.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "expect it as a good viking game, nothing more. buy it at sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game.\nI love the combat style. But the map is too huge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peope said this game not fun, it depends how u see the game. personally i like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's a good viking game,,,don't about assassin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good game, i loved it and now trying for platinum",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite a few issues such as crashes from time to time, I still recommend Assassin’s Creed Valhalla. The game offers a great experience overall. Skal!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty fire if you dont go in expecting some crazy story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Frickin' underrated installment mos def!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ragnar of the assassins!\nGood game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is not Assassin's Creed but i like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game made me tired. fuck it i love it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "for someone whos into vikings this game is a W",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] PROS: [/h1]\n[list]\n    [*] Panoramic Views, the world is absolutely breathtaking\n    [*] The visuals are gorgeous, and the photo mode lets you capture jaw-dropping moments worthy of wallpapers.\n    [*] Whether you’re charging in like a fierce Viking warrior or sneaking through shadows, combat feels powerful and satisfying.\n    [*] There’s a huge variety of weapons, armor sets, and abilities to experiment with — perfect for customizing your play style.\n    [*] You can pet cats and dogs.\n    [*] There’s always something new to discover — hidden caves, treasures, and secrets scattered across vast landscapes.\n    [*] Raids feel awesome when you slaughter 10 enemies at once etc. \n    [*] The narrative blends Norse mythology and historical intrigue beautifully.\n    [*] Interesting DLCS.\n[/list]\n\n[h1] CONS: [/h1]\n[list]\n    [*] Some laggy/shaky graphics.\n    [*] Raven controls were terrible until I figure them out.\n    [*] Some random bugs/game crashes.\n    [*] You can climb almost anything… except that one wall Eivor randomly refuses to scale.\n    [*] The stone game (Orlog) can be painful with poor camera angles and clunky controls.\n    [*] WHY SO F MANY TREASURE/ARTIFACTS TO COLLECT!!?!??!?! So much grind!\n    [*] Tomb of the Fallens have hidden artifacts in them, and if you miss them you can't fast travel.\n    [*] Some mastery challenges have terrible design.\n    [*] Brace yourself if you plan to do 100%.\n[/list]\n\n[h1] OVERALL: [/h1]\nAssassin’s Creed Valhalla is an epic, immersive adventure that brilliantly captures the spirit of the Viking age. The world is vast and gorgeous, offering hours upon hours of exploration, combat, and storytelling. The mix of brutal raids, mythological elements, and deep customization makes it one of the most ambitious entries in the franchise.\n\nThat said, it’s not without flaws — technical hiccups, clunky mechanics, and an overload of collectibles can test your patience. But if you’re a fan of open-world RPGs and love Norse mythology, this game is absolutely worth diving into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good interesting game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game fr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love loveeeee it <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you have axe. There is stubid woman. You axe woman",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "have fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Vikings go brrrrrrrr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THE BEST AC GAME EVER <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD ^_^",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What a journey!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "super",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "7,5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "yes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sarap",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SKOL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "vikin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GG",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I'm 100+ hours in, and it's literally unplayable right now because it crashes every fucking 30 mins. The game was released 3 years ago and it's still fucking crashing!? WTF Ubisoft",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Completing only for the sake completing. The story seems promising and that's what keeps me going but I cannot recommend this to anyone because the gameplay is torture. This game was not made with passion and it shows. The map is large, pretty and soulless.\n\nWhen you're not playing the story the gameplay goes like this - Ride a horse for 2 minutes, swim for a minute across a river(your horse can swim while you are on it), ride horse for another 2 minutes, reach the point of interest on the map, find out that it's a chest or an artifact or a book of knowledge or whatever and that it's behind a stone wall that you need to blow up with an oil jar. Go look for an oil jar. Pick it up, jog towards the stone wall because you can't sprint with that weight on your shoulders. Now blow up the stone wall, enter the cave, duck under obstacles, jump over obstacles, trigger a cutscene of slipping through a crevice, finally collect what you came for.\n\nThat was extremely boring TO JUST READ, right? Imagine how boring it is to play it.\n\nAll of this takes about 10-15 mins. And there are HUNDREDS of such locations, not exaggerating the number. Literally hundreds. They give next to no rewards for all the hoops you jump through. And when they do, they're useless, you won't even use that stuff. They added a feature where your horse swims with you on its back and that says enough about how boring the map is and what a drag it is just to get from point A to point B and even the devs couldn't bear to keep switching modes of travel for pointless objectives.\n\nThere are cutscenes where the NPCs refer to your character as she/her, even when you play as a male.  Also, sometimes male eivor grunts in the female Eivor's voice. They didn't take the effort to dub some lines for both genders.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game often crashes, unnatural conversations, emotions are OFF, character can't even make a screaming face, he just open's his mouth like he's about to take a spoon of soup, don't buy it unless it's 5 dollars.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't feel like it's an Assassin's creed game. Story line phasing is too slow, I ended up skipping it. I just finish the game because I paid for it. *Gawk*",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I like the gameplay and it has a good story. As I was progressing it crashed more and more. As of now I have not finished it but left at Polchestre siege. May not finish ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks. Coming from odyssey the mechanics are a downgrade, healing is USELESS and fire is death. Unplayable, cant even get off the tutorial map without burning to death 60 times which just makes you frustrated, it isnt fun anymore. How on earth these talentless turds screw up over and over again should be studied. Id be FURIOUS if i paid full price.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "You know it's not a bad game. The picture is beautiful, and sound desing too. \nThe story structure is weak, you will reach the moments where you'll need to search on the internet for \"why there is no new quest appearing\". But thats a minor one.\n\nThe worst thing in all of the Ubisoft games is that fkng ubisoft launcher. Which you need to have even if you bought a game with steam. And with anyyy update, that laucher will reset your credentials, so you'll need to login againg. \nTHATS VERY ANNOING , thats why i'll give it 6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only buy this on 75-90% sale. \n\nEarlier completion on X-box, looked like crap. Thought I'd give it another chance with better specs on PC. Still looks like crap. Very blurry.\n\nFigthing gameplay is OK, dialogue is forced. The whole game feels like you're farming. Childish entry to the AC-series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After 24h i can't play this game, sorry guys really worst AC game from series.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "near the end of the game and now it keeps crashing just like origins did - not happy",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game is beautiful and it has culture but the bugs are crazy... We are talking about whole ass black squares and dead pixels on the map.... Trees in distance not appearing, or appearing as pixels, ground having large dead black pixels etc, its shame.\n\nDef not worth the price tag",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great start, then it turns into Longship Simulator. Endless sailing, clunky controls, zero fun. What could’ve been epic just became a slog.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not a bad open world RPG but honestly, you'll have a better time playing Odyssey by a mile if you need an Assassin's Creed Open World game. Tries too hard to be a dozen things and doesn't really succeed at too many.\n\nAlso they should be ashamed they released those Mastery Challenges like they did and left them how they are. Genuinely embarrassing content that makes me regret putting time into the game seeing how unfun and buggy they are.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Thank you Ubisoft for selling me the same game you've published 14 before (disregarding the spinoffs). You handle games like a student using AI (ctrl+c - ctrl+v)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Got the game in may 24, back then it worked fine, no issues, just never finished it. Now, trying to actually play it through, it doesn't work. Upon startup it gets all the way to the \"Press Any Button\" Screen, then after pressing any button it crashes. I've googled tips and tricks, fixes, etc. Followed the Windows help, ubi help, nvidia help, etc to no fix. Some say clear cashe, or run as admin, or link epic to ubi (i was desperate) and nothing worked.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game wants to be both a stealth game, and a combat game. To be clear, it fails desperately at being a combat game. It's idea of being such is just PRESS MORE BUTTONS QUICKER.\n\n       The Story isn't bad, to me, at least, I enjoyed it, and I set the enemy alert status to highest, and played like one hit would kill me, but I didn't set combat difficulty to highest, because that is essentially just click the attack button a lot at the right time and win, but a lot, A LOT, that got boring really quickly. I enjoyed THE GAME with those understandings in mind. Take that as you will. \n\n       If you aren't willing to suspend your disbelief, if you play game only for the mechanical challenge, this game is not for you. You do you my friends, going into it alert.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "too long and not even in a fun way . its just long and tedious for the sake of being a huge boring time sink that might make you want to buy some skins in a p2p game just so you don't die of boredom along the way . the story is the laughably bad to the point where 30 hours down the road i dont even remember what im doing anymore because i zoned out during every single cutscene . after that all that remains is a mind numbing grind of killing the same 4 enemy types over and over and over again . and btw the coolest skills are not even for stealth and since the parkour is made for people who are fresh out of a juicy lobotomy stealth is not even an option . i mean why would you waste your time slugging your way with stealth when you can just head butt the enemy and curb stomp every single one of them in 2 mins and end the misery that you are enduring faster ? \noverall\nstory:4/10\ncombat:5/10\ngraphics:8/10\nperformance:8/10\nprice to content ratio: 10/10 (a lot is a lot even if its just a pile of shit disguised as game)\nif you really want to play a viking game buy it when its on a sale deeper than 70% other wise you are just wiping your ass with your money .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I tried to play this multiple times, but regardless of how much I forced myself to give it a shot, I just can't warm up to the story, which is very pushy at the start. Same with the gameplay, can't get any fluid movement and every fight seems like a chore or a pushover.\n\nWish I would like this game, the concept seems cool.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't bother\r\nbugs, crashes, bad voice acting, bad writing\r\nit gets samey real quick\r\nsave your money",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "How does this game take 150 GB and YET it has such [b]shitty[/b] compressed high-pitched audio??\n\nGameplay is quite fun, story starts strong, then quickly falls off. A lot of resource collecting.\n\nHonestly, the only thing keeping me from uninstalling at this point is the weekly free legendary item.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought the base game and all the DLCs, cost over $130...and it crashes every 10-15 minutes\n\nI have a top of the line PC that's less than 6 months old with a RTX 4090, a dedicated 2TB SSD for games only, and 64gb of RAM.  I don't have this issue with Cyberpunk, Red Dead, or any other game made in the last 10 years.  \n\nREALLY disappointed.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I like how the game looks and I like exploring the countries... that's it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "AC:Valhalla its like a cheap buffet/all you can eat steakhouse, theres a lot of options, but deeply you know no matter what you pick, its gonna be cheap and have a mild taste and leave you wonder if you should've expended your money wisely.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game itself is more assassin's creed that you're used to, and this review isn't even about that.\r\n\r\nThis review is about the abysmal ubisoft connect that you are forced to use alongside this game. I am trying to play a SINGLEPLAYER game, but the game keeps closing because it loses connection to ubisoft connect (something wrong on ubisoft server side). Why is my game closing just because ubisoft can't maintain their own servers?\r\n\r\nIf you go to the launcher logs for AC Valhalla, you'll see that the game checks in with Ubisoft's server every 330 seconds....a single player game.....every 330 seconds. And if there are any errors, it force closes the game. So you could be right in the middle of fighting an enemy boss, and the game will close cause Ubisoft's server didn't read their Achievements file properly or whatever.\r\n\r\nThe only saving grace is that I purchased this game on sale. I would be livid if I had paid full price for this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This came considerably close to the same level of annoyance as AC3. Everyone who had a hand in making the 'Mastery Challenges' should be permanently blacklisted from this industry. I actually became a theist after this. Not because I genuinely believe in a higher power, but rather that I want hell to be a real place in which the developers of this game can rot for all eternity. And to those giving this a positive review, you people need to be put in a psych ward.\n\nThe audacity to demand 140€ for a full game that is artificially stretched and has nothing unique to offer is straight up criminal. The main story is 95% filler. And if one large-scale map wasn't enough, have 10 more! How about some stone stacking and parkour activities? How about cryptic side activities that make no sense? How about moving blocks around for a million times?\n\nThis game tries to be an AC and Viking game simultaneously but fails at both. The stealth system in the aforementioned Mastery Challenges is an absolute nightmare. None of this shit was playtested whatsoever. This is not a stealth game. I had to endure so many bugs that ruined the experience tenfold. Upwards of 30 game crashes on top of constant unoptimisation. Especially the broken animations frequently take you out of the immersion.\n\n200 hours down the drain just so I can brag about having achieved 100% completion in this shitheap of a game. This isn't a game though, it's literal slop. Ubisoft has absolutely nothing to offer. I'm so relieved to see this company being on its last knees. This is the grave they dug themselves. You don't even need to mention the woke horseshit in their games, the quality is already at the bottom of the barrel.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I spend nearly 95 hours in this game I think I have right to say this- This game is absolute SHEET. As I always feel obligation to complete every main and side content of the games I bought I did same with this one at first I like it very much I wanted to everything that it offers then after playing for few hours I realised how ubisoft is fooling us by giving repetitive and endless content. I used to like Ubisoft as a company so much because they made 2 of my favourite \ngame series ie. Far Cry and Assasins Creed but after playing this I lost all the interest in Assasins Creed and yes Far Cry 6 also gives a huge compition to this in being huge disappointe. And if someone thinks after 95 hours I comoleted everything but no after certain point I completely started to ignore side content which I dont usually do for other games. Its main missions feels like side missions so I did not feel like I eas missing something. After 95 it still have left whole Valhalla storyline but I deleted this game as soon as I comoleted last main mission.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Lost 5 hours of gameplay because recommanded level means nothing and autosave is stupid.\r\nGot the game discounted, still feel cheated of my money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if u play the game slowly, its a good \"video game\", immersive. But I dislike it, cause as an assassin's creed franchise, its a bad ac game, but its a good game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For every good thing in this game, there's a negative that hampers it into not being a fun experience. A Viking game set during the time of the Great Heathen Army invading England? It's historically inaccurate out the wazoo. A game that could explore the moral complexities of Viking and Anglo-Saxon societies? Well almost all the Vikings (ones invading and pillaging England) are portrayed as some form of fucking peacekeepers and the Anglo-Saxons are portrayed as comically evil. Oh you're kind of getting into the story? Here have 30 hours of filler that should have been optional but you have to clog through to get to the true ending.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Generally dog sh**.  Play if you're looking for entertainment per hour.  The lore is awful, the execution of the story is awful, and over half of the game is filler content.  I got my money's worth, but it was more like a prostate exam than a good time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Definitely one of the games ever to exist. Way too long, bad writing for 90% of the game. It's very funny to me how they mention the Assassins like, 3 times throughout the entire game, and once you exit stealth you can't get back in unless you try  really hard. Also, one of the Viking games to ever exist, worse than God of War. There's a reason that, in the first trailer you watch on Steam, the reviews are from websites like IGN Spain, Daily Star (a satirical website), and JeuxVideo, a French website no one outside of the Francosphere has heard of.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Instead of loading Ubisoft Connect, it just displays 404 page not found. Used to connect just fine but hadn't played in a while; looks like one of the updates wrecked it. What good is a game that won't let you play?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Too buggy to enjoy to any great length. What ashame.\nWhen you hide in a bale of hay and wonder whether you'll be able to get out again, or have to reload your game! :-/",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was midway through my first playthrough of the game, and enjoying it quite a bit. Eivor was a manly man who dominated other men, and the world was at peace. Then I went onto the AC discord, where I was told that instead of being a manly man, Eivor was a w*man.\n\nI'm sorry, but I simply cannot play a game where the main character is a bottom. All this time I thought Eivor was the one topping, but now I've found out that, in canon, Eivor is a bottom. I've been unable to enjoy the game in the same way since learning of that revelation, and I feel like this is erasure of all the great deeds tops have done for humanity.\n\nI refuse to play another ubislop game until I know the MC canonically tops other men.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Is it an ok game, but nothing in comparison to after playing Odyssey and Origns. Quests are boring and are not displayed well on the maps",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is horrible. It's a half baked attempt to mash up multiple different gaming genre's into one and has completely lost the vision of what Assassin's Creed is supposed to be.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I have played very single assassins creed game, and this is the worst written, worst designed, most unbalanced, stupid, garbage game I have ever purchased. Ubisoft and their employees make bad games, and they should feel bad about themselves, for ripping us off.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "[h1]Assassin’s Creed Valhalla Review[/h1]\n\n[hr]\n[h1]Overview[/h1]\nBig, pretty, and stuffed to the brim. I ended up 100%ing it across Epic and Steam, saves carried over, achievements and all. Treat it like a giant Viking RPG and you will have a good time. Treat it like classic Assassin’s Creed and you will wonder where the hidden blades went.\n\n[hr]\n[h1]How I Got Sucked In[/h1]\nI bought it on Epic, then again on Steam when it landed there. Seeing my saves carry over made my brain go, “well, now you have to finish it.” I was on a Ubisoft achievements binge, so Valhalla became The Big One. Hours later… okay, hundreds of hours later… the checklist brain was fed.\n\n[hr]\n[h1]World and Performance[/h1]\nNo debate here: the world is gorgeous. England’s rolling fields, snowy Norway, trippy Asgard, and the DLC zones all look great. Just wandering is half the appeal, especially early on when every hill has a postcard view. Performance was rock solid for me on high settings. Points for optimization.\n\n[hr]\n[h1]Story and Vibe[/h1]\nI like Eivor and I liked the overall journey, but it is long. Near the end I felt the “let’s wrap this up” itch. As an Assassin’s Creed game, it barely whispers; as a Viking epic, it sings. If you walk in expecting social stealth and concise plotting, you will bounce. Walk in expecting mead, raids, and myth, and it works much better.\n\n[hr]\n[h1]Combat and Systems[/h1]\nFun toolkit, a bunch of flashy abilities, solid hits. After dozens of hours the repetition creeps in because the game is enormous. Raids start as a party and slowly turn into meal prep. Collectibles are everywhere. If you are chasing 100%, prepare for a relationship with your map filter.\n\n[hr]\n[h1]Length, Patience, Sanity[/h1]\nMy Steam time shows ~70 hours, but my carryover save pushes past 300. This is a marathon. Take breaks. Touch grass. Come back. Repeat. Valhalla rewards the slow-burn approach way more than the “I will finish this in a weekend” approach. Your thumbs will thank you.\n\n[hr]\n[h1]DLCs[/h1]\nDawn of Ragnarök is my favorite. New abilities, fun setting, cool characters. Yes, I know some people disliked it; I vibed with it. It is also not in the season pass and costs extra, which stings. There is also a roguelike mode for people who looked at a 200+ hour RPG and said, “needs more grind.”\n\n[hr]\n[h1]Exploration, Collectibles, Achievements[/h1]\nExploration is inviting and genuinely rewarding at first, then the scale hits you. The number of shiny things is… generous. Achievements are doable but grindy across the base map, Asgard, and DLC areas. If you love filling bars and hearing little chimes, you will be very, very happy.\n\n[hr]\n[h1]Mindset Matters[/h1]\nThe magic trick is simple: stop calling it Assassin’s Creed in your head. Call it Viking Life Simulator with parkour. Suddenly the expectations line up and you start enjoying the parts it actually nails.\n\n[hr]\n[h1]Who Will Like It[/h1]\n\nExplorers who want a massive world to roam at a relaxed pace\n\nPower fantasy enjoyers who like abilities, loot, and long arcs\n\nAchievement hunters who live for a big checklist and do not fear spreadsheets\n\n[hr]\n[h1]Who Will Not[/h1]\n\nStealth-first AC purists wanting tight, focused missions\n\nPlayers allergic to collectible bloat and 100-hour plus commitments\n\nAnyone who wants their DLCs included in one tidy pass\n\n[hr]\n[h1]Verdict[/h1]\nRecommended on sale, especially if “Viking open world RPG” sounds comfy. The visuals and performance are great, the journey has highlights, and Dawn of Ragnarök was a win for me. It is bloated, yes, and the Assassin part of the creed took a sabbatical, but with the right mindset and some well-timed breaks, Valhalla delivers a meaty adventure worth sinking an axe into.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It was good until you had to play the typical reverse gender of a female where they act like men.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "CRASHES ALL THE TIME. NO FIX. SIMPLE. DONT BUY. EVEN IN 2025 ITS USELESS. I WASTED SO MUCH MONEY ON THIS STUPID GAME THAT DOESNT WORK. (NOT FULL PRICE LUCKILY) BUT PLEASE IF YOURE READING THIS. DO NO BUY THIS GAME AT ALL COSTS.\r\nORIGINS AND ODYSSEY ARE FAR SUPERIOR ANYWAY. BUT THIS IS A SCAM AT THIS POINT. SELLING FAULTY PRODUCTS IS A DISGRACE. IM 9 HOURS IN BUT STEAM WILL BE REFUNDING ME.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Your game should be understandable without players having to watch YouTube.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "One of the worst ASSassin's creed games yet, raids are glitched too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i cant running this game cuz need cd keys for log in to ubisoft connect",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "So tired of this game crashing. It's seriously ridiculous.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game totally shit\r\ntrash\r\nfull of woke\r\nnonsense\r\nit shit\r\n90 hours wasting",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I keep playing an hour or two here and there waiting for it to get fun and it just doesn’t.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is probably the worst game to ever exist, sometimes buggy, waste of time quests, lots and lots of dialogues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful graphics, but tons of crashes on the PC version..",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 10 hours game started crashing and its happening every 5-10 minutes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Took me 89 houres to finish the game, unfortunately i cant recomand this game 6/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fuck that cairn minigame, nobody likes ur game coz of that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Boring and didn't feel anything about being an Assassin.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately, it requires Ubisoft Connect",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisofts launcher is such a pain in the ***",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game crashes every now and then",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "bug terus, force closed terus",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dont buy Ubisoft games",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Crashes constantly",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not what i hoped for",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "FUCK THIS GAME",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft sucks",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "always lag",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Fuck the French!",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "ahh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "[b]Valhalla delivers beautiful scenery and an impressive Viking atmosphere, but this fails to hide a flawed open-world formula. The game is artificially extended with endless, tedious \"secure an alliance\" quests, turning it into a massive time sink that stretches well beyond 100 hours. Combat feels clunky and lacks satisfying hit feedback compared to previous entries. Furthermore, years after launch, technical errors, stutters, and optimization issues still constantly undermine the experience. It feels less like an \"Assassin's Creed\" game and more like a bloated Viking warrior simulator. If you don't have infinite patience and time to waste, steer clear of this one.[b]",
      "voted_up": false,
      "votes_helpful": 87
    },
    {
      "review": "Ubisoft HAS to stop compressing the audio of their games to such a low quality, its disgusting and the game sounds like it was recorded through a cell phone... \n\nAt the very least give players the option of a free HD audio dlc or something, like jesus christ im sick of all their games sounding like shit....",
      "voted_up": false,
      "votes_helpful": 36
    },
    {
      "review": "I had a damn good time playing this game at first... the world, the combat, the story, all solid. But holy fvuck, that Animus glitch FvuCK-ASS puzzle garbage made me wanna slam my head through the monitor. Who in their right mind thought, “You know what would make a stealth assassin game fun? Endless glowing cube parkour puzzles that no one asked for.”\n\nLike bro, nobody woke up and said, “I want to play a side mission that feels like an unfinished tech demo.” Whoever pushed that idea deserves a lifetime of lag spikes. And don’t even get me started on Layla, she parkours like she’s hauling a 150kg backpack filled with regret. Gravity straight up said, “Let me double down on your suffering.”\n\nAbsolute dum- sh1t. I’d refund this disaster if I could.",
      "voted_up": false,
      "votes_helpful": 50
    },
    {
      "review": "unpatched crash bugs in a 5 year old game ..........",
      "voted_up": false,
      "votes_helpful": 30
    },
    {
      "review": "I'm 100+ hours in, and it's literally unplayable right now because it crashes every fucking 30 mins. The game was released 3 years ago and it's still fucking crashing!? WTF Ubisoft",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Assassin's Creed Valhalla has impressive visuals and a massive world, but for me, it just didn’t hold my interest. The gameplay loop felt repetitive, and despite the scale, I struggled to stay engaged. I didn’t finish the story — not because it was bad, but because it never really pulled me in. If you enjoy long open-world games with Viking flair, it might be worth a try, but personally, it just wasn’t for me.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "At first, I was tempted to buy it because it was cheap\nbut after playing it, I remembered that Ubisoft said I needed to become comfortable with not owning their games.\nSo, I just refunded the game.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "6/10 \n\nIncredible visuals, but that’s where the praise ends. The game is extremely bloated with boring, repetitive side missions. Unlike Origins or Odyssey, which at least had interesting historical worlds to explore, Valhalla’s map feels so empty .\n\nNot even worth buying on sale , you’ll never finish it because the grind just isn’t fun. \nUbisoft clearly tried to copy The Witcher 3 formula, but failed miserably. Save your time and just play The Witcher 3 instead.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "I really tried to be patient with this game, but it's hard to have fun with it.  There are so many bugs and crashes that it's hard to believe.  These aren't just small problems; they happen in the main story, side quests, NPC interactions, and even in missions that you do over and over again.  I wanted to finish the game with 100% completion, but the constant technical problems made it impossible to enjoy.  It's not fun; it's just annoying.  I can't recommend this game at all until the developers fix these issues.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It’s ok. Feels big and empty. Half the time you’re running around trying to get somewhere. Not enough enemies around. If you’re looking for an experience like unity where you’re around a lot of npcs this ain’t it. Honestly feels more like a resource gathering sim than AC.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "🔰SHREDVIEW🔰 - From someone who actually plays and finishes the games before reviewing.\n\nNOTE: If you like my work, please check out the rest of my reviews, I put a lot of work in these to offer the best overall description of what you’re up against. Thank you in advance!\n\n🔷 ABOUT THE GAME & LORE 🔷\n\nMeet Eivor, a Viking raider leading their clan from Norway to settle in England during the 9th century. The story blends Norse mythology with Ubisoft’s long-running Assassin–Templar gig. At its heart it’s about conquest, alliances, and carving out a legacy. I actually liked the story a lot here despite popular opinion, it was engaging enough, even if it didn’t reinvent the formula. I’m a mythology enthusiast, quite a lot actually so for me it paid off to see these characters in any sort of scenario and have control over them to immerse into the world. \n\nBut let’s not kid ourselves, this is the same pattern Ubisoft already used in Origins and Odyssey. It’s basically the same game but dressed up with Vikings. What makes it feel different are the weapons, combat mechanics, and a Norse skill tree that gives the fights some unique flavor.\n\n🔷 THE GAMEPLAY 🔷\n\n👉 GENERAL:\nThe core loop is exactly what you’d expect. Explore, raid, loot, upgrade your settlement, and cut through armies with axes, swords, and bows. It’s fun in bursts but bloated as hell, padded with filler until you start asking when it will finally end. Ubisoft copy-pasted their formula until it bled.\n\n    •\tThe game carries itself in a decent manner along with the story, if you really like Norse mythology, it will satisfy that itch. It’s also easy to master and learn your way around it, I think they did a good job on being user-friendly but that’s ok, it was enough good for the people cause they f***d up almost everything else.   \n\n    •\tCombat works well enough, and I liked how different weapon types and dual-wielding felt. Some of the bigger weapons bug out and s**t and parrying mech isn’t always reliable either. Works and feels more than Batman Arkham Asylum or old AC one button mashing but they didn’t change from the past 2 titles on this engine. \n\n    •\tAs Ubisoft s**tfaced tradition demands, the game is full of mini-glitches: grabbing onto nothing, getting stuck on barrels, random climbing on tiny objects, awkward AI pathing, parries not registering, falling into the ground head down while running animation plays and can’t do anything but reload (this s**t looked funny), enemies spinning in circles, AI being giga-dumb, and the list goes on.  \n\n    •\tExploration is rewarding, guys! There’s always the same less than 10 loot types to uncover from a million locations on the map. The game is dragging quests and arcs far beyond where they should end. Skyrim gave me content worth staying for and taught me to enjoy long games but Valhalla gave me repetition that made me beg for the credits, rabies and an invoice for another keyboard. \n\n    •\tThe infamous trailing missions just can’t miss from anything ass creed. Follow X for 15 minutes straight while they walk as slow as the game engine allows them to. I’m lost for words. F**k this s**t until it goes flat. God d**n man!\n\n    •\tTo work at Ubisoft you need 2 major skills. To know how to press CTRL + C and how to press CTRL + V. Origins was Ubisoft's first time in a long run when they waited 2 years before releasing a game and spared us the yearly effortless feces. Then they decided it was enough and kept on using the same engine and pattern of core gameplay for a million of more games: Odyssey, Valhalla, Mirage, that disrespectful piece of trash wannabe Japanese and wait for the next!\n\n    •\tGreat voice actor for Eivor and Odin! Other good actors too. The voice acting wasn't generally bad, what makes it shit is because characters have unnatural and awkward face expressions, movements and reactions during segments.\n\n👉 NAVIGATION SYSTEM\nEhh… You run, you dash, you climb, you parkour with Michael Scott, you kill enemies, do quests, do side quests, what you did in any AC game. You have a map, map works, map is full of stuff to do until you figure out it’s the same stuff to do all over the place. That enough? Nothing special here, it’s at least user friendly, you can master navigation very easily and enjoy it for a good while.  \n\n👉 PHYSICS & MECHANICS \nCombat animations have weight, stealth is serviceable at most and progression is steady. The problem is reliability. Parry input can fail, enemies bug out, and certain weapon interactions feel off. Nothing game-breaking, just death by a thousand cuts that wear you down across 200+ hours. \n\n👉  GRAPHICS & OPTIMIZATION \nBeautiful world. No, I don’t need Wukong graphics here so it does the job in my book. England looks gorgeous, lighting sells the mood, and the engine does its job. Performance was smooth all the way. I find the video-cutscenes being ass quality compared to the game itself, I don't know how they manage but the cutscenes, while being very few, they look like crap. \n\n👉  ACHIEVEMENTS & COLLECTIBLES \nAchievements... oh boy, see this game? Number 1 bulls**t game. The achievements in this game are so t*rded that I wore a diaper for the entire playthrough because of shitting on them achievements constantly. I don't even know where to start... They are all do'able but the amount of time they take is  insane. F**k Ubisoft and f**k this game even if it's decent. If you're a completionist, do not engage! \nNever will I play another AC game, I'm done, what the hell was this bro?! Guess what, they are tied to paid DLC, this practice is straight giggidy the f**k ass s**t. \n\n🔷  CONCLUSION  🔷\n\nThis is a decent game but it is also a very annoying game. The story is good, the combat is fine-ish, the world is beautiful, the performance is beautiful and my noodle is large. The problem is it’s also bloated with repetetitive, copy pasted, glitchy, amateurish small bugs, they pile up into a tower of lost braincells. If you don’t care about 100% completion, you can enjoy it for the Viking fantasy it delivers. If you are a completionist, avoid it like the plague \n\n🔷  PROS & CONS 🔷\n\n✔️ PROS:\n-\tStory was engaging, I actually liked it.\n-\tBeautiful world, strong atmosphere.\n-\tCombat is alright and skill tree is solid.\n-\tWeapon types feel distinct.\n-\tGreat voice acting for Eivor and Odin.\n-\tRuns smooth, well optimized.\n\n❌ CONS:\n-\tFull of small glitches that pile up.\n-\tCutscenes look worse than gameplay. \n-\tUbisoft signature trailing missions.\n-\tCopy-pasted formula.\n-\tDrags forever and pointlessly.\n-\tAwkward animations and stiff character expressions.\n-\tAchievements are absolutely ass. Avoid! \n-\tIt’s an Ubisoft game. \n\n　🔷  SHORT REVIEW & STATS 🔷\n\n• PLAY STYLE:\n🔳 PVP\n🔳 PVE\n🔳 ONLINE CO-OP\n🔳 Online Multiplayer\n🔳 SPLIT SCREEN\n✅ SINGLE PLAYER\n\n• GRAPHICS:\n🔳 Fire the designer.\n🔳 Fairly old game, what you expect?\n🔳 Not great, not terrible.\n✅ Great\n🔳 Exceptional\n\n• REPLAYABILITY:\n🔳 YES\n🔳 EVERY NOW AND THEN\n🔳 NOT SURE\n🔳 RARELY / ON MAJOR UPDATE / DLC RELEASE\n✅ F**K NO\n\n• STEAM ACHIEVEMENTS:\n✅ YES (Wish it hadn’t)\n🔳 NO \n\n• GAMEPLAY:\n✅ WTF IS THIS S**T (If you do achievements)\n🔳 TERRIBLE\n✅ DECENT\n🔳 ENGAGING \n🔳 HAD A BLAST\n\n• DIFFICULTY:\n🔳 DARK SOULS \n✅ BAFFLING (If you do the achievements)\n✅ CHALLENGING\n🔳 MEDIUM\n🔳 WALK IN THE PARK\n\n• STORYLINE:\n🔳 A WHAT? WE WRITE CODE NOT BOOKS\n🔳 GOES FINE WITHOUT ONE \n🔳 DECENT\n✅ ENGAGING\n🔳 SHAKESPEARE AINT GOT S**T ON THIS\n\n❗ NOTE  - This is a review based on personal preferences and opinions. I always suggest you try the games for yourself before letting others decide for you. Even though we're all gamers, we are sure not the same.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Completing only for the sake completing. The story seems promising and that's what keeps me going but I cannot recommend this to anyone because the gameplay is torture. This game was not made with passion and it shows. The map is large, pretty and soulless.\n\nWhen you're not playing the story the gameplay goes like this - Ride a horse for 2 minutes, swim for a minute across a river(your horse can swim while you are on it), ride horse for another 2 minutes, reach the point of interest on the map, find out that it's a chest or an artifact or a book of knowledge or whatever and that it's behind a stone wall that you need to blow up with an oil jar. Go look for an oil jar. Pick it up, jog towards the stone wall because you can't sprint with that weight on your shoulders. Now blow up the stone wall, enter the cave, duck under obstacles, jump over obstacles, trigger a cutscene of slipping through a crevice, finally collect what you came for.\n\nThat was extremely boring TO JUST READ, right? Imagine how boring it is to play it.\n\nAll of this takes about 10-15 mins. And there are HUNDREDS of such locations, not exaggerating the number. Literally hundreds. They give next to no rewards for all the hoops you jump through. And when they do, they're useless, you won't even use that stuff. They added a feature where your horse swims with you on its back and that says enough about how boring the map is and what a drag it is just to get from point A to point B and even the devs couldn't bear to keep switching modes of travel for pointless objectives.\n\nThere are cutscenes where the NPCs refer to your character as she/her, even when you play as a male.  Also, sometimes male eivor grunts in the female Eivor's voice. They didn't take the effort to dub some lines for both genders.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I was really excited about the story at first, and it grabbed me a lot. But after a while, I started to get bored. There are some moments that bring back the excitement for the story again, but honestly, I didn’t like the gameplay, and the skill system feels really bad. I’m playing the game on the highest graphics settings and nothing has really impressed me visually like in Assassin’s Creed Origins.\r\n\r\nThe only thing I actually liked is the one-hit assassinations and the name displays, which made me enjoy it a bit. But honestly, now I launch the game and don’t even feel like playing it anymore. I don’t know if I’ll be able to finish it. The only reason I’ve made it this far is because I spent all the money I had to buy it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "the audio quality is EMBARASSING. Think origins, but somehow worse. Such a disappointment, the game looks awesome, expecially with HDR.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Valhalla is gorgeous but shallow. Its campaign sprawls for dozens of hours without a compelling throughline; regional arcs feel disconnected and rarely build toward anything meaningful, so the story often comes off as aimless rather than epic. The result is a lot of time investment for little narrative payoff.\r\n\r\nMoment-to-moment design leans heavily on repetition. Side activities and puzzles recycle the same beats, padding the runtime instead of deepening the world. The map is vast and pretty, yet frequently feels empty—large stretches of space with limited reasons to engage beyond checklist cleanup.\r\n\r\nSystems don’t rescue it. Stealth and combat suffer from erratic, easily exploited AI that oscillates between unresponsive and omniscient, making encounters feel cheap rather than challenging.\r\n\r\nTechnical polish is inconsistent. Crashes, visual/audio glitches, and long load times at and after launch...\r\n\r\nA beautiful but empty world, thin writing, weak AI, and persistent bugs make Valhalla feel like a lavish production with little depth where it matters.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game was very confusing when u you play first time, you might hate its at first, compare to other AC , this is good game if u want to invest most of your time but dont recomending it for casual normal gamers this game is alot of effort",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So far its a pain in the ass to just launch. \nF\\/C|<ING Ubisoft doing silent updates to the launcher, making it look like the game is just failing to load. Then it has to load the whole damn interface, then I had to launch the game again. Next, HORRIBLE load times. You have to disable the videos to not make it suck so hard. \nTHEN, you have to sit through \"Checking for Add-ons\" screen for awhile for fuck knows why. \nAND FINALLY you can get to play\n\nOn to the game itsself\nAs for being an \"assassin\" you CANNOT sneak attack enemies, but (after looking it up) you have to be god damn TAUGHT it later?!? Whats to teach?! Sneak up, and hit them hard on the neck or head, and they are dead/disabled. But nooo....\nThe first proper area where you fight after the first mini-boos and freeing the crew is just stupid. I have little time in combat, but it throws EIGHT enemies at you at once and fuck you, you are going to repeat it over and over because of shitty amounts of health restore, inexperience, and a camera that thinks walls, doors, and trees are all transparent. This all feels like a poor imitation of the start of every Dark Souls game.\nHORRIBLE start to the game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This game has good ideas but terrible writting as a whole. It is too long, there are too many annoying quests with no purpose except adding playtime, open world is bland and activities in it are either too easy or too hard thanks to awful controls.\n\nTrying to 100% achievements is a purge.\n\nGame is beautiful but it is the only redeeming quality.\n\n3/10, Bugisoft seal of approval.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Game often crashes, unnatural conversations, emotions are OFF, character can't even make a screaming face, he just open's his mouth like he's about to take a spoon of soup, don't buy it unless it's 5 dollars.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't feel like it's an Assassin's creed game. Story line phasing is too slow, I ended up skipping it. I just finish the game because I paid for it. *Gawk*",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I was really enjoying the game... For 8 hours. Now I can't play 10 minutes without it crashing.\nAbsolutly useless.\nFrom what I gather it's ubisoft connect causing the issue, not the game but there's no way of disabling the stupid launcher.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The game is too bloated and lacks the Assassin fantasy that you play assassins creed for. If you want to feel like a norse warrior, then this game isn't for you either. Just play God of War.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has a lot of flaws. For example, when you enter a restricted area and put the hood on, enemies still recognize you—it completely breaks immersion. The parkour system is clunky and frustrating, the detailing and animations look outdated, like you’re playing a much older game. On top of that, the story drags on far too long, with boring and sometimes nonsensical missions. Honestly, I don’t recommend buying this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the game is great the viking theme is awesome, dislike due to Ubi launcher. Seriously the ubi launcher in not needed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It says it takes 60 hours to beat it. 60 f*сkіng hours to finish this piece of dog shіt? Are you MAD? Nah, I’m out.\nAnd I’m 100% sure that a good chunk of your time will be wasted on dumb grind, because “your level is too low\"\n\nP.S. The scenery and level design are good, as always. Not good enough to dig into this pile",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Stealth mode is bad and the game open world is a big drag. Odyssey is the only decent game from the new lineup. Good story. Good open world. Decent movement and stealth option.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Decided to work my way through the Assassin's creed franchise. Finally got to this one, then I uninstalled the game after a few hours. It's the worst I have come across so far. So much potential, just fell very short in the execution. Camera angles are buggy, you often have a building or hut obscuring your view entirely. You no longer highlight enemies with your vision sense, just heat maps those nearby. Combat is boring, no more counters, dodge doesn't reward or even dodge attacks (you just move out of range). Using a controller with a bad R bumper was a hassle, they don't have build in alternate like (button puncher, or alternate mapping) you have to program everything and it often is a mess trying not to map over other features. In combat you just mash light attack as often as you can. Until you meet a templar, then it's zero damage. That's right, not just a big challenge, they decided to make it impossible. No hits will damage or even land on high level templars. The boat and horse are a mess with the route following, they constantly are headed in a direction, you choose to follow and they will turn completely around, which is odd considering there is no go to obective any longer, just buggy. The sequence to start following route is a longer process so by the time you fix it you are in the shoreline struggling to paddle backwards to fix the bug. There is not a very clear line between being hidden or being in combat, the two come in and out constantly for no reason. High level archer characters can see you even hidden from almost a mile away at times, you have a danger indicator sitting on you for minutes until a random arrow gets lucky enough to one shot you from across the map and you have to start the raid you put an hour into all over again for the 5th time. Had enough, Seemed like it could have been a cool entry, nice graphics, decent plot, they must have rushed this one out. I'd recommend skipping this chapter.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Listing everything wrong with the game would fill an entire book.\nThis game is a huge step back from Odyssey and a veritable mess of bugs and crashes.\n\nThe good:\nThere is an ability that allows your raven to pick up loot from enemies killed with a bow.\n\nThe bad:\nThe world is empty and dead.\nAlmost all the locations look like something out of Dark Souls (dead and ugly).\nSome sound effects don't fit the game, like collecting the masks. It sounds like a creature from a horror game is hiding around the next corner.\nUnsympathetic characters.\nFar too many collectibles.\n\nNo more loot from enemies.\nNew gear is extremely rare, only 1 per special chest (use a guide to get a good set and be prepared to use it throughout the game, the same goes for weapons).\nOr you can use your credit card and buy new gear from the cash shop (no skins!).\n\nThe gold medal challenges are almost completely broken, for example, enemies simply climb out of the level.\nSome bosses are broken and require many tries and luck, such as the Fenris Wolf boss fight (it keeps getting stuck in the ground).\nIf you use a non-horse mount and go to Asgard (the dream world), you'll get a glitch mount, like something out of nightmares (legs twisted upwards and textures stretched toward the sky).\nThese bugs have been known for years but aren't fixed.\n\nAlmost all chests (only one at a time) are located behind a locked wooden door.\nYour Viking can't break down the door with his axe. Instead, you can walk around the houses looking for holes or breakable parts to crawl into (you only have to do this a few hundred times; some have puzzles and hidden entrances on top).\nNot all underground entrances are shown on the map.\n\nYour bird is now worth less than a chicken nugget and can't even mark enemies anymore.\nThe kill animations are too long and are 100% triggered by melee attacks on elite enemies (and these are very common enemies). They can't be skipped or deactivated (elite enemies are best killed with bows only).\nAnd much, much, much more.\n\nFor 100%: Don't do it.\nIt takes over 200 hours with guides and is very dependent on luck with the bugs and crashes.\nRemember that to get 100%, you have to earn gold medals in the challenges. These have a fixed maximum difficulty, gear, and abilities, and are riddled with bugs. One of the DLCs is a separate rouge-like mode with maximum difficulty that has nothing in common with the base game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I like the gameplay and it has a good story. As I was progressing it crashed more and more. As of now I have not finished it but left at Polchestre siege. May not finish ever.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "9 times out of 10 it crashes randomly.  It'll be fine as you do missions with lots of stuff going on that get you to 60fps, then you can go for treasure at over 100fps and it'll freeze and close itself, it happens at least 3 times a day so I just give up with it, can't be bothered with this crap.  I thought it was my ps4 when it happened on there but nope it's same on pc so a game bug",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game sucks. Coming from odyssey the mechanics are a downgrade, healing is USELESS and fire is death. Unplayable, cant even get off the tutorial map without burning to death 60 times which just makes you frustrated, it isnt fun anymore. How on earth these talentless turds screw up over and over again should be studied. Id be FURIOUS if i paid full price.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "one of worst AC games i ever played i wanted to see Ireland in a ac game but its noting but hills and about no irish in Ireland just vikings",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "You know it's not a bad game. The picture is beautiful, and sound desing too. \nThe story structure is weak, you will reach the moments where you'll need to search on the internet for \"why there is no new quest appearing\". But thats a minor one.\n\nThe worst thing in all of the Ubisoft games is that fkng ubisoft launcher. Which you need to have even if you bought a game with steam. And with anyyy update, that laucher will reset your credentials, so you'll need to login againg. \nTHATS VERY ANNOING , thats why i'll give it 6/10",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Only buy this on 75-90% sale. \n\nEarlier completion on X-box, looked like crap. Thought I'd give it another chance with better specs on PC. Still looks like crap. Very blurry.\n\nFigthing gameplay is OK, dialogue is forced. The whole game feels like you're farming. Childish entry to the AC-series.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "After 24h i can't play this game, sorry guys really worst AC game from series.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "near the end of the game and now it keeps crashing just like origins did - not happy",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}