{
  "positive": [
    {
      "review": "Honestly, I can’t believe I’m saying this, but even though this might be one of the dumbest Resident Evil games in the series, it somehow became my favorite. The gameplay, dodging, and the combat are surprisingly good once you get used to it. Add co-op on top of that, and it turns into a whoe new level of fun.\n\nIf there’s anything holding it back, it’s the occasional clunky camera angles and those fkass quick-time events.",
      "voted_up": true,
      "votes_helpful": 11
    },
    {
      "review": "really enjoyed this game despite it being rated the worst resident evil game out of the main 8, i love that you can play the story from all the different characters perspectives.\nleon and jakes campaigns were my favourite!! (i still love u chris & ada)\n\n+1 for co-op, i had fun playing w my friend >~<",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Honestly great, not perfect but great.\r\n\r\nI personally think it makes great sense for the franchise to become action, hear me out.\r\n\r\nThese characters have fought these viruses and mutations for YEARS, of course they arent scared anymore. The first entries it made GREAT sense that it was horror but these characters are used to it, its their lives and jobs to fight these monsters.\r\n\r\nThats why it also makes sense to put them aside and take new characters into the universe. Doesnt make sense to see someone like leon or chris being scared anymore, now their great side characters or DLC. Maybe in the future a great mix of horror and action. \r\n\r\nDidnt comment on the game but on the franchise lol, pretty good game. I really enjoyed it, just not ada's playthrough since i felt like it was JAMPACKED with annoying enemies and all over the place tbh",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Ok, this review will probably be a tad long cause this is the resident evil i've been hoping to play the most, since everybody talks like its the worst game in the whole world\r\n\r\nFirst of all, i think the main problem people had with this game was because they didn't get a proper item management, doing puzzles, checking the map for items resident evil since almightly resident evil 4 (dont remember if original re4 fulfills all those conditions though), so this means people were expecting the highest budget in the franchise to be an amazing games that goes back to its roots, it does not, so people got mad\r\n\r\nThis game is not bad, it's actually a good game, in terms of graphics, cool moments, explosions, quotes, characters, everything, this game is the best in the entire franchise, it has the biggest budget so it's obviously the one with the most work done in every single part of the game, this game is absolutely gorgeous even for the time\r\n\r\nI'll first talk about the things i liked about this game. i'm not tryna spoil if you didn't play the game yet, but i'll assume you know the game has 4 campaigns and you do them in order. So, the duo for jake's campaign is absolutely awesome, i loved playing that campaign simply because of them, jake and sherry are amazing and their moments are so cool, for sure the best duo in this game.\r\n\r\nHowever, it's not the best campaign overall, i'd give that spot to Ada's, it's the most fun and cool campaign for me, the weapons are different and cool, i loved playing with a crossbow, playing as ada is always cool, and the levels were fun for me, the worst campaign for me was chris's, then jake, then leon, then ada, in that order, Leon's campaign is good in all means, it's not that amazing but it's good in every moment\r\n\r\nI also love the main aspect of the game of reuniting lots of the franchise's characters in the same spot, loved seeing sherry again and the fanservices between chris and leon, that's prob the biggest selling point for this game after all, loved playing with different characters\r\n\r\nNow for the flaws, and oh good there are a lot, first of all, the game is part of the modern era (re4 - re6), so it is absolutely action focused, there is literally a button in this map that shows you the path you have to go, so most moments in the game are all go ahead and walk straight, kill enemies and keep walking straight, this makes the game extremely boring after some time, that is the biggest flaw in the game for me, alongside the fact that you go back in the same areas a lot of times since the characters's campaigns present all that they did, and they do have encounters, you end up making the same thing again\r\n\r\nAlso, the story doesn't seem to connect properly, sometimes i feel like there is no actual purpose on some characters being there, they are there only because why not, it doesn't feel like there's an objective at all, they were only placed that for whatever reason, i also feel like this game has an awful amount of instant death moments, that caught me on surprise, there were not so many on others games because of manual saving, but this game has atleast one per episode, sometimes more than one, and some of them are actually random\r\n\r\nNow to finish with technical problems, the abilities system is awful, i don't like doing more damage or having higher crit because of \"ability points\" you spend, i love the upgrading weapons thing in other games, also, the herbs system is bad, and pressing esc to open options doesn't even pause the game, and you can't pause if ur match is set to online (took me 2 episodes to figure that out), i miss having to think about the items i get, and for a game where the inventory doesn't matter, having a cap on ammo, herbs and etc was pretty bad\r\n\r\nThe game is pretty good, i think one of the things that made me have as much fun as i had was because i played all of them before (and also played this one on ps3, so a bit of nostalgia, yeah i liked it a lot even though i said some flaws earlier lol) I'm the type of gamer to put having fun in a game almost all technical things, and this game is actually very good at making you have fun, yeah it's a very good game you can judge me\r\n\r\nOverall: 8/10",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "it's really fun playing this game, you have choices to choose from plus the thrill and frustrating parts are somehow giving the game a balance <3",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I get that QTEs were once in fashion, but were they ever really in style?\n\nBesides the constant button mashing, this game actually kinda slaps. Started off decent until the silliness just sorta clicked towards the end of Leon’s campaign.\n\nThere’s so much variety in terms of playable characters, weapons, locations, and enemies that, despite its overwhelming length, the game stays fun.\n\nOnline invasions are great, but optional. Difficulty scaling on repeat play-throughs is challenging, but fun. Mercenaries is pure joy. And playing any of the above on split-screen co-op brings me back to early console days.\n\nYou might be asking who are these campy characters? Why are there guns when I can slide tackle and coup de gras? When did everyone learn to pilot military aircraft? And where has this game taken me now? But its better to just let these things go and enjoy the ride.\n\nASHLEY GRAHAM. Are you in here? \n\nNo. No, she is not.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Despite the hate, I find Resident Evil 6 to be a very fun game. It may not be a good *Resident Evil* game, but it is still a good game. I find the gameplay to be very fluid and engaging, the action, while extreme at some points, also really good. The story, while lacking in some aspects, is also engaging. I do recommend this game if you want a fun experience with friends.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Resident Evil 6 was the game that pulled me into the whole series. I used to spend hours playing Survivors with my friends—shout-out to Fake Archon. The story is alright and the gameplay’s actually pretty fun, with enough variety to keep things from getting stale… mostly. The repeated sections got boring fast.\r\nAchievements were solid overall, but the multiplayer ones were annoying and honestly just kinda dumb.\r\nStill, despite the flaws, this game gave me great memories and made me want to check out the rest of the franchise.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "a more arcadey resident evil not as many puzzles and it's a fun time with friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "RE 6 is the most \"action\" of the RE series.\r\nPersonally, I think RE 6 has a good and engaging story. That's the only thing that make me want to replay this game.\r\nFor the graphic, RE 6 looks \"old\" by 2025 standards. But fortunately, the character models still look good.\r\nFor the gameplay I think RE 6 is one of the worst in the entire RE series.\r\nThe camera is incredibly annoying at times. You'll need time to get used to the camera angles and RE 6's odd targeting system.\r\n\r\nI only recommend this game for those who like the story of RE universe and are curious about its continuation.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Terrible Resident Evil game, but subpar action game. The first time you elbow drop a zombie you realize how peak this game is",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is over-hated as hell its such a fun and good game only shitty thing where the camera angles in some parts and the chase scenes are a little too fast for me personally",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Frustrated me, but I loved it. Maybe not the best Resident Evil game gameplay wise, but the story and characters make up for it imo. \nThe random cars that kept killing me in the story were not necessary!! Straight up bullying.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Buena idea para un juego de acción, malísima ejecución cuando le pusieron \"Resident Evil\" y a Leon un pelo de feminista lesbiana votante del PSOE.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like to watch my friends rage at this game,  call me sadistic or whatever. 9/10 game,  it was my 2nd ever RE game, and will always be one of my favorites.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fire game, always loved re tbh. fun to play with friends <3",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If your favorite part about the RE games are the characters, then very strongly recommended when on sale. If what you enjoy about RE is purely the survival horror gameplay, not so recommended!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Aside from some controller quibbles and bits where it's extremely unclear what I'm supposed to be doing, it's a fun game! Even 12 years after it came out the graphics are decent (and where they're more noticeably not, it tends to uphold the ambience anyway), the campaigns are each a bit different but tie together well, the music is actually quite good and while the writing isn't amazing the voice cast are certainly doing their best. \r\n\r\nSo far Leon's campaign is my favorite - the most 'survival horror' feeling one, with zombies and puzzles and dank cellars. What's your favorite and why?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "put alot of hours on ps3, switch, ps4 for this game its the redhead step child of the series and not alot of people like it but dont listen to them its still a decent game to play through. try it out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Clunky controls, horrible inventory system, and an incomprehensible story. But you can play coop with friends. 10/10 would recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the true test of a multi-campaign, with multiple protags being in separate parts is seeing how it comes all together, and while you're in each campaign you almost forget there even *are* other parts, because the part your in is well told.\r\n\r\nSometimes this is like that.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "You either love or hate RE6, this game has a lot of flaws, story is all over the place, unnecessarily complex controls, weird to navigate UI and the game does not give you many breaks between action.\nBut it doesn't mean that you won't have a fun time with the game, once you give sometime to get into the game and the controls it's surprisingly fun to play this game! I played this back in the day and it was a fun solo experience, but I highly recommend playing with friends for the most laughs.\n\nDefinitely get this game on a sale.\n\n   Helena... \n- not now! \n- Helena... \n- can't it wait?  \n- HELENA!  \n  HELENA!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Before I begin, though I am giving critiques, no I do not think RE6 is unplayable or not worth your time, I actually think it is quite fun! But here we go!\r\n\r\nRE6 is not the traditional resident evil experience, not by a long shot. It is an action game through and through, despite Capcom's best efforts to make each campaign a \"different\" experience. Leon's campaign is probably the closest we get to \"horror\". Unfortunately, they also do not do a great job at linking each campaign together into one cohesive story. This is not aided by the fact that the story as a whole has a lot going on that is not well-explained even within the self-contained campaigns. I'll go into each campaign without spoiling, just what I think of each.\r\n\r\nLeon/Helena- Like I said, this one is probably the closest to \"horror\" and is the best as a self-contained story. It doesn't largely intersect with Chris and Jake's campaigns outside of the major events where you play all together and maybe this is for the best. It has some good moments, Leon and Helena are good characters that work well together and the story is really not bad. Their gameplay sections are pretty alright as well imo. \r\n\r\nChris/Piers- This campaign, in my opinion, has the best story in terms of character arcs. I won't go into too much detail because even though this game is old, I don't want to spoil. Chris has a good and sad character arc, and Piers is a perfect character to pair him with for this purpose. I was not a huge fan of the gameplay in this campaign if only because it is the action-heaviest one, with plenty of explosions and angry yelling. However, I think the drama and character makes up for it. The way it plays into the larger narrative is fine too, though I'm not going to applaud the overarching story of this game. \r\n\r\nJake/Sherry- This is my personal favorite campaign. Jake's story is just as interesting as Chris's and again Sherry is a perfect partner to pair him with because of their chemistry and parallels. There is a stalker enemy throughout this campaign that feels like a Mr. X callback and this is pretty cool. Overall, I have similar things to say about gameplay/the overall story because that is a constant throughout all campaigns. \r\n\r\nAda- You would think her campaign would tie up the loose ends and help us understand the story the best. This is not the case. I feel like the only reason I understand anything about this game is because of files and sources outside of it. This is not how you tell any story. I don't mind Ada's campaign, there are some good puzzles and her combat is pretty fun. It's just the story that brings it down for me. \r\n\r\nUltimately, and kind of a TLDR- RE6 is not an irredeemable game. What it lacks in story and horror it makes up for in fun gameplay (including some pretty good melee and counterattacks that I have fun with, as well as a good co-op experience), and character stories. It's major weakness is unfortunately the narrative it is trying to tell regarding the C-Virus. It's character stories for Chris, Jake and his dad and their parallels between Piers and Sherry are actually very gripping in my opinion. It's just the outer-story that is weak, leaving Leon, Helena, and especially Ada (the center of this game's story) left with little to do. Overall, however, I think this game gets far too much hate and there is very much something to enjoy in it :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 6 is much more fun in co-op. The action, big set pieces, and varied campaigns are very fun. There are still messy moments and too many quick-time events, but playing together makes the experience far more enjoyable. As a co-op action game, it’s solid and entertaining.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After more than 12 years and over 100 hours of gameplay, I've gone from a fierce hater to a devoted fan. Unfortunately, this game is split into two camps: those who absolutely hate it and those who absolutely love it. It's the strangest Resident Evil game ever, but I'm finally enjoying it, albeit a bit late. I loved the mercenary mode, but it's currently difficult to find a professional player to play with. I really hope they remake it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty much a continuation of RE5, so if you liked that then you'll enjoy this. Characters are really good, gameplay is a bit off for PC and the camera won't be great in many of the chase cutscenes, but the negatives aren't too numerous. Definitely worth a playthrough for any Resident Evil fan.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"You know...I think when Chris punched a rock, I think that set a wrong precedent for Capcom.\"\n\nI don't have much to say other then Michael Bay must've directed this resident evil, but it doesn't matter. It's still definitively RE and the tragedy is still there despite the horror being gone. This was a joyride with all of my favorite characters across the series and I genuinely can't describe this experience other than plain, dumb fun. \n\nNo comprehensive review for this one because it doesn't need it and speaks for itself. If you're a fan of the horror side of RE, I'd skip this, but if you enjoy the story and all it has to offer, unweaving this mystery is a rewarding and immaculate experience.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Criminally dogged on for no reason. Awesome storylines, characters and gameplay. A phenomenal addition to the franchise.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story is soo stupid that it actually ironically becomes funny. Gameplay is fun though and good coop game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most memorable games i have ever played. Unintentionally hilarious through most of the campaigns, ada campaign is garbage cuz its the one that didnt have a second player in mind. Oh yea play with a friend or youll be miserable. \n\n4/10 solo\n8/10 with friend (purely for the comedy aspect)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story line is good\r\nGetting to see Leon again after RE 4 feels deserved after such a long time\r\nas someone who played this along with each instalment that came before and after this i can say this was the one that i can say made my childhood gaming sessions fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good story line but the game mechanics is very bad especially while the running mission where you have to escape. That thing makes the game a little less likeable honestly speaking. However all the characters are insane.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a fun game, maybe a bad Resident Evil, but the saga ended in Resident Evil 5, in resume RE6 is a good action game with a ridiculous history if think a little",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the mercenaries mode is where this game really shines, best combat in a third person shooter i've played. when played correctly the game looks like a hybrid of dmc and max payne. step on me ada",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the coolest RE game I played, well too under rated and have a lot of qualities, it is very pleasent to play.\nI recommand for people who want a bit of challenge cauz 'no hope' dificulty is very good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best movement in any game, better than black ops 6 for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Campaigns ranked: \nLeon - Best. Gives an effort to be a horror game. Atmosphere is at its best. The first two missions were the peak of the game for us. \n\nJake - Alright. Jake and Sherry's characters carry this one, set pieces are alright. But they have good chemistry so it works. The bosses were fun, and the short bus nemesis was entertaining. \n \nAda - Meh. Not Designed around Co-Op. Partner is just a generic \"Agent\" who has no dialogue or interaction with the story. Makes it feel less fun and more stupid when you see your Co-Op partner teleporting to you every time you have to open a door or grapple away. Story helps tie everything together so it should be done last to enjoy it fully. \n\nChris - Worst. All action, very little horror. Feels like a call of duty campaign with a Resident Evil skin. The dialogue is very cringey, it feels like it was written by ChatGPT after being fed the script from a 360 shovelware war game. Plot feels super contrived from start to finish. You really want to like Piers because the dude is a human golden Retriever, but it falls flat because Chris's entire character arc is solved after a 1 minute conversation with Leon. You get 0 closure on anything that happened after RE5, and its as if RE5 never happened minus 2 minutes worth of scenes involving Jake. \n\nOverall the game shines when its not in China, the whole plotline involving China is weak and its areas all feel generic and samey minus one scene in the Leon campaign. They swapped the fun and satisfying combat system of RE4+5 for a modernized version of itself.\n\nIt feels like they took the complaints about QTEs and people saying \"WHY CANT I DO THAT STUFF IN THE GAME!?\"  and added it to the gameplay. Which just made everything terrible. People will try and say \"But the movement tech bro!\" when in reality the only movement tech you will ever really need to use (On Veteran anyway) is the dark souls roll forward.  The melee system would've felt much better if you didn't have to worry about managing a stamina bar, even if it was OP. It would've been far more enjoyable. I enjoyed the simple \"Shoot knees or head, do a combo\" system, rather than having to roll around dark souls style and melee manually. \n\nAlso all the enemies that transform after you kill them are dialed up to 10 in the China sections, which is annoying. And instead of being scary and worrying like RE4 or 5, they just amount to making the enemies more tedious to defeat. \n\nOnly recommend buying it if you have a co-op partner to play it with, otherwise. Stay away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is awesome. Anybody saying otherwise is some fat nerd who needs some bihtches on dey dic. frfr. this game fuikcing rocks",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I finally played it in 2025 and had a blast. It is so nostalgic because it is so that era of gaming and took inspiration from tons of other games which made it different and I kind of liked it. It also had my friend and I dying laughing because the characters and dialogue always seems so edgy in these games,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Gotta be one of the best Resident Rvil games if you have a friend to play with.\r\nThe feeling it gives while playing through all the campaigns is something i haven't felt in games in years>\r\nPls more Singleplayer Coop games.\r\n9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are very good and run very smoothly even on a laptop that isn't intended for gaming. If you want to learn about a few of the characters in this franchise then I would recommend it, I didn't know anything about Resident Evil but I can still understand and enjoy the gameplay. \r\n\r\nLeon and Helena are also very hot. \r\n \r\nI play with a controller and the shooting function and all the other controls are very easy to understand and get used to and the camera sensitivity is just perfect oh my god. \r\n\r\nIf you want to get into resident evil I would definietly recommend this, 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game for Co-player games and good storyline.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "HELP can someone tell me like can i play this game as co op with my friend not in split screen but in two diff pc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fine action game, just not a great Resident Evil. Controls feel really smooth, but some of the gameplay segments are straight up confusing. Still had a good time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'll never understand the hate this game got. It may not be your traditional Resident Evil game but still its a really fun and amazing game and a perfect game if youre playing it with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Forever and always PURE cinema!\n\nThat's it.\n\nMy rating: 9/10\nI don't care what purists think, horror is best mixed with action, like it's you against the apocalypse and you have to show the zom bags that humans are stronger. It has always been this way since ancient times. People crave psychological horror in video games now...that's Until Dawn, those are movies, these are video games. Even if this game didn't sell well because of the action, it is still its best part. Hopefully, Capcom stays true to this for future RE games and not try to be Kojima for a zombie game loved by many for its iconic characters AND action beats.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Personally, I like Resident Evil 6 for its gameplay and action-focused style. The game is packed with dramatic moments and fast-paced combat. Each campaign Leon, Chris, Jake, and Ada, has its own unique vibe, so it never feels boring even after long hours of play. This game leans more towards action than horror, but that’s what makes it fun and cinematic, almost like watching an action movie.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is it a good game? I wouldnt say so\r\n\r\nIs it an absolute blast with a friend and some free time? Absolutely! \r\n\r\nIts a mess but its a mess that I love lol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "super comfy game and the directives are super east to follow!! dynamics of the game is super easy to understand and super smooth game play! super fun! 10/10 gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well the story is hard but really good for resident evil 2 and 4 its a well done capcon",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "everyone who is saying this is ass is stinky. tbh i LOVE the combat in this game, its tricky but still SO fun! it doesn't exactly scream resident evil, more like whispers it, but regardless, RE is RE. also leon has a nice ass.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is a good game, I like the storyline and overall it's entrataining. I think something that does make the gameplay a little bit difficult is that the aim shakes a lot and when there are a lot of zombies or a boss. But overall no comment. It's also co-operating so it makes it fun too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not that bad of a game. People complaining about it being \"just action\" are fucking dumb. Look at any of the games from the past 10 years in the series. And maybe find a friend you can play this with",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Boobs, asses and explosions. 7/7 would recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While this isn't necessarily one of my favorite games in the franchise, I've had a lot of good memories and laughter playing co-op with friends. The two campaigns that really saved it for me were Jake and Sherry and Chris and Piers. Jake's character development and his care to Sherry throughout the story was really touching for me. Jake deserved to shine more and to be more than a filler character to make the C-virus viable in the plotline.\n\nChris and Piers will always be my top favorite campaign in the game, and in my honest opinion, probably the BEST one. While there are definitely components in the story that don't make sense, or don't really 'feel' like Resident Evil, I loved seeing Chris at his worst work his way up to being the beloved captain we all know and appreciate. I adore he and Piers' dynamic and I appreciated that he actually stood up to Chris when his head wasn't in the right space. I've replayed their campaign over five times and I still cry when I see steak. If you know, you know. \n\nAlso, RE6 Mercenaries is probably the best one for me as well out of all the other games. \n\nIf you like Resident Evil for its original 'horror' aspect, you probably won't like this game as much, because it is action-packed, and ridiculously so. BUT. I would still say to play it to the end, and pick a friend to make it enjoyable.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "some campaigns are sad, some are funny or cute, i enjoyed playing all of them.\nedit: playing with the bots is pure self hatred, feels like they dont care about this all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 6 surprised the hell out of me — in the BEST way. I don’t care what the haters say… this game is GOATED if you actually play and enjoy the story.\n\nFirst, let me talk about the storylines. Bro… FOUR campaigns?? Leon, Chris, Jake (yeah Wesker’s son—tough dude), and my MOMMY, QUEEN, GODDESS Ada Wong. The fact that each campaign connects and forms one giant story is crazy. It feels like watching an entire Resident Evil universe unfold in front of you.\n\nLeon’s campaign? Beautiful mix of horror and action.\nChris’s campaign? Military action heartbreak.\nJake’s campaign? The next generation stepping into the chaos.\nAda’s campaign? Bro… peak cinema. She just walks in, saves the day, acts mysterious, disappears, and looks GORGEOUS doing it.\n\nI’ve supervised Leon and Ada’s story since RE2, followed them again in RE4 Remake, and now seeing their dynamic continue in RE6… DAMN. The chemistry is insane. Their relationship is that legendary “I save you, you save me, but we're still complicated as hell” type of story. I LOVE IT.\n\nAnd Ada in RE6?\nBruh.\nThe outfit, the attitude, the voice, the moves — CHEF’S. KISS.\nCapcom knew exactly what they were doing. Every cutscene with her? I stopped breathing. That’s MY secret campaign.\n\nGameplay?\nFire.\nSmooth movement, sick melee combos, cinematic moments, and the fact that you can play the whole thing with co-op makes it even better. Not many RE games give you FOUR full campaigns that interlock so perfectly.\n\nPeople can hate all they want, but RE6 is ambitious, crazy fun, and full of iconic moments. If you love Leon, Chris, Jake, or especially ADA WONG (my personal religion), this game is a must-play.\n\n11/10 — I didn’t survive the C-Virus, I survived ADA WONG’S BEAUTY.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This RE was pretty fun. No need to worry about weapon upgrades or anything, but the lighting on some parts were ok. It seemed too dark sometimes where I didn't know where the enemies were. Leon by far has a better storyline of course, but it's cool you can play Ada in this RE.\r\n\r\nAs Leon, ammo was abundant, but for Ada, ammo had to be pretty strategic, but it was fun in it's own way. I'd still say RE4 has one of the best gameplay still. But as for action pack, this one was pretty entertaining and have interesting bosses.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MAIN SAMA SI IMUT LOH YA, NGAJAK DIA MAIN LEH AKU KETIDURAN NUNGGUIN DIA SASIMOK DARI KAMPUS LOH YA, PAS MAIN MALAH SASI - SASIMOK GITU CIK",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this with my boyfriend and we had so much fun. I know some people criticize the change on the tone between the campaigns, but that was my favorite part. I loved the changed, and how stories are played different. Highly recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the last game where you can play local split screen",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really hype, though WAYYY too many unrelevant Quick time events.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game made me very drunk and I smashed my fuckin computer wtf dude",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "dramatic ass re fans this game is literally fine",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "controls better than RE5 and so much action i thought it was a nigerian film with a $25 budget",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like to play The Mercenaries to obtain high scores.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The residents gave me too many quick time events",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "performance on linux is great with GE Proton 10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love those zombies with 3 tits hanging on them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Black sheep of the series, but I enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Game of Time (dont play it tho unless you have a friend)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "leon is very very very delectable in this game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game to play with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OLD BUT STILL BETTER THEN MOST TRIPPLE AAA GAMES that are new.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i jus love sherry x jake cutest to ever did it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastically awful game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "шерри биркин всю серию вывезла",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "древние технологии кооператива",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and entertaining game!  I enjoyed it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "absolutely ridiculous 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game ever made it made me cry",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My favorite game of all time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game can wait for a remake",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very under rated game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like this game so much that i keep DYING LOL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "100/10 main sama kakak faza",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game get on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Avengers: Endgame",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mid game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing everything",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil: giraffe getting head",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun coop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the games of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "not too shabby",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Can be little fun with a friend but this game fucking sucks ass.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unskippable cutscenes with quick time events and if you mess up you have to rewatch the unskippable cutscenes again.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game managed to brick itself onto my pc and i couldnt close it without rebooting my pc into safe mode and deleting every file from steamapps/downloading and steamapps/common\n\ndo not play this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's so much wrong with this game. It's fun bad, as long as you have someone to coop with. Immensely frustrating parts and terrible game design choices. Bad bad bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "played leon's campaign first\r\ngot a migraine from the camera\r\n\r\nthe rest of the game felt mediocre afterwards, though jake's campaign was pretty solid (mainly because i played as sherry the whole time)\r\n\r\ngood gunplay, rest of the game is, yikes.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I played this game for the sake of playing it with my friend.\r\n\r\nI think that you are just better off getting a recap of the events of this game in a Youtube video, especially from a comedian.\r\n\r\nResident Evil 5 was corny, but it was fun. This game, is just BAD.\r\n\r\nWhat were you thinking, Capcom? What were you smoking?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was it bad? Eh, kinda. Did I enjoy it for the Leon campaign? Eh, kinda. Would I recommend it? Eh, kinda. It's the worst RE game I've played. In the end, though, it just felt mediocre. Grab it cheap and maybe you'll like it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Played since OG RE 1 all the way to 5, and liked every single one of them. But I find it very difficult to like RE6\n\nThe awkward camera angle that just keep shifting around really break the experience. It just become so frustrating trying to adjust your eye and mind to the ever-shifting angle to the point that I decided to just give up the game entirely after completing my first campaign. The endless scrolling for the inventory without sorting function is another hassle that you have to live with (and we can't just discard the weapon that we don't like to use, example the combat knife is seriously useless.... but I can't throw it away and I have to keep scrolling through it in the heat of the battle just to reach my shotgun)\n\nMaybe some day I might pick it up again to just finish it through, but man, just the thought of it make me dread facing the agonies all over again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible camera angle sequences, bugs and glitches at times that will cause failure, most weapons are hot ass, can't seem to find any items besides the stupid points when I need ammo or healing. Only saving grace is I can play it with a friend. Very strong start but very quickly turns to ass. I can honestly say the last half of the game shouldn't exist and is a tedious chore to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "By far the most vile RE experience I have ever had the displeasure of trying. To be able to justify this piece of garbage and it's existence, you either need to be a drug addict OR delusional as all hell. This disgusting piece of crap only has 1 redeemable quality --- it's creation is exactly what lead to the return of the franchise to it's roots.\n3/10 Would NOT spam melee on zombies again.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Please save your money and don’t buy it!!! If you expect something like a regular system to play RE, well you will be disappointed… the way they’ve designed the game is more like a button event system, it’s fine but honestly pretty boring in the long run.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 6\nLoses what made the series great. While later titles leaned more toward tmore shooting, this game takes that shift and cranks it up to 10—often in the wrong ways.\n\nPicked it up to finish the other campaigns with a friend, and while I don’t hate the game, several issues stand out:\n\nNo merchant, which removes a fan-favorite feature.\n\nWeak weapon variety, making progression feel less rewarding.\n\nImproved movement and gunplay, which are solid upgrades overall.\n\nCamera angles are rough, often making action feel messy.\n\nFar too many Quick-Time Events, which get frustrating fast.\n\nStory is decent, but not gripping or memorable.\n\nStealth sections feel out of place and are generally poorly implemented.\n\n\nWhat I do like:\n\nThere are multiple campaigns, \nGood voice acting.\nSome environments are pretty neat and seeing SO&SO meet on screen is a blast to see.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Dunno what kind of weed they smoke when making the plot story and game design, everything is just too much and does not make sense compared to other series, especially some part of action that took too fast and it become annoying. Camera angles sometimes causes your death, not once, not twice, but multiple times. It just sucks....\nYeah co-op is fun, but there are some events that it is almost impossible to clear, not to mention the Sherry and Jake running away from a Tank, Jake always died if you play co-op, you need your partner to disconnect first and let computer controlls Jake, after successfully running away then you can invite your partner to continue the game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Im sure the game dev and the story director are smoking weed and make this game at the same time , everything is so shit , the camera are annoying , the boss transformation is pure clowns , what was that T-rex final bos leon ? and he transform in to a fly\n\na lot of bug and story doesn't make sense  , this is the most bad Resident evil series i ever play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you don't care at all about the story, just want to chill with a friend and moving around in unconventional ways (like dodging all the time instead of walking), this is the game for you. If you're looking for something serious and great, I do not recommend it at all.\n\nI finished Leon and Helena's campaign with a friend, but for me it had been a boredom burden. We completed first time in Veteran Mode, and it wasn't that big of a challenge. At some point I got saying: \"When will this story ever ends???\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not too bad as a game, especially for when it came out (does feel dated now). The story is way to over the top but interesting enough to keep you plodding along. The gunplay was an improvement from previous titles. It has many modes and different stories to keep you interested.\r\n\r\nHowever, it doesn't feel like a resident evil game. Way too much action, the survival part of survival horror should be replaced with action. I don't like how they made this and the previous game coop. When you are playing solo pretty much every aspect is a negative reminder that this was meant for 2 people.\r\n\r\nThe game is loaded with QTEs, the in game cutscenes and set pieces are way too over the top and rediculous. Feels like I'm playing a cheesy arcade game not a resident evil.\r\n\r\nIf you really love the resident evil series it may be worth getting if cheap just to see what its about. If your wanting some goofy resident evil action with a friend then its probably quite good. Otherwise stay away. There are far better resident evil games than this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I am at a loss for words to describe just how bad this game is.\r\nI know Resident evil  and many if not all of the stories have some quirks to them.\r\nI just cant take the fact that almost everything Leon did was basically just doing what he did because he was doing it for Helena. The game feels unfair at moments.\r\nBy the way this is an action game dont be confused.\r\nI`m sorry I cant return this game, I`m sorry I just cant pull myself to finish this game, I am as soon as finish writing this, uninstalling this piece of crap and making sure I hid it from my library.\r\n\r\nPlease do yourself a favor and do not buy this game. you would and are better off watching a video of someone else playing, really you`re not missing out. \r\n\r\nIf you want actual horror and some action do yourself a favor and play the evil within Now that`s a good game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A really fun game for me and my friend to play together, for like 2 hours after that the game felt repetative, boring and drawn out.. I  remeber complaining about the car segment in re5 but they have so many scenes here where you do the same thing and its not ever really that fun to being with, its not hard either just annoying or so easy you don't even think about it, it could habe been a good game but the stoorrryyy is soooooo asssss every time me and my friend was supposed to play we got so drained after playing this game for like an hour we either went to bed or played anything else, could not even convince hb to finish the game, re5 had its problems but that was genuine a very fun experience, this was like cleaning my ass and balls with sand paper",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Simply awful, not even good as action game due to how poorly the mechanics work, hit and miss hit registration, terrible pacing, QTE filled combat and a dodge system that feels awful to use (for example, you need to aim to dodge, but good luck if you have C4 as you will simply place it down).\nThe movement is also terrible, as you do turn like a tank, and doesn't facilitate precise positioning\nDon't get conned by people claiming it is \"not a good Resident Evil game but a good action game). The game tries to be a mechanical evolution of Resident Evil 4 that solves its core issues, (reliance on shoot-stagger-execution loop) but fails in many regards and ends up ruining the good of previous games too.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "As much as i love resident evil, this one shouldnt be canon.  In every sense of the phrase it is just \"too much\". I remember playing it when it came out and not enjoying myself, and replaying it recently i can say the only fun i've had is in co-op, and even then both my partner and myself were just laughing half the time at this game's absurdity and clunky broken controls and mechanics.  Resident evil 5 gets a lot of flack for being to actiony, but honesty it is a much more fun time than 6 is.  Somehow 5 even looks better graphically, even with its pee colored yellow filter.  \n\nI'm not saying don't play this. . .If you love resident evil then you kinda have to.  BUT, grab a friend and grab a few beers or else this is gonna get rough and un-enjoyable.\n\nProbably the best way to put, \"It isnt a bad game, it's just a bad resident evil game\"",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game killed the franchise. They focused so much on action that it doesn't feel like Resident Evil anymore. I'm glad they stepped back and \"rebooted\" the franchise with RE7.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Objectively a bad game, I played it back when it originally came out and I have no recollection of it at all, played it again recently and my goodness...it's no wonder this game didn't go over well with fans or just regular folks for that matter...the controls and game flow are pretty horrendous. That being said, I'm gonna play through it again because I enjoy a campy slog  just as much as the next fella.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "- the only game I ever refunded\n- the only game I ever wrote a review on ( I feel like a karen )\n- the only game that costed a mere $5 bucks and somehow I STILL wanted my money back\n- the only game where you cannot pause\n- the only game where the UI is abysmal \n- the only game where I refunded in under 2 hours",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is not optimized. Even though my system meets all the requirementes, it constantly freezes, making it impossible to play. There is severe lag and frequent black screens.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game was fun for a bit with my friend, until literally everything we did let to another cutscene. I paid to play a game, not watch a movie.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Resident evil 6 is like if resident evil 5 was a bad arcade game. Don't buy it even for a laugh.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The controls are terrible, and the camera movement is very distracting—especially during Chris’s sequence when tracking Ada.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "9th stop in my RE Marathon\r\n\r\ndidn't even have the willpower to finish... \r\nwhat happened at capcom during the development of this??",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is old as heck and still has bugs christ dude",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is so bad that even the multiplayer is a pain in the ass.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is fucking retarded shitty resident evil game to ever come out",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "RE 3, 4, and 5 have better graphics.  This game is ... wonky.  I couldn't get past the first 5 minutes.  The scaling is off, for example there is a harrier jump jet wedged in a building.  But it looks like wood.  Then, it falls from the building and it squirts something out of three places.  Each of the plumes is the same graphic.  And it looks about the size of a car.  This product was clearly intended for a console, and frankly I hate console controls and mechanics.  \nThe voice acting was also just, boring.  Like I said, it appears to be a console game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I wouldn't recommended it to anyone who is a fan of RE. \r\nLeon's Campaign is boring from the get go with shitty levels like the graveyard and the catacombs that just look like brown diarrhea. The only good thing about his was the Simon Boss fights as those were somewhat fun.\r\nChris's Campaign was to an extent the best one for me since you actually have a team of NPCs around you for the majority of it and it made it a bit more bearable.\r\nJake's story was the one I hated the most because even though I never played the game beforehand until now, I knew that this one was the one where I would have to fight this Frankenstein reject throughout the majority of his campaign.\r\nAda Wong was my breaking point, you have to sneak in this submarine but if you get detected now there's infinite enemies spawning right at you, I'm tired and now I have to deal with this BS.\r\nDid I also mention how every single campaign has to have those stupid regenerating enemies that no matter what you do won't die? Because they all \"need\" to have them and they sour my experience even more.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You know the game is bad when the main menu doesn't say, \"RESIDENT EVIL... 6\".",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Absolutely nigger game, don't buy this shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "they really challenged themselves to make a worse game than re5",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is what Saints Row makes fun of.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "i enjoyed having my toenails be ripped off more than playing this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "when mic is on game sound is not working",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dont buy this abysmal garbage not worth it even on sale",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "really bad\r\n\r\nok google search leon in a thong",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mind numbingly terribel game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It really is as bad as they say.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Resident Evil 6, It Really Sucks the Giraffe's Cock",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "just dont play chris campaign",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Resident Evil 6? More like Resident Evil SUX!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Garbage. Well... the HUD and UI definitely is.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the camera movement almost made me MUNTAH !!!!!!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I did not care for this game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what a fucking mess it was",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "THIS IS FUCKING SHIT. DO NOT BUY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "booring version",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's Resident Evil alright.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "honestly not as bad as i thought but",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's not very good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Can`t belive i have this shit in my library",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "absolutely ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this shit is so ass",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Needs a Remake. Very dated.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "holy butt cheeks",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Motion sickness.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jetski mission with Jake and Sherry is god awful I dont know who thought that was a good idea",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "No, thanks...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "janky ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Is cheeks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wtf is this 💀",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bugs bugs bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uzas",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, that's 22 hours of my life I won't get back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Resident Evil 6 is a game that tries to do too much at once, and ends up losing the identity that defined the series. The constant shift in tone and gameplay between campaigns makes the experience feel inconsistent and unfocused, often leaning more toward loud action than tense survival horror. The pacing frequently suffers, overwhelmed by explosions, quick-time events, and set pieces that leave little room for atmosphere or suspense. That said, there are some positives. The game offers a large amount of content, with multiple campaigns and co-op support that can be enjoyable with a friend. Some character moments still land, and at times the combat can be entertaining when it slows down long enough to breathe. Visually, the game holds up decently, and the soundtrack and sound design are solid. However, these strengths aren’t enough to outweigh the feeling that Resident Evil 6 lost track of what made the franchise unique. It’s a bold experiment with scale and ambition, but one that traded identity and coherence for spectacle.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "Played this game a decade ago, decided to try and replay it.\nYep, still terrible. The glowdown from RE4/RE5 is just monstrous.\n\nUI is extremely bad. Nothing makes sense and is hard to navigate, especially in conjunction with...\n\nThe controls. Abysmally bad, easily the worst part of the game. Unoptimized, has a random key for every type of action. Nothing is dynamic and it is extremely annoying. Had to google controls for this game multiple times. \nDefault controls for basic actions are different from like every other RE game I've played, for some reason.\n\nArt direction is bland, ugly and uninspired. Characters are extremely chopped, VA work for most characters is laughably bad (Although this issue is a Capcom classic.), and the music is just so, so terrible. How we went from \"Majini IX - In Flames\" to this god awful score boggles my mind. \n\nGame crashes constantly when switching resolution options. Couldn't stream this game to my friends due to it always crashing on a map load after tabbing out. Also black screens randomly anyway so who cares I guess.\n\nCombat is also whatever. Random game states like the weird prone shooting position is annoying and clutters up gameplay flow, and the weapons do mediocre damage. Physical moves are the only saving grace, yet they don't feel satisfying to earn (You don't need a stun, just press M1.) and their damage is fine at best. Miniboss enemies are just boring bullet sponges with nothing worth writing home about.\n\nUnironically, with zero hyperbole, this is the worst game I've ever played in my life, hands down, full stop.\nCan't wait to have to clock in for another shift to beat the whole thing just to say I did.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This game is just bad. I'm playing through all the mainline games and this is just bad in all possible ways. A lot of the reviews that are positive saying its fun playing with a friend with the partner system are probably right but if you're playing the game solo its just terrible. Like others have said, its like a Michael Bay movie (I mean that as a bad thing) in a game engine with Quick Time Events.\n\nIt lacks any cool story, the partner system is somehow worse than RE5 (I thought Sheva was great) and all the new characters have no personality. The thing I hated the most is the amount of Quick Time Events. The 'combat' is heavily reliant on utilising them. If you generally hate games with them in, you wont enjoy this.\n\nI see the game goes down to about £4 during sales. If you're that bored, have someone else to play with and no backlog of other games to play its probably a bit of a fun joke to play but if you're coming from playing any of the other mainline titles, you'll very likely hate this entry.\n\nI really wanted to complete this game to tick it off my RE mainline completion list but often found myself going \"Why am I doing this to myself\".",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "\"What if we made a Resident Evil game directed by Michael Bay?\". It would suck. Controls are clunky, scoped aiming shakes like every character has Parkinson's, story is disjointed and confused, and only the Leon campaign has any hint of RE's horror game roots.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "No manual save\nCheckpoints are not a save point\nSo many QTEs \nMouse Sensitivity badly optimised and needs tweaking in the cfg.ini file\ncannot pause the game\n\nI have seen enough in 2h.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is an absolute wreck, like it's hilariously bad. I can now see why this one almost killed the franchise lmao.\n\nPlayed through it in coop and although it was still a fun time, the game itself is simply not good (like we had fun ofc, but that's because any game is always more fun in coop since we suffer it together and get some laughs out of it at least).\n\nBut pretty much the entire gameplay is a watered down version of RE5 since the majority of mechanics feel worse and the game is constantly struggling with what it wants to be.\n\nIt's funny seeing the game wanting to take a shot at inventory management while at the same time is bombarding you with plenty of weapon and items, like what's the point.\n\nAnd the story oh boy, it's even more of a mess. Leon's story is decent but nothing crazy (genuinely not much to say since they're mostly contained), while the other 3 are hilarious since they manage to throw down plenty of plot points and details that are either never explained properly or straight up forgotten. And it gets even worse when they interact between each other.\n\nLike Chris story is already bad due to how much they botched his character, specially when interacting with Piers or Jake. I heard Jake's story was the \"good\" one but when you see his side of those interactions it gets even worse, like none of them are justificable or reasonable in any way lmao. Absolute hilarious.\n\nAnd Ada well... At least they sorta explain some of her attitude during the game but her character is also very questionable in this one. At least I appreciate a lot that they added the fake coop to it (fly high Agent 503...)\n\nPC port itself is okay. For some reason the Prelude crashed for both of us on the exact same area only during the very first run but other than that there wasn't any crashes or technical issues, coop experience was smoothly. If anything the worst part of it is the lack of Borderless Fullscreen and how terrible the key mapping is.\n\nUnfortunately we couldn't get a single 4-player coop story moment to work since we never got any randoms to join, but we got a single Agent Hunt moment during Jake's story which was pretty neat, it's an interesting mechanic for sure.\n\nCoop is the only saving grace of this game so I would only recommend it if you're willing to play it with a friend for shits and giggles since it can still be a funny experience for a couple bucks. But for a solo player... Not really.\n\nAll this to say... \"Are you mental?\". Maybe I should recommend this game just by that line delivery alone... God bless Troy Baker.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Genuinely just not fun, even with a friend. Controls are awful, story is almost non-existent, but at least it can say it's \"dramatic horror\"",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Unskippable cutscenes with quick time events and if you mess up you have to rewatch the unskippable cutscenes again.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game has no redeeming qualities. An absolute low for the franchise. Featuring the absolute worst control scheme ever conceived.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Out of all the games that have been made through history for some reason this is one of them.\nDon't play this alone, play with with a friend maybe drunk.\n\nPS. I dare you to explain the plot of this game to someone who doesn't know RE with a straight face.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Resident Evil 6 is without a doubt the most uninspired game i've ever played. There isn't a single aspect of this game that is unique or interesting in the slightest. I finshed Leon's campaign yesterday and I almost can't remember anything about the plot. I can't think of many other games with as many cutscenes as this one, and almost none of them justify their exsistence. It is also impressive how they managed to transform Leon, who has so much soul and personality in RE4, into the most generic protagonist of all time. I also refuse to believe that the Ada in this game is the real Ada, and the person who designed her character model should have been fired with immediate effect. Even if you don't care about the story, RE6 is still one of the most frustrating gameplay experiences i've ever had. I have never felt more disoriented playing a game before due to the shitty camera and controls, horrendous lighting, unadjustable FOV and the way that cutscenes constantly interrupt gameplay to show you stuff you would have seen in gameplay anyway. This game has nothing of what makes the Resident Evil series special, and it is insane to me that this game has mostly positive reviews on steam.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "game managed to brick itself onto my pc and i couldnt close it without rebooting my pc into safe mode and deleting every file from steamapps/downloading and steamapps/common\n\ndo not play this game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don't have the strongest laptop in the world I will admit, but it fits within the minimum requirements for this game and frankly I expect my laptop to be able to run ANY xbox360/ps3 era game. Period. This game is unplayably laggy. The title screen lags, the game struggles to get to a steady framerate even at the lowest graphics settings, and the game crashes frequently. The optimization is just not here. Other than that, it's a bad game, but if you get a 100% save or use cheats it's perfectly fun with a buddy who has a supercomputer capable of running  *checks notes* a game from 2012 and 2 console generations ago",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Having played this when it first came out, and now revisiting this in the year of our lord 2025...I still don't know who this was for.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "3rd person Call of duty clone where the camera is so far up your ass you can't see fucking anything, every room is the size of a college dorm which makes for an especially fun experience when you play with an another person, and 5 other AI companions, who's sole quest is to block your line of sight. There's zero exploration, everything is a straight line and there's no fucking ammo anywhere, also the UI makes me think I'm having a stroke. Worst AAA game I ever played, I'd rather play a Roblox Ice Spice Obby then this piece of shit.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Failed to escape from a helicopter in China. The game is unplayable and degraded.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Unfortunately, this game is a mess of good ideas buried under the obnoxious amounts of crap. Only positive thing about RE6 is that it make me appreciate RE5 a little bit more.\n\nWe have presented 4 campaigns that are supposed to be somewhat like a great reunion of most of the characters, however their quality is questionable. To be fair you have to only play Leon campaign if you want to know the story, the rest just don’t add much to it except Ada, but this aberration of an adventure deserves it separate paragraph.\nThe entire “survival” part went out of the window. There is almost no equipment management, no struggling for resources as even the “horror” part of RE is gone in this game. What you can remember from OG RE4 and some parts of RE5 was replaced by almost constant action with cutscenes every 5 seconds to show you some stupid shit or lock your camera so you can’t play the game for a while. Mechanically this stopped being fun. Shooting is just bad, getting upgrades is not interesting and “more damage” is just the best out there. There is not even a real incentive to explore the map if you even have the possibility.\n\nStill, I was struggling with my thoughts about this game. Despite all the bad level design, boring story and very shallow new characters introduced to the game (except Jake, I liked him) sometimes game manages to provide fun and even be at least for a few minutes the Resident Evil I’ve played and watched. In co-op it provided at least an “ok” experience when you forget about really tedious parts of the game.\nBut, the Ada campaign came. The last one to provide even more context.\nIn all previous adventures at least you have some duo to provide any dynamics, dialogues and just fill the time between the shooting. Yes, mostly they suck, but at least they were there in the story. Ada campaign was originally designed to be a single player experience, but you can play it in co-op mode (like I did with my friend). Honestly, with wannabe a cinematic experience RE6 tries to provide I never supposed I could be even more disappointed. Second character to Ada story is just a speechless, nameless placeholder that can’t interact with anything – he can’t open doors, engage in the puzzles and just teleports when Ada swing her rope gun or even just go to the next door. He is even not present in the cutscenes. This lazy and poorly executed idea made me go from “meh, but maybe fun if you really like Resident Evil” to just straight “no”. People may have fun, but honestly for what was provided rather play RE5 and just avoid this one. Except you want a really bad experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I just didn't like this much at all. Weak story. Gunplay is average. Ada campaign is just tacked on for extra length. Overall just not a good game. Only tolerable if you play with a friend. Go play RE5 if you want a co-op Resident Evil.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Can be little fun with a friend but this game fucking sucks ass.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is just boring and easily the worst in the RE series. It's full of QTEs and poor action sequences, but offers no exploration opportunities and doesn't have a good atmosphere either. Even the co-op gameplay is significantly worse than in RE 5.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I just could not get my self through this. Its so aggressively mediocre and it bores me. I heard the game is a blast in coop, but I like RE5 and I played that solo and had fun.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "gameplay and story f*cking trash, worst RE by far, be 2nd player in Ada way is like being a dog following his master.\n\nI give 1 point for Cherry and Ada ass",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "played leon's campaign first\r\ngot a migraine from the camera\r\n\r\nthe rest of the game felt mediocre afterwards, though jake's campaign was pretty solid (mainly because i played as sherry the whole time)\r\n\r\ngood gunplay, rest of the game is, yikes.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I played this game for the sake of playing it with my friend.\r\n\r\nI think that you are just better off getting a recap of the events of this game in a Youtube video, especially from a comedian.\r\n\r\nResident Evil 5 was corny, but it was fun. This game, is just BAD.\r\n\r\nWhat were you thinking, Capcom? What were you smoking?",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "There's so much wrong with this game. It's fun bad, as long as you have someone to coop with. Immensely frustrating parts and terrible game design choices. Bad bad bad.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Was it bad? Eh, kinda. Did I enjoy it for the Leon campaign? Eh, kinda. Would I recommend it? Eh, kinda. It's the worst RE game I've played. In the end, though, it just felt mediocre. Grab it cheap and maybe you'll like it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The controls are an absolute mess. This is not even worth $5. I like all the other RE games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This is the worst of the RE franchise. Suppose to be an action horror genre, but there's no horror and there's no satisfaction from the combat. Please skip this game. Pretend it didn't ever existed. Enjoy the other entries of the franchise.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i would like to start of by saying this game starts jerky, low ammo and low possibilities in getting them. They should have made it where people have more ammo or knifes or swords to defend one self. Second this game is always stressful and very jerky. If you like to feel anxiety and stress then this game is for you. \n\nPeace",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is better than Melatonin, if you struggle with sleeping play this. It will put you to bed.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Don't buy this game thinking it will be more RE5, because that's what I did and oh boy was I wrong...\r\n\r\nThis game... I'm not sure if Capcom ever finished it, to be honest; It feels so \"raw\" and unpolished it's crazy to think that somebody play-tested this and said \"yeah, this is good\". What happened here, seriously? Does anybody know? My only guess is that they were in a real rush to push out the next mainline entry for some reason, but the end product is a good moral lesson on how good things take time.\r\n\r\nI won't bore you with how this game feels nothing like a Resident Evil game because if you've played Resident Evil 4 and 5 you should be used to this franchise's action game phase by now, and yes; It definitely does feel like some summer blockbuster shlock that Michael Bay would direct, complete with cheesy dialogue and one-liners that make you roll your eyes so hard you could count every wrinkle in your brain. I hope you're not attached to any of this universe's characters because RE6 turns them into unlikeable one-note stereotypes and misogynists.\r\n\r\nThe graphics? Let's talk about the graphics: The phrase \"this looks like a PS2 game\" is often misused in my opinion, because a lot of the big budget games on that platform looked pretty damn good. So when I say \"RE6 looks like a PS2 game\", I should clarify that it specifically looks like a *bad* PS2 game; Ugly texture seams, low poly character models, weird shader effects that make some objects appear extraordinarily shiny... You can stumble upon random 3D objects that emit light bloom as if they're christmas decorations... A ton of world objects aren't scaled properly, so be prepared to find huge chairs and toilets.\r\n\r\nSure; Graphics aren't everything, but RE6's visual presentation is a huge step back compared to 5, which still holds up pretty well in the graphics department.\r\n\r\nThe controls? Complete ass, no question. Movement direction is controlled by both the mouse and the WASD keys, so your character movement always feels imprecise and squirrelly. I'd much rather take RE5s tank controls over this, because even after 46 hours of playing I never feel 100% like I know what I'm doing. Even worse is that the game loves to start cutscenes seemingly at random, and give you control back when the camera is at a different angle that changes where your character moves; This happens *so* many times, yet you will never be prepared for it and it will cause a significant amount of your deaths.\r\n\r\nI've read some of the more recent reviews say that they enjoy the controls and how \"fast paced\" it is, but I'm not sure what these people are smoking...\r\n\r\nHow about the music? Sure, music hasn't always been on the forefront of the franchise, but it has definitely been memorable and helped build the game's iconic atmosphere and suspense. Here, it sounds like a generic royalty free orchestra soundtrack; It almost never feels appropriate and at worst will make you hunt for the mute / volume button. Same goes for the sound effects: Prepare to hear a whole library of familiar sounding stock sounds. I was half expecting to hear a Wilhelm Scream.\r\n\r\nThe story is... Bad. It's just not good. It's basically an attempt at turning Resident Evil into a story that spans the globe, but it only limits us to a handful of locations, and besides a change of scenery you'll be fighting essentially the same three or four small groups of enemies over and over again but with different \"skins\". I will say that the concept of intersecting storylines is novel and an interesting idea conceptually, but Capcom did not pull it off well here and most of the story intersections and how they relate to one another introduce plotholes more than anything else. At no point does the writing ever feel like a fully realized Resident Evil game; It teeters on bad fan-fiction.\r\n\r\nWould I recommend it? Steam reviews only allow for positive and negative reviews, so it's hard to provide a nuanced opinion sometimes, but I think it depends mostly on your tolerance of bad games and if you have somebody to play it with. If you're someone who enjoys the occasional bad media (i.e. The Room or Birdemic) and you have a friend who does too, then I think RE6 can be a blast. I know I was laughing almost every other cutscene, for sure. That being said, I don't think you'll get much enjoyment out of playing this by yourself.",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}