{
  "positive": [
    {
      "review": "The amount of late night sessions I had on this game with my mates were too many to count. Honestly one of the best pc games ever made. Just remember there is nothing wrong with building a wonder to end a session quicker when everyone else is prolonging the game. WOLOLOLOLOLOL",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "HD remake of the original. Best RTS game by far and this is the ultimate edition for it. If you want new CIVs you can get them at Voobly for this version and play with their community patches. Highly recommended game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I have been playing this game for nearly 20 years. I enjoy building my kingdom and finding ways to defeat my enemies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Timeless Fun. (WoolololololWololol) Been playing since the 90's with the good old CD ROM. Still have the Discs. I cuddle them every now and then. The Game never ages nor does its love :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its the best strategy game ever invented and still provides hours of fun and drama to this day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic strategy game, good for hours upon hours of nostalgia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say that hasn't already been said about this amazing game. \n\nSimply fun. Whether you wanna just slowly build up a nice farming economy, rebuild the great wall of China or rush your opponents with an early siege tower, this game is fun. There are so many different ways to enjoy this game too with the custom maps in multiplayer such as my fav Castle Blood Automatic (CBA). The campaigns are long and interesting, so you can have a good time peacefully learning the game with each civ in single player mode.\n\nThe game is quite complex, so heading online to multiplayer for the first time will see you get destroyed. There is alot to learn about the economy of the game and how to move units when doing battle. \n\nProbably the best game I have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was made during an area in which most major studios were actually cooking up good games.\nThe HD version makes it even better, adding steam integration and hd  graphics whilst still being close to the original.\nIn my option, this game still holds up enough for me to come back to this game for some casual matches once a year.\n\nBefore buying check out the Definitive Edition though, its newer and probably the better choice for most players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game when I was 7 years old, playing it now at 30 is bringing back so many memories.\r\n\r\nI'm able to appreciate it in a totally different way by leaning into the complexity and playing other people online.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is an old favorite that never is boring. So many permutations can be played. You can take it slow and build or fight before your ready and be destroyed. I've always enjoyed playing this with my sons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most timeless, strategically themed, and entertaining game in the series. Don't leave without playing multiplayer. Get all the add-ons if possible.\n\nMy workers are calling me...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic and easy to play !! tons of replay ability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brought me back to when I was younger and struggling to figure it out. Now I am older and still confused as to how the enemy always has a million troops while I am in the Dark Age",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Timeless, classic military game.  An old favorite that never gets old!  :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "simple, colorful, interesting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game as a small kid on my family's old grey computer and playing it now brings me back to this time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is undoubtably the best Age of Empires version",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What other game has this kind of staying power. It hasn't generated the most revenue of any game ever, but it will still be generating revenue long after I'm dead.  gouwd....gouwd.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game to play solo or with friends, so many different types of games to play, highly recommend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ive been playing this game since i was a kid and the sheer nostalgia i get whenever i boot this game up is just unreal",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "long time player..always fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game that has stood the test of time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love playing these games. Fun, Fun, Fun !!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you haven't played this game, you're uncultured :)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great classic RTS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing to play with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game, never gets old , 20+ year fan!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've only played this game for 180 hours, it's my most played game .",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute classic. WOLOLOL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "OG game. belong in the HOF",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best strategy that exists",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A classic! One of the best games out there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Tarihin en iyi oyunlarından biri",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the best AOE game ever.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game in the world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game out of all of them",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just finished my first game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simple but enjoyable the hours fly by",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Classic game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would definetly recommend this game to all ages this game is full of strategy and fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good old",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I would not recommend this game to anyone.\r\n.\r\nWOLOLO\r\n.\r\nI would recommend this game to my ancestors.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "8/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Like si estuviste en la alta edad media",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nostalgia. wololo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "EPIC GAME!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nostalgia",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "here we go again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "LOVE IT",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ok",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Top!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game was done dirty by MS. An amazing steam integrated port with workshop support retired so they can sell you the same game again with boatloads of DLC. Biggest insult to injury is seeing this in my library with DLC that never goes on sale, game renamed to \"(Retired)\", and a greyscale banner",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "Have played this game since I was a kid. Such good memories. The nostalgia of the soundtrack and the simple gameplay and strategy thinking makes it my comfort game after a long day.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "Even if it's not as fancy as the Definitive Edition, this is still a perfectly fine version of the game. But you really don't lose anything by sticking with the newer one and neither this game nor the DLCs go on sale. Kind of mean to grey out the artwork and call it retired.\n\nHonestly I'm surprised this version is still up at all. I wonder if anyone has bought it lately.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Classic game I still come back to from time to time all these years later. This is a great throwback only downside is when I do pick it up again each time I'll spend 12 hours playing a game with 8 teams on the largest map size and there goes the rest of my week lol",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "AoE2 is a foundation for real time strategy games, although it can be frustrating and difficult on anything above Easy.  It was made in an era when increasing the difficulty just meant the computer could more quickly control every task, while you still have one brain to flip tasks all over the map.\n If you are a new player, I imagine that the game will feel dated and the AI will seem basic.  In AI multiplayer, the CPU enemies can aggressively attack you early in one game, while in other games they forget about you and battle each other.  It is not easy to micro manage battles, and your units will often run to their doom and get distracted if you are not adjusting them.  The game can feel unfair even on Standard difficulty because the enemies can micro manage everything at once; they control single units to hit and run, they use monks to convert your units, and they continue to build.  There are so many blind spots on the map, but the computer enemy can have eyes everywhere.  Great players (which I am not) will master the efficiencies of resource gathering, and upgrade paths, while also using multi-ponged strategies to bleed or destroy the enemy.   I have not played new RTS games like DOTA so do not know how they compare.  I never quite enjoyed AoE3 or Rise of Nations or even Age of Mythology, so for some reason AoE2 did something better than those. In general I would only recommend getting this if you had played it before or if you play with friends, because the Computer AI is unfairly difficult.   I am only compelled to try playing this old game to see if I can overcome past demons as to why it always felt so difficult on anything other than Easy, and try Standard, Moderate, Hard, Hardest.  The game is exactly what I remember with enemies that see all, and rush you, yet you struggle to keep your units from running to your slaughter.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The greatest RTS game ever made. There, I said it. Better than C&C, and better than Starcraft.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "The amount of late night sessions I had on this game with my mates were too many to count. Honestly one of the best pc games ever made. Just remember there is nothing wrong with building a wonder to end a session quicker when everyone else is prolonging the game. WOLOLOLOLOLOL",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "age of empires 2 is basically the yearly friendship stress test. it starts as “let’s just play a quick round” and ends with someone building 48 trebuchets and refusing to speak to anyone for the rest of the night.\n\nthe strategy depth is insane — you can go full galaxy-brain with perfect build orders or just yeet knights at walls and hope for the best. every match feels intense, chaotic, and way too personal once someone wipes out your town center.\n\nit’s one of those games you can play again and again, year after year, until someone in the friend group decides to lock in and becomes a medieval sweatlord. that’s when the fun stops and the cold war begins.\n\nstill, aoe2 is a timeless classic — part strategy game, part history lesson, part therapy session. highly recommend, but prepare to question your friendships along the way.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I have been playing this game for nearly 20 years. I enjoy building my kingdom and finding ways to defeat my enemies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Quick games, great entertainment, and history lesson",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Played  it as a little kid on my cousin laptop and remember loving it. Now years later playing it as an adult and still having much fun.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Fantastic strategy game, good for hours upon hours of nostalgia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "What can I say that hasn't already been said about this amazing game. \n\nSimply fun. Whether you wanna just slowly build up a nice farming economy, rebuild the great wall of China or rush your opponents with an early siege tower, this game is fun. There are so many different ways to enjoy this game too with the custom maps in multiplayer such as my fav Castle Blood Automatic (CBA). The campaigns are long and interesting, so you can have a good time peacefully learning the game with each civ in single player mode.\n\nThe game is quite complex, so heading online to multiplayer for the first time will see you get destroyed. There is alot to learn about the economy of the game and how to move units when doing battle. \n\nProbably the best game I have ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Was made during an area in which most major studios were actually cooking up good games.\nThe HD version makes it even better, adding steam integration and hd  graphics whilst still being close to the original.\nIn my option, this game still holds up enough for me to come back to this game for some casual matches once a year.\n\nBefore buying check out the Definitive Edition though, its newer and probably the better choice for most players.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game when I was 7 years old, playing it now at 30 is bringing back so many memories.\r\n\r\nI'm able to appreciate it in a totally different way by leaning into the complexity and playing other people online.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is an old favorite that never is boring. So many permutations can be played. You can take it slow and build or fight before your ready and be destroyed. I've always enjoyed playing this with my sons.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most timeless, strategically themed, and entertaining game in the series. Don't leave without playing multiplayer. Get all the add-ons if possible.\n\nMy workers are calling me...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "classic and easy to play !! tons of replay ability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very entertaining game, but controllable, in a sense that you will feel satisfied after playing a game, no addiction.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've spent cumulatively about 2 to 3 thousand hours of game-play on this game. All of it was absolutely wonderful and some of my best memories with my father were playing this game until the wee hours of the morning while I came home and visited. I love this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best strategy games out there. Classic, yet modern. A must play for every fan of the genre and of history in general!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is classic, never gets old.  each game is unique and with the multiple ethnicities it is always a new challenge.  Been playing for years, easy to pick up and easy to connect with friends and play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is definitely the all time best especially because of strategy and patience required",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A throw back and a good one at that this og tital now retired is still fun to play despite it flaws shame they won't be updateing it anymore but it is just good for me. were definative feels a bit unblaneced yet this one felt balenced.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm big fan of this game been playing it since i was a teen 35 now and i will still hop on and play a game against the computer and block out everything but this game, This is the best rts game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply a classic. Had fun every time I reinstalled it, even many years later since the launch.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My absolute fav game since 12 i am 33 and still playing. I love this game and highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I used to play a couple games a day in my home office... thats where my Win XP machine is. I am still tweaking this HD version but I am loving it already. BIG fan of AoE since turn of the Century. If that makes me sound old, it'cuz I am LOLOL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played it off a CD-ROM without steam for years before this HD version came out. I appreciate the long term investment the developers have made into the series.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have always loved this game, I feel like it has a good balance between economics and tactics, plus a unique feel for each culture.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game but with an easy learning curve. It also has some player v player maps and add-on's.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Age of Empires is, to me, one of the quintessential RTS strategy games.  There are a little more faced paced and action oriented RTS like Starcraft and Command & Conqueror, but AOE2 is not without its moments.  Excellent empires to work with each with its own unique look and strength.  You can easily lose a few hours into a single player game.  The campaign and multiplayer is also a lot of fun.  This polished, or HD, version is a great way to experience the classic RTS for new and returning players.  Definitely recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "had to play the upscaled edition after playing a bit of definitive, little things here and there that add to the atmosphere (menus for example)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This version was good. But there is no reason to play this over the new version \"AoE 2 Definitive Edition\". Its a direct improvement and is actively being developed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Brought me back to when I was younger and struggling to figure it out. Now I am older and still confused as to how the enemy always has a million troops while I am in the Dark Age",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Old-fashioned thrill. Good for time management and organization skills development",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Are you having a bad day? Charge into the enemy town with a bunch of cavalry and murder all their villagers. You'll feel better.",
      "voted_up": true,
      "votes_helpful": 2
    }
  ],
  "negative": [
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "stop pestering me to write reviews steam you retards",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The New Version is so much better i would skip this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "stop pestering me to write reviews steam you retards",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is a 20+ yrs old game, you keep releasing again and again and still costs more than most indie games. And as it turns out this version does not work LAN only setting either way. Greed ++",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game sucks! The game has no heart nor soul! I never want to play this game again yet it has sunk its sickening claws of addiction deep into my flesh and all I can do is scream internally in my vile flesh prison. Only God can save us.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "shit crashes with even the most detailed riggs (computers) I advise looking else where for your medivel war game fix. as a long time player and one who played all the expansions dont play I dissappoint myself everytime I reinstall it which has been ALOT IN 15 YEARS",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is this version still being sold?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't work. I don't know why Steam keeps telling me to install games that are incompatible with Linux on my Linux computer.",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}