{
  "positive": [
    {
      "review": "The game is just incredible, No upgrades required, all people have the same cars so all depends on the player. It is not pay to win as well unlike other games. The game is extremely optimized and runs great even on weak hardware. For these reasons i am going to give it a 10/10.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "Ubisoft is full of shit. Yearly subscription for full features. However, game nostalgic and I still like it. Wish it wasn't presented as a service, would even prefer a battlepass or once off purchase fee. It is still good at its root and there's enough in the free game to recommend. Even if you don't like it... its free. Launching Ubisoft connect to work is annoying as hell. Unnecessary and clanky.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The creativity that comes from community made tracks, clubs, and events makes this one of the most re-playable games I've played.  In the 650+ hours I've put into this game over the last five years, I have seen incredible tracks, and achieved great times that I hold immense pride in.  This is a game that rewards the dedication to improving your game, and putting in the practice. \r\n\r\nPlay more grounded and serious tracks, or find one with boosters, loops, and jumps.  If you like racing games for the speed, this game is for you.  If you like racing games for the hunt of perfect lines and mastering technical turns, this game is for you.  If you like racing  games to pull of the cleanest drifts, this game is for you.  If you ever wanted to play a platforming game, but have your character be a car, that's weird but this game is still for you. \r\n\r\nThis game stands apart from other racing games with its predictable and deterministic physics allowing your complete mastery of the car with the results of your time being in your complete control.  Another great way that this game stands apart from other racing games is its various driving surfaces.  Some surfaces offer incredible turning radius, and nearly infinite grip, and some others have you slipping and sliding around almost like you are driving on ice! (because you are.  There are tracks made of ice.) \r\nThe track creator allows nearly infinite unique experiences that I can't get enough of.  \r\n10/10 would recomend.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "There's not much to say.  Watch some Wirtual on YouTube, if the game seems appealing to you, then it's definitely worth giving a try especially because it's free.  It's a pretty unique type of game so there's not really something to compare it to.\r\n\r\nThe free version gives you enough of a taste of the game that you can easily decide if it's interesting to you or not, and the paid version is actually very cheap, and when you buy it you unlock all current and past content, and get to keep all that content even if you don't continue your yearly subscription, so even though it's technically a subscription, you can easily look at it as a one time purchase for a large amount of content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Awesome fun racer especially with friends, Free version is OK, but the subscription (works out at around 35pence per week)... gives access to a world of fun and customisation. \r\nI wish I'd found this game sooner! \r\nSimple to play, tough to master, very much a \"just one more try...just one...last try... this one... ok this is definitely my last try...\" \r\nEvery Red time make you want more, every blue time is a dopamine hit.. even 0.001 seconds faster is ridiculously rewarding!\r\nTry the free one if nothing else.. :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was a skeptic of TM2020 at first, but they've done a good job with it. It's one of the best TMs, if not the best, but of course doesn't match the nostalgia of the older titles.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i enjoy improving and that all the little things make the biggest of differences, can be frustrating at times then you realize its a skill isssue and you just have to get better, highly reccommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a fun game. It's the best Trackmainia game, so much to do! Yay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "supper fun great if your not good and great if you are",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i dunno dude, car go fast. \nsometimes its a puzzle game (precise inputs usually required), sometimes theres a mini story rpg, if you like games with precise inputs and chasing the same 30 second track to get something as close to perfect for 5 hours per track, this is your game. (some people especially in nations forever have put 200 hours into one single 30 second track)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun racing game runs great and cars are all same stats so u dont need to unlock a good car like some other racing games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best racing game ever execpt that you have to play the campaign",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, try it for free and if you like it, buy it, best deal for the money, tons of official content and new things to experience constantly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If I see a track I like I go insane for 4 hours and play it repeatedly until my fingers go numb. I love this game. Go insane with us and reach this WR. I believe in you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There is no better feeling than finally hitting that perfect run youve been trying to get for the past few weeks of grinding",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun, even the free version. it has a gamemode where it is completely f2p, and beginner-friendly that updates weekly",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game! You can always explore new maps with different surfaces",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great time trial game with lots of variance in the tracks. High skill level!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very solid game I have a ton of hours on PlayStation but I feel like the car isn't that great in my opinion i like the old type of car instead but whatever goes, goes.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Car go fast, car fly, car go underwater.\r\nBut!\r\nYep,\r\nTree.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful simplicity. The racing game I've been looking for and didn't even realize it. Wish I had gotten into trackmania years ago, but the second best time is now.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it sucks for new players, there is no tutorial or guide and nothing by the community,",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun with good content. free version is a bit limiting but still has plenty of content and paid has more than you would need.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool fun free racing game most is buyable but 20 euros a year is worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is a game that can be challenging but overall fun to explore and try new things",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "a great racing game only downside is to really play it you need to purchase a subscription",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Time trial based racer - Easy to reset and play for a \"perfect\" time. Free options are limited but enough to enjoy casually every season.\r\n1 Year subscription access is a reasonable enough price to keep the game running and updated if you are into playing seriously.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, would be better if you have money for the subscribton. Clear recommandation",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its confusing but fun when you figure out how to play, or even how to get in a game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really fun racing game where you can do time trials or play with other people to see whos fastest so you should really get this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is very fun, its mechanics are interesting.\n\nthe only thing i dislike is the subscription, it should be a one time payment.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "drive car fast and faster than other = win or skill issue and lost :+( but luvcky me no losess choose love not hate",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best Trackmania. The skill ceiling is so damn high.  I just wish the best times did not look wonky or like exploits, but in most cases it's not an issue.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of my favourite games when i just want to relax, but also still one of my favourite if i actually wanna do something. so many things to do, absolutely great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Extremly fun game, Easy to learn, and a Wonderful community.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The top reviews are complaining that the game is actually not free to play. And that's true. What you're getting for free is more like a free trial version. The full game is available on subscription which is $20 per year.\n\nAnd I believe that the game is well worth the money! The gameplay is fun (at least if you're into arcade racing) and addictive. The controls are easy to grasp but hard to master and if you want you can literally spend hours improving your best time on a single track. The authors have done a good job to make all setups equally competitive so you can get good results with either a controller or a keyboard. There's a lot of content and new updates are being pushed regularly.\n\nOverall I recommend to try the free version and then switch to the paid version if you're feeling like it. The subscription is 10x cheaper than Netflix and IMO 10x the fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best driving in a racing game, though there's no progression outside of how good you get, so it may not be for everyone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game if you want something hard but easy to play at the same time its full of competition but you can also get good enough to become best of millions of people",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After finding it from Wirtual. It has become my favorite game, because of it's fun rules of physics. It's just a really fun racing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game with a nice comunity.\r\neasy to learn but a high skill cealing so you can impruve all the time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The default hotkeys for this game, keyboard or controller, ARE ASS. Idk who programmed it but they are a fucking dipshit of the highest regard",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun arcade tracks made by the community.  Fast respawn is good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun and is one of the most competitive games without it being rage inducing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "theyre making the freetoplay aspect smaller every campaign but if you are good you still can play all maps free in ranked mode",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trackmania is a free-to-play racing game where everyone drives the same car, on the same track, with the same physics… and you still manage to be 3 seconds slower than some guy named “xX_TurnCut_666_Xx.”\n\nIt’s not about racing *others* in real time.\nIt’s about:\n\n* Racing **ghosts**\n* Racing **the clock**\n* And mostly racing **your own bad muscle memory**\n\n---\n\n### Pros:\n\n* Tracks are 10–60 seconds long, which is perfect because that’s exactly how long your focus lasts before you slam into a checkpoint.\n* One button to reset to last checkpoint, one to fully restart, both used more than the accelerator.\n* Editor lets the community create absolute war crimes of track design:\n\n  * Ice\n  * Dirt\n  * Reactor boosts\n  * “I swear this is drivable” wall-rides\n* You will watch a world-record replay and genuinely question if you’re playing the same game.\n\n---\n\n### Cons:\n\n* Bronze medal: “Nice try :)”\n  Gold medal: “Okay, that hurt.”\n  Author medal: “We know you’re not getting this, but here’s something to cry about.”\n* Your friends list becomes a leaderboard of people you love but must destroy.\n* No matter how clean your run feels, you *will* watch the replay and see three spots where you drove like a drunk shopping cart.\n* One slightly bad turn? Restart. Miss a jump by 2 pixels? Restart. Breathed wrong at the start line? Restart.\n\n---\n\n### Peak Trackmania Moments:\n\n* Nailing a drift perfectly, feeling like a driving god, then immediately choking the final jump.\n* Saying “last run” and then doing 24 “last runs” because none of them felt spiritually correct.\n* Beating your friend’s time by 0.003 seconds and treating it like winning a world championship.\n* Spectating top players and realizing they brake in places you didn’t even know had physics.\n\n---\n\n10/10\nIt’s not really a racing game, it’s a precision platformer disguised as one car and a midlife crisis.\nWould bonk the same corner 86 times, finally get a PB by 0.01, and scream like I won the F1 title again.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very addictive ! \r\nVery polish...\r\n\r\nGrinding national ranking...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really good game. only the mamin menu is a little messed up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "definetly a good game, also originated from accient game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "made me feel like kym with all the microtransactions, definitely worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game will help you deal with the most boring classes, try it out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very low entry barrier and very high ceiling, good for all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun racing game, i enjoy the weekly shorts",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game out there for equal cars. its all on how you drive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game also go check wirtual's chanol",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it's the most peak racing game ever, also pyramids r cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game i like it but i dont like that u have to pay to play a track",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I LIKED THIS GAME BECAUSE YOU CAN TRY OTHER MAPS BUT IT IS A VERY FRUSTRATING GAME THO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "decent i got a few bugs but its ok i think its a good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a very good game. What else do you want me to say?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Honestly, such a good game for what it is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun but u hav 2 pay for premium access",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is really fun i have played this gaame before",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its Just A Good Game, Sad its still ubisoft though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is good... im hungry.....",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Trackmania is my favorite racing game i love it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good and has a active community",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game for learning/ precision!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cool no micro transactions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, racing fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Nadeo devs good ubisoft devs bad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hate its paid for online content",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good game because trak mana",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Going fast is fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Don't Buy full access if you have a Life. If you don't, welcome!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for autists like me! GOTTA GO FAST",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "car go fast make me happy",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like racing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just a really fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun ahh game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The only good Ubisoft game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best racing games ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "time flies when you're reactor up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best games I've ever played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "someone needs to take away my drivers license",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game :D",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's EXTREMELY competitive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best race game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is a very cool game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "amazing game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Of course I recommend, TM is legendary",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "i have to pay to see records on tracks? really? Dont play this shit, stick with nations forever. Such a classic move by ubisoft to put meaningless paywalls behind QoL features. I will never play a modern TM game again until this shit gets removed or changed.\n\n2/10",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "i wouldnt recommend it since it's a partial demo labeled as a full game. at least it's not anywhere near as bad as destiny 2 was, but you get like 10 or 20 i think community made not even 1st party maps then you have to pay a subscription (though they refresh after a while, a month?). just go play tmnf or buy the more polished tm2s if you want all the tracks w/o a sub. other than that it's fun just not when you can only grind the few maps you have.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game with wasted potential. Ubisoft decided that you need to pay a yearly subscription to unlock full content. Shame.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "fun game but it's owned by ea and it kinda sucks bc of that",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck subscription based game. but the free content is really fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything stuck behind a pay wall in a game that used to be free to play. I haven't paid and still want a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hope Ubisoft's decline will lead to Nadeo's independence and a new game without any bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall the game is nice, but many actions, maps, and other stuff arent available without the subscription",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is not \"free to play\". It is \"free to launch the game\". You need a subscription to actually play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't see how a new player can get into this game. Every game mode beside 1 and a half is beyond a paywall. It is to be expected knowing the publisher but I am impressed. Don't get fooled by the videos you see of this game. This gameplay is not worth it. Removed it from account and hope I won't see a video related to it again. Trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisoft game, they want your money its not really f2p everything costs dont bother to download that shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Free to play is a fucking lie. There are tens, probably hundreds of thousands of tracks available. Free to play gets you about 10. Free to play also doesn't get you record keeping or past content or basic customization outside of getting it through seasonal content. Just get Nations Forever, which is actually free.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "game doesnt launch, nadeo and ubisoft do not help.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I've played Rocket League since it released, so Trackmania was always in my peripherals. However, I finally downloaded the game today and it throws me right into the main menu like I've played for years.... I don't know where to go? There's no instructions on how to get started? I look online and the one content I see for beginners is hidden behind a paywall? Seriously, what the heck? This game is obviously curated around current/past users and is absolutely not new-user friendly. Happy Halloween, I suppose because this scared me away.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Subscription model sucks.\nAnd menu is unintuitive and confusing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oh you want to play this map you downloaded? get Club access\nOh you want to add this cool looking thing to your map? get Club access\nOh you want to play hot seat with your friends and play more than the standard 20 maps? get Club access\n...you get the point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tracks suck and 99% of the content is locked behind a paywall, don't bother with it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why do I need to subscribe to a $20 SUBSCRIPTION WITH ADS to play a game that CAME OUT 5 YEARS AGO?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not free at all. Requires subscription.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is fun but you can barelly do anything without the paid subscription",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "F2P with 5 bad maps a week... waste of time, TMNF is way better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to play ANY OTHER CAMPAIGN OTHER THAN THE BASE ONE its paywalled",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bullshit game that just crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Some tracks are hard to finish and unplayable!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Me when the game is free but you have to pay money to play:",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Requires external account. Didnt play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "spawns trees out of shit nothing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If not the subscription system...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DID NOT EVEN LET ME MAKE AN ACCOUNT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shitty UX shitty game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst racing game ever",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could not play becasue of glitch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 hours of playtime if you dont buy the yearly sub....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is not free",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "its not free",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "waste of life energy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "you have to pay for too many things",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "wont load",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'M NOT PAYING UBISOFT FOR COMUNITY MADE CONTENT!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "do not play this as",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Juan stop playing this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ads",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "✪✩✩✩✩✩✩✩✩✩ (1/10)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "a",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ".",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good but you can't actually buy the game, just a yearly subscription. Makes it hard to recommend.",
      "voted_up": false,
      "votes_helpful": 82
    },
    {
      "review": "-No Steam achievements or basic Steam elements expected of a Triple-A developer that had an infinite amount of time to prepare for the game's arrival to Steam\n\n-Game isn't actually free to play, its free to download. You're forced to purchase a recurring subscription service to access any actual content outside of a few default maps in singleplayer and the tutorial\n\n-Subscription service is the only way to access all customization elements\n\n-Only three player party sizes. Why tf? This game has SIXTY player lobbies, a three player party cap is insane\n\n-Subscription service is the only way to access, create, or even view clubs\n\n-Tutorial is garbage. You get a tiny track that exemplifies a specific mechanic within the game to practice on for each level and a personal best goal to achieve in regards to completion time. That's it. They don't teach or explain anything, not one word. Really odd decision\n\n-The tutorial, and menus, are littered with gigantic glowing adds pushing you to buy their subscription service. It feels and looks like a mobile game in that regard and reeks of desperation\n\n-Ubisoft only finally put this on Steam due to their recent financial troubles, pathetically crawling back to the hundreds of thousands of customers you've ignored, hated, treated like trash, and mocked won't go so smoothly\n\nIn conclusion, the driving in this game actually feels really good and it looks super nice visually. The amount of content available here is insane, thousands upon thousands of maps all different and unique with fantastic skin and map editor systems to top it all off and a solid club/social experience as well. However, all of these things are locked away behind an awful and manipulative paywall that's constantly shoved in your face but only after you've installed the game, having believed the false advertising and blatant lies that claim this game is free when it is no way whatsoever anything of the sort and would constantly charge you year after year just to maintain access to content you should have only needed to pay for a single time. Its absurd, disingenuous, and manipulative at best. In short? Its a damn shame Ubisoft still sucks this bad.\n\nDon't bother with this one.",
      "voted_up": false,
      "votes_helpful": 115
    },
    {
      "review": "I keep getting the itch to play and then I remember they stuck the game behind a subscription model. I HATE SUBSCRIPTIONS GIVE ME ONE TIME PURCHASES AGAIN the whole world is doing it now",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "free content: 10 out of 1 million maps\n\neven a single map would have been enough but you have been too generous. thank you, ubisoft, thank you for your utmost generosity. i am but a worthless creature and only you cast a light upon my wretched existence, oh all-merciful sovereign. master has granted joy unto this miserable soul, thank you. i am in your debt for playing this free game. i must seek penance and punish myself to repay this unpayable debt. thank you master",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "who at ubisoft thought it would be a good idea to add subscriptions the free version is just a demo and you actually need to pay for 90 percent of content",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "You can download the game for free, \nbut if you want to play, you have to pay.\nUbisoft Connect.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "i have to pay to see records on tracks? really? Dont play this shit, stick with nations forever. Such a classic move by ubisoft to put meaningless paywalls behind QoL features. I will never play a modern TM game again until this shit gets removed or changed.\n\n2/10",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "i wouldnt recommend it since it's a partial demo labeled as a full game. at least it's not anywhere near as bad as destiny 2 was, but you get like 10 or 20 i think community made not even 1st party maps then you have to pay a subscription (though they refresh after a while, a month?). just go play tmnf or buy the more polished tm2s if you want all the tracks w/o a sub. other than that it's fun just not when you can only grind the few maps you have.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Subscriptions and unavoidable ads not in the menus or main menu but all throughout the new weekly tracks forcing you to look at some scam bank for the entire time you play a map some of which use the bank logo as all of the obstacles. £20 a year for ads as if £20 quid a year after its been out for 5 years isn't already £100 more than any full priced game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Great game with wasted potential. Ubisoft decided that you need to pay a yearly subscription to unlock full content. Shame.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not gonna subscribe to a game I only play now and then, if this was just a one time buy I'd probably have gotten it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its a ubisoft game, what am I supposed to say. I'm not paying a monthly subscription to play a driving game lmao",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Everything worth playing is locked behind the paywall. It's not a free membership so much as it is a very restricted demo, with everything you click on telling you to \"upgrade to access this!\"",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Subscription based. I wanna user created content mostly. I don't see a reason to pay for it. Allow us to buy base game, and do with it what we want. For Nadeo tracks, sure, add payments...\r\n\r\nThose who say they need the money for servers... Yeah, well other MP games don't...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You can't even play the full seasonal campaign as a free player ... what a joke\nIn fact, you can't do fucking anything as a free player",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i finished with trackmania today because it got political... i dont want play a game and get constantly flashed by a company owned by Vanguard Group and Blackrock",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Free to play is a fucking lie. There are tens, probably hundreds of thousands of tracks available. Free to play gets you about 10. Free to play also doesn't get you record keeping or past content or basic customization outside of getting it through seasonal content. Just get Nations Forever, which is actually free.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Trackmania have always been fun games, this one included.\nPicked this one up recently because I was craving for some Trackmania and wanted to try it out. Had fun for a little bit, but very quickly the monetization system started to become annoying. Menus are a mess for new players, everything you click on it is locked behind the premium pass so you're constantly being reminded you need to pay. Basically you only have access to 10 season races, the weekly races, you're allowed to only join only one online server, and have access to ranked mode.\n\nRanked mode is fine for the first few ranks, but very quickly you start racing on maps that are unavailable to you to practice, so it becomes frustrating to you AND your teammates (because ranked is only 2v2) when you have to learn the maps while playing ranked.\n\nI was thinking of getting the premium pass, but I'm not invested in Trackmania enough to buy a subscription to the game. I would've bought it if it weren't a one year pass only, because I was not counting on playing it non stop for a year and don't want to have to pay again in 5 years when I'll be craving some TM again.\n\nI guess I'll just go back to Nations, it's simpler and less obnoxious game for casual players like me. Just pick and play, no subscription and locked content.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is shit, the maps make no fucking sense and aren't fun half the time, just utter AI slop shit. Teammates are absolutely horrible and the ranking system is shit. do not play or spend money on this shit game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just be up front about charging for stuff. I'd rather pay 20 euros for a game than a subscription for a season pass.\nBeing deceptive about this on the page doesn't look good on Ubisoft's end. But it is ubisoft, so no surprises. Shit company, shit practices.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fuck subscription based game. but the free content is really fun",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Everything stuck behind a pay wall in a game that used to be free to play. I haven't paid and still want a refund.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I hope Ubisoft's decline will lead to Nadeo's independence and a new game without any bs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Overall the game is nice, but many actions, maps, and other stuff arent available without the subscription",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is not \"free to play\". It is \"free to launch the game\". You need a subscription to actually play",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I can't see how a new player can get into this game. Every game mode beside 1 and a half is beyond a paywall. It is to be expected knowing the publisher but I am impressed. Don't get fooled by the videos you see of this game. This gameplay is not worth it. Removed it from account and hope I won't see a video related to it again. Trash.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ubisoft game, they want your money its not really f2p everything costs dont bother to download that shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "How low has the mighty has fallen, i wouldn't had mind and enjoyed that game if it came whit a single pricetag like every other edition of the game released since like.. i dunno.. FOREVER !? \n\nWTF.. Ubi !! You had ONE JOB and it was easy !\n\nOriginal Todo List:\n-Keep Original Biomes\n-Develop a new Driving/Physics system \n-Create New Biomes (Could had been DLCS at worst)\n-Add an Invite/party system compatible whit Steam.\n-Ease Player Curated Content search whit an easier menu Search methods for a personalized playlists.\nTHATS IT !\n\nWhat We Got:\n-Slightly changed Driving/Physics system \n-Limited everyone to become a freemium user and only be able to run basic Stadium stuff.\n-Added a Subscription model For the Original Old Biomes from the last 3 decade of trackmania.\n-Added Player PARTY CAPS !? (This Game franchise used to run up to 100 players lobbies, WHAT THE ACTUAL F*#$&)\n-No New Biomes.\n-Made the Subscription service the only way to be able access user generated content\n(FYI, originally. it was an utile p2p server browser model that already didn't needed any maintenance or costs to run...)\n\nThis the a prime example of UBI Hitting the deck real bad whit some Highway robbery for basically nothing new added..\n\nimagine if EA would had did exactly that: Rebooted a new yearly NHL/FIFA Game and just kept one basic part of the game active freely and to only way to get the normal stuff now is trough a subscription whitout any additional real benefits...\n\nThis is how f*cked this is. Abusive DLC's arn't fun... but Abusive Subscription models is even worst.\nIm not paying for this C*ap and nor im buyng ever again a single ubisoft game as long as they keep actively degrading and killing our beloved games franchises whit this crap.\nThis isn't gaming. This is a CEO corporate greed hellscape.\n\nSUMMARY:\nDon't waste your time or money whit this one, if you want a recent TrackMania experience, go play TrackMania2 from 2011, or if you really want to play it like it was meant to be played, go play TrackMania:United Forever Instead, its more respectfull to the actual Source material and offers more in terms of user generated content and freedom of play.\n\nFinal Score:\n0/10",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "horrible game, can't play i do have a ubisoft account but it still doesnt work",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tracmania nations or united is so much better !\nyes it looks nicer but thats the only good point for me.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Changing surfaces every 3 seconds like ADHD, poor track design with little flow, and unintuitive directions make this almost unplayable despite many improvements to the track editors overall flexibility and dank art style & graphics. A mixed bag, but I think I hate it. Or maybe I just hate what modern track-building has become. I'm going back to playing United Forever.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "need an account to play and my \"account\" that i'm not even signed into is suspended due to incorrect login attempts. i go to create an account so i can try this game only to find out, \"ACCOUNT SUSPENDED.\" WHAT ACCOUNT IS SUSPENDED!!!!!!! I'M NOT EVEN SIGNED IN. another modern ubisoft game in a nutshell",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I tried buying club access to the game, got double charged and didn't even get club access. I'm trying to contact support but have very little hope because it says it's not eligible for a refund. I hate Ubisoft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ads clustered into maps so that there is no way to even attempt to look away.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "fun game but it's owned by ea and it kinda sucks bc of that",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Subscription model sucks.\nAnd menu is unintuitive and confusing",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oh you want to play this map you downloaded? get Club access\nOh you want to add this cool looking thing to your map? get Club access\nOh you want to play hot seat with your friends and play more than the standard 20 maps? get Club access\n...you get the point",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tracks suck and 99% of the content is locked behind a paywall, don't bother with it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why do I need to subscribe to a $20 SUBSCRIPTION WITH ADS to play a game that CAME OUT 5 YEARS AGO?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Not free at all. Requires subscription.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game is fun but you can barelly do anything without the paid subscription",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "F2P with 5 bad maps a week... waste of time, TMNF is way better.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to play ANY OTHER CAMPAIGN OTHER THAN THE BASE ONE its paywalled",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "bullshit game that just crashes",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the classic '''''''''free''''''''' game, where 90% of content is behind a paywall",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Me when the game is free but you have to pay money to play:",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Requires external account. Didnt play",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "spawns trees out of shit nothing",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If not the subscription system...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DID NOT EVEN LET ME MAKE AN ACCOUNT",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Shitty UX shitty game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Worst racing game ever",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Could not play becasue of glitch",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "2 hours of playtime if you dont buy the yearly sub....",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this game is not free",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}