{
  "positive": [
    {
      "review": "---{Graphics}---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n☐ Free Fire\n\n---{Gameplay}---\n☐ Very good\n☑ Good\n☐ It‘s just gameplay\n☐ Mehh\n☐ Watch paint dry instead\n☐ Just don't\n\n---{Audio}---\n☐ Eargasm\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ I'm now deaf\n\n---{Audience}---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ All\n\n---{PC Requirements}---\n☐ Check if you can run paint\n☐ Potato\n☑ Decent\n☐ Fast\n☐ Rich boi\n☐ Ask NASA if they have a spare computer\n\n---{Difficulty}---\n☐ Just press 'W'\n☐ Easy\n☑ Significant brain usage\n☐ Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind level\n☐ Too much grind\n☐ You‘ll need a second live for grinding\n\n---{Story}---\n☐ No Story\n☑ Some lore\n☐ Average\n☐ Good\n☐ Lovely\n☐ It‘ll replace your life\n\n---{Game Time}---\n☐ Really short ( 0 - 2 hours)\n☐ Short ( 2 - 8 hours)\n☐ Few hours ( 8 - 12 hours)\n☐ Not bad duration ( 12 - 20 hours)\n☑ Long ( 20 - 50 hours)\n☐ Too long ( 50 - 100 hours)\n☐ Endless \n\n---{Price}---\n☐ It’s free!\n☐ Worth the price\n☑ If it's on sale\n☐ If u have some spare money left\n☐ Not recommended\n☐ You could also just burn your money\n\n---{Bugs}---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ The game itself is a big terrarium for bugs\n\n---{75/100}---",
      "voted_up": true,
      "votes_helpful": 63
    },
    {
      "review": "HELL YEAH\n- Made for solo players\n- Super high replayability (can replay almost any mission)\n- Various playstyles (stealth, guns blazing. john wick)\n- Fully customizable gameplay experience to feel more real\n- Cool and satisfying CQC takedowns\n- A certain someone who wants to tell ya sum'in\n\nOH NOOO\n- Poor character customization (particularly the character appearance)\n- World does not feel that alive\n- Requires constant wifi connection even when played solo\n\nVERDICT\n- 8/10",
      "voted_up": true,
      "votes_helpful": 54
    },
    {
      "review": "Ghost Recon Breakpoint is one of those games that can be fun when you are in the right mood for it, but it is definitely not perfect. It is a tactical open world shooter set on Auroa, a huge island filled with drones, enemy bases, mountains, forests, and little towns. The map is big and looks good, and there is a lot of space to explore, but the gameplay can feel uneven depending on what you like.\n\nThe story centers around Nomad surviving a helicopter crash and trying to stop a group of former Ghosts who went rogue. The setup is interesting, and the world itself has a nice mix of natural areas and tech heavy zones, but the missions can feel repetitive after a while. You end up clearing a lot of enemy camps, gathering intel, and doing similar objectives across the map.\n\nThe shooting and stealth mechanics work well once you get used to them. Breakpoint is at its best when you slow down, plan your approach, and take out enemies quietly. Playing solo with AI teammates is better now than it was at launch, but the game still feels like it was designed with co-op in mind. It is more enjoyable with a friend.\n\nThe gear system is one of the things people either love or ignore. You collect weapons and armor with different scores, similar to a looter shooter. Some players enjoy upgrading everything, and some prefer the more realistic Ghost Recon style without gear levels. Thankfully, later updates added more options to tailor how you play.\n\nExploration is a big part of the game. Auroa has mountains, swamps, snowy regions, and hidden bunkers. The world design is one of the stronger parts of Breakpoint, and it is easy to lose time just traveling around and gathering supplies. The vehicles are hit or miss, but the helicopter makes life easier.\n\nBreakpoint had a rough launch, but Ubisoft patched a lot of issues, added the immersive mode, improved AI teammates, and gave players more control over difficulty and realism. The game is much better now than when it first came out.\n\nOverall, Ghost Recon Breakpoint can be enjoyable if you like tactical shooters, open worlds, and slow paced stealth gameplay. It is not as polished as some other titles, but it has a huge map, solid gunplay, and plenty to do if you enjoy exploring and clearing missions at your own pace.",
      "voted_up": true,
      "votes_helpful": 20
    },
    {
      "review": "i love the map and the gameplay even though the story could be better the only thing i have to realy complain about is that once you complete everything in it (cosmetics,upgrades,ect...) you can buy bundles (can buy even before finishing the game) that cost ghost points and for some reason i have not found a single way to get these points by playing normaly wich means you have to buy those points with real money.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Having managed to get sucked into the game for about 30 hours straight, I found that the gameplay is rather intriguing, yet mildly annoying at times, as every once in a while, the odd third person movement would put me in a rather unfortunate position. The main campaign, is fun, but only for act I, Act II is rather lacking, and 90% of Act III is locked behind a paywall. I managed to complete all of the standard $60 game in about 30 hours, and while fun, and a long term progression system is in place, i would not recommend buying the $120 version just to complete the story.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Excellent game ! still holds good in 2025 . played a lot with my friend. i wouldnt buy the next game becuase they say its FPS. This was great though",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "i've heard wildlands is better, but this one's alright. maybe a little repetitive after a while and the story isn't particularly interesting, but it's still fun overall. $17.99 for the ultimate edition is a damn good deal, now's the time to buy it if you want it. \n\nalso modding in custom patches and camouflage patters is incredibly easy, a lot of fun to be had there if you're into that",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is amazing. I needed something for my MGSV: Phantom Pain itch and this game delivers. Highly recommended to those who love an open world stealth sandbox type of game that let's play however you please.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Its not bad with friends I wouldn't really recommend it for alone play. Kinda dull. Its okay alone but yeah it gets dull fast without friends.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is incredibly fun. I think I like it better than Wildlands. The developers have fine tuned it and it made it a big experience. The map is huge and you never run out of things to do between Episode 1-3 missions and faction missions.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the best TPS on the market. It was shat on by degens, cause it's not like Wildlands... or something You can turn off your HUD and go full tacticool. The side quests are actually interesting. The cosmetics are awesome.\n\nYes, this game is far better than shit like ARC Raiders.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "One of the best games out there if you're looking for a singleplayer spec ops experience. I would recommend experiencing this game solo but co-op is fine too. Game mechanics are solid and the world is adequate enough to get immersed. 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super game, Fun and Excellent graphics. I recommend this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love all the adventure and choices for game play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game changed drastically and now is one of the best tactical shooters ive played, playing conquest is a must with the hardest settings ofc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a very cool Game my dad Plays it too. \nI'm at The First Level and its so much fun!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Well i love the gameplay where you literally have the choice to go loud or silent, and different way to approach things. Also the open map literally makes the game way better from the technique how would you go there, what is your weapon choices it really makes the output more variable and dynamic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is so much fun. Very highly recommended. I wonder why people don't like this game. Although, they should've added an option to start the game offline. That's the only disappointment for me, otherwise, its perfect.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Bought it at a nice discount, already have a Ubi account so no issues on that side.\nI'm just starting out so this review will potentially be updated in the future.\nLooks great, audio is good and satisfying, map is big enough.\nIt's fun even solo with AI teammates, but definetely better with friends imo.\nThere's lots to do and explore, world is well built.\nA very solid all-rounder, worth the time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun, makes you feel like you're Spec Ops when you solo infiltrate a large base and silently take out every single enemy. Even better with friends. Tip: Play in immersive mode, it'll save you a lot of annoyance later on.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game ,i think its the best in tactical shooter genre , in my opinion if you love splinter cell and farcry you should really try this",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST COOP GAMES,I play with my lil brother and we enjoy every seconds in it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best tactical shooter to play with a friend. Amp difficulty to max and hud to min and let there be chaos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is still incredible to this day. They added the ability to remove the \"gear score\" aspect and made this game just like wildlands in the combat sense. This game is so good when you turn off the HUD and mini map to play it with a more realistic approach, 10/10 recommend even in todays standards. (character customization is also so much fun and has so many options if you are into that sort of thing, its amazing I catch myself changing my clothes and camo every time I go into a new biome just for the pure immersion)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game other than the fact that we're playing as an imperialist agent.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really good it has great mechanics and combat is very good but the game itself seems dead i definetly recommend installing mods. For me this was great expirience, map looks beautiful, gun play is done good and there arent many glitches. Playing with a friends is best, and also solo is hella enjoyable. i dont realy like story but if u are someone who likes tactical and slow cqb this game is definetly something u should check out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i played this game for 200+ hours on console and after playing it on steam i would 100% recommend this game if you like open world tactical games",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great visual effects. There are a few bugs but other than that beautiful game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is really good and more better with mods",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The menus fucking suck, and there's way too many micro-transactions, But other than that the gameplay is fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't play when it first got released, but I heard it sucked butt. But now that the immersive mode is released, it creates a very fun and challenging game. You can change all parameters including turning AI teammates off, turn off any and all HUD elements (recommended), and much more to fit your comfort level and playstyle. The only thing I really dislike is the drones enemies, they're just a pain in the ass more than a formidable opponent. Huge world with different biomes and environments, lots of weapon choices, tacticool barbie customization, and rewarding tactical gameplay makes this a wicked game to play if you're at all into tactical shooters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best and most underrated game. do play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is the best very fun to play and has good gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Loved this video game!! it keeps me engaged in it's mega immersive story. Can't believe how it keeps my attention even though i'm super adhd... always watching my phone... with this game i can spend hours without even looking at my phone",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I always loved playing stealth game as Splinter Cell is one of my favourite among them. I fell Ghost Recon Breakpoint is one of the best modern game for people who love steath and reconnaissance. Although this game was reselesed in back 2019 but it still feels fresh to play everytime.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Years after completing the main story and all DLCs, I still play Breakpoint multiple times per week. I can't say that for many other games. I'll do one or two elite faction missions. Takes 20 - 40 minutes, minimal commitment, but it's really satisfying.\r\n\r\nNo other game I've ever owned has had that level of entertaining replayability. \r\n\r\nSo yeah the Wildlands story and atmosphere are better, but Breakpoint gameplay lends itself to infinite replay. It's a fantastic tactical game, particularly with higher difficulty, minimal HUD, no gear score, etc.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay and customization",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got the game at 5 $ , spent 2 hrs installing mods and this game is a fucking beauty now, worth getting it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great to play, amazing graphics and crossplay!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome Game. One of my favourite game series. Waiting for the next game. Can you add FPP for this game?",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is beautiful and all the missions are awesome. I am glad I bought this game. You can play this game continously but never feel bored. Coop is also fun and easy to setup with friends.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember this game being called \"broken\" when it released and it actually was a broken game, but Ubisoft did a great job covering this game and fixing its bugs and issues, like what they did to recover Assassins Creed Unity. Overall, if You've enjoyed playing Wildlands, you probably will enjoy playing this one too. It's a 7/10 for me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, good visuals, good story",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Completely great game, vanilla GRB is peak, but using mods makes it even better. I've spent hours on this game across PS4, PS5, and now PC and I couldn't ask for anything more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game a solid 8/10 if you liked Wildlands you'll probably like this although Wildlands did a few things better than Breakpoint did\r\nSo glad ubisoft made the tiered weapon system optional Ubisoft needs to stop putting RPG elements in franchises that were never RPGs to begin with like assassins creed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so far this game is good, but in 1.6 hours of playing i have found a funny bug, if you kill an enemy from super close with a head shot just as they stand up they shoot up into space never to be seen again (:",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "been a fps addict since PONG, played all the major titles, mostly Dayz (16k hrs), tried wildlands, it didnt appeal to me much. been watching breakpoint since launch,followed the improvements and caught it on sale yesterday and got the whole bundle for 20 bucks. too early for much of a review, all the setup, keybindings and such takes a while. will follow up in a few days",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i remember previous games, oh wow this game has managed to bring new and fun things to our fingertips!\r\noh cool it is a newer game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "only get it on sale, good game with friends and fun game story didnt really care about nor did i or my friend listen to it too busy taking out people and messing around but its a ubisoft game the only downside (not going to compare to other games as this is my first time playing ghost recon)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ghost Recon Breakpoint é um jogo que tenta ser muitas coisas ao mesmo tempo e acaba se perdendo em várias delas. Ele tem seus pontos positivos, como o visual incrível da ilha de Auroa, que é realmente impressionante e cheia de detalhes. A ambientação é linda, variada e convida à exploração, com florestas densas, montanhas, bases futuristas e paisagens que parecem saídas de um filme. A jogabilidade em equipe também pode ser divertida, especialmente se você tiver amigos para jogar junto. Quando o grupo trabalha em sincronia, o jogo consegue entregar momentos de ação tática bem empolgantes, dignos da franquia Ghost Recon. O sistema de sobrevivência, embora não seja perfeito, adiciona um toque interessante: ferimentos, fadiga e a necessidade de cuidar do equipamento dão uma sensação mais realista e tensa às missões.\n\nMas é impossível ignorar o que o jogo tem de errado. Breakpoint foi lançado cheio de problemas técnicos, bugs e decisões de design questionáveis. O sistema de progressão baseado em níveis e equipamentos fez o jogo parecer mais um looter shooter genérico do que um título tático da série. Isso quebrou boa parte da imersão e afastou muitos fãs antigos que esperavam algo mais autêntico. Além disso, a inteligência artificial dos inimigos e dos companheiros (no início do jogo) era incrivelmente inconsistente, às vezes te ignorando completamente ou te detectando de forma absurda. Mesmo após várias atualizações, o jogo ainda carrega uma sensação de desequilíbrio em várias partes.\n\nE o ponto mais polêmico de todos: as microtransações. No lançamento, Breakpoint praticamente implorava para o jogador gastar dinheiro real em quase tudo — armas, veículos, cosméticos e até melhorias que afetavam a jogabilidade. Isso deu a impressão de um jogo pensado mais para vender do que para entreter. Embora a Ubisoft tenha ajustado um pouco isso com o tempo, a mancha ficou. A sensação de que o jogo foi construído em torno de uma loja de microtransações e não da diversão é algo difícil de ignorar.\n\nNo fim das contas, Ghost Recon Breakpoint tem bons momentos, principalmente quando jogado com amigos e quando você se esforça para aproveitar o que ele faz de certo: a ambientação, a cooperação e a sensação de estar em uma operação militar. Mas é um jogo que exige paciência, tolerância aos defeitos e uma boa dose de boa vontade. Para quem é fã da franquia e quer ver o lado positivo, ele ainda pode oferecer horas de diversão. Para quem espera um jogo polido e coerente com o legado tático de Ghost Recon, Breakpoint infelizmente é uma grande decepção.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Despite it's age, this game still give a lot of good play time. The stories are fun to follow, the options for customization on difficulty make it ever better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid killing experience. I played the original ghost recon and this is an operators video game dream come true.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Moder le pour une véritable expérience la le jeu devient vraiment bien \nSinon le jeu de base est ok tier",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is aight\nI like it, played thru it once or twice, not as good as Wildlands\nThe map is cool, but it would've been better if it was based on a real place and wasn't some super sci-fi tech island\nThe environment feels dead, there are barely any npcs roaming unlike Wildlands. No civilian cars, only the scarce patrol car and drone roam the island, which is incredibly disappointing at least to me. \nThe graphics and customization are great, they're the reason I bought the game to begin with, I'm quite happy with them. Although half the items I find to look nicer are locked behind a paywall, classic Ubi moment\n\nI don't think it's a bad game at all, but to me it has way less replayability than Wildlands, for example, the story is also nowhere near as good, no interrogation cutscenes either\nEither way, I'd recommend it on sale, the 60 euro price tag is bullshit, do NOT fall for it. The game goes on sale a fair amount of times throughout the year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ghost Recon Breakpoint is honestly an underrated gem. It gives you the freedom to approach every mission your own way--- go full stealth like a ghost, or hit hard and loud where things go south. I love how the game pushed you to think like an orperator: scout the area, plan your entry, sycn your shots. The world feels alive --- the weather, the nature, the terrain. For me, that's what makes Breakpoint such a great tactical experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great game I fell in live with this game instantly. There’s a massive story wide range of stuff to do and so on\nThe multiplayer is not that packed but sometimes you can find some peeps there but also there are communities which are built around this game there you can find a lot of players to play Raids or ghost wars \nSometimes it does feel a bit repetitive but I don’t really mind that it’s not that much. \nLoved it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun to run in solo like a one man army but with way better with friends",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "story? not as good as Wildlands. Wildlands is a masterpiece. this is a good game. personally i loove the gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a completely different beast with mods. I have close to a hundred hours on the ps4 and decided to jump on the pc version after seeing the creativity and depth of the modding community. Boy did they not disappoint with shoring up the weaknesses left by the original developers. Download authentic warfare sound, spartan, modular helmets, weapon accessory emporium, sling positions, realistic reticles, various tweaks, moar fog, shadow company, reshades, multi-cam camo collection, etc. and the game evolves into the ultimate mil-sim, tactical shooter. I don't bother with the story mode because it sucks. I purely play the updated content Operation Motherland which makes it more of a sandbox simulator. Role play like a real special forces operator, stealthy and efficient, in a huge open world environment and you have easy entertainment for hours. I think this game truly shines when you approach situations slowly and methodically, less so when you go guns blazing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game, fun and good weapon.  but the female character is awful she seems to be a man. it s disgusting.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "i wish they would make a vitnam game like ghost recon breakpoint This game is the best fps game i have ever played i am a nam vert",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is good. On an unrelated note, I LOVE thick thighed goth baddies and big booty latinas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best Action Adventure open world game.\n\nThe game have add on dlcs which give add on missions as well as weapons and gear skins.\n\nChallenging boss fights and aggressive enemy movements at higher difficulties.\n\nYou can play Co op, single player or which AI teammates based on Rainbow six siege and Ghost Recon wild land teammates.\n\nNot sure whether you can play PVP in this game but you can join the Raid option after you have max out your weapons and gear level. \n\nIn raid you need to have either communication or fast with typing as it will be vital for collective success and outcome for all of your teammates. \n\nIt is the best game I have ever had and played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is an amazing game and so complex. Worth every minute.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A tactical shooter aimed at players who appreciate methodical combat.\nThe game encourages strategic planning, loadout customization, and cooperative play. While launch reception was mixed, subsequent updates significantly improved systems, making it a solid experience for those who enjoy stealth-driven, squad-based gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you can ignore the mid ass story, the gunplay is actually fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Finally not trash and worth it for a few bucks on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "If you liked Wildlands, you will get a kick out of this one. Very enjoyable and beautiful world (no Bolivia though). Story is similar to other games. PVP and Co-Op are patchy. Lots of customizable weapons and outfits. Friendly community.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Looks so much better on PC than it does on any console whether it be PS4 or PS5.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played Wildlands and was already a HUGE fan (except for those 2 missions... you know which ones), and this one is same same, but different. Some things I like better from wildlands, some other from this one, don't really have a favorite, and I shouldn't either, both are great games. If you expect wacky situations where every mission is some silly different set up, go play GTA games (I love gta btw, no hate lol) I say this because the one complain I see people have is \"iS tOo RepETitiVe\", but that's the game. You're a special ops agent, doing special ops things. That's what the game is about, and it does it great. The mechanics are fantastic, the world is great, the weapons and shooting feels amazing, love the stealth aspect of it and how open it is on how you want to approach each mission. Absolutely recommend if this is the style you like.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ghost Recon Breakpoint: Tactical open-world stealth! Drones, raids, stunning Auroa. Patched perfection—10/10!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Smooth, great open-world, nice co-op, decent story. \r\nGraphics are above decent and the optimisation is also great.\r\n\r\nOverall 8.5-9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its amazing and the ghost recon wildlands is poop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it has everything that a great exploration-shootergame has. Planes? Helicopters? Even motorbikes covered. With the variety of weapons you can have  fun in your own way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Worth a play at 90% off. Do note that the developers have officially announced that there will be no further development.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great for solo players! So Far I am loving the gameplay.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just give us free player to access the comunity server pleasee",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hi,\nI bought this game with 1 year pass \nTom Clancy's Ghost Recon® Breakpoint - Deluxe Edition\nInsatllation is done but when Iam trying to launch its asking for ubisoft activation key\nI could not find the activation key checked online and tried all tricks but no use\ncan anyone help me in finding me the solution",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun and rigatoni pasta, Robert.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ARGGGGGGHHHHH,,,ADUHH LAH SEDAPPPPPPPP\r\nARGHHHHHHHHH ,,,AHHH ADUHHHH SEDAPPPPP",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good potential, waiting for updates",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, but I like Wildlands better",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the best ghost recon game I've played so far. It's AWESOME !!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun 3rd person shooter. Wait for a steam deal to buy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game my first ghost recon and i do highly recommend it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Present day version of World of Warcraft. So Fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Decent laid back if you want it to be. smooth playing game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "worth my money never felt bored of this masterpiece..always dreamt of a game like this from childhood ...game is awesome for me , whats more awesome is that you can play this with your homies",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play immersive with minimal HUD, GOATed gameplay",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GOOD GAME STORY IS VERY SIMPLE BUT YEAH KINDA FUN TO PLAY 6/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "better mechanics, but emptier world!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It was fun for about 36 hours until I got bored of the cycle.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is very fun, but so buggy.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game and graphics:3",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "surprisingly addictive gameplay loop",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game the stealth is amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is fun, only get it on sale though not worth the 60$ price tag. At a certain point in the game it seems like a dead end",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredible game. but i hate these never ending repeating quests.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game out great gun and misson",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "GREAT GAME, LOTS OF STUFF TO DO AND A LOT OF GRINDING",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Solid game after dev's fixed a lot of annoying things. \r\nThumbs down because Ubisoft executives are maggots, Uplay is required to play on steam.",
      "voted_up": false,
      "votes_helpful": 245
    },
    {
      "review": "I won't recommend this game, even if I toiled for almost 100+ hours in this game. I finished the first Act, and never had the energy to finish the 2nd and 3rd. \n\nMap's too huge and devoid of anything interesting, and don't get me started with gear score and the need to co-op with other people just to get to the max gear score. if you don't want this feature, then gear score off, just like the experience from Wildlands.\n\nThe gameplay is better than Wildlands but the story is Wildlands is lightyears better than Breakpoint.\nThe AI teammates were just an afterthought to Ubisoft and they only added it as a feature after a backlash.\nBugs are still present and you need constant attention to your surroundings if you don't wanna get stuck. \n\nDon't buy this game if you're in an area with intermittent internet connection, you need persistent online connection just to play a single player game. That's nuts!\n\nIf you want to burn your money on some game that will go offline if they stopped running their servers and you want a Ghost Recon game, this game is yours.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "One of the worst stories In all of ghost recon games. Gameplay is good though. Almost unplayable when on vanilla.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "[h3] Ubisoft Devs Makes Fun Games [/h3] \n  Ubisoft has this knack of developing good games with solid core gameplay mechanics, while making extremely poor executive decisions at the same time. When you purchase Breakpoint and hop in to play single player, you're signing up for the opportunity to tackle an entire nations worth of main and side missions as loudly or as quietly as you'd like. You'll literally never be at a loss for things to do since there's always a new weapon or gadget to collect, a hidden cache to unearth, or a roaming patrol to practice your CQC on for unlocks & steam achievements.\n\n  The story is engaging enough; we control a Ghost who leads a team of Ghosts against our ex-best-friend Ghost who's basically a Nazi now. In the free story arc, we work towards dismantling the military junta that took over the island. Engaging in the other two stories (guerilla faction warfare, stop the chemical terrorist plot) requires paying anywhere between 25$-7.99$ depending on Steam Sale status. I got nearly 50-60 hours just on the first story arc alone. First on PS4, then again in coop mode on PC.\n\n  From a gamer who appreciates stealth action gameplay, I was elated to find that the stealth mechanics for this game are cromulent. Battlefield 6 gives you the option to bellycrawl up to an enemy for a surprise knife kill, but outside of claymore placement there isn't much you can do to play around a subterfuge mechanic. Metal Gear Solid V gives you an entire arsenal dedicated to eliminating enemy threats with everything EXCEPT a bullet fired from a gun. Here, Breakpoint strikes a healthy balance between the two wherein we have a couple throwable items to distract foot soldiers, some cool gadgets to kill troops in unique and thoughtful ways, multiple different skill/class trees, upgradeable and customizable weapons for all range styles, and an impressive NPC team who can take aim at specific targets and only fire when we're ready to coordinate as much as a septuple kill all without being spotted. I've gone from 800km sniping to up blitzkrieg shotgunner in the course of 20 minutes before and it's nice to know the option is there should I want a breath of fresh air in gameplay style.\n\nSolo or with one-to-three of your friends, this is a great game to drop 60+ hours on. \n\n[h3] Ubisoft Execs Ruin Fun Games [/h3]\n  Unfortunately, Ubisoft isn't deserving of your money. The dev team who created this experience should be lauded for their efforts. The executives that continue to ignore prevailing popular sentiment on things like DRM & Always-On requirements, exploitative monetization practices, crunch time, and more deserve to be fired from a cannon into the sun, along with every single private equity entity that has ever or will ever come to exist. The Stock Market is actively ruining the videogames you like, often on purpose. As consumers, whether we have purchased this game or not, we owe it to ourselves to make our voices heard in the hopes that someone in the rank-&-file hears us and tries to make a change or the better.\n\n[h3] Buy It On Sale [/h3]\n  You can get the whole kit 'n kaboodle on sale twice a year for a total of maybe 20 bucks... that's Deluxe Edition plus the Year 1 pass. That will get you the extra classes that they locked behind a paywall, as well as the other 2/3rds of the story that they also locked behind a paywall. Then you can enjoy the game and all it has to offer for 7 years, at which point Ubisoft will probably be on their \"nobody owns anything at all arc\" and they'll find a way to claw back your Steam key & remove your access to the games you rented on this platform.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Require ubisoft app .. i bouht it off steam, i don't want that buggy bloatware in my pc.. it forget my accound and deleted my password like 10 times.. every time i write the password down, never worked again. If it don't run on STEAM i don't want it ..The game is a mess anyway, full of ads,  felt like a phone game from the menu to ui... Immediately asked for refund and i get it.. im done with trash games that just want to milk gamers.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is good but ubisoft security is a joke. I have 2 step activated but still they allowed someone else to log in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game is ass. Its fun to gun down bots with friends but genuinely this game embodies everything wrong with the AAA games industry in terms of aesthetic design and gameplay",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "If you get spotted the Robots that drive around know exactly where you are and throw missiles at you even if your 1km away they still know exactly where you are forcing you to move every 15 seconds, the game after an hour just freezes and i cant do anything, making me have to log out of my computer cus task manager cant even kill it nor will it let me switch tabs.\nthe game is not even in development anymore so im not sure these issues will even get fixed.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ghost recon franchise is good one bt the robots and drones are really ruining the gameplay, its way more beyond reality and pushing players to always do aggressive instead of planning and stealth, i loved wildlands its my favorite game bcz of its immersive open world and enemies are in their logical circles.\r\n\r\nBt breakpoint and division 2 they overdosed combat system with includes of robots, drones without logic gameplay mechanics, game by game weapon upgrade, class, skill systems are getting complex, its nt fr players who want fun, its a game fr who want everything need to be rush.\r\n\r\nIf in futures games from ubisoft includes of more robotics kind of enemies i swear i ll never buy any tom clance's series",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Awful story only good with mods and still its kinda boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Dog-shit. full of popups and ads. constantly taking you out of the game with useless crap PowerPoint presentations on how some garbage works, even though its completely irrelevant to the task at hand. just let people play the damn game FFS.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Airsoft weapon handing & tedious quest designs completely break the immersion. The UI and progression system are such a mess that it's almost impossible to follow the narrative. The game looks beautiful but everything else is just complete garbage.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Nice game, better than Wildlands but has a lot problems such: Terrible lagging and optimization,  same map design like same building type and other environment and etc.....  Most annoying thing is you will kicked out after playing for a while even though internet connection is stable. That problem occurs in single player campaigning and this is the worst part....",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "buggy mess with meh story good gameplay but the futuristic features ruined my expierence",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game has a terrible UI.  At any given time there are hundreds of un-hideable icons on your map.  Even when these tasks are completed, they remain.  Many are constantly flashing.  It is truly overwhelming.  Navigating the menus is equally bad.  It is a shame, because the gameplay is pretty good overall, even if quite repetitious.  Go with Wildlands or Far Cry instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I just found out the standard edition of the game and the deluxe edition of the game does not have the full story line (Act 2 and Act 3). You have to buy the Gold edition or the season pass for that. Like how shit can ubisoft get. Like the standard doesn't have the full game! So it's nothing less but a scam. Plus you always have to be online to play it. I have heard story is dog water anyway. And I don't know why they can't make the female faces in the customization look good. The game still stutters even in 144 fps. Framelimiter and lowering graphics work but why! Why do I have to do that. They learned nothing from wildlands. And the game is also like futuristic which kills the vibe for me. It's not lively like wildlands either. Graphics and gameplay mechanics are good but if you are like me coming just after playing wildlands there's very little addition and newness to the style of gameplay some maybe like it personally for me it's repetitive and borning now. What I suggest you is maybe buy the game see if you like it or not, especially explore the open world. If you don't like it refund it. As I have done.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I got the game running and played the first level. Then i runned out of space so i deleted it. When reinstalling the thing It started asking for F capchas to log in to ubithingy to log to this to that....you tried too many times now you wait till tomorrow again... no .... lets just erase this pice of thing out of the face of this pc. I just bogt Ghost Recon not a maddening game of never ending capchas.... what is this a motorcicle??? a traffic light?? F this. There is full of games to be weeks trynig to log in to ubish@T.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Stupid gay ass maderpaker so many gay ass bugs I can't even launch the game, if you are gay and depressed just buy this game if not I advise you not to buy these piece of crap, it have alot of server problem very gay like ubisoft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Absolute garbage. Can't run properly after 2 fing years. Go from 100+fps to 20fps when ever you tab out of the game, exiting cut seen, or whenever it feels like. This translates to about every 5 minutes that it does this. Was using a 2080 and never had this issue playing the wildlands. Not ever worth when it was 90% off f-off. These money grubby people don't even deserve your $6",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I ran into a complete hard freeze using the Vulkan API. It's ridiculous that a game this old (five or six years) still suffers from such a basic, underlying bug. Plus, the haptic feedback on the controller was weak. It's a pretty average game overall, so I opted for a refund, even though I only paid 90% less than the original price.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not a bad game, but not a particularly good one either. I played the predecessor for a long time and enjoyed it, even though it had its weaknesses. Breakpoint shares many of these weaknesses without really offering any added value. The map is huge but rather lifeless and uninteresting. The story and characters are boring, and you basically do the same thing from start to finish. \n\nIt's not that it's not fun to clear enemy bases or set up ambushes, but after just a few hours, you feel like you've seen everything there is to see in terms of gameplay. \nUnfortunately, there's little else that motivates you to keep playing. What's the point of collecting x different guns when I can ultimately take out every enemy with a single shot from any sniper rifle?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Ghost Recon Breakpoint isn't terrible, it's a solid open-world tactical shooter that delivers familiar sneaking, shooting, and co-op against rogue Wolves on a sprawling island, with decent visuals and gear customization. However, it barely improves on Wildlands, feeling like a sidegrade with unchanged mechanics; the Auroa map comes off empty and rushed, its biomes blending blandly without the predecessor's lived-in detail, leading to monotonous exploration. The story, involving betrayal and a Jon Bernthal villain, lacks compelling tension amid fetch quests and predictable intrigue. Fine for fans of the series, but skippable otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't try to buy this game , after you install this game ubisoft want you activation key which is not provided by Ubisoft.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible controls settings and anything to do with ubisoft are why this game flopped. Lots of fun with friends.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Edit: I played another few hours on my own and have come to the realization that if you have an IQ above room temperature and can land shots even the highest difficulty is absolutely easy outside of the drone fights. I rarely feel the need to use any of my advanced tools. The perks system is abysmal and means 95% of what you unlock, you cannot use anyway. The intel gathering very quickly went from neat to awful when I realized most of the time it was just pointing me to the location of a crate or campfire that I could easily have found on my own (and sometimes did find, picking up intel to lead me to a blueprint already in my inventory.) This game is actually kind of bad and has all the exact same flaws and bugs every ubislop sandbox title has had for the past 15 years. Actually embarassing. \n\nI bought this game for 7 dollars. It is worth 7 dollars. It isn't worth 60, and if you're coughing up 99 to 119 dollars for a ubisoft game at this point you may need to actually check yourself into a mental health hospital and consider rescinding your right to vote. It is your run of the mill ubisoft sandbox hilariously and horrendously broken even nearly 3 years post release and not likely to be fixed. At the time of writing this I was attacked in the middle of a cut scene by enemies that spawned during its duration that 100-0'd me,  I've been stuck under terrain twice, I've watched items and enemies float, and I'm not all that far in. Character customization is actually pretty decent and the formula of clearing out places for loot and intel isn't terrible.\n\nThe stealth is... alright. Even on higher end difficulties the AI tend to be dumb. The story is also alright, even if most of the dialogue is utterly atrocious (its ubisoft, what else did I expect). The constant spam of MMO busywork and hooks for other content in every single menu floods most UI's making them less useful than they are already. I chose immersive and found the gunplay to be quite good (though I did NOT need an entire cut scene explaining that, thanks Ubisoft), I can only imagine what a mess the \"intended\" experience would be. Gearscore in a Ghost Recon game, really? I hope whatever carnivalpenis came up with that idea gets caught in his zipper for the rest of his career. The game is pretty but has that weird ubisoft.... plastic-y sheen to everything. It runs ok, but it damn well should on my machine. Co-op is decent but could use some streamlining, the consumable usage interface is dogwater, and the gun customization is actually pitiful compared to other similar titles.\n\nAll in all, a perfectly fun with friends mediocre ubisoft-slop that is worth a goof 10 dollars at absolute most and I wish Ubisoft a very happy bankruptcy in the near future :)",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "had potential to be a good game but yeah they F it up\r\nits good for few hours then its just pointless grind it feels more like working 9 to 5 then a game\r\ngg devs you F it up one more time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "While i do like the style of play and the story line as it is so far, alot of the times the game will just \"freeze\" and not even opening the task manager to force close the game will work resulting in turning off your pc to get the game to stop, you could be running through the forests and all of a sudden you just stop nothing else no combat or anything just running and bam the game freezes and your whole pc is frozen until a force shutdown",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "There is definitely a nugget of an okay game in here. You can have some fun in missions, the basics of movement and gunplay are all decent enough. But even with all the fixes, it's just an unfinished, unpolished, unintuitive mess.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I love Ghost Recon Wildlands and only just barely like this one. Major QOL improvements at a cost of general fun features of the game prior, I'm unable to fling myself off a building like a bat out of hell then pull my parachute out and safely land on the ground, I will quite little defy the Earth's gravity and stand idle as I very quickly plummet to the ground and die instantly. Missions are spaced out and a bitch to get to if there's no aviation/aquatic vehicles around. Gunfights are normal I guess, not as lengthy at times but that's normal. Lots of sound and visual glitches when close to HUGE poi's with a HUGE amount of enemies/NPCs. Overall, I wouldn't recommend this game to someone who has played Ghost Recon Wildlands before, but you'd need to play Wildlands first to get an understanding of the story and bond of the game's former characters to play GR-Breakpoint. 5.6/10.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "enemies are fucking bullet sponges, its like they took wildlands and made it modern but worse in every way. Zero reason to play this slop if you already have wildlands",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "really wish there was a natural rating cause this game is amazing but dunno why but this game has seriouse issues cause every now and then when you first load the game it totally locks up and freezes and i have to force the computer to restart its the only game that does this in my library and its really annoying no clue whats causing it cause i have a really good pc the game its self though is amazing i finished the main campaign but fedup with the random freezes and locking up my pc and another issue i am running into is when i switch to different inventory screen it kicks me out the game and gives me a (Mountain error) and if your in the middle of a quest it will reset the area cause of being kicked out the game its a really annoying bug it all these issues though only happen in single player mode never had any issues in multiplayer other than getting glitched into terrain and have to teleport out  \ni have a ryzen 9 3900x 80gb ddr4  4tb ssd and a 5070ti 16gb vram\n\ni have done what the ubisoft says and found no violations in sfc scan and i loaded the game and it crashed so had to force quit the game through task manager then i tryed loading the game a second time and it totally crashed the computer and locked it up solid and i had to force restart the computer cause the whole os stopped responding and would not do anything it does this every now and then and its totally random as well no other game causes this\n\nstill having issues with the game now its refusing load past the connected to ubisoft servers and crashs and freezes solid tryed loading the game 3 times and same thing happened 3x in a row and i had to force quit the games exe via task manager and its using hardly any resources at all on crash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Only buy this game if you don't have any other games to play and if it is on sale.\nIt is fun, but:  \nThe cutscenes and dialogues are gringe. \nThe AI often acts stupid or even suicidal.\nThere are more bugs than on Klendathu. \nYou have to be online all the time. (Ubisoft..)\nStealth is really just an option to play pretty.\nMany game mechanics are simply useless and/or don't make sense.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is built around multiplayer but 99% of the time you can't see your friends but they are available in ubisoft connect. Don't buy unless you plan to play solo 100% of the time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "updates start to slow the game. you are in a slideshow. unplayable",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not worth 60 dollars. not worth 20 dollars honestly.\nhuge empty map with poor vehicle mechanics and gunplay that feels off\ncharacter customization is okay but not great\nstealth is good though\nthere is a photo mode which is cool",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is fucking astounding how many mechanics and quirks this game has that ruin the tactical gameplay of this tactical game of this tactical franchise that has always been known for its tactical and stealth/infiltration type gameplay. \r\n\r\nEvery minute I play this I want to go back to the Rainbow Six Vegas games. \r\nYou can't blind fire. What? Why? Do only Rainbow operatives know how to hold their gun around a corner without exposing their whole torso? \r\nYou can't repel down heights, L\r\nCover, a vital and core mechanic, has been AUTOMATED. And no, you can't make it manual, you will magnetise to every wall, you will be made to stand up or peek out of cover at critical moments where that is exactly what you DON'T want to do. \r\nThere are delays and input delays and input dropping, a really funny one is trying to get into a vehicle and your input gets dropped because your guy magnetised to the door for cover which drops your interact input\r\nIt took them TWO GAMES to let players MOVE CORPSES. They are both TACTICAL STEALTH centred games. And they couldn't even do that right, it takes SO long for the game to give you control of your character back as he struggles to lift the guy onto his shoulders, can't just drag people if you want to. Better hope no one walks by during the 2 minute long animation you're locked into. The stupid part is once you do get the guy on your shoulders, sprinting INSTANTLY drops him, cos it like resets the animation state, otherwise its another slow animation to drop or throw them. Crazy shit\r\nYou know how in Vegas 1 and 2 you could hold a button down and get a 4 way wheel of all the weapon options like fire rate, suppressor, scope zoom? Yeah you can only change these things while AIMING in this and the other identically badly made Wildlands. You know how silly it is to be hiding in cover and wanna change scope zoom or something and have to poke out of cover for a split second, momentarily edging a detection just to do that.\r\n\r\nI could go on and on there truly is a never ending list of small little quirks and mechanics that over the course of my playtime have piled up producing frustratingly unintuitive gameplay. Ruined stealth runs and deaths caused by stupid design choices and what I HOPE are oversights. Unbelievable this game has mostly positive reviews, how the standards of Tom Clancy games has fallen since the golden age.\r\n\r\nGo play Vegas 1 and 2",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "My Take:\nI didn’t play for long because I honestly couldn’t stomach the game it was really bad. The graphics were so poor that I could easily pull up a game from 2015 that looks way better than this. I really want to give Ubisoft a good review, but come on… their recent projects have been disappointing. It’s no surprise their stock has dropped; the company feels like it’s going downhill with the quality of their games. Even their latest release is garbage don’t waste your time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Where to begin with this?\nThe user Interface is very unintuitive, and it takes far too long to find a quest to do.\nThe gameplay is meh, it's really nothing special, and it's brought down by a few annoying design choices. The game is littered with your standard Ubisoft collect-a-thon gameplay, much of which are cosmetic items so you can play dress-up.\n\nThe contextual button controls mean you can't always do what you want to do because something else is also in the area and takes priority. For example: Picking up someone else's gun may take priority over grabbing a guy who might turn around at any moment as both use the same button, this can very easily result in death.\n\nIt's also weirdly difficult to make Nomad do what you want him to do. Crouching behind cover and want to peek? too bad, because Nomad wants to face the other way and will walk backwards to avoid turning around. Want to parachute off of this overlook? Not today Nomad, you're going to tumble down a cliff. Want to stand on this slightly smaller box so you can climb on something else? Nope, vault over it only.\n\nBut the worst crime of this game? They clearly planned out a lengthy story and designed the game for this, they then locked 2/3 of it (including main story missions) behind an additional DLC paywall. At full price, that's a $100 game.\n\n\"Episode 1 is an entire game!\"\nNo, it's not, there's virtually no resolution. There's still plenty of big-bads we haven't met, we're still stuck on the island thanks to the drone perimeter, even the pretense that sent us to the island in the first place has barely been fulfilled. The 'boss' of episode 1 (the base game) is just a tiny cog in the machine so there is absolutely zero sense of completion when you kill him. Heck, due to the janky way the objectives work, I killed him, engaged in 3 more main story missions that behaved like I hadn't, and then went back to [spoiler]blow up the sub[/spoiler] so he wasn't even a final boss.\n\nAnd no, this game does not seem to have been advertised as episodic, so comparing it to most episodic games is not a good equivalency.\n\nThe scenery is pretty nice, if you can get past the far too frequent floating rock or tree, and the all-too-frequent occurrence of getting stuck inside of a rock you pressed a button to climb on top of.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "What a buggy mess... I get stuck in terrain for no reason, stuck during conversations with NPCs, the sync shot kills people through walls or anything really, i keep getting frame drops, i get shot while in cover and i could go on... I gets its back to Wildlands for me.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "not as fun as ghost recon wildlands and missons are boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "couldn't play it because of that stupid activation key",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Breakpoint is super fun in a lot of ways which simply aren't matched by any other game, but there's literally no way to play offline, something I didn't realize until now. Not sure how I forgot who we're dealing with here, Ubisoft has always been staffed by spineless suits who take no pride in their own work and don't care if it's erased from existence, but regardless, I recommend you don't repeat my mistake.\r\n\r\nInstead of wasting your money on this planned obsolescence datamining bullshit, go buy something made by devs who actually know what they're doing and don't have crybaby meltdowns over nonexistent pirates. Unfortunately I think that description applies to every studio working on military shooters lol.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unstable FPS. Cant play a game at 4 fps. But then Ubisoft doesnt really care about its new games, why would they maintain older ones...",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "一如既往育碧风味的开放世界游戏，多人联机玩起来可以提供很好的合作体验，开了幽灵模式之后和荒野的游玩体验也差不太多，写实风格的战术潜行射击游戏毕竟市面上仅此一家。但是其反派的各个头目实在太缺乏记忆点了，感觉剧情跟AI生成的一样，各个据点也没有一点特色，和幽灵行动荒野里面的毒贩头目来比，设计得相去甚远。各个章节能够共同进行更是败笔，完全不知道自己现在在干什么，感觉处在一堆混乱的时间线里，丝毫没有推进的动力。",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "clunkiest game ive ever played, all mechanics were made by interns picked up off the sidewalk",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Would not buy again. Game has low FPS issues after entering and exiting the menu. Been happening for years with zero fix.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Aprendan a hacer juegos ubisoft de mierda, menús de mierda, bugs de mierta, compañía de mierda",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really do love this game, but it's just bugged out and crashes and my controller doesn't even work half the time, and when it does I'll be in the middle of a mission, then the whole game freezes up on me",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "F.E.A.R. POIntman is here once again in ANOTHER sequeal that shouldve just been an expansion. Pointman this time has blow up every drone that ever existed because thats where the ghosts are now. The Sam Fischerman crossover was cool but it's really weird when people talk to Pointman since he's still a silent protagonist. Can't wait to buy the next one!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "laggy buggy af ubi always with the slowest loading\r\nwildlands wayyyyyy better \r\nubi gay",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought it for 249,99 PLN played it a little, i didnt have space on my drive so i removed it and just forgot about it. Now i regret spending that money.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "uninspired and feels super dry compared to wildlands",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fuck ubisoft fuck everything dumbass fucking ubisoft where tf did you give me a CD key you dumbfuck next time learn how to do the simplest of things simple you motherfucking bitchass company hope your games never go to the front page again, you motherfuckers",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "How to F up a great game, TOTAL & UTTER BS . You can't turn, crouch, fire, reload or basically anything while your in a fight ok to walk around but once your in a fight basically all controls go out the window SO FRUSTRATING i won't play again. I'll go play the old one it's a great game they F#cked this one completly",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "constantly throws tutorials at me, character takes up like 1/4 of the screen even with extended FOV and an ultrawide\r\nwildlands is infinitely better",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Excessive realism of the least desirable mechanics does not make for an immersive experience\ni.e. Managing medical supplies, stumbling down hills that instantly drain energy, fall damage from vaulting down minor distances, etc.\n\nWorst of all are the insufferable exposition dumps, some of which are unskippable, alongside a cast of self-loathing hippies that rattle on about either autistic details of the fantasy tech they worked on or the fact that the military guys, whom they effectively armed, are evil.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Good lord, has Ghost Recon fallen from grace. Bring back Scott Mitchell.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't even know why I purchased this and played for 10h, I should ever apply for redeem before 2h\r\nIt's just, sooooooo boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is about as polished as a rusty shovel used in the gold rush.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ID REALLY LOVE TO PLAY THE GAME BUT IT KEEPS FUCKING CRASHING!!! MORE WASTE OF MY FUCKING MONEY!!! THANKS!!!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's like I'm living in a fever dream.  Millions of dollars was spent developing ...this.\n\nThere's a game in here somewhere: some kind of bland, flavorless FarCry clone, but it's at the bottom of a murky pond (the story), writhing with slimy, distracting creatures (the user interface and RPG mechanics) and there's a creepy uncle on shore touching himself while he watches you swim, whom you can't ever get away from (always online, Ubisoft Connect).\n\nI'm going to try getting my money back, but I think I've already gone over the time limit trying to figure out how to spend my first few skill points.  (you click and drag to navigate upwards in the menu: so intuitive!)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "could not even get my activation code to play it jesus christ",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "When you cant kill the main villian whithut Passes and DLC it is a shame",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Full of God Mode Cheater Players at pvp !!!!!!!!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft's garbage launcher",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this shit blows bruh \nabsolutely one of the worst games ive ever played",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah bruh, garbage ahh game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you feel like being angry then give this game a try.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Just lost 2 characters so thats cool",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Nowhere near as good as Wildlands.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Honestly it's a waste of time.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont like to play online and the map os small",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "выглядит как грязь под ногтей\nрефаунд",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "not good",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ok but nothing compared to wildlands",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "JUST DONT BUY IT .",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "it's just bad.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "go play wildlands",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "boring",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this games pants",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "what is this shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "KOSISHER",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "shit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "smh",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Solid game after dev's fixed a lot of annoying things. \r\nThumbs down because Ubisoft executives are maggots, Uplay is required to play on steam.",
      "voted_up": false,
      "votes_helpful": 245
    },
    {
      "review": "Needlessly online-only Ubisoft game\nWill end up like The Crew did - permanently shut down\nBuy only if on -90% sale\n#StopKillingGames",
      "voted_up": false,
      "votes_helpful": 400
    },
    {
      "review": "I won't recommend this game, even if I toiled for almost 100+ hours in this game. I finished the first Act, and never had the energy to finish the 2nd and 3rd. \n\nMap's too huge and devoid of anything interesting, and don't get me started with gear score and the need to co-op with other people just to get to the max gear score. if you don't want this feature, then gear score off, just like the experience from Wildlands.\n\nThe gameplay is better than Wildlands but the story is Wildlands is lightyears better than Breakpoint.\nThe AI teammates were just an afterthought to Ubisoft and they only added it as a feature after a backlash.\nBugs are still present and you need constant attention to your surroundings if you don't wanna get stuck. \n\nDon't buy this game if you're in an area with intermittent internet connection, you need persistent online connection just to play a single player game. That's nuts!\n\nIf you want to burn your money on some game that will go offline if they stopped running their servers and you want a Ghost Recon game, this game is yours.",
      "voted_up": false,
      "votes_helpful": 64
    },
    {
      "review": "I don't have the patience. I just don't. I was really expecting an experience closer to Wildlands and this isn't it. The tutorial would show you an image of one thing, and then the menu that being navigated would look totally different. I found it very confusing. Also, I HATE, with all of my heart, the idea that I am forced to be online with other players in certain areas.",
      "voted_up": false,
      "votes_helpful": 90
    },
    {
      "review": "Bought the game and it won't run without an Ubisoft account. I try to make an account and Ubisoft says one already exists with my email. I request a password change, and my email isn't recognized. I email Ubisoft and they tell me my email doesn't exist in their archive and close my inquiry. I try to sign in and it tells me my email is already being used. I try to sign in using my son's new email account, and Ubisoft says it already exists. My son sent a password change request. Guess how this goes. Yep no record of his account. UBISOFT IS A FAILURE OF A COMPANY AND NEEDS TO STOP SELLING SOFTWARE. IT IS A SCAM.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "One of the worst stories In all of ghost recon games. Gameplay is good though. Almost unplayable when on vanilla.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "Too buggy and boring, doing the same stuff over and over again",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Classic Ubisoft trash. \nRequires Ubisoft launcher which is garbage. \nThe menus are some of the worst I've seen. \nTrying to play co-op with a friend is nearly impossible. \nDefinitely do NOT recommend. \nRefunded.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "Awful game, they took the bones of Wildlands and added a bunch of crap over the top while half-assing the story experience of the game. Go play Wildlands instead for a much more cohesive and well rounded experience, this game feels like it doesn't know what it wants to be.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "[h3] Ubisoft Devs Makes Fun Games [/h3] \n  Ubisoft has this knack of developing good games with solid core gameplay mechanics, while making extremely poor executive decisions at the same time. When you purchase Breakpoint and hop in to play single player, you're signing up for the opportunity to tackle an entire nations worth of main and side missions as loudly or as quietly as you'd like. You'll literally never be at a loss for things to do since there's always a new weapon or gadget to collect, a hidden cache to unearth, or a roaming patrol to practice your CQC on for unlocks & steam achievements.\n\n  The story is engaging enough; we control a Ghost who leads a team of Ghosts against our ex-best-friend Ghost who's basically a Nazi now. In the free story arc, we work towards dismantling the military junta that took over the island. Engaging in the other two stories (guerilla faction warfare, stop the chemical terrorist plot) requires paying anywhere between 25$-7.99$ depending on Steam Sale status. I got nearly 50-60 hours just on the first story arc alone. First on PS4, then again in coop mode on PC.\n\n  From a gamer who appreciates stealth action gameplay, I was elated to find that the stealth mechanics for this game are cromulent. Battlefield 6 gives you the option to bellycrawl up to an enemy for a surprise knife kill, but outside of claymore placement there isn't much you can do to play around a subterfuge mechanic. Metal Gear Solid V gives you an entire arsenal dedicated to eliminating enemy threats with everything EXCEPT a bullet fired from a gun. Here, Breakpoint strikes a healthy balance between the two wherein we have a couple throwable items to distract foot soldiers, some cool gadgets to kill troops in unique and thoughtful ways, multiple different skill/class trees, upgradeable and customizable weapons for all range styles, and an impressive NPC team who can take aim at specific targets and only fire when we're ready to coordinate as much as a septuple kill all without being spotted. I've gone from 800km sniping to up blitzkrieg shotgunner in the course of 20 minutes before and it's nice to know the option is there should I want a breath of fresh air in gameplay style.\n\nSolo or with one-to-three of your friends, this is a great game to drop 60+ hours on. \n\n[h3] Ubisoft Execs Ruin Fun Games [/h3]\n  Unfortunately, Ubisoft isn't deserving of your money. The dev team who created this experience should be lauded for their efforts. The executives that continue to ignore prevailing popular sentiment on things like DRM & Always-On requirements, exploitative monetization practices, crunch time, and more deserve to be fired from a cannon into the sun, along with every single private equity entity that has ever or will ever come to exist. The Stock Market is actively ruining the videogames you like, often on purpose. As consumers, whether we have purchased this game or not, we owe it to ourselves to make our voices heard in the hopes that someone in the rank-&-file hears us and tries to make a change or the better.\n\n[h3] Buy It On Sale [/h3]\n  You can get the whole kit 'n kaboodle on sale twice a year for a total of maybe 20 bucks... that's Deluxe Edition plus the Year 1 pass. That will get you the extra classes that they locked behind a paywall, as well as the other 2/3rds of the story that they also locked behind a paywall. Then you can enjoy the game and all it has to offer for 7 years, at which point Ubisoft will probably be on their \"nobody owns anything at all arc\" and they'll find a way to claw back your Steam key & remove your access to the games you rented on this platform.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Despite having a modern system, this game frequently freezes so badly I have to hard-restart my computer to get out of it. This is on top of all the problems with the game itself, to include the horrific UI/UX and generic gameplay loop.\r\n\r\nI bought this on sale for $5. If I could, I'd get that $5 back.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "I made the mistake of buying this twice just to have it on Steam. I wanted to give it another chance after having it for so long on uPlay, but I regret spending the money. \n\nThe world is absolutely ANNOYING and TEDIOUS to travel through, I cannot stress that enough. All vehicles except for helicopters are essentially useless to travel with if you want to get to your destination fast and in one peace. The map is ugly, boring, and disfigured. Most main missions will have you go across medium to long distances meaning you'll have to travel through plethora of brainless enemies that will always shoot at you for the sake of it. You might think that is part of the game... it is, but it's not. The enemies scattered across the world are just stepping stones. None of them really make any real impact and are just there to pad out content to waste your time.\n\nThere's also too much collectibles/looting in the open-world, seriously... It's a big immersion killer and another time waster to artificially draw out your hours. You CAN skip them, but you can miss out on cosmetics and equipment if you do.\n\nThe only good things about this game are the gorgeous graphics and various cosmetics that you can put on your character. Other than that, this will never hold a candle next to Ghost Recond: Wildlands.\n\nOH YEAH, YOU CAN'T PLAY THIS GAME OFFLINE SO IF THEY SHUT DOWN THE SERVERS, IT'LL BE ANOTHER THE CREW SITUATION... I found that out earlier today and I'm pissed. \n\nTL;DR Avoid this game.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Ubisoft app is cancer! I wouldn't even buy a Ubi or EA game anymore just because of their disgusting launchers...",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "is not the same experience as wildlands. idk why something is missing. it feels so empty and poitnless to play",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "this game is not for everyone who thinks that if he or she played fps game , this is it , no , i kinda like GRW , but this literally too much too handle , there is no fun , too much things to press , to control your character , it's like piloting real aircraft . .",
      "voted_up": false,
      "votes_helpful": 2
    }
  ]
}