{
  "positive": [
    {
      "review": "Still holds up well for a game that's over 20 years old. If you've got a sick sense of humor and feel like revisiting a time-capsule of the early 2000s, you'll love the writing in this game!",
      "voted_up": true,
      "votes_helpful": 26
    },
    {
      "review": "Look, just sign the stupid petition. I got stuff to do.",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "I regret nothing! Addictive, grotesque, and hilarious game. Postal Dude is one of the coolest protagonists ever. The crazy achievements you can earn and the different game modes are also definitely an advantage. Apart from the base game, the DLC is also definitely worth your attention and completing it takes even much more time.\n\nPostal 2 (base game):\nI think the base game is the coolest, most classic, and offers the most opportunities in free roam to earn achievements. As a fan of Tarantino's films, I appreciate the Pulp Fiction gimp outfit reference in Wednesday.\n\nApocalypse Weekend (DLC no 1)\nThe DLC is darker and features zombies and zombie cows. As if the cat apocalypse on Friday wasn't enough... Apocalypse Weekend focuses on fewer core quests. I think it's also more challenging, but also more repetitive. Still, it's fun to play.\n\nParadise Lost (DLC no 2)\nThe second DLC is more reminiscent of the original and, despite being 12 years old, is created on the same engine. Free Roam offers more possibilities than the Apocalypse Weekend solution. Zack Ward's performance is an obvious reference to Uwe Ball's film, where Postal Dude is more of a sissy than a tough guy. However, it is worth adding that this add-on should be launched through Steam and not the desktop shortcut so that the achievements can be synchronized! The only thing was that the DLC and Apocalypse Weekend frequently crashed on my computer. I don't know if it's a Steam bug or if a patch would be helpful. I saved the game constantly, so it wasn't a major issue.",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "homeless guy beats up neighbors with a shovel while doing errands the video game",
      "voted_up": true,
      "votes_helpful": 10
    },
    {
      "review": "For a game that is 22 years old, not as bad I'll remember to be honest.  It's funny and and yet messed up but, I personally love playing it and gotta love Dude, I will leave this quote here: \"I regret nothing.\" - Postal dude.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "My favourite game EVER, I love how free I am and I love I can do whatever I want in this game. Peeing, flipping people off, using cats as silencers, do a pacifist run.\r\nAll those different difficulties make the game fit for basically everyone, and the enhanced mode brings Postal 2 in an entire another level, flying with a shovel, fast shooting the shotgun, grenades multiplying... \r\nI found the game super replayable, never gets boring.\r\n\r\nSuper recommended.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Monday\n- Put the bitch on a damn list\nTuesday\n-flip the bird to everywhere\nWednesday\n-become a victim of some BDSM stuff (youre the gimp)\nThursday\n-make innocent POSTAL service hate you cuz ur package exploded\nFriday\n-penile dysfunction",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this gamne. good. manyu postalk babes/ good game. postal babe. postal dude. postal.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you never have played this game, buy and play it now, i bet you that you will start playing this game 24/7 thats how good it is, its just the satirical humor, voiceline, how iconic it is, and how much fun you can have in this game, for example what other game can you massacre a whole family of terrorists using a corner shop as a hiding spot against the police then piss on their lifeless corpses. this is the greatest game of all time, if you do not play it you will be sent to deepest chambers of hell to suffer an eternity. this is the greatest fucking game ever. so if you are reading this review and you are thinking of purchasing this game, do it, whatever it costs it is worth the price i swear. \"WOULD YOU LIKE TO SIGN MY PETITION\" is the greatest fucking line ever 10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "unzipped my pants and all the women around me laughed\r\nthe game is so realistic 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is comically so a far off sequel in almost every way, like I actually get a choice if I wanna murder people or not (most of the time) now, but because of the games humour it's made to be the most tedious thing possible not to, so it's basically encouraging you to do so at every turn, the weird absurd stuff constantly thrown in your way is honestly something I couldn't help but laugh at most of the time, though the game did start getting repetitive towards the end in both gameplay and bits of humour (especially the weekend stuff), but like... the game has a button to piss on people if that isn't enough to make you wanna play it idk what is.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Still one of the best FPS games ever made. A high level of violence and a goal of offending basically everybody = good old fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "An incredibly well-designed open-sandbox FPS. It is probably the most unique shooter with not only its humor but also its gameplay. The only caveat I can give it is that randomly crashes from time to time with no identifiable reason.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very relaxing game, live a week as a regular dengular American Dude , go to work ,cash your paycheck, buy some milk or pay your speeding ticket, spread freedom with your second amendement right and show the world your love of pets by sticking a cat's anus down your m16 barrel.\r\ni guarantee you will not regret buying this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is really good, 10 out of 10 game, i love the violence and the dark humor in the game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is fire if you can appreciate the absurdity. So many offensive jokes and so much gore that it feels like the average south park episode. The gameplay is ahead of its time, as it turns a series of mundane tasks into a hilarious, first-person shooter experience. I reccommend this game to anyone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Definitely one of the games of all time. Wish it had less scripted sections and had an actual stealth system, but peeing on people and lighting them on fire is fun regardless. I've heard this game crashes a lot, but I must be lucky because my game only crashed like twice my entire playthrough of week 1.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Chaotic, irreverent, and unapologetically wild. A cult classic that offers a ridiculous sandbox for players who enjoy pure mayhem.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think the base game is the coolest, most classic, and offers the most opportunities in free roam to earn achievements. As a fan of Tarantino's films, I appreciate the Pulp Fiction gimp outfit reference in Wednesday. anyway, this game cool. havent played the DLC 1/2 yet",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is a masterpiece, what other game lets you kill a giant schlong and gary coleman? that's right, none",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak, blah blah blah, rat shit poo balls, play the game, shitnose",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Remembered playing this as a kid and found it again by coincidence, now im addicted to not only postal 2, but every game in the franchise (except Postal 3), would reccomend it to anyone and god the Nostalgia.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It can be quite fun going through the maps and ticking off every task on the list but I wish there was  a run button.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Okay, I haven't finished the game yet, but so far it is REALLY good. The amount of comical stuff in this game is hilarious, and the ''zip'' and ''unzip'' feature is just so peak. I've had so much fun in this game so far and I bet it gets so much more better.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "\"Say, I'm pretty good at this!\"\n\nReally good game, despite its age. Apocalypse Weekend is a slog to get through but the second week makes it all worth while. 9/10 (despite apocalypse weekend)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Cool. Shot a bunch of people, put them on fire, pissed on their faces and then launched the game. ))",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolute classic.\n\nSomething other reviews may not tell is that it provides an amazing cyber tourism experience. Exploring Paradise is just delightful and you never know what you're going to find during the first five days in free-roam.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "genuinely one of the best games i have played\n\nthe humor holds up quite well, the controls feel nice, it's quite cheap, especially when it's on sale, and will fuck you up if you decide to choose a hard difficulty\nit was made with love, and the studio behind the game interact with their community often while taking criticism quite well, fixing bugs and issues with their newer titles if they're made aware of it\n\nso. if you're looking for a game that doesn't take itself too seriously while still being fun as hell, then play this game\n\nor don't, i'm not your dad",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Before I start, I would say that if you are playing this game. Play the first full week (Monday to Sunday) and then wait a while and then play Paradise Lost. Even though I'm satisfied with my playthrough, I feel like time away from the Postal 2 main campaign would've increased my appreciation for Paradise Lost.\r\n\r\nAnyways, THIS GAME IS PEAK. WHATCANISAY ISSA MASTAPEACE! This game is cock and balls. It's unironically one of the greatest games I have ever played. It's just so funny. With it's extremely dark, shocking, tongue in cheek and often meta humour, it's blatant disregard for everything and it's degeneracy, I loved every moment of it. it's just so charming! Although I do wish there was some score or background music while exploration as it tends to get too quiet. Maybe that was intentional. Some songs do pop up diegetically here and there and most of the time, they are bangers! The artstyle is very nice and many of the scenarios are really creative and fun! \r\n\r\nOverall, Postal 2 is a game you should not be playing seriously. But underneath all the humour and jokes is substance and thoughtful execution that I think the targeted audience of this type of game would enjoy!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game. It's silly and fun and very offensive and I just can't get enough of it! In my top five games ever. It is broken, and there are glitches and bugs and the game does crash, but it's still a really fun game and you can definitely tell that a lot of love has gone into this game. I did not really care for Apocalypse weekend, as it was a little annoying and was very linear without much of the open-world aspect that the base game has, but I absolutely love the base game as well as paradise lost!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is insane, you can do waht everyou thing is impossible to do in other games, is almost anarquic\nthis game is made with love to steam consumers \nRunning with scissors is top",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Who'd think one of the more evil games has the nicest developers. The game is amazing too, and still getting support to this day, twenty-something years later!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open world design isn't so good but the amount of content in the game makes up for it. Many ways to complete the story, even as a pacifist (surprising considering the violence in the game) or just restricting yourself to 1 weapon. Voice acting is good and the game is enjoyable",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i went to confess my sins at the church needing only to do a donation to the church itself for my sins to be forgiven ,\r\n\r\nsoon after an army of osama bin ladens attack the church and blow themselves up at the turn of every corridor\r\n\r\nthe next day i would pass by the church again and it turned in a mosque\r\n \r\n10/10 \r\n\r\nbtw alot of people complain about the game crashing on them but for me in my time it took to beat it it only crashed once when i was in a loading screen between areas \r\nmaybe its an overblown issue? \r\n\r\nanyway good game , great time capsule of 2003",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has been out forever, and still gets routine content, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I remember first actually hearing about this game from a caddicarus video on controversial games a few years ago and bought it when it was on sale. Had it untouched in my library for a bit until back in the summer when I first played it and fell in love instantly. I even got some of my buddies to play it and even they had a blast. I honestly can't wait for the redux and VR version in 2026. One of the funniest games I've ever played.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I think its safe to say that this game is an American cult classic. Cant stop going back to it. Thanks RWS",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It makes whiney congressmen cry, so it's pretty great. Also it's a legitimately fun game for people who know how to take a joke and have a laugh. RIP Champ. RIP Gary Coleman.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of my favorite FPS and open world games. There's so much you can do and so much replayability.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "To say that this game holds a special place in my heart would be the understatement of the millenium. It´s one of the first games I bought on Steam, and also the FIRST game I´ve 100%ed on Steam. And when I got the notification about the Steam nominations for 2025, I just had to nominate it and reinstall it. I´ve been waiting all hyped up for Redux ever since it got announced, so I figured in the meantime, I might scratch off some of that rust and replay a true timeless classic. The game was way ahead of its time, and it´s great to see that RWS are still taking care of it with updates and new content. It´s a very niche game, but I recommend it regardless, because it´s a one of a kind experience. Hope Redux will do it justice.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game and amazing dedicated team, kickass",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1] Purchase Date: [/h1]\n15th of February 2018 - 15/02/2018\n\n[h1] Purchase Value: [/h1]\n1.94€ (Base Game + Paradise Lost DLC)\n\n\n[h1] PROS & CONS Review: [/h1]\nPROS:\n+ Very fun.\n+ Dark humor.\n+ Chaotic.\n+ Satisfying gameplay.\n+ Soundtrack.\n\nCONS:\n- Crashes to desktop occasionally.\n- Mouse sensitivity is too high even when all the way down.\n- No in-game option to lock the FPS.\n\n\n[h1] Text Review: [/h1]\nBesides all the extremely violent and nasty acts happening throughout the game, I see art in POSTAL 2.\nYes, it's extremely exagerated the way the developers try to send the message, and that's why it's a great example of an allegory correctly implemented in a video game!\nIt's basically an errand simulator, with a lot of plot twists in between that will make the game more and more chaotic for each day passed.\nWith the Postal Dude having a constant tired and passive aggressive tone of voice, the dark jokes can become very funny! \"You just gotta be fu€k!n9 kidding...\" - This exact line he keeps saying in some cutscenes is one of many I love and it's currently part of my daily life vocabulary!\nThe gameplay is very satisfying and becomes addictive quickly.\nThe soundtrack is good as well.\nIt doesn't have the best graphics or visual art but in this case it's not a problem.\nI experienced some crashes to desktop, specially while playing the Paradise Lost DLC. I guess it's acceptable since this is an old game and I'm playing on a modern/high-end setup.\nThe mouse sensitivity is too high even when it's all the way down.\nThere's also no in-game option to lock the framerates per second.\nThis line is for the achievement hunters! It's hard to get 100% Steam achievements. You'll have to start from the beginning several times to unlock certain achievements. In my case it's not boring as I find this game replayability very enjoyable, anyway, you've been warned.\n\n\n[h1] Recommendation: [/h1]\nI keep on saying to my friends to give this game a chance. It's simply a masterpiece.\nI totally recommend it!\n\n\n[h1] Rating - 85/100 [/h1]\nReview Date - 24/11/2025",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Is just as youtuber Hey Peter said in his two hours video, this game is a timeless American classic!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is awesome! you can piss on people, chop limbs off, blow stuff up, and more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "love it tbh, its so fun and funny would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ever get the feeling where you like your playing an open world game and you just want pure destruction no story yeah thats what i feel like this game is yet its so random when im doing the week cuz like wym im just turning in a book or smth i forgot what it was then the place explodes this game is so random yet funny yo",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game enlightened me to the wonders of the universe. To quote this century's greatest philosopher: \"I regret nothing\"",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is geniusly weird in its own special way. I HIGHLY recommand you buy this game and play it blind, you'll get a better experience out of that. and shout out to RWS and Vince Desi, y'all are the best.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wonderful for example, I’m sitting in a church waiting to confess my sins when it suddenly I give the middle finger to a girl walking by me suddenly two people start shooting each other and then I just start pissing on everybody. If that sentence doesn’t make you wanna play this game then I’m sorry.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I wish I could give like an in-between review. like yeah its not a bad game structurally and whatever but this game is probably way more enjoyable if you're an edgy 12 year old boy who has no friends. or just an edgy boy with still no friends. you'll really like this game if you're an insufferable asshole no one likes. i don't hate edgy humor and its funny at times but it's also like, ugh we get it. we gettt ittttt being offensive is your only personality trait. now i'm gonna get people being like \"omg the woker\" go outside and get some pussy.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game's way too good, I'm ashamed that I bought it just for 1 euro... and receiving update/s on a 20yr old game is  W I L D...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game! Loved it so much I went outside each day of the week, stole a bunch of napalm, urinated on random innocent people, went to get the milk, and shoved a cat up the barrel of a shotgun IN REAL LIFE!!! 10/10, would recommend!\n\n(Also, what's a postal 3? Postal 3 never existed, and was not a terrible game. I'm not in denial, you're in denial! WHAT'S A POSTAL 3?! THERE WERE ONLY POSTAL, POSTAL REDUX, POSTAL 2, POSTAL 4 NO REGERTS AND POSTAL BRAIN DAMAGED! IT WAS ALL IN LE HEAD.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "best game i have played for a 2003 game it has a good sotryline and gameplay reccomend buying it while it is on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't know what this game was when I started it. It came out in 2003, and i'm so glad I didn't know. WHAT A RIDE. i was sad for the cats.\n\n\nalso i liked peeing on things.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Went to pick up an alternator for my car. The junkyard hounds punched through the fence and started jumping at me so in a panic I threw the molotov I was holding, and the now flaming dogs caught me on fire so I had to p*ss on myself to put it out. Great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "вышел на улицу, обоссал всех собак, расстрелял всех людей и зашел в постал.Рекомендую",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I grew up playing this game 😅 Basically a psychopath simulator....I just downloaded it and tried all the sick 💩\n\nI had such a beautiful childhood.\n\nBtw fun fact you can beat the game with 0 violence.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "raunchy, violent, grotesque, and ill-mannered.\r\nperfect tourist filter for the peak of gaming history",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Эта игра очень добрая и весёлая. Можно общаться со всеми(даже с мусульманами) и даже погладить кошек и собак, также их можно приручить. Весёлый персонаж и его собака каждый день делают задания со списком и путешествуют по городу и кстати помогают ещё в городе. Советую  всем купить эту игру. И сыграв в неё вы не пожалеете!!!!🥰🥰",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a fuck ass game, but its a good one. i cant believe people tried to censor it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun game, you can do whatever you want but there are consequences.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Postal 2 is an absolute gem for those who appreciate dark humor and unconventional gameplay. The game offers a unique blend of satire and chaos, which makes every moment entertaining. The open-world environment allows for a level of freedom that is rare in gaming, letting players choose how to navigate through the world, whether that means tackling missions or just causing mayhem for the fun of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Difficulty: Easy\r\nTime Taken To Complete: 3:38:14\r\nCats Hurt: 0\r\nMy playthrough of this game was very enjoyable!\r\nSome parts are kinda walking simulators but other than that this games missions and combat were really fun!\r\nThe combat is very fluid and the guns feel great!\r\nPreformance:\r\nGame crashes: 3 (Expected for this old of a game)\r\nFPS (Default Settings): Very High (Intel Iris XE Graphics, 11th Gen Intel Core i5-1135G7 @ 2.40GHz)\r\nOverall Rating: 9/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most American simulator.\r\nThere's a bug that causes the game to crash when moving to another area, which can be annoying, but it's not common enough to be a significant issue if you manually save frequently.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I regret nothing… Except for not playing this game sooner.\n\nIn all seriousness though, I really enjoy playing this game. I love the dark humor and wacky storyline lmao. 10/10 game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Although the humor is incredibly dark and therefore this game is not for everyone, this game is incredibly fun gameplay-wise, and it gives a massive amount of freedom of what you are able to do every day. It is incredibly enjoyable and I recommend this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Need more postal games like this one. This game just makes me happy when I play it and actually makes me laugh a lot. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is exactly what you expect it to be: goofy and violent.\nWhat I like is the humor, it's really good but some jokes reference things I don't think you'd know about.\nWhat I don't like is the absolute walking simulator this game becomes when going between places.\nThere's also the boring boss fights, like the bosses legit just stand there and shoot, nothing else.\nBut I'd still recommend picking up this game, especially if it's on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sign his petition i guess\r\n\r\npretty fun game about doing errands.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sign this petition!\n\nThe game is legendary, played this game on many diffrent devices.\nIt cured my tired and boredom, hope the devs will live long enough until next 'Going Postal'!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm going POSTAL anytime i play as Dude! :D the lore is great, the game and its mechanics are iconic and are recognized widely around the scene. A statement piece!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It’s not for everyone, but that’s exactly what makes it special",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game love the humor. i cant wait for the redux i just hope it can run on my crappy 570. ive actually played for 170 hoursd i just lost my old steam acc",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really dumb game, but with some \"charm\" to it. The modding is pretty good tho.\n\nRecommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When life gives you lemons, make lemonade, drink it, then proceed to piss on everyone. Postal 2 is a beautiful mess of a game. Running on an amalgam of Unreal Engine code, Postal 2 delivers a fun, sometimes glitchy, experience that has solidified itself as a gaming sensation. It may not be perfect, but RWS put passion behind it when they first made it in 2003. In the two decades that have passed, they went back to fix most glitches and even added new content (Apocalypse Weekend and Paradise Lost, also free ost). \n\nViolence isn't the answer. It is the question, and the answer is yes. Live, Laugh, Regret Nothing *Proceeds to flip the bird and piss on you*",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game very much! I urinated on the face of almost every person in the city, and not just people! DOGS TOO! I blew up stores, killed everyone without exception... And so my wife brought my laptop to the prison where I am right now..... Finally, I will be able to play Postal 2 after such a pleasant day.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Play the game and has good humour, you can piss on a cat then use it as a silencer while killing osama bin ladin",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun, would definitely play more if the game didn't crash every 10 minutes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Q: What’s the story about?\nA: You go through a week completing simple tasks like collecting your paycheck but how violently you complete them is up to you.\n\nQ: Is it open-world?\nA: Sort of. You can roam the town freely, though the map isn’t very large.\n\nQ: Who would enjoy this game?\nA: Fans of dark humor and the infamous violence of the Postal series, or anyone curious about its outrageous gameplay.\n\n[h2]\n[hr]Any other questions? Ask me by commenting![/hr]\n[/h2]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow. Just WOW. Story telling, characters, and dialogue is beyond terrific!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game almost 10 years ago, didn't write a review at the time, I just didn't in the past. I remember seeing the early parts on YouTube and decided to play it myself. I remember the game taking a lot of turns I was not ready for lol.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it it is still the best postal game that is not scared to talk about some things… but hey you can now piss on people! If not to include tf2 but game still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game and especially has a lot of replayability",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ok, this may or may not turn out to be an essay, I dunno, dont care\n\nPostal 2, infamous in gaming culture, in 2025, is it still good? Yes, would i recommend it to my friends? Yes, are the jokes outdated? Yes, is the whole game still jokingly offensive? Yes. In 2025, postal 2 is still a masterpiece of gaming, mods enhance this experience, from simple mods that change the appearance of postal dude, to mods that completely add new weapons, most of them are good ideas. The entire postal series gained its traction from this game, I personally played postal 4, which was based off this game, it was alright, never was it really an incredible game but it was consistently alright. Postal 2, the classic it is, excels in high-octane combat action. I could go into detail but would rather not. This game was whst put postal dude on the map, he was prominent from the first game but never shown in various other media, but postal 2, put dude on the map, and his career fully picked up. Postal 2, being the masterpiece it is, had a reason for this, in postal 2, postal dude was revealed to be an unconditional all-purpose maniac, starkly contrasting to his original appearance in the original postal, when he was depicted as a no-nonsense cold blooded killer. In summary, postal 2 is a thing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "silly but offensive game about doing errands for your fat ass wife besides its fun and enjoyed on pissing on people and filping the bird \n\nat all things atleast i got my petition signed by gary coleman and a terrorist\n\nwill you go crazy irl? - no\n\nis it funny? - yes\n\nyou sure my history won't get leaked - maybe\n\ncan you do alot of offensive things? - yes\n\ncan you piss on anything - yes\n\nso am i free from this check board? - no",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "dude this game is so peak despite being released in like 2003, i think its really cool how you could hypothetically beat the game without hurting a single person, and Rick Hunter does an excellent job as the Postal Dude.\n\nthe game was worth every cent, and i regret nothing\n                                  10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I was curious to check this game out and honestly it was worth it! Although it does have some glitches/bugs here and there. It doesn't take too much of the experience away from the game. There's a lot of things to see and to explore in the town of paradise and with how you go about spending your tasks as the dude.\nIf you're into the Randomness and the freedom of having to do things your own way [whether it be normally or straight up violent] you're in for a ride.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "MUITO BOM PORRA\nque delícia atirar em conservador, mijar em sim mesmo pra apagar fogo e usar o c* de um gato como silenciador",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "totaly open world, do the story if you wish but the actual game is open world",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Took a piss on some guy's house, Got bit in the dick by a dog then got shot 87 times in the head. 10/10 no complaints",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great violent game i love making npc's throw up so i can chop their limbs apart",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]PLEASE, SIGN MY PETITION!![/h1]\n\n[i]This is not a game, it's a masterpiece. Even though it was released way back in 2003, it remains a worthy example of quality for many modern projects.[/i]\n\n[h3][i]Story.[/i][/h3]\nAccording to the plot, we need to live through a week in the life of an ordinary Dude (That's the name of our hero). But with each day, more and more absurd events will happen, from bank robberies and church explosions, to a full-scale apocalypse.\n\n[h3][i]Gameplay.[/i][/h3]\nThe gameplay here is very diverse. We will interact with NPCs, shoot (a lot. very much) and.. just peacefully stand in lines :D What could go wrong? But when we have tons of explosives in our inventory, different types of guns, and mountains of drugs, simply standing and waiting won't be as fun as charging through.\n\n[h3][i]Visuals.[/i][/h3]\nThe graphics here are very pleasant for games of that time. I adore it when the hitbox and collision of an object match its outer texture. It makes parkour easier and the worldview more accurate. And a bunch of small details, jokes, references, and a sea of satire don't allow the eye to stop enjoying.\n\n[h3][i]Verdict.[/i][/h3]\nAs a result, this is so far one of the best games I have played. A phenomenally cruel and dynamic cocktail, but not from a bar, but a Molotov one. I'm glad there's DLC to extend the fun, as well as several other parts.\n\n[code]If you read the review and liked it, don't forget to give it a thumbsup;)[h3][i]The further - The better♥️[/i][/h3][/code]",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "wowzerz this game is pretty violent!!!, i actually peed myself when i first played :crylaughing:, if you're sensitive to bigotry (heh maga supporters get rekt!) than i do not reccomend you playing POSTAL 2. i thoroughly enjoyed this franchise but i did NOT appriciate the stereotypes or violence",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're okay with the pissing, animal abuse, blatant racism, vulgar language, offensive scenes, controversies, BDSM, and everything else it did to be deemed the most offensive game of all time, then its one of the coolest games you'll ever play. Especially for how cheap you can grab it when its on sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you dont mind long walking and dont find it boring like I do then youll have great time especially with the stupid and offensive things this game has but for me its waaay too boring omg lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hey.\r\nHi there!\r\nIs this everything?\r\nYes\r\nThat'll be\r\nTen\r\nDollars\r\nShit.\r\nI'm sorry.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "saw some people protesting against violent video games, so I peed on them and they all started shooting at me.\n\nThen I went home and played POSTAL 2. Great game\n\n10/10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "you go girl! i regret nothing! this can't be good for me but i feel great! but i just started yesterday!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love this game, it's so stupid. I regret nothing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Oh boy, this game, it's pinacle videogame, it's a total mayhem and I love it",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "this the game where that one  roblox asym game has that voice lines from..... what is it called???? idk i dont play roblox.\n\nanyway htis games like fine i guess\n5.3/10 devestos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Possibly the worst open world design I have ever played. The POIs hidden all over are charming, but the clunky and pointless gameplay make it DOA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "heelo told me the game was peak and was the best but its genuinely so ass that the game crashed and closed itself so that i could save myself the trouble on why i got off of it. -999/10 would rather take 10 different colored franks at the same time than play this shit again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like it. It's just cringe. It's not funny and edge lords love qouting this game thinking they are going to make everyone in the room laugh. Sign my thing or I'll do so and so, omg your a comedy genius. Game play is dated but that's cause its old so they get a pass there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I regret everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games are bad, they make you mad!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It really isn't that good of a game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game will not stop crashing once I get to Sunday.\nthe game also isn't very fun unless you're achievement hunting.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Possibly the worst open world design I have ever played. The POIs hidden all over are charming, but the clunky and pointless gameplay make it DOA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "heelo told me the game was peak and was the best but its genuinely so ass that the game crashed and closed itself so that i could save myself the trouble on why i got off of it. -999/10 would rather take 10 different colored franks at the same time than play this shit again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "tried everything and literally cant even launch the game anymore so idk if this is just me or if they just broke the game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I didn't like it. It's just cringe. It's not funny and edge lords love qouting this game thinking they are going to make everyone in the room laugh. Sign my thing or I'll do so and so, omg your a comedy genius. Game play is dated but that's cause its old so they get a pass there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "FUCK AND  MEAN FUCK YOUR STUPID FUCKING GAME AND ITS STUPID FUCKING SKELETONS FUCK!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I regret everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It really isn't that good of a game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "weird",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the game will not stop crashing once I get to Sunday.\nthe game also isn't very fun unless you're achievement hunting.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "probably only funny when you're a racist 16 year old that thinks they just now discovered satire for the first time\nor if you're any steam user.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Possibly the worst open world design I have ever played. The POIs hidden all over are charming, but the clunky and pointless gameplay make it DOA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this the game where that one  roblox asym game has that voice lines from..... what is it called???? idk i dont play roblox.\n\nanyway htis games like fine i guess\n5.3/10 devestos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "heelo told me the game was peak and was the best but its genuinely so ass that the game crashed and closed itself so that i could save myself the trouble on why i got off of it. -999/10 would rather take 10 different colored franks at the same time than play this shit again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like it. It's just cringe. It's not funny and edge lords love qouting this game thinking they are going to make everyone in the room laugh. Sign my thing or I'll do so and so, omg your a comedy genius. Game play is dated but that's cause its old so they get a pass there.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I regret everything.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "games are bad, they make you mad!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It really isn't that good of a game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game will not stop crashing once I get to Sunday.\nthe game also isn't very fun unless you're achievement hunting.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "probably only funny when you're a racist 16 year old that thinks they just now discovered satire for the first time\nor if you're any steam user.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Possibly the worst open world design I have ever played. The POIs hidden all over are charming, but the clunky and pointless gameplay make it DOA",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "this the game where that one  roblox asym game has that voice lines from..... what is it called???? idk i dont play roblox.\n\nanyway htis games like fine i guess\n5.3/10 devestos",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "heelo told me the game was peak and was the best but its genuinely so ass that the game crashed and closed itself so that i could save myself the trouble on why i got off of it. -999/10 would rather take 10 different colored franks at the same time than play this shit again",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like it. It's just cringe. It's not funny and edge lords love qouting this game thinking they are going to make everyone in the room laugh. Sign my thing or I'll do so and so, omg your a comedy genius. Game play is dated but that's cause its old so they get a pass there.",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}