{
  "positive": [
    {
      "review": "be me\r\ndownload game because a friend plays it too\r\nplay the game\r\nfeels boring only playing su-25\r\ngets f18 because people say its good\r\nlearn it\r\nlearn it more\r\nfriend quits\r\nme alone and with no one to play it\r\nonly plays single player missions\r\ngets good\r\ngets hotas\r\ngets headtracking\r\nstill playing alone\r\nbut game good\r\ndcs good",
      "voted_up": true,
      "votes_helpful": 140
    },
    {
      "review": "Great game but its a shame you get a bad plane for starters and all the modules cost $7-$100.",
      "voted_up": true,
      "votes_helpful": 30
    },
    {
      "review": "the buttons are so hard to memorise but if you play for 6 to 7 dats you get it\r\n(killing plans are so fun)",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "You can play the best combat flight sim ever made literally for free.\r\n\r\nThe base aircraft you get is not modelled true to life regarding systems and avionics, but the flight model is already really good. Even if you don't buy additional airframes or maps, flying the Su25T in the caucasus is already loads of fun and you can do plenty of stuff.\r\n\r\nYou WILL get addicted and buy additional content, beware.\r\n\r\nThe only downside at the moment is a few issues between Eagle Dynamics and their partners, and some aircraft dlcs being effectively abandonware.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "The best way to learn is grab a friend and learn with him, so you still learn, and you have tons of fun. It makes the steep learning curve more bareable :D ferry cool game too",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The ultimate flight-sim sandbox. Insanely detailed aircraft, realistic physics, and endless scenarios. A dream for aviation fans willing to learn the ropes.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very good game would recommend. This game is very fun once you get the hang of it but can be very challenging but fun once you figure it out. This game also has a great community there is a large amount of servers and other pilots to fly with. Also the F/A 18C is the BEST jet in the game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has a great level of realism overall, but the damage modeling for WWII aircraft still makes me feel a bit unsatisfied. The airframes are obviously tougher than what real WWII fighters should be, and the effects of cannon hits don't feel quite good; it's hard to imagine a WWII aircraft could still flying, even keep maneuvering when its fuselage is riddled with holes.\n\nI also really hope to see Me262 dlc or other WW2 aircrafts. To conclude, this game is incredibly enjoyable, and the WW2 portion still potential, it just needs time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is really complicated but its realistic so its a good thing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well, it's just must-have for any mil aviation (and not only) fan\nwith 15 year old base code it has its limitations and shortcomings but - opposite to MSFS - it works",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DCS made me feel like a real fighter pilot… and yes, I’m a real pilot real life me does not scream at the sky this much.\n\nBeyond the jokes, DCS delivers stunning visuals, incredibly realistic flight mechanics, and a level of detail that makes most other games feel outdated in comparison.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it!!! I recommend a decent HOTAS setup and a VR headset for a good experience. I got the Mig 15 BIS for my first module and then upgraded to the L-39... So far DCS has been amazing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is super realistic,but you need an controler or an joystick to play realisticly 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game its great when you have friends to fly with and the comunity is over the top friendly and helpfful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game gets batter as skill level develops.  The challenging dog fights are very exciting and keeps you coming back for more.  its very addictive!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love it but i don’t like how expensive the dlcs are and that you need docs for a better experience",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun!!!!!\r\nI am new to flight sims so I am glad that the community is so nice and helps.\r\nWARNING!!!!! Alot of planes cost money, you cant just hop in and go BBBBRTTTT in a A-10 but there are two free planes so you can decide to buy other planes other then that its great 10/10 but when fallin out the sky 0/10...... JK still 10/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game even by yourself but you do need a flight stick if you want to enjoy it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it is supoer fun, i havent figured oput how to fight yet but im trieing to stick a londing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its just war thunder but for the people who like pain and suffering in conclusion  harder version  war thunder and spend 30 mins starting a plane take off ge6t killed or crash",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This flight simulator has a steep learning curve, but it's extremely rewarding and fun once you get the hang of it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It would be real with VR glasses and a joystick. The controls are a bit difficult with a controller, but it's not that bad. DLCs are quite expensive and the game is quite empty without them. However, it's a very brutal simulator.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "BEST GAME, play it , the SU-25T is free and very fun, F/A-18C is the most realistic flying experience you can get, and the VR support is amazing even without a HOTAS, just using your keyboard, VR controllers, or hands is super fun. People say the skill gap is bad, but it took me like 30 min to figure it all out. All in all amazing game if you like aviation, or just wanna fly cool planes and shoot missiles.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Can play on an xbox controller with no issues mostly. Just youtube setting it up to work better, and using the flaming cliffs planes is easy no matter the controller type you use. Not saying you can't use High Fidelity planes tho, but those are expensive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game and I haven't used any special controller or flight stick.  I need to get one.  I have only been using my keyboard.  Love the graphics and how real the game is!  Way to go DCS!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game great terrain its just perfect, but i really think they need to make hand tracking better and more compatible",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very fun but its not fun unless you buy a plane or another vehicle it is VERY realistic but the only downside is it does make spend all of your money buying new planes",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "[h1]Great game, just don't use the in-game tutorial. [/h1] Use a guide on steam or something.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DCS World – Almost like flying for real (especially in VR)\r\n\r\nI really enjoy this game, and I play it almost exclusively in VR. The realism is impeccable — it feels almost lifelike. The aircraft systems and flight models are incredibly detailed, and learning how each plane works is a big part of the fun.\r\n\r\nIt’s not impossible to get into, but it’s definitely a challenge — the perfect mix for anyone who enjoys learning and mastering complex systems. Carrier operations are particularly impressive and realistic, and there’s nothing quite like the feeling of catching the wire after a smooth landing.\r\n\r\nI also love creating my own missions and flying those made by other players. The online experience can be amazing too, especially when you find players who simulate ATC or coordinate as a proper flight group. When that happens, it feels like a full-on military sim experience.\r\n\r\nDCS World is a brilliant mix of realism, creativity, and community — if you’ve got the hardware and patience, it’s absolutely worth diving into.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's very fun! it looks hard to learn, but you only really need to know how to fly, take off, land, and fire weapons. and multiplayer is fun, for beginners i recommend PvE, since pvp is a nightmare for starters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a brilliant flight sim, let alone combat flight sim. \r\nThe only downside to playing this game is the long load time but you have to make allowances for the level of detail.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a great plane simulator! Lots of things to do, super-realistic, and great fun! There are a few issues however:\n- DLC is way too expensive in my opinion. I simply do not have money for £60 on one plane and £40 on one map, so I'm stuck with 3 planes. \n- The TF-51D is missing the manual, so it's tough to learn how to start it (not least because props are far more complicated to get started than jets).\n- The Su-25T doesn't have a cold start mission, and usually I enjoy starting free-flight missions from the startup.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good graphics, realistic",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I learned to fly a fighter jet\nthen I equiped my F16 with 4x Mk84 2000lb bomb\nthen I headed straight to Russia to deliver 8000lbs of pure hate on those russian scum\nthen I got interested and downloaded this game\nWould recomend",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "start plane, get to runway takeoff , crash... start plane, get to runway takeoff , crash...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looks, sound, control and support.\r\nAlready this sim has pi$$ed all over Microsoft, 1C Studios and the one that's calling itself \"MicroProse\".\r\n\r\nI'd write more but I just bought a D9 and i'm off \"upstairs\" to tear up a formation of B17s\r\n(It's fun but just not right doing it in a mk.IX Spit)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "En iyi uçak oyunu ama uçaklar çok pahalı özellikle türkler için çok pahalı",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT be discouraged to give DCS a try if you do not have a HOTAS.\r\n\r\nI have only scratched the surface of what DCS can do and I enjoy it a lot. I currently use an XBOX controller with one of Tuuvas' pre-made button layouts. You will need to watch his YouTube video to setup the controller in Steam for some of the specialized key-binds. Once you do, it is fairly simple to get in the air and destroy some targets. I recommend learning how to fly and land your chosen aircraft before going onto combat. You want to have that muscle memory for maneuvering the aircraft before introducing evading and engaging targets.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a very detailed flight sim. I really enjoy playing it. The only thing that I don't like is that you only get two planes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game but i dont have 400,000 dollars to put a f16 \nin my middle class home",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really liked how simple it is to start and the graphic included.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've only played in VR and have purchased the F-16, F18 aircraft Syria and Persian Gulf maps. I enjoy the VR flying better than MSFS2020 - smoother experiance and the combat is awesome. Steep learning curve if you want to learn aircraft systems and weapons / tactics, however you can jump straight in for free flight and other non-combat missions, just to enjoy flying without any pressure to know systems or how to fight. I actually purchased the F-18 and returned it originally because I couldn't get a smooth flying experiance out of it... I bought a RTX 5090 and still wasnt happy.... however, if you get your settings just right, it is an awesome experiance. Now I just need to spend a couple more grand on a decent HOTAS setup, and then a few more grand on a 3 or 4DOF hydraulic rig with haptics to be truly happy. Probably would have been cheaper taking flying lessons in real life.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you we're blessed with the aviation type of autism this game is perfect 10/10 Highly recommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very realistic but i wish the cockpit was actually readable on the older aircraft",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I spent 5 hours trying to download TERRAIN!!!\r\n\r\nSo NO game playing.\r\n\r\nSo, no maybe choice for recommending.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The most detailed and accurate simulation available. Keep up the good work!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DCS Is the most realistic publicly-available military flight simulaton.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "DCS in the first 15 hours:\r\n1. Buy your fav jet\r\n2. Learn how to startup, taxi, and fly\r\n4. Join to a random server\r\n3. Got demolished by a friendly plane",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awsome graphics and great contols",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is more like a simulation, still an amazing sim if you love military.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Got in SU-25, memorized how to blow stuff up, got shot down, got shot down again, blew myself up with bombs, killed stuff with missiles, 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very realistic and can build knowledge on many combat styles",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "made me throw my headphones on the floor and jump off a clliff, 10/10 GAME",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Some of the most fun I've ever had in gaming. I'm already into aviation, and quickly found myself buying HOTAS and a VR headset and upgrading my computer. You could say this was one of the most expensive games I've every played because of all that, but 100% worth it for me.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The fact i recently found out about the logitech X56 finally brough an affordable solution for me to play this game, and i've loved every second if it so far, cant wait to see how the game progresses and how my skills grow with it!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Remember Crimson Skies? Its not like that well its a little  like that with a much steeper learning curve.  Im still looking for the first person view I like.  But its fun,  its like zero action until; you know what your doing, and then its still hard to do.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Flying is cool. Pressing buttons is cool. Game is cool.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fantastic game. Be aware that it is very hard to learn as a new player. A jet will take you weeks to learn well if you are trying to be serious and go on missions. Just flying and getting up in the air then it will just take a few hours.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is hands down the best game for autists",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My pc cant handle someone pls buy me good pc excellenet game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Impress family members, cherished pets, and available women! Learn how to fly war planes today!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "get a hotas and a vr or eye tracking, i mean who doesnt like jets...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "awesome game definitely recommend getting flight controls tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "get a low fidelity plane and your good to go if you have a flight stick",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so good game when i got my first su-27 gun kill i nuhed all on my monitor",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game great realism and free",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not easy but fun with practice.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you like hardcore 1 to 1 flight sims with military vehicles this might be for you",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game but my wallet is on it's death bed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "it took me 3 hours to turn the plane on and 3 minutes to crash it",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Fuck I love getting shot two R-27 at my F-16. Absolute peak",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game made me question my sanity. 10/10 game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its great very confusing tho",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and lot to learn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good but expensive",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game with cool models",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Takes some tism to get good at.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS GREAT JUST DO IT....DUDE WITH TIME TO KILL",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "F16 go zoom\nA10 go's beeeerrrrrrtttttt",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great sex physics",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Предельный угол атаки ⁉️\r\nПредельный перегрузка ‼️",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game but don't know how to shoot",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best combat sim ever......love it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best Combat Flight sim around END OF.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "CANT STOP LOCKING ON TO SMALL KIDS",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Most intuitive well optimized flight/mil sim",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game made me loose",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The best simulator of all time",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Realistic feel - solid game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Woo Yeah Baby! That's What I've Been Waiting For",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i fly, i crash, gud",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "THIS IS THE BEST FCKING GAME EVER",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its hard at first then it gets fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bussin game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i love this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "It is not ethical to buy anything from them after the leaked Zoom call. \nOther than that, the future of DCS is a big question. The current state of the game is really bad, and I see no hope for it to improve....",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "Do not waste time with a 200 gb download just to finally launch and figure out you can barely fly jack shit because all the planes need to be bought and some are like 60 dollars retarded ass game can go fuck itself with a 16 inch dildo",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "The Il-2 Great Battles series is way less greedy than DCS, and that says a lot for both the devs and virtual aircraft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "honestly, its really bad, everything is behind a paywall other than one plane that didnt even function when i used it, literally pressed every button and nothing happened and none of the buttons in it worked either, even if it came with atleast a few more things its not worth it, idk how people can genuinly recommend this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no  dont play this game its hard to fly you cant change the controls menu from 2010 graphics are like 2012 and everything else is TRASH",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "still got the same crappy glitchy graphics bug its had for years. oh well off to find a better alternative",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "im reviewing all my DCS products negatively until they fix their beef with razban and continue their work on the strike eagle, which was my last purchase by the way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The price of any DLC aircrafts is crazy. SU 57 is a piece of sht.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "uhhh to much stuff i dont care this buns poopy pants dork for nerds game for nerds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thruster master pedals will not set up and my TQ6 will also not set up!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont know how to use controls and i pressed every button on my keyboard and nothing happend so its trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought two planes, and when i restarted my game to use them, a message popped up saying i couldnt use them. i tried everything and nothing worked. i want my money back and i want people to fix this NOW.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "it such a scam so call realistic i call bullshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to play this game get ready to spend more money on it then your whole flight sim setup",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is not worth the 9 hour wait there's no tutorial and all the planes you have to pay for waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SPEND ALL GDP OF SLOVENIA TO AFFORD 1 PLANE MODEL :)",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "to many controls too complex",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not playable due to bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls are terrible tons of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "add the f15e back or put another one on there",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you think bout it\ngames actually 1k+ dollars",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dont play this on keyboard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Why is 200 fucking gbs",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "WAY to hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad controlls \n\nhave to use a keyboard while in vr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bruh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": ":",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In it's current state, and with the recent behavior and actions of the developers, not only can I not recommend this game, but I implore all users to not play this game for the foreseeable future. \r\n\r\nDCS World is a game by a developer that does not know how to make games. This much they have admitted openly. Eagle Dynamics also, very evidently so, does not have any plan for the future of the game, beyond simply putting out modules that they believe will sell in high quantities. They routinely release modules in such an empty state that it is egregious even for early access products, and abandon them after release for months, breaking promises on when updates will come as regularly as they breathe. They have a habit of promising new modules and features, and releasing them in the most half-baked manner possible, then promising that updates will come to those modules and features to flesh them out, and those updates never arrive, leaving practically every feature and mechanic in the game in a perpetually half-finished state.\r\n\r\nEagle Dynamics is only motivated by money. If given the opportunity, they have proven that they will screw over not only their customers, but also the 3rd party developers who build modules for this game, all of which are near-universally superior to any of ED's own modules. They will lie, mislead, exaggerate, and gaslight their consumers in order to trick them into spending more money on their products. \r\n\r\nHere are just a few examples of incidents within the last 2 years:\r\n\r\nAfghanistan map - This map was released in an early access state that was so barren and unfinished it was unbelievable. The map was split into thirds, and only one third was made available at launch. Map textures were obnoxiously lazy, and building assets were copy-pasted from other maps, and did not fit the area being simulated whatsoever. Updates were promised within 3 months, including the release of the other parts of the map. It released in June of 2024 and took over a year for basic updates to come to the map, and so far as of October of 2025, none of the other portions of the map have been released. We have no timeline on when the other portions will actually make to the game, other than what was promised on launch, which was then quickly abandoned.\r\n\r\nF-5E \"Remaster\": One of the oldest modules in the game, and one with a number of technical issues, and easily provable inaccuracies in its systems simulations and one of the most broken and least accurate flight models in the game was slated for a remaster in Fall of 2024. It promised bug fixes, a new external model, and a \"rebuilt from scratch\" cockpit. However, once the remaster released, the legacy F-5 module would no longer receive any updates. You would have to purchase the remaster in order to insure that your F-5 would continue to receive updates, and eventually the legacy F-5 would no longer be playable, though no timeline on when that would happen was announced. \r\n\r\nThe only problem is that the most glaring issues with the F-5 module were not addressed at all. Many of the existing bugs still persist, including its terrible flight model. The new external model it received rendered 8 years of community liveries unusable, and offered very few vanilla liveries of its own. To make matters worse, the external model files were encrypted, making it exceedingly difficult to make new liveries for the module. Worse still, when the model files were ripped to help make liveries, it was discovered that the \"built from scratch\" cockpit was actually the same cockpit as the original module, which had just received a polish and a higher polygon count, which also had the effect of lowering frame rates while flying it. \r\n\r\nED lied about the cockpit being brand new, and encrypted the files to try and ensure that nobody would be able to find out. And the cherry on the cake is that once you purchased the remaster, it permanently overwrote the legacy F-5 module, so players would not be able to revert to the original. In short, players paid $15 to essentially downgrade their F-5 module just to ensure it would continue working in the future. When criticized for the obvious misdirection and anti-consumer behavior, ED's community managers simply replied that \"the remaster had sold well\" and thus that ED had nothing to apologize for.\r\n\r\nFlaming Cliffs 2024: In short, ED took 3 existing \"full fidelity\" modules, the F-5E, the F-86, and the MiG-15, and downgraded them into low-fidelity modules, in the process removing important capabilities and features of those modules, and resold them as new modules. I have few other words except that it was a blatant and shameless cash grab. \r\n\r\nRazbam: Razbam was a major third party developer for DCS, releasing some of the most important modules for the game, including the MiG-19, Mirage 2000, AV-8B Harrier, and F-15E Strike Eagle. About a year after the F-15Es release, it became clear that ED had been withholding pay from Razbam owed to them via the F-15Es sales. Recently a leaked Zoom call showing this situation being discussed between the CEO of ED, Nick Grey, and the CEO of Razbam, Ron Zambrano. \r\n\r\nDuring the call, Nick Grey repeatedly tells Ron that he is deliberately withholding pay owed to Razbam as leverage(Nick Grey's actual words) to strongarm Razbam into signing an unrelated contract for MCS, the commercial side of DCS, used for government contracts. ED had spent the year since this call alleging that Razbam had committed some kind of IP violation by developing an MCS module without authorization, but the Zoom call made it clear that this was not possible, because Razbam did not have the SDKs to work on MCS, and the only thing ever made for this hypothetical project was a basic 3d model. The validity of this call was verified by ED's own community managers. \r\n\r\nNow, as a result of this blatant illegal violation of contract law on the part of ED, Razbam's modules were removed from sale, and they will no longer be playable in DCS upon the release of v3.0.\r\n\r\nThese are all just examples of anti-consumer behavior, which is bad enough, but the game itself is in a very poor state, and it is heavily divided. \r\n\r\nThis is difficult for people to accept or realize, but compared to hardcore sim contemporaries like Falcon BMS, even loose contemporaries such as War Thunder, DCS has some of the weakest systems modeling and fidelity in the genre. Systems like Radar, missile seeker heads, countermeasures, missile kinematic performance, clouds modeling, FLIR, and other critically important mechanics are objectively simulated to a less rigorous degree than either Falcon BMS or War Thunder, despite DCS promising a genre-peak simulation fidelity.\r\n\r\nFurthermore, because of how long DCS has been around, and how many different developers have made modules for it, there is little to no consistent standard between modules. Many modules are simulated to a higher or lower degree of accuracy and fidelity, and quite often, modules which are simulated to a poor standard end up providing a material advantage during gameplay. For instance, many ED modules, or modules such as the MiG-21 and Mirage F1, have very poor radar simulation. The radar simulation is so basic, that those radars often do not have their historical disadvantages and downsides simulated, so they drastically overperform. \r\n\r\nThere is honestly so much more I could say, but I've been writing this for literally hours at this point. The iceberg goes extremely deep. I had to cut over 2000 characters just for this review to pass the maximum character count. Eagle Dynamics and DCS is an absolute mess, and I cannot warn you in any stronger terms to never, EVER, spend any money on this game. This game is mechanically barren and a broken mess at the best of days. Avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "very nice fantastic game however they will steal your money for DLC then remove it later without offering refunds.\n\n3 planes ($150+) will be lost in the next major update \n\nAVOID",
      "voted_up": false,
      "votes_helpful": 96
    },
    {
      "review": "please please please STOP BUYING MODULES until ED sort out their disagreements with razbam.\n\nIf you're considering downloading the game or buying modules - don't. ED have made it clear they do not care about the player base as much as the petty finger pointing.\n\nThere is a very real chance that whatever module you buy (early access or not) will suddenly cease development and possibly even disappear from the game owing to lack of support the next time ED and a contractor get into a public bitch fight.\n\nDon't give a shit who started it, END IT or refund every player who purchased this embarrassing array of abandonware.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "DCS World Steam Edition is less a game and more a military grade training simulator with a free hangar door, but every actual plane inside comes with a price tag that makes you feel like you’re funding your own private air force. Sure, the fidelity is jaw dropping, every switch, gauge, and knob rendered with obsessive precision but the cost borders on absurd, with single aircraft modules going for the price of full AAA releases and maps stacked on top like you’re building an $800 Lego set. Add in the steepest learning curve imaginable, where you’re just as likely to crash your jet as you are your wallet, and it becomes clear this is less about flying for fun and more about committing to a luxury hobby. It’s impressive from a distance, but up close you realise you’re not playing a flight sim, you’re signing up for the digital equivalent of a defense contractor’s subscription plan, a bottomless money pit disguised as a cockpit.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "It is not ethical to buy anything from them after the leaked Zoom call. \nOther than that, the future of DCS is a big question. The current state of the game is really bad, and I see no hope for it to improve....",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Pay an entire AAA games worth of money for each plane, then join repetitive game modes and have the controls randomly not work half the time.\n\nJust play War Thunder, at least that game is only pay to win not pay a fortune to play at all.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "It's a really cool sim, but after so long I have to accept that it just isn't a good game. The recent spats between Eagle Dynamics and model developers is pretty concerning too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand why I need money to even have fun anymore\n2/10\nNothing to do and war thunder is cheaper and less painful.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "For a 200gb game, you think you'd be able to play it with friends fairly easily. Using online tutorials, me and my friend searched for 90min just trying to be able to play together, but due to this game's greed, you need to find a server that is open, not password protected, nearby you, open to new players, and actually has one of the only two vehicles you get for free without having to drop $80 on their dlc's.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You can add more aircraft in this free version, because with these 2 is nothing fun, I'll rather stop playing this game after that, than actually buy module. Also about modules, they worth like human kidney. It is game after all, not real airplanes to make the game expensive like this...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A pile of digital junk in stand alone version,  and a pile of digital junk in steam,  I've tried both and that is my conclusion,  no wonder they prevent people from saying what they really, really think about their product on their website by filtering out negative comments,  this game is about as equally bad as star citizen, another expensive pile of digital junk.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's very good but... Don't. You only get 2 free planes and if you literally want a new plane/helicopter you gotta pay 45 to 80 euro/usd.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible game the controls are way too complicated",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the most egregiously priced sim game on the market, every aircraft is bought with no free to play method. wish i could actually play and review the game but the barrier to entry is so high, you're better off playing war thunder and that just sounds awful when i say it out loud because war thunder is pretty bad too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DCS is a joke to the CEO, he has never even used it before but calls all the shots. DCS is a random collection of things that MCS has.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I mean the game is beautiful  but i figured you get a few more than one vehicle to play with and than looking at the website to buy more vehicles each one is the cost of an entire AAA game, so god forbid you want variety in the vehicles to use better have a large credit card",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, I know I haven’t played very much, but that little time showed me how bad this game is. 200 GB for poor quality! The tutorials aren’t even made properly. It didn’t work for me, and when I took the first tutorial, a plane took off beside me and blew my eardrums out. Absolutely horrendous game it’s not worth downloading.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is very amazing and has absolute thrilling DLCs ! I want to like this game and downloaded it because it is the only game that has the AJ-37. Inside the cockpit the AJ-37 is exactly like it it in reality.\n\nBut: Game should be playable with keyboard alone. Practicing countless times the landing of the AJ-37 resulted always in crashes, auto-thrustreverse didn't work, plane didn't run straight and turns into curve, then flips and explodes. This destroys the whole game because a flight simulator must be created that way that after some practice MOST landings will be successful ! Maybe a setting for keyboard sensitivity is missing ?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Il-2 Great Battles series is way less greedy than DCS, and that says a lot for both the devs and virtual aircraft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "fun game all you do is sit in thye tutorial trying to understand the buton combos to lift of then you try to lisen to a quiet guy trying to speek wile a misile is beeping in your ear for 5 mins then just to be shot down and have to ree do it all. would recomend to stay away from this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do not waste time with a 200 gb download just to finally launch and figure out you can barely fly jack shit because all the planes need to be bought and some are like 60 dollars retarded ass game can go fuck itself with a 16 inch dildo",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "no  dont play this game its hard to fly you cant change the controls menu from 2010 graphics are like 2012 and everything else is TRASH",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just a long movie. Waited 20 minutes for the game to load only for no controls available and not allowed to change them.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "still got the same crappy glitchy graphics bug its had for years. oh well off to find a better alternative",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "im reviewing all my DCS products negatively until they fix their beef with razban and continue their work on the strike eagle, which was my last purchase by the way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "uhhh to much stuff i dont care this buns poopy pants dork for nerds game for nerds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thruster master pedals will not set up and my TQ6 will also not set up!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "i dont know how to use controls and i pressed every button on my keyboard and nothing happend so its trash",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought two planes, and when i restarted my game to use them, a message popped up saying i couldnt use them. i tried everything and nothing worked. i want my money back and i want people to fix this NOW.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to play this game get ready to spend more money on it then your whole flight sim setup",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "SPEND ALL GDP OF SLOVENIA TO AFFORD 1 PLANE MODEL :)",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "to many controls too complex",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Not playable due to bugs.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Controls are terrible tons of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "add the f15e back or put another one on there",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "if you think bout it\ngames actually 1k+ dollars",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Apple\n\n\n\n\n\n\nApple'o'thunker\n\nApplesaucer",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WAY to hard",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bad controlls \n\nhave to use a keyboard while in vr",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "bruh",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Jews",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "In it's current state, and with the recent behavior and actions of the developers, not only can I not recommend this game, but I implore all users to not play this game for the foreseeable future. \r\n\r\nDCS World is a game by a developer that does not know how to make games. This much they have admitted openly. Eagle Dynamics also, very evidently so, does not have any plan for the future of the game, beyond simply putting out modules that they believe will sell in high quantities. They routinely release modules in such an empty state that it is egregious even for early access products, and abandon them after release for months, breaking promises on when updates will come as regularly as they breathe. They have a habit of promising new modules and features, and releasing them in the most half-baked manner possible, then promising that updates will come to those modules and features to flesh them out, and those updates never arrive, leaving practically every feature and mechanic in the game in a perpetually half-finished state.\r\n\r\nEagle Dynamics is only motivated by money. If given the opportunity, they have proven that they will screw over not only their customers, but also the 3rd party developers who build modules for this game, all of which are near-universally superior to any of ED's own modules. They will lie, mislead, exaggerate, and gaslight their consumers in order to trick them into spending more money on their products. \r\n\r\nHere are just a few examples of incidents within the last 2 years:\r\n\r\nAfghanistan map - This map was released in an early access state that was so barren and unfinished it was unbelievable. The map was split into thirds, and only one third was made available at launch. Map textures were obnoxiously lazy, and building assets were copy-pasted from other maps, and did not fit the area being simulated whatsoever. Updates were promised within 3 months, including the release of the other parts of the map. It released in June of 2024 and took over a year for basic updates to come to the map, and so far as of October of 2025, none of the other portions of the map have been released. We have no timeline on when the other portions will actually make to the game, other than what was promised on launch, which was then quickly abandoned.\r\n\r\nF-5E \"Remaster\": One of the oldest modules in the game, and one with a number of technical issues, and easily provable inaccuracies in its systems simulations and one of the most broken and least accurate flight models in the game was slated for a remaster in Fall of 2024. It promised bug fixes, a new external model, and a \"rebuilt from scratch\" cockpit. However, once the remaster released, the legacy F-5 module would no longer receive any updates. You would have to purchase the remaster in order to insure that your F-5 would continue to receive updates, and eventually the legacy F-5 would no longer be playable, though no timeline on when that would happen was announced. \r\n\r\nThe only problem is that the most glaring issues with the F-5 module were not addressed at all. Many of the existing bugs still persist, including its terrible flight model. The new external model it received rendered 8 years of community liveries unusable, and offered very few vanilla liveries of its own. To make matters worse, the external model files were encrypted, making it exceedingly difficult to make new liveries for the module. Worse still, when the model files were ripped to help make liveries, it was discovered that the \"built from scratch\" cockpit was actually the same cockpit as the original module, which had just received a polish and a higher polygon count, which also had the effect of lowering frame rates while flying it. \r\n\r\nED lied about the cockpit being brand new, and encrypted the files to try and ensure that nobody would be able to find out. And the cherry on the cake is that once you purchased the remaster, it permanently overwrote the legacy F-5 module, so players would not be able to revert to the original. In short, players paid $15 to essentially downgrade their F-5 module just to ensure it would continue working in the future. When criticized for the obvious misdirection and anti-consumer behavior, ED's community managers simply replied that \"the remaster had sold well\" and thus that ED had nothing to apologize for.\r\n\r\nFlaming Cliffs 2024: In short, ED took 3 existing \"full fidelity\" modules, the F-5E, the F-86, and the MiG-15, and downgraded them into low-fidelity modules, in the process removing important capabilities and features of those modules, and resold them as new modules. I have few other words except that it was a blatant and shameless cash grab. \r\n\r\nRazbam: Razbam was a major third party developer for DCS, releasing some of the most important modules for the game, including the MiG-19, Mirage 2000, AV-8B Harrier, and F-15E Strike Eagle. About a year after the F-15Es release, it became clear that ED had been withholding pay from Razbam owed to them via the F-15Es sales. Recently a leaked Zoom call showing this situation being discussed between the CEO of ED, Nick Grey, and the CEO of Razbam, Ron Zambrano. \r\n\r\nDuring the call, Nick Grey repeatedly tells Ron that he is deliberately withholding pay owed to Razbam as leverage(Nick Grey's actual words) to strongarm Razbam into signing an unrelated contract for MCS, the commercial side of DCS, used for government contracts. ED had spent the year since this call alleging that Razbam had committed some kind of IP violation by developing an MCS module without authorization, but the Zoom call made it clear that this was not possible, because Razbam did not have the SDKs to work on MCS, and the only thing ever made for this hypothetical project was a basic 3d model. The validity of this call was verified by ED's own community managers. \r\n\r\nNow, as a result of this blatant illegal violation of contract law on the part of ED, Razbam's modules were removed from sale, and they will no longer be playable in DCS upon the release of v3.0.\r\n\r\nThese are all just examples of anti-consumer behavior, which is bad enough, but the game itself is in a very poor state, and it is heavily divided. \r\n\r\nThis is difficult for people to accept or realize, but compared to hardcore sim contemporaries like Falcon BMS, even loose contemporaries such as War Thunder, DCS has some of the weakest systems modeling and fidelity in the genre. Systems like Radar, missile seeker heads, countermeasures, missile kinematic performance, clouds modeling, FLIR, and other critically important mechanics are objectively simulated to a less rigorous degree than either Falcon BMS or War Thunder, despite DCS promising a genre-peak simulation fidelity.\r\n\r\nFurthermore, because of how long DCS has been around, and how many different developers have made modules for it, there is little to no consistent standard between modules. Many modules are simulated to a higher or lower degree of accuracy and fidelity, and quite often, modules which are simulated to a poor standard end up providing a material advantage during gameplay. For instance, many ED modules, or modules such as the MiG-21 and Mirage F1, have very poor radar simulation. The radar simulation is so basic, that those radars often do not have their historical disadvantages and downsides simulated, so they drastically overperform. \r\n\r\nThere is honestly so much more I could say, but I've been writing this for literally hours at this point. The iceberg goes extremely deep. I had to cut over 2000 characters just for this review to pass the maximum character count. Eagle Dynamics and DCS is an absolute mess, and I cannot warn you in any stronger terms to never, EVER, spend any money on this game. This game is mechanically barren and a broken mess at the best of days. Avoid at all costs.",
      "voted_up": false,
      "votes_helpful": 57
    },
    {
      "review": "please please please STOP BUYING MODULES until ED sort out their disagreements with razbam.\n\nIf you're considering downloading the game or buying modules - don't. ED have made it clear they do not care about the player base as much as the petty finger pointing.\n\nThere is a very real chance that whatever module you buy (early access or not) will suddenly cease development and possibly even disappear from the game owing to lack of support the next time ED and a contractor get into a public bitch fight.\n\nDon't give a shit who started it, END IT or refund every player who purchased this embarrassing array of abandonware.",
      "voted_up": false,
      "votes_helpful": 56
    },
    {
      "review": "DCS World Steam Edition is less a game and more a military grade training simulator with a free hangar door, but every actual plane inside comes with a price tag that makes you feel like you’re funding your own private air force. Sure, the fidelity is jaw dropping, every switch, gauge, and knob rendered with obsessive precision but the cost borders on absurd, with single aircraft modules going for the price of full AAA releases and maps stacked on top like you’re building an $800 Lego set. Add in the steepest learning curve imaginable, where you’re just as likely to crash your jet as you are your wallet, and it becomes clear this is less about flying for fun and more about committing to a luxury hobby. It’s impressive from a distance, but up close you realise you’re not playing a flight sim, you’re signing up for the digital equivalent of a defense contractor’s subscription plan, a bottomless money pit disguised as a cockpit.",
      "voted_up": false,
      "votes_helpful": 26
    },
    {
      "review": "It is not ethical to buy anything from them after the leaked Zoom call. \nOther than that, the future of DCS is a big question. The current state of the game is really bad, and I see no hope for it to improve....",
      "voted_up": false,
      "votes_helpful": 27
    },
    {
      "review": "Pay an entire AAA games worth of money for each plane, then join repetitive game modes and have the controls randomly not work half the time.\n\nJust play War Thunder, at least that game is only pay to win not pay a fortune to play at all.",
      "voted_up": false,
      "votes_helpful": 17
    },
    {
      "review": "Do not waste time with a 200 gb download just to finally launch and figure out you can barely fly jack shit because all the planes need to be bought and some are like 60 dollars retarded ass game can go fuck itself with a 16 inch dildo",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "It's a really cool sim, but after so long I have to accept that it just isn't a good game. The recent spats between Eagle Dynamics and model developers is pretty concerning too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "For a 200gb game, you think you'd be able to play it with friends fairly easily. Using online tutorials, me and my friend searched for 90min just trying to be able to play together, but due to this game's greed, you need to find a server that is open, not password protected, nearby you, open to new players, and actually has one of the only two vehicles you get for free without having to drop $80 on their dlc's.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "You can add more aircraft in this free version, because with these 2 is nothing fun, I'll rather stop playing this game after that, than actually buy module. Also about modules, they worth like human kidney. It is game after all, not real airplanes to make the game expensive like this...",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "A pile of digital junk in stand alone version,  and a pile of digital junk in steam,  I've tried both and that is my conclusion,  no wonder they prevent people from saying what they really, really think about their product on their website by filtering out negative comments,  this game is about as equally bad as star citizen, another expensive pile of digital junk.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's very good but... Don't. You only get 2 free planes and if you literally want a new plane/helicopter you gotta pay 45 to 80 euro/usd.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the most egregiously priced sim game on the market, every aircraft is bought with no free to play method. wish i could actually play and review the game but the barrier to entry is so high, you're better off playing war thunder and that just sounds awful when i say it out loud because war thunder is pretty bad too.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "DCS is a joke to the CEO, he has never even used it before but calls all the shots. DCS is a random collection of things that MCS has.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I mean the game is beautiful  but i figured you get a few more than one vehicle to play with and than looking at the website to buy more vehicles each one is the cost of an entire AAA game, so god forbid you want variety in the vehicles to use better have a large credit card",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Well, I know I haven’t played very much, but that little time showed me how bad this game is. 200 GB for poor quality! The tutorials aren’t even made properly. It didn’t work for me, and when I took the first tutorial, a plane took off beside me and blew my eardrums out. Absolutely horrendous game it’s not worth downloading.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game is very amazing and has absolute thrilling DLCs ! I want to like this game and downloaded it because it is the only game that has the AJ-37. Inside the cockpit the AJ-37 is exactly like it it in reality.\n\nBut: Game should be playable with keyboard alone. Practicing countless times the landing of the AJ-37 resulted always in crashes, auto-thrustreverse didn't work, plane didn't run straight and turns into curve, then flips and explodes. This destroys the whole game because a flight simulator must be created that way that after some practice MOST landings will be successful ! Maybe a setting for keyboard sensitivity is missing ?",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The Il-2 Great Battles series is way less greedy than DCS, and that says a lot for both the devs and virtual aircraft.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "honestly, its really bad, everything is behind a paywall other than one plane that didnt even function when i used it, literally pressed every button and nothing happened and none of the buttons in it worked either, even if it came with atleast a few more things its not worth it, idk how people can genuinly recommend this",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Game hard. game suck. warthunder better game. play war thunder. get laid.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no  dont play this game its hard to fly you cant change the controls menu from 2010 graphics are like 2012 and everything else is TRASH",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "still got the same crappy glitchy graphics bug its had for years. oh well off to find a better alternative",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "im reviewing all my DCS products negatively until they fix their beef with razban and continue their work on the strike eagle, which was my last purchase by the way.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "it such a scam so call realistic i call bullshit",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The price of any DLC aircrafts is crazy. SU 57 is a piece of sht.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "uhhh to much stuff i dont care this buns poopy pants dork for nerds game for nerds",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Thruster master pedals will not set up and my TQ6 will also not set up!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I bought two planes, and when i restarted my game to use them, a message popped up saying i couldnt use them. i tried everything and nothing worked. i want my money back and i want people to fix this NOW.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "if you want to play this game get ready to spend more money on it then your whole flight sim setup",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "this is not worth the 9 hour wait there's no tutorial and all the planes you have to pay for waste of time",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "SPEND ALL GDP OF SLOVENIA TO AFFORD 1 PLANE MODEL :)",
      "voted_up": false,
      "votes_helpful": 6
    }
  ]
}