{
  "positive": [
    {
      "review": "This War of Mine-like game which feels a little barebones atm but could have great potential in the future\n\npros:\n- Gameplay loop is really fun and the combat/exploration is a lot less janky than it was in TWoM\n- Cool colourful artstyle that nails the 80s vibes\n- Actually pretty challenging as even 2 zombies at once can get you killed or infected\n- Has some real spooky easter eggs and discoveries that will catch you out the first time\n\ncons:\n- Base management is more streamlined and annoying to use compared to TWoM. You have to rotate through every survivor and manually control them with WASD to go to their work station every time. You can't place objects and workstations where you'd like, they're predefined, so it never feels like 'your base.' \nThis is worsened by the fact the game forces you to move bases periodically. Lack of stuff like temperature management, radio announcements or visitors makes this part of the game really easy and just something you try to speedrun through to get to the fun part.\n\n- A little too sandboxy and gamey. You never feel forced to make hard decisions or have to adapt because you can just go wherever you want every single playthrough, so the world doesn't feel alive. TWoM would force you to make choices like robbing an elderly couple or risking your life sneaking into a military base, this game just lets you scavenge for fun and at your own pace.\n\n- Doesn't make enough use of the zombie/horror stuff. Stuff like the [spoiler]meat factory[/spoiler] is really good and there should be more of that in the game. Infection never feels like a serious risk and you can tank hits from zombies, really needs an armour system.",
      "voted_up": true,
      "votes_helpful": 21
    },
    {
      "review": "We have to make it through the night, as quietly as we can. One wrong move, and the whole city wakes.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "The game is fun, the initial creep factor does stick well with well developed zombies and environments, the character & need management is simple and intuitive, and each level/location is well made. However, the game suffers from a lack of replayability as the map itself is static and the (now) 3 escape plans are fixed/linear.\r\n\r\nThe game would benefit greatly from the incorporation of roguelite mechanics to change up the 'world' map, as well as key item and survivor locations for every new playthrough. As of now, I think I've played through each escape plan the 2 different ways each one can be completed (all in 25 hours apparently) and now I'm having a hard time getting myself to play it more; because it feels 'solved'.\r\n\r\nAs a rule of thumb, horror does not mix well with repetition, to maintain that creep/fear factor there was to be a balance between perceived challenge and novelty. This game nails the former but suffers from the latter.",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Just finished once (~14h). \nUsing the first couple offered.\nNormal difficulty.\nAnd an alternative ending.\n\nVery good game, very pleasant to play.\n\nIndeed there is no save. You may still copy the files in the directory for that or quit just before dying to help your game. It saves at the beginning of each phase. One during day time, one during night.\nIt is not really necessary. Except if you do not want to spend a full game to see an alternative ending with your set of characters. But the game is not that hard. I find it pretty relaxing actually.\nSo, up to you to go with that tedious alternative if you believe you need it.\n\nLot of stealth, very well done.\nAnd a surviving/crafting that was not boring at all. A good phase of management without much pressure since you can anticipate what you need or would, and so, the places you are going to visit next.\n\nThere is a good variety of places to visit. At least for the first game you will play. And since the city is big and the devs active, we can imagine a good complement of places with more scenarios, characters... in a close future. Some cliches of the genre are still missing, there is room for nice added content.\n\nI have not much negative things to say. Really. I just had a good time.\n\nInstead of criticism, I am going to pinpoint a short list of things that could be improved since it is an E.A:\n. My first concern is the visibility when everyone is occupied (or not) before leaving the base. The little grey message box is not really pleasant or easy to read. Nothing really problematic indeed. But having the list of characters on the right instead of the left would make this information more obvious.\n . Stealth kill in a door frame or close can be painful at time. The character closing the door instead of killing the Z and now facing it for a direct fight that would wake up more...\n. The time to reach the level 3 of devices, such as the kitchen plan, there is likely no more use of it anymore. Meat already became extremely rare... I think this may be rebalanced. Or it serves another type of game I did not see yet. I ended the game with +50 cooked meals in advance and no meat in any of them. Most of the places were empty.\n. I would have expected more of a story at the end. [spoiler] Especially among the remaining characters. I finished with 4 and one from the start was no more. [/spoiler] A more personalized ending depending on who survived, in what condition, where they go... Here it is too much, you finished following that path, goodbye. Characters are ignored. There is no nice visual, video, whatsoever, or even just a contextual text that could have been appreciated.\n\nThat is all for my 2 cts of comments if any game dev read it.\n\nYet, the best Z game of that type I have played in years.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I really like this genre and will compare it to This War of Mine, since they are very similar but differ in a few ways:\nPros\n- Moving from shelter to shelter to continue the main quest. Interesting gameplay mechanic. Much better than the classic survival in the same house for a set number of days.\n- Clues found around the house open up subquests that inspire the player to explore everything.\nCons\n- It doesn't have a strong soundtrack, which makes the atmosphere too calm.\n- Having pistols or rifles is completely useless (at least as far as I've gotten with the story) because the game forces you to always opt for silent weapons or avoid confrontations.\n- There are currently no achievements.\n\nOverall, I was positively impressed for being in Early Access. Great job!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "My sense of trepidation every time a suvivor ventured out into the wild for supplies was almost too real. Into the Dead absolutely nails the sense of dread I imagine would exist in a zombie apocalypse. I am absolutely enjoying my time in this game, and would highly recommend it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Holy cow, this thing isn't just good; it's the kind of groovy that'll make you toss your boomstick in the air and shout. If the video game industry had any brains, this atmospheric masterpiece would be the additional pillar for every Indie-AA studio out there. It’s like some genius Frankenstein'd the tense, 2D platforming desperation of [b]Deadlight[/b] with the resource management and gut-punch survival of [b]State of Decay[/b]. \n\nThe visuals are slick and the sound design is so heavy it makes these deadites feel genuinely terrifying, right down to their shuffling feet. And here’s the real kicker: this is just Early Access, yet the campaign is already packed with more survival content than most finished AAA titles. You gotta manage your tiny group of survivors, scavenge for parts, and make brutal choices, each one leading to wildly different outcomes. I mean, multiple endings? That’s replay value, baby, and it’s done with serious style. \n\nEvery run feels like a frantic dash for safety; it’s tense, it’s bloody, and it absolutely demands your attention, and remember: stay groovy.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game is seriously good, it gets the vibes perfectly, the despite being in early access it feels like it could be a pretty finished product, movement, combat, sneaking, and exploration all feel pretty solid. \r\n\r\nI'm also a big fan of the dynamic events and moments that occur between survivors, an example being with a the survivors who are romantically involved, when i had one of them die on accident, there was unique dialogue and backstory as his partner survived. \r\n\r\nI recommend this, just keep in mind it's early access, but i feel like it could pass as finished.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I expected nothing less. My first impression of it: Outstanding. \n\nI believe the game has room to grow. The potential is definitely there. I love that it has multiple endings, and the creepy, adrenaline-rush elements hit exactly the way they should, for me at least.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While it has some limitations, it is fun to play if you like zombies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I learned about this game from The Mighty Jingles on YouTube and decided to give it a try. So far I like it a lot and hope they add more content soon as the game is still in \"early access\" atm.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Very easy to get sucked into the game. Atmospheric and gripping mix of exploration, base building and danger. The moment you realise you've wandered into a morgue, you're surrounded by dead bodies and the slightest sound they'll wake up.... help!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm sure the developers are quite fatigued of hearing their game getting compared to “This War of Mine” and while I do see some similarities, I would argue that this game is the spiritual successor to the old flash game series “The Last Stand: Union City” by Con Artist Productions. I had sunken countless hours into Union City on Newgrounds due the fun gameplay and exploration of the city map. To me, it was one of the best Flash games created. Unfortunately, ever since flash was shut down I had always wanted to play a zombie game that brought back the thrill and exploration Union City gave me, but with more mechanical depth than a simple free Flash game.\n Honestly, “Into the Dead: Our Darkest Days” brought me an experience I’ve earned for over a decade. From the massive map with distinct locations, to the different survivors you can encounter, to even base management at different shelters, and the multiple endings each playthrough gives the player, there's a lot that can go on each playthrough. The developers have brought in a ton of entertaining concepts and made them into an enjoyable game. The fact this game is still being developed shows how far they have advanced with their game, especially with the game getting more monthly updates to bring new things for the players.\n\nI don’t expect this review to relate to everybody, however “Into the Dead: Our Darkest Days” fulfilled a zombie survival sidescroller with a ton more depth with a distinct identity that took the best parts from Union city and made it grander. (Oh as a sidenote, unlike in The Last Stand: Union city, you won’t have to brace yourself for a horde of zombies crashing out on top of you from every single ceiling in each building.\n\nTo the developers at PikPok, thank you for the creation of this delightful game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A brilliant, atmospheric survival game. It plays like a zombie version of This War of Mine, focusing on managing scared survivors and making tough choices. The 2D side-scrolling perspective and amazing atmosphere create genuine dread. It's a thoughtful, challenging, and highly unique take on the genre that I absolutely recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Neat setting, neat mechanics, lots of good art! The 'combat' made sense and the zombies were really cool- picking fights felt decently challenging. Some of the situations you come up against kind of have to be solved by trial and error, but with a couple different ways to finish the game, at least you'll get to try them out later if you replay them. Good luck getting out of Walton!\r\n\r\nAny tips I'd give to people who are looking to get into this are (very mild spoilers)\r\n[spoiler]> mind your resources\r\n> not all zombies are the same\r\n> sometimes running away from an encounter is worth it, you can always go back[/spoiler]",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A fantastic game that has captivated me for over 100 hours now — and it doesn’t look like it’s letting go anytime soon. Thanks also to the dedicated developers, who keep improving the game with their regular updates.\n\nThe setting and the character design of the potential party members are outstanding, and the many different locations you visit while escaping the zombie-infested Walton City are beautifully detailed and simply a joy to look at.\n\nIt feels like my very own little zombie horror movie set in a small-town American apocalypse. Even after several runs, every playthrough feels different and full of surprises. Goosebumps and delightfully eerie moments included!\n\nRarely has a game gripped me and touched me emotionally like this one.\n\nHuge compliments to the developers — you’ve created a truly wonderful gaming experience!\n\nI’m really looking forward to seeing how the game develops further (the roadmap looks promising!), with more fresh ideas for resource and base management, new locations, and more interesting survivors with their own little stories.\n\nBut even as it stands, you simply can’t go wrong here — a clear recommendation!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Huge fan of this War of Mine and I am surprised to say this... I think I like this game better, hopefully the devs keep working on this because they got the makings of an amazing game on their hands. Already worth the money!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is pretty bare bones at the moment, and i really detest the infection system being more or less a series of coin flips that decide whether or not your favorite survivor just dies, (R.I.P Hao.. </3) but the loop is just engaging enough and the scenes/level building is actually phenomenal in some locations. If there were perhaps more unique aspects to different survivors (like Hao's completely unique melee combo) and custom dialogue between specific people or npcs id be very into this. But frankly most of these people are extremely flat beyond the value their traits bring to the table. Everyone spits out the same 6 lines in your shelter and reacts to meeting new survivors in all the same ways, once you've seen a scene play out the first time thats it, the novetly is gone, seeing it again in a subsequent playthrough is just mashing left click until you get the yes or no option. Which is a complete shame because the stories they could tell through these characters and places could be so damn cool, but even after beating the game even just one time i can already feel myself being significantly less engaged with exploring the same locations and talking to the same survivors. Also maybe this is actually ONLY limited to one specific ending or escape plan but i gathered a horde of \"Valuable Items\" and never found a way to trade them or anything. If thats the case, why let me pick them up at all? just creates a false pretense that i can find someone willing to trade with me if i keep collecting them. Very odd. Positive review because i think this game could really be something in the future.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Spent eleven hours playing Into the Dead: Our Darkest Days. I must say, I'm enjoying it. Think of This War of Mine, but during a zombie apocalypse. Your choices truly do matter is this one for sure. If you enjoy survival games, based building and zombies; highly recommended.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "What an amazing game. \r\n\r\nJust the right amount of survival without being tedious.\r\nJust the right amount of combat without it just being an action game\r\nJust the right amount of horror to keep you on the edge of your seats\r\nand a whole hell of a lot of content to keep you happy.\r\n\r\nYou could not ask for anything more out of a zombie horror survival game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "You can see how the game is still in early access, zombies sometime can executed throught walls and vice versa, however the immersion and and the story told through the locations of the map create a very great survival gaame with depth and a backstory to each survivors",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I really like this game and I will play it again for sure but I don't know why i felt sleepy when i play it. I played BG3 or many turn base game and i don't feel sleepy at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this war of mine but with zombies. 10/10 great game. You'll need a cheat sheet for easier gameplay, so open your notepad and start writing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game. No private bedrooms, unfortunately.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is honestly one of my favorites compared to all the games that I've played this year! They are consistent with updates and I love how each character has their own quirks and flaws. I am in LOVE with any zombie games/concepts and I love when they added different variants of the zombies. The full military suit zombie? UGH! I was like holy shit! I would've never thought of that! I am so excited for updates to come and when the full release comes out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Other reviews aren't lying, it's basically This War of Mine but with Zombies.\n\nIts gameplay is pretty basic, but if you're into the whole base management, scrounging for supplies and having to take care of characters needs ( morale, food, sleep ) you'll really like it.\n\nI'm still wrapping up my first run, but even on normal difficulty you'll have an abundance of supplies, to the point where you'll be stacked up on food and medicine even with 5 characters in your base. On top of that, there's also no (noteworthy) choice and/or consequence to your actions, except for maybe throwing out party members that you think are infected, or have bad character traits, so there's not a lot of 'urge' to be scanty with your inventory.\n\nCertain levels have some pretty cool hidden areas or environmental components that induce things like a drop of morale or mental issues to your character. That's one of the few mechanics that actually makes a run or playthrough feel more unique, so it can definitely use more of this.\n\nCharacters do have quests tied to them, but they're generally over after visiting 2 or 3 places and clicking through some dialogue. I actually get quite bummed out when a character dies ( no safe system so dead = dead ), but other than these mini quests they don't have any life to them. I think making characters interact more with each other or giving them more personality will definitely help, as right now it's kinda immersion breaking when my sister or partner dies and I only get a 'grief trait' for like 3 days after which I'm fine again lol\n\nLast but not least, it's still really janky. Dying because you messed up is one thing, dying ( and permanently losing a character ) because you wanted to stealth kill a zombie but the game decides you wanted to close a door is just frustrating.\n\nAll and all, very positive first impression. It's stil Early Access of course but if they keep implementing player feedback I can imagine this thing becoming really big in 2026!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I had fun playing this game. I liked the gameplay and format.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a pretty fun game and they come out with updates consistently.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is relay fun and i love how hard the game can be and I love what is coming up next.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun, with combat and tactics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the game and devs for making this game! Sure it has some flaws but nothing is perfect. Besides they're still technically in beta.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "1. Mellow gaming (despite the zombies), with satisfying progress.\n2. Simple crafting which still adds to the enjoyment of the game.\n3. Easy-to-learn movement and combat.\n4. Hopefully, there will be more content in the future as re-playability for the price is a little questionable.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Into the Dead – Darkest Days captures exactly what makes the franchise so addictive: fast tension, a gripping atmosphere, and that constant sense of danger that draws you in from the very first minutes. Visually, the game is impressive, with a dark, moody setting that fits the chaos of survival perfectly. The audio design—from sharp gunfire to the unsettling growls of nearby hordes—pushes the immersion even further.\r\n\r\nThe gameplay strikes a great balance between familiar Into the Dead action and new survival elements. Every run feels strategic and intense, and it’s clear the developers understand what the community values.\r\n\r\nBut… something’s missing\r\n\r\nEven though the foundation is strong, the experience can feel a bit too closed at times. The lack of a more open ending—or a way to naturally continue your progress after key story moments—left me wanting more. Not because the content is lacking, but because the world they created begs to be explored further.\r\n\r\nStill, plenty of confidence\r\n\r\nOf course, this is Early Access, and that’s where the game really shines. Updates are consistent, communication is transparent, and the direction the developers are taking feels promising. The core is already solid, and it’s obvious this project is set to grow, evolve, and expand.\r\n\r\nFinal Verdict\r\n\r\nInto the Dead – Darkest Days is already an impressive entry in the series. It’s atmospheric, thrilling, and full of potential. Yes, I miss an open ending or extended endgame options—but based on the current quality, I’m confident the team will address these areas as development continues.\r\n\r\nA strong start with a very bright future.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "10/10 unique game and developers prize possession",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really love side scrolling games and zombie genre, this is the one! A lot of things to be work out specially on aiming they should just add a cross hair, aiming goes dumb when your trying to run and aim back or if the zombies cornered you.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's like This War of Mine but with zombies.  Not as much depth yet, but it is still good.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Real fun if you like This War of Mine styled games but still lacking content, the scavenging and shelter ''building'' are fun but since you never keep a shelter , never feels like home like TWoM , state of decay and other zombie base scavenging games. Still very much worth playing if you dont mind waiting for future content.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really cool game. Gameplay and difficulty are challenging. It's improving at every update. Keep on going !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like this game and can't wait to see what else gets added.  I play it on my steam deck and it works wonderfully. I like the way everything looks and I'm enjoying that each time I play a new save the characters are a little different.  I messed up badly my very first time playing so I just restarted and noticed that things were slightly different with the people you meet along the way.  So I feel like it's gonna have a lot of replayability just from that!  Keep up the good work!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun, interesting style, and the devs are adding improvements to the game often.  Good balance of action and strategy for me which keeps your pulse up without becoming a button mashing bore.  A must play for anybody into post zombie apocalypse games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Awesome game mechanics.. expect please make ending feels impactfull. The ending i get is so damn boring. It just end like that.. nothing happen.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun (and stressful at times) zombie game to play! It's different to most zombie games I've played but I love it, it is very replayable, each time is so different from the other!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’m genuinely surprised by how well Into the Dead: Our Darkest Days is progressing, considering it’s still in Early Access. In my experience, many Early Access titles tend to stay rough for a long time — sometimes indefinitely — but that’s definitely not the case here. The game already feels solid, and it’s clear that the team is actively developing it and continuously improving the visuals, systems, and overall content.\n\nBugs are rare, and each update shows steady growth in mechanics and features. A very promising project that’s already off to a strong start.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Saw a streamer on Twitch play a few weeks ago and I finally took the plunge to play! Evidious515 really seemed to enjoy it and after buying it I couldn't put it down! After going to bed and going to work, I came right back and was able to get some survivors out of town! I can't wait to go back and try a different route, different folks, and so on! Loved this game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "an extremely rich story, interesting levels and challenge that will keep you going.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game to play and enjoy and relax ! waiting for full version it's full of suprise !",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "At first I really didn't like the game because the combat was too much like This War of Mine and I really didn't relish the idea of playing a weakling in a zombie apocalypse (really isn't the point IMHO).  They turned this thing completely around.   The base building aspect of it is fantastic and impactful, the survivors have real strengths to them that make many critical to your overall efforts, and their loss terrible.  I still hate the repair system, having weapons break constantly is a pain but the events system, they searching for materials, and the purpose your given when escape becomes a possibility really sets this apart from other  zombie apocalypse games.  The coming content makes you want to play through other scenarios, combinations, and search areas of the map you hadn't previously.  I can't recommend this game enough, in a sea of Triple A slop this is an indie that is well worth the money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, I think I beat every single Early Access build so far on a Normal mode while Hard mode whooped my ass lol! Looking forward to Full version and future updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Um jogo muito promissor. Uma This War of Mine de zumbi. Com as novas atualizações vai ficar completo e sem bugs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After multiple restarts trying to optimize my loot and needs. The game absolutely nails the itch I have for the genre it intends to be. It remains lacking in a decent amount of places like on the moral system and playstyle diversity but it has a really good potential to expand on those if done right.\n\nThis type of game would also benefit in more weapon types, loot and potentially factions you can trade with since you get \"luxury loot\" without any use for it as far as I have done within the game.\n\nI want more content more locations and a more expanded end game in the future instead of just a load back before the ending slides are reached but that is just my personal take.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very unique zombie survival game that has a lot to offer. Looking forward to future updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This war of mine but with zombies, it's still in development but the current content is more than 30 hours of gameplay. Highly recommend, one of my fav game this year",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Immersed and unique zombie game. Can't believe Into The Dead went from a mobile game to a full fledged PC game. Great to see the growth.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great way to lose track of time.  A fun wee game and decent value considering it's still early access.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game. Simple concept but  challenging enough without being frustrating. Every play through is different - looking forward to new additions!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game is fun along with its future updates but characters' lore and interaction need depth because every playthrough feels the same - just differs with what ending you'd choose.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A great sidescrolling survival management game. Looking forward for all things being added on the way to full release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most innovative games I've seen this year, you absolutely should give this game a shot.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like the game.  Updates have been good and well thought out.  It's the kind of game you can enjoy for 30 minutes or get lost for 3 hours.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is a really good early access game, think this war of mine, but with zombies. Look forward to more updates on this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm gunna skip past the usual \"This war of mine\" comparison, and get straight into the game.\r\n\r\nI haven't played much yet, so will update as the game goes on, but currently I'm finding its a pretty good game. The traits and survivor skills are pretty well passes out, and work well with the back stories we're given. The design and feel of the game is a side-scroller version of State of Decay, but it also feels more atmospheric, its done a good job of making me attached to the characters already, and I get genuinely upset when I lose someone (usually my own dumb choices)\r\n\r\nI'm excited to see how the game improves as I play, and what updates the devs will make as well.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall fun, however this game desperately needs proper death animations for the player and zombies! it's a side scroller...don't hold back on details. Deadlight did a better job.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The atmosphere and 80's horror feel are tremendous in this game. It's the best Zombie game I've played in years.  There needs to be more content for this game, as you can get things done pretty quickly once you've had a playthrough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The sheer realism and survival mechanics in this game are incredible. The high stakes—where one wrong move spells the end for your character—make it incredibly fun and challenging. This is precisely the type of challenging, high-stakes survivor game I love and seek out.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great retro 80's visuals and stressing ambiance.. perfect for a zombie like game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, immsersive and the sound design and style is very cool, I love zombie games and this is right up there with the best! cant wait for 1.0",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun. If you liked games like This War of Mine, you'll love this. For being an Early Access game it is incredibly deep with lots to do. I cannot even imagine the improvements and new additions we will get along the way. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid game for Early Access.  I think the game looks gorgeous for a zombie game and I love the sun-bleached look of locations during day missions. The zombie animations and the sounds they make add to the creep factor when sneaking around and getting supplies.\r\n\r\nI only played in Easy mode since it is Early Access and wanted to explore the available content.  Good game as it is, especially if you like the zombie genre and enjoy sneaking around to explore locations looking for supplies and other survivors.  I'll come back and try on harder levels on full release for sure.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game that reminds me of \"This War of Mine\". The mechanics are good and so is the art and each location feeling unique. Not only that but the environmental story telling in some locations just makes me sad as you can tell the horrors the people who inhabited or were there had to go through in the final moments.\n\nThe only downside I dont like is the occassional female zombie that is topless so their breasts are seen, that really isnt needed and doesnt add anything to the game besides depravity.\n\nI would hope they remove them or at the least add a setting to put a top on them.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "mantap. still a lot of improvement can be done. but this game is mantaaappppppp~!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Super duper funnnn! But like others say, this game is super stressful uhkkkkkkk.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, great atmosphere but GD does this game keep crashing on me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very punishing but fun. I don't think that the map should be static though, and there are still some glitches and bugs. Hopefully these things will be addressed before the full release",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simplistic, feels very much like This War of Mine, love the scavenging and moving Shelters around to different areas of the City, only complaint is I want more interaction between the survivors, comments, conversations in passing while at base, happy with my purchase. Really leaves you just wanting one more supply run, maybe you'll get that part you need for a upgrade at base, maybe you'll find a new survivor or weapon.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Simply amazing. Looks great, runs smooth, very impressive for early access. A unique take on the This War Of Mine formula, this game brings a new threat of zombies everywhere. Sleepers, walkers, thugs, screamers, jockeys ... they all pose a different threat and strategy to overcome. The world also changes and you must adapt as your journey goes on.\nA plethora of distraction items and weapons to work your way through each level, and time is always on your side because each outing doesnt have a ticking clock like TWOM does. Take your time, patience is key.\nEach survivor brings unique perks, but also backstory and character to your shelter. I had someone infected and turn, evicted someone when I was over housed (which made everyone sad), murdered a survivalist, and met a faction of maybe friendly survivors. \nThere's so far multiple ways to plan your escape of the city, and I've worked through a decent chunk of one and couple of leads of some others. The story is fluid and seamless, and plays out well. \nA perfect balance of long expeditions and base / survivor management, this game has got me gripped and I spent 16hrs in a week before I knew it. Highly recommend even in the Early Access state that it is currently. There's honestly little that I would add or change at this stage and at my progress level.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like this game so much! I finished one ending, and now I'm trying with another ending, and planning to get all the endings. One thing I wish to have in this game is I can get achievements from playing and doing stuff. Hope we will get that on the upcoming update, and  exciting to see more new contents.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has many small to moderate issues. In my experience it's mostly audio (survivor constantly grunting and huffing like he's a zombie himself) and movement bugs. These issues aside, what the game has so far is really fun and I think the vision the developers have is interesting. This game is basically This War of Mine and x Zombies, except early access and very unpolished. What polish there is, its very enjoyable and I recommend picking it up only on sale due to it's current state.\nSide Note: Really fun game on Steam Deck and runs very well at low graphics 60fps",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I did not expect to get as addicted to this game as I did. I am typically not a big fan of the 'side scroller' games but this one scratched a itch I did not know I had. It's super interesting and nerve-wrecking at times and I love the random events that pop up to keep the story and characters more alive. The gameplay is very smooth and way better with a controller. I also appreciate that the devs are pumping out more updates and new additions to this game, it makes me look forward to starting a new save each time!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great you can tell the developers put in a lot of time and effort into this and its only getting better with time. If the developers continue to put as much care and attention into this game it will be something really special. 10/10 would recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game, very enjoyable experience, good value on multiple runs.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "hit the itch for a good zombie game. the bones for this at the moment are great. fingers crossed the devs keep going in the direction they are, and continue to add content. definitely one to keep an eye on",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game and provides a great challenge",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely fantastic game! Far more in-depth and engaging that I thought it would be. Better than half of the zombie games out there!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too many bugs for now, I will change my review once they fix all the issues. First problem is save button (which doesn't exist), you should be able to save before the level, so if you die you can repeat the level. Why do I have to exit to main menu or ALT+F4 each time just to \"restart\" the level. Bad design.\n\nEDIT 10/11/2025: First time a developer answers my comment, which is very cool to know that you guys read the comments. Okay save button is on me, although not sure why its option only for \"Easy\", I play only hard after learning mechanics on normal, I was not even aware of that. \"Custom\" option was sort a visible, but I honestly completely missed it in main screen (I would not separate it and put under hard, I did not think \"custom\" is clickable initially), as I personally did not realize you can do Custom. My one comment immediately is that Custom I understand is medium, so the problem is that I do not know what are the \"hard\" options. I want to choose hard, see what are the options and then just turn on restart ability for perfect level completion for myself (or perhaps you can just add \"restart\" button as choice even after you start playthough). But is hard like all the worst choices in custom or maybe its not? That's the thing I do not know and I do not want to go beyond hard to \"impossible\" or something.\nI also reported quite a few bugs via bug feedback, if someone can have a look and I will try keep doing that. Anyways, overall I like the game, obviously I prefer more content x2 map size and x2 missions, but even in the current stage the game is worth a try and at least several playthroughs.\n\nEDIT 15/11/2025 - a lot of bugs needs fixing",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, love the style of it and gameplay. Hoping for more good updates!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Half way through the game. \r\n-Was exploring a high school, clear most of the rooms stealthly. \r\n-About to bring the loots and GTFO.\r\n-Trying to going through the school gym, saw one zombies roaming ... broke my melee weapon (so can't do one shot sneak attack) and made a mistake ...\r\n-A bunch of zombies came out of nowhere and all i have equipped were 3 bricks ...",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As of early access goes, this is a great start! I love the game and it's mechanics. I'm certain once the full version is released it'll be even better! Whoever is reading this, if you haven't already, try out this game. You won't regret it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing zombie survival game. Runs great on the steam Deck. The games let's you know that mistakes have consequences if not corrected.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, keep telling myself \"oh I'll just play for half an hour\" then it ends up being 2 hours later. There's a good balance between risk and reward that keeps me wanting to do just one more scavenge. Plus the game runs well on my PC. Will definitely play more!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "just getting back into the game after a long time away (pre purchased early access)\r\nSome very nice qol changes and really liking how there is now other people u can come across with stories now to add to your group aswell as the odd dangerous survivor. Really gives me TWD vibes aswell.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Didn’t expect to get this hooked. I enjoy this game so much I completely lost track of time. Dark, intense, and addictive.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun game. Fallout Shelter + State of Decay 2. Lots of locations to explore and loot. One of the few games where choices and combat actually matter. Interested to see where they take it. Lots of potential.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game, with the ability to replay a good amount of times. looking forward to what they will drop in the future for the continuation of the game. absolutely love the aesthetic of the game, and the story, however I wish there was much more lore to go off of. Will be keeping this in my rotation and coming back as they update and add more. as of the time of this review its worth the buy, hands down.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is heavily inspired by This War of mine (I LOVE THAT GAME) so I had to buy this one.\r\n\r\nWish they had achievements added already as I am an achievement enjoyer, but understand it is early access still.\r\n\r\nI am getting familiar with all the characters and keep starting new games since want to save them all. love the graphics and aesthetic, wish there was more to do around the base at the beginning of the game as you basically have to send someone out right away and end the day. Zombies jump scared be couple of times, really love that they are all different and that there are so many locations to explore!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun zombie game ,it really make you think about planing out what you what to do and who to take out on missions. Do you have this one stay at home and cook , sleep , or fortify the barricades at you base.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good Game, Gives good shelter games vibe. Very little bugs but otherwise great game. \r\nThey are updating it regularly so fixes and new features along the way.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Could not tell you the last time I was genuinely so excited for a game! I've adored so much of this, from watching youtube video playthroughs to finally getting able to play it for myself! Have not been disappointed in the slightest- the art and score make the game super immersive and I genuinely enjoy the mechanics and game play. Cannot wait to see what else is in store for this game- 100% worth it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great work on this, devs! Suspenseful and gritty when it comes to keeping people alive and managing your shelter. You can't trust everyone. This game reminds me of \"This War of Mine\", but with zombies and it's wonderful. Just a little bit more polish, and it's perfect. I did escape Walton, but it wasn't clean.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "well...I played it for 7 hours straight so that should tell you its good. my only complaint is that you have to aim the gun before shooting for way too long. if its not a bug, it needs to be fixed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has lots of depth and strategy.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Initial impressions after 3 hours of game play. This game is good. It has that one more turn (salvage run) feel. Plays great on the Steam Deck. Was up till 3am playing.\r\n\r\nIn my opinion there is one major issue, melee weapons durability. It sucks. Getting 2-3 uses out of weapon does not feel good as a player. Especially for knives, when you're doing stealth attacks. They should be getting dull and need sharpening not outright break. Sometimes I feel like game developers learned all the wrong lessons from games like Breath of the Wild and Tears of the Kingdom. Great games but they started this trend of terrible weapons durability.\r\n\r\nI tried downloading a weapon durability mod, but the requirement (MelonLoader) keeps crashing the game, regardless if there is a mod installed or not. The least the developers could do is give us a game option or config file to adjust it ourselves.\r\n\r\nAlthough I do recommend it, if you can stomach the melee weapons durability, I'm giving it a thumb down in hopes the developers see this and make adjustments.",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Kinda bad, and the patches seems to be just making it worse. 2 new games, all new recruits have all broken wrists, and not in a postion to make the splint, or finding them, so they are just a drain on resources. Aggro through doors, or just random. weapon durability is a joke! \n\nNo save features, just autosave at the start of a cycle. Overall the game is just meh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If i could get if a middle thumb I would, its close to really good but too many things just fall short, one of the biggest annoyances is zombies appear to not die off screen. Throw a noise maker it bonces for what ever reason throw a grenade to blow up the zombies attracted to the noise maker.\r\n\r\n...... nothing died. Fantastic, why even try and have that as a combo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game feels very shallow and gets uninteressting fast. Hoped for a bit more after \"This War of Mine\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this is a good game and have very high potential in my opinion but there still a lot of glitch such as\r\n- when you open menus sometime the menus can't be close. \r\n- Some time when you run from zombies the character freeze, can't move and you die \r\n- Some time zombies in the position that you can't hit like it kind of floating on the floors. \r\nThe glitch is not a big of a problem if you don't loose a character when you die but since you're so it's kind of big deal. You can try to wait for them to fix all glitch first. So that you don't get annoy by it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The combat mechanics feel like they were designed by a sadist. Poor combat mechanics in a zombie game is like substituting milk for water when baking a cake. Tastes like nothing except disappointment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "if playing too long, the sound suddenly gone and the game crashed & suddenly exit by itself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somewhere between great and unplayable. It's early access, but the bones of a great game are here. It just needs some more polish if they are going to limit you to one autosave per game. The deep wound mechanic needs some guard rails. What's the point in having characters that always have a deep wound when you recruit them that always kills them regardless of treatment? At least switch it up a little and insta-kill a different character next time. If it's just bad RNG, maybe have a grace period at the start of a new campaign so your first recruit doesn't get picked off right out of the gate. If there is no way to save characters you like, maybe have more likeable ones and fewer throwaways with bad traits.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game just wont save. i put in several hours on a play through and when i quit there was no continue option. i really liked what i played but i cant let myself play it again until this is fixed. such a shame since it would have otherwise got a good review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game looks good, has a great vibe and seems to have very interesting mechanics if you liked this war of mine.\nOverall great potential but man, what a disappointment after actually trying the controls... The characters feel heavy as hell, have the longest animations for everything and feel like everything is soooo slow (even moving to grab a ladder feels like an eternity). This makes the hand to hand combat feel dead, just bashing the attack button and hoping to kill the zombie before it triggers an attack as the dodge move seems to work 10% of the time. Fighting more than 1 enemy is literally impossible, not in a good design way because it's too challenging, but in a \"stun-lock why is my character not moving\" kind of way.\nI won't recommend the game for now because of that but I'll definitely check it out again when it releases fully, hoping they'll have fixed these issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state? No.\nI mean, sure if you want to torture yourself with unfair stuff and such, then go ahead.\n\nThe things that bother me:\n\n-Stealth\nIt's the main focus and it is just so slow, who even cares that ONE character has a stealth skill when it's basically useless.\n(It makes zombies harder to hear when it should've been: \"you stealth walk faster\")\nCan't even tell if a zombie can hear me or not, the moment they do, they are active and aggressive.\nPress the stealth button immediately or alert some zombies, because just walking is loud enough.\n\n-Inventory\nNo wonder when people complain that this is like This War of Mine, because why can't one slot be devided? If I can carry a 4 stack of wood in one slot, then I should be able to carry 2 wood and 2 gears in one slot, but no, they get devided into two.\nYou gotta slow play stealth collecting everything into one spot to get the most out of each run.\n\n-Animations\nYou can't even fast vault in this game, like the main focus of it all is slow stealth, so when shit hits the fan, nah man, gotta leap over this table all quiet like.\nYou can even get stunlocked to death, because you can't control the animations. Getting hit off a ledge, survivor does the \"struggling to get up\" animation, get hit again till death parts that alt f4 button.\nZombies have i-frames to stuns while vaulting, so the moment they are done, they just do their quick attack.\nCan't even decided, to either do a slow execution of a zombie who is downed with weapon durability or the infinite boot. Scratch that. Apparently it doesn't eat durability, but it still eats time.\n\n-Spawning zombies\nWhy? Just why? \nOn some maps, even the ones from the demo, have triggers where if you reached X spot spawn a zombie in Y location and it's the spots where you already walked pass.\nI also got a zombie who crawled under a filing cabinet, so basically clipped through.\nThey can also open cell doors... sliding steel bar doors...\nOne literally spawns in under a car to ambush after retourning the moment you enter a building.\n\n-Zombies\nTheir attacks are so quick. Especially when it stutters, you get hit unjustified and it stutters a lot.\nThey apparently can't go beyond certain points, like I literally couldn't get a zombie to follow me over a construction pit and fall in, rather it stood there, not at the ledge, but even further away just looking at me and waiting for me to be in range to then attack.\nHeavy armored zombie is just invincible to melee, they bleed, but can't be killed? Grenades apparently too? Or they are just T H A T tanky, literally took 8 rounds of rifle ammo to down just one.\n\n-Voice acting\nIt is quite literally the beginning cutscene and that's it.\nI got one ending so far and that also had none.\nNot even the new update of survivor quests.\n\n-Currently, not yet implemented\nThere are trade items and not yet traders, so as of now, \"valuable items\" are completely useless and backpack filler.\nWhy even make the item and put it already in the game, like I looked it up, out of curiosity, only to be met with nothing.\nImagine doing that with the broken guns, adding them in and having no way to repair and use em. It is just an example, but you see my point?\nYou know what is also fucked up, an event that automatically solves itself where I had to exchange a water bottle for a watch.\n\n-Environment\nThe camera isn't exactly 2d, so when approaching an open door your sight is blocked off, because of the camera pan, but the zombies can see you and your character should then also be able to see them.\nThere should be that white outline effect.\nCrashing through doors only damages your health and is loud, it doesn't stun zombies to the ground and even roofs that are collapsing on zombies don't kill.\nRoofs are inconsistent, like some crash when running, but then there are also that break by stealth walking without any creaking noise.\n\n-No replayability\nEverytime you start a new game, you have to put one into scavenging and the other one sleeps, every, single, time.\nGive me upgrades for stealth play and aggressive play.\n\n-Tips\n\"Run past zombies when overwhelmed\" well 9/10 times you get grabbed and zombies can easily catch up and not only damage you, but also kill you or to the point where it's up to chance.\n\n-Guilt\nThat one modifier for killing people, even for bad people you are feeling guilt for or people that started to kill you first or you find out later that they done some shit.\n\n-Inventory\nCan't drag and drop. No slot for weapons and ammo doesn't stay loaded in the gun, but rather in the inventory.\n\n-Weapon switching\nGotta access the inventory and select the weapon in tense situations when a small and large weapon would be great.\n\n-Survivors\nThere is one survivor that can be recruited at a car shop, after recruiting he says goodbye to his collection, but you still can't get in there, not after he joined or when he himself is there being controlled by you.\nOh wait, it's a \"curveball\" where he forgot that he has stuff in there... and doesn't even remember when he is there standing in front of the door... on both sides... also it's random and I literally have not gotten it.\nMost of them are also almost completely useless, other than a another pair hands, like having a \"small chance to evade an attack\" is supposed to good? with status effects like deep wound???\n\n-Deep Wound\nIs the gamble effect that you can even get over 50 % health, like there is a chance to get deep wound before the normal standard wound and it doesn't even matter what you do, it is up to chance if the character goes bye bye or lives.\nI got one character through at their lowest and lost one at their highest, it seems to not matter.\nOh and that bs description \"Healing is less effective. Lose Health every phase. IF (\"if\") Infected, the survivor may turn\" there is no \"if\" in \"you\", even if you heal in that very scavenging phase with a bandage it still gambles.\nI got it at full health on the first hit of a zombie... just wow.\n\n-Airdrops\nThey get mentioned, but not marked on the map.\n\n-Traits\nThere are duplicate traits that do exactly the same thing, just under a different name.\nThey are going to claim something like: \"we have over 'X' traits, just look at all that effort\".\n\n-Flashlight\nHold RMB... for light... instead of pressing F and that's it.\n\n-Ladders\nCan't peak over them, you are commited to climb up and rng that you get the cycle right.\n\n-Weapons\nSome can do multi hit, some can't, please point out what can hit single, multiple or pierce.\n\n-Cleaver like weapons\nThe cleaver literally misses the second combo attack and in turn getting immediately hit.\n\n-Getting put in lose situations\nFirestation no.8, like what were they thinking???\nOn the roof, far right, can spawn a cracked zombie that immediately spots you and runs back and forth really fast, can't backtrack, because you had to drop down, and so the only way out is to go down, take damage, cus slow climb animation and kill the zombie.\nWhat happens next is ridiculous: the room to drop down and get out has a screaming zombie when spotted and it was apparently the only one out of the two who heard the fight on the roof, can't take out the zombie, because I would get sandwiched from both sides, cus noise, and letting it scream was basically the \"safest\" dead end solution.\nMight be skill issue, but I would say test issue.\nEscape plan to the hospital roof: has 2 zombies beyond a gap which you could jump to, but even a standing jump is too loud and even a running jump results in the same long climbing animation, so the zombies are happy to stunlock you till death.\nThe moment you jump, it's already over.\n\n\nThe only reason I got it, is because I thought 20 bucks were reasonable and not 25, so get it now, for being in a country that suddenly, obviously, desperately needs a fucking age rating on games, because that is so important in todays age, not climate change or world peace.\nOr just get it later.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I understand this is a difference Into the Dead but I felt like something was missing then I realized\nWHERE IS MY DOG!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Middle mouse button is a default key and there is no option to rebind it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ดfull of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initial impressions after 3 hours of game play. This game is good. It has that one more turn (salvage run) feel. Plays great on the Steam Deck. Was up till 3am playing.\r\n\r\nIn my opinion there is one major issue, melee weapons durability. It sucks. Getting 2-3 uses out of weapon does not feel good as a player. Especially for knives, when you're doing stealth attacks. They should be getting dull and need sharpening not outright break. Sometimes I feel like game developers learned all the wrong lessons from games like Breath of the Wild and Tears of the Kingdom. Great games but they started this trend of terrible weapons durability.\r\n\r\nI tried downloading a weapon durability mod, but the requirement (MelonLoader) keeps crashing the game, regardless if there is a mod installed or not. The least the developers could do is give us a game option or config file to adjust it ourselves.\r\n\r\nAlthough I do recommend it, if you can stomach the melee weapons durability, I'm giving it a thumb down in hopes the developers see this and make adjustments.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Game is fairly fun, but feels very much like a mobile game. Clunky combat and mechanics make for a sometimes frustrating play-through. I went around looking for characters to see if there really was any \"Story\" and no, its basically a 1-page premise with very little or believable dialogues. The visual design is interesting but other than that does not affect the story in any significant way. Crafting is VERY limited and gets boring quickly. You end up caring so little for the characters you might as well use them as sacrificial pawns to learn a location before attempting it with a character that's actually any good. Since I doubt the story telling will get any better i'm dropping it for now and might look at it again once its out of EA.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "This game plays very similarly to 'This War of Mine'. Except with less gameplay options, clunkier controls and added zombies. Not bad, but in its current state it feels very 'bare-bones'. Maybe I'll try it again once it's out of early access.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I think I'm just tired of devs slapping DLSS on an unoptimized release without any graphic settings so your GPU somehow hits 80C at the MAIN MENU",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Potential to be fun, especially with the 2D sidescrolling, but at the moment there's nothing keeping me here. Gameplay quickly becomes tedious and base management is all stress, no joy.  \n\nVery little reason to play this when there's State of Decay 2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Kinda bad, and the patches seems to be just making it worse. 2 new games, all new recruits have all broken wrists, and not in a postion to make the splint, or finding them, so they are just a drain on resources. Aggro through doors, or just random. weapon durability is a joke! \n\nNo save features, just autosave at the start of a cycle. Overall the game is just meh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "clanky combat mechanic should have focus on quality of life as a survival game, maybe port it into smartphone is better because such effort shouldn't gone to waste but also game quality still not on pc standard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If i could get if a middle thumb I would, its close to really good but too many things just fall short, one of the biggest annoyances is zombies appear to not die off screen. Throw a noise maker it bonces for what ever reason throw a grenade to blow up the zombies attracted to the noise maker.\r\n\r\n...... nothing died. Fantastic, why even try and have that as a combo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game feels very shallow and gets uninteressting fast. Hoped for a bit more after \"This War of Mine\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this is a good game and have very high potential in my opinion but there still a lot of glitch such as\r\n- when you open menus sometime the menus can't be close. \r\n- Some time when you run from zombies the character freeze, can't move and you die \r\n- Some time zombies in the position that you can't hit like it kind of floating on the floors. \r\nThe glitch is not a big of a problem if you don't loose a character when you die but since you're so it's kind of big deal. You can try to wait for them to fix all glitch first. So that you don't get annoy by it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The combat mechanics feel like they were designed by a sadist. Poor combat mechanics in a zombie game is like substituting milk for water when baking a cake. Tastes like nothing except disappointment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "if playing too long, the sound suddenly gone and the game crashed & suddenly exit by itself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somewhere between great and unplayable. It's early access, but the bones of a great game are here. It just needs some more polish if they are going to limit you to one autosave per game. The deep wound mechanic needs some guard rails. What's the point in having characters that always have a deep wound when you recruit them that always kills them regardless of treatment? At least switch it up a little and insta-kill a different character next time. If it's just bad RNG, maybe have a grace period at the start of a new campaign so your first recruit doesn't get picked off right out of the gate. If there is no way to save characters you like, maybe have more likeable ones and fewer throwaways with bad traits.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game just wont save. i put in several hours on a play through and when i quit there was no continue option. i really liked what i played but i cant let myself play it again until this is fixed. such a shame since it would have otherwise got a good review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game looks good, has a great vibe and seems to have very interesting mechanics if you liked this war of mine.\nOverall great potential but man, what a disappointment after actually trying the controls... The characters feel heavy as hell, have the longest animations for everything and feel like everything is soooo slow (even moving to grab a ladder feels like an eternity). This makes the hand to hand combat feel dead, just bashing the attack button and hoping to kill the zombie before it triggers an attack as the dodge move seems to work 10% of the time. Fighting more than 1 enemy is literally impossible, not in a good design way because it's too challenging, but in a \"stun-lock why is my character not moving\" kind of way.\nI won't recommend the game for now because of that but I'll definitely check it out again when it releases fully, hoping they'll have fixed these issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state? No.\nI mean, sure if you want to torture yourself with unfair stuff and such, then go ahead.\n\nThe things that bother me:\n\n-Stealth\nIt's the main focus and it is just so slow, who even cares that ONE character has a stealth skill when it's basically useless.\n(It makes zombies harder to hear when it should've been: \"you stealth walk faster\")\nCan't even tell if a zombie can hear me or not, the moment they do, they are active and aggressive.\nPress the stealth button immediately or alert some zombies, because just walking is loud enough.\n\n-Inventory\nNo wonder when people complain that this is like This War of Mine, because why can't one slot be devided? If I can carry a 4 stack of wood in one slot, then I should be able to carry 2 wood and 2 gears in one slot, but no, they get devided into two.\nYou gotta slow play stealth collecting everything into one spot to get the most out of each run.\n\n-Animations\nYou can't even fast vault in this game, like the main focus of it all is slow stealth, so when shit hits the fan, nah man, gotta leap over this table all quiet like.\nYou can even get stunlocked to death, because you can't control the animations. Getting hit off a ledge, survivor does the \"struggling to get up\" animation, get hit again till death parts that alt f4 button.\nZombies have i-frames to stuns while vaulting, so the moment they are done, they just do their quick attack.\nCan't even decided, to either do a slow execution of a zombie who is downed with weapon durability or the infinite boot. Scratch that. Apparently it doesn't eat durability, but it still eats time.\n\n-Spawning zombies\nWhy? Just why? \nOn some maps, even the ones from the demo, have triggers where if you reached X spot spawn a zombie in Y location and it's the spots where you already walked pass.\nI also got a zombie who crawled under a filing cabinet, so basically clipped through.\nThey can also open cell doors... sliding steel bar doors...\nOne literally spawns in under a car to ambush after retourning the moment you enter a building.\n\n-Zombies\nTheir attacks are so quick. Especially when it stutters, you get hit unjustified and it stutters a lot.\nThey apparently can't go beyond certain points, like I literally couldn't get a zombie to follow me over a construction pit and fall in, rather it stood there, not at the ledge, but even further away just looking at me and waiting for me to be in range to then attack.\nHeavy armored zombie is just invincible to melee, they bleed, but can't be killed? Grenades apparently too? Or they are just T H A T tanky, literally took 8 rounds of rifle ammo to down just one.\n\n-Voice acting\nIt is quite literally the beginning cutscene and that's it.\nI got one ending so far and that also had none.\nNot even the new update of survivor quests.\n\n-Currently, not yet implemented\nThere are trade items and not yet traders, so as of now, \"valuable items\" are completely useless and backpack filler.\nWhy even make the item and put it already in the game, like I looked it up, out of curiosity, only to be met with nothing.\nImagine doing that with the broken guns, adding them in and having no way to repair and use em. It is just an example, but you see my point?\nYou know what is also fucked up, an event that automatically solves itself where I had to exchange a water bottle for a watch.\n\n-Environment\nThe camera isn't exactly 2d, so when approaching an open door your sight is blocked off, because of the camera pan, but the zombies can see you and your character should then also be able to see them.\nThere should be that white outline effect.\nCrashing through doors only damages your health and is loud, it doesn't stun zombies to the ground and even roofs that are collapsing on zombies don't kill.\nRoofs are inconsistent, like some crash when running, but then there are also that break by stealth walking without any creaking noise.\n\n-No replayability\nEverytime you start a new game, you have to put one into scavenging and the other one sleeps, every, single, time.\nGive me upgrades for stealth play and aggressive play.\n\n-Tips\n\"Run past zombies when overwhelmed\" well 9/10 times you get grabbed and zombies can easily catch up and not only damage you, but also kill you or to the point where it's up to chance.\n\n-Guilt\nThat one modifier for killing people, even for bad people you are feeling guilt for or people that started to kill you first or you find out later that they done some shit.\n\n-Inventory\nCan't drag and drop. No slot for weapons and ammo doesn't stay loaded in the gun, but rather in the inventory.\n\n-Weapon switching\nGotta access the inventory and select the weapon in tense situations when a small and large weapon would be great.\n\n-Survivors\nThere is one survivor that can be recruited at a car shop, after recruiting he says goodbye to his collection, but you still can't get in there, not after he joined or when he himself is there being controlled by you.\nOh wait, it's a \"curveball\" where he forgot that he has stuff in there... and doesn't even remember when he is there standing in front of the door... on both sides... also it's random and I literally have not gotten it.\nMost of them are also almost completely useless, other than a another pair hands, like having a \"small chance to evade an attack\" is supposed to good? with status effects like deep wound???\n\n-Deep Wound\nIs the gamble effect that you can even get over 50 % health, like there is a chance to get deep wound before the normal standard wound and it doesn't even matter what you do, it is up to chance if the character goes bye bye or lives.\nI got one character through at their lowest and lost one at their highest, it seems to not matter.\nOh and that bs description \"Healing is less effective. Lose Health every phase. IF (\"if\") Infected, the survivor may turn\" there is no \"if\" in \"you\", even if you heal in that very scavenging phase with a bandage it still gambles.\nI got it at full health on the first hit of a zombie... just wow.\n\n-Airdrops\nThey get mentioned, but not marked on the map.\n\n-Traits\nThere are duplicate traits that do exactly the same thing, just under a different name.\nThey are going to claim something like: \"we have over 'X' traits, just look at all that effort\".\n\n-Flashlight\nHold RMB... for light... instead of pressing F and that's it.\n\n-Ladders\nCan't peak over them, you are commited to climb up and rng that you get the cycle right.\n\n-Weapons\nSome can do multi hit, some can't, please point out what can hit single, multiple or pierce.\n\n-Cleaver like weapons\nThe cleaver literally misses the second combo attack and in turn getting immediately hit.\n\n-Getting put in lose situations\nFirestation no.8, like what were they thinking???\nOn the roof, far right, can spawn a cracked zombie that immediately spots you and runs back and forth really fast, can't backtrack, because you had to drop down, and so the only way out is to go down, take damage, cus slow climb animation and kill the zombie.\nWhat happens next is ridiculous: the room to drop down and get out has a screaming zombie when spotted and it was apparently the only one out of the two who heard the fight on the roof, can't take out the zombie, because I would get sandwiched from both sides, cus noise, and letting it scream was basically the \"safest\" dead end solution.\nMight be skill issue, but I would say test issue.\nEscape plan to the hospital roof: has 2 zombies beyond a gap which you could jump to, but even a standing jump is too loud and even a running jump results in the same long climbing animation, so the zombies are happy to stunlock you till death.\nThe moment you jump, it's already over.\n\n\nThe only reason I got it, is because I thought 20 bucks were reasonable and not 25, so get it now, for being in a country that suddenly, obviously, desperately needs a fucking age rating on games, because that is so important in todays age, not climate change or world peace.\nOr just get it later.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I understand this is a difference Into the Dead but I felt like something was missing then I realized\nWHERE IS MY DOG!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Middle mouse button is a default key and there is no option to rebind it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ดfull of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initial impressions after 3 hours of game play. This game is good. It has that one more turn (salvage run) feel. Plays great on the Steam Deck. Was up till 3am playing.\r\n\r\nIn my opinion there is one major issue, melee weapons durability. It sucks. Getting 2-3 uses out of weapon does not feel good as a player. Especially for knives, when you're doing stealth attacks. They should be getting dull and need sharpening not outright break. Sometimes I feel like game developers learned all the wrong lessons from games like Breath of the Wild and Tears of the Kingdom. Great games but they started this trend of terrible weapons durability.\r\n\r\nI tried downloading a weapon durability mod, but the requirement (MelonLoader) keeps crashing the game, regardless if there is a mod installed or not. The least the developers could do is give us a game option or config file to adjust it ourselves.\r\n\r\nAlthough I do recommend it, if you can stomach the melee weapons durability, I'm giving it a thumb down in hopes the developers see this and make adjustments.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Game is fairly fun, but feels very much like a mobile game. Clunky combat and mechanics make for a sometimes frustrating play-through. I went around looking for characters to see if there really was any \"Story\" and no, its basically a 1-page premise with very little or believable dialogues. The visual design is interesting but other than that does not affect the story in any significant way. Crafting is VERY limited and gets boring quickly. You end up caring so little for the characters you might as well use them as sacrificial pawns to learn a location before attempting it with a character that's actually any good. Since I doubt the story telling will get any better i'm dropping it for now and might look at it again once its out of EA.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "This game plays very similarly to 'This War of Mine'. Except with less gameplay options, clunkier controls and added zombies. Not bad, but in its current state it feels very 'bare-bones'. Maybe I'll try it again once it's out of early access.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I think I'm just tired of devs slapping DLSS on an unoptimized release without any graphic settings so your GPU somehow hits 80C at the MAIN MENU",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Potential to be fun, especially with the 2D sidescrolling, but at the moment there's nothing keeping me here. Gameplay quickly becomes tedious and base management is all stress, no joy.  \n\nVery little reason to play this when there's State of Decay 2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Kinda bad, and the patches seems to be just making it worse. 2 new games, all new recruits have all broken wrists, and not in a postion to make the splint, or finding them, so they are just a drain on resources. Aggro through doors, or just random. weapon durability is a joke! \n\nNo save features, just autosave at the start of a cycle. Overall the game is just meh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "clanky combat mechanic should have focus on quality of life as a survival game, maybe port it into smartphone is better because such effort shouldn't gone to waste but also game quality still not on pc standard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If i could get if a middle thumb I would, its close to really good but too many things just fall short, one of the biggest annoyances is zombies appear to not die off screen. Throw a noise maker it bonces for what ever reason throw a grenade to blow up the zombies attracted to the noise maker.\r\n\r\n...... nothing died. Fantastic, why even try and have that as a combo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game feels very shallow and gets uninteressting fast. Hoped for a bit more after \"This War of Mine\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this is a good game and have very high potential in my opinion but there still a lot of glitch such as\r\n- when you open menus sometime the menus can't be close. \r\n- Some time when you run from zombies the character freeze, can't move and you die \r\n- Some time zombies in the position that you can't hit like it kind of floating on the floors. \r\nThe glitch is not a big of a problem if you don't loose a character when you die but since you're so it's kind of big deal. You can try to wait for them to fix all glitch first. So that you don't get annoy by it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The combat mechanics feel like they were designed by a sadist. Poor combat mechanics in a zombie game is like substituting milk for water when baking a cake. Tastes like nothing except disappointment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "if playing too long, the sound suddenly gone and the game crashed & suddenly exit by itself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somewhere between great and unplayable. It's early access, but the bones of a great game are here. It just needs some more polish if they are going to limit you to one autosave per game. The deep wound mechanic needs some guard rails. What's the point in having characters that always have a deep wound when you recruit them that always kills them regardless of treatment? At least switch it up a little and insta-kill a different character next time. If it's just bad RNG, maybe have a grace period at the start of a new campaign so your first recruit doesn't get picked off right out of the gate. If there is no way to save characters you like, maybe have more likeable ones and fewer throwaways with bad traits.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game just wont save. i put in several hours on a play through and when i quit there was no continue option. i really liked what i played but i cant let myself play it again until this is fixed. such a shame since it would have otherwise got a good review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game looks good, has a great vibe and seems to have very interesting mechanics if you liked this war of mine.\nOverall great potential but man, what a disappointment after actually trying the controls... The characters feel heavy as hell, have the longest animations for everything and feel like everything is soooo slow (even moving to grab a ladder feels like an eternity). This makes the hand to hand combat feel dead, just bashing the attack button and hoping to kill the zombie before it triggers an attack as the dodge move seems to work 10% of the time. Fighting more than 1 enemy is literally impossible, not in a good design way because it's too challenging, but in a \"stun-lock why is my character not moving\" kind of way.\nI won't recommend the game for now because of that but I'll definitely check it out again when it releases fully, hoping they'll have fixed these issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state? No.\nI mean, sure if you want to torture yourself with unfair stuff and such, then go ahead.\n\nThe things that bother me:\n\n-Stealth\nIt's the main focus and it is just so slow, who even cares that ONE character has a stealth skill when it's basically useless.\n(It makes zombies harder to hear when it should've been: \"you stealth walk faster\")\nCan't even tell if a zombie can hear me or not, the moment they do, they are active and aggressive.\nPress the stealth button immediately or alert some zombies, because just walking is loud enough.\n\n-Inventory\nNo wonder when people complain that this is like This War of Mine, because why can't one slot be devided? If I can carry a 4 stack of wood in one slot, then I should be able to carry 2 wood and 2 gears in one slot, but no, they get devided into two.\nYou gotta slow play stealth collecting everything into one spot to get the most out of each run.\n\n-Animations\nYou can't even fast vault in this game, like the main focus of it all is slow stealth, so when shit hits the fan, nah man, gotta leap over this table all quiet like.\nYou can even get stunlocked to death, because you can't control the animations. Getting hit off a ledge, survivor does the \"struggling to get up\" animation, get hit again till death parts that alt f4 button.\nZombies have i-frames to stuns while vaulting, so the moment they are done, they just do their quick attack.\nCan't even decided, to either do a slow execution of a zombie who is downed with weapon durability or the infinite boot. Scratch that. Apparently it doesn't eat durability, but it still eats time.\n\n-Spawning zombies\nWhy? Just why? \nOn some maps, even the ones from the demo, have triggers where if you reached X spot spawn a zombie in Y location and it's the spots where you already walked pass.\nI also got a zombie who crawled under a filing cabinet, so basically clipped through.\nThey can also open cell doors... sliding steel bar doors...\nOne literally spawns in under a car to ambush after retourning the moment you enter a building.\n\n-Zombies\nTheir attacks are so quick. Especially when it stutters, you get hit unjustified and it stutters a lot.\nThey apparently can't go beyond certain points, like I literally couldn't get a zombie to follow me over a construction pit and fall in, rather it stood there, not at the ledge, but even further away just looking at me and waiting for me to be in range to then attack.\nHeavy armored zombie is just invincible to melee, they bleed, but can't be killed? Grenades apparently too? Or they are just T H A T tanky, literally took 8 rounds of rifle ammo to down just one.\n\n-Voice acting\nIt is quite literally the beginning cutscene and that's it.\nI got one ending so far and that also had none.\nNot even the new update of survivor quests.\n\n-Currently, not yet implemented\nThere are trade items and not yet traders, so as of now, \"valuable items\" are completely useless and backpack filler.\nWhy even make the item and put it already in the game, like I looked it up, out of curiosity, only to be met with nothing.\nImagine doing that with the broken guns, adding them in and having no way to repair and use em. It is just an example, but you see my point?\nYou know what is also fucked up, an event that automatically solves itself where I had to exchange a water bottle for a watch.\n\n-Environment\nThe camera isn't exactly 2d, so when approaching an open door your sight is blocked off, because of the camera pan, but the zombies can see you and your character should then also be able to see them.\nThere should be that white outline effect.\nCrashing through doors only damages your health and is loud, it doesn't stun zombies to the ground and even roofs that are collapsing on zombies don't kill.\nRoofs are inconsistent, like some crash when running, but then there are also that break by stealth walking without any creaking noise.\n\n-No replayability\nEverytime you start a new game, you have to put one into scavenging and the other one sleeps, every, single, time.\nGive me upgrades for stealth play and aggressive play.\n\n-Tips\n\"Run past zombies when overwhelmed\" well 9/10 times you get grabbed and zombies can easily catch up and not only damage you, but also kill you or to the point where it's up to chance.\n\n-Guilt\nThat one modifier for killing people, even for bad people you are feeling guilt for or people that started to kill you first or you find out later that they done some shit.\n\n-Inventory\nCan't drag and drop. No slot for weapons and ammo doesn't stay loaded in the gun, but rather in the inventory.\n\n-Weapon switching\nGotta access the inventory and select the weapon in tense situations when a small and large weapon would be great.\n\n-Survivors\nThere is one survivor that can be recruited at a car shop, after recruiting he says goodbye to his collection, but you still can't get in there, not after he joined or when he himself is there being controlled by you.\nOh wait, it's a \"curveball\" where he forgot that he has stuff in there... and doesn't even remember when he is there standing in front of the door... on both sides... also it's random and I literally have not gotten it.\nMost of them are also almost completely useless, other than a another pair hands, like having a \"small chance to evade an attack\" is supposed to good? with status effects like deep wound???\n\n-Deep Wound\nIs the gamble effect that you can even get over 50 % health, like there is a chance to get deep wound before the normal standard wound and it doesn't even matter what you do, it is up to chance if the character goes bye bye or lives.\nI got one character through at their lowest and lost one at their highest, it seems to not matter.\nOh and that bs description \"Healing is less effective. Lose Health every phase. IF (\"if\") Infected, the survivor may turn\" there is no \"if\" in \"you\", even if you heal in that very scavenging phase with a bandage it still gambles.\nI got it at full health on the first hit of a zombie... just wow.\n\n-Airdrops\nThey get mentioned, but not marked on the map.\n\n-Traits\nThere are duplicate traits that do exactly the same thing, just under a different name.\nThey are going to claim something like: \"we have over 'X' traits, just look at all that effort\".\n\n-Flashlight\nHold RMB... for light... instead of pressing F and that's it.\n\n-Ladders\nCan't peak over them, you are commited to climb up and rng that you get the cycle right.\n\n-Weapons\nSome can do multi hit, some can't, please point out what can hit single, multiple or pierce.\n\n-Cleaver like weapons\nThe cleaver literally misses the second combo attack and in turn getting immediately hit.\n\n-Getting put in lose situations\nFirestation no.8, like what were they thinking???\nOn the roof, far right, can spawn a cracked zombie that immediately spots you and runs back and forth really fast, can't backtrack, because you had to drop down, and so the only way out is to go down, take damage, cus slow climb animation and kill the zombie.\nWhat happens next is ridiculous: the room to drop down and get out has a screaming zombie when spotted and it was apparently the only one out of the two who heard the fight on the roof, can't take out the zombie, because I would get sandwiched from both sides, cus noise, and letting it scream was basically the \"safest\" dead end solution.\nMight be skill issue, but I would say test issue.\nEscape plan to the hospital roof: has 2 zombies beyond a gap which you could jump to, but even a standing jump is too loud and even a running jump results in the same long climbing animation, so the zombies are happy to stunlock you till death.\nThe moment you jump, it's already over.\n\n\nThe only reason I got it, is because I thought 20 bucks were reasonable and not 25, so get it now, for being in a country that suddenly, obviously, desperately needs a fucking age rating on games, because that is so important in todays age, not climate change or world peace.\nOr just get it later.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I understand this is a difference Into the Dead but I felt like something was missing then I realized\nWHERE IS MY DOG!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Middle mouse button is a default key and there is no option to rebind it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ดfull of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initial impressions after 3 hours of game play. This game is good. It has that one more turn (salvage run) feel. Plays great on the Steam Deck. Was up till 3am playing.\r\n\r\nIn my opinion there is one major issue, melee weapons durability. It sucks. Getting 2-3 uses out of weapon does not feel good as a player. Especially for knives, when you're doing stealth attacks. They should be getting dull and need sharpening not outright break. Sometimes I feel like game developers learned all the wrong lessons from games like Breath of the Wild and Tears of the Kingdom. Great games but they started this trend of terrible weapons durability.\r\n\r\nI tried downloading a weapon durability mod, but the requirement (MelonLoader) keeps crashing the game, regardless if there is a mod installed or not. The least the developers could do is give us a game option or config file to adjust it ourselves.\r\n\r\nAlthough I do recommend it, if you can stomach the melee weapons durability, I'm giving it a thumb down in hopes the developers see this and make adjustments.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Game is fairly fun, but feels very much like a mobile game. Clunky combat and mechanics make for a sometimes frustrating play-through. I went around looking for characters to see if there really was any \"Story\" and no, its basically a 1-page premise with very little or believable dialogues. The visual design is interesting but other than that does not affect the story in any significant way. Crafting is VERY limited and gets boring quickly. You end up caring so little for the characters you might as well use them as sacrificial pawns to learn a location before attempting it with a character that's actually any good. Since I doubt the story telling will get any better i'm dropping it for now and might look at it again once its out of EA.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "This game plays very similarly to 'This War of Mine'. Except with less gameplay options, clunkier controls and added zombies. Not bad, but in its current state it feels very 'bare-bones'. Maybe I'll try it again once it's out of early access.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I think I'm just tired of devs slapping DLSS on an unoptimized release without any graphic settings so your GPU somehow hits 80C at the MAIN MENU",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Potential to be fun, especially with the 2D sidescrolling, but at the moment there's nothing keeping me here. Gameplay quickly becomes tedious and base management is all stress, no joy.  \n\nVery little reason to play this when there's State of Decay 2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Kinda bad, and the patches seems to be just making it worse. 2 new games, all new recruits have all broken wrists, and not in a postion to make the splint, or finding them, so they are just a drain on resources. Aggro through doors, or just random. weapon durability is a joke! \n\nNo save features, just autosave at the start of a cycle. Overall the game is just meh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "clanky combat mechanic should have focus on quality of life as a survival game, maybe port it into smartphone is better because such effort shouldn't gone to waste but also game quality still not on pc standard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If i could get if a middle thumb I would, its close to really good but too many things just fall short, one of the biggest annoyances is zombies appear to not die off screen. Throw a noise maker it bonces for what ever reason throw a grenade to blow up the zombies attracted to the noise maker.\r\n\r\n...... nothing died. Fantastic, why even try and have that as a combo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game feels very shallow and gets uninteressting fast. Hoped for a bit more after \"This War of Mine\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this is a good game and have very high potential in my opinion but there still a lot of glitch such as\r\n- when you open menus sometime the menus can't be close. \r\n- Some time when you run from zombies the character freeze, can't move and you die \r\n- Some time zombies in the position that you can't hit like it kind of floating on the floors. \r\nThe glitch is not a big of a problem if you don't loose a character when you die but since you're so it's kind of big deal. You can try to wait for them to fix all glitch first. So that you don't get annoy by it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The combat mechanics feel like they were designed by a sadist. Poor combat mechanics in a zombie game is like substituting milk for water when baking a cake. Tastes like nothing except disappointment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "if playing too long, the sound suddenly gone and the game crashed & suddenly exit by itself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somewhere between great and unplayable. It's early access, but the bones of a great game are here. It just needs some more polish if they are going to limit you to one autosave per game. The deep wound mechanic needs some guard rails. What's the point in having characters that always have a deep wound when you recruit them that always kills them regardless of treatment? At least switch it up a little and insta-kill a different character next time. If it's just bad RNG, maybe have a grace period at the start of a new campaign so your first recruit doesn't get picked off right out of the gate. If there is no way to save characters you like, maybe have more likeable ones and fewer throwaways with bad traits.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game just wont save. i put in several hours on a play through and when i quit there was no continue option. i really liked what i played but i cant let myself play it again until this is fixed. such a shame since it would have otherwise got a good review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game looks good, has a great vibe and seems to have very interesting mechanics if you liked this war of mine.\nOverall great potential but man, what a disappointment after actually trying the controls... The characters feel heavy as hell, have the longest animations for everything and feel like everything is soooo slow (even moving to grab a ladder feels like an eternity). This makes the hand to hand combat feel dead, just bashing the attack button and hoping to kill the zombie before it triggers an attack as the dodge move seems to work 10% of the time. Fighting more than 1 enemy is literally impossible, not in a good design way because it's too challenging, but in a \"stun-lock why is my character not moving\" kind of way.\nI won't recommend the game for now because of that but I'll definitely check it out again when it releases fully, hoping they'll have fixed these issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state? No.\nI mean, sure if you want to torture yourself with unfair stuff and such, then go ahead.\n\nThe things that bother me:\n\n-Stealth\nIt's the main focus and it is just so slow, who even cares that ONE character has a stealth skill when it's basically useless.\n(It makes zombies harder to hear when it should've been: \"you stealth walk faster\")\nCan't even tell if a zombie can hear me or not, the moment they do, they are active and aggressive.\nPress the stealth button immediately or alert some zombies, because just walking is loud enough.\n\n-Inventory\nNo wonder when people complain that this is like This War of Mine, because why can't one slot be devided? If I can carry a 4 stack of wood in one slot, then I should be able to carry 2 wood and 2 gears in one slot, but no, they get devided into two.\nYou gotta slow play stealth collecting everything into one spot to get the most out of each run.\n\n-Animations\nYou can't even fast vault in this game, like the main focus of it all is slow stealth, so when shit hits the fan, nah man, gotta leap over this table all quiet like.\nYou can even get stunlocked to death, because you can't control the animations. Getting hit off a ledge, survivor does the \"struggling to get up\" animation, get hit again till death parts that alt f4 button.\nZombies have i-frames to stuns while vaulting, so the moment they are done, they just do their quick attack.\nCan't even decided, to either do a slow execution of a zombie who is downed with weapon durability or the infinite boot. Scratch that. Apparently it doesn't eat durability, but it still eats time.\n\n-Spawning zombies\nWhy? Just why? \nOn some maps, even the ones from the demo, have triggers where if you reached X spot spawn a zombie in Y location and it's the spots where you already walked pass.\nI also got a zombie who crawled under a filing cabinet, so basically clipped through.\nThey can also open cell doors... sliding steel bar doors...\nOne literally spawns in under a car to ambush after retourning the moment you enter a building.\n\n-Zombies\nTheir attacks are so quick. Especially when it stutters, you get hit unjustified and it stutters a lot.\nThey apparently can't go beyond certain points, like I literally couldn't get a zombie to follow me over a construction pit and fall in, rather it stood there, not at the ledge, but even further away just looking at me and waiting for me to be in range to then attack.\nHeavy armored zombie is just invincible to melee, they bleed, but can't be killed? Grenades apparently too? Or they are just T H A T tanky, literally took 8 rounds of rifle ammo to down just one.\n\n-Voice acting\nIt is quite literally the beginning cutscene and that's it.\nI got one ending so far and that also had none.\nNot even the new update of survivor quests.\n\n-Currently, not yet implemented\nThere are trade items and not yet traders, so as of now, \"valuable items\" are completely useless and backpack filler.\nWhy even make the item and put it already in the game, like I looked it up, out of curiosity, only to be met with nothing.\nImagine doing that with the broken guns, adding them in and having no way to repair and use em. It is just an example, but you see my point?\nYou know what is also fucked up, an event that automatically solves itself where I had to exchange a water bottle for a watch.\n\n-Environment\nThe camera isn't exactly 2d, so when approaching an open door your sight is blocked off, because of the camera pan, but the zombies can see you and your character should then also be able to see them.\nThere should be that white outline effect.\nCrashing through doors only damages your health and is loud, it doesn't stun zombies to the ground and even roofs that are collapsing on zombies don't kill.\nRoofs are inconsistent, like some crash when running, but then there are also that break by stealth walking without any creaking noise.\n\n-No replayability\nEverytime you start a new game, you have to put one into scavenging and the other one sleeps, every, single, time.\nGive me upgrades for stealth play and aggressive play.\n\n-Tips\n\"Run past zombies when overwhelmed\" well 9/10 times you get grabbed and zombies can easily catch up and not only damage you, but also kill you or to the point where it's up to chance.\n\n-Guilt\nThat one modifier for killing people, even for bad people you are feeling guilt for or people that started to kill you first or you find out later that they done some shit.\n\n-Inventory\nCan't drag and drop. No slot for weapons and ammo doesn't stay loaded in the gun, but rather in the inventory.\n\n-Weapon switching\nGotta access the inventory and select the weapon in tense situations when a small and large weapon would be great.\n\n-Survivors\nThere is one survivor that can be recruited at a car shop, after recruiting he says goodbye to his collection, but you still can't get in there, not after he joined or when he himself is there being controlled by you.\nOh wait, it's a \"curveball\" where he forgot that he has stuff in there... and doesn't even remember when he is there standing in front of the door... on both sides... also it's random and I literally have not gotten it.\nMost of them are also almost completely useless, other than a another pair hands, like having a \"small chance to evade an attack\" is supposed to good? with status effects like deep wound???\n\n-Deep Wound\nIs the gamble effect that you can even get over 50 % health, like there is a chance to get deep wound before the normal standard wound and it doesn't even matter what you do, it is up to chance if the character goes bye bye or lives.\nI got one character through at their lowest and lost one at their highest, it seems to not matter.\nOh and that bs description \"Healing is less effective. Lose Health every phase. IF (\"if\") Infected, the survivor may turn\" there is no \"if\" in \"you\", even if you heal in that very scavenging phase with a bandage it still gambles.\nI got it at full health on the first hit of a zombie... just wow.\n\n-Airdrops\nThey get mentioned, but not marked on the map.\n\n-Traits\nThere are duplicate traits that do exactly the same thing, just under a different name.\nThey are going to claim something like: \"we have over 'X' traits, just look at all that effort\".\n\n-Flashlight\nHold RMB... for light... instead of pressing F and that's it.\n\n-Ladders\nCan't peak over them, you are commited to climb up and rng that you get the cycle right.\n\n-Weapons\nSome can do multi hit, some can't, please point out what can hit single, multiple or pierce.\n\n-Cleaver like weapons\nThe cleaver literally misses the second combo attack and in turn getting immediately hit.\n\n-Getting put in lose situations\nFirestation no.8, like what were they thinking???\nOn the roof, far right, can spawn a cracked zombie that immediately spots you and runs back and forth really fast, can't backtrack, because you had to drop down, and so the only way out is to go down, take damage, cus slow climb animation and kill the zombie.\nWhat happens next is ridiculous: the room to drop down and get out has a screaming zombie when spotted and it was apparently the only one out of the two who heard the fight on the roof, can't take out the zombie, because I would get sandwiched from both sides, cus noise, and letting it scream was basically the \"safest\" dead end solution.\nMight be skill issue, but I would say test issue.\nEscape plan to the hospital roof: has 2 zombies beyond a gap which you could jump to, but even a standing jump is too loud and even a running jump results in the same long climbing animation, so the zombies are happy to stunlock you till death.\nThe moment you jump, it's already over.\n\n\nThe only reason I got it, is because I thought 20 bucks were reasonable and not 25, so get it now, for being in a country that suddenly, obviously, desperately needs a fucking age rating on games, because that is so important in todays age, not climate change or world peace.\nOr just get it later.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I understand this is a difference Into the Dead but I felt like something was missing then I realized\nWHERE IS MY DOG!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Middle mouse button is a default key and there is no option to rebind it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ดfull of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initial impressions after 3 hours of game play. This game is good. It has that one more turn (salvage run) feel. Plays great on the Steam Deck. Was up till 3am playing.\r\n\r\nIn my opinion there is one major issue, melee weapons durability. It sucks. Getting 2-3 uses out of weapon does not feel good as a player. Especially for knives, when you're doing stealth attacks. They should be getting dull and need sharpening not outright break. Sometimes I feel like game developers learned all the wrong lessons from games like Breath of the Wild and Tears of the Kingdom. Great games but they started this trend of terrible weapons durability.\r\n\r\nI tried downloading a weapon durability mod, but the requirement (MelonLoader) keeps crashing the game, regardless if there is a mod installed or not. The least the developers could do is give us a game option or config file to adjust it ourselves.\r\n\r\nAlthough I do recommend it, if you can stomach the melee weapons durability, I'm giving it a thumb down in hopes the developers see this and make adjustments.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Game is fairly fun, but feels very much like a mobile game. Clunky combat and mechanics make for a sometimes frustrating play-through. I went around looking for characters to see if there really was any \"Story\" and no, its basically a 1-page premise with very little or believable dialogues. The visual design is interesting but other than that does not affect the story in any significant way. Crafting is VERY limited and gets boring quickly. You end up caring so little for the characters you might as well use them as sacrificial pawns to learn a location before attempting it with a character that's actually any good. Since I doubt the story telling will get any better i'm dropping it for now and might look at it again once its out of EA.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "This game plays very similarly to 'This War of Mine'. Except with less gameplay options, clunkier controls and added zombies. Not bad, but in its current state it feels very 'bare-bones'. Maybe I'll try it again once it's out of early access.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I think I'm just tired of devs slapping DLSS on an unoptimized release without any graphic settings so your GPU somehow hits 80C at the MAIN MENU",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Potential to be fun, especially with the 2D sidescrolling, but at the moment there's nothing keeping me here. Gameplay quickly becomes tedious and base management is all stress, no joy.  \n\nVery little reason to play this when there's State of Decay 2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Kinda bad, and the patches seems to be just making it worse. 2 new games, all new recruits have all broken wrists, and not in a postion to make the splint, or finding them, so they are just a drain on resources. Aggro through doors, or just random. weapon durability is a joke! \n\nNo save features, just autosave at the start of a cycle. Overall the game is just meh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "clanky combat mechanic should have focus on quality of life as a survival game, maybe port it into smartphone is better because such effort shouldn't gone to waste but also game quality still not on pc standard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If i could get if a middle thumb I would, its close to really good but too many things just fall short, one of the biggest annoyances is zombies appear to not die off screen. Throw a noise maker it bonces for what ever reason throw a grenade to blow up the zombies attracted to the noise maker.\r\n\r\n...... nothing died. Fantastic, why even try and have that as a combo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game feels very shallow and gets uninteressting fast. Hoped for a bit more after \"This War of Mine\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this is a good game and have very high potential in my opinion but there still a lot of glitch such as\r\n- when you open menus sometime the menus can't be close. \r\n- Some time when you run from zombies the character freeze, can't move and you die \r\n- Some time zombies in the position that you can't hit like it kind of floating on the floors. \r\nThe glitch is not a big of a problem if you don't loose a character when you die but since you're so it's kind of big deal. You can try to wait for them to fix all glitch first. So that you don't get annoy by it.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The combat mechanics feel like they were designed by a sadist. Poor combat mechanics in a zombie game is like substituting milk for water when baking a cake. Tastes like nothing except disappointment.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "if playing too long, the sound suddenly gone and the game crashed & suddenly exit by itself",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Somewhere between great and unplayable. It's early access, but the bones of a great game are here. It just needs some more polish if they are going to limit you to one autosave per game. The deep wound mechanic needs some guard rails. What's the point in having characters that always have a deep wound when you recruit them that always kills them regardless of treatment? At least switch it up a little and insta-kill a different character next time. If it's just bad RNG, maybe have a grace period at the start of a new campaign so your first recruit doesn't get picked off right out of the gate. If there is no way to save characters you like, maybe have more likeable ones and fewer throwaways with bad traits.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the game just wont save. i put in several hours on a play through and when i quit there was no continue option. i really liked what i played but i cant let myself play it again until this is fixed. such a shame since it would have otherwise got a good review.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game looks good, has a great vibe and seems to have very interesting mechanics if you liked this war of mine.\nOverall great potential but man, what a disappointment after actually trying the controls... The characters feel heavy as hell, have the longest animations for everything and feel like everything is soooo slow (even moving to grab a ladder feels like an eternity). This makes the hand to hand combat feel dead, just bashing the attack button and hoping to kill the zombie before it triggers an attack as the dodge move seems to work 10% of the time. Fighting more than 1 enemy is literally impossible, not in a good design way because it's too challenging, but in a \"stun-lock why is my character not moving\" kind of way.\nI won't recommend the game for now because of that but I'll definitely check it out again when it releases fully, hoping they'll have fixed these issues.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "In its current state? No.\nI mean, sure if you want to torture yourself with unfair stuff and such, then go ahead.\n\nThe things that bother me:\n\n-Stealth\nIt's the main focus and it is just so slow, who even cares that ONE character has a stealth skill when it's basically useless.\n(It makes zombies harder to hear when it should've been: \"you stealth walk faster\")\nCan't even tell if a zombie can hear me or not, the moment they do, they are active and aggressive.\nPress the stealth button immediately or alert some zombies, because just walking is loud enough.\n\n-Inventory\nNo wonder when people complain that this is like This War of Mine, because why can't one slot be devided? If I can carry a 4 stack of wood in one slot, then I should be able to carry 2 wood and 2 gears in one slot, but no, they get devided into two.\nYou gotta slow play stealth collecting everything into one spot to get the most out of each run.\n\n-Animations\nYou can't even fast vault in this game, like the main focus of it all is slow stealth, so when shit hits the fan, nah man, gotta leap over this table all quiet like.\nYou can even get stunlocked to death, because you can't control the animations. Getting hit off a ledge, survivor does the \"struggling to get up\" animation, get hit again till death parts that alt f4 button.\nZombies have i-frames to stuns while vaulting, so the moment they are done, they just do their quick attack.\nCan't even decided, to either do a slow execution of a zombie who is downed with weapon durability or the infinite boot. Scratch that. Apparently it doesn't eat durability, but it still eats time.\n\n-Spawning zombies\nWhy? Just why? \nOn some maps, even the ones from the demo, have triggers where if you reached X spot spawn a zombie in Y location and it's the spots where you already walked pass.\nI also got a zombie who crawled under a filing cabinet, so basically clipped through.\nThey can also open cell doors... sliding steel bar doors...\nOne literally spawns in under a car to ambush after retourning the moment you enter a building.\n\n-Zombies\nTheir attacks are so quick. Especially when it stutters, you get hit unjustified and it stutters a lot.\nThey apparently can't go beyond certain points, like I literally couldn't get a zombie to follow me over a construction pit and fall in, rather it stood there, not at the ledge, but even further away just looking at me and waiting for me to be in range to then attack.\nHeavy armored zombie is just invincible to melee, they bleed, but can't be killed? Grenades apparently too? Or they are just T H A T tanky, literally took 8 rounds of rifle ammo to down just one.\n\n-Voice acting\nIt is quite literally the beginning cutscene and that's it.\nI got one ending so far and that also had none.\nNot even the new update of survivor quests.\n\n-Currently, not yet implemented\nThere are trade items and not yet traders, so as of now, \"valuable items\" are completely useless and backpack filler.\nWhy even make the item and put it already in the game, like I looked it up, out of curiosity, only to be met with nothing.\nImagine doing that with the broken guns, adding them in and having no way to repair and use em. It is just an example, but you see my point?\nYou know what is also fucked up, an event that automatically solves itself where I had to exchange a water bottle for a watch.\n\n-Environment\nThe camera isn't exactly 2d, so when approaching an open door your sight is blocked off, because of the camera pan, but the zombies can see you and your character should then also be able to see them.\nThere should be that white outline effect.\nCrashing through doors only damages your health and is loud, it doesn't stun zombies to the ground and even roofs that are collapsing on zombies don't kill.\nRoofs are inconsistent, like some crash when running, but then there are also that break by stealth walking without any creaking noise.\n\n-No replayability\nEverytime you start a new game, you have to put one into scavenging and the other one sleeps, every, single, time.\nGive me upgrades for stealth play and aggressive play.\n\n-Tips\n\"Run past zombies when overwhelmed\" well 9/10 times you get grabbed and zombies can easily catch up and not only damage you, but also kill you or to the point where it's up to chance.\n\n-Guilt\nThat one modifier for killing people, even for bad people you are feeling guilt for or people that started to kill you first or you find out later that they done some shit.\n\n-Inventory\nCan't drag and drop. No slot for weapons and ammo doesn't stay loaded in the gun, but rather in the inventory.\n\n-Weapon switching\nGotta access the inventory and select the weapon in tense situations when a small and large weapon would be great.\n\n-Survivors\nThere is one survivor that can be recruited at a car shop, after recruiting he says goodbye to his collection, but you still can't get in there, not after he joined or when he himself is there being controlled by you.\nOh wait, it's a \"curveball\" where he forgot that he has stuff in there... and doesn't even remember when he is there standing in front of the door... on both sides... also it's random and I literally have not gotten it.\nMost of them are also almost completely useless, other than a another pair hands, like having a \"small chance to evade an attack\" is supposed to good? with status effects like deep wound???\n\n-Deep Wound\nIs the gamble effect that you can even get over 50 % health, like there is a chance to get deep wound before the normal standard wound and it doesn't even matter what you do, it is up to chance if the character goes bye bye or lives.\nI got one character through at their lowest and lost one at their highest, it seems to not matter.\nOh and that bs description \"Healing is less effective. Lose Health every phase. IF (\"if\") Infected, the survivor may turn\" there is no \"if\" in \"you\", even if you heal in that very scavenging phase with a bandage it still gambles.\nI got it at full health on the first hit of a zombie... just wow.\n\n-Airdrops\nThey get mentioned, but not marked on the map.\n\n-Traits\nThere are duplicate traits that do exactly the same thing, just under a different name.\nThey are going to claim something like: \"we have over 'X' traits, just look at all that effort\".\n\n-Flashlight\nHold RMB... for light... instead of pressing F and that's it.\n\n-Ladders\nCan't peak over them, you are commited to climb up and rng that you get the cycle right.\n\n-Weapons\nSome can do multi hit, some can't, please point out what can hit single, multiple or pierce.\n\n-Cleaver like weapons\nThe cleaver literally misses the second combo attack and in turn getting immediately hit.\n\n-Getting put in lose situations\nFirestation no.8, like what were they thinking???\nOn the roof, far right, can spawn a cracked zombie that immediately spots you and runs back and forth really fast, can't backtrack, because you had to drop down, and so the only way out is to go down, take damage, cus slow climb animation and kill the zombie.\nWhat happens next is ridiculous: the room to drop down and get out has a screaming zombie when spotted and it was apparently the only one out of the two who heard the fight on the roof, can't take out the zombie, because I would get sandwiched from both sides, cus noise, and letting it scream was basically the \"safest\" dead end solution.\nMight be skill issue, but I would say test issue.\nEscape plan to the hospital roof: has 2 zombies beyond a gap which you could jump to, but even a standing jump is too loud and even a running jump results in the same long climbing animation, so the zombies are happy to stunlock you till death.\nThe moment you jump, it's already over.\n\n\nThe only reason I got it, is because I thought 20 bucks were reasonable and not 25, so get it now, for being in a country that suddenly, obviously, desperately needs a fucking age rating on games, because that is so important in todays age, not climate change or world peace.\nOr just get it later.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I understand this is a difference Into the Dead but I felt like something was missing then I realized\nWHERE IS MY DOG!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Middle mouse button is a default key and there is no option to rebind it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "ดfull of bugs",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Initial impressions after 3 hours of game play. This game is good. It has that one more turn (salvage run) feel. Plays great on the Steam Deck. Was up till 3am playing.\r\n\r\nIn my opinion there is one major issue, melee weapons durability. It sucks. Getting 2-3 uses out of weapon does not feel good as a player. Especially for knives, when you're doing stealth attacks. They should be getting dull and need sharpening not outright break. Sometimes I feel like game developers learned all the wrong lessons from games like Breath of the Wild and Tears of the Kingdom. Great games but they started this trend of terrible weapons durability.\r\n\r\nI tried downloading a weapon durability mod, but the requirement (MelonLoader) keeps crashing the game, regardless if there is a mod installed or not. The least the developers could do is give us a game option or config file to adjust it ourselves.\r\n\r\nAlthough I do recommend it, if you can stomach the melee weapons durability, I'm giving it a thumb down in hopes the developers see this and make adjustments.",
      "voted_up": false,
      "votes_helpful": 41
    },
    {
      "review": "Game is fairly fun, but feels very much like a mobile game. Clunky combat and mechanics make for a sometimes frustrating play-through. I went around looking for characters to see if there really was any \"Story\" and no, its basically a 1-page premise with very little or believable dialogues. The visual design is interesting but other than that does not affect the story in any significant way. Crafting is VERY limited and gets boring quickly. You end up caring so little for the characters you might as well use them as sacrificial pawns to learn a location before attempting it with a character that's actually any good. Since I doubt the story telling will get any better i'm dropping it for now and might look at it again once its out of EA.",
      "voted_up": false,
      "votes_helpful": 37
    },
    {
      "review": "This game plays very similarly to 'This War of Mine'. Except with less gameplay options, clunkier controls and added zombies. Not bad, but in its current state it feels very 'bare-bones'. Maybe I'll try it again once it's out of early access.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "I think I'm just tired of devs slapping DLSS on an unoptimized release without any graphic settings so your GPU somehow hits 80C at the MAIN MENU",
      "voted_up": false,
      "votes_helpful": 42
    },
    {
      "review": "Potential to be fun, especially with the 2D sidescrolling, but at the moment there's nothing keeping me here. Gameplay quickly becomes tedious and base management is all stress, no joy.  \n\nVery little reason to play this when there's State of Decay 2.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Kinda bad, and the patches seems to be just making it worse. 2 new games, all new recruits have all broken wrists, and not in a postion to make the splint, or finding them, so they are just a drain on resources. Aggro through doors, or just random. weapon durability is a joke! \n\nNo save features, just autosave at the start of a cycle. Overall the game is just meh.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "clanky combat mechanic should have focus on quality of life as a survival game, maybe port it into smartphone is better because such effort shouldn't gone to waste but also game quality still not on pc standard",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "If i could get if a middle thumb I would, its close to really good but too many things just fall short, one of the biggest annoyances is zombies appear to not die off screen. Throw a noise maker it bonces for what ever reason throw a grenade to blow up the zombies attracted to the noise maker.\r\n\r\n...... nothing died. Fantastic, why even try and have that as a combo.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game feels very shallow and gets uninteressting fast. Hoped for a bit more after \"This War of Mine\".",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't get me wrong, this is a good game and have very high potential in my opinion but there still a lot of glitch such as\r\n- when you open menus sometime the menus can't be close. \r\n- Some time when you run from zombies the character freeze, can't move and you die \r\n- Some time zombies in the position that you can't hit like it kind of floating on the floors. \r\nThe glitch is not a big of a problem if you don't loose a character when you die but since you're so it's kind of big deal. You can try to wait for them to fix all glitch first. So that you don't get annoy by it.",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}