{
  "positive": [
    {
      "review": "I think it's one of the easiest Monster Hunter series; new players can adapt quickly and have fun without ragequitting. Though it'd be nice if they improved optimization and added more monsters. (...Starting to feel bad for Arkveld😞🙏)",
      "voted_up": true,
      "votes_helpful": 63
    },
    {
      "review": "Honestly idk where to even start with this one. I wanna love this game so bad, like 10/10 love it, but Capcom is making it SO hard right now.\n\nFirst off, the actual game? Absolute fire. The combat is hands down the best it's ever been. They added this \"Focus Mode\" thing that lets you target wounds and it feels so crunchy when you hit those weak spots. The new weapons movesets are sick, and being able to switch weapons on the fly with the Seikret (the bird mount thing) is a game changer. The world itself is seamless now, no loading screens between zones, and the monsters actually feel like they live there. When it works, it’s easily the most immersive MH game ever. The monster designs are terrifying in a good way.\n\nBUT. And this is a massive BUT.\n\nThe performance is straight garbage. I’m not even joking. I’m running a decent rig (RTX 30 series) and this game chugs like it’s running on a toaster. The optimization is nonexistent. You walk into a busy area or get some weather effects and your frames just tank. It’s not just the FPS either, the textures are weirdly blurry? Like sometimes the ground looks like PS3 graphics until it decides to pop in five seconds later.\n\nIt’s frustrating because the core gameplay loop is addictive as hell, but then you get hit with a stutter right in the middle of a combo and you wanna throw your controller. It feels like they focused 100% on gameplay and 0% on making sure it actually runs on normal PCs.\n\nVerdict:\nIf you have a NASA supercomputer, get it. You’ll have a blast.\nIf you have a normal PC? Maybe wait for a few patches. The game is incredible underneath the lag, but right now the performance is barely acceptable. Capcom needs to fix this ASAP cause it's ruining a masterpiece.",
      "voted_up": true,
      "votes_helpful": 17
    },
    {
      "review": "After much consideration, I can't help but recommend this game despite my issues with... many things. I've been playing since 4U and I cannot bear to \"hate\" a MonHun game. Without getting too far into the critique, do not buy this at full price! Especially in the current state, and because you can't guarantee you will like the endgame loops, it's not worth spening 70€ on this game. Get a key, get it on sale, and play with friends. The endgame here is truly the meat and potatoes of Wilds, including a HR100 grind that is supposedly becoming easier in TU4 with an event quest.\n\nThe soundtrack, the combat (with a new wound mechanic) and the monster designs and areas are incredible, the performance issues almost make sense when you see the beautiful landscapes you commit mass genocide in. The monster designs range from a monster with a face AND tail that look like a drill to a railgun and the most unique ones of all, big squids that WILL use all of their tentacles fully. The compositions for this game are exactly what I want from a MonHun soundtrrack, true heroes are the Jin Dahaad and of course the Rey Dau theme, but the main menu of all things has stuck with me as well. The ecology, the story, the DAMN SEIKRET BABIES. I love so much on display here. I'm glad that 6th gen looks this good, we've come a long way as a series.\n\nThe story mode! It's... really short for a game of this price. I really like the characters having names, personalities and motivations in this one. The fact your handler FOLLOWS you onto a HUNT? God, is that what we were supposed to be seeing the whole time? The Seikret mechanic surely makes this much easier to implement, but every character is so... involved in this world. Nata as a central character you can periodically check up on optionally adds some tonal depth and his arc of revenge to compasion towards arkveld is truly sad when you eventually have to put it down. At least it would be sad, if Alma didn't have a kill phrase implanted in my brain that makes me feel like a hitman towards my target monster (I'm joking of course, but I do feel awesome when she says it). This is by far the best monster hunter in terms of characters, bringing back many themes and people from MH4U and its own original ones, joining you on hunts for dialogue before you start fighting that big spider. Your hunter talks, by the way.\nMost well known is the final boss of this game, Zoh Shia, which acts as an interpretation of the equal dragon weapon. If you don't know that concept, look it up. Seriously. This may or may not be the case but the fact the devs took that concept, made it even cooler and then made it the most awesome fight in this game (arguably) is a surprise to me.\n\nI could go on about my absolute love for the game, talk about the endgame grind of talismans and artian weapons (I'm still waiting for craftable decorations, capcom.), I didn't even mention focus mode or the crossover... I think I would rather mention some negatives. The multiplayer is a little odd, you need to join link parties and, while an option, environment links are as fragile as a nerscylla hatchling. This pales in comparison to the performance. Please fix, capcom. This game has some serious potential to have the impact world had, bringing in a whole new generation of players to this beast of a series, but that one snag... the performance. It held even me personally back until recently where I upgraded to a 4060 and I can run the game fine. I did go into the files and edited a lot of visuals though, the windward plains still lagged me. \n\nI think the \"difficulty\" discussion is a little overdone. It's on the easier side, sure, but WOW this game can hit you between the legs just as much as one thinks back on their first MonHun game kicking them. Chances are you are not a Sixer but rather a Fiver who plays this game, comes from having learned mechanincs in World/Iceborne, and blasting monsters with the wounds and your main weapon you already found. I have a Fiver friend who I play with and, while they played all the way to Fatalis in World, much prefers Wilds *because* of the faster hunts. And this is not to say that even AT Uth Duna is fast, those take your usual 20-25 minutes. Even normal Tempered hunts (not even double ones) can take 20-30 minutes, at least for us two. If you want some difficulty you truly do need to get further into the game, but once you hit a 9-5 Star Tempered Gore Magala you will SCREAM and CRY.\n\nThis may not be everyone's cup of tea, but to those true diehard MonHun fans who want difficulty: Try savage Omega Planetes, have yourself a 9-5 Tempered Seregios hunt. It's hard! and with AT monsters and Gogmazios on the horizon I only see the endgame getting spicier. Let the early game be easy, I'd much rather blast through La La Barina in 5 minutes and genuinely struggle on High Rank Zoh Shia.\n\nThis game suffers from performance issues and a community that cannot decide what difficulty it wants. I have VERY high hopes for this game and its eventual DLC, and I will continue to support this series into any generation as long as it's not completely terrible. This can become the 6th-Gen game we all wanted, and I hope the team of talented individuals realizes this reality! Can't wait for TU4.",
      "voted_up": true,
      "votes_helpful": 15
    },
    {
      "review": "I've been playing this series since Monster Hunter 4 Ultimate and have played every monster hunter that released after 4U. I absolutely adore and love this series, its my favorite. However, I do have my gripes with it. Throughout my journey this series took a noticable shift with the gameplay and other details, many are positives, there are however also negatives. \r\n\r\nStarting with the core gameplay and the hunts: They're great. Despite some people swearing that the gameplay isn't. I personally don't have many issues with it. My only dislike is the new focus mode and other minor changes that I will get to. \r\nDisclaimer: I have ONLY played hammer as of now (and I plan to ONLY play hammer) so I can not talk about weapons that heavily rely on wounds to go into different modes or to fully use their moveset (eg. Charge Blade). \r\nThe additions of wounds are great, they give a good feeling when used and open up opportunites to punish the monster or to reap your rewards when you successfully damage a monsters part more than enough times.\r\nI do however dislike the fact how much mobility focus mode gives you as a hunter. The fact that you gain more reach with your weapon while holding down the button to activate focus mode is ridiculous. As well as how good your hunter is able to turn around attacking while holding down the focus mode. \r\nWhile I do not dislike the fact that our hunter gets stronger, I do dislike that fact that the monsters don't. Im unsure if its because I know my way around this game and some monsters-moveset after years of experience with this franchise, but I honestly fail to see if Capcom ever designs monsters around our hunter and our possibilites with our weapons and environment. As of now, the only difficul fights have been monsters where their damage have been sky-high (Tempered, arch tempered) and Omega (Which is a very fun hunt, but the design is sadly from Final Fantasy).\r\n\r\nAnother point are the monster designs. They're phenomenal. Stunning even. Weapon designs are also absolutely amazing. They fit right in and are a treat to fight against and use. BUT, as a hammer main.....why can you NOT break the head of Rathian and Rathalos? Seriously? It has been a real head scratcher for me since I first fought them in this addition. Is it because they don't want us the break the \"beautiful\" faces of their flagships? Is the reason really that silly? Im furious about this change.\r\n\r\nAnother great gripe I have is the whole Gravios hunt. Coming from 4 Ultimate, he was never my favorite (don't remind Capcom that black gravios exists). But he never felt...lazy...in a sense, unlike here. 2 Things I want to point out. He has a very basic design. Big rock with flesh under. But this design opened up many opportunites for the team in 4U, and by god they took them. Mounting him in 4U was fun because you could mount him on two places, the back and his chest with different animations. In this game its only the back, which is disappointing but Im not as heartbroken about it as the other change. His roar. They took a bear mp3. and made it his roar..... Im jawdropped. His original roar is still in Wilds but sadly they didn't make it his only roar, so you sometimes get thrown out of the immersion when the mp3 plays. \r\nWhy make it that way? You have the blueprints already there. Seregios (My favorite monster god bless him) also got a more Falcon-esque cry which you can sometimes hear. His cry isn't a bad change, its nice but the bad change is definitely the change they gave Gravios, they must hate him.\r\n\r\nRewards are not as rare to come by like in older games which is very nice, now that I have less time to play due to busy days it's nice to ask friends if they have investigations with the items I need. \r\nThis nice change is however instantly thrown away and stomped on by Artians weapons. Basically the gacha and grinding mechanism they have in almost every game for some gog-foresaken reason (Word/Iceborne decos and guiding lands, SunRise talismans and and augments). They're a nightmare to grind if you want to best possible weapons since you can't choose which augments you get on your weapon (Safi-weapons were better in this regard and design wise) and you have to destory the weapon if you don't get the right augments (you get back the upgrade materials you use for the augments, thats very kind). The worst thing about Artian weapons is sadly the upcoming Gogmazios. Unless they give us a way to upgrade monster-part-weapons, I fail to see why you should even use them since Gogmazios will upgrade your Artian weapons EVEN FURTHER, they will become the best weapons you can get (if you're lucky at the slot machine) and nothing will even compete against them. This however is pure speculation.\r\n\r\nLets get into the world of Wilds. Im not commenting on the story, Im only saying that Monster Hunter isn't a story game and they shouldn't push it to be one. This game further enhances my opinion.\r\n\r\nCharacters in Wilds are good, I like them a lot. Im super happy to see the Ace-Lancer and Little Miss Forge back, here's me hoping that we get to see the rest of the Aces or other characters from 4U when Gogmazios releases! \r\nOverall I do not dislike the things that we have on this topic, what I dislike are the things that are missing.\r\nYou're forced to listen to languages, there isn't the option to let the cast speak the \"Monster Hunter language\" like in World/Iceborne, thank gog that we're able to let our Palico speak in only meows (Hopefully they won't take this away from us in future games).\r\nSpeaking of cats, there aren't Palicos/Felynes cooking for you in this game. The villagers and your hunter cook the meals.\r\n\r\nPerfomance wise I can not complain, I don't have the best or the worst system but the game runs, even tho it doesn't have the best graphics and framerate, its playable (we apparently reached the point where good enough is acceptable). They made a good job optimizing the mess they created, it was almost unplayable when I played the demo-version of this game.\r\nI am a bit disappointed in the art-design choices of this game however. Monster Hunter for me was always a very colorful game. Even darker places like castle Schrade or Dundorma had a nice color palette in previous games. Iceborne was gorgeous and looks (and runs) way better than Wilds. Wilds however....Im disappointed. It looks very monotone and grey. Areas don't stand out since every area of a map looks almost the same.\r\nMusic is phenomenal like usual, great job on this one.\r\n\r\nEven tho this review has been focusing on the negatives, Im still giving this game a good review. Its a great game, its fun, I don't regret buying this game and I will maybe buy the expansion. \r\nI am however very sad that Monster Hunter has lost so much of its soul and things that made me personally fall in love with it.\r\nI hope they change their ways, but from the way things are and how much money they made with the game already [(and the in-game mico-transactions which are purely cosmetics) (Im also part of the problem for supporting Capcoms greed, Im sorry)]  I don't see a light at the end of the tunnel.\r\n\r\nThis is a very backhanded recommendation from me.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "The visuals are great, although they certainly took a toll on the performance, and using frame generation and upscaling tends to ruin the quality of screenshots. Monsters are fun to fight, and each utilize fairly unique mechanics. Monster Hunter as a series still feels like it is not very beginner friendly, but that does make it more satisfying when you finally get the hang of it. Wilds also differs from previous Monster Hunter games leaning more into having an open world, which has it's own pros and cons, but overall I have enjoyed playing the game, and am still looking forward to future updates.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "There's definitely been a lot of buzz around the negativity surrounding Wilds since its release. Personally, I think there were a number of challenges the game faced at release that really didn't do it any favors.\r\n\r\nAmong the most notable criticisms:\r\n\r\n1.) PERFORMANCE AND OPTIMIZATION ON PC\r\n2.) Lack of content, especially when it comes to the end-game\r\n3.) Anemic gameplay outside of the combat, which was also criticized as too easy\r\n\r\nI believe that Capcom has done much to try to \"make it right\" and improve.\r\n\r\nSince release, Capcom has continued to flesh out content:\r\n\r\n--More Monsters\r\n--The Grand Hub\r\n--Three whole Festivals with accompanying armor and weapons\r\n--Dozens of Event Quests\r\n--Challenge Quests\r\n--Talismans\r\n--Harder Monsters\r\n--Our first Crossover Collaboration, presenting the hardest challenge in Wilds to date\r\n\r\nWhen we compare base-game to base-game, Wilds has already exceeded World in terms of amount of content and upper-level difficulty.\r\n\r\nAnd soon we'll have yet more content, bringing both Gogmazios as well as an expansion on upgrade mechanics for both Artian weapons and mid-grade armor sets. Title Update 4 also promises to deliver substantial stability and performance optimizations, where we will ultimately exceed the content provided in Monster Hunter World's base game by a substantial margine.\r\n\r\nThe game has had its issues, but I really do respect a passionate team of creatives who have done a lot to strive to produce a quality product *and* be right by their fans. This is not an easy task.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Upsides:\r\n- This is the most beginner friendly Monster Hunter game. All of the menus are also easily understandable and responsive (even though having like 5 submenus for everything is annoying at times).\r\n- Good roster. Only a few boring monsters and 1 terrible (Congalala).\r\n- Good environment, huge attention to detail. Iceshard Cliffs is the only area which I've found annoying to fight in\r\n- The story is fine. Nothing groundbreaking but entertaining enough. The final boss of Low Rank ques line is very good. The kid character did not annoy me unlike some other players who foam at the mouth the moment his name is mentioned (I really do not get the problem).\r\n- After 3 Title Updates the endgame is very solid and the difficulty is there. The \"star\" system is confusing at first but not that hard to understand, the difficulty progression is solid with 6, 7, 8 and 9 star monsters.\r\n\r\nDownsides\r\n- Of course, performance. Even people with good PCs still struggle with this game because the release was rushed so the optimisation is poor. There have been updates improving it a little but the game still struggles. The devs promised to improve the performance on December 16th with the release of Title Update 4, I hope it will actually be substantial (improving the performance of your game almost 1 year after release is kinda crazy not gonna lie)\r\n- In my opinion, the game lacks artstyle. The previous games were a product of their time and that gave them a certain style, the way they look is memorable. In Wilds they just went with super realistic, I wish there was more to it than that. The monsters are gorgeous, perhaps the playable characters could've been more cartoon-y.\r\n- The amount of handholding during the story gets tiring. Multiple missions where you gotta ride on your mount and you cannot stray from the path (your character won't let you), it's all mostly on walking speed. It wasn't the worst thing in the world and it was probably done to show off how much work they've done on the environment but it at some point you've just had enough.\r\n- More of a late game issue but I wish Artian weapons weren't in the game until like Title Update 3. For most weapons, they are the best option so the Rarity 8 weapons you can make out of the hardest monsters in the game are mostly useless. Yeah, of course I could just not interact with the system, but it would be stupid to deny their advantage.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love Monster Hunter, Hopefully the expansion is better.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "As someone who played on release, and I've witnessed the steady incline in content, and performance patches. I believe the game still has a ways to go. However it is shaping up to be a great MH game, and I am hoping to watch this game thrive further.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "jogo maneiro para jogar com amigos, o ponto alto é q tem uma LOIRA DO OLHO AZUL q conserta e faz armas brabas, performance está em aranha-verso mailes morales 24fps",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "this is what an open world monster hunter game we all have been waiting for, but it could use more ecosystems like a under water coral reef, swamplands, and please bring back hermitaurs, Shen Gaoren, Akura Vashimu.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I've hunted a monster or two in my day.\n\nRuns like ass but everything else sure is neat. Not a lot of games I'd just power through performance issues for.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Very bad optimization.\nMy laptop produced more heat than Fatalis could ever dream of.\nBut the game itself is absolutely phenomenal.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I’ve been playing Monster Hunter Wilds, and it feels like walking through a gorgeous national park where every monster is just waiting to body-slam me. The world is stunning, the combat feels great, and switching weapons mid-hunt makes me feel like an action hero who still carts anyway.\n\nCrown hunting? Pain.\nI’m basically a full-time monster height inspector.\n\nFishing? Somehow even worse.\nI don’t know who designed it, but they definitely hate joy.\n\nPerformance issues?\nYeah, it stutters here and there, but whatever.\n\nI’ve stopped playing after getting all the achievements, and I’ll only come back when they drop new events.\n\n2.5/5 — chaotic, frustrating, beautiful, and I’ll suffer again later.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Incredible game as long as you can actually run it. hopefully in a year or 2  everyone can enjoy this game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "worlds is superior in every way but its a fun mh game anyway. Wish it didnt stutter so much to keep me interested enough in just randomly playing from time to time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is the most heartbreaking Monster Hunter experience you can buy. Doesn't feel as meaty as World. Doesn't feel as anime as Rise. It could have struck a perfect balance of the modern titles, but the low monster count and performance issues drag this into the dirt. I've spent a large chunk of game time just underutilizing my PC hardware to get this game to play in a remotely stable state.\n\nThat said, I really enjoy the gameplay itself, though the content isn't really there to justify the launch price. I enjoy it and would recommend it for die hards. It's just hard to recommend casually.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Game runs perfectly fine and I mean perfectly fine on my Ryzen 5 5600g and RX 6600 with 16GB Ram. only had 2 crashes in 70 hours playtime. Frame gen does not make the game look worse at all everyone is just b*tching cuz they cant play 4K 240+ fps",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Overall I find the game super fun! Been enjoying the first MH game I've played since tri.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "The amount of QoLs that this game brings compared to the already amazing MHWo and also MHR is insane.",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "bought this game to get at a girl. That didn't work but I kept playing because the game is actually good so you should buy it!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Don't listen to the haters, it's a fun game. Coming from someone with 1000+ combined hours in World, Rise, Wilds.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I know alot of people have trouble with optimization and that's fair, but I enjoy the game and i don't really notice it most of the time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's not a BAD game, it's fun, but I have two main gripes with it\n1. The optimization is near non-existent. The devs forgot that DLSS and Framegen were supposed to be a feature for those with weaker machines to make games playable, not a requirement to get good FPS on high end hardware.\n2. Unlike MH Rise, where I feel like the content kept rolling in pretty quickly, this one is... well, it doesn't get that much in it over time. And what it gets are either bullshit quests (all the Arch Tempered monsters that their only gimmick is that they have more HP and hit like a 10-ton truck, even if you use a Lance and can normally block almost everything) or 1 new monster every few months.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I played this on PC with a Ryzen 7 5700X3D, 32 GB DDR4, and an RTX 5070 12 GB. After almost 400 hours, this is one of the strongest Monster Hunter entries to date, though it is held back by major technical issues.\n\nGameplay and Combat\n\nThe combat in Monster Hunter Wilds is a significant evolution for the series. Focus Mode and the new movesets feel fresh without losing the classic Monster Hunter identity I have known since the PS2 era. Compared to Rise, the combat is far more grounded, weighty, and satisfying. Compared to World, not much different but feel less weighty while more realistic and lot more satisfying.\n\nI have used every weapon and while a few feel average, the overall weapon design is excellent. Monster movesets, especially with the new 9 star difficulty, are intense and punishing. One mistake can easily result in a one-hit faint.\n\nThe only real downgrade for me is the investigation system, which leans more toward Rise-style boss hunting. It lacks the deeper investigative structure that made World’s hunts feel more immersive.\n\nWorld and Exploration\n\nThe open-zone design has strong potential but feels underutilized. The environments look great at broader perspective, but the game does not encourage exploration the same way World did. Performance issues also reduce the enjoyment of traveling through these large areas.\n\nEnvironmental interaction is where Wilds shines. Weather, small wildlife, and monster behavior react dynamically and make the world feel alive. Compared to previous titles, this is a major improvement, though the poor performance often overshadows it.\n\nStory and Presentation\n\nThe story is more narrative-driven and gives your character a clearer role rather than being just an assistant. It is engaging but noticeably short. Progression feels much faster than World, which forced players to explore, investigate, and uncover clues before advancing.\n\nThe voice acting, cutscenes, and returning characters are excellent. Longtime fans will appreciate the comeback hunters far more than newcomers. Some specific scenes hit very hard emotionally, especially for veteran players.\n\nPerformance\n\nThis is the biggest issue with the game. Optimization on PC is weak. With my system, I run mixed High to Ultra settings with High RT at 1440p using DLSS Quality and no Frame Generation. I can maintain around 60 to 80 FPS, but drops into the mid-40s still happen.\n\nThere are also noticeable texture streaming problems. After loading into a zone, some textures will appear low-resolution or low-poly for a few seconds before the higher resolution versions load in. Texture pop-in is fairly common, especially when moving quickly between areas or after cutscenes. For a game of this scale, these streaming issues are distracting and make the presentation feel inconsistent.\n\nA game with this visual quality should not be this demanding. PC optimization clearly needs improvement.\n\nTitle Update 4 (December 16, 2025) is supposedly bringing major performance improvements. If that update delivers, it will help significantly.\n\nGraphics and Sound\n\nGraphically, the game looks good but not exceptional for its generation. The visuals do not justify the heavy performance cost. At 4K60 the game looks excellent tho, though some textures appear pixelated.\n\nSound design is outstanding. Battle themes, village and base themes, and environmental ambience are all high quality and add a lot to the overall experience. The soundtrack work for returning monsters and several newcomers stands out in particular. Some of these themes hit extremely hard in-game, especially with monsters like Rey Dau, Nu Udra, and the long-awaited return of Lagiacrus.\n\nOverall Experience\n\nWhen the game holds above 60 FPS, it feels incredible. As someone who has played the series since Monster Hunter 1 on PS2, Wilds feels like a blend of World and Rise that finally gets the best of both worlds. Unfortunately, poor PC optimization hinders what could have been a near-perfect experience.\n\nHighly recommended for Monster Hunter fans who have capable hardware.\n\nFor newcomers or those with weaker systems, it may be better to wait for Title Update 4 or a sale.\n\nRecommended system if you plan to buy now: something around a Ryzen 5 7600 or equivalent, a 9060XT 16 GB class GPU (or equivalent) or at least 5060 / 9060xt 8GB minimum, and 32 GB RAM with NVMe storage.\n\nIf performance improves in future updates, this will be an easy recommendation for nearly everyone.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Pros: It's Monster Hunter\r\n\r\nCons: Performance\r\n\r\nI like a lot of the new mechanics add this iteration, I loved Rise and started with Tri. I miss a lot of the early resource gathering, but people forget that that wasn't really there late or even midgame in a lot of the MonHun games. The performance is really a killer. I can play just fine, but I'd like more people to be able to enjoy my GotY",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game once youve got the graphics properly set up - even a 5090 Suprim struggles here at 4k  maxed out. Aside from graphical issues/optimization, its another great entry into the monster hunter franchise.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Are there problems with this game? Oh for sure.\nDo I still come back to it, play it for weeks, then take a break and let the cycle continue? Oh for sure.\nIt's been one of my favorite games to come back to so far this year and I don't see that changing with the new updates coming soon. \nThe game starts off pretty easy but as new monsters/higher ranked monsters are being added I've had to actually go out and get more crafting materials, which I do enjoy. Easily one of my favorite games to play solo or with friends. \nI have seen a decrease in performance issues on my end over time as well.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I wish there was a neutral option. The game IS really good. The new monsters are amazing, the combat is fluid and the music is also outstanding. Content is pretty great currently and there is more to come. If you like the MH formula, you will probably have a great time*\n\n* If you can run it. The performance is HORRIBLE. I hope Capcom will fix this soon because it is dragging down an amazing game. They are planning to begin to fix this in the next Title Update in December. We'll see how this goes.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Not a bad game apart from the modders destorying the experience and breaking the game bricking people's save points making them start again",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "needs some TLC on PC editions, but its been working pretty well for me since day one and I've had a lot of fun",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've been playing MH Wilds since the release in February and I think it's time to post a review after having +300 hours played. I have to admit this is the best game I've played in 2025, it's definitely my favorite release this year. I'd like to cover different aspects of what makes this game the wonderful game it is:\r\n\r\nStory and Characters:\r\nI've played previous releases of MH before since PSP era and MH games used to be simpler, however MH Wilds is different and it has the best and more complex storyline in a MH game ever, the story is beautifully written with great memorable characters and it has a meaningful message about the ecosystem and shows you that balance is important to preserve things, our Hunter protagonist feels really engaged with the story and the mission, and you can feel a real bond with the game characters, it feels completely seamless and it offers and immersive experience. The characters are the best ones for me in any MH game, they have their distinct personalities, great dialogues and expressions, I feel in love with these characters and enjoyed the story so much together with them, that it made me care for the world and the future of the characters.\r\n\r\nBattle:\r\nAll the known and existing weapons from previous MH games are back, with expanded and updated functionality, each weapon offers a completely different gameplay and it's one of the reasons that makes this game so fun, because you can always experiment with new weapons and master your favorites, each hunt feels different depending on the weapon you choose. There's also a lot of QoL aspects that have been incorporated in this game to make the battle experience more enjoyable such as mount autopilot, customizable radial menu, customizable loadouts of items, armor and weapons, it's very detailed and interesting.\r\n\r\nMonsters:\r\nEach monster in this game has very unique attack patterns and gimmicks you have to learn to be able to master their hunts, it's extremely enjoyable to fight them and follow the learning curve to become better at fighting them, there's no repetitive attack patterns between monsters, all of them, even the initial ones feel completely unique and authentic. Some of them have their own battle music and locales where they spawn, it makes the world feel completely alive.\r\n\r\nOther notable mechanics:\r\nGame offers great additional functionality that makes it very enjoyable, there's cross play in multiplayer, so you can play with friends regardless if they are in console or PC, there's a hub where we have constant events, and even a bowling counter, the maps have different weathers and monsters and endemic life that spawn constantly, it's a changing beautiful world that always offers something to do, even when you are not hunting a particular monster. The armor customization is also amazing and super immersive, it offers a lot of grinding love, and unlimited customization in terms of skills you can equip, the combinations are so huge that a lot of hours can be put just on creating different armor combinations and testing them for results in your hunts. \r\n\r\nMusic:\r\nThe music of the game is completely epic, there are so many nice songs, my favorite of all is the Ice cliffs battle song, Rey Dau and Mizutsune battle themes, some of these were existing songs that have been rearranged for this game, the soundtrack is absolutely beautiful, many of the songs use horn instruments which are perfectly fitting for the setting of this game, and it helps with the immersion during battles. The recent FF14 collab brought a new fight with great music as well. \r\n\r\nPerformance:\r\nI know there have been complaints about performance of this game, however I want to say that I've never had performance issues with MH Wilds, it has always run perfectly well since I started playing, not even crashes, while other games with less graphics have crashed on me, MH wilds hasn't and it always runs very well, even when using other apps at the same time such as Firefox and Whatsapp desktop App.  I play on PC but I'm not running the ultimate PC rig nor anything like that, I have a machine that has a few years already, it has Intel 12th gen processor and GPU is a RTX 4070, and the game runs completely flawless at full quality and FPS. \r\n\r\nSo in summary, I want to say this is an amazing game, I highly recommend it, my favorite of this year, it brings joy and immersion, and if you have friends to play with even better, if not, there's always people online that you can hunt together with, making this a great multiplayer experience too.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is my first proper entry into the series and repaired its shaky optimization and steep learning curve, I really did enjoy my journey chasing the hundo. Once it started to click, it really opened up for me. I definitely got my money’s worth out of this.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "i dont have the newest hardware but idc about graphics and the game runs fine for me on low.\nthe monsters  are great and aside the optimization issue its a great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Need to be like a richboy gaming to play this smoothly, gamewise it is an evolution of the Monhun world and the new weapon combos are best. Totally must play it to *kill yourself in anger erm i mean enjoy the monster killing and adventure",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game wish I could fight all the monsters in the past games as well with this combat system. Performance issues aside its a fantastic time and only sullied because my friends are too broke to get and run it on their potatos. Getting hit for 90% health is not my idea of a good time but it seems like thats what the community likes so I guess I'm in the minority for wanting it to be a bit easier.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a fan of the Monster Hunter since PS2 .\r\nHas been play all Monster Hunter Series on Steam (World and Sunbreak) with their DLC\r\n\r\nPros\r\n-The are Sekriet (can change weapon on the fly)\r\n-Beautiful scenery and no loading screen\r\n-we can use the environment as our weapon\r\n-Turf war are a good thing, sometimes can save the day.\r\n-Great gameplay (Almost better compared from previous series)\r\n-Online with friends to get better experience (more fun and also more challenge) \r\n-Design of the weapons are decent (compared previous title)\r\n-Somehow good at anti cheat (there are ban)\r\n\r\nCons\r\n-Optimization (Heavy CPU and GPU load) my Laptop  Intel Core Ultra 9 275HX processor, Ram 16GB (8x2), RTX 5070 Ti\r\n-Performance issues\r\n-Lack of Big monster roster\r\n-The multiplayer Connection can become a problem.\r\n-There server issues that can make you rage quit. \r\n-No Doge (Sad)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love the game but please Capcom fix the performance issues",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the game series. But def needs some Optimization to help it run smoothly. Only rec if you have a high end pc or if you are willing to sacrifice a lot for performance.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game itself is a monster. It loves your gpu very much. Apart from that everything else is fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It has its ups and downs, mostly downs however it can be fun, when it works",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "[h1] Monster Hunter Wilds [/h1]\n\n\n[b] Monster Hunter Wilds feels like opening a little treasure box from my childhood… but this time it sparkles way brighter.\nThe world is huge, warm, and full of tiny details that make me smile every time I explore it. Riding around on the Seikret feels so cozy—like the game is giving me a soft little hug while I hunt. [/b]\n\n\n[b] The monsters are gorgeous and dramatic, and every hunt feels like a playful dance in a stormy desert.\nThe weather shifts, the sand blows, the sky rumbles… and I’m just there, a tiny femboy with a big weapon trying my best—hehe. [/b]\n\n\n[i]Combat is smoother than ever, and each hit feels powerful and satisfying.\nIt really brought back that excitement I had when I was small, watching hunters swing giant weapons and dreaming, “I wanna do that someday.” [/i]",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While not entirely optimized, it still delivers the usual Monster Hunter experience that I enjoyed.\r\n\r\nWith more content on the way as well as an expansion, one could only hope for improvements beyond what we already have.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun, so fun. monsters are cool, weapons feel great. I like being able to go out and just hunt whatever's in the map. dynamic environments (fallow/inclemency/plenty cycle) are nice, I think it makes the pretty parts stand out a lot more.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Performance aside, better than base World and base Rise IMO",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game lots of content. Has more content at this point in its release than previous games liek world. It does have some optimization issues but honestly think theyre mostly windows related looking at the performance jump I got after nvidia's latest hot fix driver had to fix something microsoft did. Overall this game has been awesome and theres still more content and end game systems being added.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "First Monster Hunter game I've played through the full main story line and I really enjoyed it. Grindy and gets repetitive at times, but with so much weapon choices it keeps things 'new'. One thing I dislike is the RNG for artian reinforcement stats.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fantastic game that keeps me coming back for more.  Fights are engaging, weapons feel completely different and unique, FREE content including monsters, weapons, and armor added often.  Game has a ton of charm and is also fun multiplayer.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I've grinding many hour into this game, many alone and mostly with friends and we have had a blast. Yes at this stage there are occasional graphical issues and outside of lobbies the connection issues can be bad, But the game feels smooth and the environments are so detailed its beautiful. \nEach environment feels alive when your roaming through with monsters fighting in other areas or hunting prey to having some down time.\nBattle can be either quick and easy or kicking your ass. \nDrops are allot more generous than other games in the franchise but you still have to grind for them.\nCan i say you'll like this game? No. I found the story annoying with having to get 'permission' from Alma to fight monsters angered me, she comes off condescending to me, and Nata seems to be made deliberately to get on your nerves, But like every Monster Hunter game the game starts when you can really grind the monsters out.\nI've had a blast and will continue to grind it out with all the weapons.\nIf you like a game to just optimise your gear out and grind for drops then you'll enjoy yourself.\nIf your gonna get caught up comparing it to other Monster Hunter games then you'll probably be disappointed.\nHope this helps you make your decision either way, If so happy hunting. XD",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This is a great game, I understand why seasoned hunters may feel like it is actually easy, but for normal people it is still difficult, especially when you start hunting those arch tempered monsters. Technical issues make this a 6/10 game when it can be 9/10 at its best. I've played most MH games and I like the fact that some of the mechanics have been streamlined, while keeping a decent level of difficulty for most experienced people. \r\n\r\nI still recommend it, despite all the hate, this is a good game. Buy it on sale.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Somehow not so catchy like MH:World but still great fun and game.  Graphics and sound is amazing, monsters are beautiful, game runs great at 3440x1440 with RX9070xt . NO CRASHES at all from day 1 to finish of the game.  \nRecommended at full price if u are fan,  wait for deal and get it if u want to try. worth every cent",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "one of the better monster hunter titles. the updates have been decent and the gameplay loops are great. Has the feel of an old school monster hunter title.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's good game, Great gameplay immersive world but definitely little behind WORLD!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "if you have a PC to run it, its amazing and a great MH.\nPersonal Gripes\n-2 weapons, never find a need or scenario for it\n-Being able to fully restock while hunting (This was in worlds as well, did not like it then.) it takes the risk of it out, no prep really required",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "new weapon mechanics, fast combat, good weapon design\r\nboring story, not enough elder dragons, almost everything can be captured\r\nmany endemic life forms but missing a room for them to interact with caught ones",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Yeah it's alright, I'm excited to see what comes next. The past titles are better but the netcode is pretty good. I can't say much on performance issues due to my decent system. As it is with AAA games they're always unoptimised with anything that is previous gen.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Good difficulty, really good graphics, amazing designs - i love this game a lot. It is a good introduction to the Monster Hunter franchise in my opinion, as it is the first one i've played. I am enjoying it quite a lot!",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "Another fantastic entry into the Monster Hunter series. The combat is as smooth and polished as ever and the monsters look amazing!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Outside of the performance issues affecting other people, and my personal preference for the tracking mechanic MHWorld had, this is a fantastic game and entry to the series. The combat is smooth, the world is vast and vibrant, the music fits the monsters in tone, and the characters are all likeable. Most of the monsters you meet in the main story are unique to this game and the ones that return feel at home in the locals. \n\nTitle update monsters so far have been amazing every time and I wait with baited breath for this December with TU4\n\nSide note: If you feel like the game is a bit too easy and want more of a challenge, set your Palico to standby in the tent. It makes a huge difference.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing monster hunter game, a ton of weapons to pick from, nice updated combos\nThe story is amazing, the enviorment is responsive, its just all in all a pretty amazing experience\n\nAlso, don't forget our boi, Poly-Dau from the Beta!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is fun. Clunky, not really the best fighting system, and what storyline? But it all looks nice and they did a crossover event with DOTA, the greatest game ever. That adds a million to the coolness factor.\n\nAnd honestly, expectations have gotten so high for AAA studios that games like this get mixed ratings because it's Capcom when some 2-man indie devs would get mostly positive for the exact same product and win GOTY. Sad times indeed.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It just more monster hunter, i love it. Optimization is wack tho, but i still enjoy the hunt.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "ignore half of the things you hear about this game from people who play with decrepit setups and the vocal minority that is mh vets that want to cart 18 times before they decide a fight is hard! the performance is iffy at times but it subtracts from the game's quality minimally. if you love world or rise, there's at least an 80% chance that you'll love wilds. it's just monhun and it's amazing!! play for the love of monsters & you will be a happy hunter\n\nthe rey dau fight is still up there with the best :) \n\na big issue though is the pricing sadly.. too many things that cost money for a game that's already overpriced? most options are cosmetics but it's still nasty to see",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The most powerful and best feeling MH I've ever felt and played. The primary gameplay gimmick (focus mode) makes this MH the most accessible in terms of combat, and the decoration + charm system enable loads of buildcrafting options.\r\n\r\nMain problem is performance, the low resolution I'm forced to play at gives me a headache for long periods of time, especially when trying to hunt for endemic life where the tiny creatures literally blur into the background. Not that big of a problem with the main hunts at least.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Gameplay is great but the performance is quite awful :(",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I'm a newcomer to the Monster Hunter series and I have definitely enjoyed it. It's definitely a far cry from games with health bars where you have to pay attention to the way the monster acts to discern how healthy (or not) they are.\n\nI found myself enjoying the supporting cast a lot. And while the main focus isn't the story it was engaging enough to keep me playing.\n\nUnfortunately if you're not running the game on an SSD then you will get graphical weirdness (as well as it complaining to you!).\n\nAnd cross-platform multiplayer works well, I can play with my console friends and we can have a blast and be silly!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This is a really hard review to write.\n\nBecause, I love monster hunter. I really do, I think it's amazing. The game series core gameplay and item gathering is amazing. The combat is just... *Chefs Kiss*\n\nThe problem with Wilds is two things.\n\n1. The story. I can't imagine a worse story ever made. You basically run around and listen to Bipocs whine for hours about stuff that is not only mind numbing, but eyerolling bad. Thankfully, the game gets a million times better after the introduction quests and story.\n\n2. It feels... too slow. After rise and zipping around everywhere, everything feels just like, too slow. Combat feels slower then the rest of the series. The UI and actions feel slow. It all feels super slow and awkward. The graphics and frame rate on most rigs doesn't help with this, and the animations all feel... muddy? Is the best way to put it. \n\nThe one thing about monster hunter that has always been nice is it's \"OK, pick quest and go. There, done in two seconds.\" speed. Instead, this feels like like everything takes far too long. The camps and towns feel awkward and placement of quests doesn't offer the same fun as Rise did - Rise, everything was placed perfectly and using wires to explore and pick-up stuff was great. This? It's \"season\" based for certain maps which requires another loading screen and more time and -\n\nYou know what? I want to like Wilds. I really do. The combat is excellent. But, that said, rise is just a better game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is probably the best high rank experience in any monster hunter game. One of the best games in the series without even being fully complete. Performance continues to be an issue but fellas, if your setup was cutting edge 10 years ago its not running this game you guys are insane.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "What's to say? It's monster hunter. If you want to hunt giant monsters play it, if not then dont. Easy As.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Besides Performance, The game is in a great state right now.  The endgame has a good chase RNG talismans like GU. It has a good selection of difficult fights to test out any improved builds. Layered Armor has unlocked options with good colorable changes. I'm a [insert game] veteran so i'm automatically right.\r\n\r\nwill update review on TU4",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I understand the complaints about performance, but I haven't really run into any issues there other than the rare slowdown when the particles get really crazy. Otherwise the gameplay is great, they've addressed the lack of difficulty with 9 star monsters and lowering the frequency and impact of wounds. I'm tentatively giving this a positive for not, because I do think the performance issues are being overly exaggerated. It's either that or I'm just lucky somehow.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good multiplayer mechanics.I enjoyed playing it with my friends..",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "hoestly such a fun game! though optimizasion is killing me with each new update and my pc cant keep up...\n(omg the pollygons T-T pleas make sure you have a ssd i dont and it hurts) \nBut its just fun , espicaly with mates . story feels a littel lack luster but makes up for it in hunting the monsters!! movement feel steady and classes have a nice leraning cerb that keeps you engaged!!\n\nOVERALL  its a blast!! totally recomend , just make sure your computer meets the basic specs for the game befor playing other wsie youll be in pollygon jail like myself <3",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Hunting monster is a lot of fun with friends  and the story is good as well",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I would recommend this game if your computer can really handle it and if you have a group of friends to enjoy the game with, because the solo experience isn't that enjoyable",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "A longtime series supporter, I have always sunk hundreds of hours into these games and plan on doing so every time there is a new release. I am always looking forward to how they innovate the combat as the demand for more intense and realistic hunts increases, and while at first i found the focus mode system clunky I can't help but feel it is an upgrade and adds immensely to the fluidity of the hunts. The wound system was further developed into something more natural, and the ability to change direction of your attacks mid attack has felt like the speed of hunting has somehow increased further from Monster Hunter World. Monsters are faster, hunters are faster, and yet the hunts do not last longer. It is incredible how they managed to make a game feel so fast-paced and intense with a great difficulty curve on top of it. My sole gripe is the artian weapon system at the end of the game, but that's already so many hours in and unnecessary that it feels very minor. Highly recommend checking the newest edition of the series out, but make sure your system can handle it.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "¨IF¨ you can look over the performance issues it's a fairly enjoyable game and the gameplay loop it's still there, so it's fun.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "game runs fine for me idk. only bad thing about it is its not 4 ultimate. i miss 4 ultimate. i really do.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great fun hunting monsters with friends. Just want the game to run better overall",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game so far has been decent and the gameplay is good but I feel like there are some things that are lacking in the game, but overall I have mixed feelings about playing Wilds",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I don't understand what the negative stuff is all about. My friend talked me into the game, it has been pretty fun, No issues running it at all. Runs smooth even with the hi res texture pack. Only downside is the 41 HR version of the Final Fantasy boss, can eat a bag of d*cks.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "complaining about not being able to play a modern game that pushes the limits of its engine on a decade old system  is pathetic. this game runs beautifully with a proper modern setup. only crashes are the fault of nvidia drivers, which occur maybe once a week and aren't that disruptive. Ive never played monster hunter before, but this game was good enough for me to go back and play World and Rise.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "While the game continues to be improved, it builds upon what came before. If you love the series, you'll enjoy this installment. We'll see how Capcom fairs as the game development progresses.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun, It would be better if the performance optimization were improved further.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I love this game, I think it's a great upgrade from World/Rise.  My PC is pretty mid-tier at this point but I have never had a single performance issue with the game.  I enjoy the environments, and the multiplayer quest menus and quick joins are SIGNIFICANTLY improved from Rise or World.  It is much easier to jump into a match with others doing the content that you are looking for on this game.\n\nOn the other hand, when I just want to play solo, having the choice between my Palico vs bring the AI companions is pretty cool, and the companions are pretty good.\n\nI would definitely recommend this game to fans of the MH series!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I didnt have any issues with performance with my mid range PC so I cant comment on that. Story is never the focus of a MH game but its fine, nothing special. \n\nBut I enjoyed the game. Weapons are fun to use. Monsters are fun to hunt. Areas are lovely to look at and fun to explore. Thats what this game is about.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "EVERYTHING previous games strived to be. Im obsessed \n\nI know many have troubles with performance and maybe i would've given it a bad review if i also had them lol but it works perfectly smooth for me and my laptop",
      "voted_up": true,
      "votes_helpful": 7
    },
    {
      "review": "The game itself isnt bad and looks pretty good when you have the hardware to run it paired with a good monitor that has good color and contrast. while stuff like frame gen and dlss are pretty much required to get a high frame rate, it manages to look decent with everything besides ray tracing turned on with extra res texture packs. basically the game doesnt run the best but can be overcome by brute force if you have a good enough system. the game itself can also be pretty easy in terms of difficulty if you want it to be but you can also fight stuff like savage omega and give yourself a challenge for some cool cosmetics. every weapon seems to have real use and most bad matchups with monsters can be overcome with element and player skill. if the december update goes good then there will be performance optimizations and a really cool siege fight coming. I will say though the end game grind isnt the most appealing as the only thing to really get is talismans and maybe artian weapons (elemental weapons). i think the future of the game will be pretty good if they can just nail down the problems with things like performance, end game, and the eventual expansion that every monster hunter game gets. i say wait till the game has a decent sale and give it a try. if it doesnt run good within the first hour or so then just refund it tbh. the game is good but not good enough to sit through a terrible experience with the performance if you have weak hardware",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Honest review from a guy who broke monitor and joystick on World, purchased Wilds on day 1 and refunded cause was unplayable.\n\nOptimization i cannot say if they did something cause im on a 5070 now with dlss, but on my old 3060 was unplayable. \n\nThe game is fun. Just don't compare it to World. Just dont ç_ç \n70 euro on steam? Not worth it, buy on key reseller sites for 30-35 euro",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun game \r\nalways great \r\n\r\nonly negative point is the collab with FF",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "If you have a reasonably powerful PC, performance shouldn't be that much of an issue. Other than that, this is a fantastic and beautiful MH game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love this game! Performace can be better but I play on medium settings and don't see any FPS drops.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Ive been appart of the MH community for many years and I think the games pretty solid other than the poor optimization. If capcom actually decides to fully work on the optimization itll be very enjoyable for new players of all kind especially for newer hunters, other than that I think I'd give the game a good 8/10 minus optimization of course",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it is my first monster hunter game i've played and I've thoroughly enjoyed learning the different monster fights, trying out new weapons and being able to hunt with my friends. There isn't anything thats too complicated about this game which I like alot, its very clear and to the point in \"kill big monster\". There were a few performance issues when the game first launched but I honestly have not had any big problems with how the game runs\r\n\r\nI do think if you have friends to play with this game is way more fun than solo",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So i spend a good amount of time in this game and i can say that i would recommend the game to people new to Monster Hunter. \n\nBUT! it does have a good amount of performance problems so keep that in mind. Also that there is a lot of MTX in this game makes me sad. I wish there would be more focus on fun Event quests! \n\nAll weapons are viable and fun but there is always room to improve of course! All the Monsters are fun to fight (Besides Gravios) and the music is awesome! The world is beautiful and the Story is okay lol.\n\nI would say at the end this is my favorite Monster Hunter. \n\nI can't wait for more updates and the Expansion DLC! :D",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "honestly this is gonna be the only positive review youre probably going to see of this game and im running a shit graphic card (590 radeon nitro) my game hasnt crashed despite running it on low settings, its been somehow playable and i haven't had any sort of crashes yet. WHat i did before starting the game was delete the crash.exe file in the folder of the game. its blurry but ive played worse games so if youre a masochist with a shit pc sure go for it.:)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it’s absolutely amazing! What’s great is that they keep adding new updates with new monsters and missions. Also, the Arabic language support in this game is really impressive. Thank you!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I really did not like this game initially and I found myself going back to Monster hunter world, but now after couple of updates the game is really good now. Have tons of things to grind and loving the game so much.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "very fun and cool, ofc theres some hickups with images but thats solvable",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I enjoyed the game while I played it. I haven't tried any of the new content yet so can't speak to any of that but of what I did play I enjoyed.",
      "voted_up": true,
      "votes_helpful": 1
    }
  ],
  "negative": [
    {
      "review": "Capcom, I'mma be real with you\r\n\r\nYou do not need to charge 75 dollars for a digital OST\r\n\r\nI enjoyed the game I played, and I feel bad for people who suffered the lack of optimization, but the sheer greed and FOUR HUNDRED DOLLARS worth of cosmetics and emotes is not a good look. Not to mention the cosmetic DLC pass is 50, when the game costs 70. \r\n\r\nMy god.",
      "voted_up": false,
      "votes_helpful": 476
    },
    {
      "review": "Going into this game I was eagerly excited. How could hunting monsters be anything other than extraordinarily invigorating? How could one possibly fuck this up? I knew there were performance issues people complained about, but I was undaunted. I decided to support this franchise, one of the last that still sparks dopamine in me. Against common sense I bought the deluxe edition as a token of good faith to the dev team.\n\nPerformance issues for me were rare, so I assumed it was just people with outdated rigs trying to squeeze performance out of their decaying GPUs. My friend had issues with his semi-old setup barely hitting 30 fps despite tweaking his settings. I got 60 fps with my 4060 TI. I’m not a max graphics kind of guy, so it was good enough for me.\n\nWhere everything fell apart was in the core gameplay. I consider myself a seasoned hunter, not a speedrunner. So when I started killing monsters in five minutes flat, I thought something was wrong. I told myself it must be because it’s low rank. Surely high rank would ramp up the challenge. Right? Right?? No. It didn’t. What I found was a game on rails. Beautiful worlds, sure, but they mean nothing when your mount takes you directly to the monster every single time. I don’t even count travel time anymore because it’s automatic. The real fight starts when the laser pointer stops, and that’s about five minutes of empty motion. The fanbase calling this “rewarding” or “respectful of my limited game time” absolutely baffles the fuck out of me.\n\nI haven’t suddenly become a god-tier hunter overnight. The problem is the monsters hit like toddlers. There’s no fear, no tension, no need to respect them. You can play recklessly and win. The older games punished greed. One bad swing could send you back to camp, forcing you to think and adapt. Here, the monsters might as well have foam teeth. You can stun-lock them in half a dozen ways. You can play with your eyes closed. The game inflates everyone’s skill by making failure nearly impossible. And the fanbase cheers like cattle for being bottle-fed easy mode, insisting, “It’s just low and high rank that’s easy, wait till G rank!”\n\nI was so disappointed that I went back and replayed Rise, then World. Within an hour I realized how far the series has fallen. There’s no auto-find. My weapons have weight. I can’t greed attacks because I’ll actually get punished. I got carted several times adjusting back from Wilds’ hand-holding design and I laughed. The contrast was that stark. Rise reminded me what risk feels like. Wilds feels like a padded room where you’re not allowed to fail, not allowed to feel.\n\nIn Wilds you can hunt two monsters of any type and already have everything you need to craft a full armor set. That’s about five to seven minutes per hunt, tops. Ninety-eight percent of the game is you coasting half-awake, waiting for the credits to roll. Once you’ve crafted your weapon, armor, and decorations, you’re done. There’s no drive left. God forbid the FOMO-afflicted crowd actually face something difficult. Finding the monster is automatic, fighting it is a formality, and gathering loot is guaranteed. Why stop there? In the next installment they might as well add an “auto-hunt” feature, and the fanbase will probably call it “a quality-of-life improvement.”\n\nAnd yeah, I’ve seen the noise about how there are no strong male characters, how the cast is full of girls and one brown kid who won’t stop whining. Sure, that’s annoying, but it’s not why this game fails. I don’t give a fuck about the story. I’m not here for politics or representation debates. I’m here to hunt monsters. I’m here to feel challenge, danger, and triumph.\n\nInstead, what I got feels hollow. The gameplay loop is soulless. The fights have no tension, no grit, no weight. Every victory feels unearned. Every monster feels defanged. And the fanbase’s defense—that “a couple of late-game monsters are hard”—is the most damning thing of all. You’re telling me I need to mindlessly wade through hours of filler just to finally experience the ghost of what Monster Hunter used to be?\n\nThis isn’t evolution. It’s lobotomy. The spirit of Monster Hunter wasn’t just about the grind; it was about struggle, tension, and mastery. That’s gone. What’s left is an empty shell of a once-great series made safe for people who don’t actually like difficulty but still want to feel like they’ve conquered something.\n\nMonster Hunter Wilds doesn’t respect your time. It drains it. It flatlines your passion. It turns the hunt into a checklist and the player into a consumer. And the saddest part is that people will call this progress. I can't in good faith suggest this for anyone until they address the core gameplay loop...which won't be happening because they want to appeal to new hunters and not actual hunters.",
      "voted_up": false,
      "votes_helpful": 668
    },
    {
      "review": "I waited a long time before putting out a review of this game. Please understand that I've been with this series since 2007, so I have an attachment to it unlike any other game series I've immersed myself in. \n\nTo get to the point; Capcom is ridiculous for putting this game out the way they did. This game clearly was supposed to release in 2026 but we sure needed to get the Japanese fiscal numbers looking nice before we close because shareholders run everything. \n\nThis game is a mess, the CPU overhead is ridiculously high with how much the game both inefficiently handles rendering as well as a layer of denuvo running on top. Its been 8 months and they've yet to drop the denuvo despite the game's opening sales having carried Capcom so hard and now they've tapered off so much because it's obvious this game is incomplete (and I'm not talking content wise). \n\nIf you have an 8GB VRAM gpu, do not buy this. This game is so imbalanced in its graphical processing that no matter what settings you change you'll experience the same abysmal frame rate and frame times as everyone else. The graphical processing crutches on needing upscaling and frame generation to achieve low standards like 1080p / 60fps - I have a top end GPU from 2020 that has handled modern day releases in 2025 at 1440p and worst case I cap at 60. This game? I'll be amazed if I can hold 60, even using upscalers or driver upscaling. It just won't. work. \n\nThe only reason I have the playtime I have is because I'm attached to the series but I also have a desktop that can brute force most of these issues, but my 8GB 3070 laptop is a miserable time on this game. I can, at best, achieve 40~45fps. They've made many updates, and most of them are questionable of it they've done anything. \n\nThe community has done their best to salvage what they can, reframework eases up some of the frame time issues, another tool was released that can let you decompress the textures in this game so that the texture streaming issue can be mitigated, but even with these the game is still unreliable. \n\nThe biggest offense is this game crashes, so often. Of all the games I've bought from Japanese developers I cannot recall one that has crashed this often, to this degree. At least once a day this game crashes on me and it is downright infuriating to have been in a hunt for upwards of 15 minutes and nearing the goal only for it to get taken away as there is always an issue with Nvidia or an AMD driver with this game's compatibility. \n\n-\n\nWhen you get past the downright awful performance, this is probably one of my top 3 favorite monster hunter games, and its a shame because the gameplay is fast, the monsters are fast, and its so obvious this game wants you in the field more than doing anything else at camp. Capcom has promised many times they will perform updates and fix this horrendous performance, they've at best taken steps but their efforts have brought the game from \"this is terrible\" to \"this is playable, i guess.\" $70 premium price is a joke, MH is the only series I ever bothered preordering and it seems I have to learn the hard way. \n\nCapcom promises with the major title update in December that there will be greater CPU and GPU optimizations to the game as it is (assumedly based on past game trends) their last major update before the expansion. If this update fixes the entirety of my issues above, I'll retract this entire review and rewrite it. If not? I'll be very depressed knowing I spent most of this year lowering my standards because of an IP I enjoy - but then I'll just go back and replay Monster Hunter Rise and World, two games I can easily run between a steam deck, laptop, and a desktop.",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Die hard Street Fighter and Resident Evil fan all my life. RE engine clearly works for these games, but not open world stuff.\n\nHavent played this since late May.\n\nRunning a 3080 ti, 5700X3D, 32gb DDR4 RAM @ 3600mhz and all my storage is SSD.\n\nGame freezes randomly, stutters even with low settings, and also hard crashes my entire pc. This game also often will randomly downgrade my visuals to mere polygons at the most random times. Simply unacceptable. \n\nI used to be a capcom simp who buys their titles day 1, but I'll be holding off on Resident Evil 9 until I know with 100% certainty that it runs smoothly.",
      "voted_up": false,
      "votes_helpful": 60
    },
    {
      "review": "First of all, I have to say that I have fun playing Wilds and I enjoy it, while it lacks some things I like from other MH games, I still think this game is fun and very enjoyable\n\n\nThat's the exact reason why I also hate this, I can't play the game.\nI think since the TU3 update, my game crashes on launch. Doesn't matter what I try; installing new drivers and erasing old ones, unisntalling all mods, reinstalling the game over and over again, start the game as administrator, deleting some .dll files and replace them with some old ones that many people claim to work, completly restarting my PC so the uptime goes back to 0, disabling the steam overlay because is buggy, erasing crashHandler to be installed properly again, validate game files, tried to launch my game on windowed, dx11 or without fullscreen optimisation through properties of my steam library, running the game on debug mode through Nvidia panel, tell the game to run os a dedicated GPU (even if I only have one and no APU), freeing space from my SSD, even changing SSD, upgrading my GPU from a 2060 to a 4070. None of that mattered.\n\nUntil today, if I tried to start the game I needed like a few tries to ACTUALLY start the game and play, it was very annoying but I didn't care because I had fun and wanted to play anyways. \n\nBut today I spent 3 hours trying to open my game, and trying all the fixes over and over again, but still I can't play.\n\nI am reinstalling the game right now, but even if it works now, I will not change this review.\n\n\nReleasing this game at that price with this issues shouldn't be acceptable, but it's even worse because the game has been out since February and we are in November, and the game still is garbage.\nI don't even talk about performance because I already made this review long enough, but I don't buy that crap of \"You just need a better PC\", that's a straight up lie and this game is the result of a lazy company that don't really care about peoples complains, it deserves all the bad reviews is getting",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "8 months later and the game is still garbage.\nJust go buy Monster Hunter World , it's way cheaper and better.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Stop worrying about micro transactions and hooking new players and focus on making the game better/supporting the customers who made MH popular in the first place.\n\nGame still runs like s*%#.  11.10.25",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "If you're new the franchise I'd suggest playing Monster Hunter World Iceborne first instead, as currently Wilds would randomly crash in the mids of the game even if your computer's spec is above minimum requirement.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "Honestly meh, it lost me with the railroad-y segments and the lack of depth with the hunts. Probably better with friends, but solo its a slog. Don't buy it unless its on deep discount",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Still runs like garbage. Monster Hunter Generations Ultimate should've just been ported to steam, instead of this trash. And i'm not just a hate train person, I've played MHF2, MHFU, MHGU, MHWorld, and MHRise. This game right here, is not it. Welp, guess we gotta wait till TU4, a whole year later just for sh#t to get better. F#cking pathetic.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It's hard to believe that this game released in 2025 yet runs like crap. I don't recommend buying this game until the performance issues are fixed. Besides that the gameplay loop is kinda boring and the story is nothing to be excited over. Most of the base game monsters are very easy to fight and the most challenge you will have are the monsters added after release date. As a long term fan of monster hunter I can say that this is one of their weaker games to be released.\r\n\r\n4/10 Performance\r\n3/10 Story\r\n5/10 Challenge (Base game)\r\n8/10 Monster Designs",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "For as much fun as the combat in this game is, I simply cannot recommend this game in the state it's in. Very minimal post game content 8 months after launch, abysmal optimisation and performance issues, horribly bloated file size (seriously over 200 gb for any game is ridiculous), convoluted and confusing multiplayer system, and the developers have yet to do anything to address these. With how well Monster Hunter Rise ran and played, you'd think this would be a slam dunk, but Capcom is apparently more focused on whatever dumb crossover they can push in next over actually fixing Wilds' many problems.\n\nIf the setbacks of Wilds eventually get addressed, I will change this review. Until then, please buy Rise instead. It's a much more worth your time and money.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "I love the game and think it's really good. Music, monsters, gameplay, all of it is incredible. But yeah, the performance is terrible. I have a good PC and I still can't get good frames even on low settings. To me, it's playable and worth dealing with, but I have to join the masses in giving the game a negative review in hopes that it pushes the team to fix it. As much as it hurts.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As a Monster Hunter Veteran since Monster Hunter Freedom Unite (Generation 2), i dislike this game.\nNot hate. Just dislike.\n\nWhat went wrong here?\nFor me, they removed most of what made Monster Hunter, Monster Hunter.\nThey added useless features to streamline someting that never needed it.\nThey \"optimized\" the fun out of the gameplay and forgot to optimize the game for modern hardware. 4080 runs \"fine\" for me. But not great. Still get some stutters here and there. (At time of review)\nThey force you into story / cutscene / slowwalk every chance they get.\nThere is no real challange in the story part or later on. Only if you count 1 shots or almost 1 shots in the latest stage of the game, where you only survive, because your Mount carries you away. \nAnd getting enough armorspheres for upgrading multiple sets, is such a grind for that \"short\" of a Mosnter Hunter game.\nMe personally, i dislike, the focus on getting on your Seikret to escape after getting hit.\nFeels like they forgot how to make a well balanced but still difficult fight. \nIt feels like the game suffers from power creep... 10 months after release.\nThey cut the build crafting in half. Most armor sets feel similar with so many evade skills.\nAnd offensive skills are so hard to get, with the limited slots. Lets us build the way we want.\n\nAnd this list could go on and on and on.\n\nNow that i am edditing this review, i will go on a little.\nWhy are there no cooking cats? \nWhy is the palico such a jack of all traits instead of a master of the skills you want?\n- Since an update, you can tell it what skills not to use, but i still cant tell the palico to do something right now. That is what i acually want from it. I dont feel any connection to the palico as i did in Gen 2, or to Cha Cha in gen 3. Or even to my cat in Worlds.\nWhy are there more or less no side quests?\n- Just hunting monsters that are in the area right now, just doesnt do it for me. My brain needs a list of Quests and not an endless respawning amount of monsters in the open world. My brain needs to be able to \"finish\" something. (A questlist for example). \nThe option menu is incedibly vast. Sounds good right? But i think it looks very confusing and overwhelming to check the options. Might be my ADHD but still, i cant look at the options without my brain frying itself.\nWhy are there 3 new monsters in what? 8 months and already 2 colaborations, that add nothing meaningfull or fitting to Monster Hunter? But the performance is for many still bad.\nWhy does the \"farm\" people collect stuff for you, exist? We had perfectly working farms, where you could get items yourself, that you could automate over time (kind off), that you could upgrade with sidequests. Those felt a bit grindy. True. But i liked them more than whatever it is we got now. It feels soulless to me.\n\nWith the budget of CAPCOM, i hoped to get more than 1 smithing animation? I know this one is nitpicking right  now, but details are often what makes a game feel alive. And they dont need to do it for every weapon.\nBoth bowguns can use the same. Hammer and Horn can use the same. Both lances can use the same. And so on.\n\nWhere are Siegefights? Where is Jen Mohran???? It would have been a perfect fit to see him here. And i guess we will, otherwise, all hope for CAPCOMS decision making is lost.\nWhy is underwater combat (i liked it in gen 3) back and it sucks ***? \nHow did you guys even manage that?\n\nWhy and how is the \"friend list\" and playing together so complicated?\nHow can it be, that you cant watch cutscenes together in multiplayer?\n\nWhat is even the point of hot and cold drinks in Wilds?\nIf food persists after carting, and we can eat at any time, arent Maxi, ancient potions kind of worthless.\nOr just very expensive and limited potions? There use is kind of gone.\nWhat happened to the supply box? Why do materials spawn in my inventory? Did you really need to streamline the game so much, that items need to spawn in our pocket? I see why the supply box is gone, but more and more potions just spawning in my pocket just feels wrong.\n\nI would have loved to see some more Monsters in the game. Since we got a few duplicates (guardians).\n\nAlso sad so see no Elder Dragons. (Before Update 4. And even with that update only 1.)\nBut i think you get the point.\n\nI will go and play emulated versions of Gen 2 - 4 now.\nI wont buy Capcom games unless proven otherwise with a good Monster Hutner release or good updates and fixes to Wilds.",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "these devs suck dick they leave their game broken and unoptimized for this long and dont care to fix it. such a waste this series is so good but these devs suck.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "It WOULD be a nice game but after finishing the main story, taking a break from the game for some months and then starting a new save, I have to say: it's really not for me. \r\nMy main complaints are: \r\n1. The graphics: \r\nIt just looks dusty/gray - no matter what graphic settings I try and I still get some strange artifacts on screen.\r\n2. The Exploring:\r\nI love the seikret BUT it takes away so much of the exploration. (The only way to explore the map and getting a feel for it yourself is ignoring this cute birdie right next to you...)\r\n\r\nAll in all, I don't get the same feeling of exploring interesting, vibrant ecosystems like I did in the last previous monster hunter games.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "when the game is not crashing, its absolute fire!!!!! my pc is also on fire",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I have been hunting since 2007.\n\nThis feels like so much thematic potential lost in a MMO-ified package and lost to in-dev hell. The grind feels noisome instead of progressive in terms of difficulty and reward. It gets same-y; more same-y, more quickly than titles before MHW/IB. The difficulty curve is... unearned with how easy hunts become a 5 minute stagger-fest at nearly all points of the game, leaving much to be desired as you never feel like you improve with gear investment. It furthermore lacks a substantial monster roster, has a bloated sense of item/cash economy in progression, has confusingly cluttered menus and game systems, and a claustrophobic, constrained feeling despite the open environments. Oh, and constant issues with sync and client-host disconnection. The coffin nail is that I have to manually delete and re-allocate my shader cache every time I want to play without excessive lag; yet the game will still lag with decent hardware.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "After 250 hours & so many update the performance still like trash lmao",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This game is incredibly disappointing. It entirely failed to grip me like World did, and it fell flat with regard to meeting expectations. The story is incredibly sluggish, constricting, and uninteresting, and the gameplay itself is shallow and didn't feel as good to me as the aforementioned title. Gameplay aside, the performance is awful, even on a good rig. *Nobody* is getting good performance, even with very high end specs, and with frame gen, which is basically mandatory to play the game, it's just passable at best. Even if you can run it halfway decently, the game itself is something only diehard fans of the series can tolerate and excuse. I would not recommend buying it — I deeply regret buying this game right away at full price. It may be worth getting on sale in a few years where the devs will hopefully have fixed the crippling performance issues and have added the other half of content the game is missing.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "terrible performance and still crashes frequently even 8 months after launch. game is otherwise good but feels a bit shallow",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "10 months later this game is still unplayable due to poor optimization.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The performance flaws with this game are inexcusable. I know this issue has been beaten to death, I'm just leaving this review to up the negative review count until a performance improvement is released.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Well y'all already know how badly optimized this game is, and y'all already know about the hundreds of dollars worth of cosmetics and $70 soundtrack... lmfao\n\nBut other than that, it has some other glaring issues or things that just take away from the experience for me, especially when comparing it to MH:World.\n\n1. The locations are boring asf. Coral Highlands alone smokes all Wilds locations, but in general Worlds locations were more unique and aesthetically pleasing.\n\n2. Talking Palicos. Just why?\n\n3. No room decorating. I get why it was done, but it was a nice touch that I enjoyed. The pop-up camp system just seems lazy like almost everything else in the game. I liked capturing the rarest of endemic life and displaying them in my room knowing I'm one of only 2.5% of players with it.\n\n4. No Pickle. Need I say more?\n\n5. World had A LOT of super memorable, awesome moments. Wilds was not very memorable for me.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game itself is good, my favorite in the series so far. Too bad it took me 7 hours to get the game to launch without instantly crashing after the last update. You'd think after 8-9 months the performance would get better, not worse. I somehow only get 15-20 fps without any mods on lowest possible settings after the last update. I don't see any reason why this game should run so poorly on this rig.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game runs bad and I don't think capcom can or is willing to fix it, they still didn't fix dragons dogma 2 which have the same bad performance, I'll wait till they release the major expansion and see if things get better.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "Game is far too easy compared to previous titles. Carting will rarely happen, you can flashpod monsters even if they aren't looking at you. Hugging the monsters will cause majority of their attacks to miss. Those that do hit will like wet noodles with even unupgraded armor.\n\nGame constantly wants to play itself, will force you to look in directions you don't want, will randomly mount you and start spriting you in directions you don't want.\n\nAt one point I was in a vendor npc shop and randomly got mounted and run off towards a quest the game decided I had to do right then.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "4070 ti super and ryzen 7 7800x3d game keeps crashing due to perfomance issues almost a year after release.....",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's been almost a year since this game came out and it still runs like shit, it's pathetic.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "- BAD optimization \n- Lack of content\n- meh Story \n- Relies on Frame Generation\n- Just a few new monsters.\n+ fun to play \n+ challenging monsters.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "I've been waiting until the horrendous performance was fixed to actually play. 8 months later and it's worse than it was on release day. I've been playing since MH3 Tri and this is the first game in the series that I can't recommend.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Buy on sale if you're gonna buy it, but make sure your system can actually run this game, because this game runs very poorly, even though I'm lucky enough to have a good pc that can run it with little issue. The story is not very interesting and just brings you from one hunt to the next - which is fine. The gameplay itself is very good, once they fix a couple big issues I think this game will be really good and if they fix the performance I would recommend it.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "came back after a few months and game wouldn't even open and crashes on start, horrible experience",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It never ran well, but it sure was fun when it came out. Extremely lacking in the difficulty department especially compared to previous titles. If you were new to the series, it was a fun place to start. Back-tracking got more difficult, but that's where the series got it's charm. Currently, can't even get the game to launch. As a long-time fan of the series it pains me to say, but 0/10.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Please bro this is a different TU bro it's a new monster it will enhance gameplay bro this will fix the PC performance I swear bro just one more TU bro please play bro it has new 999 star monster bro there are overpriced cosmetics bro",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Released broken and with barely 30 hours of content.\n6 months and its still broken, and still barely any content.\n\nGive it 3 or 4 years and maybe it will be in a playable state",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It's kind of impressive that the game is nearly a year old and still runs like hot ass. And unfortunately, even when the game does semi-function, it's a washed-out 20 hour slog through a setting that feels like a modern military shooter sandblasted it, all to finally be able to do what we all came here to do and play Monster Hunter with friends. Miserable experience, if you're looking to dip your toes into Monster Hunter, spare yourself the bad first impression, and go buy Rise and Sunbreak. A full experience that runs like silk and will provide hundreds of hours of multiplayer fun, for 10 dollars cheaper than this wheezy, broken down blowhard of a disasterpiece.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Game is really good but the performance issues are atrocious.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I have a whole laundry list of problems that I have with this game but the main reason it's getting a thumbs down is just from, you guessed it, the performance. At launch, I was able to at least play the game with around medium-ish graphics with upscaling and framegen. The game doesn't look all that incredible to begin with, and with these settings it looked kinda blurry and played a bit sluggish, but I didn't mind it then since I could at least play the game.\nFast forward to August where I notice a log-in reward that gives your Seikret some flames. I hadn't played the game in over a month since I wasn't all that interested in playing then, but I thought it looked cool so I decided to log on to pick it up. It shouldn't take that long to pick up a log-in reward, right?\n[b] It took me over 45 minutes to even get to the main menu due to shader compilation. [/b] That is [i] insane [/i]. But after I get through that hell, the game should be fine to play? Wrong! I load into the small hub area, and despite my graphics settings being the same as they were when I last played, the game ran at under 30 fps. I turned all the graphics down, and it didn't help it at all. Not only that, the framegen was giving me a nearly full second of input delay, and the upscaling was tearing my screen like crazy. I try to turn it off because it's obviously not helping, and my game freezes completely and I have to restart. Back to compiling shaders for 5 more minutes~ Eventually I manage to get the log-in reward, put it on my Seikret and then log off. I haven't touched the game since, and frankly, I don't really have any desire to. I can't imagine what being out in the world is like if this small hub area ran as poor as it did.\nPerformance has been the number 1 issue plaguing this game and its pathetic that Capcom has not diverted from their (slow) content release schedule to address it, especially now that each update has gotten worse and worse. I can't play the game even if I wanted to at this point, which thankfully, I don't want to since the game is so utterly streamlined to its detriment. Having come from World, this game is so boring to play after the honeymoon period with just how much they completely infantilized the game mechanics. Switch Axe feels horrible to use in this game. The Bowguns have had their modding and ammo differences completely gutted to where they all feel the same, but also feel like garbage. Admittedly, Charge Blade is pretty fun to use in this game, but of course it hardly matters much when focus mode plays half the game for you, and the monster is stunlocked due to wounds and focus strike spam.\nEndgame content is just hunting the same 7-8 monsters over and over to get decorations and parts for Artian weapons, which I despise because of how strong they are. There is no reason to use any of the other weapons, though take that with a grain of salt as I have not played any new content since the summer, so maybe the new monsters add comparable gear. Capcom even said that they would prioritize ensuring that Artian weapons stay strong, as if they weren't already. They also look horrible, which ruined any player's fashion if they wanted to have the best weapon. They added layered weapons since I last played, so it's not that big a deal anymore at least.\n\nThere's so many other gripes I have with the game that I couldn't even fit it all in a single Steam review. Even if the game was playable with improved performance, the game is just unfun to play in hindsight. I hate that I was so hyped for this game and how I've come to loathe it as much as I do now.\nCapcom got their money from everyone when they pushed this game out well before it was ready. I hope it was worth it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I don’t get it. I can run basically any game without problems but Monster Hunter Wilds crashes before I can even reach the main menu. I have tried everything, updating drivers, reinstalling, verifying files, nothing works.\r\n\r\nI was really looking forward to this and it is just gone. Complete disappointment. I cannot even play it. If you are thinking about buying this, do not. Wait until they actually fix it.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Monster Hunter Wilds & Dragon’s Dogma II should both be amazing, but poor optimization is at the top of their list of problems.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Don't buy this if you're on Linux or a Steam Deck. There's a good chance that while getting trying to get it to work, you will be flagged as malicious and locked out of playing the game you purchased for 24 hours at a time. Other than that, performance is awful eight months after launch, even with the recommended specs on Windows. The game has Denuvo which is blatantly anti-consumer and probably responsible for the above 2 issues.\n\nThere are other, smaller issues I could get into regarding the gameplay and story, but in all honesty they are not significant enough to have made a difference in my recommendation.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Bought it ages ago. Still waiting on optimization so I can play it in a acceptable state on my old potato pc. Waited with baited breath that things will improve because I was naive and thought the last two games was a indicator of progress. (How wrong I was) Now its been months, window 10 is no longer getting security updates, and I got a new pc only to learn things have somehow gotten worse. Great job Capcom.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "man capcom fix your shit keeps crashing with this shitty optimization game is fun but come on hear the peeps out and fix this its to the point that the crashing becomes unbearable",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Don't buy the game for the full box price ($70 USD). I was able to buy it on sale at half off through a third party website and the game still has some glaring issues that make me partially regret my purchase.\n\n1: The story\n\nThere's three types of good storytelling: have deep lore & an intricate plot (Lobotomy Corp/Mass Effect), have very little to no story (Dark Souls, the earlier monster hunter games), or have a very goofy/shitposty story (MGR:R). Neither World or Wilds fall into any of these categories and are a product of lazy writing meant to show new monsters. Limbus Company is a great example for a lot of reasons, but the encounters especially. They feel meaningful, whereas in Wilds it's a means to an end. They had each monster on a board that they'd want you to follow for progression and built the story around it instead of the other way around. So, the story very quickly disinterested me to the point I skipped (for a while, mostly parts where I KNEW people were going to be lore dumping since that's one of the worst ways to tell a story).\n\nThe main problem here is that the story is directly tied to progression (who would've guessed). If you want to ignore it, you have to put in so much effort to skip dialogue and cutscenes that it becomes a drag. So, sometimes I would watch the cutscenes again. Sometimes they're interesting, and mostly because I'm given the opportunity to piece things together myself instead of the writing team spoonfeeding me information the whole way. I only had those fun moments because I skipped the mostly lame story.\n\nAbout halfway through, I decided I wanted to pay close attention to everything because I noticed just how stupid one particular character was. The wonder child, Nata, is so horribly out of touch and awfully written, I was rooting for him to lose. At one point, the Guardian Arkveld escapes and starts fucking up a LOT of the ecosystems nearby for seemingly no reason. Nata copes and acts like it never happened. \"He just wanted to be free!!\" With that freedom, Arkveld would later butcher, maul, and nearly eradicate an entire ecosystem in the caverns around his village. Literal chunks of flesh, bone, and sinew are being thrown around as he mutilates their corpses for pleasure. Nata's response to the order to kill him? \"Nooooooo! There has to be another way! He just wanted to be free!\"\n\nJust one of many terribly written plot points in the game. There's no character development, reflection, or deep discussion from the annoying brat. Not a moment where he realizes that he placed his trust incorrectly, made assumptions about an entity he doesn't fully understand, or how the harsh realities of the world are starting to close in on him. Nope, just \"NoOoOoOoOo! *sob* NOOOOOOOOOO!!\" I was basically hate watching these cutscenes until the final quest finished, then I skipped everything after. If they couldn't make a good main story, I don't expect them to make a good substory anywhere else.\n\n2: Features that should be in the game but aren't\n\nI find there are many options for various features in the game, such as disabling damage numbers, resizing parts of the UI, controller schemes/keyboard configurations based on weapons, how your mount reacts/functions, and even some avenues to get certain lvl 1 decorations for your gear. That's just to name a few, but there are some that I would EXPECT to see, but don't. Why can't I dismiss Alma? I don't want her following me around all the time. Why can't I turn off ALL subtitles? I don't want my palico (Gods, why did they make them TALK?), Alma, or some random NPC taking up screen realestate while I'm taking in the scenery. Why can't I hide most UI elements while in combat unless I hold a key like left bumper to scroll my items? I don't need 25% of my screen being taken up by a minimap, item bar, quest objectives, and combo helper. That's not even getting into the Artian weapons. Why isn't there any sort of rerolling of the modifiers for these? Why are event quests limited timed still?\n\nSome of these things you can fix with mods, some you can't. I have things like no subtitles, hide \"recommendations\" (if you play, it will CONSTANTLY show up on the right side of your screen), and a shader to make things more vibrant and disable the vignette as it washes everything out. You can't really do anything with the UI except just hide the whole thing. There's some things I want to see, like my HP, Stamina, Sharpness, but I don't need to see basically everything else.\n\n3: Monsters\n\nWhat's here is great. I won't downplay what they have because they've masterfully remastered old monsters while introducing fun and intriguing new additions. Three problems.\n1, there aren't very many monsters in the total catalogue. This was an issue with World, but I gave it a pass because they were breaking into a new mold. They made so many amazing choices for the franchise in terms of looks and feel that I was willing to give them some slack. I don't really give the same credence to Wilds because they should have a better workflow by this point and should be inclined to make a better product. If you're going to jack up the price of your game to 70 USD, I'm expecting some higher quality from that extra $10.\n2, it's way too easy to kill monsters. Wounds are a new mechanic introduced to the game. The clutch claw in World was an obvious problem because it warped the way the game was balanced to the point they made the Lunastra, a boss you HAD to use the clutch claw on to get a weak point to do any damage to. The clutch claw would also give you massive multipliers in the form of Weakness Exploit crits and higher weak spot damage. Wounds are similar, but spawn randomly when dealing damage to monsters. However, because of the nature of them, you're heavily encouraged to just throw your body at the monster and be highly aggressive. The more damage you do, the more wounds you get. When you break a wound, you flinch the monster and do a lot of damage. Sometimes you know them over, allowing you to push more damage, make more wounds, and repeat the cycle. You can accidentally speedrun monsters and go, \"Oh, I guess it's dead now.\"\n3, Monsters don't interact with the world or each other enough. I've seen two turf wars in total in my time playing, and one monster who changed the environment at all. The Balahara, a sandworm, is arguably the most interesting monster to fight (when it's not being stunlocked) because it can create sandpits which actively WARP the ground you're fighting on, and enable him to do unique attacks. This monster also likes walking on various pieces of terrain out of your reach so encourage you to knock it down with some slinger ammo. This is the only monster in this game that interacts in the world in any way. It's incredibly sad because this monster being shown so early hypes you up and raises your expectations. You're READY for more monsters that do stuff like this, but none come.\n\nPerhaps this is because of time constraints (... where's that extra $10 going, CapCom?), but I did genuinely expect higher quality in the main meat of the game. It's a step up from World, sure, but it's one step.\n\n4: (optional) Performance.\n\nI'm pretty sure performance issues people raise stem from the extremely high demands this game has. World felt just as rich and dense zone to zone, area to area, but was able to play on significantly worse machines. I had to crank down some of the settings for Wilds which was surprising to me. I didn't think 8gb of VRAM would be barely enough to have this game run smoothly. Poor optimization is usually a sign of rushed development or negligence (where's that extra $10 going again?). I wouldn't even consider playing this game with less than 8gb of VRAM. It says you can play with 6gb on minimum settings, but I don't buy it.\n\n\nWhen I saw a friend give this game a 5/10 score, I thought it was a bit harsh. After playing, it's not far off but I would say 6/10 is more fair. Disappointing,",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Ive been playing monster hunter since i was a little jitnum with freedom unite on the psp and have played for thousands of hours on each mainline game. it sucks that capcom is focusing more on big updates and microtransactions (141 dlcs btw) (in 9 months btw) rather than fixing whats making so many of their customers so upset... monster hunter world has already proven that a series as environment-intensive as monster hunter does not need to be upscaled to the max in order to look beautiful. i do not have the best rig, with a rtx 2060 as my gpu, but if i can run modern games like resident evil 4 remake, silent hill f, baldurs gate 3, tekken 8 and dead space remake among others at medium settings for 50-60 fps, then i am extremely confused as to how wilds runs at a nice and crisp 20 fps at all low and up to 45 with some external sources. doom eternal isnt the biggest game ever, not even open world. but if i was able to get doom eternal running at 100+ fps EASILY on my old pc that had a gtx970, maybe there really is just a problem with the optimization with this game. again, so sad that events and dlc is what capcom is most important for even their most loyal fans... (61% recent negative reviews btw)",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Game runs horribly even with the settings on the lowest it can possibly can be",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "This game feels like it was made both for the most senile old man and the most sweaty gamer at the same time.\n\nIt somehow manages to make me feel near constantly overwhelmed, while simultaneously trying to hold my hand through it.\nI've yet to see a game as poorly optimized, cluttered, and railroaded as this one.\n\n\nYou spend the first hour of the game compiling shaders and the second in character creation + tutorial.\nIt almost feels intentional to make you unable to refund it\n\nThe game (disregarding combat) feels sluggish and hard to control.\nIt feels like I'm being put in a headlock any time I try to do anything.\nOne misinput and you're suddenly on a bird 50 feet away from the thing you were trying to interact with.\nBut when you actually want to use said bird, it suddenly doesn't know how to sprint anymore.\nIt feels like I'm constantly fighting the game.\n(I'm aware this could be a skill issue, I just feel like they could've done the controls way better)\n\nI personally dislike the combat but I know people do like it so I won't commenting on it.\nI DO however have a problem with the amount of filler in between said combat.\n\nYou go through on-average about 1 side quest and 5 cutscenes in between hunts.\nSometimes it lets you skip. Other times you are forced to choose the most bland unimpactful dialogue options imaginable.\n\nMenus are all 15 layers deep and half the numbers on weapons mean nothing.\nThere's so much garbage on screen at all times that you never have any idea what's happening.\n\nDon't be fooled by the large landscape. This is not an open world game.\nYou are forced to walk down a linear path the whole time.\nWhich I wouldn't be too upset about if it was made clear from the start and didn't disguise itself as an open world game.\n\nThe game constantly babies you on things. Like your bird mount automatically moving to quest locations. Which would normally be extremely insulting, but considering that playing this game is like navigating a hoarder house, I think it's necessary at this point.\nI've heard it gets better after the story mode but I cannot stomach another hour of this AAA horror show.\nI haven't played a single game that makes me more irrationally angry than this one.\n\n\nAND THAT'S NOT EVEN MENTIONING THE OPTIMIZATION.\nI could, without exaggeration, fit my entire indie library in the storage space this game takes up.\nWhat's the point of adding so much stuff to make the game look good, if it's just going to end up running at 5 fps?\nThe best example I can think of is the graphic that appears on screen when you begin a quest.\nAs soon as it appears. The framerate gets quartered.\nThe same goes for the title screen and loading screens\n\nImagine if you will, how much performance they would have saved by making those into .GIF or .WEBM files.\nNews flash. DLSS won't make your game smaller.\n\n70$ is an absurd price for any game. Especially this one.\nI got it on sale and still feel scammed.\nDo not play this game.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Great Monster Hunter game. The weapon changes are fun. The new wound system is better than the one in Iceborne. The monster design and variety is great. The open world does not add much but is a technical feat, I guess. The production value was clearly THROUGH THE ROOF in a good way. \n \nHowever. The performance is completely unacceptable for the overall look of the game. When Capcom, the current top game dev IMO, decides to fix the game; I may decide to recommend it",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "was enjoying this until omega came out. As annoying as Behemoth was in MHWorld, savage omega is just a generally annoying and tedious fight in comparison. If annoying raid fights is the direction capcom want to go, maybe they should just make their own MMO instead of infesting MH with this rubbish",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "It actually hurts to post this review as I am a long time fan of the series. Started with 3 on the wii and eventually the 3ds version. Ive gont back and played the original, all the way up to wilds. I have liked every monster hunter and loved a few (Generations and rise). I do not care about the streamlined gameplay, I do not care about \"lack of content\" I care that the game runs like shit. If I cant even play the game I cant even complain about the gameplay. I have a good computer and can play most games on ultra, this does not run well on medium on my machine. This is actually unusual for Capcom as their other PC ports run fine, hell RE8 runs 60fps on steam deck. Once capcom fixes the performance issues on pc ill change this review to positive. Until then, it will remain negative. Capcom I know you can do it, so do it.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "The performance is unacceptably bad, and basically the only installment of this franchise that is just unplayable for large swathes of people due to horrific performance.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "It's the ultimate iteration of everything that is wrong with 'modern' monster fighter, every preparation is dumbed down or removed, you have an infrared monster homing taxi, contrast is even more absent that it was in World, monsters have very low health, resulting in hunts finishing astonishingly fast (with a completely unoptimized hunting horn build mind you) etc. \nCapcom wanted to widden their net even more for a larger audience to the price of core aspects of this licence. \nReceiving this game as a gift from a friend was of an unexpected blessing, indeed allowing me to avoid financially participate in this freefall.\n\nNow my second gripe : Absolutely terrible performance for the graphical fideflity on screen. Moreover, I have trouble understanding the purpose of connecting each map/region. Instead of a quick loading screen you have a 15ish seconds buffer passage and a cpu usage spike, what a change. \nWho asked for that ? What exactly is the purpose of connecting them ? So that the game can be sold as open world ?\n\nThe only good point that i'll give to this title is the superior roster compared to base world.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "The game just holds your hand and does everything for you like a triple A game, this is not what the monster hunter player base wants.\nAlso it's 80% cutscenes 20% gameplay, horrible design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I can't believe I spent $70 on a game that runs like dog crap and crashes right after I spend 45 minutes fighting a monster.\n\nand they have the balls to charge for DLC when the game is in this state?  Screw you Capcom.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Ever since the game recieved the 'hotfix' patch on october 30th 2025. The game has been rendered completely unplayable. Crash after crash after crash and literal hours of troubleshooting and follow each and every single step meticulously has made no improvement. Either the game loads just past the menu and hard crashes my pc to the point of needing to hard reset, or the game would play for barely a minute and flash a D3D 24 error message then crash to desktop. This is the result of pushing games out without proper testing. Do not buy, do not recommend unless Capcom decides that dedicating actual time and effort to fix things as a priority.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "i want to love this game so bad. the characters, environments and music are on point. but ever since the two betas and into the full launch this game just feels off to me and i cannot pin point why. the performance is obviously a big part that to this day is still not fixed. but just in general the game just feels off especially with the weapons. i play charge blade and switch axe and i know everyone says that everything is nerfed or how moves were moved around taken away or locked behind certain actions. its not those. it is something else it just does not feel right and i hate that i cannot pin point and tell you why. even with my coop partner it took me so long to get to HR 100 not because it was hard or that it was a grind. i just did not have the grind to do it. and now i only come back to the game when they add a DLC or a special event comes up. i want to love this game so bad because i have loved all the other games in the past but this game is just not it for me. ill recommend the game when they actually fix the performance because that is really the biggest crime going on here but until then i would play one of the older games.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I really love the Monster Hunter Franchise, but this game is just disappointing to me. Playing it feels like a linear game where you just press forward and the attack button in the right moment. There's no thrill of hunting anymore, like in the previous games and they lost the feeling of being able to challenge one self by actually managing to complete the hunt. Now theres just the question if you succeed in at least 20 minutes or earlier. Being able to hunt a supposedly hard to hunt monster in under 10 minutes just feels like they gift you everything and you dont have to focus. Weird cause now theres the focus mode. So the game does everything for you. I just would have wished it to be harder and more rewarding in a challenging manner than in rewarding with free loot whenever you just look at the monster.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "worked great at launch, but now cannot even launch the game without it crashing during shader compilation. sad that the PC optimization is this bad",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I don t even want to mention the performance issues of this game. Just trial the guy and put him to j*il for this crime. 10 Months after release, still no optimization patch. They got the money, why would they even bother. I ll just have to be more carefull, from now on, with Monster Hunter Titles.\n\nWhen it comes to positive things about this game, one of them is the quality of life improvement over the other titles.\n\nThey also tried to make a kind of story. My personal advice would be to just focus on gameplay and optimization from now on because sincerelly, if the guy who managed the optimization deservers, at least, 5 years in japanese j*il, the one who thought the story, must serve at least 15.\n\nThere s this boy Nata, I m not the a**ressive kind of guy, but oh god how much I wanted to p*nch that little f**ker.\n\nDon t buy this game until the fix optimization. It would be a great game if it had any fps whatsoever.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Simply put, I've given the game time and they still have half the monsters as World did on release. Severely lacking content. \nGameplay is good, the new focus system is a little busted and makes GreatSword fairly dummy-proof, but is what it is and its not bad, just levels out the skill floor on the weapon. More accessible to everyone. \nI think we get monster items too easily, but thats just my opinion. Kinda hoped we had to work a little more for a gearset. \nI don't experience it, but a lot of people having optimization issues kills the playerbase, as I like to pop in and help random flares. \nJust overall fell flat and is extremely disappointing. My issue is mainly the massive lack in content. The story was awful too, but I don't play MH for the story anyways. Hoping they get their stuff together by the time they release Master Rank, or this might be the 1st MH/expac (US release) I don't  buy since Freedom Unite.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This series is getting a divorce with good game design, this is just the paperwork.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "- Runs like ass\n- Focus Mode ass\n- GS ass\n- Too much QoL ass\n- Seikret ass\n- Maps ass\n- Forcing Story in MonHun ass\n- Graphics ass\n\nGame ass buy Rise.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Go play World or Rise, Generations Ultimate and 4U are also good if you have a switch or 3ds. If you’ve already played all of the games I’d sooner recommend replaying any of the previous entries over Wilds.\n\nFirst off, the game performs terribly. Frequent crashes, frame drops, texture issues, severe pop-in, random freezes, etc. I was running the game on hardware slightly above the recommended specs (2070 super, 16gb ddr4, Ryzen 5 5600x) and was peaking at about 15 fps before frame gen. I’ve since updated my hardware (now Radeon RX 9060XT, Ryzen 7 7700X, and 32gb ddr5) and the game still runs like shit. I’m currently peaking at around 30-40 fps before frame gen and can’t get some really distracting ghosting issues to go away. It’s honestly astonishing how poorly optimised the game is. Maybe the game runs better for you, I still can’t excuse the amount of issues so many people are having.\n\nEven if the game ran flawlessly I don’t think I would give it a positive review. Monsters feel like they do no damage, partly due to the starting armor giving you 3 levels of divine blessing (a historically insanely good ability in monster hunter), partly due to them just being nerfed into the ground in general. I upgraded my armor once (which honestly felt like a downgrade cause I lost divine blessing) and my weapon three times throughout the entirety of low and high rank. Still coasted through the game no problem. The new wounds system paired with paralysis being broken allows you to stunlock monsters and do ridiculously high damage. Focus mode has killed positioning and any forethought to attacks. (Greatsword users rise up! We finally have 180 degree true charged slash trick shots… you wanted that right?) You don’t get punished for getting hit. Though honestly, that might be a good thing considering how hard it is to read some of these monsters through all the visual bugs. \n\nTempered monsters and post game don’t fix the difficulty issue. Just because some fights long into post game are actually “hard” (read: you haven’t had to engage with the mechanics until now and the monster has 8 trillion health), doesn’t mean there’s a challenge to the game. Why would I engage with this content? I don’t want to play through an anemic game just to get to content that punishes me for not having engaged with its previously sleep inducing gameplay. I’m not asking for the game to be the hardest game ever, just for it to engage me with some modicum of difficulty. I’m glad the game is trying to open the door to newer players, but I can’t see this engaging them much. I feel like anyone starting with wilds is going to have a similarly easy time and just miss what made the games good.\n\nBeyond just the lack of difficulty the pacing of the game has been completely killed compared to older entries. Anywhere there used to be friction has been steamrolled over. There’s no longer a need for preparation, you literally get items delivered to you mid fight. You don’t have to actually find the monster, you just get taxied to it. There’s no downtime between hunts unless you fight the game to get it. Worst of all, the game's environments are actually phenomenal if you find the time to notice it somewhere between the endless walking segments and being escorted to hunts. The seasons are a welcome addition to the areas, the color choices are great, there's detail everywhere you look, it all feels inspired. But seriously, when are you supposed to see any of that? In World you learned the general layout of the maps and got to gawk at the environment while gathering resources. In the wild there’s simply no reason to do so, really the game actively pushes you away from doing it. \n\nIt sucks cause there’s some genuinely good stuff hiding under all the issues. The Rey Dau fight is fantastic, easily in my top 5 for the entire franchise. The aforementioned environments and ecology are great… if you get the chance to see them. The power clashes feel amazing and add a lot of energy to weapons like the lance. The soundtrack has its moments (why the hell is Capcom charging SEVENTY-FIVE USD for that btw?), though it feels like a bit of a step down from previous games. Armor is no longer locked by body type, so we can finally mix and match to our hearts content. Also the character creator is one of the best I’ve ever seen, you can truly make anything you set your mind to. I just wish these features were in a game that was actually worth your time.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I'm newer than most Monster Hunter fans. I hadn't even heard of the series before MH World released, and I didn't even seriously play it until MH World Iceborne released. Over the course of a couple years, I played MH World, and later, MH Rise extensively, leaving very little left behind to do in either title. I played both of these games with a fervor that I've not had for a game series since the early Xbox days that solidly cemented it as one of my favorite game series!\r\n\r\nMH Wilds is not like these games. Perhaps you could argue that playing a MH game that's nearing the end of its supported lifespan is different than being there as the game is being updated, but other reviewers share a similar sentiment; Wilds has very, very little content, and has not been getting as many updates and content as fast as it should be in spite of its obviously higher budget. We are nearing a year into its lifespan, and we've seen the addition of 3 new monsters, the final boss as a replayable hunt, arch-tempered version of the apex monsters, a crossover boss, and our first Elder Dragon in the near future. \r\n\r\nMeanwhile... We've been getting constant paid cosmetics and problematic transactions that earlier titles also had like character edit vouchers. Between these and many reused animations from a... similarly unsuccessful game, I don't feel like it would inappropriate to say Wilds is suffering from some sort of... Dragons Dogma-fication.\r\n\r\nPerformance is still extremely terrible, and several mechanics are half baked. Some monsters will deal damage even through perfect blocks, and blocking enough attacks initiates a power clash... But only on less than half of the monsters in the game. Artian weapons are similarly poorly implemented, and are basically just the absolute best weapons in the game once you get a good roll... which is entirely RNG unless you're so bold as to install mods to let you edit the traits on your roll.\r\n\r\nBetween performance issues, lack of content, and over-correction of difficulty due to a vocal minority complaining about how easy base game was, I don't think Wilds is in a good enough place right now to be worth playing over an older title, or a different game altogether. I'd tell anyone who reads this to go play MH World or MH Rise if they haven't. Both are phenomenal games - Admittedly with their own problems, but both possess an overall more complete and enjoyable experience than MH Wilds does within a year of it's release.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "TLDR: Dont buy this till developers optimize the game.\r\n\r\nI had so High expectations from this game , i upgraded my gpu from 2060s to 4070s because i did not want to rely on dlss, I purchased new nvme ssd because the game required it as well. But even after doing all that and buying this game which costs half the rent of  my 1 room apartment, the game performs like dog$hit on my pc , I can roam around the map without dlss but as soon as i get into the base camp in windward plains my fps drops so bad. Even with high quality textures the game does not look good the only good visual experience i had was while fighting rey-dau and arkveld other than that everything looks like a blurry mess of pixels, I tried so hard to love this game but it keeps pushing me back. The developer response has also been so poor , instead of addressing issues and fixing it they ask us to download updated drivers , spoiler alert the game still runs bad after doing that , i get stutters even with dlss at this point.\r\n \r\nI still have some hope for this game and have stopped playing till they release fixes and optimize it so my friends can also join and play. I am waiting for the inevitable dlc release and i am still willing to buy that if they decide to actually wake up and optimize the game like they should have done from the start.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game was unfinished at launch, and after many title updates it's *still* not there. It lacks a whole bunch of features and immersion from it's predecessor (Monster Hunter World) and unlike Monster Hunter Rise, it doesn't have the excuse of being a switch game to justify it. It didn't have a hubworld, multiple features were either cut or underdeveloped, and don't go anywhere, the story ends before high rank begins (leaving a huge gap between the plot, and it's eventual continuation in the upcoming expansion.) and most importantly of all..!\n\nThe game runs horribly. Heresay doesn't do it justice, it's baffling how bad it is. It's lack of optimisation and terrible design decisions are perhaps it's most iconic traits at this point. It's built in Capcom's RE engine. An engine designed for linear, compact, and detailed worlds and environments. Capcom decided to build a massive open-world game in this engine. And add raytracing to it. Suffice to say, it didn't go well, and sales trends reflect this.\n\nAll of this is of course said with a heavy heart. This series is very dear to me, and something like this feels almost unprecedented for the Monster Hunter team. The game's story is very good for what it is, and perhaps the best the series has had so far. It's gameplay is for the most part very fun and engaging! Different to older entries, much more fast-paced and parry-heavy, like many other action games out there... But it's done very well. It's a beautiful evolution of previous ideas and mechanics that ties together into what COULD have been a definitive experience. One that blends everything they've tried for the last 10 years together.\n\nBut it just didn't make it. It falls flat on it's unfinished face. A longer dev cycle - maybe a few more months? an extra year? - could have helped, and might have even given us something serviceable. Something I'd by no means call perfect, but would absolutely have recommended. But it was built on an unstable foundation from the start. Core descisions made before they even started development doomed the game to it's unfortunate fate. It couldn't ever have been perfect under the circumstances it was created in.\n\nAnd so as of the time of writing, I cannot in good faith recommend this game. I think it's wonderful ideas and potential simply aren't enough to shine through the mess of everything else about it. Monster Hunter World, many previous entries, and even Rise (for all it's own flaws) will unfortunately remain better investments of your money and time.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Good game, but it runs like shit so I can't recommend it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Wildly fun with creative and unique monsters and especially companions (compared to world, they actually have names)\n\nI can't in good faith however give this a good rating simply because of the outstanding performance issues. This should have been resolved before it ever launched but instead we now have a great game hindered by constant crashing and poor optimization, needing the beefiest of hardware to even run it without the guarantee of smooth gameplay or at least a sprinkling of crashes. Shame on Capcom for not even having fixed it yet almost a year after launch with the issues getting worse and worse and an even angrier fan base. \n\nI'll still be playing it but I can't in any good conscience recommend it to anybody until these long standing problems have been fixed and maybe then I'll change my review to a good one. If you're interested in Wilds, just play World instead it's better and actually runs well.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I love this series, but after beating the game, I can't find myself getting back to it even after the additional content and the upcoming ones just because how poorly optimized it is.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "While a very fun game at it's core, after reaching the end game, fighting every monster, and doing all the content that I'm interested in doing, the game doesn't really hold me at all. I only come back to this game after an update drops, play it for like a week, then drop it and repeat the cycle. For whatever reason, this doesn't give me the same drive to try and experiment with new builds or weapons like Monster Hunter World did. I try things out and they either just don't feel as good to use as the optimal or \"meta\" options, or what I'm using ends up being ever so slightly different from what I normally use so it ends up being the same deal. I enjoy my time in Wilds and I look forward to the future of the game, but with performance that is still finicky at best, lake of substantial end game content that actively makes me want to keep playing (atleast at this current point in time), the weapon feel being all over the place and some weapons just feeling unusable at times, the price of both the game and it's dlc being pretty expensive and the game just overall not as generally appealing to play as apposed to other games out right now, and I would say that this game is hard to recommend to someone. Most of my complaints come from personal bias, but until there is a huge update (something akin to a dlc like Iceborne or SunBreak) or there is a good chunk of content to work through after finishing the story content, I will probably spend my game time somewhere else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Despite being able to play the game, it still has some issues and I don't need to give the details since most of you would know why or already read the top reviews that provide better details on why exactly.\n\nMonster Hunter Wild is probably the only game that got me into going all in. This is like after jumping in and out several time along with World just to get the hang of the pace in the game, but I feel Wild is better for me. However, it's biggest problem right now is optimization because there are numbers of complaints between new + vet players struggling to play the game right now. Not to mention NEW ones that came to surface like this one issue where I can't exit the game after I save. I could return to title but even I couldn't exit until I either switch tab or try to manually end task it.\n\nWith that said, I would wait for a while longer until the game is stable enough to play.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The game is very enjoyable and refined some mechanics that makes it hard to play older Monster Hunter titles.\n\nHOWEVER:\nThe optimization is horrendous and is not acceptable for a game such as this. Because of this, it deserves a thumbs down, so Capcom may listen and fix this before adding in master/G-Rank.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Big fan of the series. Over a thousand hours in these games. I am crazy autistic about this series. Put about 300 hours into this game on the Playstation 5. Playing through the main story all the way to the end game fight was extremely fun and satisfying. The end game is almost non existent and obviously the optimization on PC is a myth. \n\nI would recommend the game on PC if in the next couple title updates or the expansion if they fix these issues. Otherwise I would pass",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The gameplay is the best it's ever been...\n-Cool fights and environmental arenas.\n-This gen's gimmick is fun to use.\n-Equipment builds are really fun to play around with.\n\nSadly the rest is absolute ass and overshadows the good by a lot. \n-Runs like crap even in a decent computer.\n-The UI is menu hell.\n-The story is non existent (whish there was an option to jump straight into HR).\n-Although there have been changes that make it easier, grouping up with friends is stupidly convoluted.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Been playing Monster Hunter titles since Tri on the Wii, this title has turned me off the Series. \r\nWorlds and Rise were the peak of the series, this is a poor attempt at surpassing them.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Multiplayer is still in a barely playable state after all this time...",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "As a real veteran, I would say it's totally a piece of shit, especially compares to the previous series. Extreme terrible and unbelievable optimization.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "literally have played 80 hours of this game with little to no problem. now all of a sudden it is literally unopenable. have tried every single fix yet its simply summed up to horrible optimization. its a really amazing game when i get to play it",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The monsters are a joke and everything has been so simplified I don't even know the map or what the monster do anymore. Every last bit of tension and difficulty was ironed out of the game and oversimplified. It also has horrible performance and arguably looks worse than its predecessors while charging more and being released without many basic features.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Been waiting on them to optimize the game so it doesn't fry my PC, looks like I'm still going to be waiting. \r\n\r\nGet it together.",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "I really want to play this game and enjoy it, but it keeps crashing. This wouldn't be a problem, but I know this is an issue for a lot of people and it should be getting fixed. The computer this game demands is honestly over the top too.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "i really like this game! do not get me wrong! i will likely continue to play it for a long time. i got into monhun by playing through world with my husband as my introduction to the series, so i am somewhat new and not very good. i do not play optimally at all.\n\nPROS:\n-if you can run it on high, it's a very pretty game. it's decent at medium settings.\n\n-the designs for everything are good; all the weapons are great, and some of the armors are my favourites in any game(here's looking at you, numinous & dahaad). \n\n-and the character creator is great!\n\n-the story is okay at best, but an improvement over world's.\n\n-alma being our handler definitely feels a lot better than world's handler. the characters in general do feel more like people and less like NPCs. this is not to say they're particularly good in general... just better than immediately previous.\n\n-i LOVE the seikret. from a design standpoint, it's so cute! i also love that you can keep a backup weapon on your seikret. it adds a lot of fun and seamless variety.\n\n-the monsters are largely very fun, even the ones i don't like fighting. each one has a point of interest and feels distinct enough that it isn't samey, but related enough that it feels cohesive.\n\n-mizutsune is here... now if only they would add paolumu....\n\n-the skill floor is a lot lower than world at the low/high rank levels. you'll probably have a very easy time with getting into it for most weapons, if this is your intro to monhun.\n\nCONS:\n-the game's difficulty spike feels very stilted. as stated, low/high rank felt very unchallenging to me, even compared to world's low/high(which was pretty fresh in the mind when i started, fwiw). but getting to high rank, particularly when they stopped having to do anything with the story, it felt like a sharp uptick in damage received and a decline in damage dealt. this isn't necessarily a problem, i guess, but it does feel too steep compared to world.\n\n-also... it really felt to me like they sacrificed gameplay for story. and it was not a worthwhile story. maybe i'm being harsh because i generally prefer story-driven games, but this story was extremely flawed in ways that felt very obvious and relatively easy to fix. nata, the primary focus of the narrative, is little more than a plot device that has occasional outbursts of personality. it's jarring when the game attempts to give him some emotion because outside of those moments, he just... doesn't exist. he never interacts with anything or anyone besides the player and alma. you'd think a kid who walked across a desert to find help for his people would be a little more proactive in the search, or even just interested in the world as he was completely sheltered from literally everything, but he just... has no inner world. he doesn't exist until the game needs an emotion to be conveyed, and even then, it tends to feel unnatural. i think some moments did work, but the vast majority felt underdeveloped and contradictory.\n\n-and like i said. the gameplay suffered. insect glaive, my favourite and main weapon, is extremely uncomfortable to use. i fell in love with world's satisfying, stylish, almost whimsical rendition of the weapon. it was the only thing i used for the entirety of the game, just because it was so fun and i loved the verticality it offered. it felt sprightly! it felt like i was a cool woodland fairy killing a big dinosaur with my weird bug friend. and wilds deeply disappointed me. it feels heavier than world, but not in a way that i like. the vaulting and aerial combat i favoured so much in world felt very strange and half-baked. a friend told me that they added the aerial elements last minute and it feels like it. i still use it, but it's in spite of the slog and uncomfortable controls. also, i have to play a lot less now; i have bad joints, and playing these controls definitely hurts my hands more.\n\n-the optimization is a dead horse, but it deserves to be beaten. in theory, my PC meets the minimum requirements to play this game; i got a 'good' on the benchmark, with an average of ~50fps. not great, but i thought it was fine. i'm very casual! my standards are low! but when i got to the actual game, it was virtually unplayable. in the worst fight i had, my frames dipped to 10fps on the lowest settings(i did have frame gen on; it was worse without it obviously). that's like... actually insane. at no point during the actual play of the game did my fps go above 40. so the benchmark is not accurate at all, likely due to the addition of denovo(sp?) in the full game. as far as i know, the benchmark doesn't have denovo, which made it easier to run on my poor little baby pc. my husband's pc is a lot more powerful, so i tried it on his, and it is better, but nowhere near what it should be considering his hardware. i heard somewhere that this is the devs' first time using this version of this engine, and it shows. it's not their fault that capcom released the game like this, but it definitely was not, and in my opinion, IS NOT ready for a full release by any stretch of the imagination.\n\n-like, none of the settings have any significant impact on my fps. how do you even manage that? did you model every individual atom? what's going on there? \n\n-on a less serious note... no paolumu. this is a huge negative for me personally. \n\nanyway, i like this game in spite of itself. i just don't think it's at all worth the full price. i got it  on a really good sale, so if you can get a ~45%(or ideally more) discount, and you get an 'excellent' on the benchmark with an average of 90fps, try it out! but otherwise, don't.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Love this game. Wish I could actually play it, but it runs like my computer is from the dark ages. It is not.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Monster Hunter World is one of my favorite games. While it wasnt my first Monhunter game (Rise was) I quickly fell in love with the world and exploration. So, when I first saw that we were getting a new mainline addition to the series, I was beyond excited. \nWhen they launched the Playtests I played all I could, and sure, it was a mess, but its a playtest, the time where bugs are noticed, and fixed. That is, if any other team handled that test period.\nSince then 9-10 months after the testing period, the game overall has somehow gotten worse in terms of performance. Stuttering, Missing textures, shaders improperly loading, or simply refusing to load. Which is a shame, the game is gorgeous when it runs. But usually, it doesnt. \nI bought the game when it released, and I incorrectly presumed a lot of the early issues would be fixed. For example, most of the textures refused to load in the third area, the Oilwell Basin. Not one little area, but the whole zone was a gray incoherent mess, where neither the oil or even the walls and ground loaded properly. While this eventually was slightly addressed, the performance there is still with the rest of the Basin, buried in the pits under oceans of slimy muck.\n9 months since launch (roughly) and there havent been any major changes to address the performance issues on PC outside of a shader cache bug. More so, each update has CONSISTENTLY tanked performance. This is inexcusable for such a large company like Capcom on launch to have these issues, much less most of a year into the games life STILL being unaddressed. \nNow with TU4 on the way, taking place in the area with some of the worst performance issues in the game (yet,) my excitement for Gogmazios is severely diminished with the severe lack of large scale performance fixes.\nI hate to review a game I was looking forward to so negatively, but I do not recommend this mess at all in its current state. The game feels severely unpolished still. If they ever decide to address the performance in a significant manner, rather than focus on increasing difficulty and selling DLC, I will gladly change my review. But for now, literally spend your money anywhere else, capcom doesnt need more money they wont put back into the game",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Pro:\nReplayability, with lots of weapons\nGaming with friends\nMonster design and music\nAtmosphere\n\nCon:\nGame Performance\n\nGenerally weird, if not even ugly NPC's. Maybe the uncanny valley, maybe the textures, but it just is unsightly\n\nThe overworld map is bad on purpose, because they'll make a more streamlined Guild Hall in a paid DLC. How do I know? Because they did the same in World with Iceborne, but it's even worse here. Why must I fast travel to an NPC's location to smelt decorations or edit seikret?\n\nMultiple Hubs means multiple NPC layouts. I can never find the smithy, Alma, or the shop because they're location is always randomized\n\nCannot hunt all monsters when you want. You have to wait for it to randomly appear on the map or sos. I'm not even talking about random guaranteed item drops, just the monster itself. Wanted to fight Xu Wu but never appeared and nobody needed help so i had to wait.\n\nIn my opinion a con:\nSeperate decorations for weapons AND armor\n\nItem and shortcut sorting and editing\n\nArtian weapons make the \"normal\" weapons reduntant",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Get rid of Denuvo DRM and Capcom Anti-Tamper, then I'll play the game and leave a real review. As it stands, I got this game for free and it makes me wish I could demand a refund.\n\nI'm running a 5700X3D with 32GB of 3600 MT/s CL14 RAM, yet get the same (~50 fps) performance at 1440p maxed out with no RT or frame gen on an RX 6800 and an RX 9070 XT. Looking into it I discovered that all of my CPU cores are being ass blasted by the double DRM setup that, ironically, has driven away more sales than piracy ever could have. When it became apparent 6 months ago that pirating the game makes it more accessible and playable than buying it through official channels, that should have been a massive wake up call for the publisher. Instead, Capcom collaborated with Fender and Square Enix on goofy crossover content instead of fixing their $70 game. It's just insulting at this point.\n\nMaybe the game is alright, but in its current state it's unplayable for the majority of PC gamers and not worth buying right now. GabeN was right 20 years ago: piracy isn't a money issue, it's a service issue. Do with that what you will.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "TLDR:\r\n\r\nAmazing game, but terribly optimised. So you shouldn't buy it. I got lucky because it mostly works on my PC. Odds are it won't on your PC. And if that has changed since launch or does change in the future, you should still avoid buying it because Capcom needs to be taught a lesson or they'll do this again.\r\n\r\nDISCLAIMER:\r\n\r\nI only even bought the game because some friends I hadn't gamed with in a long time were trying it out, and so I knowingly took the risk of buying a broken game to spend time with them. Ironically I was the only one of us who consistently got good performance. So I'm the only one who kept playing.\r\n\r\nBut yes, I know I'm a hypocrite and part of the problem (my purchase encourages Capcom to release more broken games) by telling you not to buy this game due to poor optimisation when I knew about that poor optimisation before I bought the game. I just wanted to hear my friends' voices again.\r\n\r\nIf there's less on the line for you, then hold the line and don't buy Monster Hunter Wilds. It's what's best for all of us in the long run.\r\n\r\nEXTENDED REVIEW:\r\n\r\nMH Wilds' being a broken game is such a shame really, because the devs REALLY cooked and despite the smaller roster of monsters (at launch at least), I think so many other parts of Monster Hunter have been refined in Wilds.\r\n\r\nI genuinely think that was worth launching with less monsters, since the devs have built a MUCH stronger foundation than the admittedly great one they already had from previous titles. This newly reinforced foundation will carry on to expansions and future titles (assuming they don't switch to a different engine which forces them to start from scratch).\r\n\r\nStory (no spoilers):\r\n\r\nThe story in particular had a MASSIVE improvement. It's not perfect, but it IS good. Which was a compliment I simply could not give to MH World (I didn't finish Rise). It's not just the writing but also the way it's delivered. In World, the story felt like it intentionally did the bare minimum to get you to the next monster. MH Wilds makes each new monster feel like an obstacle you need to face to move toward a larger goal. They're either in your way, endangering someone whose help you need, or they're a crucial piece of the puzzle required to solve the mystery lying at the heart of a long dead ancient civilisation.\r\n\r\nGameplay:\r\n\r\nI'd go into more detail on the gameplay itself, but while I played MH World in full, and a LITTLE bit of Rise, my knowledge on gameplay is nothing compared to that of the truly seasoned veterans of this franchise.\r\n\r\nThe early game is too easy in comparison to previous games. You will start getting challenged when Tempered monsters show up, but by then you've already beaten the final boss of the main story.\r\n\r\nHowever as of 10/11/25 (10th of November for you simpleton Americans) some new VERY challenging fights have been added. Don't think it rivals my MH World PTSD yet, but they're still awesome.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "At launch game ran ok-ish. Now with the new update it just crashes. Pls capcom fix i beg",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Sigh. I write this with a heavy heart. Capcom, I am beyond disappointed. I am in no way, shape, or form a casual player. I'm sort of middle-ground when it comes to MH. I love a good challenge, and I accept the fact that I need to git gud when things become challenging. However, what I don't appreciate, is you ruining the game completely for me. I have been in love with MH for years on end. To avoid writing a soliloquy, I'll get to the point. Stop letting the masses dictate the game for other players. I can't even play the game right now with the current state Omega is in. It's so hard to find people to play with in the discord to clear this fight, and when I'm not dealing with trolls, I'm suffering through the many disconnects my partner and I encounter with our SQUAD LOBBY every time we play. At this point, I hate to say this, but if people want the game to be brutal, then add a difficulty setting in the game going forward. Because I did not give you guys my hard earned money, just to not be able to clear a fight, due to OTHER PEOPLE NOT BEING SATISFIED ENOUGH. It's outrageous. It's bad taste. It's disgusting, and it's a direct response to the harassment you received about performance. In which, Capcom... I do NOT condone harassment, but to respond to it in this way? I wasn't born yesterday, I see this for what it is, and it's gross behavior. Fix your game. End of story. As a long time fan, I am severely disappointed, and I cannot even convey the amount of glazing I've done about your franchise to my friends. All to turn around and be disrespected as a semi-casual player. The betrayal. Check your ego and fix this because this is NOT the way.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I specifically didnt buy a ps5 but rather upgrade my pc almost completely with the recommended requirements for this game and it can't stop crashing.\nIt gets worse with every update, can rarely manage to even launch the feedback window after a crash and even with potato graphics, its a crapshoot of whether or not I can go on even a single hunt with my friends.\n\nApart from that the wound system allows for more stagger and stun opportunities than ever but the healthpools of the monsters don't feel appropraitely high enough. There are some 10-min hunts in which im tempted to say I could count the amount of attacks I saw the hunster do on my fingers. I don't actually feel like learning the monsters move set and finding angles to exploit, because most of the time it's dead before long. And if not in solo then definitely in multiplayer. And personally, giving us a super charged ultra version of one of the 5 special monsters isn't really what I want, since those kill you in two hits and then im tempted to go to the OP Bow and have an unengaging point and click for 15 min.\nThe seikret is very cute and wonderfully helpful and convenient but now I have much less reason to navigate and learn the environment. Not to mention that outside ofguardian rathalos, being on the seikrit isa mobile safe zone. I'd be curious what it would be like if you could toggle it off, just like the palico.\nThe big shifts of the given area also dont do much more the gameplay, even if they looked very pretty in the story mode (honestly though). But now it feels like (besides wind planes) going from an ugly filter to a pretty filter when the game decides to.\n\nApparently some people sent death threats to the developers, which I very much won't condone ..............but I get it. It's very frustrating and it doesn't seem to improve, no matter what flavourful monster of the month or 10 bucks bikini skin they throw at us. \nThis isn't 'their' first PC port. Is this the price for cross-play?! dafuq happened here?!",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I love Monster Hunter - this is the buggiest game I have ever played.\n*Update switched from 'Microsoft' xbox controller to off brand xbox controller made big difference/ Please someone tell me how to tweak a MS controller to work right - have tried many times.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "As much as I love playing it, as fun as it can be, I cannot recommend the game with the current performance issues. Constant stuttering, slow loading textures.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Good game, sadly the optimization got even worse after the most recent Omega update. I truly do not recommend anyone on PC to purchase the game as it is atm. Until there is a sign that the dev team/studio are making headways into improving performance, keep this game off your wishlist.\nAll the most recent events are packed with stuff and tbh quite enjoyable to play, sadly the team have been very adamant about stalling any work on the optimization/PC performance.\nPS: Game expects you to run it with Frame Generation ON, regardless of how it affects your PC. Keep that in mind if you do plan to purchase. 3 days ago I tried running it without, crashed in the middle of the 1st hunt.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Fix the performance and the game can start competing with MH:Worlds.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Terribly optimized.  Spend more time booting up the game than playing thanks to shaders and crashing.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Still unplayable on min graphics months later. My rig should be good enough to run the game with minimal stutters on minimum graphics. Instead, same story as many who already reviewed it. The game DOES NOT WORK. Takes an extraordinarily  long time compiling shaders, 15-45 minutes. After I get in, the main menu performs worse than a Powerpoint Presentation. Gameplay is... not much better once the game stabilizes  bit.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "the day the game was out i waited and waited for better optimisation and the ability to run this game, waited so long for an update like this that almost a year later isnt heard of, that i ended up buying a whole new PC just to play this game...\n\nthey absolutely not listen to the community",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Since the launch they managed to add in a bunch of new content and the new boss is also really cool..\r\nBUT!\r\nThe main problem, performance, is still there,..\r\nUnfortunately it seems that they might not optimize it more ... or may not even be able to\r\n\r\nIf you can run the game, go for it, it's an amazing MH game\r\nIf you are broke like me tho,... maybe go for Iceborne or Sunbreak instead.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game needs high-end specs to run and even then it struggles for 70-90 consistent fps\nhonestly just wait lmao\n\nhowever gameplay is fun if you can stomach the low fps and the game looking like pixels and low bitrate streams",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}