{
  "positive": [
    {
      "review": "Just Cause 3 delivers an open-world built for destruction and traversal rather than tight mission structure. The core loop depends on mobility, explosives, and territorial disruption. The game encourages improvisation through its tools rather than scripted solutions.\n\nTraversal is the standout system. The wingsuit, parachute, and grappling hook create a fast and readable flow across large distances. Movement feels consistent and supports rapid entry and exit from combat zones. This mobility defines the rhythm of play more than any weapon does.\n\nCombat favors spectacle over precision. Explosive chains, destructible bases, and vehicle hijacking create high output with low friction. Enemies provide enough resistance to maintain pressure but do not challenge strategic planning. The design aims for continuous motion rather than tactical depth.\n\nThe world is large and segmented into clear capture targets. Each region becomes a checklist of structures to destroy. The repetition is intentional and supports a steady progression curve, though the loop can flatten for players who prefer varied mission types.\n\nNarrative content is minimal. Characters and plot serve as scaffolding for the action but remain secondary. The story moves at a predictable pace and stays unobtrusive.\n\nPerformance varies. Large explosions, dense effects, and heavy physics can stress hardware, though general traversal remains stable. Loading times are moderate and acceptable for an open world of this scale.\n\nOverall Just Cause 3 is a systems-forward sandbox focused on mobility and high-volume destruction. It provides reliable momentum for players who want constant action without complex structure.",
      "voted_up": true,
      "votes_helpful": 8
    },
    {
      "review": "I don't know what compelled this devs to think motorcycles behave like a drunk elephant is driving it, but no. This ain't it chief.\n\nAs for those in charge of making the challenges, you've all convinced me that there are people out there with parents that never loved them.\n\nOverall...great game. Try it out.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "just cause 2 and 3 raised me, this game is super fun with its explosions, the story is wacky but thats what makes it fun. 9/10 would play again if memory was wiped",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "by FAR the best of the 4 JUST CAUSe titles and probably my favorite of the genre period for open modern open worlds of this type, I played mercenaries back in the day on the o.g. XBOX and always loved the GTA style but as a military good guy in a warzone, this is the climax of the genre for me tho, the wingsuit is so much fun, and the characters are funny and the little tapes revealing the insights to the  mind of the evil general that detail his rise to power are very cool, not to mention the vehicles and the weapons and the destruction!Pure sandbox heaven YOU ARE THE FIRESTARTER! long live RICO!!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Just Cause 3 has some of the tightest, most innovative gameplay I've ever experienced with interesting mechanics.\n\nOther benefits:\n- Plentiful amount of content\n- Great writing and humor\n- Cutscenes are great\n- David Tennant\n\nIts a steal at $20 and even better when on sale (also get the DLCs).",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Fun game with really fun movement mechanics.\r\nStory is quite good as well.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Fun game, little buggy and few crashed here and there, but other than that i enjoyed the game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It took me a few tries to get into this one - it didn’t pull me in the way [b]Just Cause 2[/b] did - but once I finally committed, I had a lot of fun.  The wingsuit is a welcome addition, and when you’re going for 100% in a specific location, the way missed items slowly reveal themselves on the map is a huge quality-of-life feature.  The side activities are plentiful and varied - most take one or two tries, with the occasional one that makes you want to pull your hair out.  Same goes for collecting one of each vehicle.  The alerts that let you know an uncollected vehicle is nearby are incredibly helpful, and while most of them are easy to snag, a few turn into physics puzzles of their own.  For example: [spoiler]air-lifting a boat out of a pond with the tether grapple hook and a helicopter just to get it to open water where the delivery dock is[/spoiler].  All in all, nothing in this game felt like a chore.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It's a fun game. Really fun game.\r\nJust Cause 3 is a sandbox to the fullest, the main missions are more \"the side thing\" than all the other side stuff is - on account of the \"main campaign\" being so short. You'll spend most of your time wreaking havoc and destruction, and finding new ways to do wreak havoc and destruction. \r\nThat's where the real fun lies.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "when i played this game i thought it would just be like what i saw on tik tok but i was so wrong it so much fun the story is massive and the amount of action is endless i grappled on top of a car and shot the enemy driver and the car tumbled and exploded i grove a helicopter and shot missiles at enemy bases and big feul tanks and it was on sale and i got it for $1 i absolutely LOVE this game 100% would recomend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "over 20 hours in both JC3 and 4 and all i can say is that JC3 is objectively better in almost every way, with even comparable graphics and less repetitive/less boring gameplay i dont mean just the campaign but collectables and region capturing systems where JC4 consists of the same 5 capturing missions where JC3 is about capturing POI's within a region to capture it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I don't think that the story is the big point of the game, though it's not bad. I really like just going and soloing a whole freaking base and exploding stuff. EPIC\r\n\r\n\r\n---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☐ Good\r\n☑ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☐ Good\r\n☑ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☐ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☐ Decent\r\n☑ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☐ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☑ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☑ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☑ Average\r\n☐ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☑ Average\r\n☐ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☑ Worth the price\r\n☐ If it's on sale\r\n☐ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☑ Never heard of\r\n☐ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☐ 8\r\n☑ 9\r\n☐ 10\r\n\r\n---{ Author }---\r\n☑ https://vojtastruhar.github.io/steam-review-template",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a very fun game in all i can get how it could be boring after blowing up a base that looks that exact same as the other but that is their way of showing you multiple ways of blowing things up but one thing is it can be very glitchy at moments the game itself doesn't glitch it my computer i am not sure if its just me or if other people have this problem where it just shuts down the game i have no idea why but at random times it shuts down. i really really find it satisfying blowing things up or making people fly with the grapple hook if you really want to spice things up you can get the D.L.C's they make it a lot of fun if there was one D.L.C i think is the best would be the M.E.C.K i love picking people up from the ground and throwing them around the place i would say this game is a 7/10  not the best game but still really high up there",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Best game ever, pure rage and madness",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "incredible game, and it's pretty optimized too",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the most fun sandboxes of all time, would highly reccomend it.\r\nThe storyline is entertaining, but its not the reason to play the game.\r\n\r\nIts the sheer amount of freedom you have to zip around wreaking havoc as you please. Want to drive a car off a cliff and parachute out? Pedestrian effort.\r\n\r\nIf you so desire, you can hijack a jet midair, demolish an oil rig with the unreal amount of firepower it offers, and finish it off by aiming the jet at it and ditching right before it hits.\r\n\r\nThe only limits are your imagination.\r\n\r\nIt has quite a few glitches, but most of them honestly add to the hilarity of the game. \r\n\r\nRico gets stuck in the occasional wall, things randomly explode in the distance, but by far my favourite ones are the loading screen glitches.\r\n\r\nThe loading screen is the game itself, I'll never forget loading in near a train bridge and immediately getting demolished by an exploded train car. The procedural generation must have spawned in two trains going in opposite directions, but they both derailed and blew up the bridge too.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun gameplay loop, they made sure that features are not gimmicky. Beautiful graphics and color schemes. I replayed this game a lot on PS4 and then got it for PC too. This is a classic and best instalment in the series for me.\n\nThere is one downside though - it does not have Cloud Saves at all.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of fun. Action packed game with fast combat. Check it out!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great mechanics, much improvement from Just cause 2. Best game in the series",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Open world and lots of destruction. \r\nIt is an old game but still looks fine today.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just Cause.. destroying stuffs just because, like you don't owe any explanations to anyone. \nyou don't have to explain why you're driving a car when you already have a wingsuit, \nyou still want to ride a motorcycle for challenge, even if it handle like ass and will kill you faster than flying around with parachute, \nyou can ride a boat even if you know you can fly straight between the islands using your magic wings with thruster in it, \nlike just because you can do it the easier way, doesn't mean you have or want to do it that way, \nthere are lots of stuff that seems pointless in this game, but it's there, just because, haha..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game, loved it. Could have made the vehicles a little bit smoother but apart from that no regrets. Worth every penny",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "If you're getting just one Just Cause game, make it this one!  My only complaint about this game is you can't skip the intro that Avalanche apparently spent a LOT of money on.  Once the game actually starts, it only gets better.  Blowing stuff up is a lifestyle in this game.  Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Really fun game series I highly recommend getting it if you want to have just a bunch of fun blowing stuff up and causing a bunch of chaos",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games i've ever played, i have probably hundreds of hours logged on xbox and ps4 since launch. i used to have the launch edition on ps4. endless fun to be had here, and while the plot seems basic it's had me in a vice grip for years. PLEASE buy this game. it's constantly being put on sale for 3 dollars which is an insane price for a game with potentially thousands of hours in store\n\nfree david tennant. help him",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game, it will be even better once bugs update is out",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just Cause 3 is pure chaos in paradise. You get a grappling hook, a wingsuit, and a whole country full of explosive barrels—what else do you even need?\n\nThe story is basically “liberate everything,” which really means “blow up anything painted red.” The physics are completely unprofessional, Rico survives things that would turn normal humans into soup, and half the time you’re not sure if you’re flying or just falling in style.\n\nA beautiful, explosive vacation. 10/10 would tether a helicopter to a cow again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I sometimes fantasize about downloading this game again and just fucking around. Its a peak \"turn your brain off and just have fun\" game because how has a game that lets you fly, explode shit and grapple everyone now have been made sooner? And I long for the time where DLCs were worth like they are here. Just complete and total game changers and just so worth getting",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's fun and very relaxing after a long day",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun, with the discount and the dlc it's a game not to be missed",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "They say the perfect game doesn't exist but if this game had fully functional multiplayer it'd probably be as close to perfection as we can get.\n\nThe movement is amazing, the grapple and tether system is hilarious and honestly all the vehicles handle pretty nicely.\n\nThe voicelines and sound design is really good and makes for some hilarious moments. The graphics are really nice visually, especially for a game made in 2015. It's very pretty.\n\nI'm surprised by how destructible things are. Don't expect to be demolishing entire buildings, but concrete walls, bridges and basically anything explosive can be turned to dust.\n\nVehicle destruction just looks incredible. So satisfying to blow up a random civilians car.\n\nMy favourite feature besides the grapple/tether is probably the unlimited supply of sticky detonators - so much potential right there and awesome that you don't have to worry about supply.\n\nHonestly, you can't go wrong with this game. It's endlessly fun and you'll never tire of tethering a random dude to a car, rigging it with explosives and driving into a bridge, bailing just before it explodes.\n\nLet the chaos ensue :))\n\nSide note: The multiplayer mod unfortunately reverts the game to an empty sandbox for those looking for a co-op experience - fun if you have a big group to play with because you'll have to entertain yourself without npcs or missions.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "in 4 days 1 of those were playing this game. Simply put, GTA but with more explosions. Another way to put it, film your action movie. If your thinking about the 4th DONT. This is way cheaper and way funner (i think).  Got this for 3.44 cad btw",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is a good sequel to Just Cause 2. I didn't play the first iteration of the series.\r\nAlso didn't play the sequel to this, which seems to have much less praise from the community.\r\n\r\nI miss some things from Just Cause 2 here, like the helicopter dynamics, the \"dodge\" roll. The helicopter driving is much more \"arcade-ish\" in this version than it was in the previous, I liked how they behaved more \"realisticly\" in 2. And there's simply no dodging at all. You are always a sitting duck taking bullets head on, but somehow surviving lots of hits.\r\n\r\nThe game story missions (so far) are cool, and the story missions are really good to get up to speed and understand the game mechanics.\r\n\r\nThe way that the game works now, once a settlement is \"cleared\", it becomes \"allied\" with easy access and making it easy to escape tough encounters too. I like this more than how it was in 2, where only military installations would lift security for easy access to goodies.\r\n\r\nI couldn't get the hang of plane driving. Similarly, the introduced \"glider\" mechanics is not for me. In 2, planes were not as useful, but I could play around hitting some targets in bases. In 3, I could barely take off a plane. Which brings to a next topic: the key bindings.\r\n\r\nCustomizing the key bindings is not great at all in this version. In 2 there was already an issue with game keys being \"linked\" between car-foot-heli. Such that if you changed one control for flying, it would affect, for instance, jumping when on foot. This became even worse in 3. I took a look in the configuration file (which thankfully is something one can read in v3 -- v2 was binary), and (for what I could notice) there's no separate key binding for those \"linked\" controls.\r\n\r\nBack to some positive aspects, the graphics are great. Vehicle damage is cool (how they visually are affected as they are hit or hit stuff). But again, the other cars explode too easily, in simple crashes.\r\n\r\nNow we can fill the car we're driving with allies to help (a bit) in confrontation. It's funny to see them filling up the car and also the idle chatting. Yet, some vehicles (like boat with turrets) don't support calling in help (at least I couldn't find a way to), and there's a vehicle that once the doors are open they never close again.\r\n\r\nEnemy ships feel overkill here. Their accuracy seems too high both on foot and in a vehicle. It was much more fun to deal with ships in 2. But now we got fancy new ship kinds to drive and wreak havoc about.\r\n\r\nAll in all, the game is even more addictive than 2. In 2, I quickly became bored of taking settlements, while 3 gives a sense of accomplishment every taken settlement and it's not much a treasure hunting like it is in 2.\r\n\r\nThe game is really good to \"discharge anger\" or something like it, as it is super-duper-not-punishing, we can just hop in destroy stuff and relieve the real life angers. The 3 is even less punishing than 2! Only exception to places \"locked\" with \"FOW\" (fog of war?) where overwhelming mechanics are placed to force the player to follow certain story missions and lift the tension in the area.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "my ex sure knew how to pick out games with unique gameplay, singlehandedly made those couple of years and a breakup worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a good game, I remember playing it on my PS4 back in the day. A real childhood memory. The game is super fun, the missions are good. But I prefer all the chaos and torture u can comit on unsuspecting victims. Its an amazing game and I encourage anybody who hasent tried it to buy it, and I promise in those first 2 hours u will fall in love.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun and addictive game with nice graphics. Recommend it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love this game! Very enjoyable and incredible graphics.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wow! I found a Just Cause that is somewhat likable and bug free from what I played. I liked it more than 1 and 2, but still repetitive in the gameplay department. The only reason I am giving this a recommend is that if I played this one first, I'd probably beat it, but as of now, I'm unsure, I feel like I have already been doing the same stuff over and over, just like the pervious games.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "one of the best games iv ever played, the gameplay is flawless and the style of how it works is incredibly satishfing. that combined with how fluid the movement is makes this such an amazing game. The physics can be incredibly dodgy but thats what gives it all the more charm. Id highly reccomend playing this game especially when it comes out on offer but make sure you get all the DLC's with it as they are highly worth ti.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely loved this game on xbox and am having a blast so far playing it again!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game gets everything right. The gameplay is a lot of fun, flying around with the wingsuit feels great, and for its age it still looks really good. The story is a bit meh, but let’s be honest: you don’t play Just Cause for the story. You play it to blow half the country up! And for what reason? Heh, just cause...\n\nMilitary bases, mines, towns, public infrastructure - Rico wipes out everything from tanks to civilians with an indifference that more resembles a terminator than \"revolutionary hero\", and that makes the game great. Highly recommend!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've never been big into third-person shooters. Having said that, to say this game is an exception would be a major understatement. The mechanics, unlockables, and the story are all absolutely incredible. Granted, the DLCs are what REALLY make this game superb. So once you can forgive that, this was a super fun game to go through.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just fun as hell. Worth it just to hangglide, and derail a train or two. The driving is pretty satisfying too. Great on controller or keyboard.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just Cause 3 is pure fun — huge open world, awesome explosions, and nonstop action. A perfect game to relax and enjoy some over-the-top chaos. Recommended.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "After 60 hours I finally completed the game. I played it before but I cracked the game and there were no achievements, so when I first bought a Steam giftcard I was like \"I gotta buy Just Cause 3 and 100% it\" And here I am, typing this comment proud of myself for completing this masterpiece, the worst parts of this journey were getting the Squalo x7 out of that damn lake, air and boat trials. In the end i enjoyed every second of this game. The physics are nearly perfect (we will ignore bikes) and the designs and everything, plus the optimization. 10/10 Would piss of a wall with Mario again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun game. I know many will critique the story or how some elements feel repetitive but those people do not undertand what this game is trying to be:\r\n\r\nA very fun and unserious sandbox game. \r\n\r\nIt’s great to sink many hours into while you mindlessly run around blowing stuff up. Overall I much prefer this game to it’s predecessor and sequel. The only parts I do not like are some of the Wingsuit courses are insane to the point of not being fun for a casual.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "There's not even a plot in this game just liberation and lots of BAAAM BOOOM! Michael Bay would be proud of this game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game holds its spot despite its age. Much recommended!!!\r\nThe gameplay, funny storylines and gameplay mechanics are fantastic. Its AOT with guns lmao",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I've always enjoyed Just Cause 3 as it has a nice balance of easy to use gadgets and fun story line with lots of explosions and cool ways to fight and take over areas.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "entered the game not suspecting anything other than lag on my potato laptop i was right but didnt give up played with the settings and now its smooth as buttery i can finally do war cr- i uhhh mean \"liberate\" people 10/10 recommend",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "we can call this game \"impossible is nothing\" like jumping from plane to plane, staying alive after various bombings, having lightning as a weapon even though you are just a mere human...etc. Ps; I love NS NAVAJO",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played this on both the Xbox One and PS4 back in the day. One of the most underrated games to ever release.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game was really fun. It was super exciting to mess around with the tethers and rockets the physics are super entertaining. However, this game lacks in some areas, like the inability to drive a motorcycle on KBM (keyboard and mouse), as well as the main story being extremely boring to do, which just tanks this game’s rating. I’d rate it an 8.0/10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Being able to do whatever with little to no consequences is what sells this game so well",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First time playing Just Cause, and this game is just too much fun, looking forward to the other titles after finishing this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The story is pretty good but does not blend well with the open world or have a satisfying ending. Expect to spend most of of your time in this game in free play, blowing stuff up and experimenting with tools and weapons. Tons of fun. Buy the DLC.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "FUCK YOU, MISSILE!\n\n\n(Btw make sure to check Humble Bundle if you want this game. The XXL edition with all of the dlc is often on sale for like $3 there.)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a fun game,  Lots of explosions, not particularly challenging but its a nice way to kill time.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i am literally spider-man with a gun, the movment and the story is great. i drove a bus off of a cargo plane into the pacific ocean. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's still the best Just Cause game I've played, and I've played them all. The graphics are amazing, the mechanics are awesome and it's hella fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game’s really repetitive and the story’s mid, but the mechanics are fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "---{ Graphics }---\r\n☐ You forget what reality is\r\n☐ Beautiful\r\n☑ Good\r\n☐ Decent\r\n☐ Bad\r\n☐ Don‘t look too long at it\r\n☐ MS-DOS\r\n\r\n---{ Gameplay }---\r\n☑ Very good\r\n☐ Good\r\n☐ It's just gameplay\r\n☐ Mehh\r\n☐ Watch paint dry instead\r\n☐ Just don't\r\n\r\n---{ Audio }---\r\n☐ Eargasm\r\n☐ Very good\r\n☑ Good\r\n☐ Not too bad\r\n☐ Bad\r\n☐ I'm now deaf\r\n\r\n---{ Audience }---\r\n☐ Kids\r\n☑ Teens\r\n☑ Adults\r\n☐ Grandma\r\n\r\n---{ PC Requirements }---\r\n☐ Check if you can run paint\r\n☐ Potato\r\n☑ Decent\r\n☐ Fast\r\n☐ Rich boi\r\n☐ Ask NASA if they have a spare computer\r\n\r\n---{ Game Size }---\r\n☐ Floppy Disk\r\n☐ Old Fashioned\r\n☑ Workable\r\n☐ Big\r\n☐ Will eat 15% of your 1TB hard drive\r\n☐ You will want an entire hard drive to hold it\r\n☐ You will need to invest in a black hole to hold all the data\r\n\r\n---{ Difficulty }---\r\n☐ Just press 'W'\r\n☑ Easy\r\n☐ Easy to learn / Hard to master\r\n☐ Significant brain usage\r\n☐ Difficult\r\n☐ Dark Souls\r\n\r\n---{ Grind }---\r\n☐ Nothing to grind\r\n☑ Only if u care about leaderboards/ranks\r\n☐ Isn't necessary to progress\r\n☐ Average grind level\r\n☐ Too much grind\r\n☐ You'll need a second life for grinding\r\n\r\n---{ Story }---\r\n☐ No Story\r\n☐ Some lore\r\n☐ Average\r\n☑ Good\r\n☐ Lovely\r\n☐ It'll replace your life\r\n\r\n---{ Game Time }---\r\n☐ Long enough for a cup of coffee\r\n☐ Short\r\n☐ Average\r\n☑ Long\r\n☐ To infinity and beyond\r\n\r\n---{ Price }---\r\n☐ It's free!\r\n☐ Worth the price\r\n☐ If it's on sale\r\n☑ If u have some spare money left\r\n☐ Not recommended\r\n☐ You could also just burn your money\r\n\r\n---{ Bugs }---\r\n☐ Never heard of\r\n☑ Minor bugs\r\n☐ Can get annoying\r\n☐ ARK: Survival Evolved\r\n☐ The game itself is a big terrarium for bugs\r\n\r\n---{ ? / 10 }---\r\n☐ 1\r\n☐ 2\r\n☐ 3\r\n☐ 4\r\n☐ 5\r\n☐ 6\r\n☐ 7\r\n☑ 8\r\n☐ 9\r\n☐ 10",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "theres a guy named mario and your a bad ass puerto rican guy named rico armed to the teeth with gadgets and guns\ntrying to take down a rebel army by any means necessary \n\nfew c4 here n there maybe an rpg to a propain dome maybe missles from a jet or maybe ill just grapple to their attack chopper from underneath rip open the door pull them out then man the chopper wipe a base out then jump out of it just to fly around with my wing suit or i might use the parachute if i want to look below at the destruction ive caused \n\nbeat this game several times honestly its great and man that multiplayer mod is goofy as fuck",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's a Really good game! finshed it 2 times and liberated the entire map . CHAOS IS FUN",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "blowing stuff up? check. epic flying? check. literally what else ya need",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good but gets repetitive. main missions are a lot less than map size",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A very good time to help time to pass. The grapple hook is fun to play around with.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "was attacking a base and accidentally flung a barrel at myself at mach 38. incinerated. 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Played 47 hours intending to liberate a few towns and enjoy the scenery.\n\nAccidentally attached a cow to a helicopter, launched it into an oil depot, and declared independence from gravity itself. The rebels cheered while my frame rate begged for mercy.\n\nNow I measure time not in hours, but in explosions per second. 10/10, freedom has too much horsepower.\n\nHours on record: 47.2\nRecommended",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun fun fun! you get to blow up a small country topple a dictator and glide though the sky's of medichi",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Helluva fun time! Really enjoyed what they did with the flight mechanics!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and dosont relly get boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "runs great on steam deck  got it on sale for 3  overall an fun game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Showed up to help. Ended up scaring civilians, traumatizing my own soldiers, and turning half the town into scrap metal. The game applauded me. I think I need to stop helping.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Recomendadisimo y más con los descuentos que le están haciendo. Se sigue viendo muy bien, Muy satisfactorio el movimiento. Gran historia,.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I can appreciate a game that priorities fun above everything.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I get to blow things up. BEST GAME EVER MADE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE I LOVE JUST CAUSE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Hit in the balls in the first 10 minutes of gameplay 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its free roam and everything can explode some why",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly the best action hero movie type game you can play.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have played this games story to 100% like 4 times, it's stupid fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a great fun game, have some fun blowing stuff up!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Keep getting bug where my controller stops working. You have to intigrify files to get it going again. It takes awhile and this is 4th time this happened. I decided Im not going to finish the game. Just Cause 2 is just a lot better.\n\nAfter 20 hours. This was mostly driving cars as the map is insanely huge. Teleport has a limit. \n\nI think Im getting close to the end of the game. It ended up being around 10 missions. The game has very few cutscenes and doesnt do a good job of explaining whats happening. Why is Mario in danger when we were dancing a minutes ago? Not a huge fan of the new characters. The game just gets more and more generic as it goes on. This is a huge heartbreak as Just Cause 2 is amazing in every way. I do recommend it as you can blow up about 80 locations. What makes me sad is there less landmarks in this one. Just Cause 2 starts with this 100 ft tall casino next to a waterfall. I wish more stuff like that was in this game. If this is a made up country, I see no reason for it be this dull. Overall, I am very dissapointed in the base game. It is stunning to look at however. Goregous game. Really fun to look at. Not much to do. \n\nIm a huge fan Just Cause 2 so I picked this up on sale for dirt cheap. So far I like the old one more. Not sure why. This game feels a bit generic while 2 had more style to it. I will keep playing it. It has tons of content from what I see on the map. Recommend if you like open world and blowing everything up.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I mean its alr\r\nIf you want a DLC buy the mech one its fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "wonderfull game even after 10 years deffinitly would reccomend.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have always love Just Cause series, just pure chaos.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game is good just one down side the wing suit controls",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Too much fascism around\n\nTime to practice some cleaning",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "This game is more FUN than (GTA 5 + GTA online + GTA RP) all Combined.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I truly have no life anymore, please help me I haven't seen sunlight in 111 hours",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good game everything thumbs up",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most fun you can have while playing a video game! 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Anything with an engine can be a bomb if you're fast enough",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I love everything about this game its just too good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Truly, a bombastic game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It has all the explosives I could ever want.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Haven't spent enough time on this game yet, don't think i ever will.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is wack yo. I love being italian.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game was like crack for my 12 year old brain.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best sandbox open-world games ever made",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "All these years later and the game still has performance and crashing issues. Its genuinely pretty insane that I still get really terrible stutters, significant FPS dips and hard crashes. Not to mention the fact every single time I start up the game it takes maybe like a full two minutes because they need to sign into their 'service'. Better pray the game loaded up all the DLC too cause if it didn't it'll think you don't have it and need to create a new save or need to start the whole process over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Great game, really fun. Crashes on Windows 11 often. What a shame. Would have been an absolute thumbs up otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this piece of shit game... you wont be able to load/play in both online and offline mode. At this point this game should be delisted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would like to recommend JC3 but if it was a score out of 100, it would be around a 55. I've given it a thumbs down since I don't think it deserves its overwhelmingly positive status. The game is fun, but my goodness gracious was there a lot of barriers to that enjoyment, and the only reason I actually dedicated the time to finish it was because I'm trying to clear my games backlog, otherwise, based purely on fun vs. frustration, I would have never touched it again. If you want the succinct version, JC2 is the genuine article, fun, engaging, right tone, excellent setting. JC3 feels like the backwards cap wearing 40 year old uncle who tries way too hard to be cool.\n\nIt's hard to break this into good and bad, as it seems every good part about this game has its bad side. As most people have said, the moment to moment gameplay can be fun, with the typical JC blow everything up in sight gameply. But f me if the controls don't just suck. Where to begin. Rico often feels like he's moving around in molasses, rather than the fluid control of JC2. The driving and flying is just confusing, it's impossible to get a good handling feel. The only way I can describe it is arcadey on steroids, and sometimes you'll be braking for a nice gentle turn and the cars/motorbikes will do a full 90 degree turn since you've pressed some combination of controls. It's almost like they didn't QA test the controls enough. And the way they force Rico to walk on aircraft, which, if you're doing boat based missions, welcome to the most dangerous enemy in the game. Hit-scanning machine gunners on boats that will kill you in seconds since you can't move much faster than a sloth. Or the way they don't let you walk off edges (it literally stops you, then you have to press jump if you actually want to jump off an edge) - this really breaks the fluidity of controls. I could go on, but just to say, the controls and handling of Rico contribute a great deal to the frustration.\n\nThe setting is also very beautiful, though I wish they set more of the game on the last island, which seemed to have more interesting biomes than idyllic Mediterranean seaside #36, but given the same-ness of the first two islands, liberations of settlements becomes a real grind towards the end. \n\nThe minigames can be fun - at first. But the way they locked a lot of the fun elements behind these 'gears' that you earn, and some essential gear, means this locks the more fun gameplay behind a lot of these mini games, contributing to that frustrating grind, where JC2 gave you a lot more freedom to just enjoy the insanity of the game from the get-go. It does tie well into the gameplay loop, and provides a somewhat fun distraction. When combined with the absolute junk controls however, this can really become a drag. \n\nFinally, the story and characterisation just really plays into that 'try-hard uncle' metaphor the most. JC2 had this wonderful self aware ridiculousness to it, whereas the tone of JC3 seems a bit all over the place. I mean, I feel like the developers are aware of the subtle irony of liberating a settlement by completely destroying it. I would love to say things like 'I have come to liberate you!' just before launching a missile into a crowded street, or creating a gordian knot of civilians and their cars using the grappling hooks until they explode. So the premise of the games absolutely ridiculous. I feel like they kind of tried to shy away from this with the story, tried to make it a little serious which I think was a bad choice. As for the characters, I don't know how, but over the course of the game I came to hate absolutely every character in it. Maybe apart from Annika and Teo, who barely featured in it, but everybody, including Rico, just were so annoying. The way he would shout 'Boomgift!' every time you threw a grenade... I mean, it just felt totally lame coming from Rico. I liked in JC2, where he was always completely serious, and the game was ridiculous around him, if that makes sense. Dimah is annoying as hell. Mario tries to be funny, but, yeah, everything just falls flat. \n\nSo, overall, the gameplay was fun enough to keep me hooked, but getting there in the end was a really frustrating experience. I do recommend the game (even though I've thumbed it down), but barely, since I would love a Just Cause that feels like a Just Cause game, and not trying to pretend to be something else, like I feel they were trying to do with this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game. Just started getting \"the server is not reachable\" and I really don't care enough to troubleshoot this. It is a single player game, this is beyond stupid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you got new gen pc and specs probably dont get it. The game is a masterpiece and is super fun but it is not made to run on newer gen tech and constantly has issues",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, this is my favorite, I played it a couple of times to 100% on sony. A million times on the computer and they still haven't fixed the dead antialiasing. We need Temporal Antialiasing for graphics that came out after the fucking game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only bought this game because it remove something I don't like in Just Cause 2.\n\nWhile almost every reviews I came across tend to compare this game to JC2, I aim to do it a little different.\n\nOverall, the game is decent in terms of graphic and atmosphere, but that's about it.\n\nNow there are no side missions, so players are given with no reason to venture the map. It's an open world game, and the game decided not to tell players to expose or even familiarise themselves with the map? Not to mention a large portion of the map is ocean, which is a location that no crucial game content exists, going underwater is not an option either as the ocean is deep enough to drown rico. North of the wall is a no mans land, now the northern medici takes up almost half of the map, yet it's a boring place, not even liberating them changes the situation. Seriously, what's the point of playing the map if half of the map isn't populated by medician? And what's the point of playing those DLC map if none of those maps serves any purposes after DLC missions are completed?\n\nAnd the enemy can infinitely spawns somewhere outside of the rendered area, hiding somewhere out of your sight, calling reinforcements. I prefer shoot them all dead to get ride of the heat, but feel free to hide yourself if you want an easy way out. The game has a intriguing definition of clearing heat, my speculation is that the game real time checks your premises(must be hard coding), if no enemy npc is in that premises, then heat would be cleared(same goes for any fighting npc btw). Yet there are certain conditions that heat is cleared despite there are visible enemy npc is in the area, there are possibilities that npc being shot dead, reinforcement are still being called, also all enemy respawn if heat is gone in any conditions.\n\nI personally speculated that one of the major difference between JC2 and JC3 is that the enemy vehicle appeared during heat progression. In JC2, Rico doesn't get to worry about tank cannons and 180 degree shooting machinegun; In JC3, he does, 'cause tanks was putted in vanilla game to f**k up your reign of chaos. To sum it up, it's an unbalanced combat system that JC3 present to the players.\n\nThere are a bunch of game contents that avalanche studio fail to arrange and make sense of, wingsuit and parachute are one of them. Since the game emphasis the constant usage of wingsuit and parachute, it integrated both of them into one travelling methods: rico can wingsuit after launching into air with parachute. While comparing this to JC2, this seems weird: JC2 rico can simply opens up parachute then boost his way to the destination; while JC3, rico can fly with wingsuit and parachute, kinda confusing if you ask me. Why the h*ll would you open parachute if you had the option land with your wingsuit? Make wingsuit and parachute separate, use wingsuit to move fast; parachute for laid back experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the DLC content was not worth the money at all imo. I would avoid all together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun game. However, not very well tested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wack Gunplay & Janky Movement",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a boring game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No... just no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Any Game that forces you to be online to play it is not going to get a positive review from me. What happens if my internet is down...\"Oh sorry you can't play the game you paid money for because we want to force you to be online\". Not only is it forcing you to be online with steam but it logs into some unknown server that I don't want to be on!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "This game is 10 years old and the moronic devs havent fixed a single bug.\r\n\r\nTheres a constant connection issue to their stupid online servers WHICH SHOULDNT EXIST ON A SINGLE PLAYER GAME\r\n\r\nYou constantly have your game interrupted because of failures to connect. Open the menu? Have to wait a minute for it to try and reconnect. Complete a challenge? Have to wait a minute for it to try and connect to online servers. \r\n\r\nIts honestly mind boggling. \r\n\r\n\r\n\r\nThen you got challenges that are LITERALLY BROKEN still after 10 years. \r\n10 years. 10 years and they still havent fixed broken and bugged out content. \r\n\r\nJust wasted 30 minutes trying a challenge only to go to discussions to find out hundreds upon hundreds of discussions already exist talking about it and its broken. Its just broken. \r\n\r\nDespite TEN YEARS passing and HUNDREDS of complaints there are still broken challenges and game ruining bugs. I cant even believe it honestly.\r\n\r\n\r\nIll never purchase another game from these braindead devs.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "All these years later and the game still has performance and crashing issues. Its genuinely pretty insane that I still get really terrible stutters, significant FPS dips and hard crashes. Not to mention the fact every single time I start up the game it takes maybe like a full two minutes because they need to sign into their 'service'. Better pray the game loaded up all the DLC too cause if it didn't it'll think you don't have it and need to create a new save or need to start the whole process over.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would like to recommend JC3 but if it was a score out of 100, it would be around a 55. I've given it a thumbs down since I don't think it deserves its overwhelmingly positive status. The game is fun, but my goodness gracious was there a lot of barriers to that enjoyment, and the only reason I actually dedicated the time to finish it was because I'm trying to clear my games backlog, otherwise, based purely on fun vs. frustration, I would have never touched it again. If you want the succinct version, JC2 is the genuine article, fun, engaging, right tone, excellent setting. JC3 feels like the backwards cap wearing 40 year old uncle who tries way too hard to be cool.\n\nIt's hard to break this into good and bad, as it seems every good part about this game has its bad side. As most people have said, the moment to moment gameplay can be fun, with the typical JC blow everything up in sight gameply. But f me if the controls don't just suck. Where to begin. Rico often feels like he's moving around in molasses, rather than the fluid control of JC2. The driving and flying is just confusing, it's impossible to get a good handling feel. The only way I can describe it is arcadey on steroids, and sometimes you'll be braking for a nice gentle turn and the cars/motorbikes will do a full 90 degree turn since you've pressed some combination of controls. It's almost like they didn't QA test the controls enough. And the way they force Rico to walk on aircraft, which, if you're doing boat based missions, welcome to the most dangerous enemy in the game. Hit-scanning machine gunners on boats that will kill you in seconds since you can't move much faster than a sloth. Or the way they don't let you walk off edges (it literally stops you, then you have to press jump if you actually want to jump off an edge) - this really breaks the fluidity of controls. I could go on, but just to say, the controls and handling of Rico contribute a great deal to the frustration.\n\nThe setting is also very beautiful, though I wish they set more of the game on the last island, which seemed to have more interesting biomes than idyllic Mediterranean seaside #36, but given the same-ness of the first two islands, liberations of settlements becomes a real grind towards the end. \n\nThe minigames can be fun - at first. But the way they locked a lot of the fun elements behind these 'gears' that you earn, and some essential gear, means this locks the more fun gameplay behind a lot of these mini games, contributing to that frustrating grind, where JC2 gave you a lot more freedom to just enjoy the insanity of the game from the get-go. It does tie well into the gameplay loop, and provides a somewhat fun distraction. When combined with the absolute junk controls however, this can really become a drag. \n\nFinally, the story and characterisation just really plays into that 'try-hard uncle' metaphor the most. JC2 had this wonderful self aware ridiculousness to it, whereas the tone of JC3 seems a bit all over the place. I mean, I feel like the developers are aware of the subtle irony of liberating a settlement by completely destroying it. I would love to say things like 'I have come to liberate you!' just before launching a missile into a crowded street, or creating a gordian knot of civilians and their cars using the grappling hooks until they explode. So the premise of the games absolutely ridiculous. I feel like they kind of tried to shy away from this with the story, tried to make it a little serious which I think was a bad choice. As for the characters, I don't know how, but over the course of the game I came to hate absolutely every character in it. Maybe apart from Annika and Teo, who barely featured in it, but everybody, including Rico, just were so annoying. The way he would shout 'Boomgift!' every time you threw a grenade... I mean, it just felt totally lame coming from Rico. I liked in JC2, where he was always completely serious, and the game was ridiculous around him, if that makes sense. Dimah is annoying as hell. Mario tries to be funny, but, yeah, everything just falls flat. \n\nSo, overall, the gameplay was fun enough to keep me hooked, but getting there in the end was a really frustrating experience. I do recommend the game (even though I've thumbed it down), but barely, since I would love a Just Cause that feels like a Just Cause game, and not trying to pretend to be something else, like I feel they were trying to do with this game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game. Just started getting \"the server is not reachable\" and I really don't care enough to troubleshoot this. It is a single player game, this is beyond stupid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "If you got new gen pc and specs probably dont get it. The game is a masterpiece and is super fun but it is not made to run on newer gen tech and constantly has issues",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Games a buggy mess and getting 100% isnt fun,",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It has some cool features, lots of explosions, and a decently compelling story line but it has not aged well and stability is a bit of an issue.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only bought this game because it remove something I don't like in Just Cause 2.\n\nWhile almost every reviews I came across tend to compare this game to JC2, I aim to do it a little different.\n\nOverall, the game is decent in terms of graphic and atmosphere, but that's about it.\n\nNow there are no side missions, so players are given with no reason to venture the map. It's an open world game, and the game decided not to tell players to expose or even familiarise themselves with the map? Not to mention a large portion of the map is ocean, which is a location that no crucial game content exists, going underwater is not an option either as the ocean is deep enough to drown rico. North of the wall is a no mans land, now the northern medici takes up almost half of the map, yet it's a boring place, not even liberating them changes the situation. Seriously, what's the point of playing the map if half of the map isn't populated by medician? And what's the point of playing those DLC map if none of those maps serves any purposes after DLC missions are completed?\n\nAnd the enemy can infinitely spawns somewhere outside of the rendered area, hiding somewhere out of your sight, calling reinforcements. I prefer shoot them all dead to get ride of the heat, but feel free to hide yourself if you want an easy way out. The game has a intriguing definition of clearing heat, my speculation is that the game real time checks your premises(must be hard coding), if no enemy npc is in that premises, then heat would be cleared(same goes for any fighting npc btw). Yet there are certain conditions that heat is cleared despite there are visible enemy npc is in the area, there are possibilities that npc being shot dead, reinforcement are still being called, also all enemy respawn if heat is gone in any conditions.\n\nI personally speculated that one of the major difference between JC2 and JC3 is that the enemy vehicle appeared during heat progression. In JC2, Rico doesn't get to worry about tank cannons and 180 degree shooting machinegun; In JC3, he does, 'cause tanks was putted in vanilla game to f**k up your reign of chaos. To sum it up, it's an unbalanced combat system that JC3 present to the players.\n\nThere are a bunch of game contents that avalanche studio fail to arrange and make sense of, wingsuit and parachute are one of them. Since the game emphasis the constant usage of wingsuit and parachute, it integrated both of them into one travelling methods: rico can wingsuit after launching into air with parachute. While comparing this to JC2, this seems weird: JC2 rico can simply opens up parachute then boost his way to the destination; while JC3, rico can fly with wingsuit and parachute, kinda confusing if you ask me. Why the h*ll would you open parachute if you had the option land with your wingsuit? Make wingsuit and parachute separate, use wingsuit to move fast; parachute for laid back experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Some blackhats I believe that are involved with a very large set-up and frame-work against me involving the Federal government make change how the game works based on how I play it. This has happened in a few games I've played  recently, and has been on-going for years. This time I decided to really test it, they wouldn't let me get allies in my vehincle when honking the horn because the sound was off, and they changed how the jet on the wingsuit works to where I couldn't use it to get out of water. A few other things that I noticed, but won't write here that they did. I guess, I need to go back to a generation of video gaming that was not online.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the DLC content was not worth the money at all imo. I would avoid all together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Horrendous console port. Random crashes, weird control layout and buggy in-game map that requires all sorts of manual workarounds to navigate properly. So glad I got this at a huge discount but I still wasted my money.\n\nIt has so much potential to be a good game but in it's current broken state I won't waste my time getting frustrated with basic game mechanics that should be working properly.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This is a fun game. However, not very well tested.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wack Gunplay & Janky Movement",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "mid ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "broken",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I would like to recommend JC3 but if it was a score out of 100, it would be around a 55. I've given it a thumbs down since I don't think it deserves its overwhelmingly positive status. The game is fun, but my goodness gracious was there a lot of barriers to that enjoyment, and the only reason I actually dedicated the time to finish it was because I'm trying to clear my games backlog, otherwise, based purely on fun vs. frustration, I would have never touched it again. If you want the succinct version, JC2 is the genuine article, fun, engaging, right tone, excellent setting. JC3 feels like the backwards cap wearing 40 year old uncle who tries way too hard to be cool.\n\nIt's hard to break this into good and bad, as it seems every good part about this game has its bad side. As most people have said, the moment to moment gameplay can be fun, with the typical JC blow everything up in sight gameply. But f me if the controls don't just suck. Where to begin. Rico often feels like he's moving around in molasses, rather than the fluid control of JC2. The driving and flying is just confusing, it's impossible to get a good handling feel. The only way I can describe it is arcadey on steroids, and sometimes you'll be braking for a nice gentle turn and the cars/motorbikes will do a full 90 degree turn since you've pressed some combination of controls. It's almost like they didn't QA test the controls enough. And the way they force Rico to walk on aircraft, which, if you're doing boat based missions, welcome to the most dangerous enemy in the game. Hit-scanning machine gunners on boats that will kill you in seconds since you can't move much faster than a sloth. Or the way they don't let you walk off edges (it literally stops you, then you have to press jump if you actually want to jump off an edge) - this really breaks the fluidity of controls. I could go on, but just to say, the controls and handling of Rico contribute a great deal to the frustration.\n\nThe setting is also very beautiful, though I wish they set more of the game on the last island, which seemed to have more interesting biomes than idyllic Mediterranean seaside #36, but given the same-ness of the first two islands, liberations of settlements becomes a real grind towards the end. \n\nThe minigames can be fun - at first. But the way they locked a lot of the fun elements behind these 'gears' that you earn, and some essential gear, means this locks the more fun gameplay behind a lot of these mini games, contributing to that frustrating grind, where JC2 gave you a lot more freedom to just enjoy the insanity of the game from the get-go. It does tie well into the gameplay loop, and provides a somewhat fun distraction. When combined with the absolute junk controls however, this can really become a drag. \n\nFinally, the story and characterisation just really plays into that 'try-hard uncle' metaphor the most. JC2 had this wonderful self aware ridiculousness to it, whereas the tone of JC3 seems a bit all over the place. I mean, I feel like the developers are aware of the subtle irony of liberating a settlement by completely destroying it. I would love to say things like 'I have come to liberate you!' just before launching a missile into a crowded street, or creating a gordian knot of civilians and their cars using the grappling hooks until they explode. So the premise of the games absolutely ridiculous. I feel like they kind of tried to shy away from this with the story, tried to make it a little serious which I think was a bad choice. As for the characters, I don't know how, but over the course of the game I came to hate absolutely every character in it. Maybe apart from Annika and Teo, who barely featured in it, but everybody, including Rico, just were so annoying. The way he would shout 'Boomgift!' every time you threw a grenade... I mean, it just felt totally lame coming from Rico. I liked in JC2, where he was always completely serious, and the game was ridiculous around him, if that makes sense. Dimah is annoying as hell. Mario tries to be funny, but, yeah, everything just falls flat. \n\nSo, overall, the gameplay was fun enough to keep me hooked, but getting there in the end was a really frustrating experience. I do recommend the game (even though I've thumbed it down), but barely, since I would love a Just Cause that feels like a Just Cause game, and not trying to pretend to be something else, like I feel they were trying to do with this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Any Game that forces you to be online to play it is not going to get a positive review from me. What happens if my internet is down...\"Oh sorry you can't play the game you paid money for because we want to force you to be online\". Not only is it forcing you to be online with steam but it logs into some unknown server that I don't want to be on!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you got new gen pc and specs probably dont get it. The game is a masterpiece and is super fun but it is not made to run on newer gen tech and constantly has issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is 10 years old and the moronic devs havent fixed a single bug.\r\n\r\nTheres a constant connection issue to their stupid online servers WHICH SHOULDNT EXIST ON A SINGLE PLAYER GAME\r\n\r\nYou constantly have your game interrupted because of failures to connect. Open the menu? Have to wait a minute for it to try and reconnect. Complete a challenge? Have to wait a minute for it to try and connect to online servers. \r\n\r\nIts honestly mind boggling. \r\n\r\n\r\n\r\nThen you got challenges that are LITERALLY BROKEN still after 10 years. \r\n10 years. 10 years and they still havent fixed broken and bugged out content. \r\n\r\nJust wasted 30 minutes trying a challenge only to go to discussions to find out hundreds upon hundreds of discussions already exist talking about it and its broken. Its just broken. \r\n\r\nDespite TEN YEARS passing and HUNDREDS of complaints there are still broken challenges and game ruining bugs. I cant even believe it honestly.\r\n\r\n\r\nIll never purchase another game from these braindead devs.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Unfortunately encountered too many different minor bugs/glitches that prevent doing quests playing it for about an hour, seems like the game is too rusty.\n\nThough it seems really fun and unique.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this piece of shit game... you wont be able to load/play in both online and offline mode. At this point this game should be delisted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All these years later and the game still has performance and crashing issues. Its genuinely pretty insane that I still get really terrible stutters, significant FPS dips and hard crashes. Not to mention the fact every single time I start up the game it takes maybe like a full two minutes because they need to sign into their 'service'. Better pray the game loaded up all the DLC too cause if it didn't it'll think you don't have it and need to create a new save or need to start the whole process over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game. Just started getting \"the server is not reachable\" and I really don't care enough to troubleshoot this. It is a single player game, this is beyond stupid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game, really fun. Crashes on Windows 11 often. What a shame. Would have been an absolute thumbs up otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, this is my favorite, I played it a couple of times to 100% on sony. A million times on the computer and they still haven't fixed the dead antialiasing. We need Temporal Antialiasing for graphics that came out after the fucking game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only bought this game because it remove something I don't like in Just Cause 2.\n\nWhile almost every reviews I came across tend to compare this game to JC2, I aim to do it a little different.\n\nOverall, the game is decent in terms of graphic and atmosphere, but that's about it.\n\nNow there are no side missions, so players are given with no reason to venture the map. It's an open world game, and the game decided not to tell players to expose or even familiarise themselves with the map? Not to mention a large portion of the map is ocean, which is a location that no crucial game content exists, going underwater is not an option either as the ocean is deep enough to drown rico. North of the wall is a no mans land, now the northern medici takes up almost half of the map, yet it's a boring place, not even liberating them changes the situation. Seriously, what's the point of playing the map if half of the map isn't populated by medician? And what's the point of playing those DLC map if none of those maps serves any purposes after DLC missions are completed?\n\nAnd the enemy can infinitely spawns somewhere outside of the rendered area, hiding somewhere out of your sight, calling reinforcements. I prefer shoot them all dead to get ride of the heat, but feel free to hide yourself if you want an easy way out. The game has a intriguing definition of clearing heat, my speculation is that the game real time checks your premises(must be hard coding), if no enemy npc is in that premises, then heat would be cleared(same goes for any fighting npc btw). Yet there are certain conditions that heat is cleared despite there are visible enemy npc is in the area, there are possibilities that npc being shot dead, reinforcement are still being called, also all enemy respawn if heat is gone in any conditions.\n\nI personally speculated that one of the major difference between JC2 and JC3 is that the enemy vehicle appeared during heat progression. In JC2, Rico doesn't get to worry about tank cannons and 180 degree shooting machinegun; In JC3, he does, 'cause tanks was putted in vanilla game to f**k up your reign of chaos. To sum it up, it's an unbalanced combat system that JC3 present to the players.\n\nThere are a bunch of game contents that avalanche studio fail to arrange and make sense of, wingsuit and parachute are one of them. Since the game emphasis the constant usage of wingsuit and parachute, it integrated both of them into one travelling methods: rico can wingsuit after launching into air with parachute. While comparing this to JC2, this seems weird: JC2 rico can simply opens up parachute then boost his way to the destination; while JC3, rico can fly with wingsuit and parachute, kinda confusing if you ask me. Why the h*ll would you open parachute if you had the option land with your wingsuit? Make wingsuit and parachute separate, use wingsuit to move fast; parachute for laid back experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the DLC content was not worth the money at all imo. I would avoid all together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wack Gunplay & Janky Movement",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a boring game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No... just no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would like to recommend JC3 but if it was a score out of 100, it would be around a 55. I've given it a thumbs down since I don't think it deserves its overwhelmingly positive status. The game is fun, but my goodness gracious was there a lot of barriers to that enjoyment, and the only reason I actually dedicated the time to finish it was because I'm trying to clear my games backlog, otherwise, based purely on fun vs. frustration, I would have never touched it again. If you want the succinct version, JC2 is the genuine article, fun, engaging, right tone, excellent setting. JC3 feels like the backwards cap wearing 40 year old uncle who tries way too hard to be cool.\n\nIt's hard to break this into good and bad, as it seems every good part about this game has its bad side. As most people have said, the moment to moment gameplay can be fun, with the typical JC blow everything up in sight gameply. But f me if the controls don't just suck. Where to begin. Rico often feels like he's moving around in molasses, rather than the fluid control of JC2. The driving and flying is just confusing, it's impossible to get a good handling feel. The only way I can describe it is arcadey on steroids, and sometimes you'll be braking for a nice gentle turn and the cars/motorbikes will do a full 90 degree turn since you've pressed some combination of controls. It's almost like they didn't QA test the controls enough. And the way they force Rico to walk on aircraft, which, if you're doing boat based missions, welcome to the most dangerous enemy in the game. Hit-scanning machine gunners on boats that will kill you in seconds since you can't move much faster than a sloth. Or the way they don't let you walk off edges (it literally stops you, then you have to press jump if you actually want to jump off an edge) - this really breaks the fluidity of controls. I could go on, but just to say, the controls and handling of Rico contribute a great deal to the frustration.\n\nThe setting is also very beautiful, though I wish they set more of the game on the last island, which seemed to have more interesting biomes than idyllic Mediterranean seaside #36, but given the same-ness of the first two islands, liberations of settlements becomes a real grind towards the end. \n\nThe minigames can be fun - at first. But the way they locked a lot of the fun elements behind these 'gears' that you earn, and some essential gear, means this locks the more fun gameplay behind a lot of these mini games, contributing to that frustrating grind, where JC2 gave you a lot more freedom to just enjoy the insanity of the game from the get-go. It does tie well into the gameplay loop, and provides a somewhat fun distraction. When combined with the absolute junk controls however, this can really become a drag. \n\nFinally, the story and characterisation just really plays into that 'try-hard uncle' metaphor the most. JC2 had this wonderful self aware ridiculousness to it, whereas the tone of JC3 seems a bit all over the place. I mean, I feel like the developers are aware of the subtle irony of liberating a settlement by completely destroying it. I would love to say things like 'I have come to liberate you!' just before launching a missile into a crowded street, or creating a gordian knot of civilians and their cars using the grappling hooks until they explode. So the premise of the games absolutely ridiculous. I feel like they kind of tried to shy away from this with the story, tried to make it a little serious which I think was a bad choice. As for the characters, I don't know how, but over the course of the game I came to hate absolutely every character in it. Maybe apart from Annika and Teo, who barely featured in it, but everybody, including Rico, just were so annoying. The way he would shout 'Boomgift!' every time you threw a grenade... I mean, it just felt totally lame coming from Rico. I liked in JC2, where he was always completely serious, and the game was ridiculous around him, if that makes sense. Dimah is annoying as hell. Mario tries to be funny, but, yeah, everything just falls flat. \n\nSo, overall, the gameplay was fun enough to keep me hooked, but getting there in the end was a really frustrating experience. I do recommend the game (even though I've thumbed it down), but barely, since I would love a Just Cause that feels like a Just Cause game, and not trying to pretend to be something else, like I feel they were trying to do with this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Any Game that forces you to be online to play it is not going to get a positive review from me. What happens if my internet is down...\"Oh sorry you can't play the game you paid money for because we want to force you to be online\". Not only is it forcing you to be online with steam but it logs into some unknown server that I don't want to be on!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you got new gen pc and specs probably dont get it. The game is a masterpiece and is super fun but it is not made to run on newer gen tech and constantly has issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is 10 years old and the moronic devs havent fixed a single bug.\r\n\r\nTheres a constant connection issue to their stupid online servers WHICH SHOULDNT EXIST ON A SINGLE PLAYER GAME\r\n\r\nYou constantly have your game interrupted because of failures to connect. Open the menu? Have to wait a minute for it to try and reconnect. Complete a challenge? Have to wait a minute for it to try and connect to online servers. \r\n\r\nIts honestly mind boggling. \r\n\r\n\r\n\r\nThen you got challenges that are LITERALLY BROKEN still after 10 years. \r\n10 years. 10 years and they still havent fixed broken and bugged out content. \r\n\r\nJust wasted 30 minutes trying a challenge only to go to discussions to find out hundreds upon hundreds of discussions already exist talking about it and its broken. Its just broken. \r\n\r\nDespite TEN YEARS passing and HUNDREDS of complaints there are still broken challenges and game ruining bugs. I cant even believe it honestly.\r\n\r\n\r\nIll never purchase another game from these braindead devs.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Unfortunately encountered too many different minor bugs/glitches that prevent doing quests playing it for about an hour, seems like the game is too rusty.\n\nThough it seems really fun and unique.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this piece of shit game... you wont be able to load/play in both online and offline mode. At this point this game should be delisted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All these years later and the game still has performance and crashing issues. Its genuinely pretty insane that I still get really terrible stutters, significant FPS dips and hard crashes. Not to mention the fact every single time I start up the game it takes maybe like a full two minutes because they need to sign into their 'service'. Better pray the game loaded up all the DLC too cause if it didn't it'll think you don't have it and need to create a new save or need to start the whole process over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game. Just started getting \"the server is not reachable\" and I really don't care enough to troubleshoot this. It is a single player game, this is beyond stupid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game, really fun. Crashes on Windows 11 often. What a shame. Would have been an absolute thumbs up otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, this is my favorite, I played it a couple of times to 100% on sony. A million times on the computer and they still haven't fixed the dead antialiasing. We need Temporal Antialiasing for graphics that came out after the fucking game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only bought this game because it remove something I don't like in Just Cause 2.\n\nWhile almost every reviews I came across tend to compare this game to JC2, I aim to do it a little different.\n\nOverall, the game is decent in terms of graphic and atmosphere, but that's about it.\n\nNow there are no side missions, so players are given with no reason to venture the map. It's an open world game, and the game decided not to tell players to expose or even familiarise themselves with the map? Not to mention a large portion of the map is ocean, which is a location that no crucial game content exists, going underwater is not an option either as the ocean is deep enough to drown rico. North of the wall is a no mans land, now the northern medici takes up almost half of the map, yet it's a boring place, not even liberating them changes the situation. Seriously, what's the point of playing the map if half of the map isn't populated by medician? And what's the point of playing those DLC map if none of those maps serves any purposes after DLC missions are completed?\n\nAnd the enemy can infinitely spawns somewhere outside of the rendered area, hiding somewhere out of your sight, calling reinforcements. I prefer shoot them all dead to get ride of the heat, but feel free to hide yourself if you want an easy way out. The game has a intriguing definition of clearing heat, my speculation is that the game real time checks your premises(must be hard coding), if no enemy npc is in that premises, then heat would be cleared(same goes for any fighting npc btw). Yet there are certain conditions that heat is cleared despite there are visible enemy npc is in the area, there are possibilities that npc being shot dead, reinforcement are still being called, also all enemy respawn if heat is gone in any conditions.\n\nI personally speculated that one of the major difference between JC2 and JC3 is that the enemy vehicle appeared during heat progression. In JC2, Rico doesn't get to worry about tank cannons and 180 degree shooting machinegun; In JC3, he does, 'cause tanks was putted in vanilla game to f**k up your reign of chaos. To sum it up, it's an unbalanced combat system that JC3 present to the players.\n\nThere are a bunch of game contents that avalanche studio fail to arrange and make sense of, wingsuit and parachute are one of them. Since the game emphasis the constant usage of wingsuit and parachute, it integrated both of them into one travelling methods: rico can wingsuit after launching into air with parachute. While comparing this to JC2, this seems weird: JC2 rico can simply opens up parachute then boost his way to the destination; while JC3, rico can fly with wingsuit and parachute, kinda confusing if you ask me. Why the h*ll would you open parachute if you had the option land with your wingsuit? Make wingsuit and parachute separate, use wingsuit to move fast; parachute for laid back experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the DLC content was not worth the money at all imo. I would avoid all together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wack Gunplay & Janky Movement",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a boring game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No... just no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would like to recommend JC3 but if it was a score out of 100, it would be around a 55. I've given it a thumbs down since I don't think it deserves its overwhelmingly positive status. The game is fun, but my goodness gracious was there a lot of barriers to that enjoyment, and the only reason I actually dedicated the time to finish it was because I'm trying to clear my games backlog, otherwise, based purely on fun vs. frustration, I would have never touched it again. If you want the succinct version, JC2 is the genuine article, fun, engaging, right tone, excellent setting. JC3 feels like the backwards cap wearing 40 year old uncle who tries way too hard to be cool.\n\nIt's hard to break this into good and bad, as it seems every good part about this game has its bad side. As most people have said, the moment to moment gameplay can be fun, with the typical JC blow everything up in sight gameply. But f me if the controls don't just suck. Where to begin. Rico often feels like he's moving around in molasses, rather than the fluid control of JC2. The driving and flying is just confusing, it's impossible to get a good handling feel. The only way I can describe it is arcadey on steroids, and sometimes you'll be braking for a nice gentle turn and the cars/motorbikes will do a full 90 degree turn since you've pressed some combination of controls. It's almost like they didn't QA test the controls enough. And the way they force Rico to walk on aircraft, which, if you're doing boat based missions, welcome to the most dangerous enemy in the game. Hit-scanning machine gunners on boats that will kill you in seconds since you can't move much faster than a sloth. Or the way they don't let you walk off edges (it literally stops you, then you have to press jump if you actually want to jump off an edge) - this really breaks the fluidity of controls. I could go on, but just to say, the controls and handling of Rico contribute a great deal to the frustration.\n\nThe setting is also very beautiful, though I wish they set more of the game on the last island, which seemed to have more interesting biomes than idyllic Mediterranean seaside #36, but given the same-ness of the first two islands, liberations of settlements becomes a real grind towards the end. \n\nThe minigames can be fun - at first. But the way they locked a lot of the fun elements behind these 'gears' that you earn, and some essential gear, means this locks the more fun gameplay behind a lot of these mini games, contributing to that frustrating grind, where JC2 gave you a lot more freedom to just enjoy the insanity of the game from the get-go. It does tie well into the gameplay loop, and provides a somewhat fun distraction. When combined with the absolute junk controls however, this can really become a drag. \n\nFinally, the story and characterisation just really plays into that 'try-hard uncle' metaphor the most. JC2 had this wonderful self aware ridiculousness to it, whereas the tone of JC3 seems a bit all over the place. I mean, I feel like the developers are aware of the subtle irony of liberating a settlement by completely destroying it. I would love to say things like 'I have come to liberate you!' just before launching a missile into a crowded street, or creating a gordian knot of civilians and their cars using the grappling hooks until they explode. So the premise of the games absolutely ridiculous. I feel like they kind of tried to shy away from this with the story, tried to make it a little serious which I think was a bad choice. As for the characters, I don't know how, but over the course of the game I came to hate absolutely every character in it. Maybe apart from Annika and Teo, who barely featured in it, but everybody, including Rico, just were so annoying. The way he would shout 'Boomgift!' every time you threw a grenade... I mean, it just felt totally lame coming from Rico. I liked in JC2, where he was always completely serious, and the game was ridiculous around him, if that makes sense. Dimah is annoying as hell. Mario tries to be funny, but, yeah, everything just falls flat. \n\nSo, overall, the gameplay was fun enough to keep me hooked, but getting there in the end was a really frustrating experience. I do recommend the game (even though I've thumbed it down), but barely, since I would love a Just Cause that feels like a Just Cause game, and not trying to pretend to be something else, like I feel they were trying to do with this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Any Game that forces you to be online to play it is not going to get a positive review from me. What happens if my internet is down...\"Oh sorry you can't play the game you paid money for because we want to force you to be online\". Not only is it forcing you to be online with steam but it logs into some unknown server that I don't want to be on!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you got new gen pc and specs probably dont get it. The game is a masterpiece and is super fun but it is not made to run on newer gen tech and constantly has issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is 10 years old and the moronic devs havent fixed a single bug.\r\n\r\nTheres a constant connection issue to their stupid online servers WHICH SHOULDNT EXIST ON A SINGLE PLAYER GAME\r\n\r\nYou constantly have your game interrupted because of failures to connect. Open the menu? Have to wait a minute for it to try and reconnect. Complete a challenge? Have to wait a minute for it to try and connect to online servers. \r\n\r\nIts honestly mind boggling. \r\n\r\n\r\n\r\nThen you got challenges that are LITERALLY BROKEN still after 10 years. \r\n10 years. 10 years and they still havent fixed broken and bugged out content. \r\n\r\nJust wasted 30 minutes trying a challenge only to go to discussions to find out hundreds upon hundreds of discussions already exist talking about it and its broken. Its just broken. \r\n\r\nDespite TEN YEARS passing and HUNDREDS of complaints there are still broken challenges and game ruining bugs. I cant even believe it honestly.\r\n\r\n\r\nIll never purchase another game from these braindead devs.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Unfortunately encountered too many different minor bugs/glitches that prevent doing quests playing it for about an hour, seems like the game is too rusty.\n\nThough it seems really fun and unique.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this piece of shit game... you wont be able to load/play in both online and offline mode. At this point this game should be delisted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All these years later and the game still has performance and crashing issues. Its genuinely pretty insane that I still get really terrible stutters, significant FPS dips and hard crashes. Not to mention the fact every single time I start up the game it takes maybe like a full two minutes because they need to sign into their 'service'. Better pray the game loaded up all the DLC too cause if it didn't it'll think you don't have it and need to create a new save or need to start the whole process over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game. Just started getting \"the server is not reachable\" and I really don't care enough to troubleshoot this. It is a single player game, this is beyond stupid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game, really fun. Crashes on Windows 11 often. What a shame. Would have been an absolute thumbs up otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, this is my favorite, I played it a couple of times to 100% on sony. A million times on the computer and they still haven't fixed the dead antialiasing. We need Temporal Antialiasing for graphics that came out after the fucking game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only bought this game because it remove something I don't like in Just Cause 2.\n\nWhile almost every reviews I came across tend to compare this game to JC2, I aim to do it a little different.\n\nOverall, the game is decent in terms of graphic and atmosphere, but that's about it.\n\nNow there are no side missions, so players are given with no reason to venture the map. It's an open world game, and the game decided not to tell players to expose or even familiarise themselves with the map? Not to mention a large portion of the map is ocean, which is a location that no crucial game content exists, going underwater is not an option either as the ocean is deep enough to drown rico. North of the wall is a no mans land, now the northern medici takes up almost half of the map, yet it's a boring place, not even liberating them changes the situation. Seriously, what's the point of playing the map if half of the map isn't populated by medician? And what's the point of playing those DLC map if none of those maps serves any purposes after DLC missions are completed?\n\nAnd the enemy can infinitely spawns somewhere outside of the rendered area, hiding somewhere out of your sight, calling reinforcements. I prefer shoot them all dead to get ride of the heat, but feel free to hide yourself if you want an easy way out. The game has a intriguing definition of clearing heat, my speculation is that the game real time checks your premises(must be hard coding), if no enemy npc is in that premises, then heat would be cleared(same goes for any fighting npc btw). Yet there are certain conditions that heat is cleared despite there are visible enemy npc is in the area, there are possibilities that npc being shot dead, reinforcement are still being called, also all enemy respawn if heat is gone in any conditions.\n\nI personally speculated that one of the major difference between JC2 and JC3 is that the enemy vehicle appeared during heat progression. In JC2, Rico doesn't get to worry about tank cannons and 180 degree shooting machinegun; In JC3, he does, 'cause tanks was putted in vanilla game to f**k up your reign of chaos. To sum it up, it's an unbalanced combat system that JC3 present to the players.\n\nThere are a bunch of game contents that avalanche studio fail to arrange and make sense of, wingsuit and parachute are one of them. Since the game emphasis the constant usage of wingsuit and parachute, it integrated both of them into one travelling methods: rico can wingsuit after launching into air with parachute. While comparing this to JC2, this seems weird: JC2 rico can simply opens up parachute then boost his way to the destination; while JC3, rico can fly with wingsuit and parachute, kinda confusing if you ask me. Why the h*ll would you open parachute if you had the option land with your wingsuit? Make wingsuit and parachute separate, use wingsuit to move fast; parachute for laid back experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the DLC content was not worth the money at all imo. I would avoid all together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wack Gunplay & Janky Movement",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a boring game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No... just no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would like to recommend JC3 but if it was a score out of 100, it would be around a 55. I've given it a thumbs down since I don't think it deserves its overwhelmingly positive status. The game is fun, but my goodness gracious was there a lot of barriers to that enjoyment, and the only reason I actually dedicated the time to finish it was because I'm trying to clear my games backlog, otherwise, based purely on fun vs. frustration, I would have never touched it again. If you want the succinct version, JC2 is the genuine article, fun, engaging, right tone, excellent setting. JC3 feels like the backwards cap wearing 40 year old uncle who tries way too hard to be cool.\n\nIt's hard to break this into good and bad, as it seems every good part about this game has its bad side. As most people have said, the moment to moment gameplay can be fun, with the typical JC blow everything up in sight gameply. But f me if the controls don't just suck. Where to begin. Rico often feels like he's moving around in molasses, rather than the fluid control of JC2. The driving and flying is just confusing, it's impossible to get a good handling feel. The only way I can describe it is arcadey on steroids, and sometimes you'll be braking for a nice gentle turn and the cars/motorbikes will do a full 90 degree turn since you've pressed some combination of controls. It's almost like they didn't QA test the controls enough. And the way they force Rico to walk on aircraft, which, if you're doing boat based missions, welcome to the most dangerous enemy in the game. Hit-scanning machine gunners on boats that will kill you in seconds since you can't move much faster than a sloth. Or the way they don't let you walk off edges (it literally stops you, then you have to press jump if you actually want to jump off an edge) - this really breaks the fluidity of controls. I could go on, but just to say, the controls and handling of Rico contribute a great deal to the frustration.\n\nThe setting is also very beautiful, though I wish they set more of the game on the last island, which seemed to have more interesting biomes than idyllic Mediterranean seaside #36, but given the same-ness of the first two islands, liberations of settlements becomes a real grind towards the end. \n\nThe minigames can be fun - at first. But the way they locked a lot of the fun elements behind these 'gears' that you earn, and some essential gear, means this locks the more fun gameplay behind a lot of these mini games, contributing to that frustrating grind, where JC2 gave you a lot more freedom to just enjoy the insanity of the game from the get-go. It does tie well into the gameplay loop, and provides a somewhat fun distraction. When combined with the absolute junk controls however, this can really become a drag. \n\nFinally, the story and characterisation just really plays into that 'try-hard uncle' metaphor the most. JC2 had this wonderful self aware ridiculousness to it, whereas the tone of JC3 seems a bit all over the place. I mean, I feel like the developers are aware of the subtle irony of liberating a settlement by completely destroying it. I would love to say things like 'I have come to liberate you!' just before launching a missile into a crowded street, or creating a gordian knot of civilians and their cars using the grappling hooks until they explode. So the premise of the games absolutely ridiculous. I feel like they kind of tried to shy away from this with the story, tried to make it a little serious which I think was a bad choice. As for the characters, I don't know how, but over the course of the game I came to hate absolutely every character in it. Maybe apart from Annika and Teo, who barely featured in it, but everybody, including Rico, just were so annoying. The way he would shout 'Boomgift!' every time you threw a grenade... I mean, it just felt totally lame coming from Rico. I liked in JC2, where he was always completely serious, and the game was ridiculous around him, if that makes sense. Dimah is annoying as hell. Mario tries to be funny, but, yeah, everything just falls flat. \n\nSo, overall, the gameplay was fun enough to keep me hooked, but getting there in the end was a really frustrating experience. I do recommend the game (even though I've thumbed it down), but barely, since I would love a Just Cause that feels like a Just Cause game, and not trying to pretend to be something else, like I feel they were trying to do with this game.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Any Game that forces you to be online to play it is not going to get a positive review from me. What happens if my internet is down...\"Oh sorry you can't play the game you paid money for because we want to force you to be online\". Not only is it forcing you to be online with steam but it logs into some unknown server that I don't want to be on!",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "If you got new gen pc and specs probably dont get it. The game is a masterpiece and is super fun but it is not made to run on newer gen tech and constantly has issues",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "This game is 10 years old and the moronic devs havent fixed a single bug.\r\n\r\nTheres a constant connection issue to their stupid online servers WHICH SHOULDNT EXIST ON A SINGLE PLAYER GAME\r\n\r\nYou constantly have your game interrupted because of failures to connect. Open the menu? Have to wait a minute for it to try and reconnect. Complete a challenge? Have to wait a minute for it to try and connect to online servers. \r\n\r\nIts honestly mind boggling. \r\n\r\n\r\n\r\nThen you got challenges that are LITERALLY BROKEN still after 10 years. \r\n10 years. 10 years and they still havent fixed broken and bugged out content. \r\n\r\nJust wasted 30 minutes trying a challenge only to go to discussions to find out hundreds upon hundreds of discussions already exist talking about it and its broken. Its just broken. \r\n\r\nDespite TEN YEARS passing and HUNDREDS of complaints there are still broken challenges and game ruining bugs. I cant even believe it honestly.\r\n\r\n\r\nIll never purchase another game from these braindead devs.",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "Unfortunately encountered too many different minor bugs/glitches that prevent doing quests playing it for about an hour, seems like the game is too rusty.\n\nThough it seems really fun and unique.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Don't buy this piece of shit game... you wont be able to load/play in both online and offline mode. At this point this game should be delisted",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "All these years later and the game still has performance and crashing issues. Its genuinely pretty insane that I still get really terrible stutters, significant FPS dips and hard crashes. Not to mention the fact every single time I start up the game it takes maybe like a full two minutes because they need to sign into their 'service'. Better pray the game loaded up all the DLC too cause if it didn't it'll think you don't have it and need to create a new save or need to start the whole process over.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Very fun game. Just started getting \"the server is not reachable\" and I really don't care enough to troubleshoot this. It is a single player game, this is beyond stupid.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Great game, really fun. Crashes on Windows 11 often. What a shame. Would have been an absolute thumbs up otherwise.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game, this is my favorite, I played it a couple of times to 100% on sony. A million times on the computer and they still haven't fixed the dead antialiasing. We need Temporal Antialiasing for graphics that came out after the fucking game!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I only bought this game because it remove something I don't like in Just Cause 2.\n\nWhile almost every reviews I came across tend to compare this game to JC2, I aim to do it a little different.\n\nOverall, the game is decent in terms of graphic and atmosphere, but that's about it.\n\nNow there are no side missions, so players are given with no reason to venture the map. It's an open world game, and the game decided not to tell players to expose or even familiarise themselves with the map? Not to mention a large portion of the map is ocean, which is a location that no crucial game content exists, going underwater is not an option either as the ocean is deep enough to drown rico. North of the wall is a no mans land, now the northern medici takes up almost half of the map, yet it's a boring place, not even liberating them changes the situation. Seriously, what's the point of playing the map if half of the map isn't populated by medician? And what's the point of playing those DLC map if none of those maps serves any purposes after DLC missions are completed?\n\nAnd the enemy can infinitely spawns somewhere outside of the rendered area, hiding somewhere out of your sight, calling reinforcements. I prefer shoot them all dead to get ride of the heat, but feel free to hide yourself if you want an easy way out. The game has a intriguing definition of clearing heat, my speculation is that the game real time checks your premises(must be hard coding), if no enemy npc is in that premises, then heat would be cleared(same goes for any fighting npc btw). Yet there are certain conditions that heat is cleared despite there are visible enemy npc is in the area, there are possibilities that npc being shot dead, reinforcement are still being called, also all enemy respawn if heat is gone in any conditions.\n\nI personally speculated that one of the major difference between JC2 and JC3 is that the enemy vehicle appeared during heat progression. In JC2, Rico doesn't get to worry about tank cannons and 180 degree shooting machinegun; In JC3, he does, 'cause tanks was putted in vanilla game to f**k up your reign of chaos. To sum it up, it's an unbalanced combat system that JC3 present to the players.\n\nThere are a bunch of game contents that avalanche studio fail to arrange and make sense of, wingsuit and parachute are one of them. Since the game emphasis the constant usage of wingsuit and parachute, it integrated both of them into one travelling methods: rico can wingsuit after launching into air with parachute. While comparing this to JC2, this seems weird: JC2 rico can simply opens up parachute then boost his way to the destination; while JC3, rico can fly with wingsuit and parachute, kinda confusing if you ask me. Why the h*ll would you open parachute if you had the option land with your wingsuit? Make wingsuit and parachute separate, use wingsuit to move fast; parachute for laid back experience.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "the DLC content was not worth the money at all imo. I would avoid all together.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wack Gunplay & Janky Movement",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "What a boring game",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "mid ass game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "No... just no.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Boring",
      "voted_up": false,
      "votes_helpful": 1
    }
  ]
}