{
  "positive": [
    {
      "review": "Easiest game I have ever played, highly recommended! Definitely did not spend 56 hours just to complete a single playthrough and still end up with a bad ending. PS. Wuchang is hot :3",
      "voted_up": true,
      "votes_helpful": 58
    },
    {
      "review": "---{ Difficulty }---\n☐ Easy\n☐ Normal\n☐ Hard\n☐ Difficult\n☑ Dark souls\n\n---{ Gameplay }---\n☐ Very good\n☑ Good\n☐ Meh \n☐ Watch paint dry instead\n☐ Just don't\n\n---{ Graphics }---\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Don‘t look too long at it\n\n---{ Character design }---\n☐ Beautiful\n☑ Good\n☐ Meh\n☐ Bland\n☐ Bad\n\n---{ Story }---\n☐ Lovely\n☑ Some lore\n☐ Good\n☑ Meh\n☐ Bad\n\n---{ Audio }---\n☐ Very good\n☑ Good\n☐ Meh\n☐ Bad\n☐ Just don't\n\n---{ Music }---\n☐ Very good\n☑ Good\n☐Meh\n☐ Bad\n☐ Forgot\n\n---{ Audience }---\n☐ Kids\n☑ Teens\n☑ Adults\n☐ Grandma\n\n---{ PC Requirements }---\n☐ Check if you can run paint\n☐ Potato\n☐ Decent\n☑ High\n☑ Fast\n☐ Ask NASA if they have a spare computer\n\n---{ Performance }---\n☐ Perfect\n☐ Great\n☐ Good\n☑ Meh\n☐ Terrible\n\n---{ Game Size }---\n☐ Floppy Disk\n☐ Old Fashioned\n☐ Workable\n☑ Big\n☐ Will eat 15% of your 1TB hard drive\n☐ You will want an entire hard drive to hold it\n☐ You will need to invest in a black hole to hold all the data\n\n---{ Grind }---\n☐ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isn't necessary to progress\n☑ Average grind red mercury to unlock skill tree\n☑ Too much grind red mercury to unlock skill tree\n☐ You'll need a second life for grinding\n\n---{ Game Time }---\n☐ Long enough for a cup of coffee\n☐ Short\n☑ Average\n☑ Long\n☐ To infinity and beyond\n\n---{ Price }---\n☐ It's free!\n☑ Worth the price\n☑ wait for sale\n☑ Buying Black myth wukong or Elden ring instead\n☐ Not recommended\n☐ You could also just burn your money\n\n---{ Bugs }---\n☐ Never heard of\n☑ Minor bugs\n☐ Can get annoying\n☐ ARK: Survival Evolved\n☐ The game itself is a big terrarium for bugs\n\n---{ ? / 10 }---\n☐ 1\n☐ 2\n☐ 3\n☐ 4\n☐ 5\n☐ 6\n☐ 7\n☑ 8\n☐ 9\n☐ 10",
      "voted_up": true,
      "votes_helpful": 56
    },
    {
      "review": "Maybe one of the best games in this style since Elden Ring. In my opinion, it even surpasses Wukong: Black Myth, which is also a fantastic game and comes close to the quality of FromSoftware titles. I really enjoyed the excellent combat and impressive level design. I highly recommend giving this game a try, despite the overly harsh negative reviews.",
      "voted_up": true,
      "votes_helpful": 36
    },
    {
      "review": "Hi everyone,\r\nI’m not a game expert, but I wanted to share what I felt while playing Wuchang. I’ve finished the game three times in just two weeks, and honestly, I’ve completely fallen in love with it. I can’t stop thinking about Wuchang — this has become my life game.\r\n\r\nI grew up watching Chinese action movies, so I’ve always been a fan of that style. Wuchang’s combat, story, horror atmosphere, Chinese legends, and overall world design all hit the exact things I love the most.\r\n\r\nI also love Wukong, but Wuchang is a very different experience. I grew up with the Monkey King story since I was a child, so Wukong naturally made a big impact on me too. Now, both Wuchang and Wukong sit at the top as my favorite games of all time.\r\n\r\nI’ve been gaming since primary school — I’m from the PS1 and PS2 generation when I was a university student. After that, I moved on to PC games like Counter-Strike. But since around 2007, I basically stopped gaming until last year.\r\n\r\nI bought Wukong when it first came out, but it was too difficult, so I gave up after a few hours. Recently though, my rusty gaming skills improved, and when I tried Wukong again, I fell in love with it. That’s what led me to Wuchang.\r\n\r\nAt first, I wasn’t sure about Wuchang because I usually prefer hack-and-slash. But after I learned its systems — Temper, Benedictions, Jade Pendants, and Spells — and understood how to build skill sets properly, I ended up absolutely loving the gameplay. And honestly… Wuchang herself is beautiful and sexy.^^\r\n\r\nI’ve tried other soulslike games recently, but nothing feels like Wuchang. Everything else becomes boring quickly.\r\n\r\nI strongly recommend this game — 9.5/10.\r\nEnjoy!",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "Like an old school Dark Souls but with all the needed improvements. Close to ideal game and definitely top 2025 SoulsLike",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Incredible atmosphere and level design. Combat is varied and well-designed. Different combat mechanics to keep the game interesting until the end. Bosses are challenging but fair, you never feel as though the game is unfair. The game does a good job of storytelling",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "The best soulslike game I’ve ever played. Here is why:\r\n-Amazing atmosphere\r\n-Excellent level design\r\n-Great gameplay\r\n-Very difficult\r\nI recommend this game to masochists!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I loved that you could respect and use any of the weapons/skills you desired at will.  Made it novel in a way to play that way.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Wuchang: Fallen Feathers is a visually stunning Soulslike that dazzles with its Unreal Engine 5 environments and ambitious new systems, but it often stumbles under the weight of its own mechanics. The Madness disease adds a unique twist to combat, though its mandatory nature quickly turns frustrating, especially in Bossfights.\r\nSlow animations, unbalanced encounters, and bland NPCs hold the experience back, yet for dedicated Fans seeking an uncompromising old-school challenge wrapped in modern visuals, Wuchang delivers a substantial, value-priced Adventure\r\n\r\n77/100",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Really good story telling and combat, wish there would be open world and a map tho. Fun to complete all of the achievements.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Had a blast, amazing game, definitely worth buying and experiencing!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Best souls-like I’ve ever played after Bloodborne, Sekiro and Elden Ring",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This is somewhat challenging soulslike game, at first I did not really like it and refunded it, but I was thinking to give it a 2nd chance, and I am glad I did, I really enjoy the game and the mechanics of it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "enjoy the Game. But I am forced out of all updates and patches because of them changing the game due to the Chinese government. I do not blame the dev's for this.\r\nI will stick to version 1.4 until someone can figure how to get the original version to work with the new patches and updates. I am currently trying V 1.5 that I downloaded from FITGIRL, trying to blend it with 1.4\r\n(I paid for it so its ok that I downloaded the fit-girl repack.) \r\nIf none of this bothers you then Get it! Souls Like is FUN LIKE!",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "This game has brought me pain and dopamine release like no other.  I spent 2 months hard stuck on Honglan and the moment I beat her was the highlight of my Q4.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun game bosses get spammy towards the end and some fights feel very VERY janky. But still a solid game, had a good time for the most part.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Censorship is bad and it made last part of the game look like a clown show. But the game itself is solid, fun and challenging. You really feel like a real cultivation novel master. But it's really hard to not mess up story so be careful. I would recommend not to support censorship, but if you can get around your morals that game will give you pleasent experience.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great souls like game.runs great,great visuals great combat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is extremely good; however it lacks weapon variety. You unlock weapons extremely rarely, and you have (!) to buy the deluxe edition to have more variety because basegame you just don't get certain build options. I hope they release some Story DLC, because I just would like more. One of the best, if not the best Soulslikes I have ever played.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I was really skeptic about this one, but now I wish it was at least x2 longer.\n\nPros:\n- Combat. Once I realised game mechanics I was like \"okay, I really like this game now\". Sometimes during boss fights it feels like you are NG+ character here. Also don't forget to pick armor based on your enemy attack types;\n- Game setting and world overall. Just feels good [spoiler]except for that blood graveyard idk location[/spoiler];\n- Game plot. \"It is just some dark souls, why should I even bother with checking it?\". At some spoilers moment I realised \"okay, now I have to replay it and pay attention to the story\". And the story is great;\n- You CAN and you SHOULD rekt stuff behind walls. This is not elden ring where your enemies can and will attack you thru walls, but you can't. Use it here. Use it a lot;\n- Main character. A pleasure for my eyes. Combine it with some armor you can grab...\n- Inner demon. I really wish other souls like games would have similar stuff like here. Imagine loosing lots of runes, running back trying to retrive them and then some mf spawns and now you have to deal with it. 10 / 10;\n- Skill tree respec. You can safely remove even a single talent and put the point somewhere else. Really good when you wanna change fire damage to poison for example.\n\nCons:\n- Artificial difficulty or idk. It is pretty common to get grabbed by some dude behind totally random corner. But hey, you can rekt stuff thru textures so simply bonk random wall if you feel sus - there 90% will be some spearman;\n- Monster type bosses. Almost all of them feels like have elden ring moment hit boxes;\n- NG+ balance. At least at my first NG+ feels like I could spew at my enemies and they just die. The game gets balanced a bit later tho.\n\nWorth the price. I didn't get bored even after multiple NG games. Wish you guys GL at making another even better game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "MY SCORE: 10/10 \r\n\r\nThere is a lot to say about this souls-like game. I'd love to write 1-2 DIN A4 pages about it but I keep it brief: You played Wukong before - get the game! You enjoy challenging souls-like games? GET IT. \r\n\r\nThis game packs Wukong level graphics, sexy Chinese protagonist, amazing level design. One of my favorites modern souls-like games. For me, it easily ranks top 3 together along with LORDS OF THE FALLEN and ELDEN RING\r\n\r\n+ Hot Chinese lady - check\r\n+ Insane high quality Black Myth Wukong level graphics (a little bit below but still insane details) - check\r\n+ Great environment, diverse landscape and level design - check\r\n+ Amazing outfit selection. Mix and match as you like. Change the appearance of your gear!!!! \r\n+ Great and simple weapon selection. Although it has not the largest arsenal, but it still offers a great variety to get the job done. It comes with unique move sets and special abilities\r\n+ GREAT UX/UI. Simple and effective menu plus when you enter \"dream state\" where you can enhance your abilities etc, that menu is COOL\r\n+ Cool bonfire/checkpoint animation by sacrificing blood. I LOVE IT! \r\n+ Combat is solid and bosses are challenging and fun!!! \r\n+ GREAT FSR3 integration\r\n+ Good sound design\r\n+ Cool endings\r\n\r\nThis game is basically \"Black Myth Wukong\" with a hot female and without the Wukong cinematics, but still it is a top tier game. Aside of the controversy and \"censorship\" due to Chinese backlash, it is fundamentally a very good game\r\n\r\n- The skill tree menu is overwhelming which leaves you with the feeling that you require a PhD to understand everything\r\n- Magic feel a bit underwhelming?? \r\n- Performance issues in snowy chapter",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Excellent souls game that desperately needs a map.  Huge areas with multiple branches always makes you feel you are missing areas and things to see.  It's just screams laziness on the part of the developers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really fun game, Its got a huge map and has so many neat mechanics, Its really difficult too which makes it standout more, If you like souls like then this game is a must have, although the jiggle physics in the game are weird and annoying but at least  there are ways to cover up the jiggle physics and not all the armor is revealing which i like. over all a solid 8.5/10. The revealing outfits plus jiggle physics bring it down by .5. this game is being slept on for sure and isnt getting the attention it deserevs",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I loved this game from the very start. The scenery is absolutely stunning — every area feels atmospheric, detailed, and crafted with real care. The world pulls you in immediately.\n\nThe combat is where WUCHANG truly shines. It feels unique, weighty, and satisfying, with a huge variety of weapons and skill trees that let you experiment with completely different playstyles. Whether you enjoy fast, agile combat or heavy, punishing strikes, there’s something here that fits perfectly.\n\nWhat impressed me most is how the game rewards learning and mastery without ever feeling unfair. Every fight feels meaningful, every boss is memorable, and the progression feels genuinely rewarding.\n\nI’ve recommended WUCHANG: Fallen Feathers to every friend who asks what game they should try next or when they’re bored — and every single one enjoyed it.\n\nIf you love atmospheric worlds, deep combat, and a game that respects your time and skill, this one is absolutely worth it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Beautiful world and satisfying combat, but the rough performance makes it tough to fully enjoy right now.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "When this game first came out i couldnt play this game at all, but luckily the devs fix their game and now i am enjoying this souls like.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Despite the negative reviews I heard, I really enjoyed this game and would recommend it to others.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Beautiful worldbuilding and sound design, updates have included so far several qol features that have been requested or modded in previously by the community",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "It kinda tries to simulate the sun with the amount off heat it generates. But solid game tho good combat and had fun with the storyline (I did not play the game on steam that explains the hours)",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Reminiscent of Sekiro and Wo Long: Fallen Dynasty. I am not comparing WUCHANG: Fallen Feathers to either of the two previously mentioned games. I just enjoy games that offers assorted weapons, an extensive skill tree, and requires impeccable timing. Are the bosses unpredictable? Yes, but that's where the player's skill and at times patience must prevail. Otherwise, you will find yourself rage playing, which I must admit, i did....a lot! But once you understand what the various items you collect along your journey can do and how to use them, you get better and progress. I PROMISE!\r\n\r\nIf you like a challenge, play WUCHANG: Fallen Feathers.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Best souls-like experience I've had since Elden Ring. I actually prefer this over Elden Ring because I don't like the concept of open world in souls-likes. This was the first game since Dark Souls 3 that I found myself constantly dying and needing to improve, in a good way. The combat is top tier; the weapon move sets and abilities get progressively more rewarding and more satisfying. The environments, the level design, the character/enemy design and the plot are top tier. Overall it was a very unique and enjoyable experience to the point where it was so good that I spent hours watching lore videos once I finished the game. Highly recommend.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "dont know how far in i actually am, but so far its actually better than i thought... even awesome at times. you really cant go by what you hear anymore. it does seem to be tough to run, but i have it max settings and no stutter. world design is pretty awesome. bosses pretty good. its hard to explain but it actually has some ds1 feel to it. like how ds1 acutually had a high fantasy vibe to it and not just a \" lets be dark and emo \" vibe  that 3 had.  the first couple bosses are pretty easy, first skill check so far was pond boss. got to say, supriesd and in a good way. ( sorry for typos , playing on tv and can barely see what im typing from here) anyway, would say this is a solid 8 these days if you have the machine to run it. enjoy.  \n\nedit: nearing end i believe, got to say, this is a banger.  \n\nedit #2: just finished it. what a Fu#@ing banger.  absolutely underrated imo.  if you like souls games , then should give a try, just make sure you have the hardware for it. good cooling is probably a must. i have a window unit i ran in my room the whole time. my ambient in room was probably about 65f . without hardware scheduling cpu would hit about 60 to 65 c, with scheduling was about 51 to 60. gpu temp would float between 51 and 55  ish sometimes more but mostly in that window. gpu memory was between 60 to 65 c. think it peaked at 68 at one point. ryzen 7 9700x 32g 6000 ram rx 9070 saphire 2 fan. had everything maxed, but i also played this on my tv at 1080. just wanted to sit down in my bed for this one. \ni opted for running with out scheduling, seemed like i had a couple stutters with it on ( i only experineced a couple at all really) but that could have been totally random and had nothing to do with it.  either way, was a fun time. couple of the fights actually got my blood pumping, been awhile since that happened.\n\n/farewell",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "最近才有空把这个游戏给打完了，游戏一开始发售也玩过，所以前后对比还能看到制作组在难度上的变化，更多的还是削弱了 Boss 的压起身，很明显新版体验好了不少。\r\n\r\n这游戏怎么说呢，你说它简单吧，它是魂游，一点都不简单，推图还有恶意，boss 都会长连段，不少跟 TM 疯狗一样。\r\n\r\n但你要说它难吧，它里面有大量的轮椅，从法术到装备，到各种派生技能，很多一看就是超级轮椅，轮椅中的轮椅，而且除了那俩粪 Boss，其他的很少有快慢刀，基本上都可以用拒绝交互的方式快速击杀。讲道理找轮椅打 Boss 其实也是一种乐趣，还挺有意思的。\r\n\r\n游戏的篝火少，地图分叉多，但是确是用心设计过的，四通发达的感觉会让你觉得很妙，但是走起来也是真的绕。\r\n\r\n羽毛啊，体力值啊之类的元素，也是缝合了一些传统战斗ACT的长处，让游戏打起来很爽，不完全像魂系那样残疾人，但是那羽毛的 UI 就不能设计的清晰一点吗？\r\n\r\n剧情和氛围总让我想起那个什么《卧龙苍天陨落》，碎片化叙事和到第二章为止的一些展开说实话还挺秒的，至于什么明粉，我是无法理解的，你可以不喜欢清朝，那明朝也不是啥好玩意吧，哪怕是盛唐，在历史中也是动辄杀来杀去的，不过根据我了解，玩剧情节奏的大概率也不会玩游戏，随他去吧。\r\n\r\n游戏是个好游戏，至少是及格线以上的游戏，设计也是用了心的，甚至怕你玩不过去，给你很多轮椅。但是宣发上，细节上，还有制作人的自我表现欲上，以及那脑残的哔站KOL的合作上，踩的坑太多了，希望能给后续作品或者其他国产厂商带来告诫吧。\r\n\r\n很多人说国产游戏崛起了崛起了，动不动销量多少多少，但在我看来，大部分人还是拿游戏当“消遣”的路人，而不是喜欢游戏本身的“玩家”，想要国单真的崛起，至少先得构建起真正的“玩家群体”和“游戏文化”，任重而道远啊。",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "The reviews tend to be all over the place about this game, largely because of changes made in an update not long ago, as far as I understand. I played through the game post-update, and I couldn't put it down. The combat is excellent and very fast-paced, the game is visually quite striking, and the story is quite philosophical and thought-provoking, though about as cryptically presented as most Soulslikes. The devs also seem to be pretty receptive to feedback and active with quality of life updates (one of which was implemented during my playing time of the game which eliminated boss walkbacks and was much appreciated).\r\n\r\nIf you're interested but on-the-fence about picking Wuchang up because of the reviews, do yourself a favour and just jump in. It's easily one of my favourite Soulslikes of all time and up there on my personal Game of the Year rankings.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "super dope game remind me of wukong be honest same game just sexy female instead of a monkey",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Excellent game! Great QoL improvements from updates. Multiple playstyles encouraged. Labyrinth and hazy storylines… very Dark Souls vibes in that sense. Some features/systems I never quite understood or utilized (madness, feathering). \n\nI do think this beat out WuKong for me. \nSolid 8.75/10.00",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really beautiful game, it looks extremely realistic. Combat is super fun and environments are joy to explore. Character, Wuchang is wonderful too, strong female warrior! I love the vibe and everything about it!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Lots of Wuchang, some falling and a decent amount of feathers.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Solid souls-like.\r\n\r\n+ Fun, fluid combat\r\n+ Great bosses\r\n+ Good buildcrafting and weapon variety\r\n+ Mostly excellent level design\r\n+ Rich visuals and sound design\r\n+ Good fashion souls\r\n+ Rock solid performance in spite of typical, but bearable, traversal stutter\r\n\r\n- Some annoying level design and traversal systems; elevators are slow as shit\r\n- Some weapon types feel distinctively better or worse in pretty much all scenarios; Longsword is good at everything, Axe and Dual Blades both have cheese tactics that invalidate a lot of mechanics, 1H Sword and Spear feel pretty underwhelming comparitively, but not woefully underpowered.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Purchase if discounted! I believe it is a commendable game. It falls short in certain aspects, such as the character's face not exhibiting much movement during conversations, the incorrect weapon being displayed in cutscenes, and occasionally the campfires being positioned too far away. Nevertheless, the combat, bosses, leveling system, and optimization are done well. I would rate it 6.5 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Having a ton of fun with this one. Once you get used to how the mechanics work the enemies and hte bosses become very fun and engaging. The levels are very dense with a lot alternate pathways and hidden items to look out for. Definitely Recommend for anyone looking to play another fantastic action game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great gameplay, more similar to fromsoft style than any other souls like I've played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Wuchang: Fallen Feathers is a great souls-like game, and one of the best I played. I pre-ordered and played it at launch, it had some performance and gameplay inconveniences at first, but they fixed it shortly after with a patch.\nThat said, I finished it before the first patch dropped and I can say that even with that, I really enjoyed it (I couldn't wait for a patch lol).\nI will try to keep it organized and simple:\n- Gameplay is really good and versatile, buttons are responsive, and the combat is fluid. Once you understand it, even boss fights can feel like a dance (dodges, counters, gaining skyborn might, skills, combos, magic, timing magic counter spells, fleeting, clashes, etc). No clunky movement or animations, they are well done.\n- You have five weapon classes to choose from and unlock skills for, you can equip 2 weapons simultaneously, and switch freely between them in combat either regularly or with a swift draw. Every weapon class feels unique and has its advantages and disadvantages. So try the different weapons and find the ones that you like and match your play style. Each weapon category has discipline skills you can unlock from the related skill tree and equip to your weapon. Moreover, each individual weapon (even in the same class) has a unique weapon skill. You like slow hard hitting weapons? trading blows with your opponent in a quick succession with a twin blade? prefer a long reach thrusting weapon? or maybe swordplay? the game's got your back.\n- Skill points can be reset at any time at no cost, and as many times as you want. You can even reset the whole skill tree and start over if you wish. The game encourages you to experiment with different stuff.\n- Magic: The game has a fair amount of spells you can use; offensive, defensive and support. You can hold up to 4 spells at a time. It can help you in combat even if you are not going for a magic build. Some can help apply status effects such as burn.\n- The skyborn might is a new idea, and is well implemented. You need to understand it because it is crucial for the game play, such as for certain weapon skills, moves, combos or magic.\n- Difficulty: this is a souls-like game, so it is hard, BUT it is on the easier side of the games in the genre. It is quite enjoyable without being overly hard. That said, the devs made the game even easier in a later patch. Some areas became significantly easier, some enemy encounters were trivialized, some bosses were nerfed. Personally I didn't like that, it is a souls game, it is supposed to be difficult. You learn and you get better. Well, at least I finished the game once before that happened :(\n- The story is average, but enjoyable. Some people complain about censorship for some story elements that was introduced in a later patch, but I played the game again after that patch and honestly it didn't really bother me. I'm not familiar with Chinese culture or historical figures, and I don't really play these games for the story.\n- Level design is good, and levels are smartly interconnected. Make sure to unlock shortcuts, it will make your life easier, either for traversing the level or for backtracking, if needed, later on. Exploring is rewarding, you will often find useful items, spells, upgrade materials, etc.\n- Graphics: the game is aesthetically good; models, textures, effects, magic, etc.\n- Music is good, and some boss sound tracks are epic.\n- Performance is not the best. It is an Unreal Engine 5 game, so it suffers from that engine's issues. However, it was improved a lot after a couple of patches.\n\nIt is a great souls-like game, worthy of your time, and a must play if you are a fan of the genre. You will enjoy it.\nI didn't expect such a good game from a small team, and really didn't have high hopes when I first saw it, but it exceeded my expectations. Well done, Leenzee.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Game was great. The exploration was really good for a souls-like",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ignoring the technical issues the game had after release, this game is amazing. I actually did not like it much at first and came back after 6 months to give it another chance.....10/10 very glad I did because it only gets better as you go.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the best AA game I've played in a long time!  Yes, A LOT of the combat and and things are nearly exact copies of Elden Ring, but the game is fun to play, nonetheless.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its alright. Feels like Black Myth: Wukong, but the controls are a little clunkier and the camera angles aren't as smooth. The mechanics are a little inconsistent, which can be frustrating. For instance, clearing an area is more challenging than the bosses (I think I fought a bunch of bosses out of order...). The game looks great. I'm a little lost about what's happening, and there's no map. You can unlock shortcuts from area to area, but without a map, I wind up wondering through the same places having to fight the same respawns. Still learning the game and will keep playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very slick, beautiful game wit interestin gameplay mechanics. cool costume designs too. atmosphere givs off strong demons souls/bloodborne vibes. i look forward to jumpin in again.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great enviroments, fluid and engaging combat, good soundtrack and stunning visuals.\r\nBoss design is awesome, as someone who hasnt played any soulslike games at all, it feels challenging but not impossible.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is fun and some great gameplay and is a lot of fun. most of the bad reviews here are about the 1.5 update but if you start playing now then it does not really matter.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of the better \"Souls-likes\". It looks great and best of all: NO jump button, so no platforming!!! And no dodge rolling (which is just ridiculous, especially when wielding long polearms and wearing plate armor!).\nIt's not perfect though: still no map (prepare to get lost a lot!), shrines (this game's bonfires) are too far apart.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is FUN , if you like soul's Like you can have some fun with this.  This game needed some COOP but its still fun.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Excellent game! Visuals and gameplay are both top-tier!\n\nThe world design is extremely well thought out with shortcuts which remind me of Dark Souls 1.\n\nPerformance wise this game runs very well. Sharpening should immediately be turned off as the default setting added shimmering/grain to the environment.\n\n100% recommend this for any souls-like action-rpg fan",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing and beautiful game. Already beat it on Gamepass, but I'm buying a copy on Steam now to support the devs. They make some controversial changes with patch 1.05, but overall the game is still absolutely amazing. My second favorite soulslike game not made by FromSoft, just slightly behind Lies of P.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game. Very hard pause sort of souls like with its own flavor.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Beautiful game, satisfying combat, rewarding bosses. Can’t ask for much else!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very solid souls like. Combat is exceptionally fun and exploration is also nice. 8.5/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "game has good fighting mechanics, story is average",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A proper souls-like wuxia.\n\nPros:\n\n- Wu Chang is a lovely bae\n- Absolutely gorgeous and detailed UE5 world building and design.\n- original take of old combat mechanic that put some twist with quite diverse builds.\n- game's has no FP, instead it's using charges, you get a charge upon executing perfect dodge.\n- but if you suck at dodge, axe third strike can also generate some charges for you. so no worries there.\n- very satisfying perfect parry, it's nothing like sekiro, but the \"clash\" mechanics are closed to it.\n\ncons:\n\n- character LoD are bit lowpoly compared to the world around it.\n- level design are bit linear, but those missable quests are annoying af.\n- performance could be better for high-end gpu. \n\ncritical cons:\n\n- Devs succumbed to censored political pressured forced by the public contempt regarding depiction of fabled heroes of the past. \nresulted in drastically changing the whole lore that makes zero sense.\n- Devs disabled rolling back to previous build that make it impossible to experience the pre-patched lore.\n\nSouth korean and chinese developers are killing it with their single player games, can't wait for more.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really enjoyed this game. As someone who has been a fan of the Souls series for years, this scratched that familiar itch in all the right ways. If you love the interconnected world design of Dark Souls 1—with its clever shortcuts, looping pathways, and subtly mazelike structure—this game delivers that experience exceptionally well. The best comparison I can give is a blend of Dark Souls 1’s world design with the faster, more aggressive combat style of Bloodborne.\r\n\r\nMy main complaint is that I ran into some performance issues early on. During my first few hours, the audio would cut out and the game would eventually become unplayable. Fortunately, after more than 35 hours of play, these issues have only occurred a handful of times and haven’t shown up again since those initial sessions.\r\n\r\nMy only other criticism is that the late-game stretch felt a bit like a boss rush. I personally enjoy the tense, atmospheric exploration more than consecutive boss encounters. To be fair, this was partly self-inflicted, since several bosses I fought turned out to be optional depending on the ending you’re pursuing—and I didn’t realize which were which at the time.\r\n\r\nOverall, it’s a fantastic game, and I’m already having a great time in NG+.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The graphics are good, but unfortunately you can't adjust the difficulty level for the gameplay. It can be a nightmare for beginners, but with cheats you can play it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Overall: 6/10 - Worth Beating\r\n\r\nStory: 5/10\r\nWorld: 7/10\r\nBosses: 6/10\r\nGameplay: 5/10\r\nDifficulty: 6/10\r\n\r\nBest part by far was exploring the world. I had a great time doing that. The gameplay was standard for a souls-like which isnt bad, but it wont stand out. The story is whatever. Not that memorable of a game, but I had a good time for my money.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good game.  Only things I'd change:\r\n1. a bit better scaling to later game for some of the weapon types - some feel really good early, and fall off completely, while others feel terrible without upgrades, but feel unstoppable late game.\r\n2. Increase out-of-combat movement speed so can get places quicker.\r\n3. Boss arenas prevent your demon from spawning if you die.  Just let us keep our mercury in those cases.  It always a little annoying to enter a boss room and have to run around trying to find my death drop for the first 10-20 seconds.\r\n\r\notherwise, great game.  I enjoyed the madness mechanic with your 'souls' drop when you die.  Makes it a bit more punishing to die repeatedly.  And it was always pleasant to spawn the demon in and bait it into fighting whatever killed me.  Felt like a more fun revenge even though it takes twice as long.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I’ve been really impressed with Wuchang: Fallen Feathers! The atmosphere is dark and beautiful, and the world feels rich with mystery and history. The combat is satisfying and weighty, with that perfect balance of challenge and reward. The art direction and music pull you in completely, and the bosses are both tough and memorable. You can tell the developers put a lot of heart into this one — it’s easily one of the best soulslike experiences I’ve played recently. Highly recommend it to anyone who enjoys exploration, lore, and a good challenge.\n\nchat gpt wrote this since i am to lazy to do it myself but i 100% agreed xD",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The game is really fun, flexibility in build making and outfit customization, the lack of a map, the fact you don't lose all your red mercury (souls) on dying and have the interesting demon mechanic, it really does encourage exploration and makes it a real fun game to go in blind on.\r\n\r\nIt really feels good to take your time and flip every nook and cranny upside down, speak to every NPC and interact with every shiny spot.\r\n\r\nCombat meanwhile is fast paced, but keeps a nice tempo. Once you get a feel for an enemy's moves, fighting them really starts to feel like a dance, and not just running around waiting for when it's \"safe\" to do one attack.\r\n\r\nThe only \"downside\" perhaps would be the lack of direct character customization/creation, games recently shown that you can have a main character that's already integrated in a story while still letting you create a unique appearance for them, so the protagonist of this one better be to your taste already or you better simply not care that much about it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Weird while i just started, but afterwards amazing, i would say not as hard as ds games but a nice one.\r\nWould be nice if the game could have been more open world like elden ring but still a good game worth playing.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a good game and i dont regret the 25$ i spent on a key site and im only like 6 bosses in",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Man, I loved this game. It’s easily my favorite Soulslike besides the original *Souls* games. The combat feels great — mixing melee and spells was super fun, and I just had a blast overall.\n\nSome bosses hit hard, others not so much, but before the nerf, the world itself was brutal. Just trying to get from one area to another felt like a fight for your life. I kinda miss that, honestly — it felt more alive and dangerous back then.\n\nThings I didn’t like: the world nerf for sure, and they changed some of the final boss lines, which was disappointing. Also, I really don’t like how a lot of boss fights basically force you to use one weapon type and spells. Like, why give us four weapon types if I can only realistically use one? Sure, you *can* try the others, but I value my mental health.\n\nOh, and Wuchang herself? She’s gorgeous. I 100% recommend installing a few mods to get rid of some of the extra armor and clothes that cover her up — she deserves to shine.\n\nAll that said, this game is awesome. Totally recommend it to anyone who likes Soulslikes. You’ll die a lot, but you’ll have a great time doing it.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I recommend this game with a two big asterisks:\n#1: The optimization is pretty bad. Make sure your computer can run this and look up an optimization guide.\n#2: Patch 1.5 of the game and onwards as of this review contains pretty heavy censorship which undermines the core themes of the story. Do yourself a favor and download a mod or look up how to roll the game back to version 1.4.1, and then get the mods which include the 1.5 improvements (mainly animation changes like getting up faster after knockdown/consuming health items a little quicker which make the game feel better to play).\n\nWith these things in mind, the game is great. It's a really competent soulslike with fun combat, a good story, and some \"holy sh*t\" moments, especially one of the endings in particular. I liked it enough to go for every ending.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Can’t believe this game is my GOTY so far in 2025. My favorite China-made game since Fengyun and Jin Yong Qun Xia Zhuan — easily one of the best Souls-likes since Nioh1,2.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great souls like with lots of build variety. Story is hard to parse, but the gameplay is excellent. You'll need upscaling and maybe even frame gen to run this well, but that's just how UE5 are these days.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Looking for a new challenge to fill that souls void? this is definitely up there. Not the most difficult game. Fluid movement and controls, combat is great, like any of these games once you figure out the trick to the boss its game over for them. I 9/10 recommend this to those that love a challenge, if you are not a patient person & gets upset to easily then avoid it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun Game, some cool mechanics like the spell system. The performance is stable on high settings without frame gen on 90-100 FPS most of the time. Also the critical attacks are just savage and i love it. The uncommom level system makes it even more interesting, Pretty sure i'm gonna have lots of fun with this one.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "pretty solid with some good fights, areas, and music\r\n\r\ngame is way shorter than i thought and occasionally lacks polish/fluidity\r\n\r\n7.5/10 imo, doesn't compete w/Khazan or Lies of P overall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Absolutely love this game, my favorite souls like along with Khazan. If I gave a list i would say Elden ring + SOTE DLC 10/10 , Khazan maybe 9/10 and Wuchang tied with it at 9/10 as well. Better than Lies of P or DS3, my only complaint would be not enough weapon variety as each class of weps (longsword, spear, dual blades, axe etc) only has 5-6 types. I have been captivated and enamored with the tale this game has spun. Only achieved the Jarful of Medicine ending so far but, it really enchanted me and strove me to want to start my NG+ and find the other endings and the tale that Wuchang under goes during the various endings/journeys this game offers you. Would recommend whole heartedly to any souls like fan, especially if you downgrade (upgrade imo) to patch 1.41 via the Amene and Phobos guides on the forums for a much more original experience as i believe the developers intended before the BS censoring.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Easily one of the highest quality souls-likes that isnt a fromsoftware game, in my playthrough I would describe it as black myth mixed with sekiro. (i was running a full parry build). The uniqueness of leveling up your weapons allows you to experiment with whatever build you want with 0 downside as a stat reset is completely free. 10/10 would recomend",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great level design and the weapons are fun.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "if you're really into boss fight, like a lot of the souls community is, this one might be a bit easy; but if you more into exploring the levels and combat outside bosses it is a gem. honestly it is possibly my favorite non-fromsoftwarre soulslike.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I first played Wuchang: Fallen Feathers on Game Pass, and although I didn’t get around to beating it, I did enjoy what I played. I’ve now switched to Steam since the devs gifted me a copy for winning a contest.\r\n\r\nSome positives that come to mind are the smooth animations, wide range of enemy designs, sharp graphics, world design, straightforward leveling system, unlocked framerate, and acceptable English voice acting. I also love that you can transmog your armor so you can look how you prefer without it affecting your stats.\r\n\r\nIf I had to give a negative point, the only real issue for me is the poor optimization. Despite using an RTX 5090 and Ryzen 7 9800X3D, I found myself relying on DLSS and Frame Generation. When playing at native resolution with everything maxed, my framerate is noticeably lower compared to any other game I’ve tried.\r\n\r\nIn short, it’s a Chinese Ming dynasty era Soulslike with a sexy female protagonist. Most games of this genre aren’t worth playing unless they’re made by FromSoft, but this one manages to impress me.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I am telling you, this game is COVID's main supply, but still pretty fun to play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty good souls like. I like female protagonists.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I didn't like it after Sekiro, but the game is beautiful",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I beat this before the censorship patch, and at the time, I found it to be a great, underrated Soulslike that brought together many of the things people say they like about the genre.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Amazing game! If you enjoy soulslikes this is a must. Combat is fluid, bosses are well balanced and exploration is top notch!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the best non-Fromsoft Soulslike I've played. Great map and enemy design, combat mechanics. Story needs a bit more polish but it's serviceable. The narrative was made a bit worse by the changes due to Ming controversy but gameplay itself isn't that much affected. Fidelity is a bit iffy but the game's good visual designs makes up for it. Could have been perfect but it is Leenzee's first game so I can forgive them for that.\n\nDefinitely would recommend.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "smooth gameplay and longsword is the goat",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Extremely good game. The graphics are beyond anything you've ever seen. The story and lore is set in a Chinese universe and is very well done artistically. Gameplay is good too, albeit it's as hard as Elden Ring and for me, that's a minus. But it's still an incredibly enjoyable game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "In my opinion this game is a masterpiece of level design. It strongly reminds me of Dark Souls 1. The Bosses until the point where I am at the moment are well designed and interesting, too.\n\nAnd I also like, that they tried to do something different with many mechanics, that I did not see before like make your spell resource dependend on hits with your melee weapons. Also I like that I don't have to run after every bossfight back to the bossfight again, but can simply restart the fight.\n\nFighting feels a little different compared to the fromsoftware games, but that's okay and I got used to it quite fast.\n\nI can't say much about optimization issues, since I did not encounter any, but my rig is more on the beefy side with an RTX5080 and a 9800x3d.\n\nOverall I really like the game, its atmosphere and astetic.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Overall This is a visually stunning game with mechanics to match. Boss fights are much more than expected, (and in my opinion they are overall better bosses than Elden Ring). It has an innovative take on upgrading and fighting mechanics. But, unfortunately when you look past the beautiful graphics, wonderful boss fights, and enjoyable mechanics. There lies a bland story and unoriginal story that is hard to follow throughout the game. But all in all I would still give this game an 8.5 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is stunning, one of the best ones I have played in a long time! The combat is a blast, so many possibilities and builds you can try! Very challenging, but most of the time fair and rewarding combat experience. A treat for every Souls fan!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wuchang: Fallen Feathers has some of the best level and world design I’ve ever seen in the genre, genuinely above even many FromSoftware titles. Exploring its interconnected areas is incredible, and the art direction is absolutely gorgeous throughout.\r\n\r\nThe combat is fine, though it feels like too many mechanics are mixed together without much cohesion. The music is okay, and while the bosses look great, their gameplay is pretty underwhelming, with strange hitboxes and too many instant-kill moves. Performance is poor as well, and the story is forgettable.\r\n\r\nStill, the world and level design are so good that they carry the whole experience. If you love exploring beautifully crafted environments, this game is absolutely worth your time.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Love the setting, nice views, combat good enough. A lot of visually pleasing bosses with cool design, unfortunately being too easy to defeat at times. Weird difficulty spikes, most of boss fights you win within 2-3 tries and than you hit a wall and cannot win for 2 days. However, overall I had great time! Finish game twice as for now and planning my third paythrough ^^\r\nPS. Don't listen to the negative reviews of people who complain about the plot changes! It doesn't affect the experience at all.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Wuchang is a super fun Souls-like game. I loved playing through it and going for the 100%. I really like the skill tree, and the boss fights are so much fun. Plus, Wuchang is hot AF.\n\nGame: 8.5/10\n100%: 8.5/10\nWuchang 10/10 Baddie",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game.\r\n\r\nCombat - pretty basic, but better than Elden Ring\r\nBosses - personally the reason I play this genre of game. Some of the optional bosses are fantastic. The final boss is dull, overly easy, and honestly felt like work instead of a reward.\r\nStory - lol... like most game of this genre, the story is virtually non-existent.\r\nMap design - great!\r\nEnvironments - lush and varied\r\n\r\nI beat all but one optional boss and still got the \"bad ending\" due to not doing a missable NPC quest, which I dont know how I would have known about unless I looked up a playthrough of this game before hand.\r\n\r\nRecommend at a discount.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Incredible Souls-like game, updates people complain about are a such a non-issue while playing the game. Super fun, beautiful and enjoyable experience, love every second of it and hope to see this game get more attention!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "An absolute masterpiece of a game. Bosses are soooo satisfying, mostly fast-paced agile humanoid bosses which i love, and they’re executed perfectly. fast and fair combos that make you feel skilled if you dodge them.\n\nI love that you can switch build and weapon and skills from the skill tree at any time for free so you can test every possible playstyle to find the one you like.\n\nThe magic spells and implementation is REALLY good as well, very fun and cool spells. I also love that you get mana from perfectly dodging attacks, it makes playing a mage build feel skilled and satisfying.\n\nThe level design is very well done, you find yourself completely lost in a new area and then u suddenly realize ooooh im here! maybe a little too confusing sometimes, but it makes for a lot of areas and pathways to explore. the exploring feels very rewarding and fun since you can find a lot of useful and good stuff on side paths. the areas themselves are very beautiful especially the forest area. the towns were a bit confusing to me, i got lost in them a lot. but why the mines? that shit’s annoying as hell. thankfully they don’t do much damage.\n\ni love the skill tree system, having to upgrade a weapon class rather than upgrading a specific weapon because it makes you able to use all the weapons that you find and test them to see which playstyle you like. also the classes all play very different so there will be a good playstyle for everyone.\n\noverall just rly loved the game, 10/10 for me",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I'm only 13 hours in and I absolutely love this game - there's something  about the graphics that I absolutely love, the combat has felt challenging yet balanced and fun, and while I'm not generally a fan of a ton of exploration this game makes it fun and interesting.  This is one of the better souls-like games I've played and probably my favorite game of this year",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "So skipping past the censorship that was done this game, I would still recommend this game to those that like Souls-Like games. It is in some parts easier than the Souls series in my opinion, however, it does exponentially increase in difficulty.\r\nTo talk about some things that was enjoyable in the game. The music has to be one of the things that I liked the most. One can hear ancient Chinese style music playing and next thing you might hear an electric guitar. Another thing that I kinda enjoyed was the Murim like fighting style, After getting off a binge of reading Murim web-comics, this game satisfied that itch for me. Though I got to say that that kinda fighting style occasionally made it hard to fight the enemies because it seemed like it was more flash and not enough hit.\r\nLastly, if you are the type that likes to 100% achievement of games, this is game is one of the easier ones in my opinion (not as easy as Elden Ring though). You can get almost all achievements in one play-through but you do need all four ending so that's the most annoying part.\r\nOverall I gotta say i would rank this game 8/10 there are some issues that are more nitpicks but it's an enjoyable game for Souls-Like people a bit on the easier side and fairly good music.\r\nPS. recommend going through Worship Rise,Underground,Beach,Cloudspire,Mt.Zhenwu,Bao Manor,and Last place won't say for spoilers.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Definitely one of the best non-Fromsoft soul games, the soundtrack and level design is wonderful. You can accidentally miss a few area or don't even know about it, or even got early access in some area while under level. Some bosses could have been better but Honglan and the White-Robe Elder can carry them. There were some bug and crashes but not very often to the point of annoying. Despite there is not DLC announcement but Im satisfied with the base game.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Probably the hardest souls game I have played yet.",
      "voted_up": true,
      "votes_helpful": 3
    }
  ],
  "negative": [
    {
      "review": "Despite its optimization issues (well, it is UE), this game has some really striking positives. The graphics and art direction are amazing, the level design is pleasantly labyrinthian in the spirit of Dark souls 1, full of interconnected paths and shortcuts. It's also a pretty long game, 40 hours in and I still have many bosses left to challenge. \n\nHowever, and this is coming from someone who finds dark souls and elden ring easy at this point, the bosses become brutally hard (from Honglan and on), to the point of being unfun. Most of their moves don't have any obvious punish windows like in most soulslike games and getting the chance to land a hit feels more RNG than skill based. The difficulty is very artificial in that sense, and overcoming a hard obstacle feels less rewarding and more of a relief, since you don't have to fight them again. \n\nSadly, I'm afraid I won't be able to finish this game, and it's a shame because I really like it. So I can't recommend this game to the average soulslike enthusiast, but if you're looking for an unfair challenge and like redoing the same battles over and over for several hours, this game is for you.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "It's been patch 1.7 and still no boss replay/boss rush mode and loadout system. Always having to switch out armors, pendants and benedictions, based on how I feel like taking on selected bosses or areas gets pretty tiresome.\nIt would have been a thumb down after the story got censored but I postponded it and waited for upcoming updates. Because despite those issues, the story (before the censorship), level design and music are pretty solid; weapon variety is also a plus, many different weapons and skills that it really lets you play your own way and re-spec is free.\nHowever, the game failed through many updates. Feel like bosses become more stupid and difficulty got nerfed through every updates. Revert to patch 1.4 if you really want to play the game at its fullest.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "This game is fun, but doesn't do anything original. The performance is still pretty horrible as of writing this review as well. \nThere is a lot of Dark Souls looping back around through locked doors, but I'd argue there's too much, to the point where feels stale and not earned. There's a lot of bad level design as well, (example, an area where there are rolling boulders, one boulder roles into a dead end that has lot in it, but another roles to a dead end that just kills you if you step into it.) The bosses don't feel properly balanced to me either. I've played a lot of Souls games and the toughest bosses in those games feel fair. The bosses in this game aren't insanely hard, rather, they're just annoying. Crazy overpowered attacks make them feel artificially hard rather than earning their difficulty. \n\nIt's not a bad per say, just a lot of small issues spoiled the experience for me.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Oh this game was good, Dark Souls 1 vibes all over.\nThen they censored the game and fucked up the lore and make late game areas filled with allies and much much easier\nIf you're gonna buy this, revert to version 1.4 with mods",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Unfortunately, I cannot recommend this game, much as I wish I could. As someone who lives and breathes Souls titles, I was genuinely eager to play it. However, the performance is absolutely dreadful. Ignore anyone claiming it runs fine - it simply doesn’t. \n\nIt’s the same crowd who insist Red Dead Redemption 2 runs flawlessly on their PlayStation 4, likely because they own some mysterious model no one else seems to have. Or those who claim that 30 FPS is perfectly acceptable because the human eye supposedly can’t perceive anything beyond that.\n\nI’m running a 9800X3D and a 5080, and while the FPS at 4K was decent, the frame times were appalling. I ran a frame time graph using RTSS, and it was one of the worst I’ve ever seen, it resembled an ECG.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "A decent souls-like game but the design of the last level forced me to give up and I didn't finish the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the level design is amazing but that doesn't carry it over the awful gameplay. Its a soulslike thats just slower and clunkier than dark souls 1, and some of this boss design is atrociously unfun, 2/10 I regret buying it\nCommander Honglan might be the least fun boss I've ever had in a video game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Wuchang Fallen Frames. Grain graphics. Worst camera of all souls-like games which constantly moves by itself.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The good:\n\n- You have 5 solid classes to choose from. axe, longsword, 1 handed sword, dual sword, and spear. each gives you a different approach to the how you play your game.\n- The map structure is very reminiscent of DS1 and you get 5 chapters worth of it. \n\nThe bad:\n \n-Each boss can be beaten with one weapon however each boss does have a weapon that is \"more successful\" so it all comes down to how good you are at the game and how often you are willing to die to use your favorite weapon. \n- you cannot leave certain controls unbound. swift draw is a unique way to keep momentum going however, i find myself accidently pressing the left joystick too hard unconsciously. if you have the same habit, you might find yourself dying more times than once because you are locked into a skill animation because you pressed the button\n- i hope you have your handy dandy wiki to plan your route because its incredibly easy to mess up your run or just miss stuff.\n\nThe Ugly\n\n- some high tier weapons are blocked from access behind the deluxe edition pay wall.\n\nOverall, i don't hate the game but i often ask myself why i am still playing it. i just started chapter 5 but i dont think i will go beyond that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I don't know if I like this game.\r\nI live and breathe souls games as you can see by my profile and I was really hoping to like this one because it looked cool but... I dunno, I'm not enjoying it as much as I thought I would and that really fucking sucks.\r\nI don't know what it is specifically but to me, the gameplay just doesn't feel right. Like I keep getting the impression that I am slower with everything, moving, dodging, attacking, using my healing item, than enemies and bosses are. Dunno if that is really the case but that's what it feels like and I don't particular enjoy it.\r\nMaybe I got spoiled because I previously played and finished The First Berserker: Khazan before playing this but... yeah I can't really warm up to the gameplay of this one and that really fucking sucks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Mid or below average soulslike. The more you play the worse it gets. Level design followed by exploration are the only good parts. Game is quite flawed otherwise and does not play great. Quest design is atrocious like in many soulslikes. Get up and healing animations are slow af. Madness mechanic is dumb. Dying and loosing souls should be enough of a punishment. Lowering player toughness after dying is retared in a game where you want to learn bosses. Those major encounters are vastly unbalanced. Game has very weird difficulty spikes that are followed by very weird difficulty declines. Poise is non existent for the player and overabundant for enemies. Some of them, not even the big ones, does not react to player's attacks. Inputs feel unresponsive. Replaying bosses that have cutscenes is pita because it requires to hold a key for few seoncds each time to skip a cutscene. Maybe use a fucking button press instead of holding? Perfomance is trash as always with those UE5 titles even with 7800x3d and 4090. Stutter fiesta too. Spears are straight up useless and some other weapons and playstyles feel like being designed for specific encounters. I don't really like when the game is shoehorning me into one specific playstyle just to beat a boss because otherwise it's miserable experience. I don't know if it's true but some enemies seem to exhibit input reading behaviour. They just walk around until you press a button and then they react immidiately. It is especially visible when trying to heal on some bosses. Oh and enemy attacks are often on rails. They just dash-slide with attacks to the player and can do 180 turn in a split second. They have nearly 0 directional commitment with their atacks. The game was also censored after release which made its story much worse. i know that none plays soulslikes for the story but I think censorpship of artistic vision in any way should be pointed out. Games like Bloodborne, Elden Ring, Black Myth Wukong, Sekiro, DS 3 while not prefect either are still light years ahead of this game in terms of gameplay. It's my 2nd try at this game. I am quite stubborn so maybe I will still finish it but only because I paid for it and I literally don't have anything else to play right now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Oh wow, what a shame, deluxe edition players receive a few new skins. A bunch of wasted old culture skins, look so guilty, that i homeless would not wear that crap. Trash guys, thanks to devs, nice attention to your members...........",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "optimization is dog shit and game feels unplayable in certain areas",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "It is an OK game. A Black Myth Wukong wanabe. \r\nIt is fun to play and runs smooth but doesn't keep me engaged. \r\nAnd don't get me started on its Unmappable Keys.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I kind of like this game cause it scratches an itch but it's objectively one of the worst souls-likes I have ever played. I don't know how the devs failed so hard at the combat and movement but it is impressively bad. It's like you (the player) is playing dark souls 2 with a broken controller against enemies from Nioh 2 with input-read, phantom range and spammy instant-grab/instant-kill grabattacks with heat-seeking tracking. \n\nAbsolutely awful and unejoyable. Do better devs.\n\nEdit: Also, there are gottcha-momants (not the monetary kind but the \"haha I placed this enemy to push you down a hole\") every other enemy encounter. Also, there are many times in the game where damage is literally unavoidable which is BS in a game like this.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game is good but too many small bugs. Have to go to a shrine to have the bug reset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there are so many stuff in this game that is impossible to discover through normal means. You need a guide to figure everything out. I really hate this part about the game and I hate the developers for doing things like this. This makes the game extremely disappointing. Currently, I am going to take a break from this game. Here is a warning, if the story gives you a choice, DO NOT pick one until you read a guide.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring souls-like with a focus on being as annoying as possible",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "its not a good game, mechanics are frustrating and weird. i cant understand what is going on. it should have been easy. hot girl big sword cut monsters. why did you add all these stupid things????",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As diferentes áreas marcam os capítulos, o jogo não tem mapa, parece que eu tô dando volta num monte de mapa diferente, matando bicho e desbloqueando atalho. Por dezesseis horas. Não tem história praticamente nenhuma, umas migalhas por aí pior que dark souks e aquele esquema de ter que descobrir que está fazendo uma quest com um NPC pra desbloquear um final. Trava numas horas aleatórias, inclusive nas lutas de chefe. E só não é divertido mesmo. Não me pegou em nenhum momento.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 31 hours of playing this garbage I got locked out in storyline and optional bosses in chapter 3 where I am underleveled trying to fight bo sorcerer that kills me with 2 hits. The level design in act 3 is horrible and there is no way i am replaying this garbage .. Stay away 31 hours in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs fucked the entire plot of the game due to presure from offended chinese nationalists. Altering and censoring a videogame bought by more than a million people to appease the butthurt  is completely unacceptable.",
      "voted_up": false,
      "votes_helpful": 377
    },
    {
      "review": "Gameplay and story is good. What sucks is the censorship that affected the global entirely. They should've just censored only in China...",
      "voted_up": false,
      "votes_helpful": 257
    },
    {
      "review": "Despite its optimization issues (well, it is UE), this game has some really striking positives. The graphics and art direction are amazing, the level design is pleasantly labyrinthian in the spirit of Dark souls 1, full of interconnected paths and shortcuts. It's also a pretty long game, 40 hours in and I still have many bosses left to challenge. \n\nHowever, and this is coming from someone who finds dark souls and elden ring easy at this point, the bosses become brutally hard (from Honglan and on), to the point of being unfun. Most of their moves don't have any obvious punish windows like in most soulslike games and getting the chance to land a hit feels more RNG than skill based. The difficulty is very artificial in that sense, and overcoming a hard obstacle feels less rewarding and more of a relief, since you don't have to fight them again. \n\nSadly, I'm afraid I won't be able to finish this game, and it's a shame because I really like it. So I can't recommend this game to the average soulslike enthusiast, but if you're looking for an unfair challenge and like redoing the same battles over and over for several hours, this game is for you.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Before using external tools to fix this game, it was the single most un-optimised thing I have ever tried to play in 35 years of owning a PC. It was simply unplayable.\n\nAt the lowest of the low visual quality, with a 3080 GPU and a Ryzen 7 5800x CPU, combined with a blisteringly fast M.2 drive, the game stuttered so much that even the background audio crackled when I walked around. This was supposedly the best the devs could do to optimise the game alongside a notorious censorship patch which kowtowed the story to racist Chinese nationalists. \n\nI have never known a game to perform so badly that it could not provide proper audio. I have also never had a game perform so badly that I couldn't even leave the starting area. This game achieved both of these faults within 30 minutes, even after multiple restarts and setting changes.\n\nDo not reward the devs for grovelling to political pressure. \n\nDo not allow their failure to optimise to become the norm.\n\nUntil fixes are part of the norm, do not buy this game.\n\n\nEDIT: \n\nIt took about 8 hours of 'playtime' to get the game working. I now feel so incredibly sorry for the level designers and artists who worked on this, because they have made something stunningly beautiful which is being marred by terrible performance issues and publisher censorship. The game includes a number of obvious mechanics which should be adopted by many other titles and some which unfairly punish the player which other titles have rightly dropped. Combat is enjoyable and the Glutton boss was one of the most dance-like fights I've had in years.\n\nYet, to sour the experience of performance issues being resolved, I soon after met Commander Honglan. Her boss fight was the single worst soulslike battle I've ever fought. I cannot fathom what the devs were thinking when they added someone faster than Malenia and with more input reading than a Crucible Knight as boss 6 of 24 in a game that punishes the player for dying. \n\nThe studio announced that they are no longer working on the title. This likely means there will be no more bug fixes. As it is currently broken, I cannot in good faith recommend it, because like historical China, Lenzee made something great, but the Mao-esque changes made by those above destroyed the grandeur of what came before.",
      "voted_up": false,
      "votes_helpful": 71
    },
    {
      "review": "The game is fun, but we shouldn't support developers who make actual story changes to the game after people buy it. The story changes themselves are reason enough for potential new comers to not buy it too because it fundamentally alters the atmosphere of what should be a pretty gritty world.",
      "voted_up": false,
      "votes_helpful": 125
    },
    {
      "review": "Game ruined by chinese nationalists who would never touch it anyway. Any good recent reviews are fake chinese bots. Would've continued being a good game had they not done anything to it, but they must appease dear leader. \n\nAmerica is following a very similar path. Don't anger dear leader or your game will be forced to change.",
      "voted_up": false,
      "votes_helpful": 197
    },
    {
      "review": "Honestly, i really like the game and the vibe that comes with it but man this is just unoptimised garbage of a game, devs cant just keep getting away with this i have a solid rig for this game specs and still my game stutters and crashes a lot waste of money",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "please stop using ue5 until there are ways to properly optimize it.decided to wait to play the  game until the updates help improve performance. the recent update has made it impossible for me to change settings as soon as i try to go to the advanced settings it immediately crashes",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game I bought and beat on release is no longer the same game, due to censorship of the game after pressure from protestors and the Chinese government. Major bosses now just become \"exhausted\" and many NPCs become unkillable, and even help you in some levels. While the combat is fun and I appreciate the \"gooner\" aspects of the game (especially after playing as a monkey in Wukong) , I can't recommend this game since its been fundamentally changed since release.. the story doesn't even make sense anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's been patch 1.7 and still no boss replay/boss rush mode and loadout system. Always having to switch out armors, pendants and benedictions, based on how I feel like taking on selected bosses or areas gets pretty tiresome.\nIt would have been a thumb down after the story got censored but I postponded it and waited for upcoming updates. Because despite those issues, the story (before the censorship), level design and music are pretty solid; weapon variety is also a plus, many different weapons and skills that it really lets you play your own way and re-spec is free.\nHowever, the game failed through many updates. Feel like bosses become more stupid and difficulty got nerfed through every updates. Revert to patch 1.4 if you really want to play the game at its fullest.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I really love souls-like games ,best genre for me but this just ain't it . \nCore gameplay (typical soulslike)  is fun  and all but :\n\n▼ Map/Area design is awful ,made like a maze  for no real reason, nothing rewarding to discover . \n▼ BF/Shrines way too far away from bosses ,having you marathon just to prolong the total hours of the game.\n▼ Small variety of weapons ,giving you different playstyles for each weapon category yet only 1 is the main one to defeat most bosses (Longswords) .Same goes for armors ,most of them are not even worth looking into.\n▼ Bosses' areas are on purpose huge to make you dance around and chase them most of the time .   Some of them, once you're close, have 1 shot attacks \n▼ Poise is almost non existent ,you're the main character yet a weak average mob will tank your big-popo weapon  hit like a Chad and dodge or hit you back.\n▼ While consuming items ,your character can't move or open the menu while the frames are still going which is possible in Elden Ring which actually gives you more maneuverability and save time when consuming items.\n▼ They could have implemented a second item wheel by using a button shortcut like Elden Ring yet the didn't .\n▼ There is also this weird thing ,once you start running and you release at the same time the \"A\"(Running button) and \"Left stick\" she does a weird small step/leap forward locking you for 1~ sec and becoming vulnerable to attacks etc.\n▼ BF/Shrine is taking way too long to activate or sit to enter the dream ,once you get madness it will not allow you to use a lever or consume item until the logo or warning is completely gone. Little details are what make a game polished and refined ,giving you overall a better experience.\n▼ Optimization is horrendous ,you try to open steam overlay ,alt tab or move around fast ,you're gonna have a crash. \n▼ Devs didn't have to build their own graphics-engine ,didn't have to innovate a new style or gameplay mechanics ,they literally borrowed a somewhat ready formula from Souls Games / Wukong /Lies of P and yet didn't really  improve on it.\n\n** So in Summary ,you have a monotonous, linear ,chase and hit maze ,with poor Boss designs,,no fancy cinematics ,no memorable OSTs ,no gripping story but you get good graphics in the cost of performance and crashes just to fill  the gap for the next polished Souls-like game but ends up giving you Fatigue**",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The first three chapters were quite enjoyable, but in the endgame the boss fights are no longer fun. Bosses chain endless combos without real pauses. One little mistake can ruin a fight and the fights drag on endlessly. Even when you finally beat them, it doesn't feel like an accomplishment.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "TLDR: if you're looking for a casual soulslike and dont get annoyed easily, this game might be for you, otherwise I would save my money.\r\n\r\nDisclaimer: I did not pay attention to the story after a certain point because the yapping NPCs and the rest of the game elements got on my nerves, so the story is out of judgment.\r\n\r\nThe good:\r\n- you can hit enemies while they're downed\r\n- interesting concept on skilltree and weapon progression\r\n- some good boss concepts\r\n\r\nThe bad:\r\n- everything else\r\n\r\nThe level design is clearly inspired by the classic Dark Souls formula of looping back around to previous Shrines, but sadly fails to do so. All the areas feel like a massive maze; everything looks the same and around every other corner is a crossroads with no indication which path is progress, which is optional and which is the shortcut back to the previous shrine. This makes for frustrating exploring and is my biggest gripe with this game. Random enemies are very hit or miss; either they are absolute fodder which dies in 2 hits or they are stronger than even some of the main bosses. A more balanced approch or just more variety would have been welcome.\r\n\r\nOn the topic of shrines, there is no reason for them to be this scarce. The amount during exploring in general is fine, but why not put one in front of the boss rooms? The runbacks to the bosses are mostly just taking another ladder or excruciatingly slow elevator with no enemies on the run. Actually trying to learn a bossfight is made very tedious by this.\r\n\r\nThe bosses themselves are very mixed. Most of them have cool concepts and design, but the fights themselves are very boring and annoying. Almost all of the bosses have moves/phases where all they do is run away, which completely invalidates the existence of the poise meter. Working it up to a stagger only to have the boss teleport away and be out of reach for 20 seconds is extremely frustrating.\r\nStill, the fast paced and long attack chains of some bosses are pretty fun, even if most of them felt too easy.\r\n\r\nThe benedictions are a nice idea, as is the tempering, but the amount of tempering upgrades you find is so small, and the variety in benedictions so low, that I never felt the need or want to try anything new once I had a decent setup. Similarly the entirety of the madness mechancis just feels unnecessary. With no real risk of dying except for during boss fights and the madness demon being kind of a pushover there  is just no reason to pay attention to the mechanic at all.\r\n\r\nSome more random stuff that is just unnecessary and annoying:\r\n- the elevators are PAINFULLY slow\r\n- the amount of weapons you find is very disappointing\r\n- the UI is too small/visually obscure at a glance\r\n- there are a million consumables, of which you can only carry 4 at a time or only get one of during the entire playthrough\r\n- the bamboo shoots and the panda are just weird\r\n\r\nThe game had a lot of potential, but too many systems and too ambitious level design got the better of it.\r\n\r\nRegarding patch 1.5:\r\nAs I said I didnt really pay attention to the story so the randomly not dying generals were just confusing to me, nothing more, but the fact that during startup the disclaimer says \"this is a work of fiction\" and then the devs get censored is just sad.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game runs horribly and its recommended specs are simply a lie. Even with a computer well above its recommended settings the game runs with endless stutters. \n\nWould have liked to play it, but sadly there's no other option than a refund. Get your performance right on launch.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1]Good Ideas Only Get You So Far[/h1]\n\nA lot of the chatter surrounding Wuchang has been about how familiar it feels, how it's something you've played before, something you already know whether you'll like or not, and, honestly, I find it all to be a bit disingenuous. Sure, it's unmistakably a soulslike and most of what that entails, but between its combat built around an idea wholly its own and its relatively bygone world structure, Wuchang's intentions might as well be the only thing going for it, and, well... they sort of are. Ultimately, novel design is only really as good as its execution, and developer Leenzee's debut title unfortunately comes up short almost everywhere you look.\n\n[quote]For the full, uncut version of this review, please consider[url=https://summitreviews.biz/article/40/wuchang-fallen-feathers-review] checking it out on the Summit Reviews website.[/url][/quote]\n\nIts narrative is the obvious place to start: you play as Wuchang, an amnesiac young warrior, as she grapples with her contraction of the Feathering, a maddening sickness indiscriminately warping its hosts into feral monstrosities—everyone but her, that is. It's an enticing opening, but just as you begin to expect an intriguing mystery that subtly hints its hand in careful visual cues and drip feeds satisfying revelations in its questlines, it so quickly devolves into an utterly rudderless mess of vague motivation, endless dialogue clarifying nothing, and, as of patch 1.5, a hoard of incongruent story alterations.\n\nIt's the structure and delivery of it all, more than anything else; there are just so many characters with so many names with so many quests that need so many items between steps that take place hours apart and they just never stop talking, each spewing out ten more names and local goings on except they all build off everyone else's exposition which works until you pick one wrong dialogue choice or take one false step without talking to a character back in some place you were at five hours ago then they just disappear forever and... are you getting all this? No? Me neither.\n\nIt's impenetrable even by soulslike standards, primarily because it neglects the genre's most potent narrative tool, substituting any meaningful attempts at environmental storytelling with yet more word vomit. There's [i]something[/i] in the almost comically archetypal military encampments literally everywhere and the trite, insipidly traditional East Asian design permeating just about everything else, but a good chunk of these places seem quite aware of their superficiality, filling the streets with bereaved citizens crying over monsters or rebels or whatever else behind closed doors, leaving the gory details to wooden voice performances and subtitles.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3590018684\n\nVisual and mechanical design are two very different things, however, and, at the very least, Wuchang's world excels in the latter. Each of the four major regions are relatively isolated, but deeply connected within, flaunting ridiculously intricate, vertical spaces, more little secret side paths than you can shake a stick at, and huge areas effortlessly supported by just a single place to rest and a million one-way doors. In light of the genre more recently defaulting to a relatively linear main path supplemented by a handful of item-laden dead ends, it's a rarity to see world structure this complex, and those wonderful, crystallising moments as fragmented mental mapping suddenly falls into place are as technically impressive as they are incredibly gratifying.\n\nThere's such a thing as too much intricacy, though, and while none of these locations are ever all that confusing, they tend to feel a little manufactured. A midgame area has you climbing a series of pagoda-like structures with bizarre scaffolding and ramps between them that defy all practical sense. A later area has this impossible floating lift conveniently taking you back down to an initial resting place for seemingly no other reason than the geometry just happening to line up. And, outside of specific instances, so many ladders can be found in places no respectable human would ever defile with such a thing, and these little knee-high walls dotted around are often the only thing preventing you from skipping entire areas.\n\nIt's all just exposed seams and stitching, but it feels noticeably too authored, and that's all it really takes to transform an immersive, authentic world into a series of functional levels optimised within an inch of their life, even if those levels are otherwise pretty damn good.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3590018610\n\nOn the combat side, Wuchang's approach to it is fantastic. It's essentially soulslike law at this point that an attack launched after a dodge simply must be considerably weaker than anything else in your arsenal, god forbid there's any form of convenience in a genre so infamously punishing; however, Wuchang turns that entirely on its head, instead reserving some of your biggest numbers for that forbidden marriage of offence and defence. Furthermore, dodging right before an enemy attack connects grants a stack of Skyborn Might, which can then be consumed by everything from a huge range of powerful spells to the two active skills tied to any given weapon. It's fast, fluid, and, with parries still dominating the genre as though Sekiro released yesterday, placing the dodge so front and centre is really nice to see.\n\nOr at least it should've been. In practice, each battle is defined by nothing ever feeling quite right: attacks with awkwardly long startups, animations feeling either too snappy or too sluggish, strikes not tracking properly, blows both hitting and missing when they shouldn't, and the list goes on. It's all in the game feel—little calibrations you don't pick up on until the controller's in your hands, culminating in this overwhelmingly clunky experience that's ultimately entirely antithetical to the intent. There's always some attack in your weapon's combo that grinds your momentum to a halt, and enemies are relentless, turning what should be an elegant dance into this vapid call and response, demanding nothing more than your big, flashy weapon skills over and over whenever your turn arises.\n\nAnd to that end, Wuchang is painfully easy, in a way that feels quite exploitative, as well. The first nodes in each of the five weapon types' skill trees offer alternate, more efficient, and far more reliable methods of generating Skyborn Might, immediately and completely negating the whole emphasis on perfect dodges, and the moves you get to use with it are so formidable they negate almost everything else.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3590018574\n\nA combination of two active skills on an early-game spear is more than capable of [i]infinitely stunlocking[/i] about half of the humanoid bosses, and just a single one of your axe skills deals massive amounts of damage and stagger, grants an ungodly amount of lifesteal, and then weaves into a basic attack that restores all the stamina and Skyborn Might you just used, culminating in this hilarious feedback loop of immortality against anything that isn't at least three times your size. Simply put, if your build makes even a modicum of sense, it's almost certainly borderline game-breaking in one way or another.\n\n[h3]Final Thoughts[/h3]\n\nDespite a lot of expectations, Wuchang: Fallen Feathers isn't just another soulslike. It iterates on things the genre should have never left behind, and its innovations are actually new and refreshing in a space widely known for how derivative it can be (it's in the name!); yet, with From Software's crown looking ever more untenable, you have to make good on your pitch. Wuchang's level design may be up to par, but between its clunky combat and nebulous, practically incomprehensible storytelling, I struggle to find anything else worth recommending.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This game is fun, but doesn't do anything original. The performance is still pretty horrible as of writing this review as well. \nThere is a lot of Dark Souls looping back around through locked doors, but I'd argue there's too much, to the point where feels stale and not earned. There's a lot of bad level design as well, (example, an area where there are rolling boulders, one boulder roles into a dead end that has lot in it, but another roles to a dead end that just kills you if you step into it.) The bosses don't feel properly balanced to me either. I've played a lot of Souls games and the toughest bosses in those games feel fair. The bosses in this game aren't insanely hard, rather, they're just annoying. Crazy overpowered attacks make them feel artificially hard rather than earning their difficulty. \n\nIt's not a bad per say, just a lot of small issues spoiled the experience for me.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Oh this game was good, Dark Souls 1 vibes all over.\nThen they censored the game and fucked up the lore and make late game areas filled with allies and much much easier\nIf you're gonna buy this, revert to version 1.4 with mods",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Imagine you are fighting a big boss in Elden Ring - just pick one you really liked, doesn't really matter who. Now imagine you manage to bring down the boss to 0 health and instead of a cutscene playing or the boss collapsing and desintegrating in a big explosion, the boss just becomes immune, stands there huffing and puffing and blabbering something about being tired. \n\"Good job, you bested me. You can pass.\" he says or something like that.\n\nThat's what this game has become. It's one of many changes the developers have forced onto the game since its initial release. A lot of the changes are pretty good and reasonable, mind you. It's not all bad. But this one, this single one - a change the developers themselves refuse to address or discuss - has in my opinion completely destroyed this game. Or at least massively hurt the developers' credibility as artists and the crediblitiy of their work overall.\n\nIf you can ignore this censorship - because that's what it is (I won't go into details here, you can look it up for yourself, on the Steam forums or elsewhere) - then you get to play a decent Soulslike with decent combat and decent bosses. It's all just decent. \nThe story is a s-h-i-t-s-h-o-w, though, because of the aforementioned censorship. It simply doesn't make any sense anymore and it completely destroys any sense of immersion you might have had when starting the game.\n\nThe game could have been more than decent. It could have been absolutely great, actually. Maybe not on par with something like Lies of P or the other FromSoftware games, but pretty damn close. As of now, it's just decent, at best, and a massive disappointment, otherwise. The developers themselves have ruined this game and - argueably, even worse - have refused to acknowledge it. They pretend these specific changes simply never happened. Frankly, I find their behaviour simply disgusting and disrespectful; but that's just me, other people's opinion might vary.\n\nWhat's left to do, now? \nWhat have I learned?\nThat Chinese games are not worth the risk? \nNo.\nBut next time I see a Chinese game telling a fantasy story with slight nudges towards Chinese history (like the Nioh games with Japanese history, for example; weirdly enough the Japanese have no issues with these kind of stories) ... I will be holding off on purchasing it, regardless how good it looks.\nWhy?\nBecause it looks like some lunatics in China (and I want to stress: it's only a couple of bad apples) seem to have more influence than actual paying customers. That's why.\n\nPurchase this game on the biggest discount possible - or just stay far away and put the money towards projects and - most importantly - developers that do respect you AND their own work. These ones - Leenzee - unfortunately don't seem to care that much; instead they are hiding behind disingenous words of gratitude and are trying to appease someone that never wished them success to begin with. \nShould have put all that energy into things that actually matter: like more weapons, more creative outfits (because the ones they added are bland AF) and polishing up combat and some bosses' hitboxes. \nBut, alas, we are left with partially decent and partially terrible, instead. What. A. Letdown.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Is not hard game per se, but has a bunch of mechanics that make it frustrating to play, for example there are rocks that kill if stay close for a couple of seconds, if you are using the wrong equipment. The problem is, when you try to destroy them and there is a enemy nearby, the auto-aim(which you can't turn off) makes you hit the enemy instead, forcing you to linger near the rock and often killing you\n\nAnother issue are the weapons, the lance for example when you dodge and then use the heavy attack it often miss the enemy the first few attacks and often you end up punished because of of that, on top of that some enemies use input reading which forces you to abandon certain move altogether, otherwise you end up punished,\n\nI don't recommend this game, go play other from souls-like you will have more fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unbalanced. \n\nI want to give this a thumbs down, but it does do a lot right.  However, the bosses in this game are poorly designed. You can mow through regular enemies then hit block walls with bosses. When you read the majority of people have to respec their build on multiple bosses to then afterwards beat easily, the design is broken. Also, do not believe the people who say the deaths never felt unfair. Bosses don't even remotely play by the same rules as you. They will teleport, lunge across the arena, fly around, etc and with unlimited stamina.  \n\nOn the positives, the combat is what you want from a Souls like. The weapon mechanics are varied enough and the environments are gorgeous. Also nice is the enemy variety.\n\nEDIT: Changing this one to a thumbs down due to getting further along and witnessing the over-the-top boss designs mentioned above. Them continuously jumping all over the place is nauseating. I'm a Souls veteran, having beat every Souls boss, even optional ones, without any help. Wuchang bosses suck and there's no sense of satisfaction, just frustration mechanics added.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The good:\n\n- You have 5 solid classes to choose from. axe, longsword, 1 handed sword, dual sword, and spear. each gives you a different approach to the how you play your game.\n- The map structure is very reminiscent of DS1 and you get 5 chapters worth of it. \n\nThe bad:\n \n-Each boss can be beaten with one weapon however each boss does have a weapon that is \"more successful\" so it all comes down to how good you are at the game and how often you are willing to die to use your favorite weapon. \n- you cannot leave certain controls unbound. swift draw is a unique way to keep momentum going however, i find myself accidently pressing the left joystick too hard unconsciously. if you have the same habit, you might find yourself dying more times than once because you are locked into a skill animation because you pressed the button\n- i hope you have your handy dandy wiki to plan your route because its incredibly easy to mess up your run or just miss stuff.\n\nThe Ugly\n\n- some high tier weapons are blocked from access behind the deluxe edition pay wall.\n\nOverall, i don't hate the game but i often ask myself why i am still playing it. i just started chapter 5 but i dont think i will go beyond that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mid or below average soulslike. The more you play the worse it gets. Level design followed by exploration are the only good parts. Game is quite flawed otherwise and does not play great. Quest design is atrocious like in many soulslikes. Get up and healing animations are slow af. Madness mechanic is dumb. Dying and loosing souls should be enough of a punishment. Lowering player toughness after dying is retared in a game where you want to learn bosses. Those major encounters are vastly unbalanced. Game has very weird difficulty spikes that are followed by very weird difficulty declines. Poise is non existent for the player and overabundant for enemies. Some of them, not even the big ones, does not react to player's attacks. Inputs feel unresponsive. Replaying bosses that have cutscenes is pita because it requires to hold a key for few seoncds each time to skip a cutscene. Maybe use a fucking button press instead of holding? Perfomance is trash as always with those UE5 titles even with 7800x3d and 4090. Stutter fiesta too. Spears are straight up useless and some other weapons and playstyles feel like being designed for specific encounters. I don't really like when the game is shoehorning me into one specific playstyle just to beat a boss because otherwise it's miserable experience. I don't know if it's true but some enemies seem to exhibit input reading behaviour. They just walk around until you press a button and then they react immidiately. It is especially visible when trying to heal on some bosses. Oh and enemy attacks are often on rails. They just dash-slide with attacks to the player and can do 180 turn in a split second. They have nearly 0 directional commitment with their atacks. The game was also censored after release which made its story much worse. i know that none plays soulslikes for the story but I think censorpship of artistic vision in any way should be pointed out. Games like Bloodborne, Elden Ring, Black Myth Wukong, Sekiro, DS 3 while not prefect either are still light years ahead of this game in terms of gameplay. It's my 2nd try at this game. I am quite stubborn so maybe I will still finish it but only because I paid for it and I literally don't have anything else to play right now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was an amazing game but they censored it so now the story doesn't make any sense and all the actions of characters feel incoherent and pointless.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Unfortunately, I cannot recommend this game, much as I wish I could. As someone who lives and breathes Souls titles, I was genuinely eager to play it. However, the performance is absolutely dreadful. Ignore anyone claiming it runs fine - it simply doesn’t. \n\nIt’s the same crowd who insist Red Dead Redemption 2 runs flawlessly on their PlayStation 4, likely because they own some mysterious model no one else seems to have. Or those who claim that 30 FPS is perfectly acceptable because the human eye supposedly can’t perceive anything beyond that.\n\nI’m running a 9800X3D and a 5080, and while the FPS at 4K was decent, the frame times were appalling. I ran a frame time graph using RTSS, and it was one of the worst I’ve ever seen, it resembled an ECG.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Found the controls frustratingly sluggish for a game that's supposed to be about fast, responsive, combat. \r\n\r\nCouldn't beat Honglan after ~40 tries over a full week and quit. Guess I'm supposed to re-spec my build until something finally works? Or resort to cheesing her? No thanks. \r\n\r\nThe only other bosses that felt this terrible to face were Demon of Hatred and Promised Consort Radahn. Seriously, Malenia without Summons was a more balanced and rewarding experience than this early/mid-game \"skill spike\" bs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I might give it a further try later, but I was filtered not by the game's difficulty but by the overly nonsensical maze-like level design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So, I've played the game for 50+ hours, but finally decided to crash out on the White-Haired Elder boss fight.\r\n\r\nI'm a veteran of all the DS games, Sekiro, Elden Ring, and enjoyed Lies of P, AI limit, and a bunch of other similar games.\r\n\r\nVisually, this game is stunning, and it has some neat innovations and ideas which I'm sure other games will pick up in future.\r\n\r\nHowever, the game itself is a total mess. Recent patches have made things worse, and unless you enjoy windowing out every five minutes to check a guide, you will likely get lost, fail quests, and have no idea how to beat ridiculously over-tuned bosses.\r\n\r\nIn short, the game just isn't much fun. It's a massive grind that doesn't respect your time, and unfortunately instead of taking the effort to properly design bosses and fights, the developers appear to have taken the lazy route of apparently removing things like poise, stamina, and weaknesses (late game) in favour of having the player do massive runs to a boss and then get RNG'd to death.\r\n\r\nThere are too many gimmicks, and not enough skill involved. I don't mind a hard fight if it's fair, but having unsummonable summons, unparryable or dodgable attacks, and a very brittle plot structure (one curious explore to the side and you've sunk your entire playthrough), means it's no wonder that all the community feedback and forums are so negative.\r\n\r\nDon't believe the hype, and don't believe the positive reviews. This ain't worth your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My heart is with the graphics and sounddesigners who did a great job just for game designers to put up the same old slob with input reading and animation cancel. Im so tired of it, i was willing to give this game a shot since i never care about soulslike stories anyway cause theyre trash or some \"deep\" shit but my god, the rest of the game doesnt pull through. The respawnshrines are placed in the weirdest possible ways and the game is either gardenhose linear or an entire city without a respawnpoint. Bosses are COMPLETE pushovers except a few that feel like they would be amazing if it wasnt for the shameless input reading. Commander something boss in the epic arena glitched herself to death cause she animation canceled out of bounds. Shame, next.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wuchang Fallen Frames. Grain graphics. Worst camera of all souls-like games which constantly moves by itself.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They had a pretty good chance to be a nice game people would remember positively, but they failed in the end.\r\n\r\nPositives: excellent optimization and graphics, nice visuals here and there, a pretty okay builds system that allows you to change your playstyle (in reality adapting to the required by current boss build set). BTW, still here they followed this recent trend of naming things unique ways. Meaning when you try to understand what this or that skill does, you will literally read encyclopedia of their unique terms for usual words like \"invincibility window\" or other usual ones, before you learn them and start to understand better what they mean. Sometimes my eyes were bleeding of these terms, like you were translating some new language, you know.\r\nI think this is where the positives end.\r\n\r\nThe game suffers from pretty childish issues that start instantly when you open the game. Controls - who hasn't mentioned them yet? Assigning a run button to the A button on Xbox controller is something I have not seen in any game. It looks like developers never played a game on a gamepad and don't understand that you still need you right stick to look around while running and you can't do that holding the A. Much later they introduced re-assigning the buttons which I used but it was also done in a very lame way so that when I swapped A with another button (weapon special in my case) - the button approving dialogues/interacting or picking up things still remained A. And it means every time you slightly missed the item or held the skip cinematic for too long you will trigger a long animation of a strike or whatever you reassigned it with. I'm not sure if any of them devs played it after they made the changes.\r\nThe \"madness descends\" notification  that you for some reason see every time blocks any interaction and adds around 5 seconds of waiting before you can re-try the boss.\r\nThey show you cinematic before the boss every time, so you could skip it. I thought it was 2025.\r\n\r\nThe general difficulty of the game did not seem too high for me, I beat most of the bosses (except some of the first ones) without assistance. Still fights are somehow staged. You really need to dance up to the devs plan and dodge-dodge-dodge-dodge-dodge then maybe you can hit. Those who say this game can be treated as a non-parry one lie, there is no practical difference, just a different move. Yep, some magics really make it easier, but you still need to dodge all the way through. This lack of variety in the battle approach is kind of lacking.\r\nThey were also crazy about the labyrinths and forks in the roads and decided to do almost each level like this which at times was very annoying, but this is still manageable in the end.\r\n\r\nAnd the last but not the least thing. They say a lot that this game is so punishing etc. I don't think it is so much of a punishing game, all is pretty much standard, though it seems the devs did not have enough creativity of how to make it hard so there's so many sudden \"you died\" moments including the stupid uninterruptable moves of some bosses. In my opinion they simply elongated the game in this way, but was it so hard? I don't think so. But what will actually punish you or I'd say it correctly frustrate you is the stupidity of the story line. YOU HAVE TO progress in the game according to the devs plan and if you step aside a little (and they well allow you to do that) - you will ruin the questline and will not get a proper ending. And it is so easy to do so, just read the internets! Quests never been a strong side of the souls games, but none of the one I played had this for the major questlnes, side ones - yes, but not the main ones. They literally give you the opportunity to kill bosses in a WRONG ORDER (WHAT?) and bang you've missed it. I've read some comments from china players like \"hey, that's clear as a day in the dialogues\" - well no, it is not and thousands of complaining players are the proof to that. You did not adapt your dialogues for the international market and play the game in chinese language and know the legends etc. For the rest of the world most of the dialogue lines are meaningless and don't add up. This is a  total game design flaw and it seems that people creating this thought that later after the first fail you will want to replay in a correct order on an NG+. No way, people, I'll not open this game again after such approaches and issues described before. \r\nYou still have a ton to learn from Japanese developers unfortunately, though you have already gone a long way, I admit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fatal error, cant even launch the game. Refund Pending",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "A decent souls-like game but the design of the last level forced me to give up and I didn't finish the game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the level design is amazing but that doesn't carry it over the awful gameplay. Its a soulslike thats just slower and clunkier than dark souls 1, and some of this boss design is atrociously unfun, 2/10 I regret buying it\nCommander Honglan might be the least fun boss I've ever had in a video game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I don't know if I like this game.\r\nI live and breathe souls games as you can see by my profile and I was really hoping to like this one because it looked cool but... I dunno, I'm not enjoying it as much as I thought I would and that really fucking sucks.\r\nI don't know what it is specifically but to me, the gameplay just doesn't feel right. Like I keep getting the impression that I am slower with everything, moving, dodging, attacking, using my healing item, than enemies and bosses are. Dunno if that is really the case but that's what it feels like and I don't particular enjoy it.\r\nMaybe I got spoiled because I previously played and finished The First Berserker: Khazan before playing this but... yeah I can't really warm up to the gameplay of this one and that really fucking sucks.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Oh wow, what a shame, deluxe edition players receive a few new skins. A bunch of wasted old culture skins, look so guilty, that i homeless would not wear that crap. Trash guys, thanks to devs, nice attention to your members...........",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I'm fed up with this game. Healing takes forever and the combat doesn't feel fair. I don't feel that each death teaches me something and makes me better for the next attempt. I'm almost at the end and wondering why am I still playing this luck heavy game.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "optimization is dog shit and game feels unplayable in certain areas",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Bad game and bad optimization. Refunded",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It is an OK game. A Black Myth Wukong wanabe. \r\nIt is fun to play and runs smooth but doesn't keep me engaged. \r\nAnd don't get me started on its Unmappable Keys.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "game is good but too many small bugs. Have to go to a shrine to have the bug reset.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "there are so many stuff in this game that is impossible to discover through normal means. You need a guide to figure everything out. I really hate this part about the game and I hate the developers for doing things like this. This makes the game extremely disappointing. Currently, I am going to take a break from this game. Here is a warning, if the story gives you a choice, DO NOT pick one until you read a guide.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "boring souls-like with a focus on being as annoying as possible",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "This game has by far one of the worst combat gameplay I have ever experience in a game. Slow, sluggish, unappealing visually, innefective, unsatisfying combat systems there is out there. All weapon types are terible, Not useful, or satisfying to use or even good to use, NO, all of them are just bad, plain bad.\n\nEverything and everyone in the game moves faster than you, as if being a part of a completly different game, all together, all stats are useless, no matter how much vitality you have or the defense you have, you get 1 or 2 shot, doesnt matter what you wear.\nThis game is 100% a rage simulator.\n1/10",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "its not a good game, mechanics are frustrating and weird. i cant understand what is going on. it should have been easy. hot girl big sword cut monsters. why did you add all these stupid things????",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "As diferentes áreas marcam os capítulos, o jogo não tem mapa, parece que eu tô dando volta num monte de mapa diferente, matando bicho e desbloqueando atalho. Por dezesseis horas. Não tem história praticamente nenhuma, umas migalhas por aí pior que dark souks e aquele esquema de ter que descobrir que está fazendo uma quest com um NPC pra desbloquear um final. Trava numas horas aleatórias, inclusive nas lutas de chefe. E só não é divertido mesmo. Não me pegou em nenhum momento.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "After 31 hours of playing this garbage I got locked out in storyline and optional bosses in chapter 3 where I am underleveled trying to fight bo sorcerer that kills me with 2 hits. The level design in act 3 is horrible and there is no way i am replaying this garbage .. Stay away 31 hours in",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Not it",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Devs fucked the entire plot of the game due to presure from offended chinese nationalists. Altering and censoring a videogame bought by more than a million people to appease the butthurt  is completely unacceptable.",
      "voted_up": false,
      "votes_helpful": 377
    },
    {
      "review": "Gameplay and story is good. What sucks is the censorship that affected the global entirely. They should've just censored only in China...",
      "voted_up": false,
      "votes_helpful": 257
    },
    {
      "review": "Despite its optimization issues (well, it is UE), this game has some really striking positives. The graphics and art direction are amazing, the level design is pleasantly labyrinthian in the spirit of Dark souls 1, full of interconnected paths and shortcuts. It's also a pretty long game, 40 hours in and I still have many bosses left to challenge. \n\nHowever, and this is coming from someone who finds dark souls and elden ring easy at this point, the bosses become brutally hard (from Honglan and on), to the point of being unfun. Most of their moves don't have any obvious punish windows like in most soulslike games and getting the chance to land a hit feels more RNG than skill based. The difficulty is very artificial in that sense, and overcoming a hard obstacle feels less rewarding and more of a relief, since you don't have to fight them again. \n\nSadly, I'm afraid I won't be able to finish this game, and it's a shame because I really like it. So I can't recommend this game to the average soulslike enthusiast, but if you're looking for an unfair challenge and like redoing the same battles over and over for several hours, this game is for you.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "Before using external tools to fix this game, it was the single most un-optimised thing I have ever tried to play in 35 years of owning a PC. It was simply unplayable.\n\nAt the lowest of the low visual quality, with a 3080 GPU and a Ryzen 7 5800x CPU, combined with a blisteringly fast M.2 drive, the game stuttered so much that even the background audio crackled when I walked around. This was supposedly the best the devs could do to optimise the game alongside a notorious censorship patch which kowtowed the story to racist Chinese nationalists. \n\nI have never known a game to perform so badly that it could not provide proper audio. I have also never had a game perform so badly that I couldn't even leave the starting area. This game achieved both of these faults within 30 minutes, even after multiple restarts and setting changes.\n\nDo not reward the devs for grovelling to political pressure. \n\nDo not allow their failure to optimise to become the norm.\n\nUntil fixes are part of the norm, do not buy this game.\n\n\nEDIT: \n\nIt took about 8 hours of 'playtime' to get the game working. I now feel so incredibly sorry for the level designers and artists who worked on this, because they have made something stunningly beautiful which is being marred by terrible performance issues and publisher censorship. The game includes a number of obvious mechanics which should be adopted by many other titles and some which unfairly punish the player which other titles have rightly dropped. Combat is enjoyable and the Glutton boss was one of the most dance-like fights I've had in years.\n\nYet, to sour the experience of performance issues being resolved, I soon after met Commander Honglan. Her boss fight was the single worst soulslike battle I've ever fought. I cannot fathom what the devs were thinking when they added someone faster than Malenia and with more input reading than a Crucible Knight as boss 6 of 24 in a game that punishes the player for dying. \n\nThe studio announced that they are no longer working on the title. This likely means there will be no more bug fixes. As it is currently broken, I cannot in good faith recommend it, because like historical China, Lenzee made something great, but the Mao-esque changes made by those above destroyed the grandeur of what came before.",
      "voted_up": false,
      "votes_helpful": 71
    },
    {
      "review": "The game is fun, but we shouldn't support developers who make actual story changes to the game after people buy it. The story changes themselves are reason enough for potential new comers to not buy it too because it fundamentally alters the atmosphere of what should be a pretty gritty world.",
      "voted_up": false,
      "votes_helpful": 125
    },
    {
      "review": "Game ruined by chinese nationalists who would never touch it anyway. Any good recent reviews are fake chinese bots. Would've continued being a good game had they not done anything to it, but they must appease dear leader. \n\nAmerica is following a very similar path. Don't anger dear leader or your game will be forced to change.",
      "voted_up": false,
      "votes_helpful": 197
    },
    {
      "review": "Honestly, i really like the game and the vibe that comes with it but man this is just unoptimised garbage of a game, devs cant just keep getting away with this i have a solid rig for this game specs and still my game stutters and crashes a lot waste of money",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "please stop using ue5 until there are ways to properly optimize it.decided to wait to play the  game until the updates help improve performance. the recent update has made it impossible for me to change settings as soon as i try to go to the advanced settings it immediately crashes",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "The game I bought and beat on release is no longer the same game, due to censorship of the game after pressure from protestors and the Chinese government. Major bosses now just become \"exhausted\" and many NPCs become unkillable, and even help you in some levels. While the combat is fun and I appreciate the \"gooner\" aspects of the game (especially after playing as a monkey in Wukong) , I can't recommend this game since its been fundamentally changed since release.. the story doesn't even make sense anymore.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "It's been patch 1.7 and still no boss replay/boss rush mode and loadout system. Always having to switch out armors, pendants and benedictions, based on how I feel like taking on selected bosses or areas gets pretty tiresome.\nIt would have been a thumb down after the story got censored but I postponded it and waited for upcoming updates. Because despite those issues, the story (before the censorship), level design and music are pretty solid; weapon variety is also a plus, many different weapons and skills that it really lets you play your own way and re-spec is free.\nHowever, the game failed through many updates. Feel like bosses become more stupid and difficulty got nerfed through every updates. Revert to patch 1.4 if you really want to play the game at its fullest.",
      "voted_up": false,
      "votes_helpful": 19
    },
    {
      "review": "I really love souls-like games ,best genre for me but this just ain't it . \nCore gameplay (typical soulslike)  is fun  and all but :\n\n▼ Map/Area design is awful ,made like a maze  for no real reason, nothing rewarding to discover . \n▼ BF/Shrines way too far away from bosses ,having you marathon just to prolong the total hours of the game.\n▼ Small variety of weapons ,giving you different playstyles for each weapon category yet only 1 is the main one to defeat most bosses (Longswords) .Same goes for armors ,most of them are not even worth looking into.\n▼ Bosses' areas are on purpose huge to make you dance around and chase them most of the time .   Some of them, once you're close, have 1 shot attacks \n▼ Poise is almost non existent ,you're the main character yet a weak average mob will tank your big-popo weapon  hit like a Chad and dodge or hit you back.\n▼ While consuming items ,your character can't move or open the menu while the frames are still going which is possible in Elden Ring which actually gives you more maneuverability and save time when consuming items.\n▼ They could have implemented a second item wheel by using a button shortcut like Elden Ring yet the didn't .\n▼ There is also this weird thing ,once you start running and you release at the same time the \"A\"(Running button) and \"Left stick\" she does a weird small step/leap forward locking you for 1~ sec and becoming vulnerable to attacks etc.\n▼ BF/Shrine is taking way too long to activate or sit to enter the dream ,once you get madness it will not allow you to use a lever or consume item until the logo or warning is completely gone. Little details are what make a game polished and refined ,giving you overall a better experience.\n▼ Optimization is horrendous ,you try to open steam overlay ,alt tab or move around fast ,you're gonna have a crash. \n▼ Devs didn't have to build their own graphics-engine ,didn't have to innovate a new style or gameplay mechanics ,they literally borrowed a somewhat ready formula from Souls Games / Wukong /Lies of P and yet didn't really  improve on it.\n\n** So in Summary ,you have a monotonous, linear ,chase and hit maze ,with poor Boss designs,,no fancy cinematics ,no memorable OSTs ,no gripping story but you get good graphics in the cost of performance and crashes just to fill  the gap for the next polished Souls-like game but ends up giving you Fatigue**",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "The first three chapters were quite enjoyable, but in the endgame the boss fights are no longer fun. Bosses chain endless combos without real pauses. One little mistake can ruin a fight and the fights drag on endlessly. Even when you finally beat them, it doesn't feel like an accomplishment.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "TLDR: if you're looking for a casual soulslike and dont get annoyed easily, this game might be for you, otherwise I would save my money.\r\n\r\nDisclaimer: I did not pay attention to the story after a certain point because the yapping NPCs and the rest of the game elements got on my nerves, so the story is out of judgment.\r\n\r\nThe good:\r\n- you can hit enemies while they're downed\r\n- interesting concept on skilltree and weapon progression\r\n- some good boss concepts\r\n\r\nThe bad:\r\n- everything else\r\n\r\nThe level design is clearly inspired by the classic Dark Souls formula of looping back around to previous Shrines, but sadly fails to do so. All the areas feel like a massive maze; everything looks the same and around every other corner is a crossroads with no indication which path is progress, which is optional and which is the shortcut back to the previous shrine. This makes for frustrating exploring and is my biggest gripe with this game. Random enemies are very hit or miss; either they are absolute fodder which dies in 2 hits or they are stronger than even some of the main bosses. A more balanced approch or just more variety would have been welcome.\r\n\r\nOn the topic of shrines, there is no reason for them to be this scarce. The amount during exploring in general is fine, but why not put one in front of the boss rooms? The runbacks to the bosses are mostly just taking another ladder or excruciatingly slow elevator with no enemies on the run. Actually trying to learn a bossfight is made very tedious by this.\r\n\r\nThe bosses themselves are very mixed. Most of them have cool concepts and design, but the fights themselves are very boring and annoying. Almost all of the bosses have moves/phases where all they do is run away, which completely invalidates the existence of the poise meter. Working it up to a stagger only to have the boss teleport away and be out of reach for 20 seconds is extremely frustrating.\r\nStill, the fast paced and long attack chains of some bosses are pretty fun, even if most of them felt too easy.\r\n\r\nThe benedictions are a nice idea, as is the tempering, but the amount of tempering upgrades you find is so small, and the variety in benedictions so low, that I never felt the need or want to try anything new once I had a decent setup. Similarly the entirety of the madness mechancis just feels unnecessary. With no real risk of dying except for during boss fights and the madness demon being kind of a pushover there  is just no reason to pay attention to the mechanic at all.\r\n\r\nSome more random stuff that is just unnecessary and annoying:\r\n- the elevators are PAINFULLY slow\r\n- the amount of weapons you find is very disappointing\r\n- the UI is too small/visually obscure at a glance\r\n- there are a million consumables, of which you can only carry 4 at a time or only get one of during the entire playthrough\r\n- the bamboo shoots and the panda are just weird\r\n\r\nThe game had a lot of potential, but too many systems and too ambitious level design got the better of it.\r\n\r\nRegarding patch 1.5:\r\nAs I said I didnt really pay attention to the story so the randomly not dying generals were just confusing to me, nothing more, but the fact that during startup the disclaimer says \"this is a work of fiction\" and then the devs get censored is just sad.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "This game runs horribly and its recommended specs are simply a lie. Even with a computer well above its recommended settings the game runs with endless stutters. \n\nWould have liked to play it, but sadly there's no other option than a refund. Get your performance right on launch.",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "[h1]Good Ideas Only Get You So Far[/h1]\n\nA lot of the chatter surrounding Wuchang has been about how familiar it feels, how it's something you've played before, something you already know whether you'll like or not, and, honestly, I find it all to be a bit disingenuous. Sure, it's unmistakably a soulslike and most of what that entails, but between its combat built around an idea wholly its own and its relatively bygone world structure, Wuchang's intentions might as well be the only thing going for it, and, well... they sort of are. Ultimately, novel design is only really as good as its execution, and developer Leenzee's debut title unfortunately comes up short almost everywhere you look.\n\n[quote]For the full, uncut version of this review, please consider[url=https://summitreviews.biz/article/40/wuchang-fallen-feathers-review] checking it out on the Summit Reviews website.[/url][/quote]\n\nIts narrative is the obvious place to start: you play as Wuchang, an amnesiac young warrior, as she grapples with her contraction of the Feathering, a maddening sickness indiscriminately warping its hosts into feral monstrosities—everyone but her, that is. It's an enticing opening, but just as you begin to expect an intriguing mystery that subtly hints its hand in careful visual cues and drip feeds satisfying revelations in its questlines, it so quickly devolves into an utterly rudderless mess of vague motivation, endless dialogue clarifying nothing, and, as of patch 1.5, a hoard of incongruent story alterations.\n\nIt's the structure and delivery of it all, more than anything else; there are just so many characters with so many names with so many quests that need so many items between steps that take place hours apart and they just never stop talking, each spewing out ten more names and local goings on except they all build off everyone else's exposition which works until you pick one wrong dialogue choice or take one false step without talking to a character back in some place you were at five hours ago then they just disappear forever and... are you getting all this? No? Me neither.\n\nIt's impenetrable even by soulslike standards, primarily because it neglects the genre's most potent narrative tool, substituting any meaningful attempts at environmental storytelling with yet more word vomit. There's [i]something[/i] in the almost comically archetypal military encampments literally everywhere and the trite, insipidly traditional East Asian design permeating just about everything else, but a good chunk of these places seem quite aware of their superficiality, filling the streets with bereaved citizens crying over monsters or rebels or whatever else behind closed doors, leaving the gory details to wooden voice performances and subtitles.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3590018684\n\nVisual and mechanical design are two very different things, however, and, at the very least, Wuchang's world excels in the latter. Each of the four major regions are relatively isolated, but deeply connected within, flaunting ridiculously intricate, vertical spaces, more little secret side paths than you can shake a stick at, and huge areas effortlessly supported by just a single place to rest and a million one-way doors. In light of the genre more recently defaulting to a relatively linear main path supplemented by a handful of item-laden dead ends, it's a rarity to see world structure this complex, and those wonderful, crystallising moments as fragmented mental mapping suddenly falls into place are as technically impressive as they are incredibly gratifying.\n\nThere's such a thing as too much intricacy, though, and while none of these locations are ever all that confusing, they tend to feel a little manufactured. A midgame area has you climbing a series of pagoda-like structures with bizarre scaffolding and ramps between them that defy all practical sense. A later area has this impossible floating lift conveniently taking you back down to an initial resting place for seemingly no other reason than the geometry just happening to line up. And, outside of specific instances, so many ladders can be found in places no respectable human would ever defile with such a thing, and these little knee-high walls dotted around are often the only thing preventing you from skipping entire areas.\n\nIt's all just exposed seams and stitching, but it feels noticeably too authored, and that's all it really takes to transform an immersive, authentic world into a series of functional levels optimised within an inch of their life, even if those levels are otherwise pretty damn good.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3590018610\n\nOn the combat side, Wuchang's approach to it is fantastic. It's essentially soulslike law at this point that an attack launched after a dodge simply must be considerably weaker than anything else in your arsenal, god forbid there's any form of convenience in a genre so infamously punishing; however, Wuchang turns that entirely on its head, instead reserving some of your biggest numbers for that forbidden marriage of offence and defence. Furthermore, dodging right before an enemy attack connects grants a stack of Skyborn Might, which can then be consumed by everything from a huge range of powerful spells to the two active skills tied to any given weapon. It's fast, fluid, and, with parries still dominating the genre as though Sekiro released yesterday, placing the dodge so front and centre is really nice to see.\n\nOr at least it should've been. In practice, each battle is defined by nothing ever feeling quite right: attacks with awkwardly long startups, animations feeling either too snappy or too sluggish, strikes not tracking properly, blows both hitting and missing when they shouldn't, and the list goes on. It's all in the game feel—little calibrations you don't pick up on until the controller's in your hands, culminating in this overwhelmingly clunky experience that's ultimately entirely antithetical to the intent. There's always some attack in your weapon's combo that grinds your momentum to a halt, and enemies are relentless, turning what should be an elegant dance into this vapid call and response, demanding nothing more than your big, flashy weapon skills over and over whenever your turn arises.\n\nAnd to that end, Wuchang is painfully easy, in a way that feels quite exploitative, as well. The first nodes in each of the five weapon types' skill trees offer alternate, more efficient, and far more reliable methods of generating Skyborn Might, immediately and completely negating the whole emphasis on perfect dodges, and the moves you get to use with it are so formidable they negate almost everything else.\n\nhttps://steamcommunity.com/sharedfiles/filedetails/?id=3590018574\n\nA combination of two active skills on an early-game spear is more than capable of [i]infinitely stunlocking[/i] about half of the humanoid bosses, and just a single one of your axe skills deals massive amounts of damage and stagger, grants an ungodly amount of lifesteal, and then weaves into a basic attack that restores all the stamina and Skyborn Might you just used, culminating in this hilarious feedback loop of immortality against anything that isn't at least three times your size. Simply put, if your build makes even a modicum of sense, it's almost certainly borderline game-breaking in one way or another.\n\n[h3]Final Thoughts[/h3]\n\nDespite a lot of expectations, Wuchang: Fallen Feathers isn't just another soulslike. It iterates on things the genre should have never left behind, and its innovations are actually new and refreshing in a space widely known for how derivative it can be (it's in the name!); yet, with From Software's crown looking ever more untenable, you have to make good on your pitch. Wuchang's level design may be up to par, but between its clunky combat and nebulous, practically incomprehensible storytelling, I struggle to find anything else worth recommending.",
      "voted_up": false,
      "votes_helpful": 20
    },
    {
      "review": "This game is fun, but doesn't do anything original. The performance is still pretty horrible as of writing this review as well. \nThere is a lot of Dark Souls looping back around through locked doors, but I'd argue there's too much, to the point where feels stale and not earned. There's a lot of bad level design as well, (example, an area where there are rolling boulders, one boulder roles into a dead end that has lot in it, but another roles to a dead end that just kills you if you step into it.) The bosses don't feel properly balanced to me either. I've played a lot of Souls games and the toughest bosses in those games feel fair. The bosses in this game aren't insanely hard, rather, they're just annoying. Crazy overpowered attacks make them feel artificially hard rather than earning their difficulty. \n\nIt's not a bad per say, just a lot of small issues spoiled the experience for me.",
      "voted_up": false,
      "votes_helpful": 15
    },
    {
      "review": "Oh this game was good, Dark Souls 1 vibes all over.\nThen they censored the game and fucked up the lore and make late game areas filled with allies and much much easier\nIf you're gonna buy this, revert to version 1.4 with mods",
      "voted_up": false,
      "votes_helpful": 12
    },
    {
      "review": "Imagine you are fighting a big boss in Elden Ring - just pick one you really liked, doesn't really matter who. Now imagine you manage to bring down the boss to 0 health and instead of a cutscene playing or the boss collapsing and desintegrating in a big explosion, the boss just becomes immune, stands there huffing and puffing and blabbering something about being tired. \n\"Good job, you bested me. You can pass.\" he says or something like that.\n\nThat's what this game has become. It's one of many changes the developers have forced onto the game since its initial release. A lot of the changes are pretty good and reasonable, mind you. It's not all bad. But this one, this single one - a change the developers themselves refuse to address or discuss - has in my opinion completely destroyed this game. Or at least massively hurt the developers' credibility as artists and the crediblitiy of their work overall.\n\nIf you can ignore this censorship - because that's what it is (I won't go into details here, you can look it up for yourself, on the Steam forums or elsewhere) - then you get to play a decent Soulslike with decent combat and decent bosses. It's all just decent. \nThe story is a s-h-i-t-s-h-o-w, though, because of the aforementioned censorship. It simply doesn't make any sense anymore and it completely destroys any sense of immersion you might have had when starting the game.\n\nThe game could have been more than decent. It could have been absolutely great, actually. Maybe not on par with something like Lies of P or the other FromSoftware games, but pretty damn close. As of now, it's just decent, at best, and a massive disappointment, otherwise. The developers themselves have ruined this game and - argueably, even worse - have refused to acknowledge it. They pretend these specific changes simply never happened. Frankly, I find their behaviour simply disgusting and disrespectful; but that's just me, other people's opinion might vary.\n\nWhat's left to do, now? \nWhat have I learned?\nThat Chinese games are not worth the risk? \nNo.\nBut next time I see a Chinese game telling a fantasy story with slight nudges towards Chinese history (like the Nioh games with Japanese history, for example; weirdly enough the Japanese have no issues with these kind of stories) ... I will be holding off on purchasing it, regardless how good it looks.\nWhy?\nBecause it looks like some lunatics in China (and I want to stress: it's only a couple of bad apples) seem to have more influence than actual paying customers. That's why.\n\nPurchase this game on the biggest discount possible - or just stay far away and put the money towards projects and - most importantly - developers that do respect you AND their own work. These ones - Leenzee - unfortunately don't seem to care that much; instead they are hiding behind disingenous words of gratitude and are trying to appease someone that never wished them success to begin with. \nShould have put all that energy into things that actually matter: like more weapons, more creative outfits (because the ones they added are bland AF) and polishing up combat and some bosses' hitboxes. \nBut, alas, we are left with partially decent and partially terrible, instead. What. A. Letdown.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Is not hard game per se, but has a bunch of mechanics that make it frustrating to play, for example there are rocks that kill if stay close for a couple of seconds, if you are using the wrong equipment. The problem is, when you try to destroy them and there is a enemy nearby, the auto-aim(which you can't turn off) makes you hit the enemy instead, forcing you to linger near the rock and often killing you\n\nAnother issue are the weapons, the lance for example when you dodge and then use the heavy attack it often miss the enemy the first few attacks and often you end up punished because of of that, on top of that some enemies use input reading which forces you to abandon certain move altogether, otherwise you end up punished,\n\nI don't recommend this game, go play other from souls-like you will have more fun.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Unbalanced. \n\nI want to give this a thumbs down, but it does do a lot right.  However, the bosses in this game are poorly designed. You can mow through regular enemies then hit block walls with bosses. When you read the majority of people have to respec their build on multiple bosses to then afterwards beat easily, the design is broken. Also, do not believe the people who say the deaths never felt unfair. Bosses don't even remotely play by the same rules as you. They will teleport, lunge across the arena, fly around, etc and with unlimited stamina.  \n\nOn the positives, the combat is what you want from a Souls like. The weapon mechanics are varied enough and the environments are gorgeous. Also nice is the enemy variety.\n\nEDIT: Changing this one to a thumbs down due to getting further along and witnessing the over-the-top boss designs mentioned above. Them continuously jumping all over the place is nauseating. I'm a Souls veteran, having beat every Souls boss, even optional ones, without any help. Wuchang bosses suck and there's no sense of satisfaction, just frustration mechanics added.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The good:\n\n- You have 5 solid classes to choose from. axe, longsword, 1 handed sword, dual sword, and spear. each gives you a different approach to the how you play your game.\n- The map structure is very reminiscent of DS1 and you get 5 chapters worth of it. \n\nThe bad:\n \n-Each boss can be beaten with one weapon however each boss does have a weapon that is \"more successful\" so it all comes down to how good you are at the game and how often you are willing to die to use your favorite weapon. \n- you cannot leave certain controls unbound. swift draw is a unique way to keep momentum going however, i find myself accidently pressing the left joystick too hard unconsciously. if you have the same habit, you might find yourself dying more times than once because you are locked into a skill animation because you pressed the button\n- i hope you have your handy dandy wiki to plan your route because its incredibly easy to mess up your run or just miss stuff.\n\nThe Ugly\n\n- some high tier weapons are blocked from access behind the deluxe edition pay wall.\n\nOverall, i don't hate the game but i often ask myself why i am still playing it. i just started chapter 5 but i dont think i will go beyond that.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Mid or below average soulslike. The more you play the worse it gets. Level design followed by exploration are the only good parts. Game is quite flawed otherwise and does not play great. Quest design is atrocious like in many soulslikes. Get up and healing animations are slow af. Madness mechanic is dumb. Dying and loosing souls should be enough of a punishment. Lowering player toughness after dying is retared in a game where you want to learn bosses. Those major encounters are vastly unbalanced. Game has very weird difficulty spikes that are followed by very weird difficulty declines. Poise is non existent for the player and overabundant for enemies. Some of them, not even the big ones, does not react to player's attacks. Inputs feel unresponsive. Replaying bosses that have cutscenes is pita because it requires to hold a key for few seoncds each time to skip a cutscene. Maybe use a fucking button press instead of holding? Perfomance is trash as always with those UE5 titles even with 7800x3d and 4090. Stutter fiesta too. Spears are straight up useless and some other weapons and playstyles feel like being designed for specific encounters. I don't really like when the game is shoehorning me into one specific playstyle just to beat a boss because otherwise it's miserable experience. I don't know if it's true but some enemies seem to exhibit input reading behaviour. They just walk around until you press a button and then they react immidiately. It is especially visible when trying to heal on some bosses. Oh and enemy attacks are often on rails. They just dash-slide with attacks to the player and can do 180 turn in a split second. They have nearly 0 directional commitment with their atacks. The game was also censored after release which made its story much worse. i know that none plays soulslikes for the story but I think censorpship of artistic vision in any way should be pointed out. Games like Bloodborne, Elden Ring, Black Myth Wukong, Sekiro, DS 3 while not prefect either are still light years ahead of this game in terms of gameplay. It's my 2nd try at this game. I am quite stubborn so maybe I will still finish it but only because I paid for it and I literally don't have anything else to play right now.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It was an amazing game but they censored it so now the story doesn't make any sense and all the actions of characters feel incoherent and pointless.",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "Unfortunately, I cannot recommend this game, much as I wish I could. As someone who lives and breathes Souls titles, I was genuinely eager to play it. However, the performance is absolutely dreadful. Ignore anyone claiming it runs fine - it simply doesn’t. \n\nIt’s the same crowd who insist Red Dead Redemption 2 runs flawlessly on their PlayStation 4, likely because they own some mysterious model no one else seems to have. Or those who claim that 30 FPS is perfectly acceptable because the human eye supposedly can’t perceive anything beyond that.\n\nI’m running a 9800X3D and a 5080, and while the FPS at 4K was decent, the frame times were appalling. I ran a frame time graph using RTSS, and it was one of the worst I’ve ever seen, it resembled an ECG.",
      "voted_up": false,
      "votes_helpful": 29
    },
    {
      "review": "Found the controls frustratingly sluggish for a game that's supposed to be about fast, responsive, combat. \r\n\r\nCouldn't beat Honglan after ~40 tries over a full week and quit. Guess I'm supposed to re-spec my build until something finally works? Or resort to cheesing her? No thanks. \r\n\r\nThe only other bosses that felt this terrible to face were Demon of Hatred and Promised Consort Radahn. Seriously, Malenia without Summons was a more balanced and rewarding experience than this early/mid-game \"skill spike\" bs.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I might give it a further try later, but I was filtered not by the game's difficulty but by the overly nonsensical maze-like level design.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "So, I've played the game for 50+ hours, but finally decided to crash out on the White-Haired Elder boss fight.\r\n\r\nI'm a veteran of all the DS games, Sekiro, Elden Ring, and enjoyed Lies of P, AI limit, and a bunch of other similar games.\r\n\r\nVisually, this game is stunning, and it has some neat innovations and ideas which I'm sure other games will pick up in future.\r\n\r\nHowever, the game itself is a total mess. Recent patches have made things worse, and unless you enjoy windowing out every five minutes to check a guide, you will likely get lost, fail quests, and have no idea how to beat ridiculously over-tuned bosses.\r\n\r\nIn short, the game just isn't much fun. It's a massive grind that doesn't respect your time, and unfortunately instead of taking the effort to properly design bosses and fights, the developers appear to have taken the lazy route of apparently removing things like poise, stamina, and weaknesses (late game) in favour of having the player do massive runs to a boss and then get RNG'd to death.\r\n\r\nThere are too many gimmicks, and not enough skill involved. I don't mind a hard fight if it's fair, but having unsummonable summons, unparryable or dodgable attacks, and a very brittle plot structure (one curious explore to the side and you've sunk your entire playthrough), means it's no wonder that all the community feedback and forums are so negative.\r\n\r\nDon't believe the hype, and don't believe the positive reviews. This ain't worth your time.",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "My heart is with the graphics and sounddesigners who did a great job just for game designers to put up the same old slob with input reading and animation cancel. Im so tired of it, i was willing to give this game a shot since i never care about soulslike stories anyway cause theyre trash or some \"deep\" shit but my god, the rest of the game doesnt pull through. The respawnshrines are placed in the weirdest possible ways and the game is either gardenhose linear or an entire city without a respawnpoint. Bosses are COMPLETE pushovers except a few that feel like they would be amazing if it wasnt for the shameless input reading. Commander something boss in the epic arena glitched herself to death cause she animation canceled out of bounds. Shame, next.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Wuchang Fallen Frames. Grain graphics. Worst camera of all souls-like games which constantly moves by itself.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "They had a pretty good chance to be a nice game people would remember positively, but they failed in the end.\r\n\r\nPositives: excellent optimization and graphics, nice visuals here and there, a pretty okay builds system that allows you to change your playstyle (in reality adapting to the required by current boss build set). BTW, still here they followed this recent trend of naming things unique ways. Meaning when you try to understand what this or that skill does, you will literally read encyclopedia of their unique terms for usual words like \"invincibility window\" or other usual ones, before you learn them and start to understand better what they mean. Sometimes my eyes were bleeding of these terms, like you were translating some new language, you know.\r\nI think this is where the positives end.\r\n\r\nThe game suffers from pretty childish issues that start instantly when you open the game. Controls - who hasn't mentioned them yet? Assigning a run button to the A button on Xbox controller is something I have not seen in any game. It looks like developers never played a game on a gamepad and don't understand that you still need you right stick to look around while running and you can't do that holding the A. Much later they introduced re-assigning the buttons which I used but it was also done in a very lame way so that when I swapped A with another button (weapon special in my case) - the button approving dialogues/interacting or picking up things still remained A. And it means every time you slightly missed the item or held the skip cinematic for too long you will trigger a long animation of a strike or whatever you reassigned it with. I'm not sure if any of them devs played it after they made the changes.\r\nThe \"madness descends\" notification  that you for some reason see every time blocks any interaction and adds around 5 seconds of waiting before you can re-try the boss.\r\nThey show you cinematic before the boss every time, so you could skip it. I thought it was 2025.\r\n\r\nThe general difficulty of the game did not seem too high for me, I beat most of the bosses (except some of the first ones) without assistance. Still fights are somehow staged. You really need to dance up to the devs plan and dodge-dodge-dodge-dodge-dodge then maybe you can hit. Those who say this game can be treated as a non-parry one lie, there is no practical difference, just a different move. Yep, some magics really make it easier, but you still need to dodge all the way through. This lack of variety in the battle approach is kind of lacking.\r\nThey were also crazy about the labyrinths and forks in the roads and decided to do almost each level like this which at times was very annoying, but this is still manageable in the end.\r\n\r\nAnd the last but not the least thing. They say a lot that this game is so punishing etc. I don't think it is so much of a punishing game, all is pretty much standard, though it seems the devs did not have enough creativity of how to make it hard so there's so many sudden \"you died\" moments including the stupid uninterruptable moves of some bosses. In my opinion they simply elongated the game in this way, but was it so hard? I don't think so. But what will actually punish you or I'd say it correctly frustrate you is the stupidity of the story line. YOU HAVE TO progress in the game according to the devs plan and if you step aside a little (and they well allow you to do that) - you will ruin the questline and will not get a proper ending. And it is so easy to do so, just read the internets! Quests never been a strong side of the souls games, but none of the one I played had this for the major questlnes, side ones - yes, but not the main ones. They literally give you the opportunity to kill bosses in a WRONG ORDER (WHAT?) and bang you've missed it. I've read some comments from china players like \"hey, that's clear as a day in the dialogues\" - well no, it is not and thousands of complaining players are the proof to that. You did not adapt your dialogues for the international market and play the game in chinese language and know the legends etc. For the rest of the world most of the dialogue lines are meaningless and don't add up. This is a  total game design flaw and it seems that people creating this thought that later after the first fail you will want to replay in a correct order on an NG+. No way, people, I'll not open this game again after such approaches and issues described before. \r\nYou still have a ton to learn from Japanese developers unfortunately, though you have already gone a long way, I admit.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Fatal error, cant even launch the game. Refund Pending",
      "voted_up": false,
      "votes_helpful": 0
    }
  ]
}