{
  "positive": [
    {
      "review": "I quit my j*b after playing this game to pursue a full time BMX Freestyling career\nI fractured my spine and i am now paralyzed",
      "voted_up": true,
      "votes_helpful": 28
    },
    {
      "review": "“Fell off a mountain, broke 17 bones, and laughed the whole time. 10/10 adrenaline therapy.”",
      "voted_up": true,
      "votes_helpful": 22
    },
    {
      "review": "If you love mountain biking, this is THE GAME for you. DH or slope style, it's all amazing. Doing tricks the way I would never be able to do in real life. The control with keyboard is nice but I bet with controller would be an even more exciting experience. Playing this game while you get snowed in, injured, or bike in downtime.\r\n\r\nMy only gripe would be that the UI isn't very intuitive. But that's just nitpicking.",
      "voted_up": true,
      "votes_helpful": 9
    },
    {
      "review": "Every cool items is on paywall, but overall its a cool game",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "quite fun i hate the fact u gotta pay for alot of stuff but the actual gameplay is quite fun",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game is absolutely beautiful. I love to end my day playing zen mode and listening to some music. so relaxing",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "fun sports game but i thin the off track ski backflip shoud be layout",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "it's really fun and the career challenges are also fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i have been playing this game since it came out on ps4. bought it again on a new pc. WORTH IT. best game oat, and you WILL get addicted to it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun has downsides like kinda buggy but has lots of upsides, one of them is the relics, I really like finding wacky cool gears and I don't think many other games have this feature.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Just a chill game to relax to. Not a game you will play for super long hours before it getting a bit repeating. Still nice game with   no major issues.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Ngl i was pretty sceptical about this game at first. However, after 6 hours straight I can tell this game is fire! Open world looks and feels really good. You got shit tons of bots and real players all around the map and it looks alive as hell. Especially after diving in the mass race of 60+ people, pure chaotic fun. \n\nAlso, I bought the game originially also because of the skating in it. It's not the greatest skate controls, but it feels somewhat like a mix of skate and tony hawk games. \n\nThere are also some nice cosmetics to be unlocked for free though, like vans shoes and pants w tshirts, however they are locked behind grindy currency which unlocks with progressing. Still, some of the cool stuff, like skateboarding in general or bmx campagin is locked by dlc paywall. Same goes for longboard. \n\nWould I reccomend? If you're looking for stunning visuals chill (and sometimes competetive) game with shit tons of cool riding and flying sports in it, hell yeah. Though, keep in mind, to get the skateboard you have to get skate edition. (all the other stuff except dirt bike and longboard is unlocked in the base game too).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have only played a little bit of it but I am enjoying it so far, it is a Ubisoft game so its got the typical structure they use. The mass races are very fun and just complete chaos I can see it might get repetitive though, overall nearly 2 hours played and enjoying it.\nI will come back and edit the review once I play more and complete quests around the map.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game one issue though\nMICRO TRANSACTIONS\nthis game has an insane amount of microtransactions \nafter completing all of the careers its really pointless to do anything else\nit doesnt get much updates other than new items in the god useless shop\nplease add something to the free part of the game for once and i beg you i beg you\nSTOP BEING MONEY HUNGRY\nDO BETTER UBISOFT \nbut i still recommend the game because it has great gameplay\nvery nice mechanics over all\nbeautiful graphics \nthats about it yeah",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun, but the DLCs cost way too much.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game has so many mechanics and is very fun to explore. I recommend you to take the long way to get somewhere as it is very scenic and beautiful.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "underrated game .. if u want some relax and chill you can go for it",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "awesomesauce i was cookalookin and everyone started glazing the heck outta me ongee and it was so cool to see that happen i got first place every dang time nobody could catch me it was like i was a cheeter",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Not the same as the perfected controls of steep but nevertheless still insanely fun to have all of these extreme sports to choose from.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I played this game more on PS5. I can definitely recommend it to anyone, as it's quick to learn and doesn't involve any form of competition. It's perfect for relaxing or as a quick game when you only have a few moments between playing. However, I don't think it's worth the price. If you decide to buy it, wait for a sale.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very good game I would recomend but you need a powerful pc to play it smoothly. The game has beatiful graphics. Honestly I would give this game 5 stars 🌟 or 10 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is great for anyone who is a fan of the Red Bull extreme sport community. Even though the controls are a little tough at first on a computer, you get used to them eventually.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Rider Republic is an awesome open world extreme sports game. I would recommend getting the game on sale for $4 or less as it's really more of a single player game now that it's not as active. Overall Rating: 7 out of 10.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Amazing game, fun and addictive!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bikes and snow good, everything else ass (specifically flying)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I really like playing this game when the npc falls down it just stands up and start walking just like nothing happened 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is god dang good ngl. imagine your days is boring and entry this game it all gone.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Pretty fun game if you like playing unrealistic. Has bmx, bike race, bike tricks, skiing/snowboarding, dirtbikes, skateboarding, wingsuiting and rocketwinging. If you want something more realistic. I would go for a game like descenders or bmx streets. Overall a really fun and well made game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and amazing graphics. Also u can have very many careers and bikes. They just added modercyles so get the game.\r\nvery worth it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is genuinely the game ever genuinely. possibly the genuinely best genuinely game i have ever genuinely played before genuinely",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "I like it, while yes I don’t like that it shows you 2 careers that just kick you out if u don’t pay, If you keep your fingers away from the Republic Coins shop, the game is fine.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Das Spiel ist so gut 4€ an black friday ist wirklich geschenkt es macht einfach Spaß die Grafik ist gut",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun peak good just add god damn scooters or i will find you and you might not see tomorrow",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game just to much money to spend to get cool stuff",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "cool fun amazing stuff and explore",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good very chillaxing very nice very skibidi i felt sigma playing ts iykyk",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "has a lot of cars parked around but they're basically all trucks or SUVs save for one blue sedan. the pink pocket car tho... 2 door, convertable, pink,,, could be a winner!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is really fun and I easily lose track of time the first time I played it I played 5 hours non stop.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love this game if you like the outdoors and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the game is fun but like everything is hidden behind a paywall",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this is such a relaxing game it is so good and i love it buy it now now i say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very very good and fun game now thats",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "fun game ubisoft login is horrible though",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "THIS GAME IS THE BEST IST FULL OF PLAYERS AND AWESOME SPORTS WITH MUCH MORE",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its a great game and i have nothing else to say",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "bike tricks are really fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its fun like abuse my keyboard fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is recommended for everyone who likes MTB!\r\n🤟",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "SO FUN, Hours of gameplay to be had. ACTION PACKED",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun game if you like biker or not",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Soooo sick. Skate 3 on roids!!! You can drop into a mountain, a valley, skateparl, bmx park, reservoir, you can fly, paraglide, it is soo sick!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "One of best extreme sports game!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Really good if you like sports",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "goog game for its price",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like the graphics and the gameplay\r\n:]",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very fun and good game fr fr",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "you can ride in a republic 10/10",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I crashed my bike and broke 90% of my body :(",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is.......i dont know just buy it WHEN it is on sale",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "would love to play it again, but my controller's broken :(",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "cool realistic game for play",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun but after abit it gets boring",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "new players you should play this game so cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very nice although it go some buggs",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ADD STARK VARGS AND SURRONS AND E RIDES PLEASSSSE",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its fun to ride in 120mph",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game if it would launch",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "this game is good and so realistic",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good and fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "so fun, best game i have",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "pretty meh honestly, still good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "the whole game is good",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "might be the best ubisoft game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "2fps max fix your game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "got it for 3 bucks its meh",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i play this game 4 hours in row and i like this so much perfect game Nice Game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "really fun with pepole",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "cool game ngl",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "it is awsome pls buy game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "public nice game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "its a very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "its one of the best games ive played",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Great game!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "funny game i like it",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "this game is very cool",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good!!!!!!!!!!!!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fun cool awesome game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "nice game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "good  gamew",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Very fun",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "i like this game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "great game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "peak game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "sooooooooo so so so sooooooo so sooooooooooooooooooooooooo realllly reallllllllllllllllllly realylylylrealyyyy realllllllllly really funnnnn",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Fire game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "very good",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "Riders Republic could’ve been amazing — the gameplay, the visuals, the variety of sports — all of it feels genuinely fun. But Ubisoft just couldn’t resist stuffing it with microtransactions. 😒\n\nYou literally have to buy more stuff just to enjoy parts of the game properly. It’s packed with paywalls, cosmetics, and constant reminders to spend more money. Like seriously, why do I have to keep paying after already buying the game?\n\nIt’s sad because the core game is actually really good, but Ubisoft’s obsession with monetization ruins the experience.\nWTF Ubisoft, stop turning great games into cash-grab machines.\n\nRating: ★★☆☆☆ (2/5)",
      "voted_up": false,
      "votes_helpful": 153
    },
    {
      "review": "Had the potential of being a very good game but ofc ubisoft being ubisoft turned it into a cash grab",
      "voted_up": false,
      "votes_helpful": 24
    },
    {
      "review": "I finally purchased this game after a lot of thinking and watching many YouTube videos about this game. \nSpent 1 night downloading it because of my poor internet connection, just to realize that the game won't launch because it has a problem with the anti-cheat. \nSpend another 30 minutes searching for a solution on the internet and another 30 minutes trying to fix the problem and still can't open the game. \nMaybe I'm just dumb, or maybe I feel like every Ubisoft game is difficult just to open it.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "REQUIRE UBISOFT ACCOUNT TO PLAY. IS A TRASH LIVE SERVICE. HAS MICROTRANSACTIONS EVERYWHERE. UBISOFT WILL EVENTUALLY SHUTDOWN SERVERS AND YOU WILL BE UNABLE TO PLAY. PHYSICS ARE RETARDED. JUST PLAY DESCENDERS OR SOMETHING ELSE.\n\nDespite the negative reviews I gave it the benefit of doubt but the experience completely sucked. Account creation was a pain in the ass. The introduction had long unskippable cutscenes. Finding a mode to play was hard because the interface was always pushing me to buy something. The gameplay wasn't fun. Quitting the game left the Ubisoft launcher running in the background.",
      "voted_up": false,
      "votes_helpful": 9
    },
    {
      "review": "Legal scam. You have to pay extra to unlock all the cool stuff they show in the trailer. Piracy is justified.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Mandatory bloatware, After you pay for the game your enforced to download Ubisoft bloatware to be able to play the game and its awful, Ubisoft being your customer is an awful experience.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I mean its alright. I got it 90% off for like 3 bucks and I got my moneys worth. It's very Ubisoft. You can't go three minutes without a popup of some kind, stuff like skateboarding and snowboarding are locked behind paywalls(maybe you can unlock them, but I didn't see how if so and its unlikely). The gameplay is fine, but I will admit the map is somewhat dull. I can see it being a nice thing to do every now and again if you're bored but otherwise, I would not in any world pay full price for this. It should also be noted that I am not one who typically plays these types of games, and while I don't hate them I may have some bias due to that. But my honest opinion, just buy something else.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Its a visually stunning game but alot of micro transactions its a great game but core features locked behind a paywall if you want the game wait till a sale to get the complete edition as then you get a good chunk of some of the features locked but otherwise don’t as its sad as its a great game but ubisoft got money hungry and ruined it.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "The Ubisoft Connect was a slap in the face, Steam needs to step in and stop these garbage companies forcing their bloatware on us.\n\nAlso you need to press fucking BUTTONS to move while flying, which makes it ridig and not free feeling. Sadly that was a deal breaker for me, very outdated, and I will be refunding this game. Looked good and had potential but this truly takes away from the free feeling of playing such a game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Refunded after 26 minutes (should have been 1)\n\nOnce you've gotten through the several layers o Ubisoft registration hell, made an account downloaded their app and authenticated, then the game can be launched, this takes stupidly long.\n\nThe menus UI are completely uninspired and tacky.\n\nVisually it looks like Fortnite.\n\nPhysically none of the controls feel fluid. Everything feels like a child developpe dthe controls. Its heavy, clunky, zero feeling of connectedness or flow.\n\nI am genuinely so shocked how bad this game felt. I honestly give it 0/10 and I want the last 30 minutes of my life back.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has a great concept and could be really interesting, but the execution is disappointing. The UI is extremely confusing, and the whole game feels messy. There are way too many bugs and glitches, and even the controls are poorly designed. It’s hard to enjoy or get immersed in the races when everything feels so unpolished. Overall, it’s just a frustrating experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Returned. This game is awful. It is a culmination of every extreme sport game that has ever existed but dumbed down to the point i can't find any enjoyment in it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was great back in 2022 when I first got it and there was so much to do but now in 2025 ubisoft has filled it with microtransactions and there was a update that change all the keybinding and speaking of keybinding changing finding the stuff you want to change like the \"jump\" is hard to find. The gameplay itself its kinda bad back in 2022 when I played then there were so many races with differents types of races and if you did those you can unlock more bikes and gear but these days theres no races (unless I am stupid) and everything is already unlocked except the \"cool\" gear like skate boards and motor bikes. So buy at your own risk if your only idea is to explore the world which is not that big",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is for children, none of the physics make sense and the animations are rushed. Then there’s the Ubisoft account activation and their extremely low quality customer service who will ignore every issue you have. Steam will also deny a refund when you start a new Ubisoft account.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculous issue — the game refuses to launch. All I get is: ‘Windows cannot access the specified device, path, or file…’ I’ve reinstalled Steam, moved the game, verified files, tried every fix possible, and NOTHING works. This needs to be fixed ASAP",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE THIS GAME I WANT TO SMASH MY MONITOR I FREAKING HATE THE MASS RACES WHY AM I IN 40TH I WAS IN 1ST TWO MINUTES AGO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "DO NOT BUY READ FIRST everything is hidden behind a paywall I BOUGHT THE COMPLETE EDITION AND I DONT GET A DIRT BIKE",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Crashes when trying to get to main menu.\n\ni've reinstalled battleye 2 times. and cleared temp twice.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "seems like a fun game till you hit the paywalls\n\nthanks ubisoft!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I CAN´T PLAY THIS GAME WITH MY CONTROLLER. ITS NOT LETTING ME I WANT TO CONNECT IT. NOT WORKING 😡 .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought it for the skate portion.... BRUHHHH it's so clunky and slow... I then tried to other sports and it's just as bad. To me it felt like a mobile game ported to PC. \n\nI bought it on sale at 90% off and even then I refunded it anyways. Not even worth the 10$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The concept itself & Singleplayer are fine but multiplayer is not well thought through and all updates dont make it different",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's actually my fav game despite everything \r\nBut every time I click on continue it crashes \r\nI'm not the only person many people are facing this problem \r\n\r\nWell... Bad really bad ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my ps5 duelsense controller is not working but it is conected pls help",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Terrible controls, terrible performance, glitches, no QOL.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "All of the cool features are paywalled, Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "If this was a bit less pay to win then maybe id consider keeping this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "complete edition is not complete",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't start its just one big scam",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible cant use any controller",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant get the activation key.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nie mogłem wejśc w gre",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHERE THE F**K IS CD KEY? YOU USELESS COMPANY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game sucks very much have to pay for every bit of everything because of the greedy jew devs and owner so they can get the 100,000 dollar bonus and go on a 2 month bora bora vacation. video games fucking suck ass now zero creativity, subscription games created by jews, laggy, unfinished, and copying fortnite because they suck at innovation. video games are so bad literally no one will play them in future. how about you guys pay the consumer for having us pay for your microtransactioned game. do i have to convert to being israel for these microtransactions to go away? no i have to be a transgender.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ubisoft malware",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft greedy af",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "shit ui",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Riders Republic could’ve been amazing — the gameplay, the visuals, the variety of sports — all of it feels genuinely fun. But Ubisoft just couldn’t resist stuffing it with microtransactions. 😒\n\nYou literally have to buy more stuff just to enjoy parts of the game properly. It’s packed with paywalls, cosmetics, and constant reminders to spend more money. Like seriously, why do I have to keep paying after already buying the game?\n\nIt’s sad because the core game is actually really good, but Ubisoft’s obsession with monetization ruins the experience.\nWTF Ubisoft, stop turning great games into cash-grab machines.\n\nRating: ★★☆☆☆ (2/5)",
      "voted_up": false,
      "votes_helpful": 184
    },
    {
      "review": "Refunded Descenders to buy this shit but wtf. Microtransaction filled slop. So much ad pop-ups. Can't believe a company that was synonymous with gaming for me once upon a time is such a greedy mofo now.\n\nFUCK UBISOFT.",
      "voted_up": false,
      "votes_helpful": 65
    },
    {
      "review": "i got the complete edition and didnt get all items i need to spend extra 20$ for each toy lol typical ubis... refunded it",
      "voted_up": false,
      "votes_helpful": 33
    },
    {
      "review": "Had the potential of being a very good game but ofc ubisoft being ubisoft turned it into a cash grab",
      "voted_up": false,
      "votes_helpful": 38
    },
    {
      "review": "Its a decent game but overall it just feels like steep but they slapped bikes to and added a bunch of microtransactions like if i wanna use something new i gotta spend more money the game actually cost",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "5* for the best open-world \"mindless riding around for hours\" game I might've ever played. Better than Forza in that sense - what other game lets me ride around on a longboard, dirtbike, hovercraft, snowmobile, ice cream bike, or power wheels with nitrous?! \n\n1* for MTX, live service BS. I can't wait to lose all of the vehicles I paid for when the servers go down :D I would've happily paid $60 for a full version with all of the vehicles that I could keep forever. But no, it's 2025 and you don't get to keep what you buy anymore. I just have boring Zen Mode to look forward to with bicycle and some skis, just like I do any time my WiFi goes out. No races, nothing. Because fk me, the consumer, that's why? I'm embarrassed that I spent more than the $4 to buy this game. \n\nThey best release the FULL game to PAYING customers when they decide they don't want to pay for servers anymore.",
      "voted_up": false,
      "votes_helpful": 11
    },
    {
      "review": "Waste of money. Been trying to make an ubisoft account cause i can't play without doing that, and everytime i hit enter after typing the code they sent to my email the screen just flashes and nothing happens. Backed out, and it made me retype all my info again, and not the screen just keeps flashing in that screen earlier.  Absolute nonsense waste of time and money.",
      "voted_up": false,
      "votes_helpful": 14
    },
    {
      "review": "This game is a cash grab\nI went in thinking you can unlock stuff by progressing the game\nBut no ofc you have to give money to just get the skateboarding \n \nI gave money for the stupid game\nNow i have to give more to unlock other stuff?\nSo great and fun and smart by the developers",
      "voted_up": false,
      "votes_helpful": 6
    },
    {
      "review": "I finally purchased this game after a lot of thinking and watching many YouTube videos about this game. \nSpent 1 night downloading it because of my poor internet connection, just to realize that the game won't launch because it has a problem with the anti-cheat. \nSpend another 30 minutes searching for a solution on the internet and another 30 minutes trying to fix the problem and still can't open the game. \nMaybe I'm just dumb, or maybe I feel like every Ubisoft game is difficult just to open it.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "REQUIRE UBISOFT ACCOUNT TO PLAY. IS A TRASH LIVE SERVICE. HAS MICROTRANSACTIONS EVERYWHERE. UBISOFT WILL EVENTUALLY SHUTDOWN SERVERS AND YOU WILL BE UNABLE TO PLAY. PHYSICS ARE RETARDED. JUST PLAY DESCENDERS OR SOMETHING ELSE.\n\nDespite the negative reviews I gave it the benefit of doubt but the experience completely sucked. Account creation was a pain in the ass. The introduction had long unskippable cutscenes. Finding a mode to play was hard because the interface was always pushing me to buy something. The gameplay wasn't fun. Quitting the game left the Ubisoft launcher running in the background.",
      "voted_up": false,
      "votes_helpful": 10
    },
    {
      "review": "honestly the game isnt terrible theres just not alot to do so u can only really play 2 hours before getting bored fully ive only got 14 hours in like 2 years of owning it",
      "voted_up": false,
      "votes_helpful": 5
    },
    {
      "review": "Legal scam. You have to pay extra to unlock all the cool stuff they show in the trailer. Piracy is justified.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Game is fun for awhile but it's dead and filled with fake players. 95% of the other players are fake. It felt lively for awhile until I realised it. (you can see them spawn and despawn and follow a path on loop) Only those with a username are real players. Problem is, you can't tell where the real players are when looking at the map.\n\nThe gameplay is pretty inconsistent, sometimes pressing the brake twice makes it go backwards, other times it doesn't. some vehicles can't go backwards, like the snow mobile. The semi-assisted landing is kinda broken, sometimes a perfectly good looking landing will crash and completely chaotic ones will land fine. Sometimes being on the rim of checkpoints counts, sometimes it doesn't. The game likes to respawn you to crash instantly afterwards or repeatedly respawn you to crash until you rewind a lot and lose many seconds, which are crucial for wins. The physics are that of arcade games.\n\n\nIt's an average modern AAA experience that's not worth anything more than 90% off.\n\n\n\n\nEdit: forgot to mention. Poor character customization in AAA fashion, stuck with a few stereotypical faces, scarce haircut styles. whitest skin color is tanned, can't look like an average asian skin color, again in typical AAA fashion with all their \"inclusion\". And, if you got a friend that's always in last place, the game has a lot of pitty for them and screw over everyone who's never last place from time to time (bugs, physics problems, poor score of tricks, bouncing off terrain in wrong direction, etc.)",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "i dont recommend it due to the amount of dlc offered. of course, it's not required, but you feel like you miss out on a large chunk of the game by not having it. fun game overall tho",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "Complete edition my ass there's still 2 more seasons hidden within the menu. Don't be fooled by the \"complete edition\" its not everything. Also ubisoft f*** off with your avatar micro transactions. Ew. I tried liking the game when it came out. 2 years later I give it a second chance. Its the same state it is with skateboarding (which is beyond awkward as hell) I tried to like it but the game just feels like a free to play like skate",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Mandatory bloatware, After you pay for the game your enforced to download Ubisoft bloatware to be able to play the game and its awful, Ubisoft being your customer is an awful experience.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "MADARCHOD ubisoft... the complete edition is in complete.. everything hide behind the paywall...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "I mean its alright. I got it 90% off for like 3 bucks and I got my moneys worth. It's very Ubisoft. You can't go three minutes without a popup of some kind, stuff like skateboarding and snowboarding are locked behind paywalls(maybe you can unlock them, but I didn't see how if so and its unlikely). The gameplay is fine, but I will admit the map is somewhat dull. I can see it being a nice thing to do every now and again if you're bored but otherwise, I would not in any world pay full price for this. It should also be noted that I am not one who typically plays these types of games, and while I don't hate them I may have some bias due to that. But my honest opinion, just buy something else.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Its a visually stunning game but alot of micro transactions its a great game but core features locked behind a paywall if you want the game wait till a sale to get the complete edition as then you get a good chunk of some of the features locked but otherwise don’t as its sad as its a great game but ubisoft got money hungry and ruined it.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "The Ubisoft Connect was a slap in the face, Steam needs to step in and stop these garbage companies forcing their bloatware on us.\n\nAlso you need to press fucking BUTTONS to move while flying, which makes it ridig and not free feeling. Sadly that was a deal breaker for me, very outdated, and I will be refunding this game. Looked good and had potential but this truly takes away from the free feeling of playing such a game.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Terrible, greedy team behind this game. Full price game... yet every major update everything is behind a paywall? Also the gameplay feels clunky and unresponsive, which I guess happens when you care more about dropping DLC slop than updating gameplay.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "trash game and trash devs the manuals don't work the A button is to do a flip not jump like the game multiple tutorials telling you so and then half of the game you cant play unless you spend 150 extra dollars to unlock it just to use ubisoft just needs too die and i do mean that",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Refunded after 26 minutes (should have been 1)\n\nOnce you've gotten through the several layers o Ubisoft registration hell, made an account downloaded their app and authenticated, then the game can be launched, this takes stupidly long.\n\nThe menus UI are completely uninspired and tacky.\n\nVisually it looks like Fortnite.\n\nPhysically none of the controls feel fluid. Everything feels like a child developpe dthe controls. Its heavy, clunky, zero feeling of connectedness or flow.\n\nI am genuinely so shocked how bad this game felt. I honestly give it 0/10 and I want the last 30 minutes of my life back.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "you got like less than 20 percent of content, typically greedy ubisoft game",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "bad, graphic bug, performance issuese, and more. thank u ubisoft for scam the players :) i hope tencent will buy u",
      "voted_up": false,
      "votes_helpful": 4
    },
    {
      "review": "This feels a lot less smoother, and an overall downgrade to it's predecessor Steep. I'd rather just play that, even without the skateboarding and biking.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "ubisoft connect, unskipable intro and game cant run in borderless fullscreen or full screen. terrible optimization.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Of course they added dirtbikes just to get more money, and i mean get more money not because of active player, but because they made dirtbikes cost money. You cant say your going to add a long waited item into a game and then make it cost money.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "In the game page, it says ''compatible with your PS5 controller'', guess what? it doesnt",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It does everything, but it doesn't do it well. Jack of all trades, master of none. \n\nFirst to be clear, you're given a Bike, Ski, Wingsuit, and I think a snowboard? I haven't found that yet. The game has depth in terms of what you CAN do. But there's better Bike games. Better snowboarding games. And better games that they've released as DLC. [skateboarding]. If you're looking or into one of these sports, I'd just recommend getting a game focused on that. It'd be cheaper than buying all the DLC and you're not dealing with UBISOFT.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The game has a great concept and could be really interesting, but the execution is disappointing. The UI is extremely confusing, and the whole game feels messy. There are way too many bugs and glitches, and even the controls are poorly designed. It’s hard to enjoy or get immersed in the races when everything feels so unpolished. Overall, it’s just a frustrating experience.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Returned. This game is awful. It is a culmination of every extreme sport game that has ever existed but dumbed down to the point i can't find any enjoyment in it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game was great back in 2022 when I first got it and there was so much to do but now in 2025 ubisoft has filled it with microtransactions and there was a update that change all the keybinding and speaking of keybinding changing finding the stuff you want to change like the \"jump\" is hard to find. The gameplay itself its kinda bad back in 2022 when I played then there were so many races with differents types of races and if you did those you can unlock more bikes and gear but these days theres no races (unless I am stupid) and everything is already unlocked except the \"cool\" gear like skate boards and motor bikes. So buy at your own risk if your only idea is to explore the world which is not that big",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "This game is for children, none of the physics make sense and the animations are rushed. Then there’s the Ubisoft account activation and their extremely low quality customer service who will ignore every issue you have. Steam will also deny a refund when you start a new Ubisoft account.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Edit : I thought I bought the whole game (bought all DLCs on steam), but the game contains a prohibitively expensive in-game currency. 20€ to be able to use longskates !!! what a rip off.\n\ncool game, but the fact it has actually 4 jump buttons, each of which initiating different rotation directions, does make absolutely no sense.\n\"You gonna get used to it\", yep, as I can get used to a foreign keyboard to write in my own language : it still sucks.\nI'm surprised there is absolutely no real alternative option to this. Every other controller scheme is actually a variation of this.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ridiculous issue — the game refuses to launch. All I get is: ‘Windows cannot access the specified device, path, or file…’ I’ve reinstalled Steam, moved the game, verified files, tried every fix possible, and NOTHING works. This needs to be fixed ASAP",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I HATE THIS GAME I WANT TO SMASH MY MONITOR I FREAKING HATE THE MASS RACES WHY AM I IN 40TH I WAS IN 1ST TWO MINUTES AGO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Crashes when trying to get to main menu.\n\ni've reinstalled battleye 2 times. and cleared temp twice.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "seems like a fun game till you hit the paywalls\n\nthanks ubisoft!",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I CAN´T PLAY THIS GAME WITH MY CONTROLLER. ITS NOT LETTING ME I WANT TO CONNECT IT. NOT WORKING 😡 .",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought it for the skate portion.... BRUHHHH it's so clunky and slow... I then tried to other sports and it's just as bad. To me it felt like a mobile game ported to PC. \n\nI bought it on sale at 90% off and even then I refunded it anyways. Not even worth the 10$",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "The concept itself & Singleplayer are fine but multiplayer is not well thought through and all updates dont make it different",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "It's actually my fav game despite everything \r\nBut every time I click on continue it crashes \r\nI'm not the only person many people are facing this problem \r\n\r\nWell... Bad really bad ubisoft",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "my ps5 duelsense controller is not working but it is conected pls help",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Terrible controls, terrible performance, glitches, no QOL.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "All of the cool features are paywalled, Don't waste your time.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "no use of buying the game \r\nwhen you have to pay more just to play it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If this was a bit less pay to win then maybe id consider keeping this game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "complete edition is not complete",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Doesn't start its just one big scam",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "terrible cant use any controller",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Cant get the activation key.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "nie mogłem wejśc w gre",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "fun game",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "WHERE THE F**K IS CD KEY? YOU USELESS COMPANY",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "game sucks very much have to pay for every bit of everything because of the greedy jew devs and owner so they can get the 100,000 dollar bonus and go on a 2 month bora bora vacation. video games fucking suck ass now zero creativity, subscription games created by jews, laggy, unfinished, and copying fortnite because they suck at innovation. video games are so bad literally no one will play them in future. how about you guys pay the consumer for having us pay for your microtransactioned game. do i have to convert to being israel for these microtransactions to go away? no i have to be a transgender.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Ubisoft malware",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Ubisoft greedy af",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "shit ui",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "no",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Riders Republic could’ve been amazing — the gameplay, the visuals, the variety of sports — all of it feels genuinely fun. But Ubisoft just couldn’t resist stuffing it with microtransactions. 😒\n\nYou literally have to buy more stuff just to enjoy parts of the game properly. It’s packed with paywalls, cosmetics, and constant reminders to spend more money. Like seriously, why do I have to keep paying after already buying the game?\n\nIt’s sad because the core game is actually really good, but Ubisoft’s obsession with monetization ruins the experience.\nWTF Ubisoft, stop turning great games into cash-grab machines.\n\nRating: ★★☆☆☆ (2/5)",
      "voted_up": false,
      "votes_helpful": 184
    }
  ]
}