{
  "positive": [
    {
      "review": "So right off the bat the game is rough around the edges. \nGraphics - feel like they are really outdated though they make it look amazing in videos and artwork. If you are someone that can tolerate a slightly outdated feel then go for it.\nPerformance - has improved quite alot since launch, less laggy and buggy, though towns have serious FPS drops as well as if you are in your house for some reason. \nEnemies and story these really aren't the main focus, enemies re-spawn and are static for the most part. If you have played black dessert or any such game you will know what am talking about. This has potential in other areas, the loot and rewards you get from boss battles, Arenas, PVE and PVP battles, Ranking system they all feel like i want to come back., they feel like they carry weight. The farming and breeding of animals and a live market system all make it a game worth trying. \n\nin short - rough around the edges, not the best looking, but if you can overlook some of these aspects and love MMORPG mechanics you will really enjoy this game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "This game has huge potential! It's a fully fleshed out MMO Sandbox with lots and lots to do and a huge, beautiful world to explore. The devs are very active and making updates and patches often and they listen to the player base, which is refreshing. \nThat being said, it's early access and still has lots of bugs and is a bit grindy for my taste. I hope they get everything fixed and balanced because I'd like to go back and play at some point. \nIf you don't mind a grind and dealing with bugs, you'll probably like this game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Considering it's still a work in progress, I have to say it has just about everything I could want in an MMO. Since the devs said there's not going to be a wipe it's worth playing while they polish this out.  It's got more content then ashes and pantheon and even released pax. From a PVE only perspective it's great, couldn't tell you about PVP, I don't care for that in any game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most fun I have had on an MMO in a very long time! The DEV team are responsive and a great group. The Community is great and growing by the day. I love the mechanics. Map is huge. Tweaks and updates are frequent. The bones of this game are shaping up to be on par with AAA mmorpg. The map is huge! There are both idle and active mechanics. I can't say enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "A really fulfilling game, so much to do and such a bright future ahead of it. It is in Development so it is not finished but I love their direction and their communication with players in Out of This World !!! Cannot say enough nice things about them and I pray they succeed in all their Plans. Wonderful Company !!! Breath of Fresh air !!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really like the game. I know once it ready it will ne a 10/10 game for sure.  Mounts, boats, farming, then actual farm land. The game play is cool but still in first phase. The game should get better over time once its fully ready.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really fun Game ! Lots to do and a fun world. A mix of Black Desert Online and other MMOs. They really got creative and added every element they could into the game. I think they have something here... !!!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Best MMORPG ever, i like classic medieval, no power ranger armor and weapons. Good work system. No pay to win. Nice configuration like the character size customize and graphics. I liked so much this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "not bad better with each update needs better control remapping",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun for where it's at in Early Access. Has ambition and seems that Developers care about the game. Try the game out, but don't expect a finished game, because it has room to grow. Not bad for the price, so give it a try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "got good bones so far. a little more polish and more people will love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is challenging but still simple enough to keep me intersted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While many of the bad reviews are somewhat valid, I have been enjoying this one. It may not be in line with the current standard but The game world is huge, the combat may be a bit clumsy but not awful and I really like the classless system. The fact that your class depends on what weapon you're currently holding and the rest of your gear is entirely up to you is a nice touch that allows for a greater range of play styles.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "ITS GOOD BUT NEED TEAM TO HAVE LOTS OF FUN",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's neither bad nor fantastic.\nWell, it's a friendly community and a lot of fun to play for $2. Ignore all the criticism of this game; simply play it and judge for yourself if it's good or not.\n\nRate this 6/10",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "very fun to play, there is good character designing, they have 2 servers, one is PvE and one is PvP",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "So right off the bat the game is rough around the edges. \nGraphics - feel like they are really outdated though they make it look amazing in videos and artwork. If you are someone that can tolerate a slightly outdated feel then go for it.\nPerformance - has improved quite alot since launch, less laggy and buggy, though towns have serious FPS drops as well as if you are in your house for some reason. \nEnemies and story these really aren't the main focus, enemies re-spawn and are static for the most part. If you have played black dessert or any such game you will know what am talking about. This has potential in other areas, the loot and rewards you get from boss battles, Arenas, PVE and PVP battles, Ranking system they all feel like i want to come back., they feel like they carry weight. The farming and breeding of animals and a live market system all make it a game worth trying. \n\nin short - rough around the edges, not the best looking, but if you can overlook some of these aspects and love MMORPG mechanics you will really enjoy this game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Would I recommend this game? Honestly, yes, it is fun for what it is, you actually feel as if you can live in the world. The cash shop is very reasonably priced, which is refreshing to see. I honestly didn't mind buying a couple cosmetics to support the game! \n\nI don't understand why MMO studios don't either listen to their community or hire a consultant that has been actually playing MMOs for 25-30 years to advise on changes and fixes. I told another MMO what they could do to fix their game and now they are no longer around. It ended just the way I told them it would.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It’s a fun game, even though it’s still in early access. Despite that, I have to say it’s genuinely enjoyable and might just surprise you. The game features seasons and dynamic environments that change over time, creating unique and engaging gameplay experiences. Like most MMOs, the game also encourages progression through grinding, but the ever-changing world helps keep the experience engaging rather than repetitive.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "it's a pretty fun game, there's A LOT to get done. and if you ever come across any bugs/problems contacting the DEV's shows amazing results. They've been able to fix or accommodate every situation i've had so far.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game has huge potential! It's a fully fleshed out MMO Sandbox with lots and lots to do and a huge, beautiful world to explore. The devs are very active and making updates and patches often and they listen to the player base, which is refreshing. \nThat being said, it's early access and still has lots of bugs and is a bit grindy for my taste. I hope they get everything fixed and balanced because I'd like to go back and play at some point. \nIf you don't mind a grind and dealing with bugs, you'll probably like this game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I really love this game and all the things i can do in it. The life skill system is one of the things i enjoy the most . It is a well thought out game and the team listens to its player base. They have been on top of fixing things that have been reported and are always looking for ways to improve the game :) \r\n\r\nNishaBlackrose",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game has become incredibly addictive as a PVE/PVP project. But I have to play with a sunbeam bug; I can't see anything because of the brightness. I'm asking for this to be fixed. I've written about it on the forum, but no one's saying anything.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game concept. However, needs more tweaks to do specially on high lands. Would like to request for unstuck button had to delete one character because of that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Form your own opinion!  ~  This game is great, super addicting. Has more under the hood then 90% of MMO's out there. The grind is unorthodox and enjoyable, the market is completely player run and quite volatile even with the average steam charts player counts being 1,000 -/+ nightly.\r\nFeels like playing a seamless blend of some of the best games in the genre but somehow the amalgamation is not a mishmash and feels properly interwoven.\r\nDevz are actively updating the game and optimizing. I have steered completely clear of what other's have said about this game because it does seem they were promised one thing as an early access and the release wasn't up to par in their eyes. Still I can't help but speak for how complex and layered the many interdependencies of this games systems and economy make it what New World should have been and more.\r\nCheck it out for yourself!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Janky but good with lots to do.\r\n\r\nYou have to play the tutorial and mainstory quests to unlock systems; like housing, farming, sailing, caravan trading, resource gathering, ect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is actually quite good! I bought the game at launch and played for a month or so, took a break for a bit and came back a little while ago and I have seen HUGE improvements in the game! It is one of the largest game worlds I think that I've ever seen, and it's FULL of content and things to explore! Open world bosses to conquer, open world dungeons, instanced dungeons, treasure chests scattered all throughout the world to find as well as treasure rooms with even more loot, TONS of professions and trade skills to master, in depth and intricate crafting system, and even the potential to build a home!! This game is LOADED with things to do, and TONS of different ways to play and enjoy the game! Very active and engaging community as well! The PVP in this game is also fantastic! There's open world PVP to be had as well as actual PVP matches like capture the flag, conquest, kill count, etc. This game is not developed by a huge team/studio, and yet even still, they have managed to create a VERY lively game world to explore in one of the most difficult genres to create a game within! On top of all of that, they are INCREDIBLY engaging with their player base and the community in regards to bug notices, suggestions, complaints, Q&A, and anything else! Many of the updated changes that have come to the game ever since launch have in fact been suggestions made by the very player base! This game deserves recognition, and this game has IMMENSE potential in becoming something even more magical and amazing than it already is now in early access! I don't write reviews very often, but this game TRULY deserves the positive feedback, as it has certainly earned that feedback in my eyes. This game has SO much to see and do and explore and adventure, that you will NEVER find yourself with nothing to do. It reminds me a lot of OSRS (Old School Runescape) in the way there are so many different trade skills and professions to master and level up, but modernized with better graphics and MUCH more engaging combat! Speaking of which, the combat is fantastic as well! It is a fantastic blend of action combat with tab targeting in regards to using spells from your hotbar while also \"auto attacking\" (holding left click). The game is so full of content and things to do, and they're just getting started! I think I'll be here for a while, and I greatly look forward to the future of The Quinfall ^_^",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love this game! i only have maybe 13 hours in the game so take my opinion with a grain of salt but it to me has a lot to offer and is for sure a grind., now if you are not one for big grindy games i would not recommend but if you like the grind and the payoff from it then i absolutely say get this especially while it is on sale, otherwise has a lot going for it hopefully the devs keep updating it because it has a lot of promise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The absolute best game i've ever touched. I've tried many other open worlds and rpg and even mmorpgs. New World was one of my favs, but since the devs got laid off and the servers are shutting down me and other players alike felt stranded without another game to capture the new world like feeling\r\nthis game is that.\r\n\r\nalthough its still early development, the team is extremely helpful, active and willing to give teasers and updates on their game. They listen to support tickets and take advice from their players, new or vets.\r\n\r\n-huge open world\r\n-hunting, skinning, gathing, mining, eploration\r\n-underwater combat and other systems being added\r\n-pirate ships, trading ships and caravans\r\n-so much content to sink your teeth into\r\n-small playerbase as of now, but please. give it a try and you will NOT regret it\r\n-cool cosmetics \r\n-not money hungry for anything, but you can buy helpful things\r\nthe game is worth way more than the 10$ that is is noramlly, this feels like a 50$ game that they discounted for no reason other than the fact the people who made it are extremely nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first time entered this game I thought \"this is what I want\" but in midgame I started realizing that I coudn't get enough experence to grow up. After that the game became too boring for me, but early and mid game experence was great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Considering it's still a work in progress, I have to say it has just about everything I could want in an MMO. Since the devs said there's not going to be a wipe it's worth playing while they polish this out.  It's got more content then ashes and pantheon and even released pax. From a PVE only perspective it's great, couldn't tell you about PVP, I don't care for that in any game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most fun I have had on an MMO in a very long time! The DEV team are responsive and a great group. The Community is great and growing by the day. I love the mechanics. Map is huge. Tweaks and updates are frequent. The bones of this game are shaping up to be on par with AAA mmorpg. The map is huge! There are both idle and active mechanics. I can't say enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "เกมมีแนวทางใหญ่มาก แต่รอเค้าทำเสร็จ น่าจะเป็นเกมที่ดีเอาเรื่อง แถมราคาถูกมาก 60 บาทเองตอนลด !! สุโค่ย.. 🎁",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First off of course it has more work to be done, however what is here so far is not bad at all, I myself have not experience any game breaking bugs so far. I would highly recommend picking this up for the 2$ sale while you can. If your the kind of person that cant stand anything outside of multi million dollar AAA quality games than stay away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems pretty good so far.  A lot of systems that other games don't have, like ships, farming, etc.   World map seems huge and so far no major bugs that I can see.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Qunifall plays like a MMO of old. There are huge grinds to achieve the goals of progress. In some cases, it might not be for the feint of heart. However, if you are willing to put in the time to progress, what you will find in this game is a community of players, devs, and community service managers willing to help you if you reach out to them and put forth the effort on your own. It doesn't mean your ever request will be granted by any of them, but my experience has been great. If you are polite and try, eventually someone will answer those questions, help you level, group up with you, and invite you to their clan. Technically speaking our group is small, and we haven't went out of our way to interact outside of our current clan and small group of friends. What I can say, is the few times I have, it was certainly met with kind, helpful individuals. Like any game in today's world, I suspect you'll encounter the occasional troll, but there is really no avoiding that. I have watched the devs and their community service listen to the player base, I've also had amazing experiences with the few times I've needed to put in a ticket on their discord for in game issues. The Quinfall reminds me so much of the challenge, grind, and community I missed so much from my early days of playing EverQuest. Several of our group have really been enjoying what The Quinfall has to offer, and I am certainly looking forward to watching it grow and what other changes, challenges, and adventures it might have to offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As of 10/18/25, I've only played Quinfall for almost 5 hours.\nI have to say that despite how much grief this game has gotten - which is pretty valid since this game has some bugs, glitches, and issues that need addressing - it's still a pretty decent game overall.\n\nThe combat system is great. It's very modern and up to date with some of the combat moves I've seen in other games recently.\nHowever, it doesn't feel smooth or realistic. The turning is too fast, sudden, and janky. The lock-on system isn't 100% accurate and some of the attacks for the dual-wield axes need some work or at least not feel so Black Desert Online in design.\nMaybe if the developers look towards Assassin's Creed Valhalla and Guild Wars 2 for inspiration on that, it would maybe be better in the long run.\nThe gathering of resources is great, there's some glitching with the tree meshes and textures when they transition from 3 dots to 2 dots. But i'm not sure if this is just me or something else entirely.\nI'm not sure if we can use the resources we gather to build our very own house or claim a territory like we can in Once Human. But if we can, that would be fantastic since I love resource gathering and building when i can and if's an option.\nAnother thing that I would like to see is possibly some voice acting. At least for the major quest-giving NPC's and maybe our player character making comments/observations of the world as they explore it. Full-fledged cutscenes? No. For that, i will play my BioWare and Witcher games and call it done.\n\nMy number one pet peeve about this game is this - the textures and meshes are not optimized as well as they should be. And there are some graphical assets that need adjusting to make it easier for those on lower-end PC's to possibly play the game too.\nI'm not saying this to be whiny or anything. My desktop gaming PC meets the minimum and recommended specs for Quinfall and yet I'm only getting an average of 20FPS *maximum* in *ALL* areas of the starter zone so far at level 29. And that is been a problem for me on medium, high, ultra, and epic graphical settings.\nFor those who are curious about my specs:\nAMD Ryzen 7 8700F 8-Core Processor (4.10 GHz)\nNvidia Geforce RTX 5090 Ti (8GB vram) graphics card\n16GB DDR5 RAM\n1920x1080 native resolution via TV screen w/VSync turned on\nIf the devs can do what they can with the engine they're using to fully optimize their textures, meshes, and everything else, that would be fantastic. Because I should not be getting only 20FPS when I should be getting at least twice that while playing the game.\n\nDespite my own personal issues with my game/playthrough, Quinfall has a lot of potential to be a great MMORPG or multplayer game in general.\nIt's still in it's early access phase, so there is a lot of room for improvement until the devs are confident and comfortable enough to release Quinfall in it's 100% entirety.\nI'm leaving this as a thumb's up for now because of that. and I hope that this review helps any others that are looking to play Quinfall for the first time like myself :).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite good. I wont lie there is some quality of life improvements and refinement to do, a bit more to flesh out in a few areas but as they say the bones are good it's reasonably immersive with a bit of a old school UO vibe blended with modern designs some mechanics remind me of Neverwinter. I am impressed with the variety of housing options from instanced to not. I hope they continue to improve this game, it's definitely not a finished polished product yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All in all its not bad game. Yes there are some quirks but worth a play.  The only issue i have ran into is a mission on the board says get frog skins, i killed about 35 frogs and didn't get one skin off one. which you could say don't sound bad until you try and kill a frog.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Its a rough start like all mmorpgs learning the system and learning the game but it is a blast to get into i would highly recommend it and with all the new stuff they keep adding its making it better and better ive played alot of mmorpgs and this is def going to be top 4 for a while..",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I have logged over 500 hours thus far to the game. \nI have not seen a single RMT spamming chat.\nI have not seen a single cheat or hack taking place but that does not mean its not possible. \nIf you show me 1 game that does not have someone cheating in it I will show you a liar. Just honest.\nLeveling is slow solo past 50 but if you want to level fast join a clan bottom line.\nCurrency can be gained quickly but requires time and risk and that part is up to you.\nThere is no customer ticket system at this time but hope one will come soon enough.\nUpdates have seemed frequent since I have had 2 so far in 3 weeks.\nAssets free or not from the cash shop being sold in the game is again your choice. I don't see an issue with it as you are purchasing it to display on your toon and nothing else. It is however better than one being able to add their own custome asset and making a nude toon.\n\nWe all have our opinions of games some alighn with others but it is currently $2 so if you are afraid to lose that much money you probably shouldn't be playing games in the first place.\n\nThe translation system in the game is nice as no matter your language it seems to translate for others of other languages supported by the system.\n\nI update my reviews based off my findings and am 100% honest like it or not.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "My overall experience with the game is positive, but the insults and profanity I came across in the Steam reviews were discouraging. The fact that such content is still visible inevitably affects how I perceive the game. I believe there should be some form of moderation to foster a healthier community.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Okay, so I want you to keep in mind that this game is early access.\n\nThe graphics are relatively polished, but I will say that frame rate drops as you *lower* the detail settings, which is weird.  The sound's pretty decent, but I turn off the music so I can't gauge that.\n\nThe people on the PvE servers are super friendly, but you will see some convivial shit-talking amongst the PvP-ers.\n\nThe arena for PvP is currently a little dead.\n\nI am a hoarder and sorter in MMO's.  I like gathering, crafting, killing enemies and accumulating wealth.  \n\nThe game doesn't really have a fully fleshed-out loot table system yet.  They're still working on it from what I can tell.\n\nThey've set up a loot drop system for fishing and an afk system for the same gathering profession, but not for any others. \n\nThe crafting, from what I can tell, can ALL be done AFK and you get experience for each thing that you're doing as long as you're within proximity to the crafting station, and if you have an altar set up (real easy to get), you get xp from that as well.\n\nMy real, HUGE main beef with anything in this game is - while you can remap damn near all keys - you cannot remap INTERACT.\n\nI'm a traditionalist that was raised whenever keyboards were being established (yeah, I'm old).  I use ESDF like both God AND Satan intended, bless both of their souls.\n\nBefore anyone responds to, \"Just use WASD, it's what every other game uses\".  No it doesn't.  Damn near all games have that as a default, sure, but if they allow you to remap keys, they have the forethought to allow remapping of the interact key.\n\nImagine being in a PvP arena and you have a flower near the enemy, but you're trying to roll past them and instead you just start picking up the flower.\n\nNow, realize that there are gatherable things EVERYWHERE.\n\nImagine how many things are stopping you from dodging or even moving at all.  (Apparently the 'F' key is also a secondary interact, so moving right also does the same thing).\n\nTowns are full of interactable NPCs, but I can't get to the merchant 'cause a kid is walking by and I start talking to her.  I can only move left using 'S' or backwards using 'D'.\n\nEvery day, I'm shufflin' (to the left).\n\nThat's my biggest complaint for now, but the added difficulty will make me a monster in the arena when they fix it.  I've learned to dodge plants as well as people in order to survive.  I can spot a dot from a click away.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "A really fulfilling game, so much to do and such a bright future ahead of it. It is in Development so it is not finished but I love their direction and their communication with players in Out of This World !!! Cannot say enough nice things about them and I pray they succeed in all their Plans. Wonderful Company !!! Breath of Fresh air !!!",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really like the game. I know once it ready it will ne a 10/10 game for sure.  Mounts, boats, farming, then actual farm land. The game play is cool but still in first phase. The game should get better over time once its fully ready.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "Really fun Game ! Lots to do and a fun world. A mix of Black Desert Online and other MMOs. They really got creative and added every element they could into the game. I think they have something here... !!!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "When I first joined *The Quinfall* universe, what impressed me most were its stunning graphics and massive open world. As I progressed, discovering new regions and creatures kept amazing me. The ship interactions, ocean and sea physics, the way your character’s hair moves with the wind, and the beautifully crafted four-season system that even affects your character — everything is incredibly well thought out.\r\n\r\nIt’s not pay-to-win, which I absolutely love. You can just grab small red packages for a modest monthly cost if you want to save some time. It’s a true MMO experience where you can enjoy looting, crafting, and taking part in different events with your friends in a vast, living world.\r\n\r\nDefinitely a game I’d recommend to anyone looking to unwind and escape daily stress for a while. I’ve spent countless hours playing it, and I’ll keep playing for many more.\r\n\r\nHuge thanks to *The Quinfall* family and dev team for creating such an amazing experience.\r\nSpecial thanks to R****** <3",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Best MMORPG ever, i like classic medieval, no power ranger armor and weapons. Good work system. No pay to win. Nice configuration like the character size customize and graphics. I liked so much this game.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "I think the character creation is neat, lots of options, tattoo's, eye's including cat and serpent pupils, that sorta thing. It definitely needs different ears added, like various elf type ears and such, i was really disappoint when i couldnt find any way to change my ears, considering you can look reptilian with skin texture or even cat like with strips and such, but there is no option (that i could see) to give cat ears, rabbit ears, elf ears, that was VERY odd to me, considering the amount of options for other things. Maybe in the game you can get something like headgear which is ears and it covers your human ears im not sure, my PC couldnt run the game and unfortunately i had to refund, which sucked cos i was looking forward to playing an MMORPG, i havent played one in years and years. If in the future i get a new PC i will 100% purchase the game again, but i'd definitely like to see an option to make the female jaw not so wide and heavy looking, and to see options for ears like rabbit and elf specifically that would be great. the 113 minutes playtime i have is purely customisation of my character, so as you can imagine 2hours in character creation, its quite the fun creation",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Pretty solid little game. Chill MMO with some fun customization",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "The game is genuinely enjoyable, but I felt quite uncomfortable while reading the comments on Steam. It's unfortunate to see so much profanity and aggressive language. I'm not sure whether it's the developers' or Steam's responsibility to moderate such content, but the lack of action leaves a negative impression of the player community.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "not bad better with each update needs better control remapping",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Fun for where it's at in Early Access. Has ambition and seems that Developers care about the game. Try the game out, but don't expect a finished game, because it has room to grow. Not bad for the price, so give it a try.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "there so many to add and improve. \ncombat, skills effect, gems & talisman set variation effect (few of them have a similliar effect). singapore server a bit laggy with 180ms.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Use Referral ID 65931855 to get a free 1000 V coin for the shop. It's a fun place to be, having a lot of fun there, a lot u can do, from farming to being out on the open waters",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Sostegno solo per essere in italiano.  Il gioco ha bisogno di tempo ma nel complesso può essere giocato. A solo 2€ vale la pena per il sostegno. Forza",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I will update it later... I had problem fith Grafik settings but after some changes I fied it. \n\nSo i will do a review later. Let see what the game is :-)",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "I like it, combat needs to be slowed down, more cohesive and UI scaled down for enemy HP bars and we might cook up something",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game makes you feel like your spine is turning into mulch. 10/10 would quinfall again",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Love the open world.....The game has came a looong way.....Worth the money!!!!!",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "got good bones so far. a little more polish and more people will love it.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It is challenging but still simple enough to keep me intersted.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "While many of the bad reviews are somewhat valid, I have been enjoying this one. It may not be in line with the current standard but The game world is huge, the combat may be a bit clumsy but not awful and I really like the classless system. The fact that your class depends on what weapon you're currently holding and the rest of your gear is entirely up to you is a nice touch that allows for a greater range of play styles.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Since i am unable to remove the recommend this game and post a review from my steam game page i will say the game is not bad,\n but Steam forcing people to fill out a review sucks donkey balls",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "crafting is great ! haven,t really been in too many battles still getting use to it but liking it so far.. cant wait to get on the ships and breed horses :)",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome. It might not be completely finished but in all seriousness here there is plenty of content to keep a casual or even active player busy and it's early access so there's only more to come out. I spent over 500+ hours on similar games (New World) and in my honest opinion this game is a great starting point to what feels like it could just be better than NW.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is awesome, lots of farming, animal husbandry, fighting, ship and caravan trades. A nice market place, friendly people. Graphics are great. I definitely recommend! Great support on discord too! they helped me twice so far... a game im going to play for a long time and the update coming are really nice !",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "gREAT starter game for new ppl for any Level",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Good MMO.  For a beta, very few bugs.  Can't wait for more content.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Has potential my buddies are hooked so i will play more this weekend. 7/10 Keep going Dev's",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "ITS GOOD BUT NEED TEAM TO HAVE LOTS OF FUN",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Very good game",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "gg",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "It's neither bad nor fantastic.\nWell, it's a friendly community and a lot of fun to play for $2. Ignore all the criticism of this game; simply play it and judge for yourself if it's good or not.\n\nRate this 6/10",
      "voted_up": true,
      "votes_helpful": 14
    },
    {
      "review": "very fun to play, there is good character designing, they have 2 servers, one is PvE and one is PvP",
      "voted_up": true,
      "votes_helpful": 12
    },
    {
      "review": "So right off the bat the game is rough around the edges. \nGraphics - feel like they are really outdated though they make it look amazing in videos and artwork. If you are someone that can tolerate a slightly outdated feel then go for it.\nPerformance - has improved quite alot since launch, less laggy and buggy, though towns have serious FPS drops as well as if you are in your house for some reason. \nEnemies and story these really aren't the main focus, enemies re-spawn and are static for the most part. If you have played black dessert or any such game you will know what am talking about. This has potential in other areas, the loot and rewards you get from boss battles, Arenas, PVE and PVP battles, Ranking system they all feel like i want to come back., they feel like they carry weight. The farming and breeding of animals and a live market system all make it a game worth trying. \n\nin short - rough around the edges, not the best looking, but if you can overlook some of these aspects and love MMORPG mechanics you will really enjoy this game.",
      "voted_up": true,
      "votes_helpful": 5
    },
    {
      "review": "Would I recommend this game? Honestly, yes, it is fun for what it is, you actually feel as if you can live in the world. The cash shop is very reasonably priced, which is refreshing to see. I honestly didn't mind buying a couple cosmetics to support the game! \n\nI don't understand why MMO studios don't either listen to their community or hire a consultant that has been actually playing MMOs for 25-30 years to advise on changes and fixes. I told another MMO what they could do to fix their game and now they are no longer around. It ended just the way I told them it would.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "It’s a fun game, even though it’s still in early access. Despite that, I have to say it’s genuinely enjoyable and might just surprise you. The game features seasons and dynamic environments that change over time, creating unique and engaging gameplay experiences. Like most MMOs, the game also encourages progression through grinding, but the ever-changing world helps keep the experience engaging rather than repetitive.",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "it's a pretty fun game, there's A LOT to get done. and if you ever come across any bugs/problems contacting the DEV's shows amazing results. They've been able to fix or accommodate every situation i've had so far.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "This game has huge potential! It's a fully fleshed out MMO Sandbox with lots and lots to do and a huge, beautiful world to explore. The devs are very active and making updates and patches often and they listen to the player base, which is refreshing. \nThat being said, it's early access and still has lots of bugs and is a bit grindy for my taste. I hope they get everything fixed and balanced because I'd like to go back and play at some point. \nIf you don't mind a grind and dealing with bugs, you'll probably like this game.",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "I really love this game and all the things i can do in it. The life skill system is one of the things i enjoy the most . It is a well thought out game and the team listens to its player base. They have been on top of fixing things that have been reported and are always looking for ways to improve the game :) \r\n\r\nNishaBlackrose",
      "voted_up": true,
      "votes_helpful": 6
    },
    {
      "review": "The game has become incredibly addictive as a PVE/PVP project. But I have to play with a sunbeam bug; I can't see anything because of the brightness. I'm asking for this to be fixed. I've written about it on the forum, but no one's saying anything.",
      "voted_up": true,
      "votes_helpful": 2
    },
    {
      "review": "Great game concept. However, needs more tweaks to do specially on high lands. Would like to request for unstuck button had to delete one character because of that.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "Form your own opinion!  ~  This game is great, super addicting. Has more under the hood then 90% of MMO's out there. The grind is unorthodox and enjoyable, the market is completely player run and quite volatile even with the average steam charts player counts being 1,000 -/+ nightly.\r\nFeels like playing a seamless blend of some of the best games in the genre but somehow the amalgamation is not a mishmash and feels properly interwoven.\r\nDevz are actively updating the game and optimizing. I have steered completely clear of what other's have said about this game because it does seem they were promised one thing as an early access and the release wasn't up to par in their eyes. Still I can't help but speak for how complex and layered the many interdependencies of this games systems and economy make it what New World should have been and more.\r\nCheck it out for yourself!",
      "voted_up": true,
      "votes_helpful": 4
    },
    {
      "review": "Janky but good with lots to do.\r\n\r\nYou have to play the tutorial and mainstory quests to unlock systems; like housing, farming, sailing, caravan trading, resource gathering, ect.",
      "voted_up": true,
      "votes_helpful": 1
    },
    {
      "review": "This game is actually quite good! I bought the game at launch and played for a month or so, took a break for a bit and came back a little while ago and I have seen HUGE improvements in the game! It is one of the largest game worlds I think that I've ever seen, and it's FULL of content and things to explore! Open world bosses to conquer, open world dungeons, instanced dungeons, treasure chests scattered all throughout the world to find as well as treasure rooms with even more loot, TONS of professions and trade skills to master, in depth and intricate crafting system, and even the potential to build a home!! This game is LOADED with things to do, and TONS of different ways to play and enjoy the game! Very active and engaging community as well! The PVP in this game is also fantastic! There's open world PVP to be had as well as actual PVP matches like capture the flag, conquest, kill count, etc. This game is not developed by a huge team/studio, and yet even still, they have managed to create a VERY lively game world to explore in one of the most difficult genres to create a game within! On top of all of that, they are INCREDIBLY engaging with their player base and the community in regards to bug notices, suggestions, complaints, Q&A, and anything else! Many of the updated changes that have come to the game ever since launch have in fact been suggestions made by the very player base! This game deserves recognition, and this game has IMMENSE potential in becoming something even more magical and amazing than it already is now in early access! I don't write reviews very often, but this game TRULY deserves the positive feedback, as it has certainly earned that feedback in my eyes. This game has SO much to see and do and explore and adventure, that you will NEVER find yourself with nothing to do. It reminds me a lot of OSRS (Old School Runescape) in the way there are so many different trade skills and professions to master and level up, but modernized with better graphics and MUCH more engaging combat! Speaking of which, the combat is fantastic as well! It is a fantastic blend of action combat with tab targeting in regards to using spells from your hotbar while also \"auto attacking\" (holding left click). The game is so full of content and things to do, and they're just getting started! I think I'll be here for a while, and I greatly look forward to the future of The Quinfall ^_^",
      "voted_up": true,
      "votes_helpful": 3
    },
    {
      "review": "I love this game! i only have maybe 13 hours in the game so take my opinion with a grain of salt but it to me has a lot to offer and is for sure a grind., now if you are not one for big grindy games i would not recommend but if you like the grind and the payoff from it then i absolutely say get this especially while it is on sale, otherwise has a lot going for it hopefully the devs keep updating it because it has a lot of promise",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The absolute best game i've ever touched. I've tried many other open worlds and rpg and even mmorpgs. New World was one of my favs, but since the devs got laid off and the servers are shutting down me and other players alike felt stranded without another game to capture the new world like feeling\r\nthis game is that.\r\n\r\nalthough its still early development, the team is extremely helpful, active and willing to give teasers and updates on their game. They listen to support tickets and take advice from their players, new or vets.\r\n\r\n-huge open world\r\n-hunting, skinning, gathing, mining, eploration\r\n-underwater combat and other systems being added\r\n-pirate ships, trading ships and caravans\r\n-so much content to sink your teeth into\r\n-small playerbase as of now, but please. give it a try and you will NOT regret it\r\n-cool cosmetics \r\n-not money hungry for anything, but you can buy helpful things\r\nthe game is worth way more than the 10$ that is is noramlly, this feels like a 50$ game that they discounted for no reason other than the fact the people who made it are extremely nice",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "When I first time entered this game I thought \"this is what I want\" but in midgame I started realizing that I coudn't get enough experence to grow up. After that the game became too boring for me, but early and mid game experence was great!",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Considering it's still a work in progress, I have to say it has just about everything I could want in an MMO. Since the devs said there's not going to be a wipe it's worth playing while they polish this out.  It's got more content then ashes and pantheon and even released pax. From a PVE only perspective it's great, couldn't tell you about PVP, I don't care for that in any game.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This is the most fun I have had on an MMO in a very long time! The DEV team are responsive and a great group. The Community is great and growing by the day. I love the mechanics. Map is huge. Tweaks and updates are frequent. The bones of this game are shaping up to be on par with AAA mmorpg. The map is huge! There are both idle and active mechanics. I can't say enough.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "เกมมีแนวทางใหญ่มาก แต่รอเค้าทำเสร็จ น่าจะเป็นเกมที่ดีเอาเรื่อง แถมราคาถูกมาก 60 บาทเองตอนลด !! สุโค่ย.. 🎁",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "First off of course it has more work to be done, however what is here so far is not bad at all, I myself have not experience any game breaking bugs so far. I would highly recommend picking this up for the 2$ sale while you can. If your the kind of person that cant stand anything outside of multi million dollar AAA quality games than stay away.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "Seems pretty good so far.  A lot of systems that other games don't have, like ships, farming, etc.   World map seems huge and so far no major bugs that I can see.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "The Qunifall plays like a MMO of old. There are huge grinds to achieve the goals of progress. In some cases, it might not be for the feint of heart. However, if you are willing to put in the time to progress, what you will find in this game is a community of players, devs, and community service managers willing to help you if you reach out to them and put forth the effort on your own. It doesn't mean your ever request will be granted by any of them, but my experience has been great. If you are polite and try, eventually someone will answer those questions, help you level, group up with you, and invite you to their clan. Technically speaking our group is small, and we haven't went out of our way to interact outside of our current clan and small group of friends. What I can say, is the few times I have, it was certainly met with kind, helpful individuals. Like any game in today's world, I suspect you'll encounter the occasional troll, but there is really no avoiding that. I have watched the devs and their community service listen to the player base, I've also had amazing experiences with the few times I've needed to put in a ticket on their discord for in game issues. The Quinfall reminds me so much of the challenge, grind, and community I missed so much from my early days of playing EverQuest. Several of our group have really been enjoying what The Quinfall has to offer, and I am certainly looking forward to watching it grow and what other changes, challenges, and adventures it might have to offer.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "As of 10/18/25, I've only played Quinfall for almost 5 hours.\nI have to say that despite how much grief this game has gotten - which is pretty valid since this game has some bugs, glitches, and issues that need addressing - it's still a pretty decent game overall.\n\nThe combat system is great. It's very modern and up to date with some of the combat moves I've seen in other games recently.\nHowever, it doesn't feel smooth or realistic. The turning is too fast, sudden, and janky. The lock-on system isn't 100% accurate and some of the attacks for the dual-wield axes need some work or at least not feel so Black Desert Online in design.\nMaybe if the developers look towards Assassin's Creed Valhalla and Guild Wars 2 for inspiration on that, it would maybe be better in the long run.\nThe gathering of resources is great, there's some glitching with the tree meshes and textures when they transition from 3 dots to 2 dots. But i'm not sure if this is just me or something else entirely.\nI'm not sure if we can use the resources we gather to build our very own house or claim a territory like we can in Once Human. But if we can, that would be fantastic since I love resource gathering and building when i can and if's an option.\nAnother thing that I would like to see is possibly some voice acting. At least for the major quest-giving NPC's and maybe our player character making comments/observations of the world as they explore it. Full-fledged cutscenes? No. For that, i will play my BioWare and Witcher games and call it done.\n\nMy number one pet peeve about this game is this - the textures and meshes are not optimized as well as they should be. And there are some graphical assets that need adjusting to make it easier for those on lower-end PC's to possibly play the game too.\nI'm not saying this to be whiny or anything. My desktop gaming PC meets the minimum and recommended specs for Quinfall and yet I'm only getting an average of 20FPS *maximum* in *ALL* areas of the starter zone so far at level 29. And that is been a problem for me on medium, high, ultra, and epic graphical settings.\nFor those who are curious about my specs:\nAMD Ryzen 7 8700F 8-Core Processor (4.10 GHz)\nNvidia Geforce RTX 5090 Ti (8GB vram) graphics card\n16GB DDR5 RAM\n1920x1080 native resolution via TV screen w/VSync turned on\nIf the devs can do what they can with the engine they're using to fully optimize their textures, meshes, and everything else, that would be fantastic. Because I should not be getting only 20FPS when I should be getting at least twice that while playing the game.\n\nDespite my own personal issues with my game/playthrough, Quinfall has a lot of potential to be a great MMORPG or multplayer game in general.\nIt's still in it's early access phase, so there is a lot of room for improvement until the devs are confident and comfortable enough to release Quinfall in it's 100% entirety.\nI'm leaving this as a thumb's up for now because of that. and I hope that this review helps any others that are looking to play Quinfall for the first time like myself :).",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "This game is quite good. I wont lie there is some quality of life improvements and refinement to do, a bit more to flesh out in a few areas but as they say the bones are good it's reasonably immersive with a bit of a old school UO vibe blended with modern designs some mechanics remind me of Neverwinter. I am impressed with the variety of housing options from instanced to not. I hope they continue to improve this game, it's definitely not a finished polished product yet.",
      "voted_up": true,
      "votes_helpful": 0
    },
    {
      "review": "All in all its not bad game. Yes there are some quirks but worth a play.  The only issue i have ran into is a mission on the board says get frog skins, i killed about 35 frogs and didn't get one skin off one. which you could say don't sound bad until you try and kill a frog.",
      "voted_up": true,
      "votes_helpful": 0
    }
  ],
  "negative": [
    {
      "review": "I came into The Quinfall really hoping to have fun, but honestly, it ended up being pretty disappointing. The game looks like it has potential, but actually playing it is a different story.\n\nPerformance is rough. I’ve got decent hardware, and the game still stutters constantly. Lag spikes, rubber-banding, random disconnects — all of it makes combat and exploration feel annoying instead of exciting. Half the time it feels like I’m fighting the game itself, not the enemies.\n\nThe world is big, sure, but it doesn’t feel alive. A lot of the areas just look the same, NPCs barely react to anything, and the quests are basically “go here, kill that, collect this” on repeat. It gets old really fast.\n\nCombat needs a lot of work too. The animations are slow and don’t line up with hits, and abilities just don’t feel satisfying. Either enemies melt instantly or suddenly chunk your health in one hit — there’s barely any middle ground. It just comes off as clunky and unbalanced.\n\nAnd honestly, the community side doesn’t help either. From my experience, the GMs and staff on Discord can be pretty harsh. It sometimes feels like if you ask the wrong question or give any criticism, you can get warned or muted out of nowhere. It gives off a vibe that you’re not really welcome unless you’re just praising the game.\n\nOn top of everything, the UI feels messy, menus are awkward, and a lot of systems seem half-finished. It just doesn’t feel ready yet.",
      "voted_up": false,
      "votes_helpful": 28
    },
    {
      "review": "There's no game worse than this one. It's a dying game that's got no future. Development is horrible with no proper road map. They try to get people to write good reviews to overwrite the past ones... War system sucks. People can get points for not actually fighting anyone with three people showing up. People up top that actually fight will lose points and always get stuck in some shit position. Game is boring. Alot of jank and no logic to anything. Highly not recommend this game. Just skip and don't waste your time because this game and their developers will waste yours. Please do not let the positive reviews deceive you. You can see how many hours i've played and i've tried to give it a chance... 1000+ hrs has PROVEN that this game is not worth it. Don't waste your life like i did. Please.",
      "voted_up": false,
      "votes_helpful": 18
    },
    {
      "review": "worst mmorpg ever made, horrible quality. all the gameplay videos are a scam.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "The gathering system, skill system, and level system need to be fixed and improved. Participation in PVP events that keep players engaged in the game is very low. If you want to wander around aimlessly, gather resources, and take in the scenery, then you can play. PVE events are average. After a while, they stop being enjoyable and start to get boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "korkunç rezalet bir oyun elim kolum bağlı olsa daha iyi yapardım aq",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Given that the game is early access and I was able to get it for relatively cheap on-sale I would say I got what I paid for.  Game has a lot of future potential but given the current state of things be prepared to struggle solo in the early game especially with certain classes. Combat and Crafting don't seem to match the leveling experience yet and most of the interesting gameplay or challenges will require you to group up which isnt always easy to do early on.  That being said if you can look past the rough edges and spend alot of time grinding Experience on crafting and gathering then you might find yourself with a lot to do as both are very expansive in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "dead game...dont buy",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's Black Desert with even less soul. Early access, pay to play and already filled the microtransaction bikini store. Hah",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "This is buy far one of the most garbage game I have ever lost money too. It is a scam DO NOT BUY",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I do not recommend this game, and here’s why.\n\nFirst off, the game looks good, but it’s very copy paste. Huge open landscapes with nothing really going on. Monsters only exist in camps, which you get sent to on missions. Outside of that, there’s basically nothing, and crafting is a massive grind.\n\nAnimals outside of camps only exist for skinning. They give no loot, no XP, so they’re just filler. Monsters that are 7–8 levels below you also give no XP and no loot, which forces you to only fight tougher monsters at your own level. That would be fine if combat and progression were balanced, but it’s not, you end up leveling, falling behind on gear, and constantly playing catch up.\n\nThen there’s PvP, which is already broken. There are cash shop upgrade items that can pump weapons to nearly 700% base damage. That’s killed PvP completely. Melee can’t do anything while ranged players just run away and spam animations.\n\nTravel is another pain point. Teleporting around the map is ridiculously expensive. Any gold you earn just gets chewed up on travel. There’s no cheaper city to city option,just one flat high cost. On top of that, warehouses/banks aren’t connected between towns, so you’re stuck paying even more just to move your stuff around constantly.\n\nThe game definitely has potential, but in its current Early Access state, it’s nowhere near there. Even at $2, I’d say pass. Oh, and character creation? Pretty lackluster.\n\nP.S  their discord mod thinks he is royalty in his own kingdom. Condescending and really a bad show for their team. Horrible. Game is made to be played as somewhat large parties, but there's no playerbase.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "most of the good reviews feel the need to add they bought the game 90% off (worth it for $2)\nhow can you honestly recommend it knowing that's not the real price?\n\nafter 2 weeks you will be forced to spend 15 bucks a month to keep your inventory and exp rates anyway\n\nhidden subscriptions like this are just awful\n\ni liked my 60 hours and wanted to play more but the game itself falls real flat after level 50-60",
      "voted_up": false,
      "votes_helpful": 86
    },
    {
      "review": "I was actually going to add a positive review with a recommendation. This game looks a bit like a mix of BDO and New World, but it looked like the devs were doing everything right, that New World was doing wrong. This game did have the potential to be what New World promised; a modern MMO for everybody who enjoys a good MMORPG. And, it appeared that the devs followed the success formula of Black Desert Online and Albion Online and offer so many things to do, that you must pick a few to get good at or suck at everything.\r\n\r\nIt is early access, but after the latest couple of updates it is becoming apparent that the devs have lost focus on what made this project very promising for everybody who enjoys a good MMORPG to begin with. \r\n\r\nThe devs listen too much to the very vocal minority of the gear-vs-gear end-game crowd and I am afraid that Quinfall is on the same path down the toilet as New World. \r\n\r\nJust like New World, the concept of Quinfall was sold as being a sandbox for everybody. Right now, the focus is exclusively on the corner with the gear-vs-gear players, who cry if there are not enough plastic shovels, sieves, and buckets for them to be constantly entertained (read new dungeons, better gear drops, more trinkets and glitter, higher level ceilings, expansions, and more, more, more).\r\n\r\nThe game has been in early access for 8 months and the tables with profession rankings show that there should be plenty of skilled crafters for a healthy supply of both mid and high level gear on the auction house. Yet, there is not. Either those who reached level 70 (before the patch) did so as a means to their gear-vs-gear end-game or they burned out and left the game. Those of us life-skillers grinding away at the crafting skills did not provide that gear, because we were not yet able to. The solution? Drops of high level gear to satisfy the gear-vs-gear players, which was a slap in the face for those of us who wasted our time on crafting professions. So, the devs fixed the wrong hole and created another to bleed players.\r\n\r\nIn addition to making crafting pointless, the gear drops can be recycled and you get high-level materials, so no point in being a gatherer either. The game is still early access and they have already increased the max character level! Pretty soon, you will be able to start a new character at level 100; then you just have to grind a few levels before you can start spending money on enhancing your end-game gear drops.\r\n\r\nSuch a sad waste of potential.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I've been playing MMORPGs for years, but I've never seen such a disappointing game. We wanted to support it because it’s Turkish-made, but it’s full of unnecessary cliques and guild favoritism. Without a team or friends, it’s almost unplayable. There’s no proper GM support either. Just because we don’t have a group doesn’t mean we deserve to be treated like this. It’s really disheartening",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "This is just Black desert online but the cheap knockoff version thats extremely unpolished.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "I came into The Quinfall really hoping to have fun, but honestly, it ended up being pretty disappointing. The game looks like it has potential, but actually playing it is a different story.\n\nPerformance is rough. I’ve got decent hardware, and the game still stutters constantly. Lag spikes, rubber-banding, random disconnects — all of it makes combat and exploration feel annoying instead of exciting. Half the time it feels like I’m fighting the game itself, not the enemies.\n\nThe world is big, sure, but it doesn’t feel alive. A lot of the areas just look the same, NPCs barely react to anything, and the quests are basically “go here, kill that, collect this” on repeat. It gets old really fast.\n\nCombat needs a lot of work too. The animations are slow and don’t line up with hits, and abilities just don’t feel satisfying. Either enemies melt instantly or suddenly chunk your health in one hit — there’s barely any middle ground. It just comes off as clunky and unbalanced.\n\nAnd honestly, the community side doesn’t help either. From my experience, the GMs and staff on Discord can be pretty harsh. It sometimes feels like if you ask the wrong question or give any criticism, you can get warned or muted out of nowhere. It gives off a vibe that you’re not really welcome unless you’re just praising the game.\n\nOn top of everything, the UI feels messy, menus are awkward, and a lot of systems seem half-finished. It just doesn’t feel ready yet.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "What a terrible game this is. Its literally Black Desert from Temu. \n\nThe combat is AWFUL, its so terribly bad, its by far the worst part of the game. Clunky hitboxes, skills that dont work as expected and just the general clunkiness of it, at least I remember that BDOs combat was satisfying which is why i stuck with it until i got to the insane grind. But this game doesnt even have fun combat to save it. I even got into a 10-19 level arena, with 3 other people and we just ran around in the capture circle for 6 minutes or however long it lasts, trying to kill each other and fail because of how terrible the combat is, skills barely do any damage and the hitboxes are laughably bad.\n\nAnother thing is Graphics, the game has this awful smear/blur that I couldn't remove no matter the settings I used, it was worse the Higher the settings were.\n\nThis is a chore MMO, its an inferior version of BDO, both of these games are terrible in my opinion but if you are gonna play either of those I'd suggest BDO as the combat is 100x better, it has a bigger playerbase and some better QoL features like being able to minimize the game in the system tray(essentially almost close it in terms of resource usage) when doing automated tasks, which I couldn't find here.\n\nI wouldn't mind most of it if the combat was at least fun to engage with but even for $1.95 i dont think its worth it in this state.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Devs are all over the road, has no direction. PTW to star your weapons, endless grind crafting with nearly Zero point. Zero content that is engaging. \nPvP used to be pretty fun but now is just meh. \nGood luck to the devs but the game is not worth the time sink.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "There's no game worse than this one. It's a dying game that's got no future. Development is horrible with no proper road map. They try to get people to write good reviews to overwrite the past ones... War system sucks. People can get points for not actually fighting anyone with three people showing up. People up top that actually fight will lose points and always get stuck in some shit position. Game is boring. Alot of jank and no logic to anything. Highly not recommend this game. Just skip and don't waste your time because this game and their developers will waste yours. Please do not let the positive reviews deceive you. You can see how many hours i've played and i've tried to give it a chance... 1000+ hrs has PROVEN that this game is not worth it. Don't waste your life like i did. Please.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "First of all i understand the game is early access, But this is the early access of the early access, the game is very laggy on the lowest settings for me who has a good PC, and there is a mission to repair a weapon at the start but i can't, (Meaning i got no option to repair a weapon and the blacksmith wont say anything either) and something that disturbs me the MOST.... Drumrolls please (imagine drum rolls here) *thanks :)* i can't press ESC to go to main menu, i have to press CTRL AND THEN be able to go to the menu.. WHAT IS THAT",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "1. Unable to trade with a friend, unable to share housing without setting up a clan. \n2. Rushed to level 50, given handouts all the way but at level 50 it becomes very clear that you need to craft beyond that level. Why do this instead of crafting all the way from the start.\n3. Hated the gambling on leveling equipment way to many fails.\n4.No information about what anything does and very little to nothing on the internet.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "do not waste your time or money. even at $2.99 its not worth it. this game had alot of potential at first, but updates over the past few months made it worse. its not a sandbox mmo and people need to stop calling it one. you can no longer level your character by doing professions (you can if you want to progress in a year) your only way to hit level cap is to grind mobs. and not just any mobs. your forced to find a way to an island, join a group and hope they are decent and grind lvl 110 party mobs to level. clan wars are a joke now. you must have 3 people in your clan and they must show up or you automatically loose the match. no more solo clans. the same 2 clans trade places taking the number 1 spot getting all the rewards to keep them in the top. New Players will never be able to catch up to older players with the recent changes. they have items called tera that \"protect\" your gear from being destroyed but theres only 4 ways to get them. 1) 4% chance of it dropping from world bosses (so they say) but after doing over 100 world bosses and not getting 1 drop. its not believable. 2) buy them from action coin store for 30k action coins (takes days to get from doing dungeons) 3) olympiad wars which is the 1v1 version of clan wars (same person has won it every time) or 4) buy it with $10 through the in game store. they are worthless. staring gear from 3 to 4 stars is a 80% success rate yet it fails 3 times in a row destroying the tera. devs know theres an issue but instead keep selling it to take your money. the \"combat\" update has been coming for months now. based on current player gains/losses every month this game wont make it past the first of the year. player base down to 800 peak and 400 active at a time. but these number are accross all 3 servers. NA, EU, and ASIA WITH OVER 60% OF THOSE NUMBER BEING EU. the games direction is dictated by the top clans and the community supporters. dont take my word for it though. just join the quinfall discord and read it all for yourselves.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst mmorpg ever made, horrible quality. all the gameplay videos are a scam.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "To start, I've only played for a short while, the crafting system system is good, but otherwise this seems like a large scale prettier yet somehow underwhelming version of Guild Wars 2, except instead of classes having their abilities determined by weapon choices, it's just the weapons themselves, there are no class combos per se.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hey everyone,\nTo be honest, we have to give some credit to the developers — the game isn’t fully released yet, and it’s understandable that it still has a lot of bugs and issues.\nBut in my opinion, most of these problems should have been fixed even before the beta version went live.\n\nThe combat system is really disappointing compared to the trailers and graphics we saw before release, especially the PvP fights — they feel clunky and unresponsive.\n\nPvE camps are extremely repetitive and boring.\nThe game isn’t optimized at all.\nIt’s full of bugs — and I mean a lot of them.\n\nFor example, when you die, the game gives you 20 seconds to be revived, but you completely die at second 11.\nAnd that’s one of the smallest bugs I’ve seen!\n\nEven if we assume the bugs will be fixed later, the bigger issue is that both PvP and PvE systems feel really bad — they only look cool because of two decent animations, but the core mechanics are just awful.\n\nI don’t regret buying the game, because I truly believe it can be improved one day.\nI just hope it happens soon — because right now, the game is losing a lot of players, and that’s basically the beginning of its death.\n\nIt’s really not in a good state.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't think these people leaving positive reviews have actually played video games before. Saying it's the most beautiful game ever. I have the game on max settings and looks like garbage. It's like the sun is 5 feet from the planet. Also most the words are in Engrish.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Play this game the controls are weird and the game play is rough to play with and its not very well optimized for and MMO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible graphics, no targeting system so range is useless. Melee heavy game with only one weapon style worth having. Terrible pvp, cant even move and attack, you have to sit still to use attacks. I dont recommend this game currently.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is beautiful no doubt and I wish I could play it but the minimum and recommended system requirements are not correct even one bit. It runs horrible on my RX580 on both 1080 and 1440p and even lower resolutions ! I'm getting on average 25-30 FPS no matter what graphic settings or resolutions I set. Also I tested it on my Lenovo Legion Go handheld and the same story there. \n\nI tried it some time ago and I had constant crashes that seem to be fixed now but decided to buy it on this account as well and try it out but I wasn't pleasantly surprised still many performance issues. \nI can't recommend the game at this stage, however if the performance is fixed that would be great.\n\nEDIT: For some reason the game only supports FSR1 Upscaling and FSR 2 is greyed out on both my setups, although it's 2025 and most games have FSR 3 even frame gen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah...\nI got this game when it was on sale for $2. I'm normally very forgiving but ngl, I feel very disappointed. Very unpolished. Maybe I'd try it again in the future when it gets polished. But, my first impression was so bad that there's very little chance that I'd try this again. \n\nDidn't even play for an hour but here was my very short experience...\n\n-Crashed when I first logged in\n-Very crappy customization page. Just why does it look like that. I've seen better ui in crappier games\n-The voice wasn't even trying to hide that it was ai\n-The cutscene was buggy. It showed nothing at first and the narration wasn't matching when it actually showed the scenes\n-Game instantly dropped frames randomly when I finally started\n-Movement was slippery(not really a downside for me since I've tried worse, but it triggered me that the walking/running animation did not match and felt very stiff)\n-Combat needs more polish too\n-Combat also made it super laggy\n-Delay on dodging? I don't know if it was meant that way or if I was just really lagging but it takes like over 1 sec to dodge roll\n-Tutorial was a lot of clicking though it was nice that I can skip it all. But if I were a new gamer, it would've been so confusing \n-When i reached the first town... UNPLAYABLE\n\nI have a pc that can run games on ultra graphics. This shouldn't be unplayable for me. I'm sure there are others that is worth more of your time... at least until hopefully this game improves.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I gave this game a fair chance, but it sucks and is boring. The models that you can choose from for your character look like crap and there isn't much room for customization except war paint and tattoos. The graphics of the game look horrible. I had to change the contrast to -30 just to get it to not hurt my eyes. The tutorial was stupid. It had you choose weapons and get skill books for weapons before it had you test out all the weapons on the dummies. So I ended up getting Level 5 weapons and skill books for weapons that I found out that I did not want to use. There is no way to switch weapon sets. I wanted to soften and snipe enemies from the distance with a bow or mage staff and then do melee close up. But there is no hotkey to switch weapon sets. I had to open up the inventory and manually select the other weapon. But then I got a popup window that I could not close warning me that I can't use skills for over 1.5 minutes. And since I could not close the popup window in time, I kept taking damage from the enemy and almost died. I was considering switching weapons anyway and not using skills, but even after the 100th time of seeing that warning, it still forcing the popup window on you so it is impossible. You level up on weapons that you use. So if you waste time using the wrong weapon like I did, you will always waste skill points on that weapon. I finally decided on dual wielding axes, but then I got a quest that was supposed to give both daggers and axes. I took it, but it was like a one handed axe or hammer or something so it was a wasted quest. So here I was stuck with Level 1 axes or I could switch to Level 5 daggers but then all my experience would go onto my daggers. Okay, fine. Let's just forget about all of that. In the starter town, there are some enemies not too far. There was a rift and it was boring because it was just 20 or so enemies standing close together and you run up to them and try to kill the ones on the edges without aggroing the rest of them. But a few seconds after you kill one, they just respawn again. Which make the game really repetitive, low effort, and boring. And there was a training area with some orcs or something. I forgot what they were. They just stand really still so you can walk up to them and they won't attack you, even if you kill their friend right next to them. But then I had to go to the next town called Meadow and it was even worse. It was just a boring town with houses and nothing to do. I ran outside the town like 5 miles in every direction, and there was nothing but trees and grass and animals. And a couple of boring player farm houses. No enemies. No danger. Nothing. There literally is nothing good about this game. It is not even worth the $2 that I paid for it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game needs a lot of improvements on play style, it's so dull and not smooth. It felt like turn base RPG game. Also it has a lot of P2W dynamics on shop they are pretty expensive. It's have a great potential but it's too early to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "as the updates come out the game sucks even more anybody 100+ before the rule changes are fine but the rest have a big disadvantage. Devs sunset this piece of shit.......",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I feel like this game has potential, but it's not nearly ready to play.  I could barely get through the tutorial area without bugs.  Got stuck in menus, game was stuttering, the ESC button doesn't even take you to the game menu (which is basically standard...).  \n\nI was excited to try this, but will wait a while to try again until they work out the bugs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately have to add to this review the very negative bits about this game, that takes a while to show through.\nCheating is rampant, worse it's with the game developers consent, if not outright help, for a certain section. \nRead any comments, you will soon find one thing in common, you mention cheating in the game, they ban you, I have been permanently banned from the Quin discussion groups on Steam, because I told a cheating scumbag to shut the f up\n\nThey will not do anything to curb the cheating, only Lip service, there have dozens I know of, banned from their Discord, plus steam forums for mentioning this.\n\nPvP, people cannot die (Alivin)  where this is clearly evident (no I did not take part)\n\nPeople have billions in the game, all from cheating, so wrecks the market to something stupid.\n\nInvisible players, AFK resources farming by players, speed movement, players using hacks, list goes on and on.\n\nWorse is they openly talk about it, reported, got muted\n\nI may still carry on playing, as not much else out there's, will never take part in any of the events, if you don't cheat, forget trying!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "feels bad, plays bad, very clunky un-optimized UI.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tbh I can see myself trying the game again if they do a combat overall, my first sec of combat told me a lot about how it will feel to fight in this game, for now i only hope with time they change that",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately I couldn't even get far enough to play. On my ultra wide screen, the Save button to update the display settings is hidden and you cannot scroll down far enough to use it, and hitting Enter doesn't apply the settings either. Without being able to adjust the UI, half of it is off the screen and therefore unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gathering system, skill system, and level system need to be fixed and improved. Participation in PVP events that keep players engaged in the game is very low. If you want to wander around aimlessly, gather resources, and take in the scenery, then you can play. PVE events are average. After a while, they stop being enjoyable and start to get boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Boring Unity assetflip\" game, not worth the $2 sale price. Give it a year or two for them to make the game better before buying it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this when it was 2 euro on a sale and still don't know if it was worth it.\r\n\r\nVery grindy with QoL (like more inventory space) locked behind a paywall. And you'll need a lot of space if you want to level all the crafting skills.\r\n\r\nStarted as a \"mage\"(staff user, no classes but weapons determin the skills you can use) and it feels very underwhelming. I usually just use heavy attack since it does more damage than my spells. Slow cooldowns and high mana cost don't make it more enjoyable... Combat feel weird as well, not helped by the over the shoulder view. As a ranged player, I need to look down to hit enemies that are standing next to me or I'll shoot over them.\r\n\r\nTried healer (life staff) for a bit and wanted to run around and help people but since your spells don't effect them unless you're in a party together I dropped it.\r\n\r\nQoL features like crafting from storage, a search/filter option when crafting or looking in your bank (bank doesn't have a sort function either), or a pop-up of how many items you have total when you hover over it or want to turn it in for rewards are highly needed as well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want buy this \"Game\", buy only when it will be discount. Its not whorth the cost. Devs is promise that all be fine and fix all, but that will not happen because they goal is get fast money, nothing more... sad...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THE WORST MMORPG THAT I EVER PLAYED . DONT EVEN BUY ON SALE. THEY NEED TO PAY US TO PLAY THIS GARBAGE. TOTAL TRASH. 100% COPY PASTE OF BDO NEW WORLD AND ARCHEAGE. LIKE FOR REAL. EVEN THE BROWSER MMORPGS ARE MUCH BETTER. PEOPLE THAT PLAY THIS GOT BRAIN DAMAGE 100%",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would like my money back. Game is confusing, empty world experience and full of monogomy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "korkunç rezalet bir oyun elim kolum bağlı olsa daha iyi yapardım aq",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do you want to play an uglier, completely worse feeling version of New World?  If so then my first question is, \"What si wrong with you?\" and my second statement would be, \"then this pile of crap is perfect for you\".  Even at $1.99, I don't know if there is much here to offer.  It's boring, directionless; completely unpolished and just not worth supporting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the combat really needs work, attacks go past the enemy and there is no lock to anyone you choose to fight, the camera shakes due to character movement during combat with the camera shake turned off.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Given that the game is early access and I was able to get it for relatively cheap on-sale I would say I got what I paid for.  Game has a lot of future potential but given the current state of things be prepared to struggle solo in the early game especially with certain classes. Combat and Crafting don't seem to match the leveling experience yet and most of the interesting gameplay or challenges will require you to group up which isnt always easy to do early on.  That being said if you can look past the rough edges and spend alot of time grinding Experience on crafting and gathering then you might find yourself with a lot to do as both are very expansive in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Steam:\nHow long will this game be in Early Access?\n\"We expect Early Access to last about 6 months. However, this may change depending on feedback from our players.\"\n\nSUCK MY DICK!\n\nConfused name (in some languages the same coal is called a plant, and I won't even mention the villagers. \"Headman\" - a child running around)\nNon-working/uncleaned quests\nNon-working/uncleaned items\nTerrible balance in PvP (especially archers shooting for all visibility)\n\nAnd a bunch of other crap that SHOULD NOT BE HERE if we're talking about EA, which should have ended ALREADY!\n\nP.s. Oh, and yeah.. just crazy gluttony for video memory. Here you need 16 GB, not 8",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just went P2W. If you want to upgrade your equipment be prepared to spend 30$ a week\nGear upgrades that fail destroy your equipment. It doesn't lower the stars there is no way to repair it. Your gear is gone.\nTo prevent this from happening you have to pay for protection.\n\nLike what?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "load of rubbish, doesnt work on steam deck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Money drain through vstore. Less than 300 players at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dead game...dont buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is dead and is on a down hill with player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's Black Desert with even less soul. Early access, pay to play and already filled the microtransaction bikini store. Hah",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I do not recommend this game, and here’s why.\n\nFirst off, the game looks good, but it’s very copy paste. Huge open landscapes with nothing really going on. Monsters only exist in camps, which you get sent to on missions. Outside of that, there’s basically nothing, and crafting is a massive grind.\n\nAnimals outside of camps only exist for skinning. They give no loot, no XP, so they’re just filler. Monsters that are 7–8 levels below you also give no XP and no loot, which forces you to only fight tougher monsters at your own level. That would be fine if combat and progression were balanced, but it’s not, you end up leveling, falling behind on gear, and constantly playing catch up.\n\nThen there’s PvP, which is already broken. There are cash shop upgrade items that can pump weapons to nearly 700% base damage. That’s killed PvP completely. Melee can’t do anything while ranged players just run away and spam animations.\n\nTravel is another pain point. Teleporting around the map is ridiculously expensive. Any gold you earn just gets chewed up on travel. There’s no cheaper city to city option,just one flat high cost. On top of that, warehouses/banks aren’t connected between towns, so you’re stuck paying even more just to move your stuff around constantly.\n\nThe game definitely has potential, but in its current Early Access state, it’s nowhere near there. Even at $2, I’d say pass. Oh, and character creation? Pretty lackluster.\n\nP.S  their discord mod thinks he is royalty in his own kingdom. Condescending and really a bad show for their team. Horrible. Game is made to be played as somewhat large parties, but there's no playerbase.",
      "voted_up": false,
      "votes_helpful": 77
    },
    {
      "review": "most of the good reviews feel the need to add they bought the game 90% off (worth it for $2)\nhow can you honestly recommend it knowing that's not the real price?\n\nafter 2 weeks you will be forced to spend 15 bucks a month to keep your inventory and exp rates anyway\n\nhidden subscriptions like this are just awful\n\ni liked my 60 hours and wanted to play more but the game itself falls real flat after level 50-60",
      "voted_up": false,
      "votes_helpful": 86
    },
    {
      "review": "I was actually going to add a positive review with a recommendation. This game looks a bit like a mix of BDO and New World, but it looked like the devs were doing everything right, that New World was doing wrong. This game did have the potential to be what New World promised; a modern MMO for everybody who enjoys a good MMORPG. And, it appeared that the devs followed the success formula of Black Desert Online and Albion Online and offer so many things to do, that you must pick a few to get good at or suck at everything.\r\n\r\nIt is early access, but after the latest couple of updates it is becoming apparent that the devs have lost focus on what made this project very promising for everybody who enjoys a good MMORPG to begin with. \r\n\r\nThe devs listen too much to the very vocal minority of the gear-vs-gear end-game crowd and I am afraid that Quinfall is on the same path down the toilet as New World. \r\n\r\nJust like New World, the concept of Quinfall was sold as being a sandbox for everybody. Right now, the focus is exclusively on the corner with the gear-vs-gear players, who cry if there are not enough plastic shovels, sieves, and buckets for them to be constantly entertained (read new dungeons, better gear drops, more trinkets and glitter, higher level ceilings, expansions, and more, more, more).\r\n\r\nThe game has been in early access for 8 months and the tables with profession rankings show that there should be plenty of skilled crafters for a healthy supply of both mid and high level gear on the auction house. Yet, there is not. Either those who reached level 70 (before the patch) did so as a means to their gear-vs-gear end-game or they burned out and left the game. Those of us life-skillers grinding away at the crafting skills did not provide that gear, because we were not yet able to. The solution? Drops of high level gear to satisfy the gear-vs-gear players, which was a slap in the face for those of us who wasted our time on crafting professions. So, the devs fixed the wrong hole and created another to bleed players.\r\n\r\nIn addition to making crafting pointless, the gear drops can be recycled and you get high-level materials, so no point in being a gatherer either. The game is still early access and they have already increased the max character level! Pretty soon, you will be able to start a new character at level 100; then you just have to grind a few levels before you can start spending money on enhancing your end-game gear drops.\r\n\r\nSuch a sad waste of potential.",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "I've been playing MMORPGs for years, but I've never seen such a disappointing game. We wanted to support it because it’s Turkish-made, but it’s full of unnecessary cliques and guild favoritism. Without a team or friends, it’s almost unplayable. There’s no proper GM support either. Just because we don’t have a group doesn’t mean we deserve to be treated like this. It’s really disheartening",
      "voted_up": false,
      "votes_helpful": 32
    },
    {
      "review": "This is just Black desert online but the cheap knockoff version thats extremely unpolished.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "I came into The Quinfall really hoping to have fun, but honestly, it ended up being pretty disappointing. The game looks like it has potential, but actually playing it is a different story.\n\nPerformance is rough. I’ve got decent hardware, and the game still stutters constantly. Lag spikes, rubber-banding, random disconnects — all of it makes combat and exploration feel annoying instead of exciting. Half the time it feels like I’m fighting the game itself, not the enemies.\n\nThe world is big, sure, but it doesn’t feel alive. A lot of the areas just look the same, NPCs barely react to anything, and the quests are basically “go here, kill that, collect this” on repeat. It gets old really fast.\n\nCombat needs a lot of work too. The animations are slow and don’t line up with hits, and abilities just don’t feel satisfying. Either enemies melt instantly or suddenly chunk your health in one hit — there’s barely any middle ground. It just comes off as clunky and unbalanced.\n\nAnd honestly, the community side doesn’t help either. From my experience, the GMs and staff on Discord can be pretty harsh. It sometimes feels like if you ask the wrong question or give any criticism, you can get warned or muted out of nowhere. It gives off a vibe that you’re not really welcome unless you’re just praising the game.\n\nOn top of everything, the UI feels messy, menus are awkward, and a lot of systems seem half-finished. It just doesn’t feel ready yet.",
      "voted_up": false,
      "votes_helpful": 31
    },
    {
      "review": "What a terrible game this is. Its literally Black Desert from Temu. \n\nThe combat is AWFUL, its so terribly bad, its by far the worst part of the game. Clunky hitboxes, skills that dont work as expected and just the general clunkiness of it, at least I remember that BDOs combat was satisfying which is why i stuck with it until i got to the insane grind. But this game doesnt even have fun combat to save it. I even got into a 10-19 level arena, with 3 other people and we just ran around in the capture circle for 6 minutes or however long it lasts, trying to kill each other and fail because of how terrible the combat is, skills barely do any damage and the hitboxes are laughably bad.\n\nAnother thing is Graphics, the game has this awful smear/blur that I couldn't remove no matter the settings I used, it was worse the Higher the settings were.\n\nThis is a chore MMO, its an inferior version of BDO, both of these games are terrible in my opinion but if you are gonna play either of those I'd suggest BDO as the combat is 100x better, it has a bigger playerbase and some better QoL features like being able to minimize the game in the system tray(essentially almost close it in terms of resource usage) when doing automated tasks, which I couldn't find here.\n\nI wouldn't mind most of it if the combat was at least fun to engage with but even for $1.95 i dont think its worth it in this state.",
      "voted_up": false,
      "votes_helpful": 22
    },
    {
      "review": "Devs are all over the road, has no direction. PTW to star your weapons, endless grind crafting with nearly Zero point. Zero content that is engaging. \nPvP used to be pretty fun but now is just meh. \nGood luck to the devs but the game is not worth the time sink.",
      "voted_up": false,
      "votes_helpful": 16
    },
    {
      "review": "There's no game worse than this one. It's a dying game that's got no future. Development is horrible with no proper road map. They try to get people to write good reviews to overwrite the past ones... War system sucks. People can get points for not actually fighting anyone with three people showing up. People up top that actually fight will lose points and always get stuck in some shit position. Game is boring. Alot of jank and no logic to anything. Highly not recommend this game. Just skip and don't waste your time because this game and their developers will waste yours. Please do not let the positive reviews deceive you. You can see how many hours i've played and i've tried to give it a chance... 1000+ hrs has PROVEN that this game is not worth it. Don't waste your life like i did. Please.",
      "voted_up": false,
      "votes_helpful": 25
    },
    {
      "review": "First of all i understand the game is early access, But this is the early access of the early access, the game is very laggy on the lowest settings for me who has a good PC, and there is a mission to repair a weapon at the start but i can't, (Meaning i got no option to repair a weapon and the blacksmith wont say anything either) and something that disturbs me the MOST.... Drumrolls please (imagine drum rolls here) *thanks :)* i can't press ESC to go to main menu, i have to press CTRL AND THEN be able to go to the menu.. WHAT IS THAT",
      "voted_up": false,
      "votes_helpful": 13
    },
    {
      "review": "1. Unable to trade with a friend, unable to share housing without setting up a clan. \n2. Rushed to level 50, given handouts all the way but at level 50 it becomes very clear that you need to craft beyond that level. Why do this instead of crafting all the way from the start.\n3. Hated the gambling on leveling equipment way to many fails.\n4.No information about what anything does and very little to nothing on the internet.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "do not waste your time or money. even at $2.99 its not worth it. this game had alot of potential at first, but updates over the past few months made it worse. its not a sandbox mmo and people need to stop calling it one. you can no longer level your character by doing professions (you can if you want to progress in a year) your only way to hit level cap is to grind mobs. and not just any mobs. your forced to find a way to an island, join a group and hope they are decent and grind lvl 110 party mobs to level. clan wars are a joke now. you must have 3 people in your clan and they must show up or you automatically loose the match. no more solo clans. the same 2 clans trade places taking the number 1 spot getting all the rewards to keep them in the top. New Players will never be able to catch up to older players with the recent changes. they have items called tera that \"protect\" your gear from being destroyed but theres only 4 ways to get them. 1) 4% chance of it dropping from world bosses (so they say) but after doing over 100 world bosses and not getting 1 drop. its not believable. 2) buy them from action coin store for 30k action coins (takes days to get from doing dungeons) 3) olympiad wars which is the 1v1 version of clan wars (same person has won it every time) or 4) buy it with $10 through the in game store. they are worthless. staring gear from 3 to 4 stars is a 80% success rate yet it fails 3 times in a row destroying the tera. devs know theres an issue but instead keep selling it to take your money. the \"combat\" update has been coming for months now. based on current player gains/losses every month this game wont make it past the first of the year. player base down to 800 peak and 400 active at a time. but these number are accross all 3 servers. NA, EU, and ASIA WITH OVER 60% OF THOSE NUMBER BEING EU. the games direction is dictated by the top clans and the community supporters. dont take my word for it though. just join the quinfall discord and read it all for yourselves.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "worst mmorpg ever made, horrible quality. all the gameplay videos are a scam.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "To start, I've only played for a short while, the crafting system system is good, but otherwise this seems like a large scale prettier yet somehow underwhelming version of Guild Wars 2, except instead of classes having their abilities determined by weapon choices, it's just the weapons themselves, there are no class combos per se.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "Hey everyone,\nTo be honest, we have to give some credit to the developers — the game isn’t fully released yet, and it’s understandable that it still has a lot of bugs and issues.\nBut in my opinion, most of these problems should have been fixed even before the beta version went live.\n\nThe combat system is really disappointing compared to the trailers and graphics we saw before release, especially the PvP fights — they feel clunky and unresponsive.\n\nPvE camps are extremely repetitive and boring.\nThe game isn’t optimized at all.\nIt’s full of bugs — and I mean a lot of them.\n\nFor example, when you die, the game gives you 20 seconds to be revived, but you completely die at second 11.\nAnd that’s one of the smallest bugs I’ve seen!\n\nEven if we assume the bugs will be fixed later, the bigger issue is that both PvP and PvE systems feel really bad — they only look cool because of two decent animations, but the core mechanics are just awful.\n\nI don’t regret buying the game, because I truly believe it can be improved one day.\nI just hope it happens soon — because right now, the game is losing a lot of players, and that’s basically the beginning of its death.\n\nIt’s really not in a good state.",
      "voted_up": false,
      "votes_helpful": 3
    },
    {
      "review": "I don't think these people leaving positive reviews have actually played video games before. Saying it's the most beautiful game ever. I have the game on max settings and looks like garbage. It's like the sun is 5 feet from the planet. Also most the words are in Engrish.",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "Play this game the controls are weird and the game play is rough to play with and its not very well optimized for and MMO",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Terrible graphics, no targeting system so range is useless. Melee heavy game with only one weapon style worth having. Terrible pvp, cant even move and attack, you have to sit still to use attacks. I dont recommend this game currently.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game is beautiful no doubt and I wish I could play it but the minimum and recommended system requirements are not correct even one bit. It runs horrible on my RX580 on both 1080 and 1440p and even lower resolutions ! I'm getting on average 25-30 FPS no matter what graphic settings or resolutions I set. Also I tested it on my Lenovo Legion Go handheld and the same story there. \n\nI tried it some time ago and I had constant crashes that seem to be fixed now but decided to buy it on this account as well and try it out but I wasn't pleasantly surprised still many performance issues. \nI can't recommend the game at this stage, however if the performance is fixed that would be great.\n\nEDIT: For some reason the game only supports FSR1 Upscaling and FSR 2 is greyed out on both my setups, although it's 2025 and most games have FSR 3 even frame gen.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Nah...\nI got this game when it was on sale for $2. I'm normally very forgiving but ngl, I feel very disappointed. Very unpolished. Maybe I'd try it again in the future when it gets polished. But, my first impression was so bad that there's very little chance that I'd try this again. \n\nDidn't even play for an hour but here was my very short experience...\n\n-Crashed when I first logged in\n-Very crappy customization page. Just why does it look like that. I've seen better ui in crappier games\n-The voice wasn't even trying to hide that it was ai\n-The cutscene was buggy. It showed nothing at first and the narration wasn't matching when it actually showed the scenes\n-Game instantly dropped frames randomly when I finally started\n-Movement was slippery(not really a downside for me since I've tried worse, but it triggered me that the walking/running animation did not match and felt very stiff)\n-Combat needs more polish too\n-Combat also made it super laggy\n-Delay on dodging? I don't know if it was meant that way or if I was just really lagging but it takes like over 1 sec to dodge roll\n-Tutorial was a lot of clicking though it was nice that I can skip it all. But if I were a new gamer, it would've been so confusing \n-When i reached the first town... UNPLAYABLE\n\nI have a pc that can run games on ultra graphics. This shouldn't be unplayable for me. I'm sure there are others that is worth more of your time... at least until hopefully this game improves.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I gave this game a fair chance, but it sucks and is boring. The models that you can choose from for your character look like crap and there isn't much room for customization except war paint and tattoos. The graphics of the game look horrible. I had to change the contrast to -30 just to get it to not hurt my eyes. The tutorial was stupid. It had you choose weapons and get skill books for weapons before it had you test out all the weapons on the dummies. So I ended up getting Level 5 weapons and skill books for weapons that I found out that I did not want to use. There is no way to switch weapon sets. I wanted to soften and snipe enemies from the distance with a bow or mage staff and then do melee close up. But there is no hotkey to switch weapon sets. I had to open up the inventory and manually select the other weapon. But then I got a popup window that I could not close warning me that I can't use skills for over 1.5 minutes. And since I could not close the popup window in time, I kept taking damage from the enemy and almost died. I was considering switching weapons anyway and not using skills, but even after the 100th time of seeing that warning, it still forcing the popup window on you so it is impossible. You level up on weapons that you use. So if you waste time using the wrong weapon like I did, you will always waste skill points on that weapon. I finally decided on dual wielding axes, but then I got a quest that was supposed to give both daggers and axes. I took it, but it was like a one handed axe or hammer or something so it was a wasted quest. So here I was stuck with Level 1 axes or I could switch to Level 5 daggers but then all my experience would go onto my daggers. Okay, fine. Let's just forget about all of that. In the starter town, there are some enemies not too far. There was a rift and it was boring because it was just 20 or so enemies standing close together and you run up to them and try to kill the ones on the edges without aggroing the rest of them. But a few seconds after you kill one, they just respawn again. Which make the game really repetitive, low effort, and boring. And there was a training area with some orcs or something. I forgot what they were. They just stand really still so you can walk up to them and they won't attack you, even if you kill their friend right next to them. But then I had to go to the next town called Meadow and it was even worse. It was just a boring town with houses and nothing to do. I ran outside the town like 5 miles in every direction, and there was nothing but trees and grass and animals. And a couple of boring player farm houses. No enemies. No danger. Nothing. There literally is nothing good about this game. It is not even worth the $2 that I paid for it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The game needs a lot of improvements on play style, it's so dull and not smooth. It felt like turn base RPG game. Also it has a lot of P2W dynamics on shop they are pretty expensive. It's have a great potential but it's too early to play.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "as the updates come out the game sucks even more anybody 100+ before the rule changes are fine but the rest have a big disadvantage. Devs sunset this piece of shit.......",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "I feel like this game has potential, but it's not nearly ready to play.  I could barely get through the tutorial area without bugs.  Got stuck in menus, game was stuttering, the ESC button doesn't even take you to the game menu (which is basically standard...).  \n\nI was excited to try this, but will wait a while to try again until they work out the bugs.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Unfortunately have to add to this review the very negative bits about this game, that takes a while to show through.\nCheating is rampant, worse it's with the game developers consent, if not outright help, for a certain section. \nRead any comments, you will soon find one thing in common, you mention cheating in the game, they ban you, I have been permanently banned from the Quin discussion groups on Steam, because I told a cheating scumbag to shut the f up\n\nThey will not do anything to curb the cheating, only Lip service, there have dozens I know of, banned from their Discord, plus steam forums for mentioning this.\n\nPvP, people cannot die (Alivin)  where this is clearly evident (no I did not take part)\n\nPeople have billions in the game, all from cheating, so wrecks the market to something stupid.\n\nInvisible players, AFK resources farming by players, speed movement, players using hacks, list goes on and on.\n\nWorse is they openly talk about it, reported, got muted\n\nI may still carry on playing, as not much else out there's, will never take part in any of the events, if you don't cheat, forget trying!",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "feels bad, plays bad, very clunky un-optimized UI.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Tbh I can see myself trying the game again if they do a combat overall, my first sec of combat told me a lot about how it will feel to fight in this game, for now i only hope with time they change that",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Unfortunately I couldn't even get far enough to play. On my ultra wide screen, the Save button to update the display settings is hidden and you cannot scroll down far enough to use it, and hitting Enter doesn't apply the settings either. Without being able to adjust the UI, half of it is off the screen and therefore unplayable.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "The gathering system, skill system, and level system need to be fixed and improved. Participation in PVP events that keep players engaged in the game is very low. If you want to wander around aimlessly, gather resources, and take in the scenery, then you can play. PVE events are average. After a while, they stop being enjoyable and start to get boring.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "\"Boring Unity assetflip\" game, not worth the $2 sale price. Give it a year or two for them to make the game better before buying it.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Bought this when it was 2 euro on a sale and still don't know if it was worth it.\r\n\r\nVery grindy with QoL (like more inventory space) locked behind a paywall. And you'll need a lot of space if you want to level all the crafting skills.\r\n\r\nStarted as a \"mage\"(staff user, no classes but weapons determin the skills you can use) and it feels very underwhelming. I usually just use heavy attack since it does more damage than my spells. Slow cooldowns and high mana cost don't make it more enjoyable... Combat feel weird as well, not helped by the over the shoulder view. As a ranged player, I need to look down to hit enemies that are standing next to me or I'll shoot over them.\r\n\r\nTried healer (life staff) for a bit and wanted to run around and help people but since your spells don't effect them unless you're in a party together I dropped it.\r\n\r\nQoL features like crafting from storage, a search/filter option when crafting or looking in your bank (bank doesn't have a sort function either), or a pop-up of how many items you have total when you hover over it or want to turn it in for rewards are highly needed as well.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "If you want buy this \"Game\", buy only when it will be discount. Its not whorth the cost. Devs is promise that all be fine and fix all, but that will not happen because they goal is get fast money, nothing more... sad...",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "THE WORST MMORPG THAT I EVER PLAYED . DONT EVEN BUY ON SALE. THEY NEED TO PAY US TO PLAY THIS GARBAGE. TOTAL TRASH. 100% COPY PASTE OF BDO NEW WORLD AND ARCHEAGE. LIKE FOR REAL. EVEN THE BROWSER MMORPGS ARE MUCH BETTER. PEOPLE THAT PLAY THIS GOT BRAIN DAMAGE 100%",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "I would like my money back. Game is confusing, empty world experience and full of monogomy.",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "korkunç rezalet bir oyun elim kolum bağlı olsa daha iyi yapardım aq",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Do you want to play an uglier, completely worse feeling version of New World?  If so then my first question is, \"What si wrong with you?\" and my second statement would be, \"then this pile of crap is perfect for you\".  Even at $1.99, I don't know if there is much here to offer.  It's boring, directionless; completely unpolished and just not worth supporting.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "the combat really needs work, attacks go past the enemy and there is no lock to anyone you choose to fight, the camera shakes due to character movement during combat with the camera shake turned off.",
      "voted_up": false,
      "votes_helpful": 7
    },
    {
      "review": "Given that the game is early access and I was able to get it for relatively cheap on-sale I would say I got what I paid for.  Game has a lot of future potential but given the current state of things be prepared to struggle solo in the early game especially with certain classes. Combat and Crafting don't seem to match the leveling experience yet and most of the interesting gameplay or challenges will require you to group up which isnt always easy to do early on.  That being said if you can look past the rough edges and spend alot of time grinding Experience on crafting and gathering then you might find yourself with a lot to do as both are very expansive in the game.",
      "voted_up": false,
      "votes_helpful": 2
    },
    {
      "review": "Steam:\nHow long will this game be in Early Access?\n\"We expect Early Access to last about 6 months. However, this may change depending on feedback from our players.\"\n\nSUCK MY DICK!\n\nConfused name (in some languages the same coal is called a plant, and I won't even mention the villagers. \"Headman\" - a child running around)\nNon-working/uncleaned quests\nNon-working/uncleaned items\nTerrible balance in PvP (especially archers shooting for all visibility)\n\nAnd a bunch of other crap that SHOULD NOT BE HERE if we're talking about EA, which should have ended ALREADY!\n\nP.s. Oh, and yeah.. just crazy gluttony for video memory. Here you need 16 GB, not 8",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Just went P2W. If you want to upgrade your equipment be prepared to spend 30$ a week\nGear upgrades that fail destroy your equipment. It doesn't lower the stars there is no way to repair it. Your gear is gone.\nTo prevent this from happening you have to pay for protection.\n\nLike what?",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "load of rubbish, doesnt work on steam deck",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "Money drain through vstore. Less than 300 players at times.",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "dead game...dont buy",
      "voted_up": false,
      "votes_helpful": 1
    },
    {
      "review": "Game is dead and is on a down hill with player",
      "voted_up": false,
      "votes_helpful": 0
    },
    {
      "review": "It's Black Desert with even less soul. Early access, pay to play and already filled the microtransaction bikini store. Hah",
      "voted_up": false,
      "votes_helpful": 8
    },
    {
      "review": "I do not recommend this game, and here’s why.\n\nFirst off, the game looks good, but it’s very copy paste. Huge open landscapes with nothing really going on. Monsters only exist in camps, which you get sent to on missions. Outside of that, there’s basically nothing, and crafting is a massive grind.\n\nAnimals outside of camps only exist for skinning. They give no loot, no XP, so they’re just filler. Monsters that are 7–8 levels below you also give no XP and no loot, which forces you to only fight tougher monsters at your own level. That would be fine if combat and progression were balanced, but it’s not, you end up leveling, falling behind on gear, and constantly playing catch up.\n\nThen there’s PvP, which is already broken. There are cash shop upgrade items that can pump weapons to nearly 700% base damage. That’s killed PvP completely. Melee can’t do anything while ranged players just run away and spam animations.\n\nTravel is another pain point. Teleporting around the map is ridiculously expensive. Any gold you earn just gets chewed up on travel. There’s no cheaper city to city option,just one flat high cost. On top of that, warehouses/banks aren’t connected between towns, so you’re stuck paying even more just to move your stuff around constantly.\n\nThe game definitely has potential, but in its current Early Access state, it’s nowhere near there. Even at $2, I’d say pass. Oh, and character creation? Pretty lackluster.\n\nP.S  their discord mod thinks he is royalty in his own kingdom. Condescending and really a bad show for their team. Horrible. Game is made to be played as somewhat large parties, but there's no playerbase.",
      "voted_up": false,
      "votes_helpful": 77
    }
  ]
}